Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/ios/plugins_for_ios.po
Languages: fr, zh_cn

source: Plugins for iOS
fr: Plugins pour iOS
zh_cn: iOS的插件

source: At the moment Godot provides StoreKit, GameCenter, iCloud services plugins. They are using same model of asynchronous calls explained below.
fr: Pour le moment, Godot fournit les plugins de services StoreKit, GameCenter, iCloud. Ils utilisent le même modèle d'appels asynchrones expliqué ci-dessous.

source: ARKit and Camera access are also provided as plugins.
fr: Les accès ARKit et Camera sont également fournis sous forme de plugins.
zh_cn: ARKit和Camera访问也作为插件提供.

source: Accessing plugin singletons
fr: Accéder aux singletons de plug-in
zh_cn: 访问插件单例

source: To access plugin functionality, you first need to check that the plugin is exported and available by calling the `Engine.has_singleton()` function, which returns a registered singleton.
fr: Pour accéder aux fonctionnalités du plugin, vous devez d'abord vérifier que le plugin est exporté et disponible en appelant la fonction `Engine.has_singleton()`, qui renvoie un singleton enregistré.
zh_cn: 要访问插件功能, 首先需要通过调用 `Engine.has_singleton()` 函数来检查插件是否导出并可用, 该函数会返回一个注册的单例.

source: Here's an example of how to do this in GDScript:
fr: Voici un exemple de la façon de procéder dans GDScript :
zh_cn: 下面是一个如何在GDScript中做到这一点的例子:

source: Asynchronous methods
fr: Méthodes asynchrones
zh_cn: 异步方法

source: When requesting an asynchronous operation, the method will look like this:
fr: Lors de la demande d'une opération asynchrone, la méthode ressemblera à ceci :
zh_cn: 请求异步操作时, 方法如下所示:

source: The parameter will usually be a Dictionary, with the information necessary to make the request, and the call will have two phases. First, the method will immediately return an Error value. If the Error is not 'OK', the call operation is completed, with an error probably caused locally (no internet connection, API incorrectly configured, etc). If the error value is 'OK', a response event will be produced and added to the 'pending events' queue. Example:
fr: Le paramètre sera généralement un Dictionnaire, avec les informations nécessaires pour faire la requête, et l'appel aura deux phases. Tout d'abord, la méthode retournera immédiatement une valeur d'erreur. Si l'erreur n'est pas 'OK', l'opération d'appel est terminée, avec une erreur probablement causée localement (pas de connexion internet, API mal configurée, etc). Si la valeur d'erreur est 'OK', un événement de réponse est produit et ajouté à la file d'attente des 'pending events'. Exemple :
zh_cn: 参数通常是一个字典, 包含发出请求所需的信息, 并且调用将有两个阶段. 首先, 该方法将立即返回Error值. 如果错误不是 ``OK``, 则调用操作完成, 可能在本地引起错误(没有Internet连接,API配置不正确等). 如果错误值为 ``OK``, 则会生成响应事件并将其添加到 ``挂起事件`` 队列中. 例:

source: Remember that when a call returns OK, the API will *always* produce an event through the pending_event interface, even if it's an error, or a network timeout, etc. You should be able to, for example, safely block the interface waiting for a reply from the server. If any of the APIs don't behave this way it should be treated as a bug.
fr: N'oubliez pas que lorsqu'un appel renvoie OK, l'API produira *toujours* un événement via l'interface pending_event, même s'il s'agit d'une erreur, ou d'un dépassement de temps du réseau, etc. Vous devriez pouvoir, par exemple, bloquer en toute sécurité l'interface en attente d'une réponse du serveur. Si l'une des API ne se comporte pas de cette manière, cela doit être traité comme un bogue.
zh_cn: 请记住, 当一个调用返回OK时,API将 *始终* 通过pending_event接口产生一个事件, 即使它是一个错误, 或网络超时等. 您应该能够, 例如, 安全地阻止等待的接口 来自服务器的回复. 如果任何API不以这种方式运行, 则应将其视为错误.

source: The pending event interface consists of two methods:
fr: L'interface des événements en attente se compose de deux méthodes :
zh_cn: 挂起事件接口包含两个方法:

source: ``get_pending_event_count()`` Returns the number of pending events on the queue.
fr: ``get_pending_event_count()`` Renvoie le nombre d'événements en attente dans la file d'attente.
zh_cn: ``get_pending_event_count()`` 返回队列中挂起事件的数量.

source: ``Variant pop_pending_event()`` Pops the first event from the queue and returns it.
fr: ``Variant pop_pending_event()`` Extrait(pops) le premier événement de la file d'attente et le renvoie.
zh_cn: ``Variant pop_pending_event()``弹出队列中的第一个事件并返回它.

source: Store Kit
fr: Kit de magasin
zh_cn: 商店套件

source: Implemented in `Godot iOS InAppStore plugin <https://github.com/godotengine/godot-ios-plugins/blob/master/plugins/inappstore/in_app_store.mm>`_.
fr: Implémenté dans le plugin `Godot iOS InAppStore plugin <https://github.com/godotengine/godot-ios-plugins/blob/master/plugins/inappstore/in_app_store.mm>`_.
zh_cn: 实现在 `Godot iOS InAppStore 插件 <https://github.com/godotengine/godot-ios-plugins/blob/master/plugins/inappstore/in_app_store.mm>`_ .

source: The Store Kit API is accessible through the ``InAppStore`` singleton. It is initialized automatically.
fr: L'API du Store Kit est accessible par le singleton ``InAppStore``. Il est initialisé automatiquement.
zh_cn: Store Kit API可通过 ``InAppStore`` 单例访问. 它是自动初始化的.

source: and the pending_event interface
fr: et l'interface pending_event

source: purchase
fr: acheter

source: Purchases a product id through the Store Kit API.
fr: Achète un identifiant de produit par l'intermédiaire de l'API du kit de magasin.

source: Parameters
fr: Paramètres
zh_cn: 参数

source: Takes a Dictionary as a parameter, with one field, ``product_id``, a string with your product id. Example:
fr: Prend un dictionnaire comme paramètre, avec un champ, ``product_id``, une chaîne de caractère(string) avec votre identifiant de produit. Exemple :

source: Response event
fr: Événement de réponse
zh_cn: 响应事件

source: The response event will be a dictionary with the following fields:
fr: L'événement de réponse sera un dictionnaire avec les champs suivants :
zh_cn: 响应事件将是包含以下字段的字典:

source: On error:
fr: En cas d'erreur :
zh_cn: 出错:

source: On success:
fr: En cas de succès :
zh_cn: 成功时:

source: Requests the product info on a list of product IDs.
fr: Demande l'information sur le produit dans une liste d'identifiants de produits.
zh_cn: 在产品ID列表中请求产品信息.

source: Takes a Dictionary as a parameter, with one field, ``product_ids``, a string array with a list of product ids. Example:
fr: Prend un dictionnaire comme paramètre, avec un champ, ``product_ids``, un tableau de chaînes de caractères avec une liste d'identifiants de produits. Exemple :

source: Restores previously made purchases on user's account. This will create response events for each previously purchased product id.
fr: Restaure les achats effectués précédemment sur le compte de l'utilisateur. Cela créera des événements de réponse pour chaque identifiant de produit acheté précédemment.

source: The response events will be dictionaries with the following fields:
fr: Les événements de réponse seront des dictionnaires avec les champs suivants :
zh_cn: 响应事件将是包含以下字段的字典:

source: Implemented in `Godot iOS GameCenter plugin <https://github.com/godotengine/godot-ios-plugins/blob/master/plugins/gamecenter/game_center.mm>`_.
fr: Implémenté dans `le plugin Godot iOS GameCenter <https://github.com/godotengine/godot-ios-plugins/blob/master/plugins/gamecenter/game_center.mm>`_.
zh_cn: 实现在 `Godot iOS GameCenter 插件 <https://github.com/godotengine/godot-ios-plugins/blob/master/plugins/gamecenter/game_center.mm>`_ .

source: The Game Center API is available through the ``GameCenter`` singleton. It has the following methods:
fr: L'API Game Center est disponible via le singleton ``GameCenter``. Il possède les méthodes suivantes :

source: plus the standard pending event interface.
fr: plus l'interface standard d'événement en attente.

source: authenticate
fr: authentifier

source: Authenticates a user in Game Center.
fr: Authentifie un utilisateur dans le Game Center.
zh_cn: 在游戏中心对用户进行身份验证.

source: Posts a score to a Game Center leaderboard.
fr: Affiche un score dans le classement du Game Center.
zh_cn: 将分数发布到游戏中心排行榜.

source: Takes a Dictionary as a parameter, with two fields:
fr: Prend un dictionnaire comme paramètre, avec deux champs :
zh_cn: 将Dictionary作为参数, 包含两个字段:

source: ``score`` a float number
fr: Le ``score`` est un nombre flottant
zh_cn: ``得分`` 浮点数

source: ``category`` a string with the category name
fr: ``category`` une chaîne de caractères avec le nom de la catégorie
zh_cn: ``category`` 一个带有类别名称的字符串

source: Example:
fr: Exemple :
zh_cn: 示例:

source: Modifies the progress of a Game Center achievement.
fr: Modifie la progression d'un achèvement du Game Center.
zh_cn: 修改游戏中心成就的进度.

source: Takes a Dictionary as a parameter, with 3 fields:
fr: Prend un dictionnaire comme paramètre, avec 3 champs :
zh_cn: 将Dictionary作为参数, 包含3个字段:

source: ``name`` (string) the achievement name
fr: ``name`` (chaîne de caractères) le nom de l'achèvement
zh_cn: ``name``(字符串)成就名称

source: ``progress`` (float) the achievement progress from 0.0 to 100.0 (passed to ``GKAchievement::percentComplete``)
fr: ``progress`` (float) de l'avancement de l'achèvement de 0,0 à 100,0 (passée à ``GKAchievement::percentComplete``)
zh_cn: ``progress``(浮动)成就进度从0.0到100.0(传递给``GKAchievement :: percentComplete``)

source: ``show_completion_banner`` (bool) whether Game Center should display an achievement banner at the top of the screen
fr: ``show_completion_banner`` (bool) si le Game Center doit afficher une bannière d'achèvement en haut de l'écran
zh_cn: ``show_completion_banner``(bool)游戏中心是否应该在屏幕顶部显示成就横幅

source: Clears all Game Center achievements. The function takes no parameters.
fr: Efface tous les achèvements du Game Center. La fonction ne prend aucun paramètre.
zh_cn: 清除所有Game Center成就. 该函数不带参数.

source: Request all the Game Center achievements the player has made progress on. The function takes no parameters.
fr: Demandez tous les achèvements du Game Center sur lesquelles le joueur a progressé. La fonction ne prend aucun paramètre.
zh_cn: 请求游戏角色取得进步的所有游戏中心成就. 该函数不带参数.

source: Request the descriptions of all existing Game Center achievements regardless of progress. The function takes no parameters.
fr: Demandez la description de toutes les achèvements du Game Center, quel que soit le progrès réalisé. La fonction ne prend aucun paramètre.
zh_cn: 无论进度如何, 都要求描述所有现有的Game Center成就. 该函数不带参数.

source: Displays the built in Game Center overlay showing leaderboards, achievements, and challenges.
fr: Affiche la superposition intégrée du Game Center montrant les classements, les achèvements et les défis.
zh_cn: 显示内置的游戏中心叠加层, 显示排行榜, 成就和挑战.

source: ``view`` (string) (optional) the name of the view to present. Accepts "default", "leaderboards", "achievements", or "challenges". Defaults to "default".
fr: ``view`` (chaîne de caractère) (facultatif) le nom de la vue à présenter. Accepte "default", "leaderboards", "achievements" ou "challenges". La valeur par défaut est "default".
zh_cn: ``view``(string)(可选)要呈现的视图的名称. 接受 ``默认``, ``排行榜``, ``成就`` 或 ``挑战``. 默认为 ``默认``.

source: ``leaderboard_name`` (string) (optional) the name of the leaderboard to present. Only used when "view" is "leaderboards" (or "default" is configured to show leaderboards). If not specified, Game Center will display the aggregate leaderboard.
fr: ``leaderboard_name`` (chaîne de caractère) (optionnel) le nom du classement à présenter. Utilisé uniquement lorsque "view" est "leaderboards" (ou "default" est configuré pour afficher les classements). S'il n'est pas spécifié, le Game Center affichera le classement global.
zh_cn: ``leaderboard_name`` (字符串)(可选)要显示的排行榜的名称. 仅在 ``视图`` 为 ``排行榜`` (或 ``默认`` 配置为显示排行榜)时使用. 如果未指定,Game Center将显示聚合排行榜.

source: Examples:
fr: Exemples :
zh_cn: 示例:

source: On close:
fr: En clôture :
zh_cn: 关闭时:

source: Godot provides StoreKit, GameCenter, iCloud services and other plugins. They are using same model of asynchronous calls explained below.
zh_cn: Godot 提供了 StoreKit、GameCenter、iCloud 服务等插件。它们使用下面解释的相同异步调用模型。

source: Latest updates, documentation and source code can be found at `Godot iOS plugins repository <https://github.com/godotengine/godot-ios-plugins>`_
zh_cn: 最新的更新、文档和源代码可以在Godot iOS插件库找到 `Godot iOS plugins repository <https://github.com/godotengine/godot-ios-plugins>`_

source: Game Center
zh_cn: 游戏中心

source: Multi-platform games
zh_cn: 多平台游戏

source: When working on a multi-platform game, you won't always have the "GameCenter" singleton available (for example when running on PC or Android). Because the gdscript compiler looks up the singletons at compile time, you can't just query the singletons to see and use what you need inside a conditional block, you need to also define them as valid identifiers (local variable or class member). This is an example of how to work around this in a class:
zh_cn: 在开发多平台游戏时，您不会总是使用``GameCenter``单例(例如在PC或Android上运行时)。 因为gdscript编译器在编译时查找单例，所以不能只查询单例以查看和使用条件块中需要的内容，还需要将它们定义为有效标识符(局部变量或类成员)。 这是一个如何在类中解决此问题的示例:
