Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/making_main_screen_plugins.po
Languages: es, fr, ja, zh_cn

source: Making main screen plugins
es: Creando plugins para pantalla principal
fr: Création de plugins pour l'écran principal
ja: メイン画面プラグイン(Main screen plugin)の作成

source: What this tutorial covers
es: Qué cubre este tutorial
fr: Ce que couvre ce tutoriel
ja: このチュートリアルの対象

source: As seen in the :ref:`doc_making_plugins` page, making a basic plugin that extends the editor is fairly easy. This plugin mechanism also allows you to create new UIs in the central part of the editor, similarly to the basic 2D, 3D, Script and AssetLib views. Such editor plugins are referred as "Main screen plugins".
fr: Comme on le voit dans la page :ref:`doc_making_plugins`, réaliser un plugin de base qui étend l'éditeur est assez facile. Ce mécanisme de plugin vous permet également de créer de nouvelles interfaces utilisateur dans la partie centrale de l'éditeur, de la même manière que les vues de base en 2D, 3D, Script et AssetLib. Ces plugins d'éditeur sont appelés "Main screen plugins".
ja: :ref:`doc_making_plugins` ページに見られるように、エディタを拡張する基本的なプラグインを作成するのはかなり簡単です。このプラグインメカニズムにより、基本的な2D、3D、スクリプト、AssetLibビューと同様に、エディタの中央部分に新しいUIを作成することもできます。このようなエディタプラグインは、「メイン画面プラグイン」と呼ばれます。

source: This tutorial leads you through the creation of a basic main screen plugin. With this plugin example, we want to demonstrate:
fr: Ce tutoriel vous guide à travers la création d'un plugin de base pour l'écran principal. Avec cet exemple de plugin, nous voulons démontrer :
ja: このチュートリアルでは、基本的なメイン画面プラグインの作成について説明します。このプラグインの例を使用して、次のことを示します:

source: Creating a main screen plugin
fr: Création d'un plugin pour l'écran principal
ja: メイン画面プラグインを作成

source: Linking the main screen to another plugin GUI element (such as a Tab panel, similar to the Inspector tab)
fr: Lier l'écran principal à un autre élément de l'interface graphique du plugin (comme un panneau d'onglets, similaire à l'onglet Inspecteur)
ja: メイン画面を別のプラグインGUI要素([インスペクタ]タブに似たタブパネルなど)にリンクする

source: For the sake of simplicity, the two GUI elements of our main screen plugin will both consist in a Label and a Button. Pressing one element's button will display some text on the other's label node.
fr: Par souci de simplicité, les deux éléments de l'interface graphique de notre plugin pour l'écran principal seront tous deux constitués d'un Label et un Button. En appuyant sur le Button d'un élément, on peut afficher du texte sur le nœud Label de l'autre élément.
ja: 簡単にするために、メイン画面プラグインの2つのGUI要素は両方ともラベルとボタンで構成されます。一方の要素のボタンを押すと、他方のラベルノードにテキストが表示されます。

source: Initializing the plugin
es: Inicializando el plugin
fr: Initialisation du plugin
ja: プラグインの初期化

source: The plugin itself is a Godot project. It is best to set its contents in an ``addons/my_plugin_name/`` structure. The only files that lie in the root folder are the project.godot file, and the project icon.
fr: Le plugin lui-même est un projet Godot. Il est préférable de définir son contenu dans une structure ``addons/my_plugin_name/``. Les seuls fichiers qui se trouvent dans le dossier racine sont le fichier project.godot, et l'icône du projet.
ja: プラグイン自体はGodotプロジェクトです。内容を ``addons/my_plugin_name/`` 構造に設定するのが最善です。ルートフォルダにあるファイルは、project.godotファイルとプロジェクトアイコンのみです。

source: In the ``addons/my_plugin_name/`` folder, we create the ``plugin.cfg`` file as described in the :ref:`doc_making_plugins` page.
fr: Dans le dossier ``addons/my_plugin_name/``, nous créons le fichier ``plugin.cfg`` comme décris dans la page :ref:`doc_making_plugins`.
ja: ``addons/my_plugin_name/`` フォルダで、\ :ref:`doc_making_plugins` ページで説明されている ``plugin.cfg`` ファイルを作成します。

source: We also initialize the file targeted by the ``script=`` property of the ``.cfg`` file. In our example, ``main_screen_plugin.gd``.
fr: Nous initialisons le fichier spécifié par la propriétés ``script=`` du fichier ``.cfg``. Dans notre cas, ``main_screen_plugin.gd``.
ja: また、\ ``.cfg`` ファイルの ``script =`` プロパティが対象とするファイルを初期化します。この例では、\ ``main_screen_plugin.gd`` です。

source: The important part in this script is the ``has_main_screen()`` function, which is overloaded so it returns ``true``. This function is automatically called by the editor on plugin activation, to tell it that this plugin adds a new center view to the editor. For now, we'll leave this script as-is and we'll come back to it later.
es: La parte importante de este script es la función ''has_main_screen()'', que está sobrecargada por lo que devuelve ''true''. Esta función es llamada automáticamente por el editor en la activación del plugin, para decirle que este plugin agrega una nueva vista central al editor. Por ahora, dejaremos este script tal cual y volveremos a él más tarde.
fr: La partie importante de ce script est la fonction ``has_main_screen()``, qui est surchargée de sorte qu'elle renvoie ``true``. Cette fonction est automatiquement appelée par l'éditeur lors de l'activation du plugin, pour lui indiquer que ce plugin ajoute une nouvelle vue centrale à l'éditeur. Pour l'instant, nous allons laisser ce script tel quel et nous y reviendrons plus tard.
ja: このスクリプトの重要な部分は ``has_main_screen()`` 関数です。これはオーバーロードされているため ``true`` を返します。この関数は、プラグインのアクティブ化時にエディタによって自動的に呼び出され、このプラグインがエディタに新しいセンタービューを追加することを通知します。とりあえず、このスクリプトはそのままにしておき、後でまた説明します。
zh_cn: 这个脚本中重要的部分是 ``has_main_screen()`` 函数，这个函数是重载的，所以它返回 ``true`` 。这个函数会在插件激活时被编辑器自动调用，告诉它这个插件给编辑器增加了一个新的中心视图。现在，我们暂且把这个脚本保持原样，以后再来讨论它。

source: Scenes
fr: Les scènes
ja: シーン

source: The ``main_screen_plugin.gd`` file will be responsible for each of our plugin's UI element instantiation, and it will also manage the communication between them.
fr: Le fichier ``main_screen_plugin.gd`` sera responsable de l'instanciation de chacun des éléments de l'interface utilisateur de notre plugin, et il gérera également la communication entre eux.
ja: ``main_screen_plugin.gd`` ファイルは、プラグインの各UI要素のインスタンス化を担当し、それらの間の通信も管理します。

source: So, in order to communicate information to another scene, the best design is to define signals. If a user action in a UI scene #1 has to trigger something in another UI scene #2, then this user action has to emit a signal from scene #1, and scene #2 will be connected to that signal. Since all of our UI scenes will be instanced by ``main_screen_plugin.gd`` script, this one script will also connect each of them to the required signals.
fr: Ainsi, afin de communiquer des informations à une autre scène, la meilleure conception est de définir des signaux. Si une action utilisateur dans une scène d'interface utilisateur #1 doit déclencher quelque chose dans une autre scène d'interface utilisateur #2, cette action utilisateur doit émettre un signal à partir de la scène #1, et la scène #2 sera connectée à ce signal. Étant donné que toutes nos scènes d'interface utilisateur seront instanciées par le script ``main_screen_plugin.gd``, ce script connectera également chacune d'entre elles aux signaux requis.
ja: そのため、別のシーンに情報を伝えるための最良の設計は、シグナルを定義することです。UIシーン#1のユーザーアクションが別のUIシーン#2で何かをトリガーする必要がある場合、このユーザーアクションはシーン#1からシグナルを発信する必要があり、シーン#2はそのシグナルに接続されます。すべてのUIシーンは ``main_screen_plugin.gd`` スクリプトによってインスタンス化されるため、この1つのスクリプトはそれぞれのシーンを必要なシグナルに接続します。

source: Not necessarily: this script may add all UI scenes as children of the same node of the editor's scene tree - but maybe it won't. And the ``main_screen_plugin.gd`` script will *not* be the parent node of any instantiated scene because it is a script, not a node! This script will only hold references to instantiated scenes.
fr: Pas nécessairement : ce script peut ajouter toutes les scènes de l'interface utilisateur en tant qu'enfants du même nœud de l'arbre des scènes de l'éditeur - mais peut-être pas. Et le script ``main_screen_plugin.gd`` ne sera *pas* le noeud parent d'une scène instanciée parce que c'est un script, pas un noeud ! Ce script ne contiendra que des références à des scènes instanciées.
ja: 必ずしもそうではありません: このスクリプトは、エディタのシーンツリーの同じノードの子としてすべてのUIシーンを追加する場合がありますが、そうでない場合があります。そして、\ ``main_screen_plugin.gd`` スクリプトは、ノードではなくスクリプトであるため、インスタンス化されたシーンの親ノードではありません！このスクリプトは、インスタンス化されたシーンへの参照のみを保持します。

source: Main screen scene
es: Escena de pantalla inicial
fr: Scène de l'écran principal
ja: メイン画面のシーン

source: Create a new scene with a ``Panel`` root node. Select this root node, and in the viewport, click the ``Layout`` menu and select ``Full Rect``. You also need to enable the ``Expand`` vertical size flag in the inspector. The panel now uses all the space available in the viewport. Now, let's add a new script on the root node. Name it ``main_panel.gd``.
fr: Créer une nouvelle scène avec un noeud racine ``Panel``. Sélectionnez ce nœud racine, et dans la fenêtre d'affichage, cliquez sur le menu ``Layout`` et sélectionnez ``Full Rect``. Vous devez également activer le drapeau de taille verticale ``Expand`` dans l'inspecteur. Le panel utilise désormais tout l'espace disponible dans la fenêtre d'affichage. Maintenant, ajoutons un nouveau script sur le nœud racine. Nommez-le ``main_panel.gd``.
ja: ``Panel`` ルートノードで新しいシーンを作成します。このルートノードを選択し、ビューポートで ``レイアウト`` メニューをクリックし、\ ``Rect全面`` を選択します。また、インスペクタでSize FlagsのVerticalセクション内の ``Expand`` を有効にする必要があります。これで、パネルはビューポートで使用可能なすべてのスペースを使用します。それでは、ルートノードに新しいスクリプトを追加しましょう。 \ ``main_panel.gd`` という名前を付けます。

source: We then add 2 children to this Panel node: first a ``Button`` node. Place it anywhere on the Panel. Then add a ``Label`` node.
fr: Nous ajoutons ensuite 2 enfants à ce nœud Panel : d'abord un nœud ``Button``. Placez-le n'importe où sur le Panel. Ensuite, ajoutez un noeud ``Label``.
ja: 次に、このPanelノードに2つの子を追加します: 最初は ``Button`` ノードです。パネル上の任意の場所に配置します。次に、\ ``Label`` ノードを追加します。

source: Now we need to define a behaviour when this button is pressed. This is covered by the :ref:`Handling a signal <doc_scripting_handling_a_signal>` page, so this part will not be described in details in this tutorial. Select the Button node and click the ``Node`` side dock. Select the ``pressed()`` signal and click the ``Connect`` button (you can also double-click the ``pressed()`` signal instead). In the window that opened, select the Panel node (we will centralize all behaviors in its attached script). Keep the default function name, make sure that the ``Make function`` toggle is ON and hit ``Connect``. This creates an ``_on_Button_pressed()`` function in the ``main_panel.gd`` script, that will be called every time the button is pressed.
fr: Nous devons maintenant définir un comportement lorsque ce bouton est pressé. Ceci est couvert par la page :ref:`Handling a signal <doc_scripting_handling_a_signal>`, cette partie ne sera donc pas décrite en détail dans ce tutoriel. Sélectionnez le nœud Button et cliquez sur le dock latéral ``Node``. Sélectionnez le signal ``pressed()`` et cliquez sur le bouton ``Connect`` (vous pouvez également double-cliquer sur le signal ``pressed()`` à la place). Dans la fenêtre qui s'est ouverte, sélectionnez le nœud Panel (nous centraliserons tous les comportements dans son script). Conservez le nom de la fonction par défaut, assurez-vous que le bouton ``Make function`` est sur ON et appuyez sur ``Connect``. Cela crée une fonction ``_on_Button_pressed()`` dans le script ``main_panel.gd``, qui sera appelée à chaque fois que le bouton est pressé.
ja: 次に、このボタンが押されたときの動作を定義する必要があります。これは :ref:`シグナルの処理 <doc_scripting_handling_a_signal>` ページでカバーされているため、このチュートリアルではこの部分について詳しく説明しません。Buttonノードを選択し、\ ``ノード`` サイドドックをクリックします。\ `` pressed()`` シグナルを選択して ``接続...`` ボタンをクリックします(代わりに ``pressed()`` シグナルをダブルクリックすることもできます)。開いたウィンドウで、Panelノードを選択します(アタッチされたスクリプトですべての動作を一元化します)。デフォルトの関数名を保持し、\ ``関数の作成`` トグルがオンになっていることを確認し、\ ``接続`` を押します。これは ``main_panel.gd`` スクリプトに ``_on_Button_pressed()`` 関数を作成し、ボタンが押されるたびに呼び出されます。

source: As the button gets pressed, we want the side-panel's ``Label`` node to show a specific text. As explained above, we cannot directly access the target scene, so we'll emit a signal instead. The ``main_screen_plugin.gd`` script will then connect this signal to the target scene. Let's continue in the ``main_panel.gd`` script:
fr: Lorsque le bouton est pressé, nous voulons que le nœud``Label`` du panneau latéral affiche un texte spécifique. Comme expliqué ci-dessus, nous ne pouvons pas accéder directement à la scène cible, nous allons donc émettre un signal à la place. Le script ``main_screen_plugin.gd`` va alors connecter ce signal à la scène cible. Continuons dans le script ``main_panel.gd`` :
ja: ボタンが押されると、サイドパネルの ``Label`` ノードに特定のテキストが表示されるようにします。上記で説明したように、ターゲットシーンに直接アクセスすることはできないため、代わりにシグナルを送信します。\ ``main_screen_plugin.gd`` スクリプトは、このシグナルをターゲットシーンに接続します。\ ``main_panel.gd`` スクリプトを続けましょう:

source: In the same way, this main scene's Label node has to show a value when it receives a specific signal. Let's create a new ``_on_side_button_pressed(text_to_show)`` function for this purpose:
fr: De la même manière, le nœud Label de cette scène principale doit afficher une valeur lorsqu'il reçoit un signal spécifique. Créons une nouvelle fonction ``on_side_button_pressed(text_to_show)`` à cet effet :
ja: 同様に、このメインシーンのLabelノードは、特定のシグナルを受信したときに値を表示する必要があります。この目的のために新しい ``_on_side_button_pressed(text_to_show)`` 関数を作成しましょう:

source: We are done for the main screen panel. Save the scene as ``main_panel.tscn``.
fr: Nous avons terminé pour le panneau de l'écran principal. Enregistrez la scène sous le nom de ``main_panel.tscn``.
ja: メイン画面パネルの完成です。シーンを ``main_panel.tscn`` として保存します。

source: Tabbed panel scene
fr: Scène de panneau à onglets
ja: タブ付きパネルシーン

source: The tabbed panel scene is almost identical to the main panel scene. You can either duplicate the ``main_panel.tscn`` file and name the new file ``side_panel.tscn``, or re-create it from a new scene by following the previous section again. However, you will have to create a new script and attach it to the Panel root node. Save it as ``side_panel.gd``. Its content is slightly different, as the signal emitted and the target function have different names. Here is the script's full content:
fr: La scène du panneau à onglets est presque identique à la scène du panneau principal. Vous pouvez soit dupliquer le fichier ``main_panel.tscn`` et nommer le nouveau fichier ``side_panel.tscn``, soit le recréer à partir d'une nouvelle scène en suivant à nouveau la section précédente. Cependant, vous devrez créer un nouveau script et l'attacher au nœud racine Panel. Enregistrez-le sous le nom de ``side_panel.gd``. Son contenu est légèrement différent, car le signal émis et la fonction cible portent des noms différents. Voici le contenu complet du script :
ja: タブ付きパネルシーンは、メインパネルシーンとほぼ同じです。\ ``main_panel.tscn`` ファイルを複製して新しいファイルに ``side_panel.tscn`` という名前を付けるか、前のセクションを再度たどって新しいシーンから再作成できます。ただし、新しいスクリプトを作成して、Panelルートノードにアタッチする必要があります。\ ``side_panel.gd`` として保存します。発信されるシグナルとターゲット関数の名前が異なるため、その内容は少し異なります。スクリプトの完全なコンテンツは次のとおりです:

source: Connecting the two scenes in the plugin script
fr: Connecter les deux scènes dans le script du plugin
ja: プラグインスクリプトで2つのシーンを接続する

source: We now need to update the ``main_screen_plugin.gd`` script so the plugin instances our 2 GUI scenes and places them at the right places in the editor. Here is the full ``main.gd``:
fr: Nous devons maintenant mettre à jour le script ``main_screen_plugin.gd`` afin que le plugin instance nos 2 scènes d'interface graphique et les place aux bons endroits dans l'éditeur. Voici le ``main.gd`` complet :
ja: プラグインが2つのGUIシーンをインスタンス化し、エディタの適切な場所に配置するように、\ ``main_screen_plugin.gd`` スクリプトを更新する必要があります。完全な ``main.gd`` は次のとおりです:

source: A couple of specific lines were added. First, we defined the constants that contain our 2 GUI packed scenes (``MainPanel`` and ``SidePanel``). We will use these resources to instance both scenes.
fr: Quelques lignes spécifiques ont été ajoutées. Tout d'abord, nous avons défini les constantes qui contiennent nos deux scènes d'interface graphique (``MainPanel`` et ``SidePanel``). Nous utiliserons ces ressources pour instancier les deux scènes.
ja: いくつかの特定の行が追加されました。最初に、2つのGUIパックシーン(``MainPanel`` および ``SidePanel``)を含む定数を定義しました。これらのリソースを使用して、両方のシーンをインスタンス化します。

source: The ``_enter_tree()`` function is called before ``_ready()``. This is where we actually instance the 2 GUI scenes, and add them as children of specific parts of the editor. The side panel case is similar to the example shown in :ref:`doc_making_plugins` page: we add the scene in an editor dock. We specified it will be placed in the left-side dock, upper-left tab.
fr: La fonction ``_enter_tree()`` est appelée avant ``_ready()``. C'est là que nous avons intégré les deux scènes d'interface graphique et que nous les avons ajoutées en tant qu'enfants de certaines parties de l'éditeur. Le cas du panneau latéral est similaire à l'exemple présenté dans la page :ref:`doc_making_plugins` : nous ajoutons la scène dans un dock de l'éditeur. Nous avons précisé qu'il serait placé dans le dock de gauche, onglet en haut à gauche.
ja: ``_enter_tree()`` 関数は ``_ready()`` の前に呼び出されます。ここで実際に2つのGUIシーンをインスタンス化し、それらをエディタの特定の部分の子として追加します。サイドパネルの場合は、\ :ref:`doc_making_plugins` ページに示されている例に似ています: シーンをエディタドックに追加します。左側のドック、左上のタブに配置されるように指定しました。

source: ``EditorPlugin`` class does not provide any function to add an element in the main viewport. We thus have to use the ``get_editor_interface().get_editor_viewport()`` to obtain this viewport and add our main panel instance as a child to it. We call the ``make_visible(false)`` function to hide the main panel so it is not directly shown when first activating the plugin.
fr: La classe ``EditorPlugin`` ne fournit aucune fonction pour ajouter un élément dans la fenêtre principale. Nous devons donc utiliser la fonction ``get_editor_interface().get_editor_viewport()`` pour obtenir ce viewport et y ajouter notre instance de panel principal en tant qu'enfant. Nous appelons la fonction ``make_visible(false)`` pour cacher le panneau principal afin qu'il ne soit pas directement affiché lors de la première activation du plugin.
ja: ``EditorPlugin`` クラスは、メインビューポートに要素を追加する機能を提供しません。したがって、このビューポートを取得し、メインパネルインスタンスを子として追加するには、\ ``get_editor_interface().get_editor_viewport()`` を使用する必要があります。メインパネルを隠すために ``make_visible(false)`` 関数を呼び出して、プラグインを最初にアクティブ化したときに直接表示されないようにします。

source: The ``_exit_tree()`` is pretty straightforward. It is automatically called when the plugin is deactivated. It is then important to ``queue_free()`` the elements previously instanced to preserve memory. If you don't, the elements will effectively be invisible in the editor, but they will remain present in the memory. Multiple de-activations/re-activations will then increase memory usage without any way to free it, which is not good.
fr: L'``_exit_tree()`` est assez simple. Il est automatiquement appelé lorsque le plugin est désactivé. Il est alors important de ``queue_free()`` les éléments précédemment instanciés pour préserver la mémoire. Si vous ne le faites pas, les éléments seront effectivement invisibles dans l'éditeur, mais ils resteront présents dans la mémoire. Les désactivations/réactivations multiples augmenteront alors l'utilisation de la mémoire sans aucun moyen de la libérer, ce qui n'est pas bon.
ja: ``_exit_tree()`` はとても簡単です。プラグインが非アクティブ化されると自動的に呼び出されます。メモリを温存するために、以前にインスタンス化された要素を ``queue_free()`` することが重要です。そうしないと、エレメントはエディタで事実上見えなくなりますが、メモリ内には残っています。メモリを解放しない場合、複数の非アクティブ化/再アクティブ化によりメモリ使用量が増加していきますが、これは良くありません。

source: Finally the ``make_visible()`` function is overridden to hide or show the main panel as needed. This function is automatically called by the editor when the user clicks on another main viewport button such as 2D, 3D or Script.
fr: Enfin, la fonction ``make_visible()`` est surchargée pour cacher ou montrer le panneau principal selon les besoins. Cette fonction est automatiquement appelée par l'éditeur lorsque l'utilisateur clique sur un autre bouton de la fenêtre principale comme 2D, 3D ou Script.
ja: 最後に、必要に応じて ``make_visible()`` 関数がオーバーライドされ、メインパネルが非表示または表示されます。この関数は、ユーザーが2D、3D、スクリプトなどの別のメインビューポートボタンをクリックすると、エディタによって自動的に呼び出されます。

source: Try the plugin
es: Prueba el plugin
fr: Essayez le plugin
ja: プラグインを試す

source: Activate the plugin in the Project Settings. You'll observe a new button next to 2D, 3D, Script above the main viewport. You'll also notice a new tab in the left dock. Try to click the buttons in both side and main panels: events are emitted and caught by the corresponding target scene to change the Label caption inside it.
fr: Activez le plugin dans les Paramètres du projet. Vous observerez un nouveau bouton à côté de 2D, 3D, Script au-dessus de la fenêtre principale. Vous remarquerez également un nouvel onglet dans le dock de gauche. Essayez de cliquer sur les boutons des panneaux latéraux et principal : les événements sont émis et captés par la scène cible correspondante pour modifier la légende du Label à l'intérieur de celle-ci.
ja: プロジェクト設定でプラグインを有効にします。メインビューポートの上にある2D、3D、スクリプトの横に新しいボタンがあります。また、左のドックに新しいタブがあります。サイドパネルとメインパネルの両方のボタンをクリックしてみてください。イベントが発生し、対応するターゲットシーンでキャッチされて、その中のラベルキャプションが変更されます。

source: As seen in the :ref:`doc_making_plugins` page, making a basic plugin that extends the editor is fairly easy. Main screen plugins allow you to create new UIs in the central part of the editor, which appear next to the "2D", "3D", "Script", and "AssetLib" buttons. Such editor plugins are referred as "Main screen plugins".
es: Como se ve en la página :ref:'doc_making_plugins', hacer un plugin básico que extienda el editor es bastante fácil. Los plugins de pantalla principal le permiten crear nuevas IU en la parte central del editor, que aparecen junto a los botones "2D", "3D", "Script" y "AssetLib". Tales plugins de edición se conocen como "plugins de pantalla principal".
zh_cn: 正如在 :ref:`doc_making_plugins` 页面中所看到的，制作一个扩展编辑器的基本插件是相当容易的。主屏幕插件允许你在编辑器的中心部分创建新的用户界面，它们出现在 "2D"、"3D"、"脚本 "和 "AssetLib "按钮旁边。这种编辑器插件被称为 "主场景插件"。

source: This tutorial leads you through the creation of a basic main screen plugin. For the sake of simplicity, our main screen plugin will contain a single button that prints text to the console.
es: Este tutorial le guía a través de la creación de un plugin de pantalla principal básico. En aras de la simplicidad, nuestro plugin de pantalla principal contendrá un solo botón que imprime texto en la consola.
zh_cn: 本教程将带领你创建一个基本的主场景插件。为了简单起见，主场景插件将包含一个打印文本到控制台的单个按钮。

source: First create a new plugin from the Plugins menu. For this tutorial, we'll put it in a folder called ``main_screen``, but you can use any name you'd like.
es: Primero crea un nuevo plugin desde el menú Plugins. Para este tutorial, lo pondremos en una carpeta llamada ''main_screen'', pero puedes usar cualquier nombre que quieras.
zh_cn: 首先从Plugins菜单中创建一个新插件。在本教程中，我们将把它放在一个名为 ``main_screen`` 的文件夹中，但你可以使用任何你喜欢的名字。

source: The plugin script will come with ``_enter_tree()`` and ``_exit_tree()`` methods, but for a main screen plugin we need to add a few extra methods. Add five extra methods such that the script looks like this:
es: El script del plugin vendrá con los métodos ''_enter_tree()'' y ''_exit_tree()'', pero para un plugin de pantalla principal necesitamos agregar algunos métodos adicionales. Agregue cinco métodos adicionales de tal manera que el script tenga este aspecto:
zh_cn: 插件脚本会自带 ``_enter_tree()`` 和 ``_exit_tree()`` 方法，但对于主场景插件来说，我们需要添加一些额外的方法。增加五个额外的方法，脚本就像这样:
