Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/making_main_screen_plugins.po
Languages: es, fr, ja, zh_cn

source: Create a new scene with a root node derived from ``Control`` (for this example plugin, we'll make the root node a ``CenterContainer``). Select this root node, and in the viewport, click the ``Layout`` menu and select ``Full Rect``. You also need to enable the ``Expand`` vertical size flag in the inspector. The panel now uses all the space available in the main viewport.
es: Cree una nueva escena con un nodo raíz derivado de ''Control'' (para este plugin de ejemplo, haremos que el nodo raíz sea un ''CenterContainer''). Seleccione este nodo raíz, y en el Viewport, haga clic en el menú ''Layout'' y seleccione ''Completo''. También debe habilitar el indicador de tamaño vertical ''Expandir'' en el inspector. El panel ahora utiliza todo el espacio disponible en la ventana gráfica principal.
zh_cn: 创建一个新的场景，其根节点由``Control``派生而来（在本例插件中，我们将使根节点为``CenterContainer``）。选择这个根节点，在视口中，点击```Layout```菜单，选择``Full Rect``。你还需要在检查器中启用``Expand``垂直尺寸标志。面板现在使用主视口中的所有可用空间。

source: Next, let's add a button to our example main screen plugin. Add a ``Button`` node, and set the text to "Print Hello" or similar. Add a script to the button like this:
es: A continuación, agreguemos un botón a nuestro complemento de pantalla principal de ejemplo. Agregue un nodo ``Botón`` y establezca el texto en "Imprimir Hola" o similar. Agregue un script al botón como este:
zh_cn: 接下来，让我们为我们的主屏幕插件示例添加一个按钮。添加一个``Button``节点，并将文本设置为 "Print Hello "或类似的内容。给按钮添加一个脚本，像这样：

source: Then connect the "pressed" signal to itself. If you need help with signals, see the :ref:`doc_signals` article.
es: Luego conecte la señal "presionada" a sí misma. Si necesita ayuda con las señales, consulte el artículo :ref:`doc_signals`.
zh_cn: 然后将 "按下 "信号连接到自身。如果你需要信号方面的帮助，请参考:ref:`doc_signals`一文。

source: We are done with the main screen panel. Save the scene as ``main_panel.tscn``.
es: Hemos terminado con el panel de la pantalla principal. Guarde la escena como ``main_panel.tscn``.
zh_cn: 我们完成了主屏幕面板。将场景保存为``main_panel.tscn``。

source: Update the plugin script
es: Actualizar el complemento de script (secuencia de comandos)

source: We need to update the ``main_screen_plugin.gd`` script so the plugin instances our main panel scene and places it where it needs to be. Here is the full plugin script:
es: Necesitamos actualizar el script `` main_screen_plugin.gd '' para que el complemento instale nuestra escena del panel principal y la coloque donde debe estar. Aquí está el script del complemento completo:
zh_cn: 我们需要更新 ``main_screen_plugin.gd `` 脚本，因此插件实例是我们的主面板场景，并将其放置在需要的位置。这是完整的插件脚本：

source: A couple of specific lines were added. ``MainPanel`` is a constant that holds a reference to the scene, and we instance it into `main_panel_instance`.
es: Se agregaron un par de líneas específicas. `` MainPanel`` es una constante que contiene una referencia a la escena, y la instanciamos en `main_panel_instance`.
zh_cn: 增加了几行具体的内容。``MainPanel``是一个常量，持有对场景的引用，我们将其实例化为`main_panel_instance`。

source: The ``_enter_tree()`` function is called before ``_ready()``. This is where we instance the main panel scene, and add them as children of specific parts of the editor. We use ``get_editor_interface().get_editor_viewport()`` to obtain the viewport and add our main panel instance as a child to it. We call the ``make_visible(false)`` function to hide the main panel so it doesn't compete for space when first activating the plugin.
es: La función `` _enter_tree () '' se llama antes que `` _ready () ''. Aquí es donde instanciamos la escena del panel principal y los agregamos como elementos secundarios de partes específicas del editor. Usamos `` get_editor_interface (). Get_editor_viewport () '' para obtener la ventana gráfica y agregarle nuestra instancia del panel principal como un niño. Llamamos a la función `` make_visible (false) '' para ocultar el panel principal para que no compita por el espacio cuando se activa por primera vez el complemento.
zh_cn: ``_enter_tree()`` 函数在 ``_ready()`` 之前被调用。这是实例化主面板场景的地方，并将其添加为编辑器特定部分的子节点。使用 ``get_editor_interface().get_editor_viewport()`` 来获取视窗，并将主面板实例作为子节点加入其中。调用 ``make_visible(false)`` 函数来隐藏主面板，这样在第一次激活插件时就不会占用空间。

source: The ``_exit_tree()`` function is called when the plugin is deactivated. If the main screen still exists, we call ``queue_free()`` to free the instance and remove it from memory.
es: La función `` _exit_tree () '' se llama cuando el complemento está desactivado. Si la pantalla principal aún existe, llamamos a `` queue_free () '' para liberar la instancia y eliminarla de la memoria.
zh_cn: 当插件停用时，调用``_exit_tree()``函数。如果主屏幕仍然存在，我们调用``queue_free()``来释放实例，并将其从内存中移除。

source: The ``make_visible()`` function is overridden to hide or show the main panel as needed. This function is automatically called by the editor when the user clicks on the main viewport buttons at the top of the editor.
es: La función `` make_visible () '' se anula para ocultar o mostrar el panel principal según sea necesario. El editor llama automáticamente a esta función cuando el usuario hace clic en los botones de la ventana principal en la parte superior del editor.
zh_cn: ``make_visible()``函数被重写，以根据需要隐藏或显示主面板。当用户点击编辑器顶部的主视口按钮时，编辑器会自动调用该函数。

source: The ``get_plugin_name()`` and ``get_plugin_icon()`` functions control the displayed name and icon for the plugin's main viewport button.
es: Las funciones `` get_plugin_name () '' y `` get_plugin_icon () '' controlan el nombre y el icono mostrados para el botón de la ventana principal del complemento.
zh_cn: ``get_plugin_name()``和``get_plugin_icon()``函数控制插件主视口按钮的显示名称和图标。

source: Another function you can add is the ``handles()`` function, which allows you to handle a node type, automatically focusing the main screen when the type is selected. This is similar to how clicking on a 3D node will automatically switch to the 3D viewport.
es: Otra función que puede agregar es la función `` handle () '', que le permite manejar un tipo de nodo, enfocando automáticamente la pantalla principal cuando se selecciona el tipo. Esto es similar a cómo al hacer clic en un nodo 3D se cambiará automáticamente a la ventana gráfica 3D.
zh_cn: 另一个你可以添加的函数是``handles()``函数，它允许你处理一个节点类型，当选择该类型时自动聚焦主屏幕。这类似于点击一个3D节点会自动切换到3D视口。

source: Activate the plugin in the Project Settings. You'll observe a new button next to 2D, 3D, Script above the main viewport. Clicking it will take you to your new main screen plugin, and the button in the middle will print text.
es: Active el complemento en la Configuración del proyecto. Observará un nuevo botón junto a 2D, 3D, Script encima de la ventana principal. Al hacer clic en él, accederá a su nuevo complemento de la pantalla principal y el botón del medio imprimirá el texto.
zh_cn: 在项目设置中激活插件。你会观察到主视口上方的2D、3D、脚本旁边有一个新的按钮。点击它将带你进入新的主屏幕插件，中间的按钮将打印文本。

source: If you would like to try a finished version of this plugin, check out the plugin demos here: https://github.com/godotengine/godot-demo-projects/tree/master/plugins
es: Si quieres probar la versión terminada de este plugin, revisa las demos de plugins aquí: https://github.com/godotengine/godot-demo-projects/tree/master/plugins

source: If you would like to see a more complete example of what main screen plugins are capable of, check out the 2.5D demo projects here: https://github.com/godotengine/godot-demo-projects/tree/master/misc/2.5d
es: Si desea ver un ejemplo más completo de lo que son capaces de hacer los complementos de la pantalla principal, consulte los proyectos de demostración 2.5D aquí: https://github.com/godotengine/godot-demo-projects/tree/master/misc/2.5d
zh_cn: 如果你想看一个更完整的例子，了解主屏幕插件的能力，请看这里的2.5D演示项目：https://github.com/godotengine/godot-demo-projects/tree/master/misc/2.5d
