Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/inputs/custom_mouse_cursor.po
Languages: de, fr, ja, ru, zh_cn

source: Customizing the mouse cursor
de: Den Mauszeiger anpassen
fr: Personnalisation du curseur de la souris
ru: Настройка курсора мыши

source: You might want to change the appearance of the mouse cursor in your game in order to suit the overall design. There are two ways to customize the mouse cursor:
de: Möglicherweise möchten Sie das Erscheinungsbild des Mauszeigers in Ihrem Spiel ändern, um es an das Gesamtdesign anzupassen. Es gibt zwei Möglichkeiten, den Mauszeiger anzupassen:
fr: Vous pourriez vouloir changer l'apparence du curseur de la souris dans votre jeu afin de l'adapter au design général. Il y a deux façons de personnaliser le curseur de la souris :
ja: 全体的なデザインに合うように、ゲームのマウスカーソルの外観を変更することができます。マウスカーソルをカスタマイズするには2つの方法があります:
ru: Возможно, вам захочется изменить внешний вид курсора мыши в вашей игре, чтобы он соответствовал общему дизайну. Существует два способа настройки курсора мыши:
zh_cn: 您可能希望更改游戏中鼠标光标的外观，以便适应总体设计。自定义鼠标光标有两种方法:

source: Using project settings
de: Projekteinstellungen verwenden
fr: Utilisation des paramètres du projet
ja: プロジェクト設定を使用する
ru: Используя настройки проекта
zh_cn: 使用项目设置

source: Using a script
de: Verwenden eines Skripts
fr: Utilisation d'un script
ja: スクリプトを使用する
ru: Используя скрипт
zh_cn: 使用脚本

source: Using project settings is a simpler (but more limited) way to customize the mouse cursor. The second way is more customizable, but involves scripting.
de: Die Verwendung von Projekteinstellungen ist eine einfachere (aber eingeschränktere) Möglichkeit, den Mauszeiger anzupassen. Der zweite Weg ist anpassbarer, benötigt jedoch Skripte.
fr: L'utilisation des paramètres de projet est une façon plus simple (mais plus limitée) de personnaliser le curseur de la souris. La deuxième façon est plus personnalisable, mais implique un script.
ja: プロジェクト設定の使用は、マウスカーソルをカスタマイズするためのより簡単な(ただしより制限された)方法です。 2番目の方法はよりカスタマイズ可能ですが、スクリプトを使用します。
ru: Использование настроек проекта - это более простой (но более ограниченный) способ настройки курсора мыши. Второй способ более настраиваемый, но затрагивает создание сценариев.

source: You could display a "software" mouse cursor by hiding the mouse cursor and moving a Sprite to the cursor position in a ``_process`` method, but this will add at least one frame of latency compared to an "hardware" mouse cursor. Therefore, it's recommended to use the approach described here whenever possible.
de: Sie können einen "Software"-Mauszeiger anzeigen, indem Sie den Mauszeiger ausblenden und ein Sprite in einer ``_process``-Methode an die Mausposition bewegen. Dies erzeugt jedoch eine winzige Verzögerung im Vergleich zu einem "Hardware"-Mauszeiger. Daher wird empfohlen, nach Möglichkeit den hier beschriebenen Ansatz zu verwenden.
fr: Vous pouvez afficher un curseur de souris "logiciel" en cachant le curseur de souris et en déplaçant un Sprite à la position du curseur dans une méthode ``_process``, mais cela ajoutera au moins une frame de latence par rapport à un curseur de souris "matériel". Par conséquent, il est recommandé d’utiliser l’approche décrite ici chaque fois que possible.
ru: Вы можете отобразить "программный" курсор мыши, скрыв курсор мыши и переместив Sprite в положение курсора в методе ``_process``, но это добавит по крайней мере один кадр задержки по сравнению с "аппаратным" курсором мыши. Поэтому рекомендуется по возможности использовать описанный здесь подход.

source: If you have to use the "software" approach, consider adding an extrapolation step to better display the actual mouse input.
de: Wenn Sie den "Software"-Ansatz verwenden müssen, sollten Sie einen Extrapolationsschritt hinzufügen, um die tatsächliche Mauseingabe besser anzuzeigen.
fr: Si vous devez utiliser l'approche "logiciel", envisagez d'ajouter une étape d'extrapolation pour mieux afficher l'entrée réelle de la souris.
ru: Если вам нужно использовать "программный" подход, подумайте о добавлении шага экстраполяции, чтобы лучше отобразить фактический ввод мыши.

source: Open project settings, go to Display>Mouse Cursor. You will see Custom Image and Custom Image Hotspot.
de: Öffnen Sie die Projekteinstellungen und gehen Sie zu Anzeige> Mauszeiger. Sie sehen "Benutzerdefiniertes Bild" und "Benutzerdefinierter Hotspot".
fr: Ouvrez les paramètres du projet, allez dans Display>Mouse Cursor. Vous verrez Custom Image et Custom Image Hotspot.
ja: プロジェクト設定を開き、[Display] -> [Mouse Cursor]に移動します。"Custom Image" と "Custom Image Hotspot" が表示されます。
ru: Откройте настройки проекта, перейдите в Display>Mouse Cursor. Вы увидите Custom Image и Custom Image Hotspot.
zh_cn: 打开项目设置，转到 Display>Mouse Cursor。您将看到自定义图像和自定义图像热点。

source: Custom Image is the desired image that you would like to set as the mouse cursor. Custom Hotspot is the point in the image that you would like to use as the cursor's detection point.
de: Benutzerdefiniertes Bild ist das gewünschte Bild, das Sie als Mauszeiger festlegen möchten. Benutzerdefinierter Hotspot ist der Punkt im Bild, den Sie als Erkennungspunkt für den Cursor verwenden möchten.
fr: Custom Image est l'image souhaitée que vous souhaitez définir comme curseur de la souris. Custom Hotspot est le point de l'image que vous souhaitez utiliser comme point de détection du curseur.
ja: カスタムイメージ(Custom Image)は、マウスカーソルとして設定する目的のイメージです。カスタムホットスポット(Custom Hotspot)は、カーソルの検出ポイントとして使用する画像内のポイントです。
ru: Custom Image - это желаемое изображение, которое вы хотите установить в качестве курсора мыши. Custom Hotspot - это точка на изображении, которую вы хотели бы использовать в качестве точки обнаружения курсора.
zh_cn: 自定义图像是希望设置为鼠标光标的图像。自定义热点是图像中的点，您希望将其用作光标的检测点。

source: The custom image **must** be less than 256x256.
de: Das benutzerdefinierte Bild **muss** kleiner als 256x256 sein.
fr: L'image personnalisée **doit** être inférieure à 256x256.
ja: カスタムイメージは256x256未満である\ **必要**\ があります。
ru: Пользовательское изображение **должно** быть меньше 256x256.
zh_cn: 自定义图像 **必须** 小于256x256。

source: Create a Node and attach the following script.
de: Erstellen Sie einen Node und hängen Sie das folgende Skript an.
fr: Créez un nœud et attachez lui le script suivant.
ja: ノードを作成し、次のスクリプトをアタッチします。
ru: Создайте Node и прикрепите следующий скрипт.
zh_cn: 创建一个节点并附加下面的脚本。

source: Check :ref:`Input.set_custom_mouse_cursor() <class_Input_method_set_custom_mouse_cursor>`.
de: Siehe auch :ref:`Input.set_custom_mouse_cursor() <class_Input_method_set_custom_mouse_cursor>`.
fr: Vérifiez :ref:`Input.set_custom_mouse_cursor() <class_Input_method_set_custom_mouse_cursor>`.
ja: :ref:`Input.set_custom_mouse_cursor() <class_Input_method_set_custom_mouse_cursor>` を確認してください。
ru: Проверьте :ref:`Input.set_custom_mouse_cursor() <class_Input_method_set_custom_mouse_cursor>`.

source: Demo project
de: Beispielprojekt
fr: Projet de démonstration
ja: デモプロジェクト
ru: Демо-проект
zh_cn: 演示项目

source: Find out more by studying this demo project: https://github.com/guilhermefelipecgs/custom_hardware_cursor
de: Weitere Details findet man in diesem Beispielprojekt: https://github.com/guilhermefelipecgs/custom_hardware_cursor
fr: Pour en savoir plus, consultez ce projet de démonstration : https://github.com/guilhermefelipecgs/custom_hardware_cursor
ja: さらなる詳細を知るには、このデモプロジェクトを調べてみてください: https://github.com/guilhermefelipecgs/custom_hardware_cursor
ru: Узнайте больше, изучив этот демо-проект: https://github.com/guilhermefelipecgs/custom_hardware_cursor
zh_cn: 通过研究这个演示项目了解更多信息:https://github.com/guilhermefelipecgs/custom_hardware_cursor

source: Cursor list
fr: Liste de curseurs
ja: カーソルリスト
ru: Список курсоров
zh_cn: 光标列表

source: As documented in the :ref:`Input <class_Input>` class (see the **CursorShape** enum), there are multiple mouse cursors you can define. Which ones you want to use depends on your use case.
fr: Comme documenté dans la classe :ref:`Input <class_Input>` (voir l'énumération **CursorShape**), il y a plusieurs curseurs de souris que vous pouvez définir. Le choix de ceux que vous voulez utiliser dépend de votre cas d'utilisation.
ja: :ref:`Input <class_Input>` クラス(**CursorShape** 列挙型を参照)で文書化されているように、定義できるマウスカーソルは複数あります。どちらを使用するかは、ユースケースによって異なります。
ru: Как описано в классе :ref:`Input <class_Input>` (см. перечисление **CursorShape**), существует несколько курсоров мыши, которые вы можете определить. Какие из них вы хотите использовать, зависит от вашего варианта использования.
zh_cn: 正如 :ref:`Input <class_Input>` 类(参见 **CursorShape** enum)中所述，可以定义多个鼠标光标。您想要使用哪一个取决于您的用例。
