Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/inputs/input_examples.po
Languages: ru

source: Input examples
ru: Примеры ввода

source: Introduction
ru: Введение

source: In this tutorial, you'll learn how to use Godot's :ref:`InputEvent <class_InputEvent>` system to capture player input. There are many different types of input your game may use - keyboard, gamepad, mouse, etc. - and many different ways to turn those inputs into actions in your game. This document will show you some of the most common scenarios, which you can use as starting points for your own projects.
ru: В этом уроке вы узнаете, как использовать систему :ref:`InputEvent <class_InputEvent>` Godot для захвата ввода игрока. Существует множество различных типов ввода, которые может использовать ваша игра - клавиатура, геймпад, мышь и т. д. - и множество различных способов превратить эти входные данные в действия в вашей игре. Этот документ покажет вам некоторые из наиболее распространенных сценариев, которые вы можете использовать в качестве отправной точки для своих собственных проектов.

source: For a detailed overview of how Godot's input event system works, see :ref:`doc_inputevent`.
ru: Для получения подробного обзора того, как работает система входных событий Godot, см. :ref:`doc_inputevent`.

source: Events versus polling
ru: Сравнение событий и опроса

source: Sometimes you want your game to respond to a certain input event - pressing the "jump" button, for example. For other situations, you might want something to happen as long as a key is pressed, such as movement. In the first case, you can use the ``_input()`` function, which will be called whenever an input event occurs. In the second case, Godot provides the :ref:`Input <class_Input>` singleton, which you can use to query the state of an input.
ru: Иногда вы хотите, чтобы ваша игра реагировала на определенное входное событие - например, нажатие кнопки "прыжок". В других ситуациях вы можете захотеть, чтобы что-то происходило, пока нажата клавиша, например движение. В первом случае вы можете использовать функцию ``_input()``, которая будет вызываться всякий раз, когда происходит событие ввода. Во втором случае Godot предоставляет синглтон :ref:`Input <class_Input>`, который можно использовать для запроса состояния ввода.

source: Examples:
ru: Примеры:

source: This gives you the flexibility to mix-and-match the type of input processing you do.
ru: Это дает вам гибкость - возможность смешивать и сочетать типы обработки входных данных, которую вы делаете.

source: For the remainder of this tutorial, we'll focus on capturing individual events in ``_input()``.
ru: В оставшейся части этого урока мы сосредоточимся на захвате отдельных событий в ``_input()``.

source: Input events
ru: Входящие события

source: Input events are objects that inherit from :ref:`InputEvent <class_InputEvent>`. Depending on the event type, the object will contain specific properties related to that event. To see what events actually look like, add a Node and attach the following script:
ru: События ввода - это объекты, которые наследуются от :ref:`InputEvent <class_InputEvent>`. В зависимости от типа события объект будет содержать определенные свойства, связанные с этим событием. Чтобы увидеть, как на самом деле выглядят события, добавьте Node и прикрепите следующий скрипт:

source: As you press keys, move the mouse, and perform other inputs, you'll see each event scroll by in the output window. Here's an example of the output:
ru: Когда вы нажимаете клавиши, перемещаете мышь и выполняете другие вводы, вы увидите, как каждое событие прокручивается в окне вывода. Вот пример вывода:

source: As you can see, the results are very different for the different types of input. Key events are even printed as their key symbols. For example, let's consider :ref:`InputEventMouseButton <class_InputEventMouseButton>`. It inherits from the following classes:
ru: Как вы можете видеть, результаты очень различны для разных типов входных данных. Ключевые события даже печатаются как их ключевые символы. Например, рассмотрим :ref:`InputEventMouseButton <class_InputEventMouseButton>`. Он наследуется от следующих классов:

source: :ref:`InputEvent <class_InputEvent>` - the base class for all input events
ru: :ref:`InputEvent <class_InputEvent>` - базовый класс для всех входных событий

source: :ref:`InputEventWithModifiers <class_InputEventWithModifiers>` - adds the ability to check if modifiers are pressed, such as :kbd:`Shift` or :kbd:`Alt`.
ru: :ref:`InputEventWithModifiers <class_InputEventWithModifiers>` - добавляет возможность проверять, нажаты ли модификаторы, такие как :kbd:`Shift` или :kbd:`Alt`.

source: :ref:`InputEventMouse <class_InputEventMouse>` - adds mouse event properties, such as ``position``
ru: :ref:`InputEventMouse <class_InputEventMouse>` - добавляет свойства события мыши, такие как ``position``

source: :ref:`InputEventMouseButton <class_InputEventMouseButton>` - contains the index of the button that was pressed, whether it was a double-click, etc.
ru: :ref:`InputEventMouseButton <class_InputEventMouseButton>` - содержит индекс кнопки, которая была нажата, был ли это двойной щелчок и т. д.

source: It's a good idea to keep the class reference open while you're working with events so you can check the event type's available properties and methods.
ru: Рекомендуется держать ссылку на класс открытой во время работы с событиями, чтобы вы могли проверить доступные свойства и методы типа события.

source: You can encounter errors if you try to access a property on an input type that doesn't contain it - calling ``position`` on ``InputEventKey`` for example. To avoid this, make sure to test the event type first:
ru: Вы можете столкнуться с ошибками, если попытаетесь получить доступ к свойству типа ввода, которое его не содержит , например, вызывая ``position`` на ``InputEventKey``. Чтобы избежать этого, сначала проверьте тип события:

source: The :ref:`InputMap <class_InputMap>` is the most flexible way to handle a variety of inputs. You use this by creating named input *actions*, to which you can assign any number of input events, such as keypresses or mouse clicks. A new Godot project includes a number of default actions already defined. To see them, and to add your own, open Project -> Project Settings and select the InputMap tab:
ru: :ref:`InputMap <class_InputMap>` - это наиболее гибкий способ обработки различных входных данных. Вы используете это, создавая именованные *actions*, которым можно назначить любое количество событий ввода, таких как нажатия клавиш или щелчки мыши. Новый проект Godot включает в себя ряд уже определенных действий по умолчанию. Чтобы увидеть их и добавить свои собственные, откройте Project -> Project Settings и выберите вкладку InputMap:

source: Capturing actions
ru: Захват действий

source: Once you've defined your actions, you can process them in your scripts using ``is_action_pressed()`` and ``is_action_released()`` by passing the name of the action you're looking for:
ru: После того как вы определили свои действия, вы можете обработать их в своих сценариях с помощью ``is_action_pressed()`` и ``is_action_released()``, передав имя искомого действия:

source: Keyboard events
ru: События клавиатуры

source: Keyboard events are captured in :ref:`InputEventKey <class_InputEventKey>`. While it's recommended to use input actions instead, there may be cases where you want to specifically look at key events. For this example, let's check for the :kbd:`T`:
ru: События клавиатуры фиксируются в :ref:`InputEventKey <class_InputEventKey>`. Хотя вместо этого рекомендуется использовать входные действия, могут быть случаи, когда вы хотите специально посмотреть на ключевые события. Например, давайте проверим :kbd:`T`:

source: See :ref:`@GlobalScope_KeyList <enum_@GlobalScope_KeyList>` for a list of scancode constants.
ru: См. :ref:`@GlobalScope_KeyList <enum_@GlobalScope_KeyList>` для получения списка констант сканкода.

source: Keyboard modifiers
ru: Модификаторы клавиатуры

source: Mouse events
ru: События мыши

source: Mouse events stem from the :ref:`InputEventMouse <class_InputEventMouse>` class, and are separated into two types: :ref:`InputEventMouseButton <class_InputEventMouseButton>` and :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`. Note that this means that all mouse events will contain a ``position`` property.
ru: События мыши происходят из класса :ref:`InputEventMouse <class_InputEventMouse>` и разделяются на два типа: :ref:`InputEventMouseButton <class_InputEventMouseButton>` и :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`. Обратите внимание, что это означает, что все события мыши будут содержать свойство ``position``.

source: Mouse buttons
ru: Кнопки мыши

source: Capturing mouse buttons is very similar to handling key events. :ref:`@GlobalScope_ButtonList <enum_@GlobalScope_ButtonList>` contains a list of ``BUTTON_*`` constants for each possible button, which will be reported in the event's ``button_index`` property. Note that the scrollwheel also counts as a button - two buttons, to be precise, with both ``BUTTON_WHEEL_UP`` and ``BUTTON_WHEEL_DOWN`` being separate events.
ru: Захват кнопок мыши очень похож на обработку клавиатурных событий. :ref:`@GlobalScope_ButtonList <enum_@GlobalScope_ButtonList>` содержит список констант ``BUTTON_*`` для каждой возможной кнопки, о которых будет сообщено в свойстве события ``button_index``. Обратите внимание, что колесо прокрутки также считается кнопкой - точнее, двумя кнопками, причем ``BUTTON_WHEEL_UP`` и ``BUTTON_WHEEL_DOWN`` являются отдельными событиями.

source: Mouse motion
ru: Движение мыши

source: :ref:`InputEventMouseMotion <class_InputEventMouseMotion>` events occur whenever the mouse moves. You can find the move's distance with the ``relative`` property.
ru: События :ref:`InputEventMouseMotion <class_InputEventMouseMotion>` происходят всякий раз, когда мышь перемещается. Вы можете найти расстояние перемещения с помощью свойства ``relative``.

source: Here's an example using mouse events to drag-and-drop a :ref:`Sprite <class_Sprite>` node:
ru: Вот пример использования событий мыши для перетаскивания узла :ref:`Sprite <class_Sprite>`:

source: Touch events
ru: Сенсорные события

source: If you are using a touchscreen device, you can generate touch events. :ref:`InputEventScreenTouch <class_InputEventScreenTouch>` is equivalent to a mouse click event, and :ref:`InputEventScreenDrag <class_InputEventScreenDrag>` works much the same as mouse motion.
ru: Если вы используете устройство с сенсорным экраном, вы можете генерировать сенсорные события. :ref:`InputEventScreenTouch <class_InputEventScreenTouch>` эквивалентно событию щелчка мыши, а :ref:`InputEventScreenDrag <class_InputEventScreenDrag>` работает почти так же, как движение мыши.

source: To test your touch events on a non-touchscreen device, open Project Settings and go to the "Input Devices/Pointing" section. Enable "Emulate Touch From Mouse" and your project will interpret mouse clicks and motion as touch events.
ru: Чтобы протестировать сенсорные события на устройстве без сенсорного экрана, откройте Project Settings и перейдите в раздел "Input Devices/Pointing". Включите функцию "Emulate Touch From Mouse", и ваш проект будет интерпретировать щелчки мыши и движение как сенсорные события.
