Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shading/your_first_shader/what_are_shaders.po
Languages: de, es, fr, ja, zh_cn

source: What are shaders?
de: Was sind Shader?
es: ¿Qué son los shaders?
fr: Que sont les shaders ?
ja: シェーダーとは何ですか?

source: So, you have decided to give shaders a try. You have likely heard that they can be used to create interesting effects that run incredibly fast. You have also likely heard that they are terrifying. Both are true.
de: Sie haben sich also entschlossen, Shader auszuprobieren. Sie haben wahrscheinlich gehört, dass sie verwendet werden können, um interessante Effekte zu erzielen, die unglaublich schnell laufen. Sie haben wahrscheinlich auch gehört, dass sie erschreckend sind. Beides ist wahr.
fr: Donc, vous avez décidé d'essayer de créer des shaders. Vous avez probablement entendu qu'ils peuvent être utilisés pour créer des effets intéressants qui s’exécutent incroyablement vite. Vous avez aussi probablement entendu dire qu'ils sont terrifiants. Les deux sont vrais.
ja: そう、シェーダーを試してみることにしました。信じられないほど高速で実行される興味深いエフェクトを作成するために使用できると聞いたことがあるでしょう。また、恐ろしいと聞いたことがあるかもしれません。両方とも真実です。
zh_cn: 你已经决定尝试编写着色器了。你可能已经听说过，它们可用来快速创造非常有趣的效果。可能也听说过它们很可怕。以上两种说法都对。

source: Shaders can be used to create a wide range of effects (in fact everything drawn in a modern rendering engine is done with shaders).
de: Shader können verwendet werden, um eine Vielzahl von Effekten zu erzeugen (tatsächlich wird alles, was in einer modernen Rendering-Engine gezeichnet wird, mit Shadern ausgeführt).
fr: Les shaders peuvent être utilisés pour créer une large gamme d'effets (en fait, tout ce qui est affiché dans un moteur de rendu moderne est fait avec des shaders).
ja: シェーダーを使用して、さまざまな効果を作成できます(実際、最新のレンダリングエンジンで描画される処理はすべてシェーダーで行われます)。
zh_cn: 着色器可以用来创建广泛的效果(事实上，现代渲染引擎中绘制的所有东西都是用着色器绘制的)。

source: Writing shaders can also be very difficult for people unfamiliar with them. Godot tries to make writing shaders a little easier by exposing many useful built-in features and handling some of the lower-level initialization work for you. However, GLSL (the OpenGL Shading Language, which Godot uses) is still unintuitive and restricting, especially for users who are used to GDScript.
de: Das Schreiben von Shadern kann auch für Personen, die mit ihnen nicht vertraut sind, sehr schwierig sein. Godot versucht, das Schreiben von Shadern ein wenig zu vereinfachen, indem es viele nützliche integrierte Funktionen bereitstellt und einige der Initialisierungsarbeiten auf unterster Ebene für Sie erledigt. GLSL (die von Godot verwendete OpenGL Shading Language) ist jedoch immer noch einschränkend und nicht intuitiv, insbesondere für Benutzer, die an GDScript gewöhnt sind.
fr: Écrire des shaders peut être très difficile pour des personnes peu familières avec eux. Godot essaie de rendre l'écriture de shaders un peu plus facile en proposant de nombreuses fonctionnalités intégrées et en s'occupant d'une partie du travail d'initialisation de bas niveau pour vous. Cependant, le GLSL (le langage de shader OpenGL, que Godot utilise) reste peu intuitif et restrictif, en particulier pour les utilisateurs habitués au GDScript.
ja: シェーダーの作成は、それらに不慣れな人々にとっても非常に困難です。 Godotは、多くの便利な組み込みか機能を公開し、いくつかの低レベルの初期化作業を処理することで、シェーダーの作成を少し簡単にすることを試みます。ただし、GLSL(Godotが使用するOpenGLシェーディング言語)は、特にGDScriptに慣れているユーザー向けです。
zh_cn: 对于不熟悉着色器的人来说，编写着色器也是非常困难的。Godot试图通过公开许多有用的内置特性，并为您处理一些较低级别的初始化工作，使编写着色器变得更容易一些。然而，GLSL (OpenGL着色语言，也是Godot使用的)仍然是不直观和受限制的，特别是对于习惯使用GDScript的用户。

source: But what are they?
de: Aber was sind sie?
fr: Mais qu'est-ce que c'est ?
ja: しかし、それは何ですか？
zh_cn: 可是它是什么？

source: Shaders are a special kind of program that runs on Graphics Processing Units (GPUs). Most computers have some sort of GPU, either one integrated into their CPU or discrete (meaning it is a separate hardware component, for example, the typical graphics card). GPUs are especially useful for rendering because they are optimized for running thousands of instructions in parallel.
de: Shader sind eine spezielle Art von Programm, das auf Grafikprozessoren (GPUs) ausgeführt wird. Die meisten Computer verfügen über eine GPU, entweder eine in die CPU integrierte oder eine diskrete (also eine separate Hardwarekomponente, z.B. die typische Grafikkarte). GPUs sind besonders nützlich für das Rendern, da sie für die parallele Ausführung von Tausenden von Anweisungen optimiert sind.
fr: Les shaders sont un type de programme spécial qui s’exécutent par les processeurs graphiques (GPU - Graphics Processing Units). La plupart des ordinateurs ont un GPU, qu'il soit intégré dans leur CPU ou discret (ce qui signifie qu'il est un composant matériel distinct, comme par exemple la carte graphique). Les GPUs sont particulièrement utiles pour le rendu car ils sont optimisés pour exécuter des milliers d'instructions en parallèle.
ja: シェーダーは、グラフィックスプロセッシングユニット(GPU)で実行される特別な種類のプログラムです。ほとんどのコンピューターには、CPUに統合されたGPUまたはディスクリート(つまり、典型的なグラフィックカードなどの別個のハードウェアコンポーネント)のいずれかのGPUがあります。 GPUは、数千の命令を並行して実行するために最適化されているため、レンダリングに特に役立ちます。
zh_cn: 着色器是一种在图形处理单元(GPU)上运行的特殊程序。大多数电脑都有GPU，一个集成到他们的CPU或离散的(这意味着它是一个单独的硬件组件，例如，标准显卡)。GPU对于呈现特别有用，因为它们被优化为并行运行数千条指令。

source: The output of the shader is typically the colored pixels of the object drawn to the viewport. But some shaders allow for specialized outputs (this is especially true for APIs like Vulkan). Shaders operate inside the shader pipeline. The standard process is the vertex -> fragment shader pipeline. The vertex shader is used to decided where each vertex (point in a 3D model, or corner of a Sprite) goes and the fragment shader decides what color individual pixels receive.
de: Die Ausgabe des Shaders sind normalerweise die farbigen Pixel des Objekts, das in das Ansichtsfenster gezeichnet wird. Einige Shader ermöglichen jedoch spezielle Ausgaben (dies gilt insbesondere für APIs wie Vulkan). Shader arbeiten innerhalb der Shader-Pipeline. Der Standardprozess ist die Vertex -> Fragment Shader Pipeline. Der Vertex-Shader wird verwendet, um zu entscheiden, wohin jeder Vertex (Punkt in einem 3D-Modell oder Ecke eines Sprites) geht, und der Fragment-Shader entscheidet, welche Farbe einzelne Pixel erhalten.
es: Por lo general, la salida del shader son los pixels colorados del objeto dibujado en la vista. Sin embargo, algunos shaders permiten salidas especializadas (especialmente con los APIs como Vulkan). Los shaders funcionan dentro el canal de shader. El proceso estandar es el canal de shader «vértice -> frgament». El shader vértive se usa para calcular dónde se ubica cada vértice (un punto en un modelo 3D, or la esquína de un Sprite) y el shader fragment calcula el color de los pixels individuales.
fr: La sortie du shader est généralement les pixels colorés de l'objet dessinés dans la fenêtre d'affichage. Mais certains shaders permettent des sorties spécialisées (ce qui est particulièrement vrai pour les API comme Vulkan). Les shaders opèrent à l'intérieur du pipeline de shaders. Le processus standard est le pipeline vertex -> fragment. Le shader vertex est utilisé pour décider où chaque vertex (point dans un modèle 3D, ou coin d'un Sprite) va et le shader de fragment décide quelle couleur les pixels individuels reçoivent.
ja: シェーダーの出力は通常、ビューポートに描画されたオブジェクトの色付きピクセルです。ただし、一部のシェーダーでは特殊な出力が可能です(これは特にVulkanなどのAPIに当てはまります)。シェーダーは、シェーダーパイプライン内で動作します。標準プロセスは、頂点→フラグメントシェーダーパイプラインです。頂点シェーダーは、各頂点(3Dモデルのポイント、またはスプライトのコーナー)がどこに行くかを決定するために使用され、フラグメントシェーダーは個々のピクセルが受け取る色を決定します。
zh_cn: 着色器的输出通常是绘制到视图端口的对象的彩色像素。但是一些着色器允许特殊的输出(对于像Vulkan这样的应用程序接口尤其如此)。着色器在着色器管道中操作。标准流程是顶点->片段着色器管道。顶点着色器用于决定每个顶点的位置(3D模型中的点，或者精灵的一角)去和片段着色器决定什么颜色个别像素接收。

source: Suppose you want to update all the pixels in a texture to a given color, on the CPU you would write:
de: Angenommen, Sie möchten alle Pixel in einer Textur einer bestimmten Farbe zuweisen, so würde man dies auf der CPU so schreiben:
es: Suponemos que quisieras cambiar todos los pixels de una textura a un color determinado. En el CPU escribirías:
fr: Supposons que vous vouliez changer tous les pixels d’une texture en une couleur donnée, dans le CPU vous écririez :
ja: テクスチャのすべてのピクセルを特定の色に更新する場合、CPUで次のように記述します:
zh_cn: 假设你想要将纹理中的所有像素更新为给定的颜色，你可以在CPU上这样写：

source: In a shader you are given access only to the inside of the loop so what you write looks like this:
de: In einem Shader erhalten Sie nur Zugriff auf das Innere der Schleife. Das, was Sie schreiben, sieht also folgendermaßen aus:
es: En un shader sólo tienes acceso al interior del bucle, por lo tanto lo que escribes es así:
fr: Dans un shader, vous n’avez accès qu’à l’intérieur de la boucle, donc ce que vous écrivez ressemble à cela :
ja: シェーダーでは、ループ内へのアクセスのみが許可されるため、作成する内容は次のようになります:
zh_cn: 在着色器中，你只能访问循环的内部，所以你写的是这样的：

source: You have no control over how this function is called. So you have to design your shaders differently from how you would design programs on the CPU.
de: Sie haben keine Kontrolle darüber, wie diese Funktion aufgerufen wird. Sie müssen Ihre Shader also anders gestalten als Programme auf der CPU.
es: No tienes control sobre como se llama esta función. Por lo tanto hay que crear el shader de manera distinta a la que creas programas en el CPU.
fr: Vous n'avez aucun contrôle sur la manière dont cette fonction est appelée. Vous devez donc concevoir vos shaders différemment de vos programmes pour le CPU.
ja: この関数の呼び出し方法を制御することはできません。したがって、CPUでプログラムを設計する方法とは異なる方法でシェーダーを設計する必要があります。
zh_cn: 您无法控制如何调用此函数。您必须设计不同于在中央处理器上设计程序的着色器。

source: A consequence of the shader pipeline is that you cannot access the results from a previous run of the shader, you cannot access other pixels from the pixel being drawn, and you cannot write outside of the current pixel being drawn. This enables the GPU to execute the shader for different pixels in parallel, as they do not depend on each other. This lack of flexibility is designed to work with the GPU which allows shaders to be incredibly fast.
de: Eine Konsequenz der Shader-Pipeline ist, dass Sie nicht auf die Ergebnisse eines vorherigen Shader-Laufs zugreifen können, nicht auf andere Pixel des gezeichneten Pixels zugreifen können und nicht außerhalb des aktuell gezeichneten Pixels schreiben können. Dadurch kann die GPU den Shader für verschiedene Pixel parallel ausführen, da diese nicht voneinander abhängig sind. Dieser Mangel an Flexibilität wurde für die Arbeit mit der GPU entwickelt, wodurch Shader unglaublich schnell arbeiten können.
es: Una consequencia del pipeline de shaders es que se puede acceder los resultados de ejecuciones anteriores del shader; no se puede acceder otros píxeles desde el que se está dibujando; y no se puede escribir fuera de este píxel. Esto permite que el GPU ejecute al shader para distintos píxeles en paralelo; pues no se depende uno al otro. Esta falta de flexibilidad es diseñado para funcionar con el GPU y permite que los shaders sean rapidíssimos.
fr: Une conséquence du pipeline des shader est que vous ne pouvez pas accéder au résultats des exécutions précédentes du shader, vous ne pouvez pas accéder à d'autres pixels que celui qui est en train d'être dessiné et vous ne pouvez pas écrire en dehors de ce pixel. Cela permet au GPU d’exécuter le shader pour différents pixels en parallèle, étant donné qu'ils ne dépendent pas les uns des autres. Ce manque de flexibilité est conçu pour fonctionner avec le GPU qui permet aux shaders d'être incroyablement rapide.
ja: シェーダーパイプラインの結果は、シェーダーの前回の実行の結果にアクセスできず、描画中のピクセルから他のピクセルにアクセスできず、描画中の現在のピクセルの外側に書き込むことができないことです。これにより、GPUは異なるピクセルのシェーダーを互いに依存しないため、並列に実行できます。この柔軟性の欠如はGPUで動作するように設計されているからで、これによりシェーダーを非常に高速にすることができます。
zh_cn: 着色器管道的一个后果是，您无法访问着色器上次运行的结果，您无法从正在绘制的像素中访问其他像素，而且不能在当前绘制的像素之外编写。这使得GPU能够并行地为不同的像素执行着色器，因为他们彼此不耦合。这种灵活性的缺乏是为GPU的工作设计，使着色器难以置信的快。

source: What can they do
de: Was können Sie machen
es: Lo que pueden hacer
fr: Ce qu'ils peuvent faire
ja: それらでできること
zh_cn: 它能做什么

source: position vertices very fast
de: Eckpunkte sehr schnell positionieren
es: colocar vértices muy rapidamente
fr: positionner les sommets très rapidement
ja: 頂点を非常に高速に配置する
zh_cn: 快速定位顶点

source: compute color very fast
de: Farbe sehr schnell berechnen
es: calcular colores muy rapidamente
fr: calculer les couleurs très rapidement
ja: 色を非常に高速に計算する
zh_cn: 快速计算颜色

source: compute lighting very fast
de: Beleuchtung sehr schnell berechnen
es: calcular la iluminación muy rapidamente
fr: calculer l'éclairage très rapidement
ja: ライティングを非常に高速に計算する
zh_cn: 快速计算光照

source: lots and lots of math
de: viel, viel Mathematik
es: muchíssima matemática
fr: beaucoup, beaucoup de maths
ja: たくさんの演算
zh_cn: 进行大量的数学计算

source: What can't they do
de: Was sie nicht können
es: Lo que no pueden hacer
fr: Ce qu'ils ne peuvent pas faire
ja: それらでできないこと
zh_cn: 它不能做什么

source: draw outside mesh
de: außerhalb des Mesh (Drahtgitters) zeichnen
es: dibujar fuera de una malla
fr: dessiner en dehors des maillages
ja: 外側のメッシュを描画する
zh_cn: 绘制外部网格

source: access other pixels from current pixel (or vertices)
de: auf andere Pixel von aktuellen Pixeln aus (oder Eckpunkten) zugreifen
es: acceder a otros píxeles desde el píxel actual (o vértices)
fr: accéder aux pixels autres que le pixel courant (ou sommets)
ja: 現在のピクセル(または頂点)から他のピクセルにアクセスする
zh_cn: 从当前像素(或顶点)访问其他像素

source: store previous iterations
de: frühere Iterationen speichern
es: guarda iteraciones previas
fr: stocker les itérations précédentes
ja: 以前の繰り返しを保存する
zh_cn: 储存之前的迭代

source: update on the fly (they can, but they need to be compiled)
de: Update während einer Berechnung (sie können, aber sie müssen kompiliert werden)
es: actualizar sobre la marcha (bueno, sí que pueden pero hay que compilarlos antes)
fr: mise à jour à la volée (ils peuvent l'être, mais doivent être compilés)
ja: オンザフライで更新する(可能ですが、コンパイルする必要があります)
zh_cn: 动态更新(可以，但是需要编译)

source: Structure of a shader
de: Struktur eines Shaders
es: Estructura de un shader
fr: Structure d'un shader
ja: シェーダーの構造
zh_cn: 着色器的结构

source: In Godot, shaders are made up of 3 main functions: the ``vertex()`` function, the ``fragment()`` function and the ``light()`` function.
es: En Godot, los shader se componen de tres funciones: la función ``vertex()``, la funcíon ``fragment()`` y la función ``light()``.
fr: Dans Godot, les shaders sont fait de trois fonctions principales : La fonction ``vertex()``, la fonction ``fragment()`` et la fonction ``light()``.
ja: Godotでは、シェーダーは3つの主な関数で構成されています: ``vertex()`` 関数、\ ``fragment()`` 関数、および ``light()`` 関数です。
zh_cn: 在Godot中，着色器由3个主要函数组成:“vertex()”函数，“fragment()”和“light()”函数。

source: The ``vertex()`` function runs over all the vertices in the mesh and sets their positions as well as some other per-vertex variables.
es: La función ``vertex()`` ejecuta todos los vértices en la malla y define la posición y otras variables de los vértices.
fr: La fonction ``vertex()`` s'exécute pour tous les sommets du mesh et définit leur position ainsi que quelques autres variables des sommets.
ja: ``vertex()`` 関数は、メッシュ内のすべての頂点に対して実行され、それらの位置とその他の頂点ごとの変数を設定します。
zh_cn: “vertex()”函数运行在网格中的所有顶点上，并设置它们的位置以及部分其他每个顶点的变量。

source: The ``fragment()`` function runs for every pixel that is covered by the mesh. It uses the variables from the ``vertex()`` function to run. The variables from the ``vertex()`` function are interpolated between the vertices to provide the values for the ``fragment()`` function.
es: La función ``fragment()`` ejecuta por cada píxel que está cubierta por la malla. Usa los variables de la función ``vertex()`` para ejecutar. Los variables de la función ``vertex()`` se interpolan entre los vértices para aportar los valores para la función ``fragment()``.
fr: La fonction ``fragment()`` s'exécute pour tous les pixels couverts par le mesh. Elle utilise les variables provenant de la fonction ``vertex()``. Les variables de la fonction ``vertex()`` sont interpolées entre les sommets pour fournir les valeurs pour la fonction ``fragment()``.
ja: ``fragment()`` 関数は、メッシュで覆われているすべてのピクセルに対して実行されます。\ ``vertex()`` 関数の変数を使用して実行します。\ ``vertex()`` 関数の変数は頂点間で補間され、\ ``fragment()`` 関数の値を提供します。
zh_cn: 函数的作用是:为网格所覆盖的每个像素运行“fragment()”函数。它使用“vertex()”函数中的变量来运行。“vertex()”函数中的变量在顶点之间进行插值，以提供“fragment()”函数的值。

source: The ``light()`` function runs for every pixel and for every light. It takes variables from the ``fragment()`` function and from previous runs of itself.
es: La función ``light()`` ejecuta por cada píxel y cada luz. Toma variables de la función ``fragement()`` y de ejecuciones anteriores de ella misma.
fr: La fonction ``light()`` s'exécute pour chaque pixel et chaque lumière. Elle prends des variables de la fonction ``fragment()`` et de ses exécutions précédentes.
ja: ``light()`` 関数は、すべてのピクセルとすべてのライトに対して実行されます。\ ``fragment()`` 関数とそれ自体の以前の実行から変数を取得します。
zh_cn: “light()”函数用于每个像素和每束光照。它从“fragment()”函数和以前的运行中获取变量。

source: For more information about how shaders operate specifically in Godot, see the :ref:`Shaders <doc_shaders>` doc.
de: Weitere Informationen zur Funktionsweise von Shadern in Godot finden Sie im Dokument :ref:`Shaders <doc_shaders>`.
es: Para más información sobre cómo funcionan los shaders específicamente en Godot, ver :ref:`Shaders <doc_shaders>` doc.
fr: Pour plus d'informations sur comment les shaders fonctionnent dans Godot spécifiquement, regardez la :ref:`Shaders <doc_shaders>` doc.

source: The ``light()`` function won't be run if the ``vertex_lighting`` render mode is enabled, or if **Rendering > Quality > Shading > Force Vertex Shading** is enabled in the Project Settings. (It's enabled by default on mobile platforms.)
fr: La fonction ``light()`` ne sera pas exécutée si le mode de rendu ``vertex_lighting`` est activé, ou si **Rendering > Quality > Shading > Force Vertex Shading** est activé dans les paramètres du projet. (C'est activée par défaut sur les plateformes mobiles.)

source: Technical overview
de: Teilübersicht
es: Reseña técnica
fr: Aperçu technique
ja: 技術概要
zh_cn: 技术概述

source: GPUs are able to render graphics much faster than CPUs for a few reasons, but most notably, because they are able to run calculations massively in parallel. A CPU typically has 4 or 8 cores while a GPU typically has thousands. That means a GPU can do hundreds of tasks at once. GPU architects have exploited this in a way that allows for doing many calculations very quickly, but only when many or all cores are doing the same calculation at once, but with different data.
es: La GPU es capáz de generar gráficos mucho más rapido que la CPU por varios razones, la más notable es que pueden ejecutar cálculos masivamente en paralelo. Por lo general, una CPU tiene 4 o 8 núcleos pero un GPU tiene miles. Eso significa que la GPU puede hacer cientos de tareas a la vez. Los diseñedores han aprovechado de esto de manera que permite hacer muchos cálculos con rapidez, pero solo cuando la mayoría o todos de los núcleos están haciendo el mismo cálculo, pero con datos distintos.
fr: Les GPUs sont capables de rendre des éléments graphiques beaucoup plus rapidement que les CPUs pour diverses raisons, mais surtout parce qu'ils sont capables d'exécuter massivement des calculs en parallèle. Un CPU possède généralement 4 ou 8 cœurs, tandis qu'un GPU en possède généralement des milliers. Cela signifie qu'un GPU peut effectuer des centaines de tâches à la fois. Les concepteurs de GPU ont exploité cette possibilité de manière à pouvoir effectuer de nombreux calculs très rapidement, mais uniquement lorsque plusieurs ou tous les cœurs effectuent le même calcul en même temps, avec des données différentes.
ja: GPUは、いくつかの理由でグラフィックをCPUよりもはるかに高速にレンダリングできますが、最も顕著なのは、計算を大規模に並行して実行できるためです。 CPUには通常4または8コアがあり、GPUには通常数千のコアがあります。 つまり、GPUは一度に数百のタスクを実行できます。GPU の設計者は、多くの計算を非常に迅速に実行できる方法でこれを利用してきましたが、多くのコアまたはすべてのコアが同じ計算を一度に実行しているが、データは異なる場合に限ります。
zh_cn: GPU渲染图形的速度要比CPU快得多，原因如下:但最值得注意的是，它们能够大规模并行运行计算。CPU通常有4或8个内核，而GPU通常有数千个。这意味着GPU可以一次完成数百项任务。GPU架构师已经利用了这种方式，允许快速地进行许多计算，但只有当多个或所有核心同时进行相同的计算时，但数据不同。

source: That is where shaders come in. The GPU will call the shader a bunch of times simultaneously, and then operate on different bits of data (vertices, or pixels). These bunches of data are often called wavefronts. A shader will run the same for every thread in the wavefront. For example, if a given GPU can handle 100 threads per wavefront, a wavefront will run on a 10×10 block of pixels together. It will continue to run for all pixels in that wavefront until they are complete. Accordingly, if you have one pixel slower than the rest (due to excessive branching), the entire block will be slowed down, resulting in massively slower render times.
de: Hier kommen Shader ins Spiel. Die GPU ruft den Shader einige Male gleichzeitig auf und bearbeitet dann verschiedene Datenbits (Eckpunkte oder Pixel). Diese Datenbündel werden oft als Wellenfronten bezeichnet. Ein Shader wird für jeden Thread in der Wellenfront gleich ausgeführt. Wenn eine bestimmte GPU beispielsweise 100 Threads pro Wellenfront verarbeiten kann, wird eine Wellenfront auf einem 10 × 10-Pixelblock zusammen ausgeführt. Es wird weiterhin für alle Pixel in dieser Wellenfront ausgeführt, bis sie vollständig sind. Wenn Sie also ein Pixel langsamer als der Rest ist (aufgrund übermäßiger Verzweigung), wird der gesamte Block verlangsamt, was zu massiv langsameren Renderzeiten führt.
fr: C'est là que les shaders entrent en jeu. Le GPU va appeler le shader plusieurs fois simultanément, puis traiter différents bits de données (sommets, ou pixels). Ces paquets de données sont souvent appelés wavefronts. Un shader fonctionnera de la même manière pour chaque thread du wavefront. Par exemple, si un GPU donné peut gérer 100 threads par wavefront, un wavefront fonctionnera sur un bloc de 10x10 pixels à la fois. Et il continuera à fonctionner pour tous les pixels de ce wavefront jusqu'à ce qu'ils soient achevés. Par conséquent, si vous avez un pixel plus lent que les autres (en raison d'une ramification excessive), l'ensemble du bloc sera ralenti, ce qui se traduira par des temps de rendu massivement plus lents.

source: This is different from CPU-based operations. On a CPU, if you can speed up even one pixel, the entire rendering time will decrease. On a GPU, you have to speed up the entire wavefront to speed up rendering.
fr: Cela diffère des opérations basées sur le CPU. Sur un CPU, si vous pouvez accélérer ne serait-ce qu'un seul pixel, le temps de rendu entier diminuera. Sur un GPU, vous devez accélérer l'ensemble du wavefront pour accélérer le rendu.

source: Introduction
de: Einführung
es: Introducción
ja: はじめに
zh_cn: 简介

source: For more information about how shaders operate specifically in Godot see the :ref:`Shaders <doc_shaders>` doc.
ja: Godotでのシェーダーの具体的な動作方法の詳細については、\ :ref:`Shaders <doc_shaders>` ドキュメントを参照してください。
zh_cn: 有关着色器如果在Godot中工作的更多信息，请参阅 :ref:`着色器 <doc_shaders>`。

source: That is where shaders come in. The GPU will call the shader a bunch of times simultaneously, and then operate on different bits of data (vertices, or pixels). These bunches of data are often called wavefronts. A shader will run the same for every thread in the wavefront. For example, if a given GPU can handle 100 threads per wavefront, a wavefront will run on a 10x10 block of pixels together. And it will continue to run for all pixels in that wavefront until they are complete. Accordingly, if you have one pixel slower than the rest (due to excessive branching), the entire block will be slowed down, resulting in massively slower render times. This is different than CPU based operations, on a CPU if you can speed up even one pixel the entire rendering time will decrease. On a GPU, you have to speed up the entire wavefront to speed up rendering.
zh_cn: 这就是着色器的作用。GPU会同时调用着色器很多次，然后对不同的数据位(顶点或像素)进行操作。这些数据束通常被称为波前。一个着色器将在波前运行相同的每一个线程。例如，如果给定的GPU可以处理每个波前100个线程，波前将一起运行在一个10x10像素块上。它将继续运行在波前的所有像素，直到它们完成。因此，如果你有一个像素比其他像素慢(由于过度分支)，整个区域都会减速，导致渲染时间大大降低。这与基于CPU的操作不同，在CPU上，如果你能加快哪怕一个像素，整个渲染时间都会减少。在GPU上，你必须加速整个波前来加速渲染。
