Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_lights_and_shadows.po
Languages: ru

source: Lastly, there is the variable ``gradient length``. For some smooth shadows it is preferable not to have the shadow start immediately on the object, as this produces a hard edge. The gradient length variable creates a smooth gradient to begin the shadow to reduce the effect of the hard edge.
ru: Наконец, есть переменная ``gradient length``. Для некоторых плавных теней желательно, чтобы тень не начиналась сразу на объекте, так как это дает резкие края. Переменная длины градиента создает плавный градиент для начала тени, чтобы уменьшить эффект резкого края.

source: ``gradient length`` is set to ``0``.
ru: ``gradient length`` установлено значение ``0``.

source: ``gradient length`` is set to ``10``.
ru: Переменной ``gradient length`` установлено значение ``10``.

source: You will need to play around with the options a bit to find settings that suit your project. There is no right solution for everyone, which is why Godot provides so much flexibility. Just keep in mind that the higher ``filter`` set the more expensive the shadows will be.
ru: Вам нужно будет немного поэкспериментировать с параметрами, чтобы найти настройки, подходящие для вашего проекта. Не существует подходящего решения для всех, поэтому Godot обеспечивает такую гибкость. Просто имейте в виду, что чем выше установлен ``фильтр``, тем затратнее будут тени.
