Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_lights_and_shadows.po
Languages: ru

source: 2D lights and shadows
ru: 2D свет и тени

source: Introduction
ru: Введение

source: This tutorial explains how the 2D lighting works in the `lights and shadows <https://github.com/godotengine/godot-demo-projects/tree/master/2d/lights_and_shadows>`_ demo project. It begins with a brief description of the resources used in the final demo and then describes how to make a scene like the demo step by step.
ru: В этом руководстве объясняется, как работает двумерное освещение в демонстрационном проекте `lights and shadows <https://github.com/godotengine/godot-demo-projects/tree/master/2d/lights_and_shadows>`_. Он начинается с краткого описания ресурсов, использованных в финальной демонстрации, а затем шаг за шагом описывает, как создать сцену наподобие демонстрационной.

source: All the resources for this tutorial can be found in the `official demo repository <https://github.com/godotengine/godot-demo-projects>`_ on GitHub. I suggest you download it before starting. Alternatively, it can be downloaded from the Project Manager. Launch Godot and in the top bar select "Templates" and search for "2D Lights and Shadows Demo".
ru: Все ресурсы для этого руководства можно найти в `официальном демонстрационном репозитории <https://github.com/godotengine/godot-demo-projects>`_ на GitHub. Предлагаю вам скачать его перед тем как начать. Кроме того, его можно загрузить из Менеджера проектов. Запустите Godot и в верхней панели выберите «Шаблоны» и выполните поиск «2D Lights and Shadows Demo».

source: Setup
ru: Настройка

source: For this demo we use four textures: two for the lights, one for the shadow casters, and one for the background. I've included links to them all here if you want to download them separately from the demo.
ru: Для этой демонстрации мы используем четыре текстуры: две для источников света, одну для отбрасывания тени и одну для фона. Я включил ссылки на все из них здесь, если вы хотите загрузить их отдельно от демо.

source: The first is the background image (`background.png <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/background.png>`_) used in the demo. You do not necessarily need a background, but we use one for the demo.
ru: Первое — это фоновое изображение (`background.png <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/background.png>`_), используемое в демонстрации. Вам не обязательно нужен фон, но мы используем его для демонстрации.

source: The second is a plain black image (`caster.png <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/caster.png>`_) to use as our shadow caster object. For a top down game this could be a wall or any other object that casts a shadow.
ru: Второе — это обыкновенное черное изображение (`caster.png <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/caster.png>` _) для использования в качестве нашего объекта, отбрасывающего тени. Для игры сверху вниз это может быть стена или любой другой объект, отбрасывающий тень.

source: Next is the light itself (`light.png <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/light.png>`_). If you click the link you will notice how large it is. The image you use for a light should cover the area you want your light to cover. This image is 1024x1024 pixels, so you should use it to cover 1024x1024 pixels in your game.
ru: Далее идет сам свет (`light.png <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/light.png>`_). Если вы нажмете на ссылку, вы заметите, насколько оно велико. Изображение, которое вы используете для освещения, должно охватывать ту область, которую вы хотите осветить. Это изображение имеет размер 1024x1024 пикселей, поэтому вы должны использовать его для покрытия 1024x1024 пикселей в своей игре.

source: Lastly, we have the spotlight image (`spot.png <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/spot.png>`_). The demo uses a blob to show where the light is and the larger light image to show the effect of the light upon the rest of the scene.
ru: Наконец, у нас есть изображение-прожектор (`spot.png <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/spot.png>`_). В демонстрации используется капля, чтобы показать, где находится свет, и более крупное световое изображение, чтобы показать влияние света на остальную часть сцены.

source: Nodes
ru: Узлы (ноды)

source: The demo uses four different nodes:
ru: В демонстрации используются четыре разных узла:

source: :ref:`CanvasModulate<class_CanvasModulate>` is used to darken the scene.
ru: :ref:`CanvasModulate<class_CanvasModulate>` используется для затемнения сцены.

source: :ref:`Sprites <class_Sprite>` are used to display the textures for the light blobs, the background, and for the shadow casters.
ru: :ref:`Спрайты <class_Sprite>` используются для отображения текстур для световых пятен, фона и отбрасывающих тени.

source: :ref:`Light2Ds <class_Light2D>` are used to light the scene. The way a light typically works is by adding a selected texture over the rest of the scene to simulate lighting. But it can be used in other ways, for example masking out parts of the scene.
ru: :ref:`Light2Ds <class_Light2D>` используются для освещения сцены. Обычно свет работает путем добавления выбранной текстуры поверх остальной части сцены для имитации освещения. Но его можно использовать и по-другому, например, для маскировки частей сцены.

source: :ref:`LightOccluder2Ds <class_LightOccluder2D>` are used to tell the shader which parts of the scene cast shadows. The shadows appear only on areas covered by the :ref:`Light2D <class_Light2D>` and their direction is based on the center of the :ref:`Light <class_Light2D>`.
ru: :ref:`LightOccluder2Ds <class_LightOccluder2D>` используются, чтобы сообщить шейдеру, какие части сцены отбрасывают тени. Тени появляются только в областях, покрытых :ref:`Light2D <class_Light2D>`, и их направление зависит от центра :ref:`Light <class_Light2D>`.

source: Lights
ru: Свет

source: :ref:`Lights <class_Light2D>` cover the entire extent of their respective Texture. They use additive blending to add the color of their texture to the scene.
ru: :ref:`Lights <class_Light2D>` покрывают весь размер соответствующей текстуры. Они используют аддитивное смешивание, чтобы добавить цвет своей текстуры к сцене.

source: :ref:`Lights <class_Light2D>` have four ``Modes``: ``Add``, ``Sub``, ``Mix``, and ``Mask``.
ru: :ref:`Lights <class_Light2D>`имеет четыре ``Режима``: ``Add``, ``Sub``, ``Mix``, и ``Mask``.

source: ``Add`` adds the color of the light texture to the scene. It brightens the area under the light.
ru: ``Add`` добавляет к сцене цвет световой текстуры. Осветляет участки под светом.

source: ``Sub`` subtracts the color of the light from the scene. It darkens the area under the light.
ru: ``Sub`` вычитает цвет света из сцены. Он затемняет область под светом.

source: ``Mix`` mixes the color of the light with the underlying scene. The resulting brightness is halfway between the color of the light and the color underneath.
ru: ``Mix`` смешивает цвет света с основной сценой. Результирующая яркость находится посередине между цветом света и цветом под ним.

source: ``Mask`` is used to mask out areas that are covered by the light. Masked out areas are hidden or revealed based on the color of the light.
ru: ``Mask`` используется для маскировки участков, покрытых светом. Скрытые области скрываются или раскрываются в зависимости от цвета света.

source: For the demo the lights have two components, the :ref:`Light <class_Light2D>` itself (which is the effect of the light), and a :ref:`Sprite <class_Sprite>` blob which is an image showing the location of the light source. A child :ref:`Sprite <class_Sprite>` is not necessary to make a :ref:`Light <class_Light2D>` work.
ru: Для демонстрации источники света состоят из двух компонентов : самого :ref:`Light <class_Light2D>` (который является эффектом света) и капли :ref:`Sprite <class_Sprite>`, который является изображением, показывающим расположение источника света. Дочерний элемент :ref:`Sprite <class_Sprite>` не нужен для работы :ref:`Light <class_Light2D>`.

source: Shadows
ru: Тени

source: Shadows are made by intersecting a :ref:`Light <class_Light2D>` with a :ref:`LightOccluder2D <class_LightOccluder2D>`.
ru: Тени создаются путем пересечения :ref:`Light <class_Light2D>` с :ref:`LightOccluder2D <class_LightOccluder2D>`.

source: By default shadows are turned off. To turn them on click on the :ref:`Light <class_Light2D>` and under the Shadows section check ``Enabled``.
ru: По умолчанию тени отключены. Чтобы включить их, щелкните :ref:`Light <class Light2D>` и в разделе Тени отметьте ``Включено``.

source: In the demo we are using a :ref:`Sprite <class_Sprite>` with a Texture on it to make the "Shadow Casters", but in reality all you need is a couple of :ref:`LightOccluder2Ds <class_LightOccluder2D>`. By itself the :ref:`LightOccluder2D <class_LightOccluder2D>` looks like a dark spot and in this demo the :ref:`Sprite <class_Sprite>` is just a black square.
ru: В демонстрации мы используем :ref:`Sprite <class_Sprite>` с текстурой на нем для создания «Отбрасывателей теней», но на самом деле все, что вам нужно, это пара :ref:`LightOccluder2Ds <class_LightOccluder2D>`. Сам по себе :ref:`LightOccluder2D <class_LightOccluder2D>` выглядит как темное пятно, а в этой демонстрации :ref:`Sprite <class_Sprite>` представляет собой просто черный квадрат.

source: Step by step
ru: Шаг за шагом

source: Now that we have covered the basics of the nodes being used, we can now walk step by step through the process of making a scene like the one found in the demo.
ru: Теперь, когда мы рассмотрели основы используемых узлов, мы можем шаг за шагом пройти через процесс создания сцены наподобие той, что была в демонстрации.

source: First add a :ref:`Sprite <class_Sprite>` and set its texture to the `background image <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/background.png>`_. For your game this can be any background you choose. For this style of shadow it is most likely to be a floor texture.
ru: Сначала добавьте :ref:`Sprite <class_Sprite>` и установите его текстуру на `фоновое изображение <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/background.png>`_. Для вашей игры это может быть любой фон на ваш выбор. Для этого стиля тени это, скорее всего, будет текстура пола.

source: Next create three :ref:`Light2D's <class_Light2D>` and set their textures to the `light image <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/light.png>`_. You can alter their color in the top section. By default shadows are turned off and the ``mode`` is set to ``add``. This means that each light adds its own color to whatever is underneath.
ru: Затем создайте три :ref:`Light2D's <class_Light2D>` и установите их текстуры на `светлое изображение <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/light.png>`_.Вы можете изменить их цвет в верхней части. По умолчанию тени отключены, а для параметра ``режим`` установлено значение ``добавить``. Это означает, что каждый свет добавляет свой цвет всему, что находится под ним.

source: Next add a child :ref:`Sprite <class_Sprite>` to each of the :ref:`Light <class_Light2D>` nodes, and set the :ref:`Sprite's <class_Sprite>` texture to the `blob image <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/spot.png>`_. Each of these should stay centered on the :ref:`Light <class_Light2D>` node. The blob is the image of the light itself while the :ref:`Light <class_Light2D>` shows the effect that the light has on the scene. The :ref:`LightOccluder2D's <class_LightOccluder2D>` will treat the position of the light as the center of the :ref:`Light <class_Light2D>` node, which is why we want the blob to be centered on its parent :ref:`Light <class_Light2D>`.
ru: Затем добавьте дочерний элемент :ref:`Sprite <class_Sprite>` к каждому из узлов :ref:`Light <class_Light2D>` и установите текстуру :ref:`Sprite <class_Sprite>` на `изображение капли <https: / /raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/spot.png>`_. Каждый из них должен оставаться в центре узла: ref: `Light <class_Light2D>`. Капля — это изображение самого источника света, а :ref:`Light <class_Light2D>` показывает эффект, который свет оказывает на сцену. Элемент :ref:`LightOccluder2D <class_LightOccluder2D>` будет рассматривать положение источника света как центр узла :ref:`Light <class_Light2D>`, поэтому мы хотим, чтобы капля была центрирована на её родительском элементе :ref:` Свет <class_Light2D> `.

source: The animations in the demo will not be covered here. See :ref:`doc_introduction_animation` for information on creating animations.
ru: Анимации в демонстраци не будутрассматриваться здесь. См. :ref:`doc_introduction_animation` для получения информации о создании анимации.

source: Right now the scene should look too bright. This is because all three lights are adding color to the scene. This is why the demo uses a :ref:`CanvasModulate <class_CanvasModulate>` in the scene. The :ref:`CanvasModulate <class_CanvasModulate>` multiples the entire viewport by a specific color.
ru: Сейчас сцена должна выглядеть слишком яркой. Это потому, что все три источника света добавляют цвет сцене. Вот почему в демонстрации в сцене используется :ref:`CanvasModulate <class_CanvasModulate>`. :ref:`CanvasModulate <class_CanvasModulate>` умножает всю область просмотра на определенный цвет.

source: Add a :ref:`CanvasModulate <class_CanvasModulate>` to the scene and set its color to ``rgb(70, 70, 70)``. This will make the scene sufficiently dark to see the effects of the lights distinctly.
ru: Добавьте в сцену :ref:`CanvasModulate <class_CanvasModulate>` и установите его цвет на ``rgb (70, 70, 70)``. Это сделает сцену достаточно темной, чтобы отчетливо увидеть эффекты света.

source: Now we add the shadow casters.
ru: Теперь мы добавляем отбрасываемые тени.

source: The demo uses a :ref:`Node <class_Node2D>` named "casters" to organize the shadow casters. Add a :ref:`Node2D <class_Node2D>` to the scene. It will be used to group all the shadow casters together. This way we can show and hide them all at the same time.
ru: В демонстрации используется :ref:`Node <class_Node2D>` с именем "casters" для организации теневых отбрасывателей. Добавьте в сцену :ref:`Node2D <class_Node2D>`. Он будет использоваться для группировки всех отбрасывающих теней вместе. Таким образом, мы можем показать и скрыть их все одновременно.

source: Each shadow caster is made of a :ref:`Sprite <class_Sprite>`, with a :ref:`LightOccluder2D <class_LightOccluder2D>` child. For the demo the :ref:`Sprite <class_Sprite>` has a texture set to the `caster image <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/caster.png>`_ and nothing else. The child :ref:`LightOccluder2D <class_LightOccluder2D>` is where all the magic happens. In a game the :ref:`Sprite <class_Sprite>` could be more than a black box; it could be an image of whatever object is casting the shadow: a wall, a magical chest, or anything else.
ru: Каждый отбрасыватель тени состоит из :ref:`Sprite <class_Sprite>` с дочерним элементом :ref:`LightOccluder2D <class_LightOccluder2D>`. Для демонстрации :ref:`Sprite <class_Sprite>` имеет текстуру, установленную на `изображение отбрасывателя <https://raw.githubusercontent.com/godotengine/godot-demo-projects/master/2d/lights_and_shadows/caster.png >`_ и больше ничего. В дочернем элементе :ref:`LightOccluder2D <class_LightOccluder2D>` происходит вся магия. В игре :ref:`Sprite <class_Sprite>` может быть чем-то большим, чем черный ящик; это может быть изображение любого объекта, отбрасывающего тень: стены, волшебного сундука или чего-нибудь еще.

source: :ref:`LightOccluder2Ds <class_LightOccluder2D>` tell the game what shape the occluder has. They hold an :ref:`OccluderPolygon2D <class_OccluderPolygon2D>`, which is a container for a polygon and some other information. For this demo, since our wall is a square, we set ``Polygon`` to a square. The other default settings are fine.
ru: :ref:`LightOccluder2Ds <class_LightOccluder2D>` сообщает игре, какую форму имеет окклюдер. Они содержат :ref:`OccluderPolygon2D <class_OccluderPolygon2D>`, который является контейнером для многоугольника и некоторой другой информации. В этой демонстрации, поскольку наша стена представляет собой квадрат, мы устанавливаем для параметра ``Полигон`` квадрат. Остальные настройки по умолчанию подходят.

source: The first setting, ``Closed`` can be either ``on`` or ``off``. A closed polygon occludes light coming from all directions. An open polygon only occludes light from one direction
ru: Первая настройка ``Замкнутый`` может быть включена или выключена. Замкнутый многоугольник перекрывает свет, идущий со всех сторон. Открытый многоугольник закрывает свет только с одного направления

source: ``Cull Mode`` lets you select which direction gets culled. The default is ``Disabled``, meaning the occluder will cast a shadow no matter which side the light is on. The other two settings ``Clockwise`` and ``Counter-Clockwise`` refer to the winding order of the vertices of the polygon. The winding order is used to determine which side of the line is inside the polygon. Only outward facing lines cast shadows.
ru: ``Режим отбраковки`` позволяет выбрать направление отбраковки. По умолчанию установлено значение ``Отключено``, что означает, что окклюдер будет отбрасывать тень независимо от того, с какой стороны горит свет. Две другие настройки ``По часовой стрелке`` и ``Против часовой стрелки`` относятся к порядку поворота вершин многоугольника. Порядок намотки используется для определения стороны линии внутри многоугольника. Только линии, обращенные наружу, отбрасывают тени.

source: To illustrate the difference, here is an image of a :ref:`LightOccluder2D <class_LightOccluder2D>` with ``Closed`` set to ``off`` in the corresponding :ref:`OccluderPolygon2D <class_OccluderPolygon2D>`, so that the lines of the polygon can be seen:
ru: Чтобы проиллюстрировать разницу, вот изображение :ref:`LightOccluder2D <class_LightOccluder2D>` с параметром ``Замкнутый``, установленным на ``Выключено`` в соответствующем :ref:`OccluderPolygon2D <class_OccluderPolygon2D>`, так что линии многоугольника можно увидеть:

source: ``Cull Mode`` is set to ``Disabled``. All three lines cast shadows.
ru: Для параметра ``Режим отбраковки`` установлено значение ``Отключено``. Все три линии отбрасывают тени.

source: ``Cull Mode`` is set to ``Clockwise``. Only the top and right lines cast shadows.
ru: Для параметра ``Режим отбраковки`` установлено значение ``По часовой стрелке``. Только верхняя и правая линии отбрасывают тени.

source: ``Cull Mode`` is set to ``Counter-Clockwise``. Only the bottom line casts a shadow. If ``Closed`` was set to ``on`` there would be an additional vertical line on the left which would cast a shadow as well.
ru: Для параметра ``Режим отбраковки`` установлено значение ``Против часовой стрелки``. Только нижняя строка отбрасывает тень. Если параметру ``Замкнутый`` установить значение ``Включено``, слева будет дополнительная вертикальная линия, которая также отбрасывает тень.

source: When you have added the :ref:`LightOccluder2Ds <class_LightOccluder2D>` the shadows still won't appear. You need to go back into the :ref:`Light2Ds <class_Light2D>` and under the Shadow section set ``Enable`` to ``on``. This turns on shadows with hard edges like in the image below.
ru: Когда вы добавите :ref:`LightOccluder2Ds <class_LightOccluder2D>`, тени все равно не появятся. Вам нужно вернуться в :ref:`Light2Ds <class_Light2D>` и в разделе «Тень» установить для параметра ``Включено`` значение ``Включено``. Это включает тени с резкими краями, как на изображении ниже.

source: To give the shadows that nice, soft edge look we set the variables ``filter``, ``filter smooth``, and ``gradient length``. Godot supports `Percentage Closer Filtering <https://developer.nvidia.com/gpugems/GPUGems/gpugems_ch11.html>`_ (PCF), which takes multiple samples of the shadow map around a pixel and blurs them to create a smooth shadow effect. The higher the number of samples the smoother the shadow will look, but the slower it will run. That is why Godot provides 3-13 samples by default and allows you to choose. The demo uses PCF7.
ru: Чтобы придать теням приятный вид с мягкими краями, мы устанавливаем переменные ``фильтр``, ``фильтр гладкости`` и ``длина градиента``. Godot поддерживает `Более точная фильтрация в процентах <https://developer.nvidia.com/gpugems/GPUGems/gpugems_ch11.html>`_ (PCF), который берет несколько образцов карты теней вокруг пикселя и размывает их для создания эффекта плавной тени. Чем больше количество образцов, тем более гладкой будет выглядеть тень, но тем медленнее она будет двигаться. Вот почему Godot по умолчанию предоставляет 3-13 образцов и позволяет вам выбирать. В демонстрации используется PCF7.

source: This is a shadow rendered with the demo's settings. ``gradient length`` is set to ``1.3``, ``filter smooth`` is set to ``11.1``, and ``filter`` is set to ``PCF7``.
ru: Это тень, созданная с настройками демонстрации. Параметру ``gradient lenght`` установлено значение ``1.3``, ``filter smooth`` — ``11.1``, а ``filter`` — ``PCF7``.

source: ``filter`` is set to ``PCF13``. Notice how the shadow becomes wider, this is because the distance between samples is based on the variable ``filter smooth``.
ru: Параметру ``filter`` установлено значение ``PCF13``. Обратите внимание, как тень становится шире, это потому, что расстояние между выборками основано на переменной ``filter smooth``.

source: In order to make use of filtering you need to set the ``filter smooth`` variable. This dictates how far apart the samples are. If you want the soft area to extend quite far, you can increase the size of ``filter smooth``. However, with few samples and a large filter smooth, you can see lines forming between the samples.
ru: Чтобы использовать фильтрацию, вам необходимо установить переменную ``фильтр гладкости``. Это определяет, насколько далеко друг от друга находятся образцы. Если вы хотите, чтобы мягкая область простиралась достаточно далеко, вы можете увеличить размер ``фильтр гладкости``. Однако с небольшим количеством образцов и большим фильтром гладкости вы можете увидеть линии, образующиеся между образцами.

source: ``filter smooth`` is set to ``30``.
ru: ``filter smooth`` установлено значение``30``.

source: The different :ref:`Light <class_Light2D>` nodes in the demo use different values for filter smooth. Play around with it and see what you like.
ru: Различные узлы :ref:`Light <class Light2D>` в демонстрации используют разные значения для сглаживания фильтра. Поиграйте с ним и посмотрите, что вам нравится.

source: ``filter smooth`` is set to ``0``.
ru: Переменной ``filter smooth`` установлено значение ``0``.
