Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_movement.po
Languages: fr, zh_cn

source: 2D movement overview
fr: Vue d'ensemble du mouvement 2D
zh_cn: 2D运动概述

source: Introduction
zh_cn: 简介

source: Every beginner has been there: "How do I move my character?" Depending on the style of game you're making, you may have special requirements, but in general the movement in most 2D games is based on a small number of designs.
fr: Tous les débutants se demandent : "Comment déplacer mon personnage ?". Selon le style de jeu que vous réalisez, vous pouvez avoir des exigences particulières, mais en général, les mouvements de la plupart des jeux en 2D sont basés sur un petit nombre de dessins.
zh_cn: 每个初学者都会说:“我如何移动我的游戏角色呢？” 根据您正在制作的游戏风格，您可能有特殊要求，但一般来说，大多数2D游戏的运动都只需要少量的设计。

source: We'll use :ref:`KinematicBody2D <class_KinematicBody2D>` for these examples, but the principles will apply to other node types (Area2D, RigidBody2D) as well.
fr: Nous utiliserons :ref:`KinematicBody2D <class_KinematicBody2D>` pour cet exemple, mais les principes s'appliqueront tout autant aux autres types de nœuds ((Area2D, RigidBody2D).
zh_cn: 对于这些示例，我们将使用 :ref:`KinematicBody2D <class_KinematicBody2D>` ，同时这些原则也适用于其他节点类型(Area2D，RigidBody2D)。

source: Setup
fr: Configuration
zh_cn: 设置

source: Each example below uses the same scene setup. Start with a ``KinematicBody2D`` with two children: ``Sprite`` and ``CollisionShape2D``. You can use the Godot icon ("icon.png") for the Sprite's texture or use any other 2D image you have.
fr: Chaque exemple ci-dessous utilise la même configuration de scène. Commencez avec un ``KinematicBody2D`` avec deux enfants: ``Sprite`` et ``CollisionShape2D``. Vous pouvez utiliser l'icône Godot ("icon.png") pour la texture du Sprite ou utiliser n'importe quelle autre image 2D que vous avez.
zh_cn: 以下每个示例都使用相同的场景设置。 从带有 ``Sprite`` 和 ``CollisionShape2D`` 两个子节点的 ``KinematicBody2D`` 开始。 您可以使用Godot图标(“icon.png”)作为精灵的纹理或使用其他任何2D图像。

source: Open ``Project -> Project Settings`` and select the "Input Map" tab. Add the following input actions (see :ref:`InputEvent <doc_inputevent>` for details):
fr: Ouvrez ``Projet -> Paramètres du projet`` et sélectionnez l'onglet "Plan des entrées". Ajoutez les actions d'entrées suivantes (voir :ref:`InputEvent <doc_inputevent>` pour les détails) :
zh_cn: 打开 ``Project -> Project Settings`` 并选择 “Input Map” 选项卡。 添加以下输入操作(相关详细信息，请参阅 :ref:`InputEvent <doc_inputevent>` ):

source: 8-way movement
fr: Mouvement 8 directions
zh_cn: 8向移动

source: In this scenario, you want the user to press the four directional keys (up/left/down/right or W/A/S/D) and move in the selected direction. The name "8-way movement" comes from the fact that the player can move diagonally by pressing two keys at the same time.
fr: Dans ce scénario, vous souhaitez que l'utilisateur appuie sur les quatre touches directionnelles (haut/gauche/bas/droite ou Z/Q/S/D) et se déplace dans la direction sélectionnée. Le nom "mouvement à 8 directions" vient du fait que le joueur peut se déplacer en diagonale en appuyant sur deux touches simultanément.
zh_cn: 在本情况下，您希望用户按下四个方向键(向上/向左/向下/向右或W / A / S / D)并沿所选方向移动。 “8向移动”意味着游戏角色可以通过同时按下两个键实现对角移动。

source: Add a script to the kinematic body and add the following code:
fr: Ajoutez un script au kinematic body et ajoutez le code suivant :
zh_cn: 将脚本添加到运动物体上，并添加以下代码:

source: In the ``get_input()`` function we check for the four key events and sum them up to get the velocity vector. This has the benefit of making two opposite keys cancel each other out, but will also result in diagonal movement being faster due to the two directions being added together.
fr: Dans la fonction ``get_input () ``, nous vérifions les quatre événements clés et nous les additionnons pour obtenir le vecteur vitesse. Cela a l’avantage de permettre à deux touches opposées de s'annuler mutuellement, mais entraîne également une accélération du mouvement en diagonale du fait de l’addition des deux directions.
zh_cn: 在 ``get_input()`` 函数中，我们检查四个关键事件并将它们相加以获得速度向量。 这具有使两个相对的键彼此抵消的优点，但是由于两个方向被加在一起，还将导致对角线移动得更快。

source: We can prevent that if we *normalize* the velocity, which means we set its *length* to ``1``, and multiply by the desired speed.
fr: Nous pouvons éviter cela si nous *normalisons* la vélocité, ce qui signifie que nous définissons sa *longueur* à ``1``, et que nous multiplions par la vitesse désirée.
zh_cn: 我们可以防止这种情况，如果我们让速度 *归一化* ，这意味着我们将其 *长度* 设置为 ``1`` ，并乘以所期望的值。

source: If you've never used vector math before, or need a refresher, you can see an explanation of vector usage in Godot at :ref:`doc_vector_math`.
fr: Si vous n'avez jamais utilisé de calcul vectoriel auparavant ou avez besoin d'une remise à niveau, vous pouvez voir une explication de l'utilisation des vecteurs dans Godot sur :ref:`doc_vector_math`.
zh_cn: 如果您之前从未接触过向量数学，或者需要复习，您可以在Godot中看到向量用法的解释 :ref:`doc_vector_math` 。

source: Rotation + movement
zh_cn: 旋转+移动

source: This type of movement is sometimes called "Asteroids-style" because it resembles how that classic arcade game worked. Pressing left/right rotates the character, while up/down moves it forward or backward in whatever direction it's facing.
fr: Ce type de mouvement est parfois appelé "style Asteroids" car il ressemble à la façon dont ce jeu d'arcade classique fonctionnait. Appuyez sur les touches gauche/droite pour faire pivoter le personnage, tandis que haut/bas le déplace vers l'avant ou l'arrière dans toute direction vers laquelle il fait face.
zh_cn: 这种类型的运动有时被称为“小行星式运动”，因为它类似于经典街机游戏的工作方式。 按左/右旋转角色，而按上/下使得角色向前或向后，往它面向的任何方向移动。

source: Here we've added two new variables to track our rotation direction and speed. Again, pressing both keys at once will cancel out and result in no rotation. The rotation is applied directly to the body's ``rotation`` property.
fr: Ici, nous avons ajouté deux nouvelles variables pour suivre notre direction et notre vitesse de rotation. A nouveau, appuyer sur les deux touches en même temps les annulera et ne provoquera aucune rotation. La rotation est appliquée directement à la propriété ``rotation`` du corps.
zh_cn: 在这里，我们添加了两个新变量来跟踪旋转方向和速度。 同样，一次按下两个键将取消并导致没有旋转。 旋转直接应用于物体的 ``rotation`` 属性。

source: To set the velocity, we use the ``Vector2.rotated()`` method, so that it points in the same direction as the body. ``rotated()`` is a useful vector function that you can use in many circumstances where you would otherwise need to apply trigonometric functions.
zh_cn: 为了设置速度，我们使用 ``Vector2.rotated()`` 方法，使它的指向与物体方向相同。 ``rotated()`` 是一个很有用的向量函数，您可以在许多情况下使用它，否则您就需要用到三角函数。

source: Rotation + movement (mouse)
zh_cn: 旋转+移动(鼠标)

source: This style of movement is a variation of the previous one. This time, the direction is set by the mouse position instead of the keyboard. The character will always "look at" the mouse pointer. The forward/back inputs remain the same, however.
fr: Ce style de mouvement est une variation du précédent. Cette fois, la direction est définie par la position de la souris au lieu du clavier. Le personnage "regardera" toujours vers le pointeur de la souris. Les entrées avant/arrière restent toutefois les mêmes.
zh_cn: 这种运动方式是前一种运动方式的变体。 这次，方向由鼠标位置而不是键盘设置。 角色将始终“看向”鼠标指针。 然而，前进/后退输入保持不变。

source: Here we're using the :ref:`Node2D <class_Node2D>` ``look_at()`` method to point the player towards a given position. Without this function, you could get the same effect by setting the angle like this:
fr: Nous utilisons ici la méthode :ref:`Node2D <class_Node2D>` ``look_at()`` pour diriger le joueur vers une position donnée. Sans cette fonction, vous pourriez obtenir le même effet en définissant l'angle comme suit :
zh_cn: 这里我们用到 :ref:`Node2D <class_Node2D>` 中的 ``look_at()`` 方法，使游戏角色朝向给定的位置。 如果没有此函数，为获得相同的效果，您可能需要像下面这样设置角度:

source: Click-and-move
fr: Cliquer-et-déplacer
zh_cn: 点击并移动

source: This last example uses only the mouse to control the character. Clicking on the screen will cause the player to move to the target location.
fr: Ce dernier exemple utilise uniquement la souris pour contrôler le personnage. En cliquant sur l'écran, le joueur se déplacera à l'emplacement cible.
zh_cn: 最后一个示例仅使用鼠标来控制角色。 单击屏幕将使游戏角色移动到目标位置。

source: This technique can also be used as the basis of a "following" character. The ``target`` position can be that of any object you want to move to.
fr: Cette technique peut également être utilisée comme base du personnage "suivant". La position ``cible`` peut être celle de n'importe quel objet vers lequel vous voulez déplacer.
zh_cn: 该技术也可以用到“跟随”游戏角色中。 ``目标`` 位置可以是移动中的任何对象的位置。

source: Summary
fr: Résumé
zh_cn: 总结

source: You may find these code samples useful as starting points for your own projects. Feel free to use them and experiment with them to see what you can make.
fr: Vous pouvez trouver ces exemples de code utiles comme points de départ pour vos propres projets. N'hésitez pas à les utiliser et à les expérimenter pour voir ce que vous pouvez faire.
zh_cn: 您可能会发现这些代码示例可用到您自己的项目中。 请随意使用它们并试验它们，看看您能做些什么。

source: You can download this sample project here: :download:`2D_movement_demo.zip <files/2D_movement_demo.zip>`
fr: Vous pouvez télécharger cet exemple de projet ici: :download:`2D_movement_demo.zip <files/2D_movement_demo.zip>`
zh_cn: 您可以在此处下载此示例项目 : :download:`2D_movement_demo.zip <files/2D_movement_demo.zip>`

source: Uncommenting the ``rotation`` line will also turn the body to point in its direction of motion if you prefer.
fr: Décommenter la ligne ``rotation`` amènera le corps à pointer dans la direction de son mouvement si vous préférez.
