Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_sprite_animation.po
Languages: de, ja

source: Introduction
de: Einführung
ja: はじめに

source: Art for the following examples by https://opengameart.org/users/ansimuz and by https://opengameart.org/users/tgfcoder
de: Kunstwerke für die folgenden Beispiele kann man hier finden: https://opengameart.org/users/ansimuz oder https://opengameart.org/users/tgfcoder

source: Individual images with AnimatedSprite
de: Einzelbilder mit AnimatedSprite
ja: AnimatedSpriteと個々の画像

source: In this scenario, you have a collection of images, each containing one of your character's animation frames. For this example, we'll use the following animation:
de: In diesem Szenario haben Sie eine Sammlung von Bildern, die jeweils einen Animations-Frame Ihres Charakters enthalten. In diesem Beispiel verwenden wir die folgende Animation:
ja: このシナリオでは、キャラクターのアニメーションフレームを1つづつ含む複数の画像を使います。この例では、次のアニメーションを使用します:

source: You can download the images here: :download:`run_animation.zip <files/run_animation.zip>`
de: Sie können die Bilder hier herunterladen: :download:`run_animation.zip <files/run_animation.zip>`
ja: 画像はこちらからダウンロードできます: :download:`run_animation.zip </run_animation.zip>`

source: Unzip the images and place them in your project folder. Set up your scene tree with the following nodes:
de: Entpacken Sie die Bilder und legen Sie sie in Ihrem Projektordner ab. Richten Sie Ihren Szenenbaum mit den folgenden Nodes ein:
ja: 画像を解凍し、プロジェクトフォルダに配置します。次のノードを使用してシーンツリーを設定します:

source: The root node could also be :ref:`Area2D <class_Area2D>` or :ref:`RigidBody2D <class_RigidBody2D>`. The animation will still be made in the same way. Once the animation is completed, you can assign a shape to the CollisionShape2D. See :ref:`Physics Introduction <doc_physics_introduction>` for more information.
de: Der Wurzel-Node könnte auch ein :ref:`Area2D <class_Area2D>` oder :ref:`RigidBody2D <class_RigidBody2D>` sein, die Animation wird weiterhin auf die gleiche Weise erstellt. Sobald die Animation abgeschlossen ist, können Sie der CollisionShape2D eine Form zuweisen. Weitere Informationen finden Sie unter :ref:`Physics Introduction <doc_physics_introduction>`.
ja: ルートノードは、\ :ref:`Area2D <class_Area2D>` または :ref:`RigidBody2D <class_RigidBody2D>` にすることもできます。アニメーションは引き続き同じ方法で作成されます。アニメーションが完成したら、CollisionShape2Dにシェイプを割り当てることができます。詳細については、\ :ref:`Physics Introduction <doc_physics_introduction>` を参照してください。

source: Now select the ``AnimatedSprite`` and in its *SpriteFrames* property, select "New SpriteFrames".
de: Wählen Sie nun ``AnimatedSprite`` aus und wählen Sie in der *SpriteFrames* Eigenschaft "Neue SpriteFrames" aus.
ja: 次に、\ ``AnimatedSprite`` を選択し、その *SpriteFrames* プロパティで「新規 SpriteFrames」を選択します。

source: Click on the new SpriteFrames resource and you'll see a new panel appear at the bottom of the editor window:
de: Klicken Sie auf die neue SpriteFrames-Ressource. Am unteren Rand des Editorfensters wird ein neues Panel angezeigt:
ja: 新しいSpriteFramesリソースをクリックすると、エディタウィンドウの下部に新しいパネルが表示されます:

source: From the FileSystem dock on the left side, drag the 8 individual images into the center part of the SpriteFrames panel. On the left side, change the name of the animation from "default" to "run".
de: Ziehen Sie aus dem Dateisystem-Dock auf der linken Seite die 8 Einzelbilder in den mittleren Bereich des SpriteFrame Panels. Ändern Sie auf der linken Seite den Namen der Animation von "Standard" in "Ausführen".
ja: 左側のFileSystemドックから、8つの個別の画像をSpriteFramesパネルの中央部分にドラッグします。左側で、アニメーションの名前を "default" から "run" に変更します。

source: Back in the Inspector, check the box for the *Playing* property. You should now see the animation playing in the viewport. However, it is a bit slow. To fix this, change the *Speed (FPS)* setting in the SpriteFrames panel to 10.
de: Aktivieren Sie im Inspektor das Kontrollkästchen für die Eigenschaft *Wiedergabe*. Sie sollten jetzt die Animation im Ansichtsfenster sehen. Es ist jedoch etwas langsam. Um dies zu beheben, ändern Sie die Einstellung *Geschwindigkeit (FPS)* im SpriteFrame Panel auf 10.
ja: インスペクタに戻り、\ *Playing* プロパティのチェックボックスをオンにします。これで、アニメーションがビューポートで再生されます。しかし、それは少し遅いです。この問題を解決するには、SpriteFramesパネルの *Speed(FPS)* 設定を10に変更します。

source: You can add additional animations by clicking the "New Animation" button and adding additional images.
de: Sie können zusätzliche Animationen hinzufügen, indem Sie auf die Schaltfläche "Neue Animation" klicken und zusätzliche Bilder hinzufügen.
ja: [新規アニメーション]ボタンをクリックして画像を追加すると、アニメーションを追加できます。

source: Controlling the animation
de: Steuerung der Animation
ja: アニメーションのコントロール

source: Once the animation is complete, you can control the animation via code using the ``play()`` and ``stop()`` methods. Here is a brief example to play the animation while the right arrow key is held, and stop it when the key is released.
de: Sobald die Animation abgeschlossen ist, können Sie die Animation über Code mit den Methoden ``play()`` und ``stop()`` steuern. Hier ist ein kurzes Beispiel, um die Animation abzuspielen während die rechte Pfeiltaste gedrückt gehalten wird und sie anzuhalten, wenn die Taste losgelassen wird.
ja: アニメーションが完了すると、\ ``play()`` メソッドと ``stop()`` メソッドを使用して、コードでアニメーションを制御できます。右矢印キーを押したままアニメーションを再生し、キーを放したときにアニメーションを停止する簡単な例を次に示します。

source: Sprite sheet with AnimatedSprite
de: Sprite-Bogen mittels AnimatedSprite

source: Right-click the image and choose "Save Image As" to download it, and then copy the image into your project folder.
de: Klicken Sie mit der rechten Maustaste auf das Bild und wählen Sie "Bild speichern unter" um es herunterzuladen. Kopieren Sie das Bild dann in Ihren Projektordner.

source: Sprite sheet with AnimationPlayer
de: Sprite-Bogen mittels AnimationPlayer
ja: AnimationPlayerのスプライトシート

source: Another way that you can animate when using a sprite sheet is to use a standard :ref:`Sprite <class_Sprite>` node to display the texture, and then animating the change from texture to texture with :ref:`AnimationPlayer <class_AnimationPlayer>`.
de: Eine andere Möglichkeit zum animieren eines Sprite-Bogens besteht darin, einen Standard :ref:`Sprite <class_Sprite>`-Node zu verwenden um die Textur anzuzeigen und dann den Wechsel von Textur zu Textur mit :ref:`AnimationPlayer <class_AnimationPlayer>` zu animieren .

source: Consider this sprite sheet, which contains 6 frames of animation:
de: Betrachten Sie diesen Sprite-Bogen, der 6 Animationsbilder enthält:
ja: 6フレームのアニメーションを含むこのスプライトシートを考えてみましょう。

source: Right-click the image and choose "Save Image As" to download, then copy the image into your project folder.
de: Klicken Sie mit der rechten Maustaste auf das Bild und wählen Sie "Bild speichern unter" zum Herunterladen. Kopieren Sie das Bild dann in Ihren Projektordner.
ja: 画像を右クリックして[名前を付けて保存]を選択してダウンロードし、イメージをプロジェクトフォルダにコピーします。

source: Our goal is to display these images one after another in a loop. Start by setting up your scene tree:
de: Unser Ziel ist es diese Bilder nacheinander in einer Schleife anzuzeigen. Beginnen Sie mit der Einrichtung Ihres Szenenbaums:
ja: 私たちの目標は、これらの画像をループで次々に表示することです。シーンツリーを設定することから始めます。

source: Drag the spritesheet into the Sprite's *Texture* property, and you'll see the whole sheet displayed on the screen. To slice it up into individual frames, expand the *Animation* section in the Inspector and set the *Hframes* to ``6``. *Hframes* and *Vframes* are the number of horizontal and vertical frames in your sprite sheet.
de: Ziehen Sie den Sprite-Bogen in die *Textur*-Eigenschaft des Sprites und der gesamte Bogen wird auf dem Bildschirm angezeigt. Um es in einzelne Frames aufzuteilen, erweitern Sie den Abschnitt *Animation* im Inspektor und setzen Sie die *Hframes* auf ``6``. *Hframes* und *Vframes* sind die Anzahl der horizontalen und vertikalen Frames in Ihrem Sprite-Bogen.
ja: スプライトシートをスプライトの *Texture* プロパティにドラッグすると、シート全体が画面に表示されます。個々のフレームにスライスするには、インスペクタの *Animation* セクションを展開し、\ *Hframes* を ``6`` に設定します。\ *Hframes* および *Vframes* は、スプライトシート内の水平フレームと垂直フレームの数です。

source: Now try changing the value of the *Frame* property. You'll see that it ranges from ``0`` to ``5`` and the image displayed by the Sprite changes accordingly. This is the property we'll be animating.
de: Versuchen Sie nun den Wert der Eigenschaft *Frame* zu ändern. Sie werden sehen, dass der Bereich von ``0`` bis ``5`` reicht und sich das vom Sprite angezeigte Bild entsprechend ändert. Dies ist die Eigenschaft die wir animieren werden.
ja: 次に、\ *Frame* プロパティの値を変更してみてください。範囲が ``0`` から ``5`` であり、それに応じてスプライトによって表示される画像が変化することがわかります。これが、アニメーション化のプロパティです。

source: Select the ``AnimationPlayer`` and click the "Animation" button followed by "New". Name the new animation "walk". Set the animation length to ``0.6`` and click the "Loop" button so that our animation will repeat.
de: Wählen Sie den ``AnimationPlayer`` und klicken Sie auf die Schaltfläche "Animation", gefolgt von "Neu". Nennen Sie die neue Animation "walk". Stellen Sie die Animationslänge auf ``0.6`` ein und klicken Sie auf die Schaltfläche "Loop", damit sich unsere Animation wiederholt.
ja: ``AnimationPlayer`` を選択し、[アニメーション] ボタンをクリックしてから [新規] をクリックします。新しいアニメーションに「walk」という名前を付けます。アニメーションの長さを ``0.6`` に設定し、[ループ] ボタンをクリックして、アニメーションが繰り返されるようにします。

source: Now select the ``Sprite`` node and click the key icon to add a new track.
de: Wählen Sie nun den Sprite-Node aus und klicken Sie auf das Schlüsselsymbol um eine neue Spur hinzuzufügen.
ja: 次に、\ ``Sprite`` ノードを選択し、鍵のアイコンをクリックして新しいトラックを追加します。

source: Continue adding frames at each point in the timeline (``0.1`` seconds by default), until you have all the frames from 0 to 5. You'll see the frames actually appearing in the animation track:
de: Fügen Sie an jedem Punkt in der Zeitleiste weitere Frames hinzu (standardmäßig ``0.1`` Sekunden), bis Sie alle Frames von 0 bis 5 haben. Die Frames werden tatsächlich in der Animationsspur angezeigt:
ja: タイムラインの各ポイント(デフォルトでは ``0.1``\ 秒刻み)で、0から5までのすべてのフレームが追加されるまで、鍵アイコンをクリックしてフレームの追加を続けます。アニメーショントラックに実際にフレームが表示されます:

source: Press "Play" on the animation to see how it looks.
de: Drücken Sie "Play" in der Animation, um zu sehen wie sie aussieht.
ja: アニメーションの [再生] をクリックすると、アニメーションがどのように表示されるかを確認できます。

source: Controlling an AnimationPlayer animation
de: Steuerung einer AnimationPlayer Animation
ja: AnimationPlayerアニメーションの制御

source: Like with AnimatedSprite, you can control the animation via code using the ``play()`` and ``stop()`` methods. Again, here is an example to play the animation while the right arrow key is held, and stop it when the key is released.
de: Wie bei AnimatedSprite können Sie die Animation über Code mit den Methoden ``play()`` und ``stop()`` steuern. Auch hier ist ein Beispiel um die Animation abzuspielen während die rechte Pfeiltaste gedrückt gehalten wird und sie anzuhalten, wenn die Taste losgelassen wird.
ja: AnimatedSpriteと同様に、\ ``play()`` メソッドと ``stop()`` メソッドを使用して、コードを介してアニメーションを制御できます。ここでも、右矢印キーを押したままアニメーションを再生し、キーを放したときにアニメーションを停止する例を次に示します。

source: If updating both an animation and a separate property at once (for example, a platformer may update the sprite's ``h_flip``/``v_flip`` properties when a character turns while starting a 'turning' animation), it's important to keep in mind that ``play()`` isn't applied instantly. Instead, it's applied the next time the :ref:`AnimationPlayer <class_AnimationPlayer>` is processed. This may end up being on the next frame, causing a 'glitch' frame, where the property change was applied but the animation was not. If this turns out to be a problem, after calling ``play()``, you can call ``advance(0)`` to update the animation immediately.
de: Wenn Sie sowohl eine Animation als auch eine separate Eigenschaft gleichzeitig aktualisieren (z.B. kann ein Plattformer die Eigenschaften des Sprites ``h_flip``/``v_flip`` aktualisieren wenn sich ein Charakter dreht, während eine "Drehen" -Animation gestartet wird), ist es wichtig im Hinterkopf zu behalten, dass ``play()`` nicht sofort angewendet wird. Stattdessen wird es das nächste Mal angewendet, wenn :ref:`AnimationPlayer <class_AnimationPlayer>` verarbeitet wird. Dies kann dazu führen, dass es sich im nächsten Frame befindet, was zu einem 'glitch'-Frame führt, in dem die Eigenschaftsänderung angewendet wurde, die Animation jedoch nicht. Sollte dies ein Problem sein, können Sie nach dem Aufrufen von ``play()`` direkt ``advance(0)`` aufrufen um die Animation sofort zu aktualisieren.
ja: アニメーションと個別のプロパティの両方を一度に更新する場合 (たとえば、プラットフォームゲームの場合、「ターン」アニメーションの開始中に、キャラクタの方向転のために、スプライトの ``h_flip``/``v_flip`` プロパティを更新する場合があります)、\ ``play()`` では即座に適用されないことに注意してください。代わりに、次回 :ref:`AnimationPlayer <class_AnimationPlayer>` が処理されるときに適用されます。この更新は次のフレームで確定するので、プロパティの更新は行われていても、それがアニメーションには適用されていない「グリッチ」フレームが発生する可能性があります。これが問題であることが判明した場合は、\ ``play()`` を呼び出した後に ``advance(0)`` を呼び出すことでアニメーションをすぐに更新することができます。

source: Summary
de: Zusammenfassung
ja: 概要

source: 2D Sprite animation
ja: 2Dスプライトアニメーション
