Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_transforms.po
Languages: es, ru, zh_cn

source: Viewport and canvas transforms
es: Transformación de Viewport y Canvas
ru: Преобразование области просмотра и холста
zh_cn: 视区和画布变换

source: Introduction
es: Introducción
ru: Введение
zh_cn: 简介

source: This is an overview of the 2D transforms going on for nodes from the moment they draw their content locally to the time they are drawn onto the screen. This overview discusses very low level details of the engine.
es: Esto es un resumen de lo que sucede con las matrices de transformación 2D en los nodos desde el momento en que dibujan su contenido localmente hasta el momento en que se muestran en pantalla. Aquí se mostrarán detalles de muy bajo nivel de el motor.
ru: Это обзор 2D преобразований, происходящих для узлов с момента их локального рисования содержимого до момента их рисования на экране. В этом обзоре обсуждаются детали движка очень низкого уровня.
zh_cn: 本小节概述了， 节点从绘制本地内容开始到显示到屏幕上结束的过程中的2D变换。 本概述从非常的低级别上，讨论了引擎的细节。

source: Canvas transform
es: Transformación del canvas
ru: Преобразования холста
zh_cn: 画布变换

source: As mentioned in the previous tutorial, :ref:`doc_canvas_layers`, every CanvasItem node (remember that Node2D and Control based nodes use CanvasItem as their common root) will reside in a *Canvas Layer*. Every canvas layer has a transform (translation, rotation, scale, etc.) that can be accessed as a :ref:`Transform2D <class_Transform2D>`.
es: Como se mencionó en el tutorial anterior, :ref:`doc_canvas_layers`, cada nodo CanvasItem (recuerda que los nodos basados en Node2D y Control usan CanvasItem como su raíz común) residirá en una *Canvas Layer*. Cada canvas layer tiene una transformación (translation, rotation, scale, etc.) a la que se puede acceder mediante :ref:`Transform2D <class_Transform2D>`.
ru: Как упоминалось в предыдущем руководстве :ref:`doc_canvas_layers`, каждый узел CanvasItem (помните, что узлы на основе Node2D и Control используют CanvasItem в качестве общего корня) будет находиться в *Canvas Layer*. Каждый слой холста имеет преобразование (перемещение, поворот, масштаб и т.д.), к которому можно получить доступ как :ref:`Transform2D <class_Transform2D>`.
zh_cn: 正如前面教程中提到的那样 :ref:`doc_canvas_layers`，每个画布项节点(记住Node2D和基于Control的节点使用画布项作为它们的公共根)将驻留在 *画布层* 中。 每个画布层都有一个变换(平移，旋转，缩放等)，可以作为 :ref:`Transform2D <class_Transform2D>` 进行访问。

source: Also covered in the previous tutorial, nodes are drawn by default in Layer 0, in the built-in canvas. To put nodes in a different layer, a :ref:`CanvasLayer <class_CanvasLayer>` node can be used.
es: Esto también está cubierto por el tutorial anterior, los nodos son dibujados por defecto en Layer (capa) 0, en el "built-in canvas" (el canvas por defecto del viewport). Para colocar nodos en una capa distinta, se debe utilizar una :ref:`CanvasLayer <class_CanvasLayer>`.
ru: Как было сказано в предыдущем уроке, узлы по умолчанию рисуются на 0-ом слое на встроенном холсте. Для того, чтобы поместить узлы на другой слой, можно воспользоваться узлом :ref:`CanvasLayer <class_CanvasLayer>`.
zh_cn: 在上一个教程中也有介绍，默认情况下，在内置画布的第0层中绘制节点。 要将节点放在不同的层中，可以使用 :ref:`CanvasLayer <class_CanvasLayer>` 节点。

source: Global canvas transform
es: Transformación global del canvas
ru: Глобальное преобразование холста
zh_cn: 全局画布变换

source: Viewports also have a Global Canvas transform (also a :ref:`Transform2D <class_Transform2D>`). This is the master transform and affects all individual *Canvas Layer* transforms. Generally, this transform is not of much use, but is used in the CanvasItem Editor in Godot's editor.
es: Los Viewports también tienen una transformación Global Canvas (también un :ref:`Transform2D <class_Transform2D>`). Esta es la transformación principal y afecta a todas las transformaciones individuales de *Canvas Layer*. Generalmente esta transformación no es de mucha utilidad, pero se usa en el Editor de CanvasItem del editor de Godot.
ru: Видовые экраны также имеют преобразование Global Canvas (также: ref:`Transform2D <class_Transform2D>`). Это основное преобразование, которое влияет на все отдельные преобразования *Canvas Layer*. Как правило, от этого преобразования мало пользы, но оно используется в CanvasItem Editor в редакторе Godot.
zh_cn: 视区还具有全局画布变换(也是 :ref:`Transform2D <class_Transform2D>` )。 这是主变换并影响所有单独的 *画布层* 变换。 通常这种变换用得不多，主要用在Godot的编辑器中的画布项编辑器中。

source: Stretch transform
ru: Преобразования растяжения
zh_cn: 拉伸变换

source: Finally, viewports have a *Stretch Transform*, which is used when resizing or stretching the screen. This transform is used internally (as described in :ref:`doc_multiple_resolutions`), but can also be manually set on each viewport.
es: Por último, los Viewports tienen un *Stretch Transform*, que se utiliza al cambiar de tamaño o estirar la pantalla. Esta transformación se utiliza internamente (como se describe en :ref:`doc_multiple_resolutions`) pero también se puede configurar manualmente en cada Viewport.
ru: Наконец, в видовых экранах есть функция *Stretch Transform*, которая используется при изменении размера или растягивании экрана. Это преобразование используется внутренне (как описано в :ref:`doc_multiple_resolutions`), но также может быть вручную установлено для каждого видового экрана.
zh_cn: 最后，视区有 *拉伸变换* ，用于调整大小或拉伸屏幕。 此变换在内部使用(见 :ref:`doc_multiple_resolutions` )，但也可以在每个视区上手动设置。

source: Input events received in the :ref:`MainLoop._input_event() <class_MainLoop_method__input_event>` callback are multiplied by this transform but lack the ones above. To convert InputEvent coordinates to local CanvasItem coordinates, the :ref:`CanvasItem.make_input_local() <class_CanvasItem_method_make_input_local>` function was added for convenience.
es: Eventos de entrada (Input events) recibidos en el callback de :ref:`MainLoop._input_event() <class_MainLoop_method__input_event>` son multiplicados por este transform, pero carecen de los presentados anteriormente. Para convertir fácilmente coordenadas de InputEvent a coordenadas locales de CanvasItem, se agregó la función :ref:`CanvasItem.make_input_local() <class_CanvasItem_method_make_input_local>`.
ru: Входные события, полученные в обратном вызове :ref:`MainLoop._input_event () <class_MainLoop_method__input_event>`, умножаются на это преобразование, но отсутствуют указанные выше. Чтобы преобразовать координаты InputEvent в локальные координаты CanvasItem, для удобства была добавлена функция :ref:`CanvasItem.make_input_local () <class_CanvasItem_method_make_input_local>`.

source: Transform order
es: Orden de Transform
ru: Порядок преобразований
zh_cn: 变换顺序

source: For a coordinate in CanvasItem local properties to become an actual screen coordinate, the following chain of transforms must be applied:
es: Para que un sistema de coordenadas locales en CanvasItem se convierta en coordenadas de pantalla, se debe aplicar la siguiente secuencia de transforms:
ru: Чтобы координата в локальных свойствах CanvasItem стала фактической координатой экрана, необходимо применить следующую цепочку преобразований:
zh_cn: 要使画布项的本地属性中的坐标成为实际屏幕坐标，必须应用以下一系列变换:

source: Transform functions
es: Funciones de Transform
ru: Функции преобразования
zh_cn: 变换函数

source: Obtaining each transform can be achieved with the following functions:
es: Cada transform se puede obtener con las siguientes funciones:
ru: Получить каждое преобразование можно с помощью следующих функций:
zh_cn: 通过以下函数可以实现每个转换:

source: Type
es: Tipo
ru: Тип
zh_cn: 类型

source: Transform
es: Transformar
ru: Преобразование
zh_cn: 变换

source: Finally, then, to convert a CanvasItem local coordinates to screen coordinates, just multiply in the following order:
es: Finalmente, para convertir un CanvasItem de coordenadas locales a coordenadas de pantalla, utilizar el siguiente orden:
ru: Наконец, чтобы преобразовать локальные координаты CanvasItem в экранные координаты, просто умножьте в следующем порядке:
zh_cn: 最后，然后，要将画布项的本地坐标转换为屏幕坐标，只需按以下顺序相乘:

source: Keep in mind, however, that it is generally not desired to work with screen coordinates. The recommended approach is to simply work in Canvas coordinates (``CanvasItem.get_global_transform()``), to allow automatic screen resolution resizing to work properly.
es: Tener en cuenta que esto no es aconsejable para trabajar en coordenadas de pantalla. Lo recomendable es simplemente trabajar en coordenadas de Canvas (``CanvasItem.get_global_transform()``), para permitir que el cambio de tamaño/ajuste de resolución funcione de la manera adecuada.
ru: Однако имейте в виду, что обычно нежелательно работать с экранными координатами. Рекомендуемый подход - просто работать в координатах холста (``CanvasItem.get_global_transform ()``), чтобы автоматическое изменение размера разрешения экрана работало правильно.
zh_cn: 但请记住，通常情况最好不要使用屏幕坐标。 推荐的方法是， 仅仅使用画布坐标( ``CanvasItem.get_global_transform()`` )，以保证在调整屏幕大小后使其能正常工作。

source: Feeding custom input events
es: Generando eventos de entrada personalizados
ru: Передача пользовательских событий ввода
zh_cn: 提供自定义输入事件

source: It is often desired to feed custom input events to the scene tree. With the above knowledge, to correctly do this, it must be done the following way:
es: Usualmente es deseable crear eventos de entradas personalizados para enviar al árbol de escenas. Para hacer esto correctamente, se debe hacer de la siguiente manera:
ru: Часто требуется передавать пользовательские события ввода в дерево сцены. Обладая вышеуказанными знаниями, чтобы правильно это сделать, необходимо сделать следующее:
zh_cn: 通常需要将自定义输入事件提供给场景树。 有了上述知识，要正确地做到这一点，必须通过以下方式完成:
