Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/canvas_layers.po
Languages: de, es, fr, ja, zh_cn

source: Canvas layers
de: Canvas-Ebenen
fr: Couches du canevas
ja: キャンバス・レイヤー
zh_cn: Canvas Layers(画布层)

source: Viewport and Canvas items
de: Ansichtsfenster und Canvas-Elemente
es: Viewport y Canvas items
fr: Eléments de fenêtre et de canevas
ja: Viewportとキャンバス・アイテム
zh_cn: Viewport (视窗) 和 Canvas Item (画布项)

source: Regular 2D nodes, such as :ref:`Node2D <class_Node2D>` or :ref:`Control <class_Control>` both inherit from :ref:`CanvasItem <class_CanvasItem>`, which is the base for all 2D nodes. CanvasItems can be arranged in trees. Each item will inherit its parent's transform. This means that when the parent is moved, the children will move too.
de: Reguläre 2D-Nodes wie :ref:`Node2D <class_Node2D>` und :ref:`Control <class_Control>` sind abgeleitet von :ref:`CanvasItem <class_CanvasItem>` auf dem auch sämtliche andere 2D-Nodes basieren. CanvasItems können in einer Baumhierarchie strukturiert werden und kopieren ihre Transformation von der übergeordneten Node. Das heißt, wird ein übergeordneter Node bewegt, bewegen sich alle untergeordneten Nodes in gleicher Weise.
es: Los nodos 2D comunes, como :ref:`Node2D <class_Node2D>` o :ref:`Control <class_Control>` heredan ambos de :ref:`CanvasItem <class_CanvasItem>`, que es la base de todos los nodos 2D. Los CanvasItems se pueden organizar en árboles y heredarán su transformación. Esto significa que al mover al padre, los hijos también se moverán.
fr: Les nœuds 2D ordinaires, tels que :ref:`Node2D <class_Node2D>` ou :ref:`Control <class_Control>` héritent tous deux de :ref:`CanvasItem <class_CanvasItem>`, qui est la base de tous les nœuds 2D. Les objets CanvasItems peuvent être organisés en arborescences. Ils hériteront de la transformation de leurs parents. Cela signifie que lors du déplacement du parent, les enfants seront également déplacés.
ja: \ :ref:`Node2D <class_Node2D>` や\ :ref:`Control <class_Control>` などの通常の2Dノードは、すべての2Dノードのベースである \ :ref:`CanvasItem <class_CanvasItem>` から両方とも継承されます。CanvasItemはツリーに配置でき、その幾何学変換を継承します。つまり、親を移動すると、子も移動します。
zh_cn: 常规2D节点, 如 :ref:`Node2D <class_Node2D>` 或 :ref:`Control <class_Control>` 都继承自 :ref:`CanvasItem <class_CanvasItem>` , 它是所有2D节点的基础.CanvasItem 被组织成树状结构, 同时继承它们父节点的变换. 这意味着在移动父节点时, 子节点也会被移动.

source: CanvasItem nodes, and nodes inheriting from them, are direct or indirect children of a :ref:`Viewport <class_Viewport>`, and will be displayed through it.
de: Diese Nodes in der Hierarchie sind stets direkte oder indirekte Unterobjekte einer :ref:`Viewport <class_Viewport>`-Instanz und werden über diese dargestellt.
es: Los nodos CanvasItem y todos los que heredan de ellos, son directa o indirectamente hijos de un :ref:`Viewport <class_Viewport>`, y son mostrados en pantalla por este.
fr: Les nœuds CanvasItem, et les nœuds qui héritent d'eux sont des enfants directs ou indirects d'une :ref:`Fenêtre d'affichage <class_Viewport>`, et seront affichés à travers elle.
ja: これらのノードは \ :ref:`Viewport <class_Viewport>` の直接または間接の子として配置され、Viewportを通して表示されます。
zh_cn: CanvasItem 节点和继承他们的节点, 都作为 :ref:`Viewport <class_Viewport>` 的直接或间接子节点放置, 并将通过它显示.

source: A Viewport has the property :ref:`Viewport.canvas_transform <class_Viewport_property_canvas_transform>`, which allows applying a custom :ref:`Transform2D <class_Transform2D>` transform to the CanvasItem hierarchy it contains. Nodes such as :ref:`Camera2D <class_Camera2D>` work by changing that transform.
de: Ein Viewport enthält die Eigenschaft :ref:`Viewport.canvas_transform <class_Viewport_property_canvas_transform>`, die es erlaubt, die gesamte CanvasItem-Hierarchie durch ein benutzerdefiniertes :ref:`Transform2D <class_Transform2D>` zu beeinflussen. Bestehende Nodes wie :ref:`Camera2D <class_Camera2D>` passen auf diese Weise ihre Sicht an.
es: El nodo Viewport tiene la propiedad :ref:`Viewport.canvas_transform <class_Viewport_property_canvas_transform>`, la que permite aplicar una matriz de transformación :ref:`Transform2D <class_Transform2D>` personalizada para modificar la jerarquía de CanvasItem que contiene. Nodos como :ref:`Camera2D <class_Camera2D>`, funcionan cambiando esa transformación.
fr: La fenêtre d'affichage a la propriété :ref:`Viewport.canvas_transform <class_Viewport_property_canvas_transform>`, qui permet d'appliquer une transformation personnalisée :ref:`Transform2D <class_Transform2D>` à la hiérarchie CanvasItem qui la contient. Des nœuds tels que :ref:`Camera2D <class_Camera2D>`, fonctionnent en modifiant cette transformation.
ja: Viewportには \ :ref:`Viewport.canvas_transform <class_Viewport_property_canvas_transform>` プロパティがあります。これにより、カスタム \ :ref:`Transform2D <class_Transform2D>` 幾何学変換によってすべてのCanvasItem階層を変換できます。 \ :ref:`Camera2D <class_Camera2D>` などのノードは、その変換を変更することで機能します。
zh_cn: Viewport 具有属性 :ref:`Viewport.canvas_transform <class_Viewport_property_canvas_transform>` , 它允许对它所包含的CanvasItem层级施加一个自定义的 :ref:`Transform2D <class_Transform2D>` 变换. 如 :ref:`Camera2D <class_Camera2D>` 的主要工作方式就是改变那个Transform2D变换.

source: Effects like scrolling are best achieved by manipulating the canvas transform property. This approach is more efficient than moving the root canvas item (and hence the whole scene).
de: Effekte wie das Scrollen lassen sich am besten durch Bearbeiten der Canvas-Transformationseigenschaft erzielen. Dieser Ansatz ist effizienter als das Verschieben des Wurzel-Canvas-Elements (und damit der gesamten Szene).
es: Efectos como scrolling, se pueden lograr manipulando la propiedad canvas transform. Este modo es más eficiente que mover la el canvas item raíz (y por ende, toda la escena).
fr: Les effets comme le défilement sont mieux réalisés en manipulant la propriété de transformation de canevas. Cette approche est plus efficace que de déplacer l’élément de canevas racine (et donc toute la scène).
ja: スクロールのような効果を得るには、キャンバスのtransformプロパティを操作します。この方法は、ルートキャンバス項目(シーン全体が)を移動するよりも効率的です。
zh_cn: 像滚动这样的效果最好是通过操纵画布transform变换属性来实现。这种方法比移动根画布项(以及整个场景)更有效。

source: Usually though, we don't want *everything* in the game or app to be subject to the canvas transform. Examples of this are:
de: Normalerweise wollen wir nicht, dass *alles* im Spiel durch Canvas Transform beeinflusst werden soll. Dazu zählen beispielsweise:
es: Normalmente no queremos que *todo* el juego o aplicación sea sujeto a los cambios en el transform del canvas. Ejemplos de esto son:
fr: Habituellement, cependant, nous ne voulons pas que *tout* dans le jeu ou l’application soit soumis à la transformation du canevas. Voici quelques exemples :
ja: しかし通常は、ゲームやアプリケーションの\ *すべて*\ をキャンバス変換の対象にすることは望ましくありません。 この例は次のとおりです:

source: **Parallax Backgrounds**: Backgrounds that move slower than the rest of the stage.
de: **Parallaxe Hintergründe**: Sich langsamer bewegende Hintergründe im Gegensatz zum Rest des Geschehens.
es: **Parallax Backgrounds**: Fondos que se mueven más lentamente que el resto del escenario.
fr: **Arrière-plans de parallaxe**: Arrière-plans qui bougent plus lentement que le reste de la scène.
ja: **パララックス背景**:ステージの他の部分よりもゆっくり移動する背景。
zh_cn: **Parallax Backgrounds(视差背景)** : 比场景其他部分移动得慢的背景.

source: **UI**: Think of a user interface (UI) or Heads-up display (HUD) superimposed on our view of the game world. We want a life counter, score display and other elements to retain their screen positions even when our view of the game world is changing.
de: **UI**: Stellen Sie sich eine Benutzeroberfläche (UI) oder ein Heads-up-Display (HUD) vor, die unsere Sicht auf die Spielwelt überlagert. Wir möchten, dass ein Lebenszähler, eine Punkteanzeige und andere Elemente ihre Bildschirmpositionen beibehalten, auch wenn sich unsere Sicht auf die Spielwelt ändert.
es: **UI**: Piensa en una interfaz de usuario (UI) o Heads-up display (HUD, proyección elevada de información) superpuesta en nuestra vista de juego. Queremos un contador de vida, contador de puntos y otros elementos que tienen que manter su posición mientras la vista del mundo del juego cambia.
fr: * * UI * *: pensez à une interface utilisateur (UI) ou à un Heads-up display (HUD) superposé sur notre vision du monde du jeu. Nous voulons un compteur de vie, un affichage de score et d’autres éléments pour conserver leurs positions à l'écran, même lorsque notre vision du monde du jeu change.
ja: **UI**: ヘッドアップディスプレイ、またはユーザーインターフェイス。 背景が動いても、ライフカウンターやスコアなどは移動しないはずです。

source: **Transitions**: We may want visual effects used for transitions (fades, blends) to remain at a fixed screen location.
de: **Übergänge**: Übergangseffekte (Ein-/Ausblendungen, Bildüberlagerungen) bleiben üblicherweise ebenso auf einer festen Position.
es: **Transiciones**: Podríamos preferir que efectos usados para transiciones (mezclas, desvanecimientos) se mantengan en un lugar fijo de la pantalla.
fr: **Transitions**: Nous pouvons vouloir des effets visuels utilisés pour les transitions (fondus, mélanges) pour rester à un emplacement d’écran fixe.
ja: **トランジション**:トランジション(フェード、ブレンド)に使用されるエフェクトでも、固定された場所に留めておくことが望ましい場合があります。
zh_cn: **Transitions(转场)** : 我们应该希望用于转场的效果(淡入淡出之类的东西)也保持在固定的位置.

source: How can these problems be solved in a single scene tree?
de: Wie können diese Umstände innerhalb eines einzelnen Szenenbaums berücksichtigt werden?
es: ¿Cómo se pueden resolver esos problemas desde un único árbol de escenas?
fr: Comment ces problèmes peuvent-ils être résolus dans une arborescence de scène unique ?
ja: 単一のシーンツリーでこれらの問題をどのように解決できるでしょうか？
zh_cn: 如何在单个场景树中解决这些问题？

source: CanvasLayers
fr: Couches de canevas
ja: キャンバス・レイヤー
zh_cn: CanvasLayer(画布层)

source: The answer is :ref:`CanvasLayer <class_CanvasLayer>`, which is a node that adds a separate 2D rendering layer for all its children and grand-children. Viewport children will draw by default at layer "0", while a CanvasLayer will draw at any numeric layer. Layers with a greater number will be drawn above those with a smaller number. CanvasLayers also have their own transform and do not depend on the transform of other layers. This allows the UI to be fixed in screen-space while our view on the game world changes.
de: Die Antwort ist :ref:`CanvasLayer <class_CanvasLayer>`, ein Node, der eine separate 2D-Ebene zum Zeichnen seiner untergeordneten Nodes bietet. Nodes unter dem (Haupt-)Viewport werden grundsätzlich auf Ebene "0" gezeichnet, wohingegen ein CanvasLayer auf jeder beliebigen Ebene sein kann. Ebenen mit einer höheren Nummer liegen über jenen mit einer kleineren. CanvasLayers besitzen jeweils eigene Transformationsanpassungen und sind nicht von denen der anderen Ebenen abhängig. Dies erlaubt es, UI-Elemente auf einer bestimmten Stelle zu fixieren während sich die Umgebung verändert.
es: La solución es la :ref:`CanvasLayer <class_CanvasLayer>`, que es un nodo que añade una capa de renderizado 2D separada para todos sus nodos hijos y descendientes. Los hijos de Viewport dibujarán por defecto en la capa "0", mientras que CanvasLayer dibujará en cualquier capa numérica. Las capas con un número mayor se dibujarán por encima de las capas con un número menor. CanvasLayers también tienen su propia transformación, y no dependen de la transformación de otras capas. Esto permite que la interfaz de usuario se fije en el lugar mientras se cambia la vista del mundo del juego.
fr: La réponse est :ref:`CanvasLayer <class_CanvasLayer>`, qui est un nœud qui ajoute un calque de rendu 2D distinct pour tous ses enfants et ses petits-enfants. Les enfants de la fenêtre d'affichage dessineront par défaut au calque "0", tandis qu’un CanvasLayer est dessiné à n’importe quelle couche numérique. Les calques avec un plus grand nombre seront dessinés au-dessus de ceux avec un plus petit nombre. Les CanvasLayer ont également leur propre transformation et ne dépendent pas de la transformation des autres calques. Cela permet de fixer l'interface utilisateur sur place pendant que le monde bouge.
ja: その答えは \ :ref:`CanvasLayer <class_CanvasLayer>` です。これは、そのすべての子と孫のために別々の2Dレンダリングレイヤを追加するノードです。CanvasLayerは任意の数値レイヤで描画しますが、Viewportの子はデフォルトでレイヤー "0" で描画します。大きい番号のレイヤーは小さい番号のレイヤーの上に描画されます。CanvasLayersにも独自の幾何学変換があり、他のレイヤーの幾何学変換には依存しません。これにより、UIをスクリーンスペースに固定しながら、ゲームのワールドに対するビューを変更できます。
zh_cn: 答案是 :ref:`CanvasLayer <class_CanvasLayer>` , 它是一个节点, 为所有子代和孙代添加一个单独的2D渲染层.Viewport的子节点默认在图层 "0 " 处绘制, 而CanvasLayer将在任何数字层处绘制. 数字较大的图层将绘制在数字较小的图层之上.CanvasLayers也有自己的变换, 不依赖于其他层的变换. 这使得当我们对游戏世界的观察发生变化时,UI可以固定在屏幕空间中.

source: An example of this is creating a parallax background. This can be done with a CanvasLayer at layer "-1". The screen with the points, life counter and pause button can also be created at layer "1".
de: Ein Beispiel dazu ist ein Parallax-Hintergrund. So kann dieser in einem CanvasLayer auf Ebene "-1" dargestellt werden. Die Ansicht mit Punktestand, Lebensanzeige und der Schaltfläche zum Pausieren dagegen werden auf Ebene "1" angelegt.
es: Un ejemplo de esto es la creación de un fondo parallax. Esto se puede hacer con un CanvasLayer en la capa "-1". La pantalla con los puntos, el contador de vida y el botón de pausa también se puede crear en la capa "1".
fr: Un exemple de ceci est la création d'un fond en parallaxe. Cela peut être fait avec un CanvasLayer au calque "-1". L'écran avec les points, le compteur de durée de vie et le bouton de pause peuvent également être créés au calque "1".
ja: この一例は、パララックスの背景を作成することです。 これはCanvasLayerの "-1" レイヤーで行うことができます。ポイント、ライフカウンター、ポーズ・ボタンを含む画面もレイヤー "1" で作成できます。
zh_cn: 比如说创建Parallax Background(视差背景). 这可以通过层为 "-1" 的CanvasLayer完成. 带有分数, 生命计数器和暂停按钮的屏幕也可以创建在编号为 "1" 的层中.

source: Here's a diagram of how it looks:
de: Zur Veranschaulichung, hier ein Diagramm:
es: Aquí hay un diagrama de cómo se ve:
fr: Voici un diagramme de sa représentation :
ja: 外観は次のとおりです:
zh_cn: 下面是它的图示:

source: CanvasLayers are independent of tree order, and they only depend on their layer number, so they can be instantiated when needed.
de: CanvasLayers funktionieren unabhängig von der Anordnung der Baumhierarchie, sie hängen einzig von der Ebenennummer ab, die für die Instanzierung benötigt wird.
es: Los nodos CanvasLayer son independientes del orden en el árbol y sólo dependen del número de capa, así que pueden ser instanciados cuando y donde sean necesarios.
fr: Les CanvasLayers sont indépendants de l'ordre des arborescences, ils dépendent uniquement de leur numéro de couche, ainsi Ils peuvent être instanciés si nécessaire.
ja: キャンバス・レイヤーはツリーの順序に依存せず、レイヤ番号のみに依存するため、必要に応じてインスタンス化できます。
zh_cn: CanvasLayer 独立于树顺序, 它们仅依赖于它们的层数, 因此可以只在需要时让它们实例化.

source: CanvasLayers aren't necessary to control the drawing order of nodes. The standard way to ensuring that a node is correctly drawn 'in front' or 'behind' others is to manipulate the order of the nodes in the scene panel. Perhaps counterintuitively, the topmost nodes in the scene panel are drawn on *behind* lower ones in the viewport. 2d nodes also have a property for controlling their drawing order (see :ref:`Node2D.z_index <class_Node2D_property_z_index>`).
de: CanvasLayers sind nicht erforderlich, um die Zeichenreihenfolge von Nodes zu steuern. Die Standardmethode um sicherzustellen, dass ein Node korrekt 'vor' oder 'hinter' anderen gezeichnet wird besteht darin, die Reihenfolge der Nodes im Szenenfenster zu ändern. Möglicherweise werden die obersten Nodes im Szenenfenster *hinter* den unteren Nodes im Ansichtsfenster gezeichnet und nicht wie intuitiv angenommen andersherum. 2D-Nodes haben auch eine Eigenschaft zum Steuern ihrer Zeichnungsreihenfolge (siehe :ref:`Node2D.z_index <class_Node2D_property_z_index>`).
es: Las CanvasLayers no están necesariamente para controlar el orden de dibujado de los nodos. El modo normal de asegurar que un nodo es dibujado correctamente 'al frente' o 'detrás' otros, es manipulando el orden de los nodos en el panel de escena. Los nodos más arriba en el panel de escena, son dibujados *detrás* de los que están más abajo en el viewport. Nodos 2D también tienen la propiedad de controlar el orden de dibujado (ver :ref:`Node2D.z_index <class_Node2D_property_z_index>`).
fr: CanvasLayers n'est pas nécessaire pour contrôler l'ordre de dessin des nœuds. La façon standard de s'assurer qu'un nœud est correctement dessiné " devant " ou " derrière " les autres est de manipuler l'ordre des nœuds dans le panneau de scène. Contre-intuitivement peut-être, les nœuds les plus en haut du panneau de scène sont dessinés sur les nœuds inférieurs *en arrière* de la fenêtre d'affichage. Les nœuds 2d ont également une propriété pour contrôler leur ordre de dessin (voir :ref:`Node2D.z_index <class_Node2D_property_z_index>`).
ja: キャンバス・レイヤーはノードの描画順序を制御する必要はありません。 ノードが他のノードの「前面」または「背面」に正しく描画されるようにするための標準的な方法は、シーンパネル内のノードの順序を操作することです。 おそらく直感に反して、シーンパネルの一番上のノードはViewportの下のノードの*後ろ*に描かれています。 2dノードは描画順を制御するためのプロパティも持っています( \ :ref:`Node2D.z_index <class_Node2D_property_z_index>` を参照してください)。
zh_cn: CanvasLayer 不需要控制节点的绘制顺序. 确保节点被正确绘制在 "前面" 或 "后面" 的标准方法是操作场景面板中节点的顺序. 也许违反直觉, 场景面板中最上面的节点绘制在视图端口中较低的节点 *后面* . 二维节点也有控制其绘图顺序的属性(参考 :ref:`Node2D.z_index <class_Node2D_property_z_index>` ).
