Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/custom_drawing_*_2d.po
Languages: fr, ru, zh_cn, zh_tw

source: The reason is that your GPU is actually displaying the frames as fast as it can. We need to "normalize" the drawing by this speed; to achieve that, we have to make use of the ``delta`` parameter of the ``_process()`` function. ``delta`` contains the time elapsed between the two last rendered frames. It is generally small (about 0.0003 seconds, but this depends on your hardware), so using ``delta`` to control your drawing ensures that your program runs at the same speed on everybody's hardware.
fr: La raison est que votre GPU affiche les images aussi rapidement que possible. Nous devons "normaliser" le dessin par cette vitesse. Pour ce faire, nous devons utiliser le paramètre ``delta`` de la fonction ``_process()``. ``delta`` contient le temps écoulé entre les deux dernières images rendues. Il est généralement petit (environ 0,0003 seconde, mais cela dépend de votre matériel). Ainsi, l'utilisation de ``delta`` pour contrôler votre dessin assure que votre programme s'exécutera à la même vitesse sur le matériel de tout le monde.
ru: Причина в том, что ваш графический процессор на самом деле отображает кадры так быстро, как только может. Нам нужно "нормализовать" рисунок под эту скорость; для этого мы должны использовать параметр ``delta`` функции ``_process ()``. ``delta`` содержит время, прошедшее между двумя последними отрисованными кадрами. Как правило, он невелик (около 0,0003 секунды, но это зависит от вашего оборудования), поэтому использование ``delta`` для управления вашим рисунком гарантирует, что ваша программа будет работать с одинаковой скоростью на любом оборудовании.
zh_cn: 原因是你的GPU实际上正在尽可能快地显示帧。 我们需要以这个速度为基准“标准化”绘图的速度。 为了实现这个效果，我们必须使用 ``_process()`` 函数的 ``delta`` 参数。 ``delta`` 包含最后两个渲染帧之间经过的时间。 它通常很小(约0.0003秒，但这取决于你的硬件)。 因此，使用 ``delta`` 来控制绘图可确保程序在每个人的硬件上以相同的速度运行。
zh_tw: 原因是你的GPU實際上正在盡可能快地顯示影格. 我們需要以這個速度為基準 "標準化" 繪圖的速度. 為了實作這個效果, 我們必須使用 ``_process()`` 函式的 ``delta`` 參數. ``delta`` 包含最後兩個渲染影格之間經過的時間. 它通常很小(約0.0003秒, 但這取決於你的硬體). 因此, 使用 ``delta`` 來控制繪圖可確保程式在每個人的硬體上以相同的速度運作.

source: In our case, we simply need to multiply our ``rotation_angle`` variable by ``delta`` in the ``_process()`` function. This way, our 2 angles will be increased by a much smaller value, which directly depends on the rendering speed.
fr: Dans notre cas, nous devons simplement multiplier notre variable ``rotation_angle`` par ``delta`` dans la fonction ``_process()``. De cette façon, nos 2 angles seront augmentés d'une valeur beaucoup plus petite, qui dépend directement de la vitesse de rendu.
ru: В нашем случае нам просто нужно умножить нашу переменную ``rotation_angle`` на ``delta`` в функции ``_process()``. Таким образом, наши 2 угла будут увеличены на гораздо меньшее значение, которое напрямую зависит от скорости рендеринга.
zh_cn: 在我们的示例中，我们只需要在 ``_process()`` 函数中将 ``rotation_angle`` 变量乘以 ``delta`` 。 这样，我们的2个角度会以一个小得多的值递增，值的大小直接取决于渲染速度。
zh_tw: 在我們的範例中, 我們只需要在 ``_process()`` 函式中將 ``rotation_angle`` 變數乘以 ``delta`` . 這樣, 我們的2個角度會以一個小得多的值遞增, 值的大小直接取決於渲染速度.

source: Let's run again! This time, the rotation displays fine!
fr: Allons-y encore ! Cette fois, la rotation s'opère correctement !
ru: Давайте снова запустим! На этот раз вращение отображается правильно!
zh_cn: 让我们再运行一次！ 这次，旋转显示正常！
zh_tw: 讓我們再運作一次！ 這次, 旋轉顯示正常！

source: Antialiased drawing
zh_tw: **抗鋸齒：**

source: Godot offers method parameters in :ref:`draw_line<class_CanvasItem_method_draw_line>` to enable antialiasing, but not all custom drawing methods offer this ``antialiased`` parameter.
zh_tw: Godot在 :ref:`draw_line<class_CanvasItem_method_draw_line>`中提供方法參數來啟用抗鋸齒功能，但並非所有自訂繪圖方法都提供這個 ``抗鋸齒（antialiased）`` 參數。

source: For custom drawing methods that don't provide an ``antialiased`` parameter, you can enable 2D MSAA instead, which affects rendering in the entire viewport. This provides high-quality antialiasing, but a higher performance cost and only on specific elements. See :ref:`doc_2d_antialiasing` for more information.
zh_tw: 對於不提供 ``抗鋸齒（antialiased）`` 參數的自訂繪圖方法，你可以啟用 2D MSAA，這會影響整個視口的渲染。這個功能（2D MSAA）提供了高品質的抗鋸齒，但性能成本更高，而且只適用於特定元素。參見 :ref:`doc_2d_antialiasing` 以瞭解更多資訊。

source: Tools
fr: Outils
ru: Инструменты
zh_cn: 工具
zh_tw: 工具

source: Drawing your own nodes might also be desired while running them in the editor. This can be used as a preview or visualization of some feature or behavior. See :ref:`doc_running_code_in_the_editor` for more information.
zh_tw: 在編輯器中運作節點時，可能也會用到繪圖。可以用於某些功能或行為的預覽或視覺化。詳情請參閱 :ref:`doc_running_code_in_the_editor`。

source: Translation status
zh_tw: 翻譯狀態

source: Why?
fr: Pourquoi ?
zh_cn: 为什么？

source: Godot has nodes to draw sprites, polygons, particles, and all sorts of stuff. For most cases, this is enough; but not always. Before crying in fear, angst, and rage because a node to draw that specific *something* does not exist... it would be good to know that it is possible to easily make any 2D node (be it :ref:`Control <class_Control>` or :ref:`Node2D <class_Node2D>` based) draw custom commands. It is *really* easy to do it, too.
fr: Godot a des nœuds pour dessiner des sprites, des polygones, des particules et toutes sortes de choses. Dans la plupart des cas, cela suffit mais pas toujours. Avant de s'énerver parce qu'un nœud pour dessiner *quelque chose* de spécifique n’existe pas, il serait bon de savoir qu’il est possible de créer facilement n'importe quel nœud 2D (qu’il soit d'origine :ref:`Contrôle < class_Control>` ou :ref:`Node2D <class_Node2D> `) de commandes de dessins personnalisées. C'est *vraiment* facile à faire aussi.
ru: В Godot есть узлы для рисования спрайтов, многоугольников, частиц и прочего. В большинстве случаев этого достаточно; но не всегда. Прежде чем плакать от страха, тоски и ярости из-за того, что узла для рисования этого конкретного *чего-то* не существует... было бы хорошо знать, что можно легко заставить любой 2D-узел (на основе :ref:`Control < class_Control> `или :ref:` Node2D <class_Node2D> `) рисовать пользовательские команды. Также это *действительно* легко сделать.
zh_cn: Godot有Sprite、多边形、粒子和各种东西的节点。 在大多数情况下，他们已经足够了, 但并不总是这样。在因为不存在绘制特定 *东西* 的节点，而在恐惧、焦虑和愤怒中哭泣之前...有知道, 让任何2D节点(不管它是继承自 :ref:`Control <class_Control>` 还是 :ref:`Node2D <class_Node2D>` ) 绘制一个自定义命令是很轻松的。 而且这 *真的非常* 容易操作。

source: But...
fr: Mais...
zh_cn: 但是...

source: Custom drawing manually in a node is *really* useful. Here are some examples why:
fr: Le dessin personnalisé manuellement dans un nœud est *vraiment* utile. Voici quelques exemples pourquoi :
zh_cn: 在节点中手动自定义绘图 *真的* 非常有用。 以下是一些示例原因:

source: Drawing shapes or logic that is not handled by nodes (example: making a node that draws a circle, an image with trails, a special kind of animated polygon, etc).
fr: Dessiner des formes ou des logiques non gérées par des nœuds (exemple: créer un nœud qui dessine un cercle, une image avec des traînées, un type spécial de polygone animé, etc.).
zh_cn: 绘制未由节点处理的形状或逻辑(例如：制作一个可以绘制圆，带有轨迹的图像，特殊类型的动画多边形等的节点)。

source: Visualizations that are not that compatible with nodes: (example: a tetris board). The tetris example uses a custom draw function to draw the blocks.
fr: Des visualisations qui ne sont pas compatibles avec les nœuds: (exemple: une carte tetris). L'exemple de tetris utilise une fonction de dessin personnalisée pour dessiner les blocs.
zh_cn: 与节点不兼容的可视化：(例如：俄罗斯方块)。 Godot俄罗斯方块示例使用自定义绘制功能来绘制那些小块。

source: Drawing a large number of simple objects. Custom drawing avoids the overhead of using nodes which makes it less memory intensive and potentially faster.
fr: Dessiner un grand nombre d'objets simples. Le dessin personnalisé permet d'éviter l'utilisation de nœuds, ce qui réduit l'utilisation de la mémoire et est potentiellement plus rapide.
zh_cn: 绘制大量的简单对象。自定义绘制避免了使用节点的开销，这减少了内存占用，而且有可能更快。

source: Making a custom UI control. There are plenty of controls available, but it's easy to run into the need to make a new, custom one.
fr: Création d'un contrôle d'interface utilisateur personnalisé. Il existe de nombreux contrôles disponibles, mais on peut rapidement avoir besoin d'en créer un nouveau, personnalisé.
zh_cn: 制作自定义UI控件。 尽管有很多可用的控件，但很容易遇到需要制作新自定义控件的情况。

source: OK, how?
fr: D'accord, comment ?
zh_cn: 好吧，怎么做？

source: If re-drawing is required because a state or something else changed, simply call :ref:`CanvasItem.update() <class_CanvasItem_method_update>` in that same node and a new ``_draw()`` call will happen.
fr: Si vous devez redessiner parce qu'un état ou quelque chose d'autre a changé, appelez simplement :ref:`CanvasItem.update() <class_CanvasItem_method_update>` dans ce même nœud et un nouvel appel _draw() aura lieu.
zh_cn: 如果由于状态或其他更改而需要重新绘制，只需在同一节点中调用 :ref:`CanvasItem.update()<class_CanvasItem_method_update>` 就会发生新的 ``_draw()`` 调用。

source: In some cases, it may be desired to draw every frame. For this, just call ``update()`` from the ``_process()`` callback, like this:
fr: Dans certains cas, il peut être souhaitable de dessiner chaque image. Pour cela, appelez simplement ``update()`` à partir du rappel ``_process()``, comme ceci :
ru: В некоторых случаях может потребоваться отрисовка каждого кадра. Для этого просто вызовите ``update ()`` из обратного вызова ``_process ()``, например:
zh_cn: 在某些情况下，可能需要绘制每一帧。 为此，只需从 ``_process()`` 回调调用 ``update()`` ，如下所示:

source: Basically, drawing a shape on the screen requires it to be decomposed into a certain number of points linked from one to the next. As you can imagine, the more points your shape is made of, the smoother it will appear, but the heavier it will also be in terms of processing cost. In general, if your shape is huge (or in 3D, close to the camera), it will require more points to be drawn without it being angular-looking. On the contrary, if your shape is small (or in 3D, far from the camera), you may decrease its number of points to save processing costs; this is known as *Level of Detail (LoD)*. In our example, we will simply use a fixed number of points, no matter the radius.
fr: Fondamentalement, dessiner une forme à l'écran nécessite de la décomposer en un certain nombre de points liés de l'un à l'autre. Comme vous pouvez l’imaginer, plus votre forme est composée de points, plus elle paraîtra lisse, mais plus elle sera lourde en termes de charge de traitement. En général, si votre forme est énorme (ou en 3D, proche de la caméra), il faudra dessiner plus de points sans qu'elle ait d'aspect angulaire. Au contraire, si votre forme est petite (ou en 3D, loin de la caméra), vous pouvez réduire son nombre de points pour diminuer la charge de traitement. Cela s'appelle *Niveau de détail (LoD - Level of Details)*. Dans notre exemple, nous utiliserons simplement un nombre fixe de points, quel que soit le rayon.

source: Remember the number of points our shape has to be decomposed into? We fixed this number in the ``nb_points`` variable to a value of ``32``. Then, we initialize an empty ``PoolVector2Array``, which is simply an array of ``Vector2``\ s.
fr: Rappelez-vous le nombre de points en lequel notre forme doit être décomposée ? Nous avons fixé ce nombre dans la variable ``nb_points`` à une valeur de ``32``. Ensuite, nous initialisons un ``PoolVector2Array`` vide, qui est simplement un tableau de ``Vector2``.
ru: Помните, на сколько точек нужно разложить нашу фигуру? Мы зафиксировали это число в переменной ``nb_points`` на значение ``32``. Затем мы инициализируем пустой ``PoolVector2Array``, который представляет собой просто массив ``Vector2 ``\s.
zh_cn: 还记得我们的形状必须分解成成的点的数量吗？ 我们将 ``nb_points`` 变量中的这个数字修改为32。然后，我们初始化一个空的 ``PoolVector2Array`` ，就是一个Vector2数组。

source: The reason why each angle is decreased by 90° is that we will compute 2D positions out of each angle using trigonometry (you know, cosine and sine stuff...). However, to be simple, ``cos()`` and ``sin()`` use radians, not degrees. The angle of 0° (0 radian) starts at 3 o'clock, although we want to start counting at 12 o'clock. So we decrease each angle by 90° in order to start counting from 12 o'clock.
fr: La raison pour laquelle chaque angle est réduit de 90° est que nous allons calculer les positions 2D à partir de chaque angle en utilisant la trigonométrie (vous savez, le cosinus et le sinus ...). Cependant, pour être simple, ``cos()`` et ``sin()`` utilisent des radians, pas des degrés. L'angle de 0° (0 radian) commence à 3 heures bien que nous souhaitions commencer à compter à 12 heures. Nous réduisons donc chaque angle de 90° pour pouvoir compter à partir de 12 heures.
ru: Причина, по которой каждый угол уменьшается на 90°, заключается в том, что мы будем вычислять 2D-положения для каждого угла, используя тригонометрию (вы знаете, косинус и синус...). Однако для простоты ``cos ()`` и ``sin ()`` используют радианы, а не градусы. Угол 0° (0 радиан) начинается с 3 часов, хотя мы хотим начать отсчет с 12 часов. Таким образом, мы уменьшаем каждый угол на 90 °, чтобы начать отсчет с 12 часов.
zh_cn: 每个角度减小90°的原因是我们将使用三角函数计算每个角度的2D位置（你知道，余弦和正弦之类的东西......）。 但是，为了简单， ``cos()`` 和 ``sin()`` 使用弧度，而不是度数作为参数。 虽然我们想在12点钟位置开始计数，但0°(0弧度)的角度从3点钟位置开始。 因此我们将每个角度减小90°，以便从12点位置开始计数。

source: The actual position of a point located on a circle at angle ``angle`` (in radians) is given by ``Vector2(cos(angle), sin(angle))``. Since ``cos()`` and ``sin()`` return values between -1 and 1, the position is located on a circle of radius 1. To have this position on our support circle, which has a radius of ``radius``, we simply need to multiply the position by ``radius``. Finally, we need to position our support circle at the ``center`` position, which is performed by adding it to our ``Vector2`` value. Finally, we insert the point in the ``PoolVector2Array`` which was previously defined.
fr: La position actuelle d'un point situé sur un cercle à l'angle ``angle`` (en radians) est donnée par ``Vector2(cos(angle), sin(angle))``. Puisque ``cos()`` et ``sin()`` renvoient des valeurs comprises entre -1 et 1, la position est située sur un cercle de rayon 1. Pour avoir cette position sur notre cercle, lequel a un rayon de``radius``, nous devons simplement multiplier la position par ``radius``. Enfin, nous devons positionner notre cercle à la position ``center``, ce qui est fait en l'ajoutant à notre valeur ``Vector2``. Enfin, nous insérons le point dans le ``PoolVector2Array`` défini précédemment.
ru: Фактическое положение точки, расположенной на окружности под углом ``angle`` (в радианах), определяется как ``Vector2(cos (angle), sin (angle))``. Так как ``cos ()`` и ``sin ()`` возвращают значения от -1 до 1, позиция находится на окружности с радиусом 1. Чтобы это положение было на нашей опорной окружности, которая имеет радиус ``radius``, нам просто нужно умножить позицию на ``radius``. Наконец, нам нужно расположить наш опорный круг в ``центральном`` положении, что выполняется путем добавления его к нашему значению ``Vector2``. Наконец, мы вставляем точку в массив ``PoolVector2Array``, который был определен ранее.
zh_cn: 以角度 ``angle`` (单位是弧度)位于圆上的点的实际位置由 ``Vector2(cos(angle), sin(angle))`` 给出。 由于 ``cos()`` 和 ``sin()`` 返回介于-1和1之间的值，因此位置位于半径为1的圆上。要将此位置放在我们的半径为 ``radius`` 的辅助圆上，我们只需要将那个位置乘以 ``radius`` 。 最后，我们需要将我们的辅助圆定位在 ``center`` 位置，这是通过将其与我们的 ``Vector2`` 相加来实现的。 最后，我们在之前定义的 ``PoolVector2Array`` 中插入这个点。

source: Finally, we must not forget to call the ``update()`` function, which automatically calls ``_draw()``. This way, you can control when you want to refresh the frame.
fr: Enfin, nous ne devons pas oublier d'appeler la fonction ``update()``, qui appelle automatiquement ``_draw()``. De cette façon, vous pouvez contrôler le moment où vous souhaitez actualiser le cadre.
ru: Наконец, мы не должны забывать вызывать функцию ``update()``, которая автоматически вызывает ``_draw()``. Таким образом, вы можете контролировать, когда вы хотите обновить кадр.
zh_cn: 最后，我们不要忘记调用 ``update()`` 函数，它自动调用 ``_draw()`` 。 这样，您可以控制何时要刷新这一帧。

source: Drawing your own nodes might also be desired while running them in the editor to use as a preview or visualization of some feature or behavior.
fr: Dessiner vos propres nœuds peut également être désiré lors de leur exécution dans l'éditeur pour les utiliser comme prévisualisation ou visualisation de certaines fonctionnalités ou comportements.
ru: Рисование ваших собственных узлов также может быть желательно во время их запуска в редакторе, чтобы использовать их в качестве предварительного просмотра или визуализации какой-либо функции или поведения.
zh_cn: 绘制自己的节点的功能在编辑器中, 用来可视化/预览某种特性或行为的时候可能会有用。

source: Remember to use the "tool" keyword at the top of the script (check the :ref:`doc_gdscript` reference if you forgot what this does).
fr: N'oubliez pas d'utiliser le mot clé "tool" en haut du script (vérifiez la référence :ref:`doc_gdscript` si vous avez oublié ce que cela fait).
ru: Не забудьте использовать ключевое слово "tool" в верхней части сценария (посмотрите :ref:`doc_gdscript`, если вы забыли, что оно делает).
zh_cn: 请记住在脚本顶部使用“tool”关键字(如果您忘记了它做什么，请查看 :ref:`doc_gdscript` 参考文档)。
