Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/custom_drawing_*_2d.po
Languages: fr, ru, zh_cn, zh_tw

source: Custom drawing in 2D
fr: Dessin personnalisé en 2D
ru: Пользовательская отрисовка в 2D
zh_cn: 2D中的自定义绘图
zh_tw: 2D 中的自訂繪圖

source: Introduction
ru: Введение
zh_tw: 前言

source: Godot has nodes to draw sprites, polygons, particles, and all sorts of stuff. For most cases, this is enough. If there's no node to draw something specific you need, you can make any 2D node (for example, :ref:`Control <class_Control>` or :ref:`Node2D <class_Node2D>` based) draw custom commands.
zh_tw: Godot 有用於繪製精靈、多邊形、粒子以及各種東西的節點。在大多數情況下，這就已經足夠了，但並不總是這樣。可別因為不存在繪製*某種特定*東西的節點，而在恐懼、焦慮、憤怒……中哭泣。要知道，任何 2D 節點（不管它是繼承自 :ref:`Control <class_Control>` 還是 :ref:`Node2D <class_Node2D>`）都可以很輕鬆地繪製自訂命令。而且這*真的*非常容易操作。

source: Custom drawing in a 2D node is *really* useful. Here are some use cases:
zh_tw: 2D 節點中的自訂繪製*非常*有用。下面是一些用例：

source: Drawing shapes or logic that existing nodes can't do, such as an image with trails or a special animated polygon.
zh_tw: 繪製現有節點型別無法完成的形狀或邏輯，例如帶有軌跡或特殊動態多邊形的圖像。

source: Visualizations that are not that compatible with nodes, such as a tetris board. (The tetris example uses a custom draw function to draw the blocks.)
zh_tw: 與節點不太相容的呈現方式，比如俄羅斯方塊的棋盤。（俄羅斯方塊的例子使用的是自訂繪製函式來繪製方塊。）

source: Drawing a large number of simple objects. Custom drawing avoids the overhead of using a large number of nodes, possibly lowering memory usage and improving performance.
zh_tw: 繪製大量簡單的物件。自訂繪製避免了使用大量節點的開銷，能降低記憶體佔用，並提高性能。

source: Making a custom UI control. There are plenty of controls available, but when you have unusual needs, you will likely need a custom control.
zh_tw: 製作自訂的 UI 控制項，以滿足很多可用的控制項之外的特別需求。

source: Drawing
ru: Отрисовка
zh_tw: 繪製

source: Add a script to any :ref:`CanvasItem <class_CanvasItem>` derived node, like :ref:`Control <class_Control>` or :ref:`Node2D <class_Node2D>`. Then override the ``_draw()`` function.
fr: Ajoutez un script à n'importe quel nœud dérivé d' :ref:`Élément de Canevas <class_CanvasItem>, comme :ref:` Contrôle <contrôle_classe>` ou :ref:`Node2D <class_Node2D>`. Puis remplacez la fonction _draw().
ru: Добавьте сценарий к любому производному узлу :ref:`CanvasItem <class_CanvasItem>`, например :ref:`Control <class_Control>` или :ref:`Node2D <class_Node2D>`. Затем переопределите функцию ``_draw ()``.
zh_cn: 添加一个脚本到任何 :ref:`CanvasItem <class_CanvasItem>` 的派生节点，如 :ref:`Control <class_Control>` 或 :ref:`Node2D <class_Node2D>`。 然后重载_draw()函数。
zh_tw: 新增一個腳本到任何 :ref:`CanvasItem <class_CanvasItem>` 的衍生節點，如 :ref:`Control <class_Control>` 或 :ref:`Node2D <class_Node2D>`。然後重載 ``_draw()`` 函式。

source: Draw commands are described in the :ref:`CanvasItem <class_CanvasItem>` class reference. There are plenty of them.
fr: Les commandes de dessin sont décrites dans la référence de classe :ref:`Elément de Canevas <class_CanvasItem>`. Elles sont nombreuses.
ru: Команды рисования описаны в справочнике по классу :ref:`CanvasItem <class_CanvasItem>`. Их много.
zh_cn: 绘制命令在 :ref:`CanvasItem <class_CanvasItem>` 类型引文中有所描述, 有不少绘制命令。
zh_tw: 繪製命令在 :ref:`CanvasItem <class_CanvasItem>` 的類參考中有所描述，數量很多。

source: Updating
fr: Mise à jour
ru: Обновление
zh_cn: 更新
zh_tw: 更新

source: The ``_draw()`` function is only called once, and then the draw commands are cached and remembered, so further calls are unnecessary.
fr: La fonction _draw() n'est appelée qu'une fois, puis les commandes de dessin sont mises en mémoire tampon et mémorisées, de sorte que les appels ultérieurs sont inutiles.
ru: Функция ``_draw ()`` вызывается только один раз, а затем команды рисования кэшируются и запоминаются, поэтому дальнейшие вызовы не нужны.
zh_cn: ``_draw()`` 函数只调用一次，然后绘制命令被缓存并记住，因此不需要进一步调用。
zh_tw: ``_draw()`` 函式只呼叫一次, 然後繪製命令被快取並記住, 因此不需要進一步呼叫.

source: If re-drawing is required because a state or something else changed, call :ref:`CanvasItem.queue_redraw() <class_CanvasItem_method_queue_redraw>` in that same node and a new ``_draw()`` call will happen.
zh_tw: 如果因為狀態或其他方面的變化而需要重新繪製，在目前節點中呼叫 :ref:`CanvasItem.update() <class_CanvasItem_method_update>` ，觸發新的 ``_draw()`` 呼叫。

source: Here is a little more complex example, a texture variable that will be redrawn if modified:
fr: Voici un exemple un peu plus complexe. Une variable de texture qui sera redessinée si modifiée :
ru: Вот немного более сложный пример, переменная текстуры, которая будет перерисована при изменении:
zh_cn: 这是一个更复杂的示例。 这是一个被修改就会重新绘制的纹理变量:
zh_tw: 這是一個更複雜的範例，一個被修改就會重新繪製的紋理變數：

source: In some cases, it may be desired to draw every frame. For this, call ``queue_redraw()`` from the ``_process()`` callback, like this:
zh_tw: 在某些情況下, 可能需要繪製每一影格. 為此, 只需從 ``_process()`` 回呼函式呼叫 ``update()`` , 如下所示:

source: Coordinates
zh_tw: 座標

source: The drawing API uses the CanvasItem's coordinate system, not necessarily pixel coordinates. Which means it uses the coordinate space created after applying the CanvasItem's transform. Additionally, you can apply a custom transform on top of it by using :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` or :ref:`draw_set_transform_matrix<class_CanvasItem_method_draw_set_transform_matrix>`.
zh_tw: 繪圖 API 使用 CanvasItem 的坐標系統，不一定是像素座標。這意味著它使用在應用 CanvasItem 的變換後建立的座標空間。此外，你可以使用 :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` 或 :ref:`draw_set_transform_matrix<class_CanvasItem_method_draw_set_transform_matrix>` 在它上面應用自訂變換。

source: When using ``draw_line``, you should consider the width of the line. When using a width that is an odd size, the position should be shifted by ``0.5`` to keep the line centered as shown below.
zh_tw: 使用 ``draw_line`` 時，應考慮線條的寬度。如果使用的寬度是奇數，則應將位置移動 ``0.5`` 以保持線條居中，如下圖所示。

source: The same applies to the ``draw_rect`` method with ``filled = false``.
zh_tw: 這同樣適用於使用 ``filled = false`` 的 ``draw_rect`` 方法。

source: An example: drawing circular arcs
fr: Un exemple: dessiner des arcs de cercle
ru: Пример: рисование дуг окружности
zh_cn: 一个示例:绘制圆弧
zh_tw: 範例：繪製圓弧

source: We will now use the custom drawing functionality of the Godot Engine to draw something that Godot doesn't provide functions for. As an example, Godot provides a ``draw_circle()`` function that draws a whole circle. However, what about drawing a portion of a circle? You will have to code a function to perform this and draw it yourself.
fr: Nous allons maintenant utiliser la fonctionnalité de dessin personnalisé du moteur Godot pour dessiner quelque chose pour lequel Godot ne fournit pas de fonctions. À titre d'exemple, Godot fournit une fonction draw_circle() qui dessine un cercle entier. Cependant, qu'en est-il de dessiner une partie d'un cercle ? Vous devrez coder vous-même une fonction pour résoudre ça et la dessiner.
ru: Теперь мы будем использовать пользовательские функции рисования Godot Engine, чтобы рисовать то, для чего Godot не предоставляет функций. В качестве примера Godot предоставляет функцию ``draw_circle ()``, которая рисует весь круг. Однако как насчет рисования части круга? Вам нужно будет написать функцию для этого и нарисовать ее самостоятельно.
zh_cn: 我们现在将使用Godot Engine的自定义绘图功能来绘制Godot不提供功能的内容。 比如，Godot提供了 ``draw_circle()`` 函数，它会绘制一个完整的圆。 但是，画一个圆的一部分怎么说？你必须编写一个函数来执行此操作, 自己绘制它。
zh_tw: 我們現在將使用 Godot 引擎的自訂繪圖功能來繪製 Godot 未提供函式的內容。比如，Godot 提供了 ``draw_circle()`` 函式，它可以繪製一個完整的圓。但是，畫一個圓的一部分怎麼說？你必須編寫一個函式來執行此操作，自己繪製它。

source: Arc function
fr: Fonction d'arc
ru: Функция дуги
zh_cn: 弧函数
zh_tw: 弧函式

source: An arc is defined by its support circle parameters, that is, the center position and the radius. The arc itself is then defined by the angle it starts from and the angle at which it stops. These are the 4 arguments that we have to provide to our drawing function. We'll also provide the color value, so we can draw the arc in different colors if we wish.
fr: Un arc est défini par les paramètres de son cercle. C'est-à-dire: la position centrale et le rayon. L'arc lui-même est alors défini par l'angle de départ et l'angle d'arrêt. Ce sont les 4 paramètres que nous devons fournir à notre dessin. Nous fournirons également la valeur de couleur afin que nous puissions dessiner l'arc de différentes couleurs si nous le souhaitons.
ru: Дуга определяется параметрами опорной окружности, то есть положением центра и радиусом. Сама дуга затем определяется углом, с которого она начинается, и углом, под которым она заканчивается. Это 4 аргумента, которые мы должны предоставить нашей функции рисования. Мы также предоставим значение цвета, чтобы при желании можно было нарисовать дугу разными цветами.
zh_cn: 弧由其所在的圆的参数定义。 即:中心位置和半径。弧本身由开始的角度和停止的角度来定义。 这些是我们必须为绘图提供的4个参数。 我们还将提供颜色值，因此我们可以根据需要绘制不同颜色的圆弧。
zh_tw: 弧由其所在的圓的參數定義. 即: 中心位置和半徑. 弧本身由開始的角度和停止的角度來定義. 這些是我們必須為繪圖提供的4個參數. 我們還將提供顏色值, 因此我們可以根據需要繪製不同顏色的圓弧.

source: Basically, drawing a shape on the screen requires it to be decomposed into a certain number of points linked from one to the next. As you can imagine, the more points your shape is made of, the smoother it will appear, but the heavier it will also be in terms of processing cost. In general, if your shape is huge (or in 3D, close to the camera), it will require more points to be drawn without it being angular-looking. On the contrary, if your shape is small (or in 3D, far from the camera), you may decrease its number of points to save processing costs; this is known as *Level of Detail (LOD)*. In our example, we will simply use a fixed number of points, no matter the radius.
ru: По сути, рисование фигуры на экране требует, чтобы она была разложена на определенное количество точек, связанных между собой. Как вы понимаете, чем из большего количества точек состоит ваша фигура, тем более гладкой она будет выглядеть, но тем тяжелее она будет также с точки зрения затрат на обработку. В общем, если ваша фигура огромна (или в 3D, близко к камере), для ее рисования потребуется больше точек, но она не будет угловатой. Напротив, если ваша фигура маленькая (или в 3D, вдали от камеры), вы можете уменьшить количество точек, чтобы сократить затраты на обработку; это известно как *Уровень Детализации (LOD)*. В нашем примере мы просто будем использовать фиксированное количество точек независимо от радиуса.
zh_cn: 基本上，在屏幕上绘制形状需要将其分解为一定量首位相接的点。 你可以预见到，点越多，它就越平滑，但处理开销就越大。 一般来说，如果你的形状很大（或者在3D场景中靠近相机），则需要绘制更多的点才不会看起来像是有棱角的。 相反，如果你的形状很小（或在3D场景里远离相机），你可以减少其点数以节省处理成本。 这称为 *多层次细节(Level of Detail, LoD)* 。 在我们的示例中，无论半径如何，我们都只使用固定数量的点。
zh_tw: 基本上, 在螢幕上繪製形狀需要將其分解為一定量首位相接的點. 你可以預見到, 點越多, 它就越平滑, 但處理開銷就越大. 一般來說, 如果你的形狀很大(或者在3D場景中靠近相機), 則需要繪製更多的點才不會看起來像是有棱角的. 相反, 如果你的形狀很小(或在3D場景裡遠離相機), 你可以減少其點數以節省處理成本. 這稱為 *多層次細節(Level of Detail, LoD)* . 在我們的範例中, 無論半徑如何, 我們都只使用固定數量的點.

source: Remember the number of points our shape has to be decomposed into? We fixed this number in the ``nb_points`` variable to a value of ``32``. Then, we initialize an empty ``PackedVector2Array``, which is simply an array of ``Vector2``\ s.
zh_tw: 還記得我們的形狀必須分解成多少點嗎？我們將「nb_points」變數中的這個數字固定為「32」。然後，我們初始化一個空的“PackedVector2Array”，它只是一個“Vector2”陣列。

source: The next step consists of computing the actual positions of these 32 points that compose an arc. This is done in the first for-loop: we iterate over the number of points for which we want to compute the positions, plus one to include the last point. We first determine the angle of each point, between the starting and ending angles.
fr: L'étape suivante consiste à calculer les positions réelles de ces 32 points qui composent un arc. Ceci est fait dans la première boucle for: nous itérons sur le nombre de points pour lesquels nous voulons calculer les positions, plus un pour inclure le dernier point. Nous déterminons d'abord l'angle de chaque point, entre les angles de départ et d'arrivée.
ru: Следующий шаг состоит в вычислении фактического положения этих 32 точек, составляющих дугу. Это делается в первом цикле for: мы перебираем количество точек, для которых мы хотим вычислить позиции, плюс одна, чтобы включить последнюю точку. Сначала мы определяем угол каждой точки между начальным и конечным углами.
zh_cn: 下一步包括计算构成弧的这32个点的实际位置。 这是在第一个for循环中完成的：我们迭代我们想要计算位置的点的数量，后面+1来包括最后一个点。 我们首先确定起点和终点之间每个点的角度。
zh_tw: 下一步包括計算構成弧的這32個點的實際位置. 這是在第一個for迴圈中完成的: 我們反覆運算我們想要計算位置的點的數量, 後面+1來包括最後一個點. 我們首先確定起點和終點之間每個點的角度.

source: The reason why each angle is decreased by 90° is that we will compute 2D positions out of each angle using trigonometry (you know, cosine and sine stuff...). However, ``cos()`` and ``sin()`` use radians, not degrees. The angle of 0° (0 radian) starts at 3 o'clock, although we want to start counting at 12 o'clock. So we decrease each angle by 90° in order to start counting from 12 o'clock.
zh_tw: 每個角度減小90°的原因是我們將使用三角函式計算每個角度的2D位置(你知道, 餘弦和正弦之類的東西......). 但是, 為了簡單, ``cos()`` 和 ``sin()`` 使用弧度, 而不是度數作為參數. 雖然我們想在12點鐘位置開始計數, 但0°(0弧度)的角度從3點鐘位置開始. 因此我們將每個角度減小90°, 以便從12點位置開始計數.

source: The actual position of a point located on a circle at angle ``angle`` (in radians) is given by ``Vector2(cos(angle), sin(angle))``. Since ``cos()`` and ``sin()`` return values between -1 and 1, the position is located on a circle of radius 1. To have this position on our support circle, which has a radius of ``radius``, we simply need to multiply the position by ``radius``. Finally, we need to position our support circle at the ``center`` position, which is performed by adding it to our ``Vector2`` value. Finally, we insert the point in the ``PackedVector2Array`` which was previously defined.
zh_tw: 以角度 ``angle`` (單位是弧度)位於圓上的點的實際位置由 ``Vector2(cos(angle), sin(angle))`` 給出. 由於 ``cos()`` 和 ``sin()`` 返回介於-1和1之間的值, 因此位置位於半徑為1的圓上. 要將此位置放在我們的半徑為 ``radius`` 的輔助圓上, 我們只需要將那個位置乘以 ``radius`` . 最後, 我們需要將我們的輔助圓定位在 ``center`` 位置, 這是通過將其與我們的 ``Vector2`` 相加來實作的. 最後, 我們在之前定義的 ``PoolVector2Array`` 中插入這個點.

source: Now, we need to actually draw our points. As you can imagine, we will not simply draw our 32 points: we need to draw everything that is between each of them. We could have computed every point ourselves using the previous method, and drew it one by one. But this is too complicated and inefficient (except if explicitly needed), so we simply draw lines between each pair of points. Unless the radius of our support circle is big, the length of each line between a pair of points will never be long enough to see them. If that were to happen, we would simply need to increase the number of points.
fr: Maintenant, nous devons dessiner nos points. Comme vous pouvez l’imaginer, nous ne dessinerons pas simplement nos 32 points: nous devons dessiner tout ce qui les sépare. Nous aurions pu calculer nous-mêmes chaque point en utilisant la méthode précédente et les dessiner un à un. Mais ceci est trop compliqué et inefficace (sauf si explicitement requis). Donc, on trace simplement des lignes entre chaque paire de points. À moins que le rayon de notre cercle ne soit grand, la longueur de chaque ligne entre deux points ne sera jamais assez longue pour les voir. Si cela se produit, il nous faudra simplement augmenter le nombre de points.
ru: Теперь нам нужно на самом нарисовать наши точки. Как вы можете себе представить, мы не просто нарисуем наши 32 точки: нам нужно нарисовать все, что находится между каждой из них. Мы могли бы сами вычислить каждую точку, используя предыдущий метод, и нарисовать ее одну за другой. Но это слишком сложно и неэффективно (за исключением случаев, когда это явно необходимо), поэтому мы просто проводим линии между каждой парой точек. Если радиус нашего круга поддержки не велик, длина каждой линии между парой точек никогда не будет достаточной, чтобы их увидеть. Если бы это произошло, нам просто нужно было бы увеличить количество точек.
zh_cn: 现在，我们需要实际绘制我们的点。 你可以想象，我们不会简单地画出我们的32个点：我们需要绘制每一点之间的所有内容。 我们可以使用前面的方法自己计算每个点，然后逐个绘制。 但这太复杂和低效了(除非确实需要)。 因此，我们只需在每对点之间绘制线条。 除非我们的辅助圆的半径很大，否则一对点之间每条线的长度永远不会长到足以看到它们。 如果发生这种情况，我们只需要增加点的个数就可以了。
zh_tw: 現在, 我們需要實際繪製我們的點. 你可以想像, 我們不會簡單地畫出我們的32個點: 我們需要繪製每一點之間的所有內容. 我們可以使用前面的方法自己計算每個點, 然後逐個繪製. 但這太複雜和低效了(除非確實需要). 因此, 我們只需在每對點之間繪製線條. 除非我們的輔助圓的半徑很大, 否則一對點之間每條線的長度永遠不會長到足以看到它們. 如果發生這種情況, 我們只需要增加點的個數就可以了.

source: Draw the arc on the screen
fr: Dessiner l'arc à l'écran
ru: Отрисовка дуги на экране
zh_cn: 在屏幕上绘制弧形
zh_tw: 在螢幕上繪製弧形

source: We now have a function that draws stuff on the screen; it is time to call it inside the ``_draw()`` function:
fr: Nous avons maintenant une fonction qui dessine des choses à l'écran, il est temps de l'appeler dans la fonction _draw() :
ru: Теперь у нас есть функция, которая рисует что-то на экране; пришло время вызвать ее внутри функции ``_draw ()``:
zh_cn: 我们现在有一个在屏幕上绘制内容的函数; 是时候在 ``_draw()`` 函数中调用它了:
zh_tw: 我們現在有一個在螢幕上繪製內容的函式; 是時候在 ``_draw()`` 函式中呼叫它了:

source: Result:
fr: Résultat :
ru: Результат:
zh_cn: 结果:
zh_tw: 結果：

source: Arc polygon function
fr: Fonction de polygone d'arc
ru: Функция сегмента
zh_cn: 弧多边形函数
zh_tw: 弧多邊形函式

source: We can take this a step further and not only write a function that draws the plain portion of the disc defined by the arc, but also its shape. The method is exactly the same as before, except that we draw a polygon instead of lines:
fr: Nous pouvons aller plus loin et écrire non seulement une fonction qui dessine la partie simple du disque définie par l’arc, mais aussi sa forme. La méthode est exactement la même que précédemment, sauf que nous dessinons un polygone au lieu de lignes :
ru: Мы можем сделать шаг вперед и не только написать функцию, которая рисует простую часть диска, определенную дугой, но и ее форму. Метод точно такой же, как и раньше, за исключением того, что мы рисуем многоугольник вместо линий:
zh_cn: 我们可以更进一步，不仅仅绘制一个由弧定义的扇形的边缘，还可以绘制其形体。 该方法与以前完全相同，只是我们绘制的是多边形而不是线条:
zh_tw: 我們可以更進一步, 不僅僅繪製一個由弧定義的扇形的邊緣, 還可以繪製其形體. 該方法與以前完全相同, 只是我們繪製的是多邊形而不是線條:

source: Dynamic custom drawing
fr: Dessin personnalisé dynamique
ru: Динамическое пользовательское рисование
zh_cn: 动态自定义绘图
zh_tw: 動態自訂繪圖

source: All right, we are now able to draw custom stuff on the screen. However, it is static; let's make this shape turn around the center. The solution to do this is simply to change the angle_from and angle_to values over time. For our example, we will simply increment them by 50. This increment value has to remain constant or else the rotation speed will change accordingly.
fr: Nous sommes maintenant en mesure de dessiner des éléments personnalisés à l'écran. Cependant, c'est statique, faisons en sorte que cette forme tourne autour du centre. La solution consiste simplement à modifier les valeurs angle_from et angle_to dans le temps. Pour notre exemple, nous les incrémenterons simplement de 50. Cette valeur d’incrément doit rester constante sinon la vitesse de rotation changera en conséquence.
ru: Хорошо, теперь мы можем рисовать на экране пользовательские объекты. Однако они статичны; давайте заставим эту фигуру вращаться вокруг центра. Решение состоит в том, чтобы просто изменять значения angle_from и angle_to с течением времени. Для нашего примера мы просто увеличим их на 50. Это значение приращения должно оставаться постоянным, иначе скорость вращения соответственно изменится.
zh_cn: 好吧，我们现在能够在屏幕上绘制自定义内容。 然而，它是静态的; 我们让这个形状围绕中心转动吧。 这样做的方法就是随着时间的推移改变angle_from和angle_to值。 对于我们的示例，我们将简单地将它们递增50。此增量值必须保持不变，否则旋转速度将相应地改变。
zh_tw: 好吧, 我們現在能夠在螢幕上繪製自訂內容. 然而, 它是靜態的; 我們讓這個形狀圍繞中心轉動吧. 這樣做的方法就是隨著時間的推移改變angle_from和angle_to值. 對於我們的範例, 我們將簡單地將它們遞增50. 此差異量值必須保持不變, 否則旋轉速度將相應地改變.

source: First, we have to make both angle_from and angle_to variables global at the top of our script. Also note that you can store them in other nodes and access them using ``get_node()``.
fr: Premièrement, nous devons rendre globales, les variables angle_from et angle_to variables au début de notre script. Notez également que vous pouvez les stocker dans d'autres nœuds et y accéder à l'aide de ``get_node()``.
ru: Во-первых, мы должны сделать переменные angle_from и angle_to глобальными в верхней части нашего скрипта. Также обратите внимание, что вы можете хранить их в других узлах и получать к ним доступ с помощью ``get_node()``.
zh_cn: 首先，我们必须在我们的angle_from和angle_to变量变成全局变量, 放在脚本顶部。 另请注意，您可以将它们存储在其他节点中并使用 ``get_node()`` 访问它们。
zh_tw: 首先, 我們必須在我們的angle_from和angle_to變數變成全域變數, 放在腳本頂部. 另請注意, 您可以將它們儲存在其他節點中並使用 ``get_node()`` 存取它們.

source: We make these values change in the _process(delta) function.
fr: Nous faisons en sorte que ces valeurs changent dans la fonction _process(delta).
ru: Мы изменяем эти значения в функции _process(delta).
zh_cn: 我们在_process(delta)函数中更改这些值。
zh_tw: 我們在_process(delta)函式中更改這些值.

source: We also increment our angle_from and angle_to values here. However, we must not forget to ``wrap()`` the resulting values between 0 and 360°! That is, if the angle is 361°, then it is actually 1°. If you don't wrap these values, the script will work correctly, but the angle values will grow bigger and bigger over time until they reach the maximum integer value Godot can manage (``2^31 - 1``). When this happens, Godot may crash or produce unexpected behavior.
fr: Nous incrémentons également nos valeurs angle_from et angle_to ici. Cependant, il ne faut pas oublier de ``wrap()`` les valeurs résultantes entre 0 et 360° ! Autrement dit, si l'angle est de 361°, il est en fait de 1°. Si vous n'enveloppez pas ces valeurs, le script fonctionnera correctement, mais les valeurs d'angle deviendront de plus en plus grandes avec le temps jusqu'à atteindre la valeur entière maximale que Godot peut gérer (``2^31 - 1``). Lorsque cela se produit, Godot peut planter ou produire un comportement inattendu.
ru: Здесь мы также увеличиваем наши значения angle_from и angle_to. Однако мы не должны забывать применять ``wrap()`` в диапазоне от 0 до 360° для результирующих значений! То есть, если угол равен 361°, то на самом деле он равен 1°. Если вы не обернете эти значения, скрипт будет работать правильно, но значения угла будут со временем увеличиваться и увеличиваться, пока не достигнут максимального целочисленного значения, которым может управлять Godot (``2^31 - 1``). Когда это произойдет, Godot может выйти из строя или привести к неожиданному поведению.
zh_cn: 我们也在这里增加angle_from和angle_to值。 但是，我们不能忘记将结果 ``wrap()`` 在0到360°之间！ 也就是说，如果角度是361°，那么它实际上是1°。 如果您不包装这些值，脚本将正常工作，但角度值将随着时间的推移变得越来越大，直到它们达到Godot可以管理的最大整数值(``2^31 - 1``)。 当发生这种情况时，Godot可能会崩溃或产生意外行为。
zh_tw: 我們也在這裡增加angle_from和angle_to值. 但是, 我們不能忘記將結果 ``wrap()`` 在0到360°之間！ 也就是說, 如果角度是361°, 那麼它實際上是1°. 如果您不包裝這些值, 腳本將正常工作, 但角度值將隨著時間的推移變得越來越大, 直到它們達到Godot可以管理的最大整數值(``2^31 - 1``). 當發生這種情況時,Godot可能會當機或產生意外行為.

source: Finally, we must not forget to call the ``queue_redraw()`` function, which automatically calls ``_draw()``. This way, you can control when you want to refresh the frame.
zh_tw: 最後, 我們一定不要忘記呼叫 ``queue_redraw()`` 函式, 它會自動呼叫 ``_draw()`` 。這樣, 你就可以控制何時去更新這一影格。

source: Also, don't forget to modify the ``_draw()`` function to make use of these variables:
fr: De plus, n'oubliez pas de modifier la fonction _draw() pour faire usage de ces variables :
ru: Кроме того, не забудьте изменить функцию ``_draw()``, чтобы использовать эти переменные:
zh_cn: 另外，不要忘记修改 ``_draw()`` 函数来使用这些变量:
zh_tw: 另外, 不要忘記修改 ``_draw()`` 函式來使用這些變數:

source: Let's run! It works, but the arc is rotating insanely fast! What's wrong?
fr: Allons-y ! Cela fonctionne, mais l'arc tourne incroyablement vite ! Qu'est-ce qui ne va pas ?
ru: Давайте запустим! Это работает, но дуга вращается безумно быстро! Что не так?
zh_cn: 我们运行吧！ 它工作正常，但弧线旋转快得疯掉了！ 怎么了？
zh_tw: 我們運作吧！ 它工作正常, 但弧線旋轉快得瘋掉了！ 怎麼了？
