Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/particle_systems_2d.po
Languages: de, pl, zh_cn

source: Particle systems (2D)
de: 2D Partikelsysteme
zh_cn: 粒子系统(2D)

source: Intro
de: Einführung
pl: Wstęp
zh_cn: 简介

source: A simple (but flexible enough for most uses) particle system is provided. Particle systems are used to simulate complex physical effects, such as sparks, fire, magic particles, smoke, mist, etc.
de: Es wird ein einfaches (aber für die meisten Anwendungen flexibles) Partikelsystem bereitgestellt. Partikelsysteme werden verwendet, um komplexe physikalische Effekte wie Funken, Feuer, magische Partikel, Rauch, Nebel usw. zu simulieren.
zh_cn: Godot提供了一种简单(但对于大多数用途而言足够灵活)的粒子系统。 粒子系统用于模拟复杂的物理效应，如火花，火焰，魔法粒子，烟雾，雾气，魔法等。

source: The idea is that a "particle" is emitted at a fixed interval and with a fixed lifetime. During its lifetime, every particle will have the same base behavior. What makes each particle different from the rest and provides a more organic look is the "randomness" associated with each parameter. In essence, creating a particle system means setting base physics parameters and then adding randomness to them.
de: Die Idee ist, dass ein "Partikel" in einem festen Intervall und mit einer festen Lebensdauer emittiert wird. Während seiner Lebensdauer hat jedes Partikel das gleiche Grundverhalten. Was jedes Partikel von den anderen unterscheidet und ein organischeres Aussehen bietet, ist die "Zufälligkeit", die jedem Parameter zugeordnet ist. Im Wesentlichen bedeutet das Erstellen eines Partikelsystems, dass physikalische Basisparameter festgelegt und dann Zufälligkeiten hinzugefügt werden.
zh_cn: 这个想法是以固定的间隔发射具有固定的寿命的“粒子”。 在其生命周期中，每个粒子都具有相同的基本行为。 每个参数相关的“随机性”是让每个粒子变得不同并呈现出具有组织的外观。 实质上，创建粒子系统意味着设置基本物理参数，然后为它们添加随机性。

source: Particle nodes
de: Partikel-Nodes

source: Godot provides two different nodes for 2D particles, :ref:`class_Particles2D` and :ref:`class_CPUParticles2D`. Particles2D is more advanced and uses the GPU to process particle effects, but that limits it to higher end graphics API, and in our case to the GLES3 renderer. For projects using the GLES2 backend, CPUParticles2D is a CPU-driven option with near feature parity with Particles2D, but lesser performance. While Particles2D is configured via a :ref:`class_ParticlesMaterial` (and optionally with a custom shader), the matching options are provided via node properties in CPUParticles2D (with the exception of the trail settings). You can convert a Particles2D node into a CPUParticles2D node by clicking on the node in the inspector, and selecting "Convert to CPUParticles2D" in the "Particles" menu of the toolbar.
de: Godot bietet zwei verschiedene Nodesfür 2D-Partikel, :ref:`class_Particles2D` und :ref:`class_CPUParticles2D`. Particles2D ist fortschrittlicher und nutzt die GPU zur Verarbeitung von Partikeleffekten, aber das beschränkt es auf höherwertige Grafik-APIs, und in unserem Fall auf den GLES3-Renderer. Für Projekte, die das GLES2-Backend verwenden, ist CPUParticles2D eine CPU-gesteuerte Option mit nahezu gleichen Funktionen wie Particles2D, aber geringerer Leistung. Während Particles2D über ein :ref:`class_ParticlesMaterial` (und optional mit einem benutzerdefinierten Smader) konfiguriert wird, werden die passenden Optionen über Knoteneigenschaften in CPUParticles2D bereitgestellt (mit Ausnahme der Trail-Einstellungen). Sie können einen Particles2D-Node in einen CPUParticles2D-Node umwandeln, indem Sie im Inspektor auf den Node klicken und im Menü "Partikel" der Symbolleiste "In CPUParticles2D umwandeln" wählen.

source: The rest of this tutorial is going to use the Particles2D node. First, add a Particles2D node to your scene. After creating that node you will notice that only a white dot was created, and that there is a warning icon next to your Particles2D node in the inspector. This is because the node needs a ParticlesMaterial to function.
de: Im Rest der Anleitung wird das Particles2D Node benutzt. Als erstes fügen Sie ein Particles2D Node zu Ihrer Szene. Nachdem Sie das Node hinzugefügt haben, werden Sie feststellen, dass nur ein weisser Punkt erstellt wurde und im Inspektor neben Ihrem Particles2D Node ein Warnungssymbol ist. In diesem Fall bedeutet dieses Symbol, dass das Node ein ParticlesMaterial benötigt, um zu funktionieren.

source: ParticlesMaterial
de: Partikel Materialien

source: To add a process material to your particles node, go to ``Process Material`` in your inspector panel. Click on the box next to ``Material``, and from the dropdown menu select ``New ParticlesMaterial``.
de: Um ein ProcessMaterial zu Ihrem Partikel-Node hinzuzufügen, gehen Sie in Ihrem Inspektor zu ``Process Material``. Klicken Sie auf die Box neben ``Material`` mit der Aufschrift ``[leer]`` und wählen Sie aus dem Ausklappmenü ``Neues ParticlesMaterial`` aus.
zh_cn: 要将过程材质添加到粒子节点，请转到“属性面板”面板中的“处理材质”。 单击材质旁边的框，然后从下拉菜单中选择New Particles Material。

source: Your Particles2D node should now be emitting white points downward.
de: Ihr Particles2D-Node sollte jetzt weiße Punkte nach unten senden.
pl: Węzeł Particles2D powinien emitować białe punkty w dół.
zh_cn: 您的Particles2D节点现在应该可以向下发射白点了。

source: Texture
de: Texturen
zh_cn: 纹理

source: A particle system uses a single texture (in the future this might be extended to animated textures via spritesheet). The texture is set via the relevant texture property:
de: Ein Partikelsystem benutzt eine einzelne Textur (in der Zukunft könnte dies mit animierten Texturen über ein Spritesheet erweitert werden). Die Textur wird über die entsprechende Eigenschaft "Texture" festgelegt:
pl: System cząsteczek wykorzystuje jedną teksturę (w przyszłości może ona zostać rozszerzona na tekstury animowane za pomocą arkusza spritesheet). Ustawienie tekstury następuje poprzez odpowiednią właściwość tekstury:
zh_cn: 粒子系统使用单个纹理(将来可能会通过spritesheet扩展到动画纹理)。 纹理通过相关的纹理属性设置:

source: Time parameters
de: Zeitparameter
zh_cn: 时间参数

source: Lifetime
de: Lebensdauer
zh_cn: 寿命

source: The time in seconds that every particle will stay alive. When lifetime ends, a new particle is created to replace it.
de: Die Zeit in Sekunden, in der jedes Partikel am Leben bleibt. Wenn die Lebensdauer endet, wird ein neues Partikel erstellt, um es zu ersetzen.
pl: Czas w sekundach, w którym każda cząsteczka pozostanie przy życiu. Po zakończeniu żywotności tworzona jest nowa cząstka, która ma ją zastąpić.
zh_cn: 每个粒子存活的时间(以秒为单位)。 生命周期结束时，会创建一个新粒子来替换它。

source: Lifetime: 0.5
de: Lebensdauer: 0.5
zh_cn: 寿命: 0.5

source: Lifetime: 4.0
de: Lebensdauer: 4.0
zh_cn: 寿命: 4.0

source: One Shot
de: Einmalig
zh_cn: 一发

source: When enabled, a Particles2D node will emit all of its particles once and then never again.
de: Wenn diese Option aktiviert ist, gibt ein Particles2D-Node alle seine Partikel einmal und dann nie wieder aus.
pl: Kiedy włączony, węzeł Particles2D wyemituje wszystkie swoje cząstki tylko jednokrotnie.
zh_cn: 启用后，Particles2D节点将一次性发出所有粒子，然后再也不发射。

source: Preprocess
de: Vorverarbeitung
zh_cn: 预处理

source: Particle systems begin with zero particles emitted, then start emitting. This can be an inconvenience when loading a scene and systems like a torch, mist, etc. begin emitting the moment you enter. Preprocess is used to let the system process a given number of seconds before it is actually drawn the first time.
de: Partikelsysteme beginnen mit null emittierten Partikeln und beginnen dann zu emittieren. Dies kann eine Unannehmlichkeit sein, wenn eine Szene geladen wird und Systeme wie Fackel, Nebel usw. in dem Moment, in dem Sie eintreten, zu emittieren beginnen. Mit der Vorverarbeitung kann das System eine bestimmte Anzahl von Sekunden verarbeiten, bevor es beim ersten Mal tatsächlich gezeichnet wird.
zh_cn: 粒子系统从零粒子发射开始，然后开始发射。 当加载场景如火炬，雾等系统时可能会带来不便，因为它会在您进入的那一刻开始发射。 预处理用于让系统在第一次实际绘制之前处理给定的秒数。

source: Speed Scale
de: Geschwindigkeitsskala
pl: Skala prędkości
zh_cn: 速度大小

source: The speed scale has a default value of ``1`` and is used to adjust the speed of a particle system. Lowering the value will make the particles slower while increasing the value will make the particles much faster.
de: Die Eigenschaft ``Speed Scale`` hat einen Standardwert von ``1`` und wird benutzt, um die Geschwindigkeit eines Partikelsystems einzustellen bzw. zu skalieren. Mit der Senkung des Werts werden die Partikel langsamer, wohingegen eine Erhöhung des Werts die Partikel schneller macht.
pl: Skala prędkości ma domyślną wartość ``1`` i jest używana do regulacji prędkości cząsteczek. Obniżenie tej wartości spowoduje spowolnienie cząsteczek, a zwiększenie tej wartości znacznie przyspieszenie.
zh_cn: 速度大小具有默认值 ``1`` ，用于调整粒子系统的速度。 降低值会使粒子变慢，而增加值会使粒子更快。

source: Explosiveness
de: Explosivität
zh_cn: 爆炸性

source: If lifetime is ``1`` and there are 10 particles, it means a particle will be emitted every 0.1 seconds. The explosiveness parameter changes this, and forces particles to be emitted all together. Ranges are:
de: Wenn die Eigenschaft ``Lifetime`` den Wert ``1`` hat und zehn Partikel vorhanden sind, bedeutet dies, dass jede Zehntelsekunde (0.1s) ein Partikel ausgesendet wird. Die Eigenschaft ``Explosiveness`` beinflusst dies insofern, dass alle Partikel gleichzeitig ausgesendet werden. Folgende Spannbreite ist möglich:
pl: Jeśli czas życia wynosi ``1`` i istnieje 10 cząstek, oznacza to, że cząstka będzie emitowana co 0.1 sekundy. Zmienia to parametr explosiveness i wymusza na cząsteczkach emitowanie razem. Zakresami są:
zh_cn: 如果有10个寿命为 ``1`` 的粒子，则意味着粒子将每0.1秒发射一次。 爆炸性参数改变了这一点，并迫使粒子一起发射。 范围是:

source: 0: Emit particles at regular intervals (default value).
de: 0: Partikel in regelmäßigen Abständen emittieren (Standardwert).
pl: 0: Emitują cząstki stałe w regularnych odstępach czasu (wartość domyślna).
zh_cn: 0:定期发射粒子(默认值)。

source: 1: Emit all particles simultaneously.
de: 1: Alle Partikel gleichzeitig emittieren.
pl: 1: Jednocześnie emitować wszystkie cząstki.
zh_cn: 1:同时发射所有粒子。

source: Values in the middle are also allowed. This feature is useful for creating explosions or sudden bursts of particles:
de: Werte dazwischen sind ebenfalls zulässig. Diese Funktion ist nützlich, um Explosionen oder plötzliche Partikelausbrüche zu erzeugen:
pl: Dozwolone są również wartości środkowe. Funkcja ta jest przydatna do tworzenia eksplozji lub nagłych wybuchów cząstek:
zh_cn: 中间的值也是允许的。 此功能对于创建爆炸或突然爆发的粒子非常有用:

source: Randomness
de: Zufälligkeit
zh_cn: 随机性

source: All physics parameters can be randomized. Random values range from ``0`` to ``1``. The formula to randomize a parameter is:
de: Alle physikalischen Parameter können zufallsbestimmt werden. Zufällige Werte reichen von ``0`` bis ``1``. Die Formel um einen Parameter per Zufall zu bestimmen lautet:
pl: Wszystkie parametry fizyki mogą być losowane. Wartości losowe wahają się od ``0`` do ``1``. Wzór do losowania parametru to:
zh_cn: 所有物理参数都可以随机化。随机值范围从“0”到“1”。随机化参数的公式为:

source: Fixed FPS
de: feste FPS
zh_cn: 固定FPS

source: This setting can be used to set the particle system to render at a fixed FPS. For instance, changing the value to ``2`` will make the particles render at 2 frames per second. Note this does not slow down the particle system itself.
de: Diese Einstellung kann verwendet werden, um das Partikelsystem so einzustellen, dass es mit einem festen FPS gerendert wird. Wenn Sie z. B. den Wert auf ``2`` ändern, werden die Partikel mit 2 Bildern pro Sekunde gerendert. Beachten Sie, dass dies das Partikelsystem selbst nicht verlangsamt.
pl: Ustawienie to można wykorzystać do ustawienia systemu cząsteczek na stałą ilość klatek na sekundę. Na przykład, zmiana wartości na ``2`` spowoduje, że cząstki będą renderować z szybkością 2 klatek na sekundę. Należy pamiętać, że nie zwalnia to samego systemu cząsteczek.
zh_cn: 此设置可用于将粒子系统设置为以固定FPS渲染。 例如，将值更改为 ``2`` 将使粒子以每秒2帧的速度渲染。 请注意，这不会减慢粒子系统本身的速度。

source: This can be used to turn Fract Delta on or off.
de: Dies kann verwendet werden, um Fract Delta ein oder auszuschalten.
pl: Służy do włączania i wyłączania Fract Delta.
zh_cn: 这可用于打开或关闭Fract Delta。

source: Drawing parameters
de: Zeichnungsparameter
zh_cn: 绘图参数

source: Visibility Rect
de: sichtbares Recheck
zh_cn: 可见性矩形

source: The visibility rectangle controls the visibility of the particles on screen. If this rectangle is outside of the viewport, the engine will not render the particles on screen.
de: Das Sichtbarkeits-Rechteck stellt die Sichtbarkeit von Partikeln ein. Wenn dieses Rechteck außerhalb des Viewports liegt, wird die Engine keine Partikel rendern.
zh_cn: 可见性矩形控制粒子在屏幕上的可见性。 如果此矩形位于视区之外，则引擎将不会在屏幕上渲染粒子。

source: The rectangle's ``W`` and ``H`` properties respectively control its Width and its Height. The ``X`` and ``Y`` properties control the position of the upper-left corner of the rectangle, relative to the particle emitter.
de: Die ``W`` und ``H`` Eigenschaften des Rechtecks stellen die Breite und Höhe ein. Die ``X`` und ``Y`` Eigenschaften stellen die Position der oberen linken Kante des Rechtecks ein, in Relation zu dem Partikelemitter.
zh_cn: 矩形的 ``W`` 和 ``H`` 属性分别控制其宽度和高度。 ``X`` 和 ``Y`` 属性控制矩形左上角相对于粒子发射器的位置。

source: You can have Godot generate a Visibility Rect automatically using the toolbar above the 2d view. To do so, select the Particles2D node and Click ``Particles > Generate Visibility Rect``. Godot will simulate the Particles2D node emitting particles for a few seconds and set the rectangle to fit the surface the particles take.
de: Mit der Toolbar über dem 2D-View kann ein Sichtbarkeits-Rechteck automatisch generiert werden. Dazu müssen Sie das Particles2D Node auswählen und auf ``Partikel > Sichtbarkeits-Rechteck generieren`` anklicken. Godot simuliert dann die Partikel der Particles2D Node für einige Sekunden und skaliert dann das Rechteck auf die von den Partikeln eingenommene Fläche.
zh_cn: 您可以使用2d视图上方的工具栏自动生成可见性矩形。 为此，请选择Particles2D节点，然后单击 ``Particles > Generate Visibility Rect`` 。 Godot将模拟Particles2D节点发射粒子几秒钟，并将矩形设置为适合粒子所采用的表面。

source: You can control the emit duration with the ``Generation Time (sec)`` option. The maximum value is 25 seconds. If you need more time for your particles to move around, you can temporarily change the ``preprocess`` duration on the Particles2D node.
de: Sie können die Dauer der Emmitierung mit der ``Generation Time (sec)`` Option einstellen. Der Maximalwert ist 25 Sekunden. Falls sie mehr Zeit für die Partikel brauchen, können Sie temporär die ``preprocess`` Dauer der Particles2D Node ändern.
zh_cn: 您可以使用 ``Generation Time (sec)`` 选项控制发射持续时间。 最大值为25秒。 如果您需要更多时间让粒子移动，您可以暂时更改Particles2D节点上的 ``preprocess`` 持续时间。

source: Local Coords
de: Lokale Koordinaten
zh_cn: 本地坐标

source: By default this option is on, and it means that the space that particles are emitted to is relative to the node. If the node is moved, all particles are moved with it:
de: Standardmäßig ist diese Option aktiviert. Dies bedeutet, dass der Raum, in den Partikel emittiert werden, relativ zum Node ist. Wenn der Node verschoben wird, werden alle Partikel mit verschoben:
pl: Domyślnie opcja jest zaznaczona, co oznacza, że przestrzeń, do której emitowane są cząstki, jest ustawiona względem węzła. Jeśli węzeł jest przenoszony, to wszystkie cząsteczki są przemieszczane razem z nim:
zh_cn: 默认情况下，此选项处于启用状态，这意味着粒子发射的空间是相对于节点。 如果移动节点，则随之移动所有粒子:

source: If disabled, particles will emit to global space, meaning that if the node is moved, already emitted particles are not affected:
de: Wenn diese Option deaktiviert ist, werden Partikel in den globalen Raum emittiert. Wenn der Node verschoben wird, sind bereits emittierte Partikel nicht betroffen:
pl: W przypadku wyłączenia, cząstki będą emitowane względem świata, co oznacza, że jeśli węzeł zostanie przesunięty, nie będzie to miało wpływu na już wyemitowane cząsteczki:
zh_cn: 如果禁用，粒子将发射到全局空间，这意味着如果移动节点，则已发射的粒子不会受到影响:

source: Draw Order
de: Zeichnungsreihenfolge
zh_cn: 绘图顺序

source: This controls the order in which individual particles are drawn. ``Index`` means particles are drawn according to their emission order (default). ``Lifetime`` means they are drawn in order of remaining lifetime.
de: Stellt die Reihenfolge ein, in der die Partikel gezeichnet werden. ``Index`` bedeutet, dass Partikel nach ihrer Emmisionsreihenfolge (standardmäßig) gezeichnet werden. ``Lebensdauer`` bedeutet dass die Partikel der Reihe ihrer Rest-Lebenszeit nach gezeichnet werden.
pl: Kontroluje kolejność, w jakiej poszczególne cząsteczki są rysowane. ``Index`` oznacza, że cząstki są rysowane zgodnie z kolejnością emisji (domyślnie). ``Lifetime`` oznacza, że zostały one narysowane odpowiednio od czasu ich stworzenia.
zh_cn: 这可以控制绘制单个粒子的顺序。 ``Index`` 表示粒子根据它们的发射顺序被绘制(默认)。 ``Lifetime`` 表示它们按照剩余寿命的顺序被绘制。

source: ParticlesMaterial settings
de: ParticlesMaterial Einstellungen
pl: Ustawienia ParticlesMaterial
zh_cn: ParticlesMaterial设置

source: Direction
de: Richtung

source: This is the base direction at which particles emit. The default is ``Vector3(1, 0, 0)`` which makes particles emit to the right. However, with the default gravity settings, particles will go straight down.
de: Die Richtung, in welche Partikel emittiert werden. Der Standardwert ist ``Vector3(1, 0, 0)``, was bedeutet dass Partikel nach Rechts emittiert werden. Mit Standard-Schwerkrafteinstellungen werden sich die Partikel jedoch direkt nach unten bewegen.

source: For this property to be noticeable, you need an *initial velocity* greater than 0. Here, we set the initial velocity to 40. You'll notice that particles emit toward the right, then go down because of gravity.
de: Damit diese Eigenschaft eine Wirkung hat, brauchen Sie eine *Anfangsgeschwindigkeit* größer als 0. Hier setzen wir die Anfangsgeschwindigkeit auf 40. Sie werden feststellen, dass die Partikel nach Rechts emittiert werden, und sich dann durch die Schwerkraft nach unten bewegen.

source: Spread
de: Ausbreitung
zh_cn: 传播

source: This parameter is the angle in degrees which will be randomly added in either direction to the base ``Direction``. A spread of ``180`` will emit in all directions (+/- 180). For spread to do anything the "Initial Velocity" parameter must be greater than 0.
de: Dieser Parameter ist der Winkel in Grad, der zufällig in jede Richtung zur Basis ``Direction`` addiert wird. Eine Streuung von ``180`` wird in alle Richtungen (+/- 180) emittieren. Damit die Streuung etwas bewirkt, muss der Parameter "Anfangsgeschwindigkeit" größer als 0 sein.

source: Flatness
de: Ebenheit

source: This property is only useful for 3D particles.
de: Diese Eigenschaft ist nur für 3D-Partikel nützlich.

source: Gravity
de: Gravitation
pl: Grawitacja
zh_cn: 重力

source: The gravity applied to every particle.
de: Die Schwerkraft, die auf jedes Teilchen angewendet wird.
pl: Grawitacja oddziałuje na każdą cząsteczkę.
zh_cn: 重力应用于每个粒子。

source: Initial Velocity
de: Anfangsgeschwindigkeit
pl: Prędkość początkowa
zh_cn: 初始速度

source: Initial velocity is the speed at which particles will be emitted (in pixels/sec). Speed might later be modified by gravity or other accelerations (as described further below).
de: Die Anfangsgeschwindigkeit ist die Geschwindigkeit mit der Partikel emittiert werden (in Pixeln pro Sekunde). Geschwindigkeit wird womöglich (wie unten beschrieben) von Schwerkraft oder anderen Beschleunigungen beeinflusst.

source: Angular Velocity
de: Winkelgeschwindigkeit
pl: Prędkość kątowa
zh_cn: 角速度

source: Angular velocity is the initial angular velocity applied to particles.
de: Die Winkelgeschwindigkeit ist die anfängliche Winkelgeschwindigkeit, die auf Partikel angewendet wird.
pl: Prędkość kątowa to początkowa prędkość kątowa przyłożona do cząstek.
zh_cn: 角速度是应用于粒子的初始角速度。

source: Spin Velocity
de: Spin-Geschwindigkeit
pl: Prędkość obrotu
zh_cn: 旋转速度

source: Spin velocity is the speed at which particles turn around their center (in degrees/sec).
de: Die Spin-Geschwindigkeit ist die Geschwindigkeit, mit der sich Partikel um ihr Zentrum drehen (in Grad/Sek.).
pl: Prędkość obrotu to prędkość, z jaką cząstki obracają się wokół własnego środka (w stopniach/sekundę).
zh_cn: 旋转速度是粒子围绕其中心转动的速度(以度/秒为单位)。

source: Orbit Velocity
de: Umlaufgeschwindigkeit
zh_cn: 轨道速度

source: Orbit velocity is used to make particles turn around their center.
de: Die Umlaufgeschwindigkeit wird verwendet, um Partikel dazu zu bringen, sich um ihr Zentrum zu drehen.
zh_cn: 轨道速度用于使粒子绕它们的中心转动。

source: Linear Acceleration
de: Lineare Beschleunigung
pl: Przyspieszenie liniowe
zh_cn: 线性加速度

source: The linear acceleration applied to each particle.
de: Die lineare Beschleunigung, die auf jedes Teilchen angewendet wird.
pl: Przyspieszenie liniowe oddziałuje na każdą cząsteczkę.
zh_cn: 应用于每个粒子的线性加速度。

source: Radial Acceleration
de: Radiale Beschleunigung
zh_cn: 径向加速度

source: If this acceleration is positive, particles are accelerated away from the center. If negative, they are absorbed towards it.
de: Wenn diese Beschleunigung positiv ist, werden Partikel vom Zentrum weg beschleunigt. Wenn sie negativ sind, werden sie dazu angezogen.
zh_cn: 如果此加速度为正，则粒子会从发射中心加速。 如果是负的，他们会被吸收。

source: Tangential Acceleration
de: Tangentiale Beschleunigung
pl: Przyspieszenie styczne
zh_cn: 切向加速度

source: This acceleration will use the tangent vector to the center. Combining with radial acceleration can do nice effects.
de: Diese Beschleunigung verwendet den Tangentenvektor zur Mitte. Die Kombination mit Radialbeschleunigung kann schöne Effekte erzielen.
zh_cn: 该加速度会使用到中心点的切向量，结合径向加速度可以做出很酷炫的效果。

source: Damping
de: Dämpfung
pl: Tłumienie
zh_cn: 衰减

source: Damping applies friction to the particles, forcing them to stop. It is especially useful for sparks or explosions, which usually begin with a high linear velocity and then stop as they fade.
de: Dämpfung erzeugt Reibung auf den Partikeln, was sie zum anhalten zwingt. Dies ist praktisch für Funken oder Explosionen, welche üblicherweise mit hoher Anfangsgeschwindigkeit schnell wieder abklingen.
zh_cn: 阻尼对颗粒施加摩擦力，迫使它们停止。 它特别适用于火花或爆炸，火花或爆炸通常以高线速度开始，然后在褪色时停止。

source: Angle
de: Winkel
pl: Kąt
zh_cn: 角度

source: Determines the initial angle of the particle (in degrees). This parameter is mostly useful randomized.
de: Bestimmt den Anfangswinkel des Partikels (in Grad). Dieser Parameter wird meistens zufällig genutzt.

source: Scale
de: Skalierung
zh_cn: 规模

source: Determines the initial scale of the particles.
de: Bestimmt den anfänglichen Maßstab der Partikel.
pl: Określa początkową skalę/wielkość cząstek.
zh_cn: 确定粒子的初始大小。

source: Color
de: Farbe
pl: Kolor
zh_cn: 颜色

source: Used to change the color of the particles being emitted.
de: Wird verwendet, um die Farbe der emittierten Partikel zu ändern.
pl: Służy do zmiany koloru emitowanych cząstek.
zh_cn: 用于改变发射中的粒子颜色。

source: Hue variation
de: Farbtonvariation
pl: Zróżnicowanie odcieni barw
zh_cn: 色调变化

source: The ``Variation`` value sets the initial hue variation applied to each particle. The ``Variation Random`` value controls the hue variation randomness ratio.
de: Der ``Variation``-Wert stellt den Anfangs-Farbton der Partikel ein. Der ``Variation Random``-Wert stellt ein, mit wie viel Zufälligkeit der Anfangs-Farbton generiert wird.
zh_cn: Variation值设置应用于每个粒子的初始色调变化。 Variation Rand值控制色调变化随机性比率。

source: Emission Shapes
de: Emissionformen

source: ParticlesMaterials allow you to set an Emission Mask, which dictates the area and direction in which particles are emitted. These can be generated from textures in your project.
de: ParticlesMaterials stellt eine Emmisionsmaske ein, welche die Fläche und Richtung der Partikelemitter beeinflusst. Die Maske kann von einer Textur im Projekt generiert werden.
zh_cn: 粒子材质可以让你设置一个发射遮罩，它决定了粒子发射的区域和方向。这些可以从项目中的纹理产生。
