Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/particle_systems_2d.po
Languages: de, pl, zh_cn

source: Ensure that a ParticlesMaterial is set, and the Particles2D node is selected. A "Particles" menu should appear in the Toolbar:
de: Stellen Sie sicher, dass ParticlesMaterial eingestellt und das Particles2D Node ausgewählt wurde. In der Toolbar sollte dann ein "Partikel" Menü erscheinen:
zh_cn: 确保设置了粒子材质，选择二维粒子节点。工具栏中应显示“粒子”菜单：

source: Open it and select "Load Emission Mask":
de: Öffnen Sie es und wählen Sie "Emissionsmaske laden":
zh_cn: 打开它，选择“加载发射遮罩”：

source: Then select which texture you want to use as your mask:
de: Wählen Sie dann die Textur aus, die Sie als Maske verwenden möchten:
zh_cn: 然后选择你想要用作遮罩的纹理：

source: A dialog box with several settings will appear.
de: Ein Eingabefenster mit diversen Einstellungen wird erscheinen.
zh_cn: 将出现一个具有多个设置的对话框。

source: Emission Mask
de: Emissionsmaske
zh_cn: 发光遮罩（mask）

source: Three types of emission masks can be generated from a texture:
de: Aus einer Textur können drei Arten von Emissionsmasken erzeugt werden:
zh_cn: 纹理可以生成三种类型的发射遮罩：

source: Solid Pixels: Particles will spawn from any area of the texture, excluding transparent areas.
de: Feste Pixel: Partikel erscheinen aus jedem Bereich der Textur, ausgenommen transparente Bereiche.
zh_cn: 实体像素：粒子将从纹理的任何区域产生，透明区域除外。

source: Border Pixels: Particles will spawn from the outer edges of the texture.
de: Grenzpixel: Die Partikel werden von den äußeren Rändern der Textur erzeugt.
zh_cn: 边界像素：粒子将从纹理的外边缘产生。

source: Directed Border Pixels: Similar to Border Pixels, but adds extra information to the mask to give particles the ability to emit away from the borders. Note that an ``Initial Velocity`` will need to be set in order to utilize this.
de: Gerichtete Randpixel: Ähnlich wie Border Pixels, fügt aber zusätzliche Informationen zur Maske hinzu, um Partikeln die Möglichkeit zu geben, von den Rändern weg zu emittieren. Beachten Sie, dass eine ``Initial Velocity`` gesetzt werden muss, um dies zu nutzen.
zh_cn: 定向边界像素：类似于边界像素，在遮罩中添加额外的信息，使粒子能够从边缘发射出去。请注意，想要使用它，需要设置一个“初始速度”。

source: Emission Colors
de: Emissionsfarben
zh_cn: 发光颜色

source: ``Capture from Pixel`` will cause the particles to inherit the color of the mask at their spawn points.
de: ``Capture from Pixel`` bewirkt, dass die Partikel die Farbe der Maske an ihren Spawnpunkten erben.
zh_cn: “从像素捕获”会使粒子在其产生点处继承遮罩的颜色。

source: Once you click "OK", the mask will be generated and set to the ParticlesMaterial, under the ``Emission Shape`` section:
de: Mit klicken auf "OK" wird die Maske generiert und auf das ParticlesMaterial unter dem Abschnitt ``Emission Shape`` gesetzt:
zh_cn: 一旦你点击“确定”，将生成遮罩并设置为粒子材质，在“发射形状”部分：

source: All of the values within this section have been automatically generated by the "Load Emission Mask" menu, so they should generally be left alone.
de: Alle Werte in diesem Abschnitt wurden automatisch durch das "Load Emission Mask"-Menü generiert. Grundsätzlich sollten sie nicht verändert werden.
zh_cn: “加载发射遮罩”菜单在这个部分自动生成了所有的值，所以通常他们应该被单独留下。

source: An image should not be added to ``Point Texture`` or ``Color Texture`` directly. The "Load Emission Mask" menu should always be used instead.
de: Ein Bild sollte nicht direkt zur ``Point Texture`` oder ``Color Texture`` hinzugefügt werden. Es sollte immer das "Load Emission Mask"-Menü benutzt werden.
zh_cn: 图像不应该直接添加到“点纹理”或“颜色纹理”中。应该始终使用“加载发射遮罩”菜单。

source: Particle systems are added to the scene via the :ref:`Particles2D <class_Particles2D>` node. However, after creating that node you will notice that only a white dot was created, and that there is a warning icon next to your Particles2D node in the inspector. This is because the node needs a ParticlesMaterial to function.
pl: Systemy cząsteczek są dodawane do sceny poprzez: węzeł ref:'Particles2D <class_Particles2D>'. Jednak po utworzeniu tego węzła, zauważysz, że tylko białą kropką został stworzona, i jest ikona ostrzeżenia obok węzła Particles2D w inspektorze. Jest tak, ponieważ węzeł musi posiadać ParticlesMaterial do działania.
zh_cn: 粒子系统通过 :ref:`Particles2D <class_Particles2D>` 节点添加到场景中。 但是，在创建该节点后，您会注意到只创建了一个白点，并且在Particles2D节点的属性面板旁边有一个警告图标。 这是因为节点需要ParticlesMaterial才能运行。

source: Fract Delta
zh_cn: 分形间隔

source: This parameter is the angle in degrees which will be randomly added in either direction to the base ``Direction``. A spread of ``180`` will emit in all directions (+/- 180).
pl: Ten parametr jest kątem w stopniach, który zostanie losowo dodany do podstawy ``Direction``. Rozrzut ``180`` będzie wysyłał cząstki w każdym kierunku (+/- 180).
zh_cn: 此参数是以度为单位的角度，它将在任一方向上随机添加到基础 ``Direction`` 。 ``180`` 的传播将向所有方向发射(+/- 180)。

source: Linear velocity is the speed at which particles will be emitted (in pixels/sec). Speed might later be modified by gravity or other accelerations (as described further below).
pl: Prędkość liniowa to prędkość, z jaką cząstki stałe będą emitowane (w pikselach/sekundę). Prędkość może być później modyfikowana przez grawitację lub przyspieszenia (jak opisano poniżej).
zh_cn: 线速度是粒子发射的速度(以像素/秒为单位)。 以后可以通过重力或其他加速度来修改速度(下面将进一步描述)。

source: Determines the initial angle of the particle (in degress). This parameter is mostly useful randomized.
pl: Określa kąt początkowy cząstki (w stopniach). Wartość tego parametru najczęściej jest losowana.
zh_cn: 确定粒子的初始角度(以度为单位)。 该参数主要用于随机化。

source: A simple (but flexible enough for most uses) particle system is provided. Particle systems are used to simulate complex physical effects such as sparks, fire, magic particles, smoke, mist, magic, etc.
pl: Zapewniony jest prosty (ale wystarczająco elastyczny do większości zastosowań) system cząsteczek. Systemy cząsteczkowe są używane do symulowania złożonych efektów fizycznych, takich jak iskry, ogień, mgła, magia, itp.

source: The idea is that a "particle" is emitted at a fixed interval and with a fixed lifetime. During its lifetime, every particle will have the same base behavior. What makes every particle different and provides a more organic look is the "randomness" associated to each parameter. In essence, creating a particle system means setting base physics parameters and then adding randomness to them.
pl: Chodzi o to, aby "cząstka" emitowana była w ustalonym odstępie czasu i o określonym czasie życia. Każda cząstka w trakcie swojego życia będzie zachowywała się tak samo pod względem zasadowym. To, co odróżnia każdą cząstkę i nadaje jej bardziej organiczny wygląd, to "randomness"(losowość) związana z każdym parametrem. W istocie, stworzenie systemu cząsteczek oznacza ustalenie podstawowych parametrów fizyki, a następnie dodanie do nich losowości.

source: The ``W`` and ``H`` values control width and height of the visibility rectangle. The ``X`` and ``Y`` values control the position of the upper-left corner of the visibility rectangle relative to the particle emitter.
pl: Wartości ``W`` i ``H`` regulują szerokość i wysokość prostokąta widzialności. Wartości ``X`` i ``Y`` kontrolują położenie górnego lewego rogu prostokąta widzialności względem emitera cząstek.

source: Commented out as not implemented in 3.x for now.
pl: Skomentowany jako jeszcze nie wdrożony w wersji 3.x.

source: This is the base angle at which particles emit. Default is ``0`` (down):
pl: Jest to kąt podstawowy, w którym emitują się cząsteczki. Domyślnie ``0`` (w dół):

source: Changing it will change the emissor direction, but gravity will still affect them:
pl: Zmiana tego ustawienia zmieni kierunek emisji, lecz grawitacja ciągle będzie na niego oddziaływać:

source: This parameter is useful because, by rotating the node, gravity will also be rotated. Changing direction allows them to be separated.
pl: Ten parametr jest przydatny, ponieważ obracając węzeł, grawitacja również zostanie obrócona. Zmiana kierunku, pozwala im się rozdzielić.
