Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilemaps.po
Languages: es, fr, ja, uk

source: This is unavoidable, as it is the way the hardware bilinear filter works. To avoid this situation, there are a few workarounds. Try the one that looks better for you:
fr: Cela est inévitable, car c’est la façon dont fonctionne le filtre bilinéaire matériel. Donc, pour éviter cette situation, il existe quelques solutions de contournement. Essayez celle qui vous convient le mieux :

source: Disable filtering and mipmaps for either the tileset texture or all tile textures if using separate images (see the :ref:`doc_import_images` asset pipeline tutorial).
es: Desactiva filtros y mipmaps para la textura o texturas utilizada en el tileset (ver :ref:`doc_import_images` tutorial de canalización de recursos).
fr: Désactivez le filtrage et les mipmaps soit pour la texture du jeux de tuiles, soit pour toutes les textures de tuiles si vous utilisez des images séparées (voir le didacticiel : ref:`doc_import_images` du pipeline de ressources).

source: Enable pixel snap (Set ``Project > Project Settings > Rendering > Quality > 2d > Use Pixel Snap`` to true; you can also search for ``Pixel Snap``).
es: Activa pixel snap, se encuentra en ``Proyecto > Ajustes del proyecto > Rendering > Quality > 2d > Use Pixel Snap``, también se puede escribir ``Pixel Snap`` en la barra de búsqueda para localizarlo rápidamente.
fr: Mettez la capture de pixel sur Vrai (``Projet > Paramètres du projet > Rendu > Qualité > 2d > Utiliser Capture Pixel``, vous pouvez également rechercher ``Capture Pixel``).

source: You can use a single, separate image for each tile. This will remove all artifacts, but can be more cumbersome to implement and is less optimized.
fr: Vous pouvez utiliser une seule image distincte pour chaque tuile. Cela supprimera tous les artefacts mais peut être plus lourd à mettre en œuvre et moins optimisé.

source: Collision
es: Colisiones
