Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilemaps.po
Languages: es, fr, ja, uk

source: Using TileMaps
uk: Використання TileMaps (Карти Плиток)

source: Introduction
es: Introducción
ja: はじめに
uk: Вступ

source: A tilemap is a grid of tiles used to create a game's layout. There are several benefits to using :ref:`TileMap <class_TileMap>` nodes to design your levels. First, they make it possible to draw the layout by "painting" the tiles onto a grid, which is much faster than placing individual :ref:`Sprite <class_Sprite>` nodes one by one. Second, they allow for much larger levels because they are optimized for drawing large numbers of tiles. Finally, you can add collision, occlusion, and navigation shapes to tiles, adding additional functionality to the TileMap.
uk: Карта плитки - це сітка плиток, яка використовується для створення макета гри. Використання вузлів :ref:`TileMap (Карта Плиток)<class_TileMap>` для проектування ваших рівнів має кілька переваг . По-перше, вони дають можливість намалювати макет, "намалювавши" плитки на сітці, що набагато швидше, ніж розміщення окремих вузлів :ref:`Sprite <class_Sprite>` по одному. По-друге, вони дозволяють створювати набагато більші рівні, оскільки вони оптимізовані для малювання великої кількості плиток. Нарешті, ви можете додати зіткнення, оклюзії та фігури навігації до плиток, додавши додаткову функціональність до TileMap.

source: Project setup
ja: プロジェクトの設定
uk: Налаштування проєкта

source: This demo we'll use the following tiles taken from Kenney's "Abstract Platformer" art pack. You can find the complete set `here <https://kenney.nl/assets/abstract-platformer>`_ but for this demo we'll stick to this small set.
ja: このデモでは、Kenneyの「Abstract Platformer」アートパックから取得した次のタイルを使用します。ここで完全なセットを見つけることができますが、このデモではこの小さなセットを使います。
uk: У цій демонстрації ми використаємо наступні плитки, взяті з художнього набору Кенні "Абстрактний платформер". Ви можете знайти повний комплект `тут <https://kenney.nl/assets/abstract-platformer>`_, але для цієї демонстрації ми дотримуватимемось цього невеликого набору.

source: Create a new project and place the above image in the project folder.
ja: 新しいプロジェクトを作成し、プロジェクトフォルダーに上記の画像を配置します。
uk: Створіть новий проект і помістіть вищевказане зображення в папку проекта.

source: When using a tileset, it's important that adjacent tiles match up. Godot's default is to import 2D images using an interpolated "filter" mode, which will result in ugly borders between the tiles. Select the image and click the Import tab. Turn off ``Filter`` and click "Reimport". See :ref:`doc_import_images` for details.
ja: タイルセットを使用する場合、隣接するタイルが一致することが重要です。 Godotのデフォルトでは、補間された「フィルター」モードを使用して2D画像をインポートします。これにより、タイル間の境界が見苦しくなります。画像を選択し、[インポート]タブをクリックします。フィルターをオフにして、「再インポート」をクリックします。詳細については、画像のインポートを参照してください。
uk: При використанні набору плиток важливо, щоб сусідні плитки збігалися. За замовчуванням Godot імпортує 2D-зображення за допомогою інтерпольованого режиму "фільтра", що призведе до негарних меж між плитками. Виділіть зображення та натисніть вкладку Імпорт. Вимкніть ``Filter`` і натисніть "Повторний імпорт". Більше дивіться :ref:`doc_import_images`.

source: TileMap node
ja: TileMap ノード
uk: Вузол TileMap (Карта Плиток)

source: Add a new :ref:`TileMap <class_TileMap>` node to the scene. By default, a TileMap uses a square grid of tiles. You can also use a perspective-based "Isometric" mode or define your own custom tile shape.
ja: シーンに新しいTileMapノードを追加します。デフォルトでは、TileMapはタイルの正方形グリッドを使用します。パースペクティブベースの「アイソメ」モードを使用したり、独自のカスタムタイル形状を定義することもできます。
uk: Додайте до сцени новий вузол :ref:`TileMap <class_TileMap>`. За замовчуванням TileMap використовує квадратну сітку плиток. Ви також можете використовувати режим "Ізометричний" на основі перспективи або визначити власну форму плитки.

source: Under the "Cell" section in the Inspector are many properties you can adjust to customize your tilemap's behavior:
ja: インスペクターの[セル]セクションに、タイルマップの動作をカスタマイズするために調整できる多くのプロパティがあります。
uk: У розділі **Cell** *(Клітинка)* в Інспекторі є багато властивостей, які ви можете налаштувати, щоб налаштувати поведінку плитки вашої карти:

source: This defines the size of the grid. This should match the pixel size of your tiles. The default value is ``(64, 64)``.
ja: これで、グリッドのサイズを定義します。タイルのピクセルサイズと一致させる必要があります。デフォルト値は(64、64)です。
uk: Визначає розмір плитки. Має відповідати розміру ваших плиток у пікселях. Значення за замовчуванням - ``(64, 64)``.

source: This causes tiles to be drawn in order of their ``Y`` position, so that "lower" tiles are drawn on top of "higher" ones.
ja: これにより、タイルが ``Y`` 位置の順に描画されるため、「低い」タイルが「高い」タイルの上に描画されます。
uk: Призводить до того, що плитки малюються в порядку їх ``Y`` розташування, так що "нижчі" плитки малюються поверх "вищих".

source: ``Half Offset`` and ``Tile Origin``
ja: ``Half Offset`` と ``Tile Origin``
uk: ``Half Offset`` і ``Tile Origin``

source: These properties affect the position of the tile relative to the grid position.
ja: これらのプロパティは、グリッドの位置に対するタイルの位置に影響します。
uk: Впливають на положення плитки відносно положення сітки.

source: Defines the chunk size used for batched drawing. This can negatively affect performance. Don't change it unless you know what you're doing.
ja: バッチ描画に使用されるチャンクサイズを定義します。これはパフォーマンスに悪影響を及ぼす可能性があります。何をしているか分からない限り、変更しないでください。
uk: Визначає розмір шматка, який використовується для групового малювання. Може негативно вплинути на продуктивність. Не змінюйте його, якщо ви не знаєте, що робите.

source: Used to alter the tile's shape. Use this if you have non-square tiles.
ja: タイルの形状を変更するために使用されます。正方形でないタイルがある場合にこれを使用します。
uk: Використовується для зміни форми плитки. Використовуйте його, якщо у вас плитка не квадратна.

source: All of these options can be left at their defaults for this demo.
ja: これらのオプションはすべて、このデモのデフォルトのままにしておくことができます。
uk: Усі ці параметри можна залишити за замовчуванням для цієї демонстрації.

source: Creating a TileSet
ja: タイルセットの作成
uk: Створення TileSet

source: Once you've configured your tilemap, it's time to add a :ref:`TileSet <class_TileSet>`. A TileSet is a :ref:`Resource <class_Resource>` that contains the data about your tiles - their textures, collision shapes, and other properties. When the game runs, the TileMap combines the individual tiles into a single object.
ja: タイルマップを構成したら、TileSetを追加します。 TileSetは、タイルに関するデータ(テクスチャ、衝突形状、その他のプロパティ)を含むリソースです。ゲームを実行すると、TileMapは個々のタイルを1つのオブジェクトに結合します。
uk: Після того, як ви налаштували свою карту плиток, настав час додати :ref:`TileSet <class_TileSet>`. TileSet - це :ref:`Ресурс <class_Resource>`, що містить дані про ваші плитки - їх текстури, форми зіткнень та інші властивості. Коли гра запускається, TileMap об'єднує окремі плитки в один об'єкт.

source: To add a new TileSet, click on the "Tile Set" property and select "New TileSet".
ja: 新しいTileSetを追加するには、「Tile Set」プロパティをクリックして、「新規 TileSet」を選択します。
uk: Щоб додати новий TileSet, клацніть на властивість **Tile Set** і виберіть **Новий TileSet**.

source: Click on the TileSet property, and the "TileSet" panel will open at the bottom of the editor window:
uk: Клацніть на властивість TileSet, і внизу вікна редактора відкриється панель "TileSet":

source: First, you need to add the texture(s) that you'll use for the tiles. Click the "Add Texture(s) to TileSet" button and select the ``tilesheet.png`` image.
ja: 最初に、タイルに使用するテクスチャを追加する必要があります。"Add Texture(s) to TileSet" ボタンをクリックして、\ ``tilesheet.png`` 画像を選択します。
uk: Спочатку потрібно додати текстуру(и), яку ви будете використовувати для плиток. Натисніть кнопку **Додати текстуру(и) до TileSet** і виберіть зображення ``tilesheet.png``.

source: Next, click "New Single Tile" and drag in the image to select the tile you want. Click the "Enable Snap" button to make it easier to select the entire tile. A yellow rectangle appears around the selected tile.
ja: 次に、"New Single Tile" をクリックし、画像内にドラッグして目的のタイルを選択します。 [スナップを有効にする]ボタンをクリックして、タイル全体を選択しやすくします。選択したタイルの周りに黄色の長方形が表示されます。
uk: Далі натисніть **Нова окрема плитка** та перетягніть зображення, щоб вибрати плитку, яку ви хочете. Натисніть кнопку **Увімкнути прилипання**, щоб полегшити вибір плитки. Навколо вибраної плитки з’являється жовтий прямокутник.

source: Click on the TileMap in the scene tree, and you'll see that the newly created tile now appears on the right side. Click in the viewport and you can place tiles. Right-click to remove them.
ja: シーンツリーでTileMapをクリックすると、新しく作成されたタイルが右側に表示されることがわかります。ビューポートをクリックすると、タイルを配置できます。右クリックしてそれらを削除します。
uk: Клацніть на TileMap в дереві сцени, і ви побачите, що новостворена плитка тепер відображається з правого боку. Клацніть у вікні перегляду, і ви зможете розміщувати плитки. Клацніть правою кнопкою миші, щоб видалити їх.

source: It's easy to accidentally select and move the tilemap node. To avoid this, use the node's lock button:
ja: 誤ってタイルマップノードを選択して移動してしまうことがあります。これを回避するには、ノードのロックボタンを使用します。
uk: Легко випадково вибрати та перемістити вузол карти плиток. Щоб цього уникнути, використовуйте кнопку блокування вузла:

source: Collision shapes
uk: Форми зіткнень

source: If you're making a map that needs collisions - walls, floor, or other obstacles, for example - then you'll need to add collision shapes to any tiles that you want to be considered "solid".
ja: 壁、床、またはその他の障害物などの衝突を必要とするマップを作成している場合は、「ソリッド」と見なされるタイルに衝突形状を追加する必要があります。
uk: Якщо ви створюєте карту, яка потребує зіткнень - наприклад, стін, підлоги чи інших перешкод - тоді вам потрібно буде додати форми зіткнення до плиток, які за вашим задумом мають бути "твердими".

source: Click "TileSet" at the bottom of the editor window to return to the tileset tool. Click the tile you previously defined (outlined in yellow). Select the "Collision" tab and click the "Create a new rectangle" button. Make sure you still have grid snap enabled, then click and drag in the tile. A square collision shape appears in light blue:
ja: エディターウィンドウの下部にある "TileSet" をクリックして、タイルセットツールに戻ります。以前に定義したタイルをクリックします(黄色のアウトライン)。 "Collision" タブを選択し、"Create a new rectangle" ボタンをクリックします。グリッドスナップが有効になっていることを確認してから、タイルをクリックしてドラッグします。正方形の衝突形状が水色で表示されます。
uk: Клацніть на "TileSet" внизу вікна редактора, щоб повернутися до інструменту набору плиток. Клацніть плитку, яку ви визначили раніше (позначену жовтим кольором). Виберіть вкладку **Зіткнення** та натисніть кнопку **Створити прямокутник**. Переконайтеся, що у вас все ще ввімкнено прилипання сітки, а потім клацніть та пере-крийте плитку. Квадратна форма зіткнення виглядає світло-блакитним:

source: You can add occlusion and navigation shapes to the tile in the same way.
ja: 同じ方法で、オクルージョンとナビゲーションシェイプをタイルに追加できます。
uk: Ви можете таким же чином додати до плитки фігури перешкоди та навігації.

source: Atlas tiles
ja: アトラスタイル
uk: Атлас плиток

source: Rather than adding individual tiles one at a time, you can define a group of tiles all at once using an atlas. This also allows you to randomly generate tiles from the group.
uk: Замість того, щоб додавати окремі плитки по черзі, ви можете одночасно визначити групу плиток, використовуючи атлас. Він також дозволяє випадковим чином генерувати плитки з групи.

source: Click "New Atlas" and drag to select the entire tile sheet.
uk: Клацніть **Новий атлас** і виділіть увесь аркуш плиток.

source: If you haven't already, make sure to change the "Step" in the snap settings to `(64, 64)`, or your tiles may be chopped into smaller pieces. You can find this in the Inspector:
ja: まだ設定していない場合は、スナップ設定の "Step" を `(64、64)` に変更してください。変更しないと、タイルが細かく切り刻まれます。これはインスペクタで見つけることができます:
uk: Якщо ви цього ще не зробили, обов’язково змініть **Крок** у **Snap options** на ``(64, 64)``, інакше ваші плитки можуть бути порубані на менші шматки. Ви можете знайти це в Інспекторі:

source: Once you've defined the atlas you can add collision shapes to the individual tiles as before. You can also click "Icon" to select one of the tiles to represent the atlas.
ja: アトラスを定義したら、以前と同様に個々のタイルに衝突形状を追加できます。 "Icon" をクリックして、アトラスを表すタイルの1つを選択することもできます。
uk: Визначивши атлас, ви можете додати форми зіткнення до окремих плиток, як і раніше. Ви також можете натиснути **Піктограма**, щоб вибрати одну з плиток для представлення атласа.

source: Back in the TileMap, you can select the atlas tile and you'll see all of the tiles it contains:
ja: TileMapに戻って、アトラスタイルを選択すると、そこに含まれるすべてのタイルが表示されます。
uk: Повернувшись до TileMap, ви можете вибрати плитку атласу, і побачите всі плитки, які вона містить:

source: In addition to saving time when defining the tiles, this can help by grouping similar tiles together when you're working with a large number of tiles.
ja: これは、タイルを定義するときの時間を節約することに加えて、多数のタイルで作業しているときに類似のタイルをグループ化することで役立ちます。
uk: На додаток до економії часу при визначенні плиток, це може допомогти групуванням подібних плиток, коли ви працюєте з великою кількістю плиток.

source: Random tile priorities
uk: Випадкові пріоритети плитки

source: When drawing with atlas tiles, enabling the "Use priority" option causes tiles to be selected at random. By default, each tile in the tileset has an equal likelihood of occurring. You can change the likelihood by setting different priorities for each tile. For example, a tile with priority 2 is twice as likely to be selected as a tile with priority 1, and a tile with priority 3 is 50% more likely to be selected than a tile with priority 2.
uk: Якщо малювати за допомогою плиток атласу, увімкнення параметра **Увімкнути пріоритетність** призводить до випадкового вибору плиток. За замовчуванням кожна плитка в наборі плиток має однакову ймовірність появи. Ви можете змінити ймовірність, встановивши різні пріоритети для кожної плитки. Наприклад, плитка з пріоритетом 2 удвічі частіше буде обрана, ніж плитка з пріоритетом 1, а плитка з пріоритетом 3 на 50% частіше буде обрана, ніж плитка з пріоритетом 2.

source: Autotiles
uk: Автоплитки

source: Autotiles allow you to define a group of tiles, then add rules to control which tile gets used for drawing based on the content of adjacent cells.
uk: Автоплитки дозволяють визначити групу плиток, а потім додати правила для керування тим, яка плитка буде використовуватися для малювання на основі вмісту сусідніх клітинок.

source: Click "New Autotile" and drag to select the tiles you wish to use. You can add collisions, occlusion, navigation shapes, tile priorties, and select an icon tile in the same manner as for atlas tiles.
uk: Клацніть на **Нова автоплитка** та виділіть плитки, які хочете використовувати. Ви можете додати зіткнення, оклюзію, фігури навігації, пріоритети плиток та вибрати піктограму плитки таким же чином, як для атласу плиток.

source: Tile selection is controlled by bitmasks. Bitmasks can be added by clicking "Bitmask", then clicking parts of the tiles to add or remove bits in the mask. Left-clicking an area of the tile adds a bit, right-click removes "off", and shift-left-click sets an "ignore" bit.
uk: Вибір плитки контролюється бітовими масками. Бітові маски можна додати, натиснувши **Бітова маска**, і вибравши частину плиток, щоб додати або видалити біти в масці. Клацання лівою кнопкою миші на ділянці плитки додає біт, клацання правою кнопкою знімає "вимкнено", а клавіша Shift-ліва кнопка встановлює біт "ігнорувати".

source: Whenever Godot updates a cell using an autotile, it first creates a pattern based on which adjacent cells are already set. Then, it searches the autotile for a single tile with a bitmask matching the created pattern. If no matching bitmask is found, the "icon" tile will be used instead. If more than one matching bitmask is found, one of them will be selected randomly, using the tile priorities.
uk: Щоразу, коли Godot оновлює клітинку за допомогою автоплитки, він спочатку створює шаблон, на основі якого вже встановлені сусідні комірки. Потім він здійснює пошук автоплитки для однієї плитки з бітовою маскою, що відповідає створеному шаблону. Якщо відповідної бітової маски не знайдено, замість неї буде використана плитка "піктограма". Якщо знайдено більше однієї збіжної бітової маски, одна з них буде обрана випадковим чином, з використанням пріоритету плиток.

source: The rules for matching a bitmask to a pattern depend on the tileset's autotile bitmask mode. This can be set in the "Inspector" tab, under the "Selected Tile" heading. Allowed values are "2x2", "3x3 (minimal)", and "3x3".
uk: Правила узгодження бітової маски з шаблоном залежать від параметра режиму **Autotile Bitmask Mode** *(Режим бітової маски автоплитки)*. Його можна встановити на вкладці Інспектор під заголовком **Selected Tile** *(Вибрана плитка)*. Допустимі значення: "2x2", "3x3 (minimal)" і "3x3".

source: All "on" and "off" bits must be satisfied for a bitmask to match, but "ignore" bits are ignored.
uk: Усі "увімкнені" та "вимкнені" біти повинні відповідати бітовій масці, але біти "ігнорування" ігноруються.

source: In 2x2 mode, each bitmask contains four bits, one for each corner.
uk: У режимі 2x2 кожна бітова маска містить чотири біти, по одному для кожного кута.

source: Where a bit is "on", all cells connected to that corner must be filled using the same autotile, in order for the bitmask to match. For example, if the top-left bit is set, the cell directly above, directly left, and diagonally above-left must be filled.
uk: Якщо біт "увімкнений", всі клітинки, що межують з цим кутом, повинні бути заповнені за допомогою одної і тої ж автоплитки, щоб бітова маска збігалася. Наприклад, якщо встановлено біт ліворуч зверху, клітинки безпосередньо над, прямо зліва і по діагоналі ліворуч, потрібно заповнити.

source: Where a bit is "off", at least one cell connected to that corner must not be set using the same autotile.
uk: Там, де біт "вимкнений", принаймні одну клітинку, що межує з цим кутом, не можна встановлювати за допомогою одної і тої ж автоплитки.

source: At least one bit must be set for the tile to be used, so a total of 15 tiles would be needed to provide exactly one tile for each arrangement that this mode can test for.
uk: Потрібно встановити принаймні один біт для плитки, яка буде використовуватися, тому в цілому потрібно буде 15 плиток, щоб забезпечити рівно одну плитку для кожного розташування, яке цей режим може перевірити.

source: 2x2 mode can only match cells that are part of a 2-by-2 block - cells with no neighbors and lines only one cell wide are not supported.
uk: Режим 2x2 може збігатися лише з клітинками, які є частиною блоку 2 на 2 - клітинки без сусідів та ліній шириною лише в одну клітинку не підтримуються.

source: **Template - Generic:**
uk: **Шаблон - Загальний:**

source: This template can be used for sideways or fully top-down perspectives. It's designed for a TileMap cell size of 64x64.
uk: Цей шаблон можна використовувати для перспектив убік або повністю зверху вниз. Він розроблений для розміру клітинки TileMap 64x64.

source: Key:
uk: Ключ:

source: Red: "on"
uk: Червоний: "увімкнений"

source: White: "off"
uk: Білий: "вимкнений"

source: In 3x3 (minimal) mode, each bitmask contains 9 bits (4 corners, 4 edges, 1 center). The 4 corner bits work the same as in 2x2 mode.
uk: У режимі 3x3 (minimal) кожна бітова маска містить 9 бітів (4 кути, 4 ребра, 1 центр). 4 кутові біти працюють так само, як і в режимі 2x2.

source: When an edge bit is "on", the cell which shares that edge must be filled. When an edge bit is "off", the cell which shares that edge must be empty.
uk: Коли бітовий край "увімкнений", клітинка, яка межує з цим краєм, повинна бути заповнена. Коли бітовий край "вимкнений", сусідня клітинка, повинна бути порожньою.

source: The center bit should be "on" for any tile you wish to use. Note that in this mode, it makes no sense for a corner bit to be "on" when either edge bit adjacent to it is not "on".
uk: Центральний біт повинен бути "увімкнений" для будь-якої плитки, яку ви хочете використовувати. Зверніть увагу, що в цьому режимі немає сенсу "вмикати" кутовий біт , без "увімкнення", хоча б одного, сусіднього біта.

source: A total of 47 tiles would be needed to provide exactly one bitmask for each arrangement that this mode can test for.
uk: Загалом знадобиться 47 плиток, щоб забезпечити рівно одну бітову маску для кожного розташування, яке цей режим може перевірити.

source: Right-click an image and choose **Save image as…** to save it.
uk: Клацніть зображення правою кнопкою мишки та виберіть **Зберегти зображення як ...**, щоб зберегти його.

source: This template can be used for sideways or fully top-down perspectives. All templates below are designed for a TileMap cell size of 64x64, but you may have to use different subtile sizes for top-down templates as described below.
uk: Цей шаблон можна використовувати для перспектив убік або повністю зверху вниз. Усі наведені нижче шаблони розроблені для розміру клітинки TileMap 64x64, але, можливо, вам доведеться використовувати різні розміри підплиток для шаблонів зверху вниз, як описано нижче.

source: **Template - Generic 16 tiles:**
uk: **Шаблон - Загальний на 16 плиток:**

source: This template can be used for tilesets that only have 16 tiles - for simpler art styles the missing tiles will not be noticeable.
uk: Цей шаблон можна використовувати для наборів плиток, які мають лише 16 плиток - для більш простих художніх стилів відсутні плитки не будуть помітні.

source: Blue-checkered: "ignore"
uk: Синьо-білий: "ігнорувати"

source: **Template - Top-down floor in 3/4 perspective:**
uk: **Шаблон - Зверху вниз у перспективі 3/4:**

source: Key (applies to the four templates below):
uk: Ключ (відноситься до чотирьох шаблонів нижче):

source: Green: floor
uk: Зелений: підлога

source: Cyan: wall
uk: Голубий: стіна

source: Yellow: top of wall
uk: Жовтий: верх стіни

source: Grey: hidden due to overlap
uk: Сірий: прихований через перекриття

source: Transparent: air
uk: Прозорий: повітря

source: **Template - Top-down wall in 3/4 perspective:**
uk: **Шаблон - Стіна зверху вниз у перспективі 3/4:**

source: **Template - Top-down wall in 3/4 perspective (thick walls):**
uk: **Шаблон - Стіна зверху вниз у перспективі 3/4 (товсті стіни):**

source: When using this template, set the TileSet subtile size to ``Vector2(64, 88)``.
uk: При використанні цього шаблону встановіть для розміру підплитки TileSet значення ``Vector2(64, 88)``.

source: **Template - Top-down wall in 3/4 perspective (tall walls):**
uk: **Шаблон - Стіна зверху вниз у перспективі 3/4 (високі стіни):**

source: When using this template, set the "Snap Options" Step to ``Vector2(64, 184)`` and the "Selected Tile" Texture offset to height minus the cell size. This means the texture offset should be ``Vector2(0, -120)``:
uk: При використанні цього шаблону встановіть **Snap Options -> Step** *(Параметри прив'язки -> Крок)* значення ``Vector2(64, 184)`` і **Selected Tile -> Texture offset** *(Вибрана плитка -> Зміщення текстури)* на висоту мінус розмір клітинки. Це означає, що зміщення текстури має бути ``Vector2(0, -120)``:

source: In 3x3 mode, each bitmaks contains 9 bits (4 corners, 4 edges, 1 center)
uk: У режимі 3x3 кожна бітова маска містить 9 бітів (4 кути, 4 ребра, 1 центр)

source: Each bit checks a single adjacent cell. Corner bits only check diagonally adjacent cells. The center bit should be "on" for any tile you wish to use.
uk: Кожен біт перевіряє одну сусідню клітинку. Кутові біти перевіряють лише сусідні по діагоналі клітинки. Центральний біт повинен бути "увімкнений" для будь-якої плитки, яку ви хочете використовувати.

source: A total of 256 tiles would be needed to provide exactly one bitmask for each arrangement that this mode can test for.
uk: Всього потрібно 256 плиток, щоб забезпечити рівно одну бітову маску для кожного розташування, яке цей режим може перевірити.

source: Disabling autotile
uk: Відключення автоплиток
