Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilemaps.po
Languages: es, fr, ja, uk

source: When using an autotile, it is possible to turn off the autotile behaviour and select tiles manually, by clicking "Disable Autotile" at the top of the tile selection window.
uk: При використанні автоплитки можна вимкнути поведінку її та вибирати плитки вручну, натискаючи кнопку **Вимкнути автоплитки** у верхній частині вікна вибору плитки.

source: Autotile binding
uk: Прив'язка автоплиток

source: By default, autotile only checks for adjacent cells filled using the same autotile. This behaviour can be overridden in order to have autotiles bind to each other, or even bind to empty cells. At present, this can only be done through scripting. You will need to add a script to your tileset, and define a function named "_is_tile_bound(drawn_id, neighbor_id)". This function will be called for each adjacent cell that does not contain the same autotile, and should return true if you want the drawn cell to "bind" to the neighbor cell. You can find the id of an autotile using "find_tile_by_name(name)", empty cells are given an id of -1.
uk: За замовчуванням автоплитка перевіряє лише сусідні комірки, заповнені за допомогою тих самих автоплиток. Цю поведінку можна замінити, щоб автоплитки зв’язувались між собою, або навіть прив’язувались до порожніх комірок. В даний час це можна зробити лише за допомогою скриптів. Вам потрібно буде додати скрипт до вашого набору плиток і визначити функцію з назвою ``_is_tile_bound (drawn_id, сусед_id)``. Ця функція буде викликана для кожної сусідньої клітинки, яка не містить такої самої автоплитки, і повинна повертати значення ``true``, якщо ви хочете, щоб намальована клітинка "прив'язувалася" до сусідньої клітинки. Ви можете знайти ідентифікатор автоплитки за допомогою ``find_tile_by_name (ім'я)``, порожні клітинки отримують ідентифікатор -1.

source: Note that to use this in the editor, the script should start with a "tool" declaration, and you may need to close and reload the scene for these changes to take effect.
uk: Зауважте, що для використання скрипта в редакторі він повинен починатися з оголошення ``tool``, і можливо, вам доведеться закрити та перезавантажити сцену, щоб ці зміни набрали чинності.

source: Tips and tricks
ja: ヒントとテクニック
uk: Поради та підказки

source: If you're using a :ref:`Camera2D <class_Camera2D>` to scroll your level, you may notice lines appearing between your tiles. To fix this, open Project Settings and enable "Use Pixel Snap" in the "Rendering/Quality" section.
ja: :ref:`Camera2D <class_Camera2D>` を使用してレベルをスクロールしている場合、タイル間に線が表示される場合があります。これを修正するには、プロジェクト設定を開き、"Rendering/Quality" セクションで "Use Pixel Snap" を有効にします。
uk: Якщо ви використовуєте :ref:`Camera2D<class_Camera2D>` для прокрутки свого рівня, ви можете помітити рядки, що з’являються між вашими плитками. Щоб виправити це, відкрийте **Параметри проекта** та ввімкніть **Use Pixel Snap** *(Використовувати прив'язку пікселів)* у розділі **Rendering/Quality** *(Візуалізація/Якість)*.

source: You can flip and rotate tiles using the icons at the top right of the editor.
ja: エディターの右上にあるアイコンを使用して、タイルを反転および回転できます。
uk: Ви можете перевертати та обертати плитки, використовуючи піктограми у верхньому правому куті редактора.

source: To draw straight lines, hold :kbd:`Shift` while clicking and dragging a tile.
uk: Щоб намалювати прямі лінії, утримуйте :kbd:`Shift` клацаючи та перетягуючи плитку.

source: Tools such as copy, paste, and bucket fill, can be found in the "TileMap" menu in the upper-right.
ja: コピー、貼り付け、バケット塗りつぶしなどのツールは、右上の "TileMap" メニューにあります。
uk: Такі інструменти, як копіювання, вставлення та заповнення сегмента, можна знайти в меню "TileMap" у верхньому правому куті.

source: Using tilemaps
es: Usando tilemaps
fr: Utiliser les palettes de tuiles
ja: タイルマップの使用

source: A tilemap is a grid of tiles used to create a game's layout. There are several benefits to using :ref:`TileMap <class_TileMap>` nodes to design your levels. First, they make it possible to draw the layout by "painting' the tiles onto a grid, which is much faster than placing individual :ref:`Sprite <class_Sprite>` nodes one by one. Second, they allow for much larger levels because they are optimized for drawing large numbers of tiles. Finally, you can add collision, occlusion, and navigation shapes to tiles, adding additional functionality to the TileMap.
ja: タイルマップは、タイルを枡目状に並べてゲームのレイアウトを作成するために使用します。 TileMapノードでレベルを設計することには、いくつかの利点があります。 1つは、タイルを枡目状に「ペイント」することでレイアウトを描画できるようにすることです。これは、個々のスプライトノードを1つずつ配置するよりもはるかに高速です。 第二に、多数のタイルを描画するために最適化されているため、はるかに大きなレベルが可能です。最後に、コリジョン、オクルージョン、ナビゲーションシェイプをタイルに追加して、TileMapに機能を追加できます。

source: When you do this, the "TileSet" panel will open at the bottom of the editor window:
ja: すると、エディタウィンドウの下部に「TileSet」パネルが開きます。

source: Collision Shapes
ja: コリジョン形状

source: Rather than adding individual tiles one at a time, you can define a group of tiles all at once using an atlas. Click "New Atlas" and drag to select the entire tile sheet.
ja: 個々のタイルを1つずつ追加するのではなく、アトラスを使用してタイルのグループを一度に定義できます。"New Atlas" をクリックし、ドラッグしてタイルシート全体を選択します。

source: To draw straight lines, hold <Shift> while clicking and dragging a tile.
ja: 直線を描くには、<Shift>を押しながらタイルをクリックしてドラッグします。

source: Tilemaps are a simple and quick way to make 2D game levels. Basically, you start with a bunch of reference tiles (or pieces) that can be put on a grid, as many times each as desired - think of it like a map editor:
fr: Les palettes de tuiles sont un moyen simple et rapide de créer des niveaux de jeu 2D. Fondamentalement, vous commencez avec une quantité de tuiles de référence (ou pièces) qui peuvent être placés sur une grille, autant de fois que vous le souhaitez - pensez à cela comme un éditeur de cartes :

source: Collisions can also be added to the tiles, allowing for both 2D side scrolling and top down games.
es: También se pueden agregar figuras de colisión a los tiles, permitiendo crear juegos tanto "side scrolling" (vista lateral) como "top down" (vista superior).
fr: Des collisions peuvent également être ajoutées aux tuiles, permettant à la fois des jeux 2D à défilement latéral et vertical.

source: Making a tileset
es: Creando un tileset
fr: Faire un jeu de tuiles

source: To begin, a tileset needs to be made. Here are some tiles for it. They are all in the same image for optimization reasons. There are so-called *texture packers* that will generate these spritesheets out of your separate texture files. Having them as separate images also works.
es: Para comenzar, un tileset (conjunto de tiles) debe ser creado. Aquí hay algunos tiles, todos están en la misma imagen por razones de optimización. Los programas llamado *texture packers* se utilizan para generar spritesheets de los archivos separados de imágenes usados como textura. También se pueden utilizar archivos de imagen individuales.
fr: Pour commencer, un jeux de tuiles doit être créé. Voici quelques tuiles pour ce faire. Eles sont toutes dans la même image pour des raisons d'optimisation. Il existe des *emballeurs de textures* qui vont générer ces feuilles de sprites à partir de vos fichiers de textures séparés. Les avoir en tant qu'images séparées fonctionne également.

source: Create a new project and move the above PNG image into the directory. Next, go into the image's import settings and turn off ``Filter``, keeping it on will cause issues later. ``Mipmaps`` should already be disabled; if not, disable this too.
es: Crea un proyecto nuevo y mueve la imagen PNG mostrada arriba dentro de la carpeta. Luego, en la configuración de importación (panel Importar) desactivar ``Filter`` de las opciones. ``Mipmaps`` debería estar desactivado, en caso contrario, desactiva esto también.
fr: Créez un nouveau projet et déplacez l'image PNG ci-dessus dans le répertoire. Ensuite, allez dans les paramètres d'importation de l'image et désactivez ``Filter``, le garder activé causera des problèmes plus tard. ``Mipmaps`` devrait déjà être désactivé, sinon désactivez-le aussi.

source: We will be creating a :ref:`TileSet <class_TileSet>` resource. While this resource exports properties, it's pretty difficult to get complex data into it and maintain it. Here is what it would look like to manually edit the resource:
es: Crearemos un recurso :ref:`TileSet <class_TileSet>`. Aunque este recurso exporte propiedades, es difícil incluir y mantener datos complejos. Así es como se ve si se intenta editar el recurso manualmente:
fr: Nous allons créer une ressource :ref:`Jeu de tuiles <class_TileSet>`. Bien que cette ressource exporte des propriétés, il est assez difficile d’y insérer des données complexes et de les maintenir. Voici à quoi cela ressemblerait de modifier manuellement la ressource :

source: There are enough properties to get by. With some effort, editing this way can work. But the easiest way to edit and maintain a tileset is exporting it from a specially-crafted scene!
es: Hay muchas propiedades y, con un poco de esfuerzo, este modo de editar puede funcionar, pero el modo más simple para mantener tilesets es exportándolos desde una escena creada especialmente para esto.
fr: Il y a suffisamment de propriétés pour s'en sortir. Avec quelques efforts, éditer de cette manière peut fonctionner. Cependant, le moyen le plus simple de modifier et de gérer un jeu de tuiles est de l'exporter à partir d'une scène spécialement conçue !

source: TileSet scene
es: Escena TileSet
fr: Scène de jeu de tuiles

source: Create a new scene with a regular Node or Node2D as root. For each tile you want to define, add a sprite node as a child. Since tiles here are 50x50, you should turn on the grid (``View -> Show Grid`` or ``G`` key) and enable snap (``Use Snap`` icon or ``S`` key). Moving tiles with the mouse might still be a bit inaccurate, so use your arrow keys as well.
es: Crea una nueva escena con un Node o Node2D como raíz. Agrega un sprite por cada tile que quieras definir, como los tiles quí son de 50x50, deberías activar la rejilla (``Vista -> Mostrar rejilla``) y activa el fijado (botón ``Usar Fijado`` o tecla ``S``). Mover tiles con el mouse puede ser poco preciso así que también conviene usar las flechas del teclado.
fr: Créez une nouvelle scène avec un nœud Node ou Node2D en tant que racine. Pour chaque tuile que vous souhaitez définir, ajoutez un nœud sprite en tant qu'enfant. Puisque les tuiles ici sont 50x50, vous devez activer la grille (``Affichage -> Afficher la grille``, ou la touche ``G``) ainsi que la capture (icône ``Utiliser Capture``, ou la touche ``S``). Déplacer les tuiles avec la souris peut toujours être imprécis, ainsi utilisez aussi les touches fléchées.

source: If more than one tile is present in the source image, make sure to use the region property of the sprite to adjust which part of the texture is being used.
es: Si hay más de un tile presente en la imagen de orígen, asegúrate de utilizar la propiedad "region" o "frame" (si están empaquetados de manera uniforme) del sprite para ajustar qué parte de la textura será utilizada.
fr: Si plusieurs tuiles sont présentes dans l'image source, veillez à utiliser la propriété region du sprite pour définir la partie de la texture à utiliser.

source: Finally, make sure to name your sprite node correctly. This will ensure that, in subsequent edits to the tileset (for example, if you've added collision, changed the region, etc), the tile will still be **identified correctly and updated**. This name should be unique.
es: Finalmente, cerciórate de nombrar tus nodos Sprite correctamente. Para asegurarse de que en futuras ediciones (por ejemplo, agregando colisiones, cambiando regiones de imagen, etc.), el tile seguirá siendo **identificado y actualizado correctamente**. El nombre debe ser único.
fr: Enfin, assurez-vous de nommer votre nœud sprite correctement. Cela garantira que, lors des éditions ultérieures sur le jeu de tuiles (par exemple, si vous ajoutez des collisions, changez la région, etc.), la vignette sera toujours **identifiée correctement et mise à jour**. Ce nom devrait être unique.

source: Sounds like quite a few requirements, so here's a screenshot that shows where everything of relevance is:
fr: Cela semble être beaucoup d'exigences, alors voici une capture d'écran qui montre où se trouve tout ce qui est pertinent :

source: Continue adding all the tiles, adjusting the offsets if needed (that is, if you have multiple tiles in a single source image). Again, *remember that their names must be unique*.
es: Continúe agregando todos los tiles, ajustando posiciones de la textura donde sea necesario (en caso de usar una única imagen para muchos tiles). *No olvides que sus nombres deben ser únicos*.
fr: Continuez à ajouter toutes les tuiles en ajustant les décalages si nécessaire (si vous avez plusieurs tuiles dans une seule image source). Encore une fois, *rappelez-vous que leurs noms doivent être uniques*.

source: To add collision to a tile, create a StaticBody2D child for each sprite. This is a static collision node. Then create a CollisionShape2D or CollisionPolygon as a child of the StaticBody2D. The CollisionPolygon is recommended because it is easier to edit.
es: Para agregar colisiones a un tile, crea un StaticBody2D como hijo de cada sprite "sólido". Este nodo representa a un cuerpo estático de colisión. Luego crea un CollisionShape2D o ColissionPolygon2D como hijo del StaticBody2D. El nodo CollisionPolygon2D es recomendable ya que es más fácil de editar.
fr: Pour ajouter une collision à une tuile, créez un enfant StaticBody2D pour chaque image-objet. Ceci est un nœud de collision statique. Créez ensuite un CollisionShape2D ou un CollisionPolygon en tant qu'enfant du StaticBody2D. CollisionPolygon est recommandé car il est plus facile à éditer.

source: Finally, edit the polygon; this will give the tile a collision and fix the warning icon next to the CollisionPolygon node. **Remember to use snap!** Using snap will make sure collision polygons are aligned properly, allowing a character to walk seamlessly from tile to tile. Also **do not scale or move** the collision and/or collision polygon nodes. Leave them at offset 0,0, with scale 1,1 and rotation 0 with respect to the parent sprite.
es: Finalmente, edita el polígono o figura, todo esto le dará una colisión al tile además de cumplir los requerimientos indicados por el icono de advertencia, junto al nodo de colisión. **Recuerde usar ajuste a rejilla**, utilizando el ajuste asegurarás que los puntos estén propiamente alineados, permitiendo que un personaje pueda caminar sin problemas de tile a tile. También **no escales o muevas** los cuerpos o nodos de figuras de colisión, déjalos en posición 0,0 con escala 1,1 y rotación 0 respecto al sprite padre.
fr: Enfin, éditez le polygone, cela donnera une collision à la tuile et corrigera l'icône d'avertissement à côté du nœud CollisionPolygon. **N'oubliez pas d'utiliser la capture !** L'utilisation de la capture assurera que les polygones de collision sont correctement alignés, permettant à un personnage de se déplacer de manière transparente d'une tuile à l'autre. De plus, **ne pas mettre à l'échelle ni déplacer** les nœuds de polygones de collision et/ou de collision. Laissez-les à l'offset 0,0, avec l'échelle 1,1 et la rotation 0 par rapport au sprite parent.

source: Keep adding collisions to the tiles until we are done. Note that BG is just a background, so it should not have a collision.
es: Agrega colisiones hasta que esté todo listo. Notar que BG en la imagen es sólo para el fondo y no debería tener colisiones.
fr: Continuez à ajouter des collisions aux tuiles jusqu'à ce que nous ayons terminé. Notez que BG n'est qu'un arrière-plan, il ne devrait donc pas y avoir de collisions.

source: OK! We're done! Remember to save this scene for future edit. Name it "tileset_edit.scn" or something like that.
es: Ya está listo, recuerda grabar la escena para ediciones futuras. Puedes llamarla "tileset_edit.tscn" o como desees.
fr: Voilà ! Nous avons fini ! Rappelez-vous de sauvegarder cette scène pour une édition ultérieure. Nommez-la "jeudetuiles_edit.scn" ou quelque chose comme ça.

source: Exporting a TileSet
es: Exportando un Tileset
fr: Exporter un jeu de tuiles

source: With the scene created and opened in the editor, the next step will be to create a tileset. Use Scene > Convert To > Tile Set from the Scene Menu:
es: Con la escena creada y abierta en el editor, el siguiente paso será crear un tileset. Usa Escena > Convertir a > Tileset en el Menú de Escena:
fr: Avec la scène créée et ouverte dans l'éditeur, l'étape suivante consistera à créer un jeux de tuiles. Utilisez Scène > Convertir en > Jeux de tuiles, à partir du menu Scène :

source: Then choose a filename, like "mytiles.tres". Make sure the "Merge With Existing" option is toggled on. This way, every time the tileset resource file is overwritten, existing tiles are merged and updated (they are referenced by their unique name, so again, **name your tiles properly**).
es: Luego coloque un nombre, como "mytileset.tres". Asegúrate que la opción "Unir con Existente" está activada. De este modo, cada vez que un recurso de tileset es sobreescrito, los tiles existentes serán combinados y actualizados (referenciados por su nombre único, por eso se debe **nombrar los tiles apropiadamente**).
fr: Choisissez ensuite un nom de fichier, comme "mestuiles.tres". Assurez-vous que l'option "Fusionner avec l'existant" est activée. Ainsi, chaque fois que le fichier de ressources du jeu de tuiles est écrasé, les tuiles existantes sont fusionnées et mises à jour (elles sont référencées par leur nom unique, donc encore une fois, **nommez vos tuiles correctement**).

source: Using the TileSet in a TileMap
es: Usando el TileSet en un TileMap
fr: Utilisation du jeux de tuiles dans un plan de tuiles

source: Create a new scene, using any node or node2d as root, and then create a :ref:`TileMap <class_TileMap>` as a child.
es: Crea una nueva escena usando cualquier Node o Node2d como raíz, luego agrega un :ref:`TileMap <class_TileMap>` como hijo.
fr: Créez une nouvelle scène en utilisant n'importe quel nœud ou node2d en tant que racine, puis créez un :ref:`Plan de tuiles <class_TileMap>` en tant qu'enfant.

source: Go to the TileSet property of this node and assign the one created in previous steps:
es: Ve a la propiedad TileSet de este nodo y asigna lo creado previamente:
fr: Accédez à la propriété du jeux de tuiles de ce nœud et affectez-y celle créée aux étapes précédentes :

source: Also set the cell size to '50', since that is the size used by the tiles. Quadrant size is a tuning value, which means that the engine will draw and cull the tilemap in blocks of 16x16 tiles. This value is usually fine and does not need to be changed, but can be used to fine tune performance in specific cases (if you know what you are doing).
es: Cambia el "cell size" a `50`, ya que es el tamaño utilizado por los tiles. El "quadrant size" es un valor de ajuste especial, es lo que el motor usará para dibujar y descartar porciones del tilemap, por defecto en bloques de 16x16 tiles. Este valor normalmente no necesita ser cambiado pero se puede utilizar para un ajuste fino de desempeño en algunos casos particulares.
fr: Définissez également la taille de la cellule sur '50', car il s'agit de la taille utilisée par les tuiles. La taille du quadrant est une valeur de réglage, ce qui signifie que le moteur dessinera et définira le plan de tuiles par blocs de 16x16 tuiles. Cette valeur est généralement correcte et ne nécessite pas de modification, mais peut être utilisée pour ajuster les performances dans des cas spécifiques (si vous savez ce que vous faites).

source: Painting your world
es: Pintando tu mundo
fr: Décorer votre monde

source: With all set, make sure the TileMap node is selected. A red grid will appear on the screen, allowing you to paint on it with the selected tile on the left palette.
es: Con todo listo, asegúrate que el nodo TileMap está seleccionado. Una rejilla roja aparecerá en pantalla, permitiendo pintar en esta con el tile seleccionado de la paleta a la izquierda.
fr: Lorsque tout est défini, assurez-vous que le nœud TileMap (Plan de tuiles) est sélectionné. Une grille rouge apparaîtra à l’écran, permettant d’y peindre avec la tuile sélectionnée dans la palette de gauche.

source: To avoid accidentally moving and selecting the tilemap node (something common, given it's a huge node), it is recommended that you lock it, using the lock button:
es: Para prevenir mover accidentalmente el nodo TileMap (algo común ya que es un nodo normalmente grande), es recomendable bloquearlo utilizando el botón con forma de candado:
fr: Pour éviter de déplacer et de sélectionner accidentellement le nœud tilemap, plan de tuiles (ce qui est courant dans la mesure où il s'agit d'un nœud énorme), il est recommandé de le verrouiller à l'aide du bouton de verrouillage :

source: If you accidentally place a tile somewhere you don't want it to be, you can delete it with ``RMB`` (the right mouse button) while in the tilemap editor.
fr: Si vous placez accidentellement une tuile à un endroit que vous ne souhaitez pas, vous pouvez la supprimer avec ``RMB`` (le bouton droit de la souris) dans l'éditeur de plans de tuiles.

source: You can also flip and rotate sprites in the TileMap editor (note: flipping the sprite in the TileSet will have no effect). Icons at the top right of the editor allow flipping and rotating of the currently selected sprite - you can also use the A and S keys to flip the sprite horizontally and vertically. With a brick pattern like this tutorial uses, flipping the sprites would create unpleasant discontinuities unless you're flipping an entire region of bricks. But for some kinds of tiles, flipping can be a convenient and space-saving feature.
es: También se pueden invertir y rotar sprites en el editor de TileMap (nota que girar el sprite en el TileSet no tendrá efecto). Iconos en la parte superior derecha del editor permiten invertir y rotar el sprite seleccionado - también se pueden utilizar las teclas A y S para voltear horizontal y verticalmente. Con un patrón de ladrillos como los de este tutorial, invertir sprites puede crear discontinuidades poco agradables a menos que gires grandes zonas de ladrillos, pero para algunos tipos de tiles esto puede ser conveniente para ahorrar espacio y recursos en general.
fr: Vous pouvez également retourner et faire pivoter les sprites dans l'éditeur de Plans de Tuiles (remarque: inverser les sprites dans le Jeux de Tuiles n'aura aucun effet). Les icônes en haut à droite de l'éditeur permettent d'inverser et de faire pivoter le sprite sélectionné. Vous pouvez également utiliser les touches A et S pour inverser le sprite horizontalement et verticalement. Avec un modèle de briques similaire à celui utilisé dans ce didacticiel, inverser les sprites créerait des discontinuités désagréables, à moins que vous ne retourniez une région entière de briques. Mais pour certains types de tuiles, le retournement peut être une fonctionnalité pratique et peu encombrante.

source: Offset and scaling artifacts
es: Desplazamiento y errores de escalado
fr: Artefacts de décalage et de mise à l'échelle

source: When using a single texture for all the tiles, scaling the tileset (or even moving to a non pixel-aligned location) will most likely result in filtering artifacts like so:
es: Cuando se utiliza una textura única para los tiles, escalar el tilemap (o moviéndolo a una posición no alineada a pixeles) puede resultar en errores visuales o artefactos:
fr: Lorsque vous utilisez une seule texture pour toutes les tuiles, la mise à l'échelle du jeu de tuiles (ou même le déplacement vers un emplacement non aligné sur les pixels), entraînera très probablement un filtrage des artefacts, comme suit :
