Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/assetlib/uploading_to_assetlib.po
Languages: de, zh_cn

source: Submitting to the Asset Library
de: Übermittlung an die Bestandsbibliothek
zh_cn: 提交资源到资源馆

source: Introduction
de: Einführung
zh_cn: 简介

source: This tutorial aims to serve as a guide on how you can submit your own assets to the Godot Asset Library and share them with the Godot community.
de: Diese Anleitung soll als Leitfaden dienen, wie Sie Ihre eigenen Assets bei der Godot Bestandsbibliothek einreichen und mit der Godot-Gemeinschaft teilen können.

source: As mentioned in the :ref:`doc_using_assetlib` document, in order to be able to submit assets to the AssetLib, you need to have a registered account, and be logged in.
de: Wie im Dokument :ref:`doc_using_assetlib` erwähnt, müssen Sie über ein registriertes Konto verfügen und angemeldet sein, um Inhalte an die Bestandsbibliothek senden zu können.
zh_cn: 正如 :ref:`doc_using_assetlib` 文档中提到的，为了能够向AssetLib提交资源，您需要有一个注册的帐户，并且需要登录。

source: Submission guidelines
de: Übergaberichtlinien
zh_cn: 提交指南

source: Before submitting your asset, please ensure it follows all of the requirements, and also consider following the recommendations.
de: Stellen Sie vor dem Einreichen Ihres Assets sicher, dass alle Anforderungen erfüllt sind, und beachten Sie auch die Empfehlungen.

source: Requirements
de: Voraussetzungen

source: Generally speaking, most assets people submit to the asset library are accepted. However, in order for your asset to be accepted, there are a few requirements your asset needs to meet to be approved.
de: Im Allgemeinen werden die meisten Assets akzeptiert, die von Personen an die Bestandsbibliothek gesendet werden. Damit Ihr Asset akzeptiert werden kann, müssen jedoch einige Anforderungen erfüllt sein, damit es genehmigt werden kann.

source: The asset must work. If the asset doesn't run or otherwise doesn't work in the specified Godot version, then it will be rejected.
de: Das Asset muss funktionieren. Wenn das Asset in der angegebenen Godot-Version nicht ausgeführt wird oder anderweitig nicht funktioniert, wird es abgelehnt.

source: The asset must have a proper **.gitignore** file. It's important to keep redundant data out of the repository. `Here's a template. <https://github.com/github/gitignore/blob/master/Godot.gitignore>`_
de: Das Asset muss über eine ordnungsgemäße **.gitignore**-Datei verfügen. Es ist wichtig, redundante Daten aus dem Repository fernzuhalten. `Hier ist eine Vorlage. <https://github.com/github/gitignore/blob/master/Godot.gitignore> `_

source: Use proper English for the name and description of your asset. This includes using correct capitalization, and using full sentences in the description.
de: Verwenden Sie korrektes Englisch für den Namen und die Beschreibung Ihres Assets. Dies beinhaltet die Verwendung der korrekten Großschreibung und die Verwendung vollständiger Sätze in der Beschreibung.

source: The icon link must be a direct link. For icons hosted on GitHub, the link must start with "raw.githubusercontent.com", not "github.com".
de: Der Symbollink muss ein direkter Link sein. Für auf GitHub gehostete Symbole muss der Link mit "raw.githubusercontent.com" beginnen, nicht mit "github.com".

source: Recommendations
de: Empfehlungen

source: These things are not required for your asset to be approved, but if you follow these recommendations, you can help make the asset library a better place for all users.
de: Diese Dinge sind nicht erforderlich, damit Ihr Asset genehmigt wird. Wenn Sie jedoch diese Empfehlungen befolgen, können Sie dazu beitragen, die Bestandsbibliothek für alle Benutzer zu einem besseren Ort zu machen.

source: Fix or suppress all script warnings. The warning system is there to help identify issues with your code, but people using your asset don't need to see them.
de: Korrigieren oder unterdrücken Sie alle Skriptwarnungen. Das Warnsystem hilft dabei, Probleme mit Ihrem Code zu identifizieren, aber Benutzer Ihres Assets müssen sie nicht sehen.

source: Make your code conform to the official style guides. Having a consistent style helps other people read your code, and it also helps if other people wish to contribute to your asset. See: the :ref:`doc_gdscript_styleguide` or the :ref:`doc_c_sharp_styleguide`.
de: Stellen Sie sicher, dass Ihr Code den offiziellen Stil-Richtlinien entspricht. Ein einheitlicher Stil hilft anderen Menschen Ihren Code zu lesen und es hilft auch, wenn andere Menschen zu Ihrem Asset etwas beitragen möchten. Siehe den :ref:`doc_gdscript_styleguide` oder :ref:` doc_c_sharp_styleguide`.

source: If you have screenshots in your repo, place them in their own subfolder and add a **.gdignore** file in the same folder (note: **gd**, not **git**). This prevents Godot from importing your screenshots. On Windows, open a command prompt in the project folder and run ``type nul > .gdignore`` to create a file whose name starts with a period.
de: Wenn Sie Screenshots in Ihrer Sammlung haben, platzieren Sie diese in einem eigenen Unterordner und fügen Sie eine **.gdignore**-Datei im selben Ordner hinzu (Hinweis: **gd**, nicht **git**). Dies verhindert, dass Godot Ihre Screenshots importiert. Öffnen Sie unter Windows eine Eingabeaufforderung im Projektordner und führen Sie ``type nul> .gdignore`` aus, um eine Datei zu erstellen, deren Name mit einem Punkt beginnt.

source: If your asset is a library for working with other files, consider including example files in the asset.
de: Wenn Ihr Asset eine Bibliothek für die Arbeit mit anderen Dateien ist, sollten Sie Beispieldateien in das Asset aufnehmen.

source: The icon should be a square, its aspect ratio should be 1:1. It should also ideally have a minimum resolution of 64x64 pixels.
de: Das Symbol sollte ein Quadrat mit einem Seitenverhältnis 1: 1 sein. Idealerweise sollte es auch eine Mindestauflösung von 64 x 64 Pixel haben.

source: While the asset library allows more than just GitHub, consider hosting your asset's source code on GitHub. Other services may not work reliably, and a lack of familiarity can be a barrier to contributors.
de: Während die Bestandsbibliothek mehr als nur GitHub zulässt, sollten Sie den Quellcode Ihres Assets auf GitHub hosten. Andere Dienste funktionieren möglicherweise nicht zuverlässig, und mangelnde Vertrautheit kann ein Hindernis für die Mitwirkenden sein.

source: Submitting
de: Einreichen
zh_cn: 提交

source: Once you are logged in, you will be able to head over to the "Submit Assets" page of the AssetLib, which will look like this:
de: Sobald Sie angemeldet sind, können Sie zur Seite "Assets Submit" der AssetLib wechseln, die folgendermaßen aussieht:
zh_cn: 一旦您登录，您将能够转到AssetLib的“提交资源”页面，该页面如下所示:

source: While it may look like a lot (and there is more as you scroll down), each field is described in terms of what you should put in. We will nonetheless go over what is required in the submission form here as well.
de: Es sieht zwar nach viel aus (und es gibt noch mehr, wenn Sie nach unten scrollen), aber zu jedem Feld wird beschrieben, was Sie eingeben sollten. Wir werden jedoch auch hier auf das eingehen, was im Einreichungsformular erforderlich ist.
zh_cn: 虽然它可能看起来很多(并且向下滚动时会显示更多)，每个字段都是根据您应该放入的内容进行描述的。但是，我们仍坚持在这里将提交表单中所需的内容详细阐述一遍。

source: The name of your asset. Should be a unique, descriptive title of what your asset is.
de: Der Name Ihres Assets, es sollte ein eindeutiger, beschreibender Titel sein.
zh_cn: 您的资源名称。 应该是您资源的特有描述性标题。

source: The category that your asset belongs to, and will be shown in search results. The category is split into **Addons** and **Projects**. In-editor, assets of the Project type (Templates, Demos, Projects) only show up when viewing the AssetLib from the Project Manager, while assets of the Addon type will only be visible from inside a project.
de: Die Kategorie, zu der Ihr Inhalt gehört und die in den Suchergebnissen angezeigt wird. Die Kategorie ist in **Addons** und **Projekte** unterteilt. Im Editor werden Assets des Projekttyps (Vorlagen, Demos, Projekte) nur angezeigt, wenn die AssetLib im Projektmanager angezeigt wird, während Assets des Addon-Typs nur innerhalb eines Projekts sichtbar sind.
zh_cn: 您的资源所属的类别，并将显示在搜索结果中。 该类别分为 **插件** 和 **项目** 。 在编辑器中，项目类型(模板，演示，项目)的资源将显示在项目管理器的AssetLib中，而插件类型的资源仅显示在项目内部中。

source: The version of the engine that the asset works with. Currently, it's not possible to have a single asset entry contain downloads for multiple engine versions, so you may need to re-submit the asset multiple times, with an entry for each Godot version it supports. This is particularly important when dealing with major versions of the engine, such as Godot 2.x and Godot 3.x.
de: Die Version der Engine, mit der das Asset arbeitet. Derzeit ist es nicht möglich, dass ein einzelner Asset-Eintrag Downloads für mehrere Engine-Versionen enthält. Daher müssen Sie das Asset möglicherweise mehrmals mit einem Eintrag für jede unterstützte Godot-Version erneut senden. Dies ist besonders wichtig, wenn Sie sich mit Hauptversionen der Engine wie Godot 2.x und Godot 3.x befassen.

source: The version number of the asset. While you are free to choose and use any versioning scheme that you like, you may want to look into something such as `SemVer <https://semver.org>`_ if you want your asset's versioning scheme to be clear and consistent. Note that there is also an internal version number, incremented every time the asset download URL is changed or updated.
de: Die Versionsnummer des Assets. Sie können zwar ein beliebiges Versionsschema auswählen und verwenden, sollten jedoch möglicherweise etwas wie `SemVer <https://semver.org>`_ verwenden, damit das Versionsschema Ihres Assets klar und konsistent sein soll. Beachten Sie, dass es auch eine interne Versionsnummer gibt, die jedes Mal erhöht wird, wenn die URL zum Herunterladen von Assets geändert oder aktualisiert wird.
zh_cn: 资源的版本号。 虽然您可以自由选择和使用您喜欢的任何版本控制方案，但如果您希望资源的版本控制方案清晰且一致，您可能需要查看诸如 `SemVer <https://semver.org>`_ 之类的内容。 请注意，系统内还有一个内部版本号，每次更改或更新资源下载地址时都会增加。

source: Assets uploaded to the AssetLib are not hosted on it directly. Instead, they point to repositories hosted on third-party Git providers, such as GitHub, GitLab or Bitbucket. This is where you choose which provider your asset uses, so the site can compute the final download link.
de: In die AssetLib hochgeladene Assets werden nicht direkt darauf gehostet. Stattdessen verweisen sie auf Repositorys, die auf Git-Anbietern von Drittanbietern wie GitHub, GitLab oder Bitbucket gehostet werden. Hier wählen Sie aus, welchen Anbieter Ihr Asset verwendet, damit die Site den endgültigen Download-Link berechnen kann.

source: The URL to your asset's files/webpage. This will vary based on your choice of provider, but it should look similar to `https://github.com/<user>/<project>`.
de: Die URL zu den Dateien/Webseiten Ihres Assets. Dies hängt von Ihrer Wahl des Anbieters ab, sollte jedoch ähnlich wie `https://github.com/<user>/<project>` aussehen.
zh_cn: 资源文件/网页的地址。 这将根据您选择的提供商而有所不同，但它的结构类似于 `https://github.com/<user>/<project>`。

source: The URL to your asset's issue tracker. Again, this will differ from repository host to repository host, but will likely look similar to `https://github.com/<user>/<project>/issues`. You may leave this field empty if you use your provider's issue tracker, and it's part of the same repository.
de: Die URL zum Problem-Tracker Ihres Assets. Dies unterscheidet sich wiederum von Repository-Host zu Repository-Host, sieht jedoch wahrscheinlich ähnlich aus wie `https://github.com/<user>/<project>/issues`. Sie können dieses Feld leer lassen, wenn Sie den Problem-Tracker Ihres Providers verwenden und er Teil desselben Repositorys ist.
zh_cn: 资源问题跟踪器的地址。 同样，这将不同于存储库主机，但结构类似于 `https://github.com/<user>/<project>/issues`。 如果您使用提供商的问题跟踪器，则可以将此字段留空，因为它是资源存储库的一部分。

source: **Download Commit**:
de: **Download bestätigen**:

source: The commit of the asset. For example, `b1d3172f89b86e52465a74f63a74ac84c491d3e1`. The site computes the actual download URL from this.
de: Das Commit des Assets, zum Beispiel `b1d3172f89b86e52465a74f63a74ac84c491d3e1`. Die Webseite berechnet daraus die tatsächliche Download-URL.

source: The URL to your asset's icon (which will be used as a thumbnail in the AssetLib search results and on the asset's page). Should be an image in either the PNG or JPG format.
de: Die URL zum Symbol Ihres Assets (das als Miniaturbild in den AssetLib-Suchergebnissen und auf der Seite des Assets verwendet wird) sollte ein Bild im PNG oder JPG Format sein.
zh_cn: 资源图标的地址(将在AssetLib搜索结果和资源页面中用作缩略图)。 应该是PNG或JPG格式的图像。

source: The license under which you are distributing the asset. The list includes a variety of free and open-source software licenses, such as GPL (v2 and v3), MIT, BSD and Boost Software License. You can visit `OpenSource.org <https://opensource.org>`_ for a detailed description of each of the listed licenses.
de: Die Lizenz unter der Sie den Asset vertreiben. Die Liste enthält eine Vielzahl von kostenlosen und Open-Source-Softwarelizenzen wie GPL (v2 und v3), MIT, BSD und Boost Software License. Sie können `OpenSource.org <https://opensource.org>`_ besuchen, um eine detaillierte Beschreibung jeder der aufgelisteten Lizenzen zu erhalten.
zh_cn: 您分发资源的许可证。 该列表包括各种免费和开源软件许可证，例如GPL(v2和v3)，MIT，BSD和Boost软件许可证。 您可以访问 `OpenSource.org <https://opensource.org>`_ 获取每个列出的许可证的详细说明。

source: **Description**:
de: **Beschreibung (Description)**:
zh_cn: **描述**:

source: Finally, you can use the Description field for a textual overview of your asset, its features and behavior, a changelog, et cetera. In the future, formatting with Markdown will be supported, but currently, your only option is plain text.
de: Schließlich können Sie das Feld Beschreibung für eine Textübersicht Ihres Assets, seiner Funktionen und seines Verhaltens, eines Änderungsprotokolls usw. verwenden. In Zukunft wird die Formatierung mit Markdown unterstützt. Derzeit ist Ihre einzige Option nur Klartext.
zh_cn: 最后，您可以使用Description字段来查看资源，其功能和行为，更改日志等文本概述。 将来，将支持使用Markdown格式，但目前只支持纯文本。

source: You may also include up to three video and/or image previews, which will be shown at the bottom of the asset page. Use the "Enable" checkbox on each of the preview submission boxes to enable them.
de: Sie können auch bis zu drei Video- und/oder Bildvorschauen einfügen, die unten auf der Asset-Seite angezeigt werden. Verwenden Sie das Kontrollkästchen "Aktivieren" in jedem der Vorschau-Übermittlungsfelder, um sie zu aktivieren.
zh_cn: 您还可以包含最多三个视频和/或图像预览，这些预览将显示在资源页面的底部。 请使用每个预览提交框上的“启用”复选框从而启用它们。

source: Either an image, or a video.
de: Entweder ein Bild oder ein Video.
zh_cn: 图像或视频。

source: **Image/YouTube URL**:
de: **Bild/YouTube URL**:
zh_cn: **图片/ YouTube的网址**:

source: Either a link to the image, or to a video, hosted on YouTube.
de: Entweder ein Verweis auf ein Bild oder ein Video, gehostet auf YouTube.
zh_cn: YouTube上托管的图片或视频链接。

source: **Thumbnail URL**:
de: **Miniaturbild (Thumbnail) URL**:
zh_cn: **缩略图地址**:

source: A URL to an image that will be used as a thumbnail for the preview. This option will be removed eventually, and thumbnails will be automatically computed instead.
de: Eine URL zu einem Bild, das als Miniaturbild für die Vorschau verwendet wird. Diese Option wird eventuell entfernt und stattdessen werden automatisch Miniaturansichten berechnet.

source: Once you are done, hit Submit. Your asset will be entered into the pending queue, which you can visit on the AssetLib `here <https://godotengine.org/asset-library/asset/edit?&asset=-1>`_ . The approval process is manual and may take up to a few days for your addon to be accepted (or rejected), so please be patient! You will be informed when your asset is reviewed. If it was rejected, you will be told why that may have been, and you will be able to submit it again with the appropriate changes. You may have some luck accelerating the approval process by messaging the moderators/assetlib reviewers on IRC (the ``#godotengine-atelier`` channel on Freenode), or the official Discord server.
de: Wenn Sie fertig sind, klicken Sie auf Senden. Ihr Asset wird in die ausstehende Warteschlange eingetragen, die Sie in der Bestandsbibliothek `hier <https://godotengine.org/asset-library/asset/edit?&asset=-1>`_ . aufrufen können. Der Genehmigungsprozess ist manuell und es kann bis zu einigen Tagen dauern, bis Ihr Addon akzeptiert (oder abgelehnt) wird. Bitte haben Sie etwas Geduld! Sie werden informiert, wenn Ihr Asset überprüft wurde. Wenn es abgelehnt wurde, wird Ihnen mitgeteilt, warum dies möglicherweise der Fall war, und Sie können es mit den entsprechenden Änderungen erneut einreichen. Möglicherweise haben Sie etwas Glück und können den Genehmigungsprozess beschleunigen, indem Sie den Moderatoren/Assetlib-Überprüfern im IRC (dem Kanal ``#godotengine-atelier`` "auf Freenode) oder dem offiziellen Discord-Server eine Nachricht senden.

source: **Asset Name**:
zh_cn: **资源的名称**:

source: **Category**:
zh_cn: **分类**:

source: **Godot version**:
zh_cn: **Godot 版本**:

source: **Version**:
zh_cn: **版本**:

source: **Repository host**:
zh_cn: **存储库主机**:

source: **Repository URL**:
zh_cn: **存储库地址**:

source: **Issues URL**:
zh_cn: **问题地址**:

source: **Download Commit/Tag**:
zh_cn: **下载提交/标记**:

source: The commit or tag of the asset. For example, `b1d3172f89b86e52465a74f63a74ac84c491d3e1` or `v1.0`. The site computes the actual download URL from this.
zh_cn: 资源的提交或标记。 例如， `b1d3172f89b86e52465a74f63a74ac84c491d3e1` 或 `v1.0` 。 资源馆网站根据此计算出实际下载地址。

source: **Icon URL**:
zh_cn: **图标地址**:

source: **License**:
zh_cn: **许可证**:

source: **Type**:
zh_cn: **类型**:

source: Once you are done, hit Submit. Your asset will be entered into the pending queue, which you can visit on the AssetLib `here <https://godotengine.org/asset-library/asset/edit?&asset=-1>`_ . The approval process is manual and may take up to a few days for your addon to be accepted (or rejected), so please be patient! You will be informed when your asset is reviewed. If it was rejected, you will be told why that may have been, and you will be able to submit it again with the appropriate changes. You may have some luck accelerating the approval process by messaging the moderators/assetlib reviewers on IRC (the #godotengine-atelier channel on Freenode), or the official Discord server.
zh_cn: 完成后，点击提交。 您的资源将被输入到待处理队列中，您可以在AssetLib上访问 `此处 <https://godotengine.org/asset-library/asset/edit?&asset=-1>`_ 。 审批流程是手动的，可能需要几天的时间才能接受(或拒绝)您的插件，所以请耐心等待！ 审核您的资源时会通知您。 如果它被拒绝，您将被告知为什么会这样，并且您将能够通过适当的更改再次提交。 您可以通过向IRC(Freenode上的 #godotengine-atelier 频道)或官方Discord服务器的版主/ assetlib审稿人发送消息来加快审批流程。

source: [TODO]
zh_cn: [开发中]
