Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/3d_performance_and_limitations.po
Languages: es, fr, zh_cn

source: 3D performance and limitations
es: Rendimiento y limitaciones del 3D
fr: Performances et limitions de la 3D
zh_cn: 3D性能和局限性

source: Godot follows a balanced performance philosophy. In the performance world, there are always trade-offs, which consist of trading speed for usability and flexibility. Some practical examples of this are:
fr: Godot suit une philosophie de performance équilibrée. Dans le monde de la performance, il y a toujours des compromis à faire, qui consistent à troquer la vitesse contre la facilité d'utilisation et la flexibilité. En voici quelques exemples pratiques :
zh_cn: Godot遵循平衡的表现理念。 在绩效世界中，总是需要权衡交易的可用性和灵活性。 一些实际的示例是:

source: Rendering objects efficiently in high amounts is easy, but when a large scene must be rendered, it can become inefficient. To solve this, visibility computation must be added to the rendering, which makes rendering less efficient, but, at the same time, fewer objects are rendered, so efficiency overall improves.
es: Renderizar objetos eficientemente en grandes cantidades es fácil, pero cuando se debe renderizar una escena grande, puede volverse ineficiente. Para resolver esto, se debe agregar el cálculo de visibilidad al renderizado, lo que hace que el renderizado sea menos eficiente, pero, al mismo tiempo, se renderizan menos objetos, por lo que la eficiencia en general mejora.
fr: Rendre efficacement des objets en grandes quantités est facile, mais lorsqu'une scène de grande taille doit être rendue, cela peut devenir inefficace. Pour résoudre ce problème, le calcul de visibilité doit être ajouté au rendu, ce qui rend le rendu moins efficace, mais, en même temps, moins d'objets sont rendus, ce qui améliore l'efficacité globale.
zh_cn: 高效地渲染对象很容易，但是当必须渲染大型场景时，它会变得效率低下。 要解决这个问题，必须将可见性计算添加到渲染中，这会使渲染效率降低，但同时渲染的对象也会减少，因此整体效率会提高。

source: Configuring the properties of every material for every object that needs to be rendered is also slow. To solve this, objects are sorted by material to reduce the costs, but at the same time sorting has a cost.
es: La configuración de las propiedades de cada material para cada objeto que necesita ser renderizado también es lenta. Para resolver esto, los objetos se clasifican por material para reducir los costes, pero al mismo tiempo la clasificación tiene un coste.
fr: La configuration des propriétés de chaque matériaux pour chaque objet qui doit être rendu est également lente. Pour résoudre ce problème, les objets sont triés par matériaux afin de réduire les coûts, mais le tri a également un coût.
zh_cn: 为每个需要渲染的对象配置每种材质的属性也很慢。 为了解决这个问题，对象按材质分类以降低成本，但同时排序会产生成本。

source: In 3D physics a similar situation happens. The best algorithms to handle large amounts of physics objects (such as SAP) are slow at insertion/removal of objects and ray-casting. Algorithms that allow faster insertion and removal, as well as ray-casting, will not be able to handle as many active objects.
fr: En physique 3D, une situation similaire se produit. Les meilleurs algorithmes pour manipuler de grandes quantités d'objets physiques (tels que SAP) sont lents à l'insertion/retrait d'objets et au ray-casting. Les algorithmes qui permettent une insertion, un retrait et un ray-casting plus rapides, ne seront pas en mesure de traiter autant d'objets actifs.
zh_cn: 在3D物理学中，会发生类似的情况。 处理大量物理对象(例如SAP)的最佳算法在插入/移除对象和光线投射时很慢。 允许更快插入和移除以及光线投射的算法将无法处理尽可能多的活动对象。

source: And there are many more examples of this! Game engines strive to be general purpose in nature, so balanced algorithms are always favored over algorithms that might be fast in some situations and slow in others.. or algorithms that are fast but make usability more difficult.
fr: Et il y a bien d'autres exemples ! Les moteurs de jeu s'efforcent d'être généraliste par nature, donc les algorithmes équilibrés sont toujours préférés aux algorithmes qui peuvent être rapides dans certaines situations et lents dans d'autres... ou aux algorithmes qui sont rapides mais rendent l'utilisation plus difficile.
zh_cn: 还有更多的示例！ 游戏引擎本质上是通用的，因此平衡算法总是比在某些情况下可能快速且在其他情况下速度慢的算法更受青睐。或者算法速度快但使可用性更难。

source: Godot is not an exception and, while it is designed to have backends swappable for different algorithms, the default ones (or more like, the only ones that are there for now) prioritize balance and flexibility over performance.
es: Godot no es una excepción y, aunque está diseñado para tener backends intercambiables para diferentes algoritmos, los predeterminados (o más bien, los únicos que están ahí por ahora) priorizan el equilibrio y la flexibilidad sobre el rendimiento.
fr: Godot n'est pas une exception et, bien qu'il soit conçu pour avoir des backends interchangeables pour différents algorithmes, ceux par défaut (ou plutôt les seuls qui sont là pour le moment) privilégient l'équilibre et la flexibilité par rapport à la performance.
zh_cn: Godot不是一个例外，虽然它被设计为可以为不同的算法交换后端，但默认的(或者更像是现在唯一的那些)优先考虑平衡和灵活性而不是性能。

source: With this clear, the aim of this tutorial is to explain how to get the maximum performance out of Godot.
es: Con esto claro, el objetivo de este tutorial es explicar cómo obtener el máximo rendimiento de Godot.
fr: Le but de ce tutoriel est d'expliquer comment tirer le maximum de performances de Godot.
zh_cn: 有了这个清楚，本教程的目的是解释如何从Godot中获得最大的性能。

source: Rendering
es: Renderización
fr: Rendu
zh_cn: 渲染

source: 3D rendering is one of the most difficult areas to get performance from, so this section will have a list of tips.
es: El renderizado 3D es una de las áreas más difíciles de obtener un buen rendimiento, por lo que esta sección tendrá una lista de consejos.
fr: Le rendu 3D est l'un des domaines les plus difficiles pour obtenir des performances, c'est pourquoi cette section contient une liste de conseils.
zh_cn: 3D渲染是获得性能最困难的领域之一，因此本节将提供一系列提示。

source: Reuse shaders and materials
es: Reutilizar shaders y materiales
fr: Réutilisation des shaders et des matériaux
zh_cn: 重复使用着色器和材质

source: The Godot renderer is a little different to what is out there. It's designed to minimize GPU state changes as much as possible. :ref:`class_SpatialMaterial` does a good job at reusing materials that need similar shaders but, if custom shaders are used, make sure to reuse them as much as possible. Godot's priorities will be like this:
es: El renderizador de Godot es un poco diferente a cualquier otro. Está diseñado para minimizar al máximo los cambios de estado de la GPU. :ref:`class_SpatialMaterial` hace un buen trabajo en la reutilización de materiales que necesitan shaders similares pero, si se utilizan shaders personalizados, asegúrate de reutilizarlos tanto como sea posible. Las prioridades de Godot serán así:
fr: Le moteur de rendu Godot est un peu différent de ce qu'y existe ailleurs. Il est conçu pour minimiser autant que possible les changements d'état du GPU. :ref:`class_SpatialMaterial' fait un bon travail pour réutiliser les matériaux qui nécessitent des shaders similaires mais, si des shaders personnalisés sont utilisés, assurez-vous de les réutiliser autant que possible. Les priorités de Godot seront comme cela :
zh_cn: Godot渲染器与那里的渲染器略有不同。 它旨在尽可能减少GPU状态的变化。 :ref:`class_SpatialMaterial` 在重用需要类似着色器的材质方面做得很好但是，如果使用自定义着色器，请确保尽可能多地重用它们。 Godot的优先事项如下:

source: **Reusing Materials**: The fewer different materials in the scene, the faster the rendering will be. If a scene has a huge amount of objects (in the hundreds or thousands) try reusing the materials or in the worst case use atlases.
es: **Reutilización de Materiales**: Cuantos menos materiales diferentes haya en la escena, más rápido será el renderizado. Si una escena tiene una gran cantidad de objetos (cientos o miles) intenta reutilizar los materiales o, en el peor de los casos, utiliza un atlas.
fr: **Réutilisation des matériaux** : Moins il y a de matériaux différents dans la scène, plus le rendu sera rapide. Si une scène a une quantité énorme d'objets (des centaines ou des milliers), essayez de réutiliser les matériaux ou dans le pire des cas, utilisez des atlas.
zh_cn: **重复使用材质**:场景中不同的材质越少，渲染速度就越快。 如果一个场景有大量的物体(数百或数千)，请尝试重复使用这些材质，或者在最坏的情况下使用地图集。

source: **Reusing Shaders**: If materials can't be reused, at least try to re-use shaders (or SpatialMaterials with different parameters but the same configuration).
fr: **Reusing Shaders** : Si les matériaux ne peuvent pas être réutilisés, essayez au moins de réutiliser les shaders (ou des SpatialMaterials avec des paramètres différents mais avec la même configuration).
zh_cn: **重用着色器**: 如果材质无法重复使用，至少尝试重新使用着色器(或具有不同参数但配置相同的SpatialMaterials)。

source: If a scene has, for example, 20.000 objects with 20.000 different materials each, rendering will be slow. If the same scene has 20.000 objects, but only uses 100 materials, rendering will be blazingly fast.
fr: Si une scène a, par exemple, 20.000 objets avec 20.000 matériaux différents chacun, le rendu sera lent. Si la même scène contient 20.000 objets, mais n'utilise que 100 matériaux, le rendu sera d'une rapidité fulgurante.
zh_cn: 例如，如果一个场景有20.000个对象，每个对象有20.000个不同的材质，那么渲染将会很慢。如果同一场景有20.000个对象，但只使用100个素材，渲染将非常迅速。

source: Pixel cost vs vertex cost
fr: Coût en pixel contre coût en sommet
zh_cn: 像素成本vs顶点成本

source: It is a common thought that the lower the number of polygons in a model, the faster it will be rendered. This is *really* relative and depends on many factors.
es: Es un pensamiento común que cuanto menor sea el número de polígonos en un modelo, más rápido se renderizará. Esto es *muy* relativo y depende de muchos factores.
fr: Il est communément admis que plus le nombre de polygones d'un modèle est faible, plus il sera rendu rapidement. Ceci est *vraiment* relatif et dépend de nombreux facteurs.
zh_cn: 人们普遍认为，模型中多边形的数量越少，渲染的速度就越快。这确实是相对的，取决于很多因素。

source: On a modern PC and console, vertex cost is low. GPUs originally only rendered triangles, so all the vertices:
es: En un PC y consola modernos, el costo de los vértices es bajo. Las GPUs originalmente sólo renderizaban triángulos, así como todos los vértices:
fr: Sur un PC et une console modernes, le coût du sommet est faible. A l'origine, les GPU ne rendaient que des triangles, donc tous les sommets :
zh_cn: 在现代PC和控制台上，顶点成本很低。 GPU最初只渲染三角形，所以所有顶点都是:

source: Had to be transformed by the CPU (including clipping).
es: Tuvo que ser transformado por la CPU (incluyendo el recorte).
fr: A dû être transformé par le CPU (y compris le clipping).
zh_cn: 不得不被CPU改造(包括剪裁)。

source: Had to be sent to the GPU memory from the main RAM.
es: Tuvo que enviarse a la memoria de la GPU desde la memoria RAM principal.
fr: Doit être envoyé à la mémoire du GPU depuis la RAM principale.
zh_cn: 不得不从主RAM发送到GPU内存。

source: Nowadays, all this is handled inside the GPU, so the performance is extremely high. 3D artists usually have the wrong feeling about polycount performance because 3D DCCs (such as Blender, Max, etc.) need to keep geometry in CPU memory in order for it to be edited, reducing actual performance. Truth is, a model rendered by a 3D engine is much more optimal than how 3D DCCs display them.
es: Hoy en día, todo esto se maneja dentro de la GPU, por lo que el rendimiento es extremadamente alto. Los artistas 3D suelen tener una idea equivocada sobre el rendimiento de los recuentos porque los DCC 3D (como Blender, Max, etc.) necesitan mantener la geometría en la memoria de la CPU para poder editarla, lo que reduce el rendimiento real. La verdad es que un modelo renderizado por un motor 3D es mucho más óptimo que la forma en que los DCCs 3D los muestran.
fr: De nos jours, tout cela est géré à l'intérieur du GPU, donc les performances sont extrêmement élevées. Les artistes 3D ont généralement le mauvais sentiment au sujet de la performance polycount parce que les DCC 3D (tels que Blender, Max, etc.) ont besoin de garder la géométrie dans la mémoire CPU pour qu'elle puisse être éditée, réduisant ainsi la performance réelle. La vérité est qu'un modèle rendu par un moteur 3D est beaucoup plus optimal que la façon dont les DCC 3D les affichent.
zh_cn: 如今，所有这些都是在GPU内部处理的，因此性能非常高。 3D艺术家通常对多计数性能有错误的感觉，因为3D DCC(例如Blender，Max等)需要将几何保留在CPU内存中以便进行编辑，从而降低实际性能。 事实上，3D引擎渲染的模型比3D DCC显示模型更加优化。

source: On mobile devices, the story is different. PC and Console GPUs are brute-force monsters that can pull as much electricity as they need from the power grid. Mobile GPUs are limited to a tiny battery, so they need to be a lot more power efficient.
es: En dispositivos móviles, la historia es diferente. Los GPU para computadoras y consolas son monstruos de fuerza bruta que pueden extraer tanta electricidad como necesitan de la red eléctrica. Las GPU móviles están limitadas a una batería pequeña, por lo que deben ser mucho más eficientes en términos de energía.
fr: Sur les appareils mobiles, l'histoire est différente. Les GPU PC et Console sont des monstres de force brute qui peuvent tirer autant d'électricité qu'ils en ont besoin du réseau électrique. Les GPU mobiles sont limités à une minuscule batterie, ils doivent donc être beaucoup plus économes en énergie.
zh_cn: 在移动设备上，故事是不同的。 PC和控制台GPU是蛮力的怪物，可以从电网中获取所需的电量。 移动GPU仅限于小型电池，因此它们需要更高的功率效率。

source: To be more efficient, mobile GPUs attempt to avoid *overdraw*. This means, the same pixel on the screen being rendered (as in, with lighting calculation, etc.) more than once. Imagine a town with several buildings, GPUs don't know what is visible and what is hidden until they draw it. A house might be drawn and then another house in front of it (rendering happened twice for the same pixel!). PC GPUs normally don't care much about this and just throw more pixel processors to the hardware to increase performance (but this also increases power consumption).
es: Para ser más eficientes, las GPU móviles intentan evitar el *sobregiro*. Esto significa que el mismo píxel en la pantalla se procesa (como en, con cálculo de iluminación, etc.) más de una vez. Imagine una ciudad con varios edificios, las GPU no saben qué es visible y qué está oculto hasta que lo dibujen. Se podría dibujar una casa y luego otra casa enfrente (¡la representación ocurrió dos veces para el mismo píxel!). A las GPU de PC normalmente no les importa mucho esto y solo lanzan más procesadores de píxeles al hardware para aumentar el rendimiento (pero esto también aumenta el consumo de energía).
fr: Pour être plus efficaces, les GPU mobiles tentent d'éviter les *overdraw*. Cela signifie que le même pixel à l'écran est rendu plus d'une fois (comme avec le calcul de l'éclairage, etc.). Imaginez une ville avec plusieurs bâtiments, les GPU ne savent pas ce qui est visible et ce qui est caché jusqu'à ce qu'ils le dessinent. Une maison peut être dessinée, puis une autre maison devant elle (le rendu a eu lieu deux fois pour le même pixel !). Les GPU PC ne s'en soucient normalement pas beaucoup et se contentent d'ajouter des processeurs de pixels au hardware pour augmenter les performances (mais cela augmente aussi la consommation d'énergie).
zh_cn: 为了提高效率，移动GPU试图避免 *透支* 。 这意味着，屏幕上的相同像素被渲染(如，通过照明计算等)不止一次。 想象一个有几座建筑的小镇，GPU不知道什么是可见的，什么是隐藏的，直到它们绘制它。 可能会绘制一个房子，然后在它前面的另一个房子(对于同一个像素渲染两次！)。 PC GPU通常不关心这一点，只是将更多像素处理器投入硬件以提高性能(但这也增加了功耗)。

source: On mobile, pulling more power is not an option, so a technique called "Tile Based Rendering" is used (almost every mobile hardware uses a variant of it), which divides the screen into a grid. Each cell keeps the list of triangles drawn to it and sorts them by depth to minimize *overdraw*. This technique improves performance and reduces power consumption, but takes a toll on vertex performance. As a result, fewer vertices and triangles can be processed for drawing.
fr: Sur mobile, tirer plus de puissance n'est pas une option, donc une technique appelée "Tile Based Rendering" est utilisée (presque chaque hardware mobile en utilise une variante), qui divise l'écran en grille. Chaque cellule conserve la liste des triangles qui y sont dessinés et les trie par profondeur pour minimiser l'*overdraw*. Cette technique améliore les performances et réduit la consommation d'énergie, mais a un impact sur les performances des sommets. Par conséquent, moins de sommets et de triangles peuvent être traités pour le dessin.
zh_cn: 在移动设备上，提供更多功率不是一种选择，因此使用了一种称为“基于平铺的渲染”的技术(几乎每个移动硬件都使用它的一种变体)，它将屏幕划分为网格。 每个单元格保留绘制到它的三角形列表，并按深度对它们进行排序，以最小化 *重绘* 。 这种技术可以提高性能并降低功耗，但会降低顶点性能。 因此，可以处理更少的顶点和三角形以进行绘制。

source: Generally, this is not so bad, but there is a corner case on mobile that must be avoided, which is to have small objects with a lot of geometry within a small portion of the screen. This forces mobile GPUs to put a lot of strain on a single screen cell, considerably decreasing performance (as all the other cells must wait for it to complete in order to display the frame).
es: Generalmente, esto no es tan malo, pero hay un caso en la esquina del móvil que debe evitarse, que es tener objetos pequeños con mucha geometría dentro de una pequeña porción de la pantalla. Esto obliga a las GPUs móviles a ejercer mucha presión sobre una única celda de la pantalla, lo que reduce considerablemente el rendimiento (ya que todas las demás celdas deben esperar a que se complete para mostrar el cuadro).
fr: Généralement, ce n'est pas si mal, mais il y a un cas important sur mobile qui doit être évité, qui est d'avoir de petits objets avec beaucoup de géométrie dans une petite partie de l'écran. Cela oblige les GPU mobiles à mettre beaucoup de pression sur une seule cellule de l'écran, ce qui diminue considérablement les performances (car toutes les autres cellules doivent attendre qu'elle soit terminée pour pouvoir afficher la trame).
zh_cn: 一般来说，这并不是那么糟糕，但在移动设备上有一个必须避免的角落情况，即在屏幕的一小部分内具有大量几何形状的小物体。 这迫使移动GPU在单个屏幕单元上施加了很大的压力，大大降低了性能(因为所有其他单元必须等待它完成才能显示帧)。

source: To make it short, do not worry about vertex count so much on mobile, but avoid concentration of vertices in small parts of the screen. If, for example, a character, NPC, vehicle, etc. is far away (so it looks tiny), use a smaller level of detail (LOD) model instead.
es: Para resumir, no te preocupes tanto por el número de vértices en los móviles, sino que evita la concentración de vértices en pequeñas partes de la pantalla. Si, por ejemplo, un personaje, NPC, vehículo, etc. está lejos (por lo que parece pequeño), utiliza en su lugar un modelo de nivel de detalle (LOD) más pequeño.
fr: Pour faire court, ne vous inquiétez pas trop des sommets sur mobile, mais évitez de concentrer les sommets sur de petites parties de l'écran. Si, par exemple, un personnage, un PNJ, un véhicule, etc. est éloigné (donc il semble minuscule), utilisez plutôt un modèle à plus petit niveau de détail (LOD).
zh_cn: 为了简化它，不要担心移动设备上的顶点数量如此之多，但要避免在屏幕的小部分中集中顶点。 例如，如果角色，NPC，车辆等距离较远(因此看起来很小)，请使用较小的细节(LOD)模型。

source: An extra situation where vertex cost must be considered is objects that have extra processing per vertex, such as:
es: Una situación adicional en la que se debe tener en cuenta el coste de los vértices son los objetos que tienen un procesamiento extra por vértice, como por ejemplo:
fr: Une situation supplémentaire où le coût du sommet doit être pris en compte est celle des objets qui ont un traitement supplémentaire par sommet, tels que :
zh_cn: 必须考虑顶点成本的额外情况是每个顶点具有额外处理的对象，例如:

source: Skinning (skeletal animation)
es: Skinning (animación esquelética)
fr: Skinning (animation squelettique)
zh_cn: 剥皮(骨骼动画)

source: Morphs (shape keys)
es: Morphs (claves de forma)
fr: Morphs (clés de forme)
zh_cn: 变形(形状键)

source: Vertex Lit Objects (common on mobile)
es: Objetos con vértices iluminados (común en móviles)
fr: Objets éclairés par les sommets (communs sur mobile)
zh_cn: 顶点对象(在移动设备上常见)

source: Texture compression
es: Compresión de texturas
fr: Compression de texture
zh_cn: 纹理压缩

source: Godot offers to compress textures of 3D models when imported (VRAM compression). Video RAM compression is not as efficient in size as PNG or JPG when stored, but increases performance enormously when drawing.
fr: Godot propose de compresser les textures des modèles 3D lors de l'importation (compression VRAM). La compression de la RAM vidéo n'est pas aussi efficace en taille que le PNG ou le JPG lorsqu'elle est stockée, mais augmente considérablement les performances lors du dessin.
zh_cn: Godot提供在导入时压缩3D模型的纹理(VRAM压缩)。 视频RAM压缩在存储时的大小不如PNG或JPG，但在绘制时极大地提高了性能。

source: This is because the main goal of texture compression is bandwidth reduction between memory and the GPU.
es: Esto se debe a que el objetivo principal de la compresión de texturas es la reducción del ancho de banda entre la memoria y la GPU.
fr: En effet, l'objectif principal de la compression de texture est la réduction de la bande passante entre la mémoire et le GPU.
zh_cn: 这是因为纹理压缩的主要目标是在内存和GPU之间减少带宽。

source: In 3D, the shapes of objects depend more on the geometry than the texture, so compression is generally not noticeable. In 2D, compression depends more on shapes inside the textures, so the artifacts resulting from 2D compression are more noticeable.
fr: En 3D, les formes des objets dépendent plus de la géométrie que de la texture, la compression n'est donc généralement pas perceptible. En 2D, la compression dépend davantage des formes à l'intérieur des textures, de sorte que les artefacts résultant de la compression 2D sont plus visibles.

source: As a warning, most Android devices do not support texture compression of textures with transparency (only opaque), so keep this in mind.
es: A modo de advertencia, la mayoría de los dispositivos Android no admiten la compresión de texturas con transparencia (sólo opacas), así que tenlo en cuenta.
fr: En guise d'avertissement, la plupart des appareils Android ne prennent pas en charge la compression de texture des textures avec transparence (seulement opaque), gardez ceci à l'esprit.
zh_cn: 作为警告，大多数Android设备不支持具有透明度的纹理的纹理压缩(仅不透明)，因此请记住这一点。

source: Transparent objects
es: Objetos transparentes
fr: Objets transparents
zh_cn: 透明物体

source: As mentioned before, Godot sorts objects by material and shader to improve performance. This, however, can not be done on transparent objects. Transparent objects are rendered from back to front to make blending with what is behind work. As a result, please try to keep transparent objects to a minimum! If an object has a small section with transparency, try to make that section a separate material.
es: Como se mencionó antes, Godot clasifica los objetos por material y shader para mejorar el rendimiento. Esto, sin embargo, no se puede hacer en objetos transparentes. Los objetos transparentes se renderizan de atrás hacia adelante para hacer que se mezclen con lo que hay detrás del trabajo. Por lo tanto ¡intenta reducir al mínimo la transparencia de los objetos! Si un objeto tiene una sección pequeña con transparencia, intenta hacer de esa sección un material independiente.
fr: Comme mentionné précédemment, Godot trie les objets par matériau et par shader pour améliorer les performances. Toutefois, cela ne peut pas être fait sur des objets transparents. Les objets transparents sont rendus de l'arrière vers l'avant pour se fondre avec ce qui se trouve derrière. Par conséquent, essayez de réduire au minimum les objets transparents ! Si un objet a une petite section avec transparence, essayez de faire de cette section un matériau séparé.
zh_cn: 如前所述，Godot通过材质和着色器对对象进行排序以提高性能。 但是，这不能在透明对象上完成。 透明对象从后向前呈现，以便与工作背后的内容进行混合。 因此，请尽量将透明物体保持在最低限度！ 如果对象具有透明度较小的部分，请尝试将该部分作为单独的材质。

source: Level of detail (LOD)
es: Nivel de detalle (LOD)
fr: Niveau de détail (LOD)
zh_cn: 细节程度(LOD)
