Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/3d_performance_and_limitations.po
Languages: es, fr, zh_cn

source: As also mentioned before, using objects with fewer vertices can improve performance in some cases. Godot has a simple system to change level of detail, :ref:`GeometryInstance <class_GeometryInstance>` based objects have a visibility range that can be defined. Having several GeometryInstance objects in different ranges works as LOD.
es: Como también se mencionó anteriormente, el uso de objetos con menos vértices puede mejorar el rendimiento en algunos casos. Godot tiene un sistema simple para cambiar el nivel de detalle, los objetos basados en :ref:`GeometryInstance <class_GeometryInstance>` tienen un rango de visibilidad que puede ser definido. Tener varios objetos GeometryInstance en diferentes rangos funciona como LOD.
fr: Comme mentionné précédemment, l'utilisation d'objets avec moins de sommets peut améliorer les performances dans certains cas. Godot a un système simple pour changer le niveau de détail, :ref:`GeometryInstance <class_GeometryInstance <class_GeometryInstance>` les objets basés ont une plage de visibilité qui peut être définie. Avoir plusieurs objets GeometryInstance dans différentes plages fonctionne comme LOD.
zh_cn: 如前所述，在某些情况下，使用具有较少顶点的对象可以提高性能。 Godot有一个简单的系统来改变细节层次 :ref:`GeometryInstance <class_GeometryInstance>` 基于对象的可见范围可以定义。 在不同范围内具有多个GeometryInstance对象可用作LOD。

source: Use instancing (MultiMesh)
es: Usar la instanciación (MultiMesh)
fr: Utiliser l'instanciation (MultiMesh)
zh_cn: 使用实例化(MultiMesh)

source: If several identical objects have to be drawn in the same place or nearby, try using :ref:`MultiMesh <class_MultiMesh>` instead. MultiMesh allows the drawing of dozens of thousands of objects at very little performance cost, making it ideal for flocks, grass, particles, etc.
es: Si hay que dibujar varios objetos iguales en el mismo lugar o cercanos entre sí, intenta usar :ref:`MultiMesh <class_MultiMesh>` en su lugar. MultiMesh permite dibujar decenas de miles de objetos con un coste de rendimiento muy bajo, lo que lo hace ideal para multitudes, hierba, partículas, etc.
fr: Si plusieurs objets identiques doivent être dessinés au même endroit ou à proximité, essayez d'utiliser :ref:`MultiMesh <class_MultiMesh>`. MultiMesh permet de dessiner des dizaines de milliers d'objets à très faible coût de performance, ce qui le rend idéal pour les troupeaux, l'herbe, les particules, etc.
zh_cn: 如果必须在同一个地方或附近绘制几个相同的对象，请尝试使用 :ref:`MultiMesh <class_MultiMesh>` 。 MultiMesh允许以极低的性能成本绘制数十万个物体，使其成为鸡群，草，颗粒等的理想选择。

source: Bake lighting
es: Bake de iluminación
fr: Préparation de l’éclairage
zh_cn: 烘焙照明

source: Small lights are usually not a performance issue. Shadows a little more. In general, if several lights need to affect a scene, it's ideal to bake it (:ref:`doc_baked_lightmaps`). Baking can also improve the scene quality by adding indirect light bounces.
es: Las luces pequeñas no suelen ser un problema de rendimiento. Las sombras un poco más. En general, si varias luces necesitan afectar una escena, lo ideal es hacer un bake (:ref:`doc_baked_lightmaps`). El baking también puede mejorar la calidad de la escena añadiendo rebotes de luz indirectos.
fr: Les petites lumières ne sont généralement pas un problème de performance. Les ombres un peu plus. En général, si plusieurs lumières doivent affecter une scène, il est idéal de les préparer (:ref:`doc_baked_lightmaps`). La préparation peut également améliorer la qualité de la scène en ajoutant des rebonds de lumière indirecte.
zh_cn: 小灯通常不是性能问题。 阴影多一点。 一般来说，如果几个灯需要影响一个场景，理想的是烘焙它( :ref:`doc_baked_lightmaps` )。 烘焙还可以通过添加间接光反弹来改善场景质量。

source: If working on mobile, baking to texture is recommended, since this method is even faster.
es: Si se trabaja en móvil, se recomienda trabajar con texturas, ya que este método es más rápido.
fr: Si vous travaillez sur mobile, il est recommandé de préparer la texture, car cette méthode est encore plus rapide.
zh_cn: 如果在移动设备上工作，建议烘焙到纹理，因为这种方法更快。

source: Introduction
es: Introducción
zh_cn: 简介
