Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/baked_lightmaps.po
Languages: es, fr, ja, zh_cn

source: Since high-quality bakes can take very long (up to several hours for large complex scenes), it is recommended to use lower quality settings at first. Then, once you are confident with your scene's lighting setup, raise the quality settings and perform a "final" bake before exporting your project.
fr: Étant donné que les préparations de haute qualité peuvent prendre beaucoup de temps (jusqu'à plusieurs heures pour les grandes scènes complexes), il est recommandé d'utiliser des paramètres de qualité inférieure dans un premier temps. Ensuite, lorsque vous êtes sûr de la configuration de l'éclairage de votre scène, augmentez les paramètres de qualité et effectuez un bake "final" avant d'exporter votre projet.

source: Configuring bake
es: Configurando el bake
fr: Configurer les pré-calculs
ja: 焼き込みの設定
zh_cn: 配置烘焙

source: Several more options are present for baking:
es: Hay varias opciones más para hornear:
fr: Différentes options sont disponibles pour le pré-calcul :
ja: ベイク処理にはさらにいくつかのオプションがあります:
zh_cn: 烘焙还有几种选择:

source: **Bake Extents**: The size of the area affected. This can be edited in the 3D editor viewport using the handles. Any object that can have lightmaps baked and is *touching* the bake extents will have lightmaps baked for it, but dynamic object capture will only work within the extents.
fr: **Bake Extents** : La taille de la zone affectée. Elle peut être modifiée dans la fenêtre de l'éditeur 3D à l'aide des poignées. Tout objet qui peut avoir des lightmaps préparées et qui *touche* les extensions de préparation aura des lightmaps préparées pour lui, mais la capture d'objet dynamique ne fonctionnera que dans les extensions.

source: Tweaks
fr: Ajustements

source: **Quality:** Three bake quality modes are provided: Low, Medium, High, and Ultra. Higher quality takes more time, but result in a better-looking lightmap with less noise. The difference is especially noticeable with emissive materials or areas that get little to no direct lighting.
fr: **Quality : ** Trois modes de qualité de préparation sont proposés : Low, Medium, High et Ultra. Une qualité supérieure prend plus de temps, mais permet d'obtenir une lightmap de meilleure qualité avec moins de bruit. La différence est particulièrement sensible avec les matériaux émissifs ou les zones qui reçoivent peu ou pas d'éclairage direct.

source: **Bounces:** The number of bounces to use for indirect lighting. The default value (3) is a good compromise between bake times and quality. Higher values will make light bounce around more times before it stops, which makes indirect lighting look smoother (but also brighter). During the initial lighting iteration work, it is recommended to decrease the number of bounces to 1 to speed up baking. Remember that your scene will be darker when decreasing the number of bounces.
fr: **Bounces :** Le nombre de rebonds à utiliser pour l'éclairage indirect. La valeur par défaut (3) est un bon compromis entre le temps de préparation et la qualité. Des valeurs plus élevées feront rebondir la lumière plus de fois avant qu'elle ne s'arrête, ce qui rend l'éclairage indirect plus lisse (mais aussi plus lumineux). Pendant le travail initial d'itération de l'éclairage, il est recommandé de réduire le nombre de rebonds à 1 pour accélérer la préparation. N'oubliez pas que votre scène sera plus sombre lorsque vous diminuerez le nombre de rebonds.

source: **Use Denoiser:** If enabled, uses OpenImageDenoise to make the lightmap significantly less noisy. This increases bake times and can occasionally introduce artifacts, but the result is often worth it.
fr: **Use Denoiser :** Si cette option est activée, utilise OpenImageDenoise pour rendre la lightmap nettement moins parasitée. Cela augmente les temps de préparation et peut occasionnellement introduire des artefacts, mais le résultat en vaut souvent la peine.

source: **Use Hdr:** If disabled, lightmaps are smaller on disk, but they won't be able to capture any light over white (1.0). This will result in visible clipping if you have bright lights in your scene. When HDR is disabled, banding may also be visible in the lightmap.
fr: **Use Hdr :** Si elle est désactivée, les lightmaps sont plus petites sur le disque, mais elles ne pourront pas capturer de lumière supérieure au blanc (1.0). Cela se traduira par un écrêtage visible si vous avez des lumières vives dans votre scène. Lorsque le HDR est désactivé, des bandes peuvent également être visibles dans la lightmap.

source: **Use Color:** If disabled, lightmaps are smaller on disk, but the lightmap won't be able to store colored lighting. When baking indirect light only, the difference may be barely visible since indirect light is generally not highly saturated. However, when baking both direct and indirect lighting using the **All** bake mode on a light, this will turn colored lighting into grayscale lighting. This can be disabled together with HDR to get the smallest possible lightmap file at a given resolution.
fr: **Use Color :** Si elle est désactivée, les lightmaps sont plus petites sur le disque, mais la lightmap ne sera pas en mesure de stocker un éclairage coloré. Lors de la préparation de la lumière indirecte uniquement, la différence peut être à peine visible car la lumière indirecte n'est généralement pas très saturée. Cependant, lorsque vous préparez à la fois l'éclairage direct et indirect en utilisant le mode de préparation **All** sur une lumière, cela transformera l'éclairage coloré en éclairage en niveaux de gris. Ce mode peut être désactivé en même temps que le HDR pour obtenir le plus petit fichier de carte de lumière possible à une résolution donnée.

source: **Bias:** The offset value to use for shadows in 3D units. You generally don't need to change this value, except if you run into issues with light bleeding or dark spots in your lightmap after baking. This setting does not affect real-time shadows casted on baked surfaces.
fr: **Bias :** La valeur de décalage à utiliser pour les ombres en unités 3D. En général, il n'est pas nécessaire de modifier cette valeur, sauf si vous rencontrez des problèmes de saignement de lumière ou de taches sombres dans votre carte de lumière après la préparation. Ce paramètre n'affecte pas les ombres en temps réel projetées sur les surfaces préparées.

source: **Default Texels Per Unit:** For meshes that do not specify their own lightmap texel density, this will be used as the value. Higher values result in *lower-resolution* lightmaps, which result in faster bake times and lower file sizes at the cost of blurrier indirect lighting and shadows.
fr: **Default Texels Per Unit :** Pour les maillages qui ne spécifient pas leur propre densité de texels de lightmap, cette valeur sera utilisée. Des valeurs plus élevées se traduisent par des lightmaps de *faible résolution*, ce qui permet d'accélérer les temps de préparation et de réduire la taille des fichiers, au prix d'un éclairage indirect et d'ombres plus flous.

source: **Generate:** If enabled, a texture atlas will be generated for the lightmap. This results in more efficient rendering, but is only compatible with the GLES3 rendering backend. Disable this setting if your project is allowed to fall back to GLES2. (This is not the case by default and must be enabled in the Project Settings.) *This setting is ignored when the project is configured to use GLES2 by default.*
fr: **Generate :** Si cette option est activée, un atlas de textures sera généré pour la lightmap. Cela permet un rendu plus efficace, mais n'est compatible qu'avec le backend de rendu GLES3. Désactivez ce paramètre si votre projet est autorisé à revenir à GLES2. (Ce n'est pas le cas par défaut et doit être activé dans les paramètres du projet). *Ce paramètre est ignoré lorsque le projet est configuré pour utiliser GLES2 par défaut.*

source: **Max Size:** The maximum size of the atlas in pixels. Higher values result in a more efficient atlas, but are less compatible with old/low-end hardware. If in doubt, leave this setting on its default value (4096).
fr: **Max Size :** La taille maximale de l'atlas en pixels. Des valeurs plus élevées donnent un atlas plus efficace, mais sont moins compatibles avec le matériel ancien/bas de gamme. En cas de doute, laissez ce paramètre sur sa valeur par défaut (4096).

source: Capture
fr: Capturer

source: **Enabled:** This enables probe capture so that dynamic objects can *receive* indirect lighting. Regardless of this setting's value, dynamic objects will not be able to *contribute* indirect lighting to the scene. This is a limitation of lightmaps.
fr: **Enabled :** Ce paramètre active la capture de sonde afin que les objets dynamiques puissent *recevoir* un éclairage indirect. Quelle que soit la valeur de ce paramètre, les objets dynamiques ne seront pas en mesure de *contribuer* un éclairage indirect à la scène. Il s'agit d'une limitation des lightmaps.

source: **Cell Size:** The distance between lightmap probes in 3D units. Higher values result in more sparse probe placement, which decreases bake times and file size at the cost of lower lighting accuracy for dynamic objects.
fr: **Cell Size :** La distance entre les sondes de la carte de lumière en unités 3D. Des valeurs plus élevées entraînent un placement plus clairsemé des sondes, ce qui réduit les temps de préparation et la taille des fichiers au prix d'une précision d'éclairage moindre pour les objets dynamiques.

source: **Quality:** The lightmap probe generation quality. Higher values result in more accurate lighting, but take longer to bake. This setting does not affect the *density* of the lightmap probes, only their quality.
fr: **Quality :** La qualité de génération de la sonde lightmap. Des valeurs plus élevées donnent un éclairage plus précis, mais prennent plus de temps à préparer. Ce paramètre n'affecte pas la *densité* des sondes lightmap, mais uniquement leur qualité.

source: **Propagation:** Similar to :ref:`GIProbe <doc_gi_probes>`'s Propagation property. Higher values result in brighter and more diffuse indirect lighting for dynamic objects. Adjust this value depending on your scene to make dynamic objects better fit with static baked lighting.
fr: **Propagation :** Similaire à la propriété Propagation de :ref:`GIProbe <doc_gi_probes>`. Des valeurs plus élevées donnent un éclairage indirect plus lumineux et plus diffus pour les objets dynamiques. Ajustez cette valeur en fonction de votre scène pour que les objets dynamiques correspondent mieux à l'éclairage statique préparé.

source: Data
fr: Données

source: **Light Data**: Contains the light baked data after baking. Textures are saved to disk, but this also contains the capture data for dynamic objects, which can be heavy. If you are using a scene in ``.tscn`` format, you should save this resource to an external binary ``.lmbake`` file to avoid bloating the ``.tscn`` scene with binary data encoded in Base64.
fr: **Light Data** : Contient les données de pré-calcul de lumière après le pré-calcul. Les textures sont sauvegardées sur le disque, mais il contient aussi les données de capture pour les objets dynamiques, qui peuvent être lourdes. Si vous utilisez une scène au format ``.tscn``, vous devriez sauvegarder cette ressource dans un fichier binaire externe ``.lmbake`` pour éviter de gonfler la scène ``.tscn`` avec des données binaires encodées en Base64.

source: The Light Data resource can be edited to adjust two additional properties:
fr: La ressource Light Data peut être modifiée pour ajuster deux propriétés supplémentaires :

source: **Energy:** Adjusts the lightmap's brightness. Higher values result in brighter lightmaps. This can be adjusted at run-time for short-lived dynamic effects such as thunderstorms. However, keep in mind that it will affect *all* baked lights.
fr: **Energy :** Règle la luminosité de la lightmap. Des valeurs plus élevées donnent des lightmaps plus lumineuses. Cette valeur peut être ajustée au moment de l'exécution pour des effets dynamiques de courte durée comme les orages. Cependant, gardez à l'esprit que cela affectera *toutes* les lumières préparées.

source: **Interior:** If enabled, dynamic objects will not make use of environment lighting and will use light probes for ambient lighting exclusively. If disabled, both environment lighting and light probes are used to light up dynamic objects.
fr: **Interior :** Si cette option est activée, les objets dynamiques n'utilisent pas l'éclairage d'environnement et se servent exclusivement des sondes lumineuses pour l'éclairage ambiant. S'il est désactivé, l'éclairage d'environnement et les sondes lumineuses sont tous deux utilisés pour éclairer les objets dynamiques.

source: The generated EXR file can be viewed and even edited using an image editor to perform post-processing if needed. However, keep in mind that changes to the EXR file will be lost when baking lightmaps again.
fr: Le fichier EXR généré peut être visualisé et même modifié à l'aide d'un éditeur d'images pour effectuer un post-traitement si nécessaire. Cependant, gardez à l'esprit que les modifications apportées au fichier EXR seront perdues lors d'une nouvelle préparation de lightmaps.

source: Dynamic objects
es: Objetos dinámicos
fr: Objets dynamiques
ja: 動的オブジェクト
zh_cn: 动态对象

source: In other engines or lightmapper implementations, you are generally required to manually place small objects called "lightprobes" all around the level to generate *capture* data. This is then used to transfer the light to dynamic objects that move around the scene.
fr: Dans d'autres moteurs ou implémentations de lightmapper, vous devez généralement placer manuellement de petits objets appelés "lightprobes" tout autour du niveau pour générer des données de *capture*. Ces données sont ensuite utilisées pour transférer la lumière aux objets dynamiques qui se déplacent dans la scène.

source: However, this implementation of lightmapping uses a different method. The process is automatic, so you don't have to do anything. Just move your objects around, and they will be lit accordingly. Of course, you have to make sure you set up your scene bounds accordingly or it won't work.
es: Sin embargo, esta aplicación de la mapeo de luz utiliza un método diferente. El proceso es automático, así que no tienes que hacer nada. Sólo mueve tus objetos alrededor, y se iluminarán en consecuencia. Por supuesto, tienes que asegurarte de establecer los límites de la escena en consecuencia o no funcionará.
fr: Cependant, cette implementation de la cartographie de la lumière utilise une méthode différente. Le processus est automatique, vous n'avez donc rien à faire. Il suffit de déplacer vos objets, et ils seront éclairés en conséquence. Bien sûr, vous devez vous assurer que vous configurez vos limites de scène en conséquence ou cela ne fonctionnera pas.
ja: ただし、このライトマッピングの実装では別の方法が使用されます。プロセスは自動であるため、何もする必要はありません。オブジェクトを動かすだけで、それに応じて点灯します。もちろん、それに応じてシーンの境界を設定する必要があります。そうしないと機能しません。
zh_cn: 但是，这种光照贴图的实现使用了不同的方法。 这个过程是自动的，所以您不必做任何事情。 只需移动物体，它们就会相应点亮。 当然，您必须确保相应地设置场景边界，否则它将无法工作。

source: Baked lightmaps
ja: ベイクドライトマップ(焼き込み済ライトマップ)
zh_cn: 烘焙光照贴图

source: Introduction
es: Introducción
ja: はじめに
zh_cn: 简介

source: Baked lightmaps are an alternative workflow for adding indirect (or baked) lighting to a scene. Unlike the :ref:`doc_gi_probes` approach, baked lightmaps work fine on low-end PCs and mobile devices, as they consume almost no resources at run-time.
es: Los mapas de luz baked son un flujo de trabajo alternativo para añadir iluminación indirecta (o baked) a una escena. A diferencia del enfoque :ref:`doc_gi_probes`, los mapas de luz baked funcionan bien en PCs y dispositivos móviles de gama baja, ya que casi no consumen recursos en tiempo de ejecución.
ja: 焼き込み済のライトマップは、間接(または焼き込み済)ライティングをシーンに追加するための代替ワークフローです。 :ref:`doc_gi_probes` のアプローチとは異なり、焼き付けられたライトマップは実行時にほとんどリソースを消費しないため、ローエンドのPCやモバイルデバイスで正常に機能します。

source: Unlike ``GIProbe``\ s, Baked Lightmaps are completely static. Once baked, they can't be modified at all. They also don't provide the scene with reflections, so using :ref:`doc_reflection_probes` together with it on interiors (or using a Sky on exteriors) is a requirement to get good quality.
es: A diferencia de los "Giprobe", los Baked Lightmaps son completamente estáticos. Una vez horneados, no pueden ser modificados en absoluto. Tampoco proporcionan reflejos a la escena, así que usar :ref:`doc_reflection_probes` junto con ella en interiores (o usar un cielo en exteriores) es un requisito para obtener buena calidad.
ja: ``GIProbe`` とは異なり、ベイクドライトマップは完全に静的です。焼き込んだ後は、まったく変更できません。また、シーンに反射を提供しません。そのため、インテリアで :ref:`doc_reflection_probes` を使用する(またはエクステリアでSkyを使用する)ことが、高品質を得るための要件です。

source: As they are baked, they have fewer problems than ``GIProbe`` regarding light bleeding, and indirect light can look better if using Raytrace mode on high quality setting (but baking can take a while).
es: Al ser horneados, tienen menos problemas que "GIProbe" en cuanto al desteñido ligero, y la luz indirecta puede verse mejor si se usa el modo Raytrace en la configuración de alta calidad (pero hornear puede llevar un tiempo).
ja: 焼き込むと、\ ``GIProbe`` よりもライトブリーディング(光線漏れ)に関する問題が少なく、高品質の設定でレイトレースモードを使用すると間接光の見栄えが良くなります(ただし、焼き込み処理には時間がかかる場合があります)。

source: In the end, deciding which indirect lighting approach is better depends on your use case. In general, GIProbe looks better and is much easier to set up. For mobile or low-end compatibility, though, Baked Lightmaps are your only choice.
es: Al final, decidir qué enfoque de iluminación indirecta es mejor depende de su caso de uso. En general, el GIProbe se ve mejor y es mucho más fácil de instalar. Sin embargo, para la compatibilidad móvil o de gama baja, los Baked Lightmaps son su única opción.
ja: 最終的に、どの間接照明アプローチがより良いかは、ユースケースに依存します。一般に、GIProbeは見栄えが良く、セットアップがはるかに簡単です。ただし、モバイルまたはローエンドの互換性を確保するには、ベイクドライトマップが唯一の選択肢です。

source: Here are some comparisons of how Baked Lightmaps vs. GIProbe look. Notice that lightmaps are more accurate, but also suffer from the fact that lighting is on an unwrapped texture, so transitions and resolution may not be that good. GIProbe looks less accurate (as it's an approximation), but smoother overall.
es: Aquí hay algunas comparaciones de cómo se ven los Baked Lightmaps vs. el GIProbe. Noten que los mapas de luz son más precisos, pero también sufren del hecho de que la iluminación está en una textura desenvuelta, así que las transiciones y la resolución pueden no ser tan buenas. El GIProbe parece menos preciso (ya que es una aproximación), pero más suave en general.
ja: ベイクドライトマップとGIProbeの見た目の比較を次に示します。ライトマップはより正確ですが、照明がラップされていないテクスチャ上にあるという事実に苦しむことに注意してください。そのため、トランジションと解像度はそれほど良くないかもしれません。 GIProbeは(近似なので)あまり正確ではありませんが、全体的に滑らかに見えます。

source: One option is to do it from your favorite 3D app. This approach is generally not recommended, but it's explained first so that you know it exists. The main advantage is that, on complex objects that you may want to re-import a lot, the texture generation process can be quite costly within Godot, so having it unwrapped before import can be faster.
es: Una opción es hacerlo desde tu aplicación 3D favorita. Este enfoque no es generalmente recomendado, pero se explica primero para que sepas que existe. La principal ventaja es que, en los objetos complejos que se quieran reimportar mucho, el proceso de generación de la textura puede ser bastante costoso dentro de Godot, por lo que tenerlo desenvuelto antes de la importación puede ser más rápido.
ja: 1つの選択肢は、お気に入りの3Dアプリから実行することです。通常、このアプローチは推奨されませんが、その手段が存在することを知ってもらうために最初に説明します。主な利点は、多くの再インポートが必要な複雑なオブジェクトでは、テクスチャ生成プロセスがGodot内で非常にコストがかかる可能性があるため、インポート前に展開(アンラップ)すると処理が速くなるということです。
zh_cn: 一种选择是从您最喜欢的3D应用程序中进行。 通常不推荐这种方法，但首先要解释它，以便您知道它存在。 主要的优点是，在您可能想要重新导入很多的复杂对象上，纹理生成过程在Godot中可能非常昂贵，因此在导入之前将其解包可以更快。

source: And import normally. Remember you will need to set the texture size on the mesh after import.
es: Y se importan normalmente. Recuerda que tendrás que establecer el tamaño de la textura en la malla después de la importación.
ja: そして、普通にインポートします。インポート後にメッシュのテクスチャサイズを設定する必要があることに注意してください。
zh_cn: 并正常导入。 请记住，导入后需要在网格上设置纹理大小。

source: This is probably the best approach overall. The only downside is that, on large models, unwrapping can take a while on import. Just select the imported scene in the filesystem dock, then go to the Import tab. There, the following option can be modified:
es: Este es probablemente el mejor enfoque en general. La única desventaja es que, en los modelos grandes, el proceso de unwrapping puede llevar un tiempo considerable en la importación. Simplemente selecciona la escena importada en el panel de Sistema de Archivos, luego ve al panel Importar. Allí se puede modificar la siguiente opción:
ja: これはおそらく全体的に最善のアプローチです。唯一の欠点は、大きなモデルでは、インポート時に展開に時間がかかることがあるということです。ファイルシステムドックでインポートされたシーンを選択し、[インポート]タブに移動します。そこで、次のオプションを変更できます:

source: The **Light Baking** mode needs to be set to **"Gen Lightmaps"**. A texel size in world units must also be provided, as this will determine the final size of the lightmap texture (and, in consequence, the UV padding in the map).
es: El modo **Light Baking** debe ser ajustado a **"Gen Lightmaps "**. También se debe proporcionar un tamaño de texto en unidades mundiales, ya que esto determinará el tamaño final de la textura del mapa de luz (y, en consecuencia, el relleno de UV en el mapa).
ja: **Light Baking** モードは **"Gen Lightmaps"** に設定する必要があります。ワールド単位のテクセルサイズ(Texel Size)も指定する必要があります。これにより、ライトマップテクスチャの最終サイズ(および、結果として、マップのUVパディング)が決定されます。
zh_cn: ** Light Baking **模式需要设置为**``Gen Lightmaps``**。 还必须提供世界单位的纹素大小，因为这将确定光照贴图纹理的最终大小(并因此确定地图中的UV填充)。

source: As a word of warning: When reusing a mesh within a scene, keep in mind that UVs will be generated for the first instance found. If the mesh is re-used with different scales (and the scales are wildly different, more than half or twice), this will result in inefficient lightmaps. Just don't reuse a source mesh at different scales if you are planning to use lightmapping.
es: Como advertencia: Al reutilizar una malla dentro de una escena, toma en cuenta que se generarán UVs para la primera instancia encontrada. Si la malla se reutiliza con diferentes escalas (y las escalas son muy diferentes, más de la mitad o dos veces), esto resultará en mapas de luz ineficientes. Simplemente no reutilices una malla de origen a diferentes escalas si estás planeando usar lightmapping.
ja: 注意点: シーン内でメッシュを再利用する場合、最初に見つかったインスタンスに対してUVが生成されることに注意してください。メッシュがさまざまな縮尺で再利用される場合(および縮尺が大きく異なる場合、半分以下または二倍以上)、これは非効率的なライトマップになります。ライトマッピングの使用を計画している場合は、異なるスケールでソースメッシュを再利用しないでください。
zh_cn: 作为警告:当重用场景中的网格时，请记住将为找到的第一个实例生成UV。 如果网格重复使用不同的比例(并且比例大不相同，超过一半或两次)，这将导致低效的光照贴图。 如果您计划使用光照贴图，请不要在不同比例下重复使用源网格。

source: Before anything is done, a **BakedLightmap** Node needs to be added to a scene. This will enable light baking on all nodes (and sub-nodes) in that scene, even on instanced scenes.
es: Antes de que se haga algo, un nodo de **BakedLightmap** debe ser añadido a una escena. Esto permitirá que la luz se hornee en todos los nodos (y subnodos) de esa escena, incluso en las escenas instantes.
ja: 何かを行う前に、\ **BakedLightmap** ノードをシーンに追加する必要があります。これにより、インスタンス化されたシーンであっても、そのシーンのすべてのノード(およびサブノード)でライトのベイク処理が有効になります。

source: For a **MeshInstance** node to take part in the baking process, it needs to have the "Use in Baked Light" property enabled.
es: Para que un nodo de **MeshInstance** participe en el proceso de baking, debe tener activada la propiedad "Use in Baked Light".
ja: **MeshInstance** ノードがベイク処理に参加するには、"Use in Baked Light"プロパティを有効にする必要があります。
zh_cn: 要使** MeshInstance **节点参与烘焙过程，需要启用``在烘焙灯中使用``属性。
