Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/baked_lightmaps.po
Languages: es, fr, ja, zh_cn

source: Baked lightmaps are an alternative workflow for adding indirect (or fully baked) lighting to a scene. Unlike the :ref:`doc_gi_probes` approach, baked lightmaps work fine on low-end PCs and mobile devices, as they consume almost no resources at run-time. Also unlike GIProbe, baked lightmaps can optionally be used to store direct lighting, which provides even further performance gains.
fr: Les Baked lightmaps sont un flux de travail alternatif pour ajouter un éclairage indirect (ou préparé) à une scène. Contrairement à l'approche :ref:`doc_gi_probes`, les Baked lightmaps fonctionnent très bien sur les PC et les appareils mobiles bas de gamme, car elles ne consomment pratiquement pas de ressources en temps réel. De plus, contrairement à GIProbe, les baked lightmaps peuvent être utilisées pour stocker l'éclairage direct, ce qui permet de gagner encore en performance.

source: Unlike GIProbes, Baked Lightmaps are completely static. Once baked, they can't be modified at all. They also don't provide the scene with reflections, so using :ref:`doc_reflection_probes` together with it on interiors (or using a Sky on exteriors) is a requirement to get good quality.
fr: Contrairement aux GIProbes, les Baked lightmaps sont complètement statiques. Une fois préparées, elles ne peuvent pas être modifiées du tout. Elles ne fournissent pas non plus de reflets à la scène, donc l'utilisation de :ref:`doc_reflection_probes` avec elle à l'intérieur (ou l'utilisation d'un Sky à l'extérieur) est une condition pour obtenir une bonne qualité.

source: As they are baked, they have fewer problems than ``GIProbe`` regarding light bleeding, and indirect light will often look better. The downside is that baking lightmaps takes much longer than baking a GIProbe. While baking a GIProbe can be done in a matter of seconds, baking lightmaps will take several minutes if not more. This can slow down iteration speed significantly, so it is recommended to bake lightmaps only when you actually need to see changes in lighting.
fr: Comme elles sont préparées, elles ont moins de problèmes que ``GIProbe`` en ce qui concerne le saignement de lumière, et la lumière indirecte aura souvent un meilleur aspect. L'inconvénient est que la préparation des lightmaps prend beaucoup plus de temps que la préparation d'une GIProbe. Alors que la préparation d'une GIProbe peut être faite en quelques secondes, la préparation des lightmaps prendra plusieurs minutes, voire plus. Cela peut ralentir considérablement la vitesse d'itération, il est donc recommandé de ne préparer les lightmaps que lorsque vous avez réellement besoin de voir les changements d'éclairage.

source: Baking lightmaps will also reserve baked materials' UV2 slot, which means you can no longer use it for other purposes in materials (either in the built-in :ref:`doc_spatial_material` or in custom shaders).
fr: La préparation des lightmaps réservera également le slot UV2 des matériaux préparés, ce qui signifie que vous ne pourrez plus l'utiliser à d'autres fins dans les matériaux (que ce soit dans le :ref:`doc_spatial_material` intégré ou dans les shaders personnalisés).

source: In the end, deciding which indirect lighting approach is better depends on your use case. In general, GIProbe is easier to set up and works better with dynamic objects. For mobile or low-end compatibility, though, baked lightmaps are your only choice.
fr: En fin de compte, le choix de l'approche d'éclairage indirect qui convient le mieux dépend de votre cas d'utilisation. En général, GIProbe est plus facile à configurer et fonctionne mieux avec les objets dynamiques. Pour une compatibilité mobile ou bas de gamme, cependant, les baked lightmaps sont votre seul choix.

source: Visual comparison
es: Comparaciones visuales
fr: Comparaison visuelle
ja: 視覚的比較
zh_cn: 视觉比较

source: Here are some comparisons of how BakedLightmap vs. GIProbe look. Notice that lightmaps are more accurate, but also suffer from the fact that lighting is on an unwrapped texture, so transitions and resolution may not be that good. GIProbe looks less accurate (as it's an approximation), but smoother overall.
fr: Voici quelques comparaisons entre Baked Lightmaps et GIProbe. Notez que les lightmaps sont plus précises, mais souffrent aussi du fait que l'éclairage est sur une unwrapped texture, donc les transitions et la résolution peuvent ne pas être aussi bonnes. GIProbe semble moins précis (car c'est une approximation), mais globalement plus lisse.

source: Setting up
es: Configurando
fr: Mise en place
ja: セットアップ
zh_cn: 设置

source: First of all, before the lightmapper can do anything, the objects to be baked need an UV2 layer and a texture size. An UV2 layer is a set of secondary texture coordinates that ensures any face in the object has its own place in the UV map. Faces must not share pixels in the texture.
es: En primer lugar, antes de que el mapeador de luz pueda hacer algo, los objetos a hornear necesitan una capa de UV2 y un tamaño de textura. Una capa UV2 es un conjunto de coordenadas secundarias de textura que asegura que cualquier cara del objeto tiene su propio lugar en el mapa UV. Las caras no deben compartir píxeles en la textura.
fr: Tout d’abord, pour que le Lightmapper puisse faire quoi que ce soit, les objets à préparer ont besoin d’un calque UV2 et d’une taille de texture. Une couche UV2 est un ensemble de coordonnées de texture secondaires garantissant que chaque face de l'objet a sa propre place dans la carte UV. Les faces ne doivent pas partager de pixels dans la texture.
ja: まず、ライトマッパーが何かを行う前に、ベイク処理するオブジェクトにUV2レイヤーとテクスチャサイズが必要です。 UV2レイヤーは、オブジェクト内のすべての面がUVマップ内で独自の場所を持つことを保証する2次テクスチャ座標のセットです。面はテクスチャ内のピクセルを共有してはいけません。
zh_cn: 首先，在光照贴图可以执行任何操作之前，要烘焙的对象需要UV2图层和纹理大小。 UV2图层是一组辅助纹理坐标，可确保对象中的任何面在UV贴图中都有自己的位置。 面不得共享纹理中的像素。

source: There are a few ways to ensure your object has a unique UV2 layer and texture size:
es: Hay algunas maneras de asegurar que tu objeto tiene una capa de UV2 y un tamaño de textura únicos:
fr: Il y a plusieurs façons de s'assurer qu'un objet dispose d'un calque UV2 et une taille de texture unique :
ja: オブジェクトに一意のUV2レイヤーとテクスチャサイズを持たせるには、いくつかの方法があります:

source: Unwrap on scene import
es: Unwrap al importar escena
fr: Dépliage d'une scène importée
ja: シーンのインポート時に展開
zh_cn: 解开场景导入

source: This is probably the best approach overall. The only downside is that, on large models, unwrapping can take a while on import. Nonetheless, Godot will cache the UV2 across reimports, so it will only be regenerated when needed.
fr: C'est probablement la meilleure approche dans l'ensemble. Le seul inconvénient est que, sur les grands modèles, le dépliage(unwrapping) peut prendre un certain temps à l'importation. Néanmoins, Godot mettra en cache l'UV2 à travers les réimportations, de sorte qu'il ne sera régénéré que lorsque cela sera nécessaire.

source: Select the imported scene in the filesystem dock, then go to the **Import** dock. There, the following option can be modified:
fr: Sélectionnez la scène importée dans le dock filesystem, puis allez dans le dock **Import**. Là, l'option suivante peut être modifiée :

source: The **Light Baking** mode needs to be set to **Gen Lightmaps**. A texel size in world units must also be provided, as this will determine the final size of the lightmap texture (and, in consequence, the UV padding in the map).
fr: Le mode **Light Baking** doit être réglé sur **Gen Lightmaps**. Une taille de texel en unités mondiales doit également être fournie, car cela déterminera la taille finale de la texture lightmap (et, par conséquent, le remplissage UV de la carte).

source: The effect of setting this option is that all meshes within the scene will have their UV2 maps properly generated.
es: El efecto de establecer esta opción es que todas las mallas dentro de la escena tendrán sus mapas de UV2 correctamente generados.
fr: L’effet du réglage de cette option est que toutes les mailles (meshes) au sein de la scène auront leurs cartes UV2 correctement générés.
ja: このオプションを設定すると、シーン内のすべてのメッシュのUV2マップが適切に生成されます。
zh_cn: 设置此选项的效果是场景中的所有网格都将正确生成其UV2贴图。

source: When reusing a mesh within a scene, keep in mind that UVs will be generated for the first instance found. If the mesh is re-used with different scales (and the scales are wildly different, more than half or twice), this will result in inefficient lightmaps. Don't reuse a source mesh at significantly different scales if you are planning to use lightmapping.
fr: Lorsque de la réutilisation d'un maillage (meshe) dans une scène, gardez à l'esprit que les UVs sont générés pour la première instance trouvée. Si le maillage est réutilisée à différentes échelles (et que les échelles sont très différentes, plus de la moitié ou deux fois), cela se traduira par un lightmaps inefficace. Juste, ne réutilisez pas les maillages sources à différentes échelles si vous envisagez d’utiliser lightmapping.

source: Also, the ``*.unwrap_cache`` files should *not* be ignored in version control as these files guarantee that UV2 reimports are consistent across platforms and engine versions.
fr: De plus, les fichiers ``*.unwrap_cache`` ne doivent *pas* être ignorés dans le contrôle de version car ces fichiers garantissent que les réimportations d'UV2 sont cohérentes entre les plateformes et les versions du moteur.

source: Unwrap from within Godot
es: Desplegar desde Godot
fr: Dépliage depuis Godot
ja: Godot内から展開する
zh_cn: 从Godot内部解开

source: Godot has an option to unwrap meshes and visualize the UV channels. It can be found in the Mesh menu:
es: Godot tiene la opción de desplegar mallas y visualizar los canales UV. Se puede encontrar en el menú Malla:
fr: Godot a une option pour déplier les maillages (meshes) et visualiser les chaîne UV. On peut la trouver dans le menu Mesh :
ja: Godotには、メッシュを展開してUVチャネルを視覚化するオプションがあります。 Meshメニューにあります:
zh_cn: Godot可以选择打开网格并可视化UV通道。 它可以在Mesh菜单中找到:

source: This will generate a second set of UV2 coordinates which can be used for baking, and it will also set the texture size automatically.
es: Esto generará un segundo conjunto de coordenadas UV2 que puede ser usado para hornear, y también fijará el tamaño de la textura automáticamente.
fr: Cela va générer un second ensemble de coordonné UV2 qui peut être utilisé pour un baking, et cela va aussi configurer automatiquement la taille de la texture.
ja: これにより、焼き込みに使用できる2番目のUV2座標セットが生成され、テクスチャサイズも自動的に設定されます。
zh_cn: 这将生成第二组UV2坐标，可用于烘焙，并且还将自动设置纹理大小。

source: Unwrap from your 3D DCC
es: Desplegar desde de su 3D DCC
fr: Déplier depuis votre logiciel 3D
ja: 3D DCCから展開(アンラップ)
zh_cn: 从3D DCC展开

source: The last option is to do it from your favorite 3D app. This approach is generally not recommended, but it's explained first so that you know it exists. The main advantage is that, on complex objects that you may want to re-import a lot, the texture generation process can be quite costly within Godot, so having it unwrapped before import can be faster.
fr: La dernière option consiste à le faire à partir de votre application 3D préférée. Cette approche n'est généralement pas recommandée, mais elle est expliquée en premier afin que vous sachiez qu'elle existe. L'avantage principal est que, sur les objets complexes que vous souhaitez réimporter souvent, le processus de génération de texture peut être assez coûteux dans Godot, de sorte que l' avoir unwrapped avant l'importation peut être plus rapide.

source: Simply do an unwrap on the second UV2 layer.
es: Simplemente despliegue la segunda capa UV2.
fr: Il suffit simplement de dérouler la deuxième couche d’UV2.
ja: 2番目のUV2レイヤーで展開するだけです。
zh_cn: 只需在第二个UV2层上打开包装即可。

source: Then import the 3D scene normally. Remember you will need to set the texture size on the mesh after import.
fr: Ensuite, importez la scène 3D normalement. N'oubliez pas que vous devrez définir la taille de la texture sur le maillage après l'importation.

source: If you use external meshes on import, the size will be kept. Be wary that most unwrappers in 3D DCCs are not quality oriented, as they are meant to work quickly. You will mostly need to use seams or other techniques to create better unwrapping.
es: Si se usan mallas externas en la importación, el tamaño se mantendrá. Tenga cuidado de que la mayoría de los desenvolvedores en los DCC 3D no están orientados a la calidad, ya que están destinados a trabajar rápidamente. La mayoría de las veces necesitarás usar costuras u otras técnicas para crear un mejor desenvolvimiento.
fr: Si vous utilisez des maillages (meshes) externes lors de l'importation, la taille sera conservée. Attention car la plupart des décompresseurs des logiciels 3D ne sont pas réglés pour la qualité mais pour la rapidité de traitement. Vous devrez surtout utiliser les coutures (seams) ou d’autres techniques pour créer un meilleur dépliage.
ja: インポート時に外部メッシュを使用する場合、サイズは保持されます。 3D DCCのほとんどのアンラッパーは、迅速に動作することを目的としているため、品質重視ではありません。より良い展開図を作成するには、ほとんどの場合、シームや他の技術を使用する必要があります。

source: Checking UV2
es: Comprobando el UV2
fr: Vérification des UV2
ja: UV2を確認する
zh_cn: 检查UV2

source: In the mesh menu mentioned before, the UV2 texture coordinates can be visualized. Make sure, if something is failing, to check that the meshes have these UV2 coordinates:
es: En el menú de malla mencionado anteriormente, se pueden visualizar las coordenadas de la textura del UV2. Asegúrate, si algo está fallando, de comprobar que las mallas tienen estas coordenadas UV2:
fr: Dans le menu de maillage mentionné précédemment, les coordonnées de texture UV2 peuvent être visualisées. S'assurer, si quelque chose ne fonctionne pas, que les mailles ont ces coordonnées UV2 :
ja: 前に説明したメッシュメニューで、UV2テクスチャ座標を視覚化できます。何かが失敗している場合は、メッシュに次の UV2座標があることを確認してください:
zh_cn: 在前面提到的网格菜单中，可以显示UV2纹理坐标。 如果出现问题，请确保检查网格是否具有以下UV2坐标:

source: Setting up the scene
es: Configurando la escena
fr: Mise en place de la scène
ja: シーンの設定
zh_cn: 设置场景

source: Before anything is done, a **BakedLightmap** node needs to be added to a scene. This will enable light baking on all nodes (and sub-nodes) in that scene, even on instanced scenes.
fr: Avant de faire quoi que ce soit, un nœud **BakedLightmap** doit être ajouté à une scène. Cela permettra le light baking sur tous les nœuds (et sous-nœuds) de cette scène, même sur les scènes instanciées.

source: A sub-scene can be instanced several times, as this is supported by the baker, and each will be assigned a lightmap of its own (just make sure to respect the rule about scaling mentioned before):
es: Se puede instanciar una subescena varias veces, ya que esto es apoyado por el baker, y a cada una se le asignará un mapa de luz propio (sólo asegúrese de respetar la regla sobre el escalado mencionada anteriormente):
fr: Une sous-scène peut être instanciée plusieurs fois, car cela est supporté par le baker, et chacune se verra attribuer une lightmap (assurez-vous juste de respecter la règle de mise à l'échelle mentionnée précédemment) :
ja: これはベイカーによってサポートされているため、サブシーンは複数回インスタンス化することができ、それぞれに独自のライトマップが割り当てられます(前述のスケーリングに関するルールを必ず守ってください):
zh_cn: 子场景可以多次实例化，因为这是由面包师支持的，并且每个子场景都将被分配一个自己的光照贴图(只需确保遵守前面提到的缩放规则):

source: Configure bounds
es: Configurar los límites
fr: Configurer les limites
ja: 範囲設定
zh_cn: 配置边界

source: Lightmap needs an approximate volume of the area affected because it uses it to transfer light to dynamic objects inside it (more on that later). Just cover the scene with the volume as you do with ``GIProbe``:
es: Lightmap necesita un volumen aproximado del área afectada porque lo utiliza para transferir la luz a los objetos dinámicos que se encuentran en su interior (más sobre eso más adelante). Sólo cubre la escena con el volumen como lo haces con "GIProbe":
fr: Le Lightmap a besoin d'un volume approximatif de la zone affectée, car elle l'utilise pour transférer la lumière aux objets dynamiques se trouvant à l'intérieur (plus de détails plus tard). Recouvrez simplement la scène avec le volume de la même manière que vous le faites avec ``GIProbe`` :
ja: ライトマップは、それを使用して内部の動的オブジェクトに光を伝達するため、影響を受けるエリアと同程度のボリューム(容積)が必要です。(詳細は後述)。\ ``GIProbe`` で行うように、ボリュームでシーンをカバーするだけです:

source: Setting up meshes
es: Configurando mallas
fr: Mise en place des maillages
ja: メッシュの設定
zh_cn: 设置网格

source: For a **MeshInstance** node to take part in the baking process, it needs to have the **Use in Baked Light** property enabled.
fr: Pour qu'un nœud **MeshInstance** prenne part au processus de baking, la propriété **Use in Baked Light** doit être activée.

source: When auto-generating lightmaps on scene import, this is enabled automatically.
es: Cuando se generan automáticamente mapas de luz en la importación de escenas, esto se activa automáticamente.
fr: Lors de la génération automatique du lightmaps d'une scène importé, celle-ci est activé automatiquement.
ja: シーンのインポート時にライトマップを自動生成する場合、これは自動的に有効になります。
zh_cn: 在场景导入时自动生成光照贴图时，会自动启用此功能。

source: Setting up lights
es: Configurando luces
fr: Mise en place des lumières
ja: ライトの設定
zh_cn: 设置灯

source: Lights are baked with indirect light by default. This means that shadowmapping and lighting are still dynamic and affect moving objects, but light bounces from that light will be baked.
es: Las luces se baked con luz indirecta por defecto. Esto significa que los mapas de sombras y la iluminación siguen siendo dinámicos y afectan a los objetos en movimiento, pero la luz que rebota de esa luz se baked.
fr: Les lumières sont "baker" par défaut avec une lumière indirecte. Cela signifie que la shadowmapping (cartographie des ombres) et l'éclairage sont toujours dynamiques et affectent les objets en mouvement, mais la lumière rebondit à partir de cette lumière sera "baké".
ja: デフォルトでは、ライトは間接光でベイク処理されます。これは、シャドウマッピングと照明は依然として動的であり、移動するオブジェクトに影響を与えますが、そのライトからの光の跳ね返りはベイク処理されることを意味します。
zh_cn: 默认情况下，灯光采用间接灯光烘焙。 这意味着阴影贴图和光照仍然是动态的并影响移动的物体，但是光线反射的光将被烘焙。

source: Lights can be disabled (no bake) or be fully baked (direct and indirect). This can be controlled from the **Bake Mode** menu in lights:
es: Las luces pueden ser desactivadas (sin bake) o totalmente baked (directas e indirectas). Esto se puede controlar desde el menú **Bake Mode** en las luces:
fr: Les lumières peuvent être désactivées (pas de baking) ou entièrement "baked" (directes et indirectes). Ceci peut être contrôlé à partir du menu **Bake Mode** dans les éclairages :
ja: ライトは無効(ベイクなし)または完全にベイク処理(直接および間接)できます。これは、ライトの **Bake Mode** メニューから制御できます:
zh_cn: 灯可以禁用(不烘焙)或完全烘焙(直接和间接)。 这可以通过灯光中的 **烘焙模式** 菜单进行控制:

source: The modes are:
es: Los modos son:
fr: Les modes sont :
ja: モードは次のとおりです:
zh_cn: 模式是:

source: Disabled
fr: Désactivée

source: The light is ignored when baking lightmaps. Keep in mind hiding a light will have no effect for baking, so this must be used instead of hiding the Light node.
fr: La lumière est ignorée lors du "baking". Gardez à l'esprit que cacher une lumière n'aura aucun effet sur le "baking", cela doit être utilisé à la place.

source: This is the mode to use for dynamic lighting effects such as explosions and weapon effects.
fr: C'est le mode à utiliser pour les effets d'éclairage dynamiques tels que les explosions et les effets d'armes.

source: This is the default mode, and is a compromise between performance and real-time friendliness. Only indirect lighting will be baked. Direct light and shadows are still real-time, as they would be without BakedLightmap.
fr: C'est le mode par défaut, et c'est un compromis entre les performances et la convivialité en temps réel. Seul l'éclairage indirect sera préparé. La lumière directe et les ombres sont toujours en temps réel, comme elles le seraient sans BakedLightmap.

source: This mode allows performing *subtle* changes to a light's color, energy and position while still looking fairly correct. For example, you can use this to create flickering static torches that have their indirect light baked.
fr: Ce mode permet d'apporter des modifications *subtiles* à la couleur, à l'énergie et à la position d'une lumière tout en conservant une apparence relativement correcte. Par exemple, vous pouvez l'utiliser pour créer des torches statiques vacillantes dont la lumière indirecte est préparée.

source: Both indirect and direct lighting will be baked. Since static surfaces can skip lighting and shadow computations entirely, this mode provides the best performance along with smooth shadows that never fade based on distance. The real-time light will not affect baked surfaces anymore, but it will still affect dynamic objects. When using the **All** bake mode on a light, dynamic objects will not cast real-time shadows onto baked surfaces, so you need to use a different approach such as blob shadows instead. Blob shadows can be implemented with a Sprite3D + RayCast setup, or a negative SpotLight pointing down with its bake mode set to **Disabled**.
fr: L'éclairage direct et indirect sera intégré. Étant donné que les surfaces statiques peuvent ignorer entièrement les calculs d'éclairage et d'ombres, ce mode offre les meilleures performances ainsi que des ombres fluides qui ne s'atténuent jamais en fonction de la distance. L'éclairage en temps réel n'affectera plus les surfaces préparées, mais il affectera toujours les objets dynamiques. Lorsque vous utilisez le mode d'écrasement **All** sur une lumière, les objets dynamiques ne projetteront pas d'ombres en temps réel sur les surfaces préparées, vous devez donc utiliser une approche différente, comme les ombres blob. Les ombres de type blob peuvent être mises en œuvre à l'aide d'une configuration Sprite3D + RayCast, ou d'une SpotLight négative pointant vers le bas et dont le mode de préparation est réglé sur **Disabled**.

source: The light will not be adjustable at all during gameplay; moving it and changing its color will not have any effect on static surfaces.
fr: La lumière ne sera pas du tout réglable pendant le jeu ; la déplacer et changer sa couleur n'aura aucun effet sur les surfaces statiques.

source: Since bake modes can be adjusted on a per-light basis, it is possible to create hybrid baked light setups. One popular option is to use a real-time DirectionalLight with its bake mode set to **Indirect**, and use the **All** bake mode for OmniLights and SpotLights. This provides good performance while still allowing dynamic objects to cast real-time shadows in outdoor areas.
fr: Étant donné que les modes de préparation peuvent être réglés pour chaque lumière, il est possible de créer des configurations hybrides de lumière préparée. Une option populaire consiste à utiliser une DirectionalLight en temps réel dont le mode de préparation est réglé sur **Indirect**, et à utiliser le mode de préparation **All** pour les OmniLights et les SpotLights. Cela offre de bonnes performances tout en permettant aux objets dynamiques de projeter des ombres en temps réel dans les zones extérieures.

source: Baking
es: Horneado
fr: Pré-calcul
ja: ベイク(焼き込み)処理
zh_cn: 烘焙

source: To begin the bake process, just push the **Bake Lightmaps** button on top when selecting the BakedLightmap node:
fr: Pour pré-calculer les lumières, appuyer sur le bouton **Bake Lightmaps** en haut quand vous sélectionnez le nœud BakeLightmap :

source: This can take from seconds to minutes (or hours) depending on scene size, bake method and quality selected.
es: Esto puede llevar de segundos a minutos (u horas) dependiendo del tamaño de la escena, el método de bake y la calidad seleccionada.
fr: Cela peut prendre quelques secondes, voir des heures. La taille de la scène, la méthode de pré-calcul et sa qualité impacte le temps de calcul.
ja: これには、選択したシーンのサイズ、焼き込み方法、品質に応じて、数秒から数分(または数時間)かかります。
zh_cn: 这可能需要几秒到几分钟(或几小时)，具体取决于场景大小，烘焙方法和所选质量。

source: Balancing bake times with quality
fr: Équilibrer les temps de préparation et la qualité
