Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/baked_lightmaps.po
Languages: es, fr, ja, zh_cn

source: **Disabled:** Light is ignored in baking. Keep in mind hiding a light will have no effect for baking, so this must be used instead.
es: **Disabled:** La luz es ignorada en la cocción. Ten en cuenta que ocultar una luz no tendrá ningún efecto para la baking, así que esto debe ser usado en su lugar.
ja: **Disabled(無効):** ベイク処理ではライトは無視されます。ライトを非表示にしてもベイク処理は無効化されないので、代わりにこれを使用する必要があります。
zh_cn: **禁用:** 烘焙时忽略灯光。 请记住隐藏灯光对烘焙没有影响，因此必须使用此灯泡。

source: **Indirect:** This is the default mode. Only indirect lighting will be baked.
es: **Indirect:** Este es el modo por defecto. Sólo se baked la iluminación indirecta.
ja: **Indirect(間接): **これはデフォルトのモードです。間接照明のみがベイク処理されます。
zh_cn: **间接:** 这是默认模式。 只会间接照明。

source: **All:** Both indirect and direct lighting will be baked. If you don't want the light to appear twice (dynamically and statically), simply hide it.
es: **All:** Tanto la iluminación indirecta como la directa serán baked. Si no quieres que la luz aparezca dos veces (dinámica y estática), simplemente ocúltala.
ja: **All(すべて):** 間接照明と直接照明の両方がベイク処理されます。ライトを2回(動的および静的に)表示したくない場合は、単に非表示にしてください。
zh_cn: **全部:** 间接和直接照明都将被烘焙。 如果您不希望灯光出现两次(动态和静态)，只需将其隐藏即可。

source: Baking quality
es: Calidad de baking
ja: 焼き込みの品質
zh_cn: 烘焙质量

source: ``BakedLightmap`` uses, for simplicity, a voxelized version of the scene to compute lighting. Voxel size can be adjusted with the **Bake Subdiv** parameter. More subdivision results in more detail, but also takes more time to bake.
es: ``BakedLightmap`` utiliza, por simplicidad, una versión voxelizada de la escena para calcular la iluminación. El tamaño del voxel puede ser ajustado con el parámetro **Bake Subdiv**. Más subdivisión resulta en más detalles, pero también toma más tiempo para hornear.
ja: ``BakedLightmap`` は、単純化するために、ボクセル化されたシーンを使用して照明を計算します。ボクセルのサイズは、\ **Bake Subdiv* *パラメーターで調整できます。細分化を行うとより詳細になりますが、焼き込みに時間がかかります。

source: In general, the defaults are good enough. There is also a **Capture Subdivision** (that must always be equal to or less than the main subdivision), which is used for capturing light in dynamic objects (more on that later). Its default value is also good enough for most cases.
es: En general, los valores por defecto son lo suficientemente buenos. También hay una **Subdivisión de captura** (que siempre debe ser igual o menor que la subdivisión principal), que se utiliza para capturar la luz en los objetos dinámicos (más sobre eso más adelante). Su valor por defecto también es lo suficientemente bueno para la mayoría de los casos.
ja: 一般に、デフォルトで十分です。また、\ **Capture Subdivision** (常にメインサブディビジョン以下である必要があります)もあります。これは、動的オブジェクトの光をキャプチャするために使用されます(詳細は後述)。ほとんどの場合、このデフォルト値で十分です。

source: Besides the capture size, quality can be modified by setting the **Bake Mode**. Two modes of capturing indirect are provided:
es: Además del tamaño de la captura, la calidad puede ser modificada por el ajuste del **Modo de horneado**. Se proporcionan dos modos de captura indirecta:
ja: キャプチャサイズに加えて、\ **Bake Mode** を設定することで品質を変更できます。間接的なキャプチャの2つのモードが提供されます:
zh_cn: 除捕获大小外，还可以通过设置 **烘焙模式** 来修改质量。 提供了两种间接捕获模式:

source: **Voxel Cone**: Trace: Is the default one; it's less precise, but faster. Looks similar to (but slightly better than) ``GIProbe``.
es: **Voxel Cone**: Trace: Es el predeterminado; es menos preciso, pero más rápido. Se ve similar a (pero ligeramente mejor que) ``GIProbe``.
ja: **ConeTrace(ボクセルコーントレース)**: デフォルトです。精度は劣りますが、高速です。\ ``GIProbe`` に似ています(ただし、わずかに優れています)。

source: **Ray Tracing**: This method is more precise, but can take considerably longer to bake. If used in low or medium quality, some scenes may produce grain.
es: **Ray Tracing**: Este método es más preciso, pero puede tardar bastante más tiempo en hornearse. Si se usa en calidad baja o media, algunas escenas pueden producir granulado.
ja: **RayTrace(レイ トレーシング)**: この方法はより正確ですが、ベイク処理にかなり時間がかかります。低品質または中品質で使用すると、一部のシーンで粒子が生成される場合があります。

source: To begin the bake process, just push the big **Bake Lightmaps** button on top when selecting the ``BakedLightmap`` node:
es: Para empezar el proceso de horneado, sólo tienes que pulsar el gran botón **Hornear mapas de luz** en la parte superior al seleccionar el nodo ``BakedLightmap``:
ja: ベイク処理を開始するには、\ **BakedLightmap`` ノードの選択中に一番上の大きな **ライトマップを焼き込む** ボタンを押すだけです:

source: **Bake Subdiv**: The Godot lightmapper uses a grid to transfer light information around; the default value is fine and should work for most cases. Increase it in case you want better lighting on small details or your scene is large.
es: **Bake Subdiv**: El mapa de luz de Godot utiliza una cuadrícula para transferir la información de la luz; el valor por defecto está bien y debería funcionar en la mayoría de los casos. Auméntalo en caso de que quieras una mejor iluminación en los pequeños detalles o tu escena sea extensa.
ja: **Bake Subdiv**: Godotライトマッパーは、周りの光の情報を転送するためにグリッドを使用しています。デフォルト値のままで問題はなく、ほとんどの場合に適しています。細部の照明をより良くしたい場合や、シーンが大きい場合には増やします。

source: **Capture Subdiv**: This is the grid used for real-time capture information (lighting dynamic objects). Default value is generally OK, it's usually smaller than Bake Subdiv and can't be larger than it.
es: **Captura de la Subdivisión**: Esta es la cuadrícula utilizada para la captura de información en tiempo real (iluminación de objetos dinámicos). El valor por defecto es generalmente el correcto, usualmente más pequeño que Bake Subdiv y no puede ser más grande que él.
ja: **Capture Subdiv**: これは、リアルタイムのキャプチャ情報(動的オブジェクトの照明)に使用されるグリッドです。ほとんどの場合、デフォルト値で問題ありません。通常、この値はBake Subdivより小さく、それより大きくすることはできません。
zh_cn: ** Capture Subdiv**: 这是用于实时捕获信息的网格(照明动态对象)。 默认值通常是OK，它通常小于Bake Subdiv并且不能大于它。

source: **Bake Quality**: Three bake quality modes are provided, Low, Medium and High. Higher quality takes more time.
es: **Calidad del horneado**: Se proporcionan tres modos de calidad de horneado, Bajo, Medio y Alto. Una calidad más alta tomará más tiempo.
ja: **Bake Quality**: Low、Medium、Highの3つの焼き込み品質モードが用意されています。品質が高いほど時間がかかります。
zh_cn: **烘焙质量**:提供三种烘焙质量模式，低，中和高。 更高的质量需要更多的时间。

source: **Bake Mode**: The baker can use two different techniques: *Voxel Cone Tracing* (fast, but approximate), or *RayTracing* (slow, but accurate).
es: **Modo de hornear**: El horneador puede usar dos técnicas diferentes: *Voxel Cone Tracing* (rápido, pero aproximado), o *RayTracing* (lento, pero preciso).
ja: **Bake Mode**: ベイカーは2つの異なる手法を使用できます: *Voxel Cone Tracing* (高速ですが近似的)、または *RayTracing* (低速ですが正確)。

source: **Propagation**: Used for the *Voxel Cone Trace* mode. Works just like in ``GIProbe``.
es: **Propagación**: Usado para el modo *Voxel Cone Trace*. Funciona igual que en ``GIProbe``.
ja: **Propagation**: *Voxel Cone Trace* モードで使用されます。\ ``GIProbe`` と同じように機能します。

source: **HDR**: If disabled, lightmaps are smaller, but can't capture any light over white (1.0).
es: **HDR**: Si está desactivado, los mapas de luz son más pequeños, pero no pueden capturar ninguna luz sobre el blanco (1.0).
ja: **HDR**: 無効にすると、ライトマップは小さくなりますが、白(1.0)を超える光をキャプチャできません。

source: **Image Path**: Where lightmaps will be saved. By default, on the same directory as the scene ("."), but can be tweaked.
es: **Image Path**: Donde se guardarán los mapas de luz. Por defecto, en el mismo directorio de la escena ("."), pero esto puede ser cambiado.
ja: **Image Path**: ライトマップが保存される場所。デフォルトでは、シーン (".") と同じディレクトリにありますが、微調整できます。
zh_cn: **图像路径**:将保存光照贴图的位置。 默认情况下，在与场景相同的目录(``。``)上，但可以进行调整。

source: **Extents**: Size of the area affected (can be edited visually)
es: **Extents**: Tamaño del área afectada (puede ser editada visualmente)
ja: **Extents**: 影響を受ける領域のサイズ(視覚的に編集できます)
zh_cn: **范围**:受影响区域的大小(可以直观地编辑)

source: **Light Data**: Contains the light baked data after baking. Textures are saved to disk, but this also contains the capture data for dynamic objects, which can be a bit heavy. If you are using .tscn formats (instead of .scn), you can save it to disk.
es: **Datos de la luz**: Contiene los datos de la luz horneada después de hornear. Las texturas se guardan en el disco, pero también contiene los datos de captura de los objetos dinámicos, que pueden ser un poco pesados. Si estás usando los formatos .tscn (en lugar de .scn), puedes guardarlos en el disco.
ja: **Light Data**: ベイク処理後のライトベイク処理されたデータが含まれます。テクスチャはディスクに保存されますが、これには動的オブジェクトのキャプチャデータも含まれますが、これは少し重い場合があります。.scn の代わりに .tscn 形式を使用している場合は、ディスクに保存できます。

source: In other engines or lightmapper implementations, you are required to manually place small objects called "lightprobes" all around the level to generate *capture* data. This is used to, then, transfer the light to dynamic objects that move around the scene.
es: En otros motores o implementaciones de mapas de luz, se requiere colocar manualmente pequeños objetos llamados "sondas de luz" alrededor del nivel para generar datos de *captura*. Esto se utiliza para, entonces, transferir la luz a los objetos dinámicos que se mueven alrededor de la escena.
ja: 他のエンジンまたはライトマッパーの実装では、「ライトプローブ」と呼ばれる小さなオブジェクトをレベル全体に手動で配置して、\ *キャプチャ* データを生成する必要があります。これは、光をシーン内を移動する動的オブジェクトに転送するために使用されます。
zh_cn: 在其他引擎或lightmapper实现中，您需要手动在该级别周围放置称为``lightprobes``的小对象以生成* capture *数据。 然后，这用于将光传输到在场景中移动的动态对象。
