Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/csg_tools.po
Languages: es, ja, zh_cn

source: Prototyping levels with CSG
es: Prototipando niveles con CSG
zh_cn: CSG的原型设计水平

source: CSG stands for **Constructive Solid Geometry**, and is a tool to combine basic shapes or custom meshes to create more complex shapes. In 3D modelling software, CSG is mostly known as "Boolean Operators".
es: CSG significa **Geometría Sólida Constructiva**, y es una herramienta para combinar formas básicas o mallas personalizadas para crear formas más complejas. En el software de modelado 3D, CSG es mayormente conocido como "Operadores Booleanos".
ja: CSGは **Constructive Solid Geometry** (空間領域構成法) の略で、基本的な形状あるいはカスタムのメッシュを組み合わせることで、より複雑な形状を作成するツールです。3Dモデリングのソフトウェアでは、CSGは『ブーリアン演算』という名でも知られています。
zh_cn: CSG是 **Constructive Solid Geometry** [构造实体几何]的缩写，是一种将基本形状或自定义网格组合起来以创建更复杂形状的工具。在三维建模软件中，CSG多被称为 "布尔运算符" 。

source: Level prototyping is one of the main uses of CSG in Godot. This technique allows users to create simple versions of most common shapes by combining primitives. Interior environments can be created by using inverted primitives.
es: El prototipo de nivel es uno de los principales usos del CSG en Godot. Esta técnica permite a los usuarios crear versiones simples de las formas más comunes combinando primitivas. Se pueden crear ambientes interiores utilizando primitivas invertidas.
ja: レベルのプロトタイプ作成は、GodotでCSGを使う主な理由の一つです。このテクニックにより、ユーザーはプリミティブを組み合わせることで、よく使う形状の簡易版を作れます。インテリア環境も反転したプリミティブで作成できます。
zh_cn: CSG在Godot中的目的是将其用于关卡原型设计。 该技术允许用户通过组合基元来创建最常见形状的简单版本。 可以使用反转基元创建室内环境。

source: The CSG nodes in Godot are mainly intended for prototyping. There is no built-in support for UV mapping or editing 3D polygons (though extruded 2D polygons can be used with the CSGPolygon node).
es: Los nodos CSG en Godot están destinados principalmente a la creación de prototipos. No hay soporte incorporado para mapeo de UV o edición de polígonos 3D (aunque se pueden usar polígonos 2D extruidos con el nodo CSGPolygon).
zh_cn: Godot中的CSG节点主要用于原型设计。没有内置的对UV贴图或编辑3D多边形的支持（尽管挤出的2D多边形可以用CSGPolygon节点来使用）。

source: If you're looking for an easy to use level design tool for a project, you may want to use `Qodot <https://github.com/Shfty/qodot-plugin>`__ instead. It lets you design levels using `TrenchBroom <https://kristianduske.com/trenchbroom/>`__ and import them in Godot.
es: Si estás buscando una herramienta de diseño de niveles fácil de usar para un proyecto, tal vez quieras usar `Qodot <https://github.com/Shfty/qodot-plugin>`__ en su lugar. Te permite diseñar niveles usando "TrenchBroom" <https://kristianduske.com/trenchbroom/>`__ e importarlos en Godot.
zh_cn: 如果你正在为一个项目寻找一个简单易用的关卡设计工具，你可能会想使用`Qodot <https://github.com/Shfty/qodot-plugin>`__来代替。它可以让你使用`TrenchBroom <https://kristianduske.com/trenchbroom/>`__设计关卡，并在Godot中导入它们。

source: Introduction to CSG nodes
es: Introducción a nodos CSG
ja: CSGノードの入門
zh_cn: CSG节点简介

source: Like other features of Godot, CSG is supported in the form of nodes. These are the CSG nodes:
es: Al igual que otras características de Godot, el CSG se apoya en forma de nodos. Estos son los nodos de CSG:
ja: Godotの他の機能と同様に、CSGもノードとしてサポートされています。これらがCSGノードです:
zh_cn: 与Godot的其他功能一样，CSG以节点的形式存在，这些是CSG节点:

source: :ref:`CSGCylinder <class_CSGCylinder>` (also supports cone)
es: :ref:`CSGCylinder <class_CSGCylinder>` (también soporta conos)
ja: :ref:`CSGCylinder <class_CSGCylinder>` (コーン形状も可)
zh_cn: :ref:`CSGCylinder <class_CSGCylinder>` (也支持锥体)

source: CSG tools features
es: Funcionalidades de herramientas CSG
ja: CSGツール機能
zh_cn: CSG工具功能

source: Every CSG node supports 3 kinds of boolean operations:
es: Cada nodo CSG soporta 3 tipos de operaciones booleanas:
ja: すべてのCSGノードは3種類のブーリアン演算に対応しています:
zh_cn: 每个CSG节点都支持3种布尔运算:

source: **Union:** Geometry of both primitives is merged, intersecting geometry is removed.
es: **Unión:** La geometría de ambas primitivas se fusiona, la geometría que se intersecta se elimina.
ja: **Union (和集合):** プリミティブのジオメトリを結合させて、共通部分のジオメトリは除去されます。
zh_cn: **并集（Union）：** 合并两个基元的几何，删除交叉几何。

source: **Intersection:** Only intersecting geometry remains, the rest is removed.
es: **Intersección:** Sólo queda la geometría de intersección, el resto se elimina.
ja: **Intersection (共通部分):** ジオメトリの共通部分のみを残し、他は除去されます。
zh_cn: **交集（Intersection）：** 只保留相交的几何体，其余的被删除。

source: **Subtraction:** The second shape is subtracted from the first, leaving a dent with its shape.
es: **Sustracción:** La segunda forma se resta de la primera, dejando una mella con su forma.
ja: **Subtraction (差集合):** 第一の形状を、第二の形状で差し引いて、形状に穴を開けます。
zh_cn: **差集（Subtraction）：** 第二种形状从第一种形状中减去，留下一个凹陷的形状。

source: CSGPolygon
es: PolígonoCSG

source: The :ref:`CSGPolygon <class_CSGPolygon>` node extrude along a Polygon drawn in 2D (in X, Y coordinates) in the following ways:
es: El nodo :ref:`CSGPolygon <class_CSGPolygon>` extruye a lo largo de un polígono dibujado en 2D (en coordenadas X, Y) de las siguientes maneras:
zh_cn: :ref:`CSGPolygon <class_CSGPolygon>`节点以下列方式沿着以2D（X，Y坐标）绘制的多边形挤出:

source: **Depth:** Extruded back a given amount.
es: **Profundidad:** Extraído de vuelta una cantidad dada.
ja: **Depth (深さ):** 指定された量で後ろに押し出します。
zh_cn: **Depth:** [深度]挤出一定量。

source: **Spin:** Extruded while spinning around its origin.
es: **Girar:** Extruido mientras gira alrededor de su origen.
ja: **Spin (回転):** 原点を中心に、回転しながら押し出します。
zh_cn: **Spin:** [旋转]围绕原点旋转时挤出。

source: **Path:** Extruded along a Path node. This operation is commonly called lofting.
es: **Ruta:** Extruido a lo largo de un nodo Ruta. Esta operación se llama comúnmente "lofting".
ja: **Path (パス):** Pathノードに沿って押し出します。ロフティングともよく呼ばれる操作です。
zh_cn: **路径（Path）：** 沿路径节点挤出。 此操作通常称为放样。

source: The **Path** mode must be provided with a :ref:`Path <class_Path>` node to work. In the Path node, draw the path and the polygon in CSGPolygon will extrude along the given path.
es: El modo **Ruta** debe estar provisto de un nodo :ref:`Path <class_Path>` para funcionar. En el nodo Ruta, dibuja el camino y el polígono en CSGPolygon extruirá a lo largo del camino dado.
ja: **Path** モードを動かすには、まず\ :ref:`Path <class_Path>`\ ノードを用意しなければなりません。このPathノードにてパスを描くと、CSGPolygonのポリゴンはそのパスに沿って押し出されます。
zh_cn: **Path** 模式需要一个 :ref:`Path <class_Path>` 节点来运行。 在 ``Path`` 节点中，绘制路径， ``CSGPolygon`` 中的多边形将沿给定路径挤出。

source: Custom meshes
es: Mallas personalizadas
ja: カスタム メッシュ
zh_cn: 自定义网格

source: Any mesh can be used for :ref:`CSGMesh <class_CSGMesh>`; the mesh can be modelled in other software and imported into Godot. Multiple materials are supported. There are some restrictions for geometry:
es: Cualquier malla puede ser usada para :ref:`CSGMesh <class_CSGMesh>`; la malla puede ser modelada en otro software e importada a Godot. Se admiten múltiples materiales. Hay algunas restricciones para la geometría:
ja: \ :ref:`CSGMesh <class_CSGMesh>`\ なら、どんなメッシュでも使用できます。他のソフトウェアでモデリングしてからGodotにインポートしたメッシュでも可能です。複数のマテリアルにも対応しています。ジオメトリにはいくつかの制限があります:
zh_cn: 任何网格都可以用于 :ref:`CSGMesh <class_CSGMesh>`，网格可以在其他软件中建模并导入Godot。 支持多种材质，对几何体有一些限制：

source: it must be closed,
es: debe ser cerrada,
ja: 閉じていること。
zh_cn: 它必须被关闭，

source: it must not self-intersect,
es: no debe intersectarse a si mismo,
ja: 自己交差していないこと。
zh_cn: 它不能自我相交，

source: it must not contain internal faces,
es: no debe contener caras internas,
ja: 内部に面がないこと。
zh_cn: 它不能包含内部面,

source: every edge must connect to only two other faces.
es: cada borde debe conectarse sólo a otras dos caras.
ja: すべてのエッジは２つの面のみに接していること。
zh_cn: 每条边都必须连接到另外两个面。

source: CSGCombiner
es: CombinadorCSG

source: The :ref:`CSGCombiner <class_CSGCombiner>` node is an empty shape used for organization. It will only combine children nodes.
es: El nodo :ref:`CSGCombiner <class_CSGCombiner>` es una forma vacía que se utiliza para la organización. Sólo combinará nodos hijos.
ja: \ :ref:`CSGCombiner <class_CSGCombiner>` ノードは、整理のための空のシェイプです。子ノードを一つにまとめます。
zh_cn: :ref:`CSGCombiner <class_CSGCombiner>`节点是一个用于组织的空形状，它只会合并子节点。

source: Processing order
es: Orden de procesamiento
ja: 処理の順番
zh_cn: 处理顺序

source: Every CSG node will first process its children nodes and their operations: union, intersection or subtraction, in tree order, and apply them to itself one after the other.
es: Cada nodo CSG primero procesará sus nodos hijos y sus operaciones: unión, intersección o sustracción, en orden de árbol, y se los aplicará a sí mismo uno tras otro.
ja: すべてのCSGノードは、まずその子ノードから処理を始め、その和、共通部分、差の演算をツリー順に行ってから、自身に適用してそれを繰り返します。
zh_cn: 每个CSG节点将首先按树顺序处理其子节点及其操作：并集，交集或减法，并将它们逐一应用于自身。

source: In the interest of performance, make sure CSG geometry remains relatively simple, as complex meshes can take a while to process. If adding objects together (such as table and room objects), create them as separate CSG trees. Forcing too many objects in a single tree will eventually start affecting performance. Only use binary operations where you actually need them.
es: En interés del rendimiento, asegúrese de que la geometría del CSG siga siendo relativamente simple, ya que las mallas complejas pueden tardar un tiempo en procesarse. Si se agregan objetos juntos (como objetos de mesa y de habitación), crearlos como árboles CSG separados. Forzar demasiados objetos en un solo árbol eventualmente comenzará a afectar el rendimiento. Utiliza las operaciones binarias sólo donde realmente las necesites.
ja: 複雑なメッシュは処理に時間がかかるので、性能を上げるためには、CSGジオメトリを比較的シンプルなままに保ってください。(テーブルや部屋の物体など) 複数の物体を一緒にする場合は、それぞれ別のCSGツリーに分けましょう。ひとつのツリーに多くのオブジェクトを入れすぎると、やがて性能に影響が出始めます。バイナリ演算は本当に必要な時にだけ使用するようにしてください。
zh_cn: 为了保证性能，确保CSG几何体保持相对简单，因为复杂的网格可能需要一段时间来处理。如果将对象添加在一起（如桌子和房间对象），请将它们创建为单独的CSG树。强制在一棵树中添加太多对象最终会影响性能。仅在实际需要的地方使用二进制操作。

source: Prototyping a level
es: Prototipando un nivel
ja: レベルのプロトタイプ作成
zh_cn: 原型设计

source: We will prototype a room to practice the use of CSG tools.
es: Haremos un prototipo de una sala para practicar el uso de herramientas CSG.
ja: CSGツールの練習に、部屋のプロトタイプを作ってみましょう。
zh_cn: 我们将对房间进行原型设计以练习使用CSG工具。

source: Working in **Orthogonal** projection gives a better view when combining the CSG shapes.
es: Trabajar en la proyección **Ortonormal** da una mejor visión al combinar las formas del CSG.
ja: CSGシェイプを組み合わせるときは、\ **平行投影**\ のほうが見えやすくなります。
zh_cn: 在 **Orthogonal** [正交]视角下工作，在组合CSG形状时可以得到更好的视图。

source: Our level will contain these objects:
es: Nuestro nivel contendrá estos objetos:
ja: これから作るレベルには次のような物体があります:
zh_cn: 我们的关卡将包含以下对象：

source: a room,
es: una habitación,
ja: 部屋
zh_cn: 一个房间，

source: a bed,
es: una cama,
ja: ベッド
zh_cn: 一张床，

source: a lamp,
es: una lámpara,
ja: ランプ
zh_cn: 一盏灯，

source: a desk,
es: un escritorio,
ja: 机
zh_cn: 一张桌子，

source: a bookshelf.
es: una estantería.
ja: 本棚
zh_cn: 一个书架。

source: Create a scene with a Spatial node as root node.
es: Crear una escena con un nodo Sspacial como nodo raíz.
ja: Spatial ノードをルートにしてシーンを作成します。
zh_cn: 使用Spatial节点作为根节点创建场景。

source: The default lighting of the environment doesn't provide clear shading at some angles. Change the display mode using **Display Overdraw** in the 3D viewport menu, or add a DirectionalLight node to help you see clearly.
es: La iluminación por defecto del entorno no proporciona un sombreado claro en algunos ángulos. Cambia el modo de visualización usando **Display Overdraw** en el menú de vista 3D, o añade un nodo DirectionalLight para ayudarte a ver con claridad.
ja: 環境のデフォルトの照明設定では、角度によってはシェーディングがきれいに表示されません。3Dビューポート メニューにて表示モードを\ **オーバードロー表示**\ にするか、あるいは DirectionalLight をひとつ追加すれば、はっきりと見えるようになります。
zh_cn: 环境的默认光照在某些角度不能提供清晰的阴影。使用3D视图菜单中的 **Display Overdraw** [显示透视]改变显示模式，或者添加一个DirectionalLight[直射光]节点来帮助你清楚看到。

source: Create a CSGBox and name it ``room``, enable **Invert Faces** and change the dimensions of your room.
es: Crea una CSGBox y llámala ``room``, habilita la opción "Invertir caras" y cambia las dimensiones de tu habitación.
ja: CSGBoxをひとつ作成し、\ ``room``\ という名前を付けて、\ **Invert Faces**\ を有効にしてから、部屋のサイズを変更してください。
zh_cn: 创建一个CSGBox并将其命名为 ``room`` ，启用 **Invert Faces** [反转面]并改变你的房间的大小。

source: Next, create a CSGCombiner and name it ``desk``.
es: A continuación, crear un CSGCombiner y nombrarlo ``desk``.
ja: 次に、CSGCombiner を作成して\ ``desk``\ という名前を付けます。
zh_cn: 接下来，创建一个CSGCombiner并将其命名为 ``desk`` 。

source: A desk has one surface and 4 legs:
es: Un escritorio tiene una superficie y 4 patas:
ja: デスクにはひとつの平面と４本の脚があります:
zh_cn: 桌子有一个表面和四条腿：

source: Create 1 CSGBox children node in **Union** mode for the surface and adjust the dimensions.
es: Crear 1 nodo infantil CSGBox en modo **Unión** para la superficie y ajusta las dimensiones.
ja: 平面として、子ノードのCSGBoxをひとつ作成し、\ **Union (和集合)**\ モードにしてから大きさを変更します。
zh_cn: 在 **Union** 模式下为曲面创建1个CSGBox子节点，并调整大小。

source: Create 4 CSGBox children nodes in **Union** mode for the legs and adjust the dimensions.
es: Crea 4 nodos infantiles CSGBox en modo **Unión** para las piernas y ajusta las dimensiones.
ja: 脚には、子ノードのCSGBoxを４個作成し、\ **Union**\ モードにしてから大きさを調節します。
zh_cn: 在 **Union** 模式下为腿部创建4个CSGBox子节点并调整大小。

source: Adjust their placement to resemble a desk.
es: Ajusta su ubicación para que se parece a un escritorio.
ja: それらの位置を調節してデスクの形にしましょう。
zh_cn: 调整它们的摆放位置，就像一张办公桌。

source: CSG nodes inside a CSGCombiner will only process their operation within the combiner. Therefore, CSGCombiners are used to organize CSG nodes.
es: Los nodos CSG dentro de un combinadorCSG sólo procesarán su operación dentro del combinador. Por lo tanto, los combinadorCSG se utilizan para organizar los nodos CSG.
ja: CSGCombiner の中にあるCSGノードは、その combiner(連合) の中だけで演算処理を行います。そのため、CSGノードの整理には CSGCombiner が使われます。
zh_cn: CSG组合内的CSG节点只会在组合内处理它们的操作。因此，CSGCombiners[CSG组合]是用来组织CSG节点的。

source: Create a CSGCombiner and name it ``bed``.
es: Crea un CombinadorCSG y llámalo ``bed``.
ja: CSGCombiner を作り、\ ``bed``\ と名付けます。
zh_cn: 创建一个CSGCombiner，并将其命名为 ``bed`` 。

source: Our bed consists of 3 parts: the bed, the mattress and a pillow. Create a CSGBox and adjust its dimension for the bed. Create another CSGBox and adjust its dimension for the mattress.
es: Nuestra cama consta de 3 partes: la cama, el colchón y una almohada. Crea una CSGBox y ajusta su dimensión para la cama. Crea otra CSGBox y ajusta su dimensión para el colchón.
ja: ベッドは３つのパーツからなります: ベッド本体、マットレス、そして枕です。CSGBox を作成して、サイズ調整してベッド本体にします。さらに CSGBox をもうひとつ作って、大きさ変更をしてマットレスにします。
zh_cn: 我们的床由三部分组成：床、床垫和枕头。创建一个CSGBox并调整床的尺寸。再创建一个CSGBox，并调整床垫的尺寸。

source: We will create another CSGCombiner named ``pillow`` as the child of ``bed``. The scene tree should look like this:
es: Crearemos otro CombinadorCSG llamado ``pillow`` como el hijo de ``bed``. El árbol de la escena debería verse así:
ja: \ ``bed``\ の子として、\ ``pillow``\ という名前の CSGCombiner を作ります。シーンツリーはこのようになるでしょう:
zh_cn: 我们将创建另一个名为 ``pillow`` 的CSGCombiner作为 ``bed`` 的子节点。场景树应如下所示：

source: We will combine 3 CSGSphere nodes in **Union** mode to form a pillow. Scale the Y axis of the spheres and enable **Smooth Faces**.
es: Combinaremos 3 nodos de la CSGSphere en modo **Unión** para formar una almohada. Escala el eje Y de las esferas y habilita **Caras Suaves**.
ja: それから３つの CSGSphere ノードを **Union (和)** モードにして組み合わせ、枕にします。それぞれの球体をY軸でサイズ変更し、\ **Smooth Faces** を有効にします。
zh_cn: 我们将在 **Union** 模式下组合3个CSGSphere节点，形成一个枕头。缩放球体的Y轴并启用 **Smooth Faces** [平滑面]。

source: Select the ``pillow`` node and switch the mode to **Subtraction**; the combined spheres will cut a hole into the mattress.
es: Selecciona el nodo ``pillow`` y cambia el modo a **Sustracción**; las esferas combinadas harán un agujero en el colchón.
ja: \ ``pillow``\ ノードを選択して、モードを\ **Subtraction (差)**\ に切り替えます。すると組み合わせた球体により、マットレスに穴が開きます。
zh_cn: 选择 ``pillow`` [枕头]节点，并将模式切换到 **减法** ；组合后的球体将在床垫上开一个洞。

source: Try to re-parent the ``pillow`` node to the root ``Spatial`` node; the hole will disappear.
es: Trata de volver a unir el nodo ``pillow`` con el nodo ``Spatial`` de la raíz; el agujero desaparecerá.
ja: \ ``pillow``\ ノードの親を、ルート\ ``Spatial``\ に変更してみましょう。そうすれば穴は消えます。
zh_cn: 试着将 ``pillow`` [枕头]节点重设你代到根 ``Spatial`` 节点；这个洞会消失。

source: This is to illustrate the effect of CSG processing order. Since the root node is not a CSG node, the CSGCombiner nodes are the end of the operations; this shows the use of CSGCombiner to organize the CSG scene.
es: Esto es para ilustrar el efecto del orden de procesamiento CSG. Dado que el nodo raíz no es un nodo CSG, los nodos CombinadorCSG son el final de las operaciones; esto muestra el uso de CombinadorCSG para organizar la escena CSG.
ja: これはCSGの処理順による影響を示すためのものです。ここでのルートノードは CSGノードではないため、CSGCombiner ノードの処理は最後になります。これが CSGCombiner を使ったCSGシーン整理の一例です。
zh_cn: 这是为了说明CSG处理顺序的效果。由于根节点不是CSG节点，所以CSGCombiner节点是操作的结束；这显示了使用CSGCombiner来组织CSG场景。

source: Undo the re-parent after observing the effect. The bed you've built should look like this:
es: Deshacer el parentesco después de observar el efecto. La cama que has construido debería ser así:
ja: 結果を確かめてから、親の変更とモード変更を取り消すと、ベッドはこのようになっているはずです:
zh_cn: 观察效果后，撤消重新选择父节点。您搭建的床应如下所示：

source: Create a CSGCombiner and name it ``lamp``.
es: Crea un CombinadorCSG y llámalo ``lamp``.
ja: CSGCombiner を作成して\ ``lamp``\ と名付けます。
zh_cn: 创建一个CSGCombiner，并将其命名为 ``lamp`` 。

source: A lamp consists of 3 parts: the stand, the pole and the lampshade. Create a CSGCylinder, enable the **Cone** option and make it the stand. Create another CSGCylinder and adjust the dimensions to use it as a pole.
es: Una lámpara consta de 3 partes: el soporte, el poste y la pantalla de lampara. Crea un cilindroCSG, activa la opción **Cono** y hazlo el soporte. Crea otro cilindroCSG y ajustar las dimensiones para usarlo como un poste.
ja: ランプはスタンド、支柱、そしてランプシェードの、３つのパーツからなります。CSGCylinder を作成し、\ **Cone** オプションを有効にしてスタンドにします。それから、もうひとつ CSGCylinder を作って、大きさを調整して支柱にします。
zh_cn: 一盏灯由3部分组成：支架、灯杆和灯罩。创建一个CSGCylinder，启用 **Cone** 选项并将其作为支架。再创建一个CSGCylinder，并调整尺寸，将其作为灯杆使用。

source: We will use a CSGPolygon for the lampshade. Use the **Spin** mode for the CSGPolygon and draw a `trapezoid <https://en.wikipedia.org/wiki/Trapezoid>`_ while in **Front View** (numeric keypad 1); this shape will extrude around the origin and form the lampshade.
es: Usaremos un polígonoCSG para la pantalla de la lámpara de pantalla. Usaremos el modo **Spin** para el polígonoCSGP y dibujaremos un "trapezoide" <https://en.wikipedia.org/wiki/Trapezoid>`_ mientras que en **Front View** (teclado numérico 1); esta forma se extrudirá alrededor del origen y formará la pantalla de la lámpara.
ja: ランプシェードには CSGPolygon を使います。CSGPolygon を **Spin** モードにし、ビューを前面図 (テンキーの1) にしてから\ `台形 <https://ja.wikipedia.org/wiki/%E5%8F%B0%E5%BD%A2>`_\ を描きましょう。この形状は原点を中心に、回転しながら押し出されてランプシェードを形作ります。
zh_cn: 我们将使用CSGP多边形来制作灯罩。使用 **Spin** 模式，在 **Front View** (数字键盘1)下绘制一个 `trapezoid <https://en.wikipedia.org/wiki/Trapezoid>`_ [梯形]，这个形状将围绕原点挤出，形成灯罩。

source: Adjust the placement of the 3 parts to make it look like a lamp.
es: Ajusta la colocación de las 3 partes para que parezca una lámpara.
ja: ３つのパーツの位置を調整して、ランプに見えるようにします。
zh_cn: 调整3个部分的位置，使其看起来像一盏灯。

source: Create a CSGCombiner and name it ``bookshelf``.
es: Crea un CombinadorCSG y llámalo ``bookshelf``.
ja: CSGCombiner を作り、\ ``bookshelf``\ と名付けます。
zh_cn: 创建一个CSGCombiner，并将其命名为 ``bookshelf`` 。

source: We will use 3 CSGBox nodes for the bookshelf. Create a CSGBox and adjust its dimensions; this will be the size of the bookshelf.
es: Usaremos 3 nodos CSGBox para la estantería. Crea un CSGBox y ajusta sus dimensiones; este será el tamaño de la estantería.
ja: 本棚には３つの CSGBox を使います。CSGBox をひとつ作って、サイズを調節してください。これが本棚のサイズになります。
zh_cn: 我们将为书架使用3个CSGBox节点。创建一个CSGBox并调整其大小，这将是书架的尺寸。

source: Duplicate the CSGBox and shorten the dimensions of each axis and change the mode to **Subtraction**.
es: Duplicar la CSGBox y acortar las dimensiones de cada eje y cambiar el modo a **Sustracción**.
ja: この CSGBox を複製して、すべての軸で縮小させてから、モードを **Subtraction (差)** に変更します。
zh_cn: 复制CSGBox并缩短每个轴的尺寸，并将模式改为 **Subtraction** [减法]。

source: You've almost built a shelf. Create one more CSGBox for dividing the shelf into two levels.
es: Casi has construido un estante. Crea una CSGBox más para dividir el estante en dos niveles.
ja: 本棚はもうすぐ完成です。CSGBox をもうひとつ作成して、棚を二段に分けます。
zh_cn: 你几乎已经建立了一个架子。再创建一个CSGBox，把架子分成两层。

source: Position your furniture in your room as you like and your scene should look this:
es: Ubica los muebles en el cuarto del modo que desees, tu escene debería verse así:
ja: 部屋の中に家具を自由に配置すれば、シーンはこういう風になるはずです。
zh_cn: 根据您的喜好将您的家具放在房间里，您的场景应该是这样的:

source: You've successfully prototyped a room level with the CSG tools in Godot. CSG tools can be used for designing all kinds of levels, such as a maze or a city; explore its limitations when designing your game.
es: Has hecho un prototipo con éxito de una habitación con las herramientas CSG en Godot. Las herramientas CSG pueden utilizarse para diseñar todo tipo de niveles, como un laberinto o una ciudad; explora sus limitaciones a la hora de diseñar tu juego.
ja: これで部屋のレベルのプロトタイプを、Godot の CSG ツールを使って作ることができました。迷路や街など、あらゆる種類のレベルをデザインするのに CSG ツールは使えます。ゲームをデザインするときは、その限界まで探ってみてください。
zh_cn: 你已经成功地用Godot中的CSG工具制作了一个房间关卡的原型。CSG工具可以用于设计各种类型的关卡，如迷宫或城市；在设计游戏时探究它的局限性。

source: Using prototype textures
es: Usando texturas prototipo
zh_cn: 使用原型纹理

source: Godot's :ref:`doc_spatial_material` supports *triplanar mapping*, which can be used to automatically apply a texture to arbitrary objects without distortion. This is handy when using CSG as Godot doesn't support editing UV maps on CSG nodes yet. Triplanar mapping is relatively slow, which usually restricts its usage to organic surfaces like terrain. Still, when prototyping, it can be used to quickly apply textures to CSG-based levels.
es: El :ref:`doc_spatial_material` de Godot soporta *mapeo triplanar*, que puede ser usado para aplicar automáticamente una textura a objetos arbitrarios sin distorsión. Esto es útil cuando se usa CSG ya que Godot no soporta todavía la edición de mapas UV en los nodos CSG. El mapeado triplanar es relativamente lenta, lo que normalmente restringe su uso a superficies orgánicas como el terreno. Aún así, cuando se hacen prototipos, se puede usar para aplicar rápidamente texturas a niveles basados en CSG.
zh_cn: Godot的:ref:`doc_spatial_material`支持*triplanar mapping*，它可以用来自动将纹理应用到任意对象上，而不会发生变形。这在使用CSG时很方便，因为Godot还不支持在CSG节点上编辑UV贴图。三面贴图的速度相对较慢，这通常限制了它的使用，比如地形等有机表面。不过，在原型设计时，还是可以用它来快速将纹理应用到基于CSG的关卡上。【CSG:构造实体几何（Constructive Solid Geometry）的简写】

source: If you need some textures for prototyping, Kenney made a `set of CC0-licensed prototype textures <https://kenney.nl/assets/prototype-textures>`__.
es: Si necesitas algunas texturas para el prototipo, Kenney hizo unas "texturas de prototipo con licencia CC0" <https://kenney.nl/assets/prototype-textures>`__.
zh_cn: 如果你需要一些原型的图片，Kenney做了一套`CC0授权的原型图片<https://kenney.nl/assets/prototype-textures>`__。

source: There are two ways to apply a material to a CSG node:
es: Existen dos modos de aplicar un material a un nodo CSG:
zh_cn: 有两种方法可以将材质应用到CSG节点:

source: Applying it to a CSGCombiner node as a material override (**Geometry > Material Override** in the Inspector). This will affect its children automatically, but will make it impossible to change the material in individual children.
es: Aplicándolo a un nodo CombinadorCSG como sobreescritura de material (**Geometría > Anulación de material** en el Inspector). Esto afectará a sus hijos automáticamente, pero hará imposible cambiar el material en hijos individuales.
zh_cn: 将其作为材质覆盖应用到CSGCombiner节点上（在检查器中的**Geometry > Material Override**）。这将自动影响它的子节点，但能改变单个子节点的材质。

source: Applying a material to individual nodes (**Material** in the Inspector). This way, each CSG node can have its own appearance. Subtractive CSG nodes will apply their material to the nodes they're "digging" into.
es: Aplicando un material a los nodos individuales (**Material** en el Inspector). De esta manera, cada nodo CSG puede tener su propia apariencia. Los nodos CSG sustractivos aplicarán su material a los nodos en los que están "excavando".
zh_cn: 将材质应用于单个节点（**材质**在(属性)检查器中）。这样，每个CSG节点都可以有自己的外观。减去CSG节点将把它们的材质应用到 "digging"到的节点上。
