Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/csg_tools.po
Languages: es, ja, zh_cn

source: To apply triplanar mapping to a CSG node, select it, go to the Inspector, click the **[empty]** text next to **Material Override** (or **Material** for individual CSG nodes). Choose **New SpatialMaterial**. Click the newly created material's icon to edit it. Unfold the **Albedo** section and load a texture into the **Texture** property. Now, unfold the **Uv1** section and check **Triplanar**. You can change the texture offset and scale on each axis by playing with the **Scale** and **Offset** properties just above. Higher values in the **Scale** property will cause the texture to repeat more often.
es: Para aplicar el mapeo triplanar a un nodo CSG, selecciónelo, vaya al Inspector, haga clic en el texto **[vacío]** junto a **Sobreescritura Material** (o **Material** para nodos CSG individuales). Elija **Nuevo Material Espacial**. Haga clic en el icono del material recién creado para editarlo. Despliega la sección **Albedo** y carga una textura en la propiedad **Texture**. Ahora, despliega la sección **Uv1** y marca **Triplanar**. Puedes cambiar el desplazamiento y la escala de la textura en cada eje jugando con las propiedades **Escala** y **Desplazamiento** justo arriba. Valores más altos en la propiedad **Escala** harán que la textura se repita más a menudo.
zh_cn: 要将三平面贴图应用到CSG节点，请选中它，转到 "(属性)检查器"，单击**材料重写**旁边的**[空]**文本（或针对单个CSG节点的**材质**）。选择**新建空间材质**。单击新创建的材质的图标，对其进行编辑。展开**Albedo**部分，将纹理加载到**Texture**属性中。现在，展开**Uv1**部分并选中**Triplanar**。您可以通过上面的 **Scale** 和 **Offset** 属性来改变每个轴上的纹理偏移和比例。在**Scale**属性中，较高的值将导致纹理更频繁地重复。

source: You can copy a SpatialMaterial to reuse it across CSG nodes. To do so, click the dropdown arrow next to a material property in the Inspector and choose **Copy**. To paste it, select the node you'd like to apply the material onto, click the dropdown arrow next to its material property then choose **Paste**.
es: Puedes copiar un MaterialEspacial para reutilizarlo en los nodos del CSG. Para ello, haga clic en la flecha desplegable junto a una propiedad material en el Inspector y elija **Copiar**. Para pegarlo, selecciona el nodo al que quieres aplicar el material, haz clic en la flecha desplegable hacia abajo junto a su propiedad material y elige **Pegar**.
zh_cn: 您可以复制一个 SpatialMaterial，以便在 CSG 节点中重复使用它。要做到这一点，在(属性)检查器中点击材质属性旁边的下拉箭头，然后选择**复制**。要粘贴它，请选择您要应用该材质的节点，单击其材质属性旁边的下拉箭头，然后选择 **粘贴**。
