Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/environment_and_post_processing.po
Languages: es, fr, ja, zh_cn

source: Environment and post-processing
es: Entorno y post proceso
fr: Environnement et post-traitement
ja: 環境とポストプロセッシング
zh_cn: 环境和后处理

source: Environment
es: Entorno
fr: Environnement
ja: 環境
zh_cn: 环境

source: The Environment resource stores all the information required for controlling rendering environment. This includes sky, ambient lighting, tone mapping, effects, and adjustments. By itself it does nothing, but it becomes enabled once used in one of the following locations in order of priority:
es: El recurso Medio Ambiente almacena toda la información necesaria para controlar el medio ambiente de la reproducción. Esto incluye el cielo, la iluminación ambiental, el mapeo de tonos, los efectos y los ajustes. Por sí mismo no hace nada, pero se habilita una vez que se utiliza en uno de los siguientes lugares en orden de prioridad:
fr: La ressource Environnement stocke toutes les informations nécessaires au contrôle de l'environnement de rendu. Cela comprend le ciel, l'éclairage ambiant, la cartographie des tons, les effets et les réglages. Par elle-même, elle ne fait rien, mais elle devient active une fois utilisée dans l'un des endroits suivants par ordre de priorité :
ja: Environment(環境)リソースには、レンダリング環境の制御に必要なすべての情報が格納されます。これには、空、環境光、トーンマッピング、エフェクト、調整が含まれます。それ自体は何もしませんが、次の場所のいずれかで使用されると、優先度順に有効になります:
zh_cn: Environment资源存储控制渲染环境所需的所有信息。 这包括天空，环境照明，色调映射，效果和调整。 它本身什么都不做，但是一旦在以下位置之一中按优先级顺序使用它就会启用:

source: Camera node
es: Nodo Camera
fr: Nœud Camera
ja: Cameraノード
zh_cn: 摄像机节点

source: An Environment can be set to a camera. It will have priority over any other setting.
es: Un ambiente puede ser ajustado a una cámara. Tendrá prioridad sobre cualquier otro ajuste.
fr: Un environnement peut être réglé sur une caméra. Il aura la priorité sur tout autre réglage.
ja: 環境はカメラに設定できます。他の設定よりも優先されます。
zh_cn: 环境可以设置为相机。 它将优先于任何其他设置。

source: This is mostly useful when wanting to override an existing environment, but in general it's a better idea to use the option below.
es: Esto es sobre todo útil cuando se quiere sobreescribir un entorno existente, pero en general es una mejor idea utilizar la opción que figura a continuación.
fr: C'est surtout utile lorsque vous voulez remplacer un environnement existant, mais en général c'est une meilleure idée d'utiliser l'option ci-dessous.
ja: これは、既存の環境をオーバーライドする場合に最も役立ちますが、一般的には以下のオプションを使用することをお勧めします。
zh_cn: 这在想要覆盖现有环境时非常有用，但通常使用下面的选项更好。

source: WorldEnvironment node
es: Nodo WorldEnvironment
fr: Nœud WorldEnvironnement
ja: WorldEnvironmentノード
zh_cn: 世界环境节点

source: The WorldEnvironment node can be added to any scene, but only one can exist per active scene tree. Adding more than one will result in a warning.
es: El nodo WorldEnvironment puede ser añadido a cualquier escena, pero sólo puede existir uno por cada árbol de escena activo. Si se añade más de uno, se producirá una advertencia.
fr: Le nœud WorldEnvironment peut être ajouté à n'importe quelle scène, mais un seul peut exister par arbre de scène actif. Si vous en ajoutez plus d'un, vous recevrez un avertissement.
ja: WorldEnvironmentノードはどのシーンにも追加できますが、アクティブなシーンツリーごとに1つしか存在できません。複数追加すると警告が表示されます。
zh_cn: WorldEnvironment节点可以添加到任何场景，但每个活动场景树只能存在一个。 添加多个将导致警告。

source: Any Environment added has higher priority than the default Environment (explained below). This means it can be overridden on a per-scene basis, which makes it quite useful.
es: Cualquier Medio Ambiente añadido tiene mayor prioridad que el Medio Ambiente por defecto (explicado más abajo). Esto significa que puede ser sobreescrito por cada escena, lo que lo hace bastante útil.
fr: Tout environnement ajouté a une priorité plus élevée que l'environnement par défaut (expliqué ci-dessous). Cela signifie qu'il peut être remplacé par scène, ce qui le rend très utile.
ja: 追加された環境は、デフォルトの環境(以下で説明)よりも高い優先度を持ちます。つまり、シーンごとにオーバーライドできるため、非常に便利です。
zh_cn: 添加的任何环境都具有比默认环境更高的优先级(如下所述)。 这意味着它可以在每个场景的基础上被覆盖，这使它非常有用。

source: Default environment
es: Entorno por defecto
fr: Environnement par défaut
ja: デフォルトの環境
zh_cn: 默认环境

source: A default environment can be set, which acts as a fallback when no Environment was set to a Camera or WorldEnvironment. Just head to Project Settings -> Rendering -> Environment:
es: Se puede establecer un entorno por defecto, que actúa como una alternativa cuando no se ha establecido un entorno en una cámara o en WorldEnvironment. Sólo tienes que ir a Configuración del Proyecto -> Renderización -> Entorno:
fr: Un environnement par défaut peut être défini, ce qui agit comme une solution de repli lorsque aucun environnement n'a été défini sur une caméra ou WorldEnvironment. Il vous suffit de vous rendre dans Paramètres du projet -> Rendu -> Environnement :
ja: デフォルトの環境を設定できます。これは、環境がCameraノードまたはWorldEnvironmentノードに設定されていない場合のフォールバックとして機能します。 [プロジェクト設定] → [Rendering ] → [Environment]に進みます:
zh_cn: 可以设置默认环境，当没有将环境设置为Camera或WorldEnvironment时，该环境可用作后备环境。 只需前往项目设置 ->渲染 ->环境:

source: New projects created from the Project Manager come with a default environment (``default_env.tres``). If one needs to be created, save it to disk before referencing it here.
es: Los nuevos proyectos creados desde el Administrador de Proyectos vienen con un entorno por defecto (``default_env.tres``). Si se necesita crear uno, guárdelo en el disco antes de referenciarlo aquí.
fr: Les nouveaux projets créés à partir du Gestionnaire de projets sont livrés avec un environnement par défaut (``default_env.tres``). S'il est nécessaire d'en créer un, sauvegardez-le sur disque avant de le référencer ici.
ja: プロジェクトマネージャーから作成された新しいプロジェクトには、デフォルトの環境(``default_env.tres``)が付属しています。作成する必要がある場合は、ここで参照する前にディスクに保存してください。
zh_cn: 从项目管理器创建的新项目带有默认环境(``default_env.tres``)。 如果需要创建一个，请将其保存到磁盘，然后再在此处引用它。

source: Environment options
es: Opciones de Environment
fr: Options d'environnement
ja: Environment(環境)のオプション
zh_cn: 环境可选项

source: Following is a detailed description of all environment options and how they are intended to be used.
es: A continuación se describen detalladamente todas las opciones de entorno y la forma en que se pretenden que sean utilizadas.
fr: Vous trouverez ci-dessous une description détaillée de toutes les options d'environnement et de la façon dont elles doivent être utilisées.
ja: 以下は、すべてのEnvironmentのオプションとそれらの使用方法の詳細な説明です。
zh_cn: 以下是所有环境选项的详细说明以及如何使用它们。

source: Background
es: Imagen de fondo
fr: Arrière-plan
ja: Background(背景)
zh_cn: 背景

source: The Background section contains settings on how to fill the background (parts of the screen where objects were not drawn). In Godot 3.0, the background not only serves the purpose of displaying an image or color, it can also change how objects are affected by ambient and reflected light.
es: La sección Fondo contiene ajustes sobre cómo rellenar el fondo (partes de la pantalla en las que no se han dibujado objetos). En Godot 3.0, el fondo no sólo sirve para mostrar una imagen o un color, sino que también puede cambiar la forma en que los objetos se ven afectados por la luz ambiental y reflejada.
fr: La section Arrière-plan contient les paramètres sur la façon de remplir l'arrière-plan (parties de l'écran où les objets n'ont pas été dessinés). Dans Godot 3.0, l'arrière-plan ne sert pas seulement à afficher une image ou une couleur, il peut aussi changer la façon dont les objets sont affectés par la lumière ambiante et réfléchie.
ja: Backgroundセクションには、背景(オブジェクトが描画されなかった画面の一部)を塗りつぶす方法に関する設定が含まれています。Godot 3.0では、背景は画像や色を表示するだけでなく、環境光や反射光によるオブジェクトへの影響を変えることもできます。

source: There are many ways to set the background:
es: Hay muchas maneras de establecer el fondo:
fr: Il y a plusieurs façons de régler l'arrière-plan :
ja: 背景を設定するには多くの方法があります:
zh_cn: 设置背景的方法有很多种:

source: **Clear Color** uses the default clear color defined by the project. The background will be a constant color.
es: **Color claro** utiliza el color claro por defecto definido por el proyecto. El fondo será de un color constante.
fr: **Clear Color** utilise la couleur claire par défaut définie par le projet. L'arrière-plan sera d'une couleur constante.
ja: **Clear Color** は、プロジェクトで定義されているデフォルトのクリアカラーを使用します。背景は一定の色になります。
zh_cn: ** Clear Color **使用项目定义的默认清晰颜色。 背景将是恒定的颜色。

source: **Custom Color** is like Clear Color, but with a custom color value.
es: **Color personalizado** es como el color claro, pero con un valor de color personalizado.
fr: **Couleur personnalisée** comme Clear Color, mais avec une valeur de couleur personnalisée.
ja: **Custom Color** はクリアカラーに似ていますが、カスタムカラー値を持ちます。

source: **Sky** lets you define a panorama sky (a 360 degree sphere texture) or a procedural sky (a simple sky featuring a gradient and an optional sun). Objects will reflect it and absorb ambient light from it.
es: **Cielo** permite definir un cielo panorámico (una textura de esfera de 360 grados) o un cielo procedimental (un cielo simple con un gradiente y un sol opcional). Los objetos lo reflejarán y absorberán la luz ambiental de él.
fr: **Sky** vous permet de définir un ciel panoramique (une texture de sphère de 360 degrés) ou un ciel procédural (un ciel simple avec un dégradé et un soleil en option). Les objets le reflètent et absorbent la lumière ambiante.
ja: **Sky** では、パノラマの空(360度の球体テクスチャ）または手続き型の空(グラデーションとオプションの太陽を備えたシンプルな空)を定義できます。オブジェクトはそれを反射し、そこから環境光を吸収します。
zh_cn: ** Sky **可让您定义全景天空(360度球体纹理)或程序天空(具有渐变和可选太阳的简单天空)。 物体将反射它并从中吸收环境光。

source: **Color+Sky** lets you define a sky (as above), but uses a constant color value for drawing the background. The sky will only be used for reflection and ambient light.
es: **Color+Cielo** te permite definir un cielo (como arriba), pero usa un valor de color constante para dibujar el fondo. El cielo sólo se usará para la reflexión y la luz ambiental.
fr: **Couleur+Ciel** vous permet de définir un ciel (comme ci-dessus), mais utilise une valeur de couleur constante pour dessiner le fond. Le ciel ne sera utilisé que pour la réflexion et la lumière ambiante.
ja: **Color+Sky** では(上記のように)空を定義できますが、背景の描画には一定の色値を使用します。空は反射光と環境光にのみ使用されます。

source: Ambient Light
es: Luz ambiental
fr: Lumière ambiante
ja: Ambient Light(環境光)
zh_cn: 环境光

source: Ambient (as defined here) is a type of light that affects every piece of geometry with the same intensity. It is global and independent of lights that might be added to the scene.
es: El ambiente (como se define aquí) es un tipo de luz que afecta a cada pieza de la geometría con la misma intensidad. Es global e independiente de las luces que se puedan añadir a la escena.
fr: L'ambiante (tel que défini ici) est un type de lumière qui affecte chaque pièce de la géométrie avec la même intensité. Elle est globale et indépendante des lumières qui pourraient être ajoutées à la scène.
ja: Ambient(ここで定義)は、同じ強度ですべてのジオメトリに影響するライトの一種です。これはグローバルであり、シーンに追加される可能性のあるライトとは無関係です。
zh_cn: 环境(如此处定义)是一种光，它影响具有相同强度的每个几何体。 它是全局的，独立于可能添加到场景中的灯光。

source: There are two types of ambient light: the *Ambient Color* (which is a constant color multiplied by the material albedo) and then one obtained from the *Sky* (as described before, but a sky needs to be set as background for this to be enabled).
es: Hay dos tipos de luz ambiental: el *Color Ambiente* (que es un color constante multiplicado por el albedo material) y luego uno obtenido del *Cielo* (como se describió anteriormente, pero es necesario establecer un cielo como fondo para que esto se habilite).
fr: Il existe deux types de lumière ambiante : la *Couleur ambiante* (qui est une couleur constante multipliée par l'albédo du matériau) et celle obtenue à partir du *Sky* (comme décrit précédemment, mais un ciel doit être défini comme fond pour que cela soit activé).
ja: 環境光には2つのタイプがあります: *Ambient Color* (マテリアルのアルベドに乗算する一定の色です)、および *Sky* から取得したもの(前述のように、これを有効にするには、空を背景として設定する必要があります)。
zh_cn: 有两种类型的环境光: *环境色* (恒定颜色乘以材质反照率)，然后从 *天空* 获得一个(如前所述，但天空需要设置为背景) 启用)。

source: When a *Sky* is set as background, it's possible to blend between ambient color and sky using the **Sky Contribution** setting (this value is 1.0 by default for convenience, so only the sky affects objects).
es: Cuando se establece un *Cielo* como fondo, es posible mezclar entre el color del ambiente y el cielo usando la configuración de **Contribución al cielo** (este valor es 1.0 por defecto por conveniencia, así que sólo el cielo afecta a los objetos).
fr: Lorsqu'un *Sky* est défini comme arrière-plan, il est possible de fusionner la couleur ambiante et le ciel à l'aide du paramètre **Sky Contribution** (cette valeur est 1.0 par défaut par commodité, donc seul le ciel affecte les objets).
ja: *Sky* を背景として設定すると、\ **Sky Contribution** 設定を使用して環境色と空をブレンドできます(便宜上、この値はデフォルトでは1.0であるため、空のみがオブジェクトに影響します)。

source: Here is a comparison of how different ambient light affects a scene:
es: Aquí hay una comparación de cómo distinta luz ambiental afecta a una escena:
fr: Voici une comparaison montrant comment différentes lumières ambiantes affectent la scène :
ja: 異なる環境光がシーンに与える影響の比較は次のとおりです:
zh_cn: 以下是不同环境光对场景的影响比较:

source: In general, ambient light should only be used for simple scenes, large exteriors, or for performance reasons (ambient light is cheap), as it does not provide the best lighting quality. It's better to generate ambient light from ReflectionProbe or GIProbe, which will more faithfully simulate how indirect light propagates. Below is a comparison, in terms of quality, between using a flat ambient color and a GIProbe:
es: En general, la luz ambiental sólo debe utilizarse para escenas sencillas, grandes exteriores o por razones de rendimiento (la luz ambiental es barata), ya que no proporciona la mejor calidad de iluminación. Es mejor generar luz ambiental a partir de la ReflectionProbe o GIProbe, que simulará más fielmente cómo se propaga la luz indirecta. A continuación se muestra una comparación, en términos de calidad, entre el uso de un color ambiental plano y una GIProbe:
fr: En général, la lumière ambiante ne devrait être utilisée que pour des scènes simples, espaces extérieurs, ou pour des raisons de performance (la lumière ambiante est peu cher), car cela ne donne pas le meilleur rendu. Le mieux est de générer la lumière ambiante à partir de ReflectionProbe ou de GIProbe, cela donnera un rendu plus fidèle de la propagation de la lumière. Ci-dessous voici une comparaison en terme de qualité entre la lumière ambiante plate (flat) et GIProbe :
ja: 一般に、環境光は、最高の照明品質を提供しないため、単純なシーン、大きなエクステリア、またはパフォーマンス上の理由(環境光はレンダリングコストが安い)に対してのみ使用する必要があります。 ReflectionProbeまたはGIProbeから環境光を生成すると、間接光がどのように伝播するかをより忠実にシミュレートできます。以下は、均一な環境色とGIProbeを使用した場合の品質の比較です:

source: Using one of the methods described above, objects get constant ambient lighting replaced by ambient light from the probes.
es: Utilizando uno de los métodos descritos anteriormente, los objetos obtienen una luz ambiental constante reemplazada por la luz ambiental de las sondas.
fr: En utilisant une des méthodes décrites ci-dessus, les objets reçoivent une lumière ambiante constante remplacé par la lumière ambiante des probes.
ja: 上記の方法のいずれかを使用すると、オブジェクトは一定した環境光をプローブからの環境光に置き換えます。
zh_cn: 使用上述方法之一，物体获得恒定的环境照明，由来自探头的环境光代替。

source: Fog
es: Niebla
fr: Brouillard
ja: Fog(霧)
zh_cn: 雾

source: Fog, as in real life, makes distant objects fade away into an uniform color. The physical effect is actually pretty complex, but Godot provides a good approximation. There are two kinds of fog in Godot:
es: La niebla, como en la vida real, hace que los objetos distantes se desvanezcan en un color uniforme. El efecto físico es en realidad bastante complejo, pero Godot proporciona una buena aproximación. Hay dos tipos de niebla en Godot:
fr: Le brouillard, comme dans la vie réelle, fait disparaître des objets éloignés dans une couleur uniforme. L'effet physique est en fait assez complexe, mais Godot fournit une bonne approximation. Il y a deux sortes de brouillard dans Godot :
ja: 霧は、実生活と同様に、遠くのオブジェクトを均一な色にフェードアウトさせます。物理的な効果は実際にはかなり複雑ですが、Godotは適切な近似を提供します。 Godotには2種類の霧があります:
zh_cn: 雾，就像在现实生活中一样，使远处的物体逐渐消失成均匀的颜色。 物理效果实际上非常复杂，但Godot提供了一个很好的近似。 Godot有两种雾:

source: **Depth Fog:** This one is applied based on the distance from the camera.
es: **Niebla profunda:** Esta se aplica en base a la distancia de la cámara.
fr: **Depth Fog:** Celui-ci est appliqué en fonction de la distance de la caméra.
ja: **Depth Fog:** これはカメラからの距離に基づいて適用されます。
zh_cn: **深度雾:** 这个基于距相机的距离来应用。

source: **Height Fog:** This one is applied to any objects below (or above) a certain height, regardless of the distance from the camera.
es: **Niebla de altura:** Esta se aplica a cualquier objeto que esté por debajo (o por encima) de una cierta altura, independientemente de la distancia de la cámara.
fr: **Height Fog:** Celui-ci est appliqué à tout objet situé au-dessous (ou au-dessus) d'une certaine hauteur, quelle que soit la distance qui le sépare de la caméra.
ja: **Height Fog:** これは、カメラからの距離に関係なく、特定の高さの下(または上)のオブジェクトに適用されます。
zh_cn: **高度雾:** 此高度应用于任何低于(或高于)某个高度的物体，无论距离相机的距离如何。

source: Both of these fog types can have their curve tweaked, making their transition more or less sharp.
es: A estos dos tipos de niebla se les puede ajustar su curva, haciendo su transición más o menos aguda.
fr: Ces deux types de brouillard peuvent avoir leur courbe modifiée, ce qui rend leur transition plus ou moins nette.
ja: これらの霧のタイプは両方とも、カーブを微調整して、トランジションを多少シャープにすることができます。
zh_cn: 这两种雾类型都可以调整它们的曲线，使它们的过渡或多或少变得清晰。

source: Two properties can be tweaked to make the fog effect more interesting:
es: Dos propiedades pueden ser ajustadas para hacer el efecto de la niebla más interesante:
fr: Deux propriétés peuvent être modifiées pour rendre l’effet de brouillard plus intéressant :
ja: 霧の効果をさらに面白くするために、2つのプロパティを調整できます:
zh_cn: 可以调整两个属性以使雾效果更有趣:

source: The first is **Sun Amount**, which makes use of the Sun Color property of the fog. When looking towards a directional light (usually a sun), the color of the fog will be changed, simulating the sunlight passing through the fog.
es: El primero es **Sun Amount**, que utiliza la propiedad Sun Color de la niebla. Cuando se mira hacia una luz direccional (normalmente un sol), el color de la niebla se cambia, simulando la luz del sol que pasa a través de la niebla.
fr: La première est * * Sun amount * *, qui utilise la propriété Sun Color du brouillard. En regardant vers une lumière directionnelle (généralement un soleil), la couleur du brouillard sera changée, simulant la lumière du soleil passant à travers le brouillard.
ja: 1つ目は **Sun Amount** で、霧のSun Colorプロパティを使用します。指向性ライト(通常は太陽)を見ると、フォグの色が変わり、フォグを通過する日光をシミュレートします。
zh_cn: 第一个是 **太阳量** ，它利用雾的太阳颜色属性。 当朝向定向光(通常是太阳)时，雾的颜色将会改变，模拟穿过雾的阳光。

source: The second is **Transmit Enabled** which simulates more realistic light transmittance. In practice, it makes light stand out more across the fog.
es: El segundo es **Transmisión habilitada** que simula una transmisión de luz más realista. En la práctica, hace que la luz destaque más a través de la niebla.
fr: La seconde est * * transmission Enabled * * qui simule une transmittance de la lumière plus réaliste. Dans la pratique, cela rend la lumière plus visible dans le brouillard.
ja: 2つ目は **Transmit Enabled** で、より現実的な光透過率をシミュレートします。実際には、霧の中で光をより際立たせます。
zh_cn: 第二个是** Transmit Enabled **，模拟更逼真的透光率。 在实践中，它使光线在雾中更加突出。

source: Tonemap
es: Mapa de tono
ja: Tonemap(トーンマップ)
zh_cn: 品质图

source: *This feature is only available when using the GLES3 backend.*
es: *Esta característica sólo está disponible cuando se utiliza el backend GLES3.*
fr: *Cette fonction est disponible uniquement en utilisant l'arrière-plan GLES3*
ja: *この機能は、GLES3バックエンドを使用している場合にのみ使用できます。*

source: Selects the tone-mapping curve that will be applied to the scene, from a short list of standard curves used in the film and game industry. Tone mapping can make light and dark areas more homogeneous, even though the result is not that strong. Tone mapping options are:
es: Selecciona la curva del mapa de tonos que se aplicará a la escena, de una corta lista de curvas estándar utilizadas en la industria del cine y los juegos. El mapeo de tonos puede hacer más homogéneas las áreas claras y oscuras, aunque el resultado no sea tan fuerte. Las opciones de mapeo de tonos son:
fr: Sélectionne la courbe de tone-mapping qui sera appliquée à la scène, à partir d’une courte liste de courbes standard utilisées dans l’industrie du film et du jeu. Le tone-mapping peut rendre les zones claires et sombres plus homogènes, même si le résultat n’est pas très bon. Les options de tone-mapping sont :
ja: 映画およびゲーム業界で使用される標準曲線の短いリストから、シーンに適用されるトーンマッピング曲線を選択します。トーンマッピングは、結果がそれほど強くない場合でも、明るい領域と暗い領域をより均一にすることができます。トーンマッピングオプションは次のとおりです:
zh_cn: 从电影和游戏行业中使用的标准曲线的简短列表中选择将应用于场景的色调映射曲线。 色调映射可以使亮区和暗区更均匀，即使结果不那么强。 色调映射选项包括:

source: **Mode:** Tone mapping mode, which can be Linear, Reindhart, Filmic, or Aces.
es: **Modo:** Modo de mapeo de tonos, que puede ser Lineal, Reindhart, Fílmico o Ases.
fr: **Mode:** Le mode de Tone mapping , peut être Linear, Reindhart, Filmic, or Aces.
ja: **Mode:** トーンマッピングモード、Linear、Reindhart、Filmic、またはAcesのいずれかです。
zh_cn: **模式:** 色调映射模式，可以是线性，Reindhart，Filmic或Aces。

source: **Exposure:** Tone mapping exposure which simulates amount of light received over time.
es: **Exposición:** Exposición de mapeo de tonos que simula la cantidad de luz recibida a lo largo del tiempo.
fr: **Exposure:** Tone mapping exposure qui simule la quantité de lumière reçue au fil du temps.
ja: **Exposure:** トーンマッピング露出は時間の経過に従って受信する光の量(露光量)をシミュレートします。
zh_cn: **曝光:** 色调映射曝光，模拟随时间接收的光量。

source: **White:** Tone mapping white, which simulates where in the scale white is located (by default 1.0).
es: **Blanco:** Tono de mapeo de blanco, que simula en qué lugar de la escala se encuentra el blanco (por defecto 1.0).
fr: **White:** Tone Mapping blanc, qui simule où blanc est situé dans l’échelle (par défaut 1,0).
ja: **White:** トーンマッピングの白。スケールの白の位置をシミュレートします(デフォルトでは1.0)。

source: Auto Exposure (HDR)
es: Exposición automática (HDR)
fr: Exposition automatique (HDR)
ja: 自動露出(HDR)
zh_cn: 自动曝光(HDR)

source: Even though, in most cases, lighting and texturing are heavily artist controlled, Godot supports a simple high dynamic range implementation with the auto exposure mechanism. This is generally used for the sake of realism when combining interior areas with low light and outdoors. Auto exposure simulates the camera (or eye) in an effort to adapt between light and dark locations and their different amounts of light.
es: Aunque, en la mayoría de los casos, la iluminación y la textura están fuertemente controladas por el artista, Godot apoya una simple implementación de alto rango dinámico con el mecanismo de auto exposición. Esto se usa generalmente por el bien del realismo cuando se combinan áreas interiores con poca luz y al aire libre. La autoexposición simula la cámara (o el ojo) en un esfuerzo por adaptarse entre los lugares claros y oscuros y sus diferentes cantidades de luz.
fr: Même si, dans la plupart des cas, l’éclairage et la texturation sont fortement contrôlés par les artistes, Godot permet une mise en œuvre simple du HDR (high dynamic range) avec le mécanisme d’exposition automatique. Ceci est généralement utilisé dans un souci de réalisme lors de la combinaison d'espace intérieures faiblement éclairé et d'extérieur. L’exposition automatique simule la caméra (ou l’œil) qui s'efforce de s’adapter entre les zones clairs et sombres et leurs différentes quantités de lumière.
ja: ほとんどの場合、照明とテクスチャリングはアーティストによって厳しく制御されますが、Godotは自動露出メカニズムを備えたシンプルなハイダイナミックレンジの実装をサポートしています。これは一般に、暗い場所や屋外で屋内エリアを組み合わせるときにリアリズムのために使用されます。自動露出は、明るい場所と暗い場所、および異なる光量の間を適応させるために、カメラ(または目)をシミュレートします。
zh_cn: 尽管在大多数情况下，照明和纹理都受到艺术家的严格控制，但Godot通过自动曝光机制支持简单的高动态范围实现。 当将内部区域与低光和户外相结合时，这通常用于真实性。 自动曝光模拟相机(或眼睛)，以适应明暗位置和不同光量。
