Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/environment_and_post_processing.po
Languages: es, fr, ja, zh_cn

source: The **Amount** parameter controls the amount of blur. For larger blurs, tweaking the **Quality** may be needed in order to avoid artifacts.
es: El parámetro **Cantidad** controla la cantidad de borrosidad. Para desenfoques más grandes, puede ser necesario ajustar el parámetro **Calidad** para evitar los artefactos.
fr: Le paramètre **Amount** contrôle la quantité de flou. Pour les flous plus importants, il peut être nécessaire d'ajuster la **Quality** afin d'éviter les artefacts.
ja: **Amount** パラメーターは、ぼかしの量を制御します。大きなぼかしの場合、アーティファクトを回避するために **Quality** の調整が必要になる場合があります。
zh_cn: ** Amount **参数控制模糊量。 对于较大的模糊，可能需要调整 **质量** 以避免伪影。

source: Depth of Field / Near Blur
es: Profundidad de campo / Casi borrosa
fr: Profondeur de champ / flou de proximité
ja: 被写界深度(DOF)/近方ぼかし(Near Blur)
zh_cn: 景深/近模糊

source: This effect simulates focal distance on high end cameras. It blurs objects close to the camera (acts in the opposite direction as far blur). It has an initial **Distance** with a **Transition** region (in world units):
es: Este efecto simula la distancia focal de las cámaras de alta gama. Desenfoca los objetos cercanos a la cámara (actúa en la dirección opuesta como desenfoque lejano). Tiene una **Distancia** inicial con una región de **Transición** (en unidades mundiales):
fr: Cet effet simule la distance focale sur les appareils photo haut de gamme. Il brouille les objets à proximité de l'appareil photo (agit dans la direction opposée jusqu'au flou). Il a une **Distance** initiale avec une région de **Transition** (en unités mondiales) :
ja: このエフェクトは、ハイエンドカメラの焦点距離をシミュレートします。カメラに近いオブジェクトをぼかします(遠方ぼかしとは反対方向に作用します)。\ **Transition**(遷移)領域(ワールド単位)を持つ 開始 **Distance**(距離) を持っています:
zh_cn: 此效果可模拟高端相机的焦距。 它使靠近相机的物体模糊(在远处模糊的相反方向上作用)。 它有一个** **距离**， **过渡** 区域(世界单位):

source: It is common to use both blurs together to focus the viewer's attention on a given object:
es: Es común utilizar ambos desenfoques juntos para enfocar la atención del espectador en un objeto determinado:
fr: Il est courant d'utiliser les deux flous ensemble pour concentrer l'attention du spectateur sur un objet donné :
ja: 両方のぼかしを一緒に使用して、特定のオブジェクトに視聴者の注意を集中させる使い方が一般的です:
zh_cn: 通常使用两种模糊将观众的注意力集中在给定对象上:

source: Glow
es: Brillo
fr: Lueur
ja: Glow(にじみ/発光)
zh_cn: 辉光

source: In photography and film, when light amount exceeds the maximum supported by the media (be it analog or digital), it generally bleeds outwards to darker regions of the image. This is simulated in Godot with the **Glow** effect.
es: En la fotografía y el cine, cuando la cantidad de luz excede el máximo soportado por el medio (ya sea analógico o digital), generalmente se desangra hacia fuera a las regiones más oscuras de la imagen. Esto se simula en Godot con el efecto **Brillo**.
fr: En photographie et en film, lorsque la quantité de lumière dépasse le maximum supporté par le support (qu'il soit analogique ou numérique), elle se dirige généralement vers des zones plus sombres de l'image. Ceci est simulé dans Godot avec l'effet **Glow**.
ja: 写真やフィルムでは、光量がメディアでサポートされている最大値(アナログまたはデジタル)を超えると、一般に画像の暗い領域に向かって外側ににじみます。これは、\ **Glow** エフェクトを使用してGodotでシミュレートされます。
zh_cn: 在摄影和胶片中，当光量超过介质支持的最大值(无论是模拟还是数字)时，它通常会向外渗出到图像的较暗区域。 这是在Godot中用** Glow **效果模拟的。

source: By default, even if the effect is enabled, it will be weak or invisible. One of two conditions need to happen for it to actually show:
es: Por defecto, aunque el efecto esté activado, será débil o invisible. Una de las dos condiciones necesarias para que se muestre realmente:
fr: Par défaut, même si l'effet est activé, il sera faible ou invisible. L'une ou l'autre de ces deux conditions doit se produire pour qu'il soit vraiment visible :
ja: デフォルトでは、エフェクトが有効になっていても、効果が弱いか見えません。実際に表示するには、次の2つの条件のいずれかが必要です:
zh_cn: 默认情况下，即使启用了效果，它也会变弱或不可见。 实际显示它需要发生的两个条件之一:

source: The light in a pixel surpasses the **HDR Threshold** (where 0 is all light surpasses it, and 1.0 is light over the tonemapper **White** value). Normally, this value is expected to be at 1.0, but it can be lowered to allow more light to bleed. There is also an extra parameter, **HDR Scale**, that allows scaling (making brighter or darker) the light surpassing the threshold.
es: La luz en un píxel sobrepasa el **HDR Threshold** (donde 0 es que toda la luz lo sobrepasa, y 1.0 es que la luz sobrepasa el valor **White** del mapa de tonos). Normalmente, se espera que este valor esté en 1.0, pero puede ser reducido para permitir que más luz se desplace. También hay un parámetro extra, **Escala HDR**, que permite escalar (haciendo más brillante u oscuro) la luz que supera el umbral.
fr: La lumière dans un pixel dépasse le seuil **HDR** (où 0 est toute la lumière le dépasse, et 1.0 est la lumière au-dessus de la valeur de tonemapper **White**). Normalement, on s'attend à ce que cette valeur soit de 1,0, mais elle peut être abaissée pour permettre à plus de lumière de saigner. Il existe également un paramètre supplémentaire, **HDR Scale**, qui permet de mettre à l'échelle (éclaircir ou assombrir) la lumière qui dépasse le seuil.
ja: ピクセル内の光が **HDR Threshold** を超えている(0はすべてのライトを超え、1.0はトーンマッパー **White** の値を超えています)。通常、この値は1.0であると予想されますが、より多くの光を放出できるように下げることができます。また、\ **HDR Scale** という追加のパラメーターがあり、しきい値を超える光のスケーリング(明るくまたは暗くする)を可能にします。

source: The Bloom effect has a value set greater than 0. As it increases, it sends the whole screen to the glow processor at higher amounts.
es: El efecto Bloom tiene un valor fijado en más de 0. A medida que aumenta, envía toda la pantalla al procesador de brillo en cantidades más altas.
fr: L'effet Bloom a une valeur supérieure à 0 et, à mesure qu'il augmente, il envoie l'ensemble de l'écran au processeur de luminescence à des valeurs plus élevées.
ja: Bloomエフェクトの値が0より大きい値に設定されている。値が大きくなると、画面全体がグロープロセッサーに大量に送信されます。
zh_cn: Bloom效果的值设置大于0.随着它的增加，它会以更高的数量将整个屏幕发送到辉光处理器。

source: Both will cause the light to start bleeding out of the brighter areas.
es: Ambos provocarán que la luz empiece a emitirse en las zonas más brillantes.
fr: Dans les deux cas, la lumière commencera à saigner hors des zones les plus claires.
ja: 両方とも、明るい部分から光がにじみ出始めます。
zh_cn: 两者都会导致光从较亮的区域开始流血。

source: Once glow is visible, it can be controlled with a few extra parameters:
es: Una vez que el resplandor es visible, puede ser controlado con algunos parámetros adicionales:
fr: Une fois que la lueur est visible, elle peut être contrôlée avec quelques paramètres supplémentaires :
ja: Glowが表示されたら、いくつかの追加パラメーターで制御できます:
zh_cn: 一旦看到发光，就可以通过一些额外的参数来控制它:

source: **Intensity** is an overall scale for the effect, it can be made stronger or weaker (0.0 removes it).
es: **Intensidad** es una escala general para el efecto, puede hacerse más fuerte o más débil (0.0 lo elimina).
fr: **Intensity** est une échelle globale de l'effet, elle peut être renforcée ou affaiblie (0,0 l'élimine).
ja: **Intensity** はエフェクトの全体的な尺度であり、より強くまたはより弱くすることができます(0.0に設定すると削除します)。
zh_cn: **强度**是效果的整体比例，可以更强或更弱(0.0将其移除)。

source: **Strength** is how strong the gaussian filter kernel is processed. Greater values make the filter saturate and expand outwards. In general, changing this is not needed, as the size can be more efficiently adjusted with the **Levels**.
es: **Fuerza** es la fuerza con la que se procesa el núcleo del filtro gaussiano. Valores mayores hacen que el filtro se sature y se expanda hacia afuera. En general, no es necesario cambiar esto, ya que el tamaño puede ser ajustado más eficientemente con los **Niveles**.
fr: **Strength** est la force avec laquelle le noyau du filtre gaussien est traité. Des valeurs plus élevées rendent le filtre saturé et le font se dilater vers l'extérieur. En général, il n'est pas nécessaire de changer cela, car la taille peut être ajustée plus efficacement avec les **Niveaux**.
ja: **Strength** ガウスフィルターカーネルが処理される強度です。値を大きくすると、フィルターが飽和して外側に拡張します。一般に、\ **Levels** でサイズをより効率的に調整できるため、これを変更する必要はありません。

source: The **Blend Mode** of the effect can also be changed:
es: El **Modo de mezcla** del efecto también puede ser cambiado:
fr: Le **Blend Mode** de l'effet peut également être modifié :
ja: エフェクトの **Blend Mode** も変更できます:
zh_cn: 效果的 **混合模式** 也可以改变:

source: **Additive** is the strongest one, as it just adds the glow effect over the image with no blending involved. In general, it's too strong to be used, but can look good with low intensity Bloom (produces a dream-like effect).
fr: **Additive** est le plus fort, car il ajoute simplement l'effet de lueur sur l'image sans qu'il n'y ait de mélange. En général, il est trop fort pour être utilisé, mais il peut être beau avec une faible intensité Bloom (produit un effet de rêve).
ja: **Additive** は、ブレンドを行わずに画像にグロー効果を加算するだけなので、最も強力です。一般的に使用するには効果が強すぎますが、低強度のブルームでは見栄えがよくなります(夢のような効果が得られます)。

source: **Screen** is the default one. It ensures glow never brights more than itself and works great as an all around.
fr: **Screen** est celui par défaut. Il assure que la lueur ne brille jamais plus que lui-même et fonctionne très bien comme un tout autour.
ja: **Screen** がデフォルトです。それはGlowがそれ自体よりも明るくならないことを保証し、すべての周囲で素晴らしい働きをします。
zh_cn: **屏幕**是默认值。 它确保发光永远不会比自身更亮，并且可以很好地作为一个整体。

source: **Softlight** is the weakest one, producing only a subtle color disturbance around the objects. This mode works best on dark scenes.
fr: **Softlight** est la plus faible, ne produisant qu'une subtile perturbation des couleurs autour des objets. Ce mode fonctionne mieux sur les scènes sombres.
ja: **Softlight** は最も弱いもので、オブジェクトの周囲にわずかな色の乱れしか生じません。このモードは暗いシーンに最適です。
zh_cn: ** Softlight **是最弱的一种，只会在物体周围产生微妙的色彩干扰。 此模式在黑暗场景中效果最佳。

source: **Replace** can be used to blur the whole screen or debug the effect. It just shows the glow effect without the image below.
fr: **Replace** peut être utilisé pour brouiller tout l'écran ou déboguer l'effet. Il montre simplement l'effet de lueur sans l'image ci-dessous.
ja: **Replace** は、画面全体をぼかす、または効果をデバッグするために使用できます。下地の画像なしでグローエフェクトを表示します。
zh_cn: **替换**可用于模糊整个屏幕或调试效果。 它只显示没有下图的发光效果。

source: To change the glow effect size and shape, Godot provides **Levels**. Smaller levels are strong glows that appear around objects, while large levels are hazy glows covering the whole screen:
es: Para cambiar el tamaño y la forma del efecto de brillo, Godot proporciona **Niveles**. Los niveles más pequeños son fuertes brillos que aparecen alrededor de los objetos, mientras que los niveles grandes son brillos nebulosos que cubren toda la pantalla:
fr: Pour modifier la taille et la forme de l'effet lumineux, Godot propose **Levels**. Les petits niveaux sont des lueurs fortes qui apparaissent autour des objets, tandis que les grands niveaux sont des lueurs floues qui couvrent l'ensemble de l'écran :
ja: グローエフェクトのサイズと形状を変更するために、Godotは **Levels** を提供します。小さなレベルはオブジェクトの周りに現れる強い輝きであり、大きいレベルは画面全体を覆うかすんだ輝きです。

source: The real strength of this system, though, is to combine levels to create more interesting glow patterns:
es: La verdadera fuerza de este sistema, sin embargo, es combinar los niveles para crear patrones de brillo más interesantes:
fr: La vraie force de ce système, cependant, est de combiner les niveaux pour créer des motifs lumineux plus intéressants :
ja: ただし、このシステムの本当の長所は、複数のレベルを組み合わせてより興味深いグローパターンを作成することです:
zh_cn: 然而，这个系统的真正优势在于结合水平来创造更有趣的发光模式:

source: Finally, as the highest layers are created by stretching small blurred images, it is possible that some blockiness may be visible. Enabling **Bicubic Upscaling** gets rids of it, at a minimal performance cost.
fr: Enfin, comme les couches les plus hautes sont créées en étirant les petites images floues, il est possible que certains blocs soient visibles. L'activation de **Bicubic Upscaling** permet de s'en débarrasser, à un coût de performance minimal.
ja: 最後に、小さなぼかした画像を引き伸ばすことによって最上位のレイヤーが作成されるため、何らかのブロックが見える可能性があります。\ **Bicubic Upscaling** を有効にすると、最小限のパフォーマンスコストでそれが削除されます。
zh_cn: 最后，由于通过拉伸小的模糊图像来创建最高层，因此可能会看到一些块状。 启用** Bicubic Upscaling **会以最低的性能成本获取它。

source: Adjustments
es: Ajustes
fr: Ajustements
ja: Adjustments(調整)
zh_cn: 调整

source: At the end of processing, Godot offers the possibility to do some standard image adjustments.
es: Al final del procesamiento, Godot ofrece la posibilidad de hacer algunos ajustes de imagen estándar.
fr: A la fin du traitement, Godot offre la possibilité d'effectuer quelques réglages standard d'image.
ja: 処理の最後に、Godotはいくつかの標準的な画像調整を行う可能性を提供します。
zh_cn: 在处理结束时，Godot提供了进行一些标准图像调整的可能性。

source: The first one is being able to change the typical Brightness, Contrast, and Saturation:
es: La primera es poder cambiar el típico Brillo, Contraste y Saturación:
fr: La première est la possibilité de modifier la luminosité, le contraste et la saturation typiques :
ja: 1つ目は、一般的なBrightness(明るさ)、Contrast(コントラスト)、Saturation(彩度)を変更できることです:
zh_cn: 第一个是能够改变典型的亮度，对比度和饱和度:

source: The second is by supplying a color correction gradient. A regular black to white gradient like the following one will produce no effect:
es: La segunda es proporcionando un gradiente de corrección de color. Un gradiente regular de negro a blanco como el siguiente no producirá ningún efecto:
fr: La seconde est de fournir un dégradé de correction de couleur. Un dégradé noir à blanc régulier comme celui qui suit ne produira aucun effet :
ja: 2つ目は、色補正のグラデーションを指定することです。次のような通常の黒から白へのグラデーションでは効果がありません:
zh_cn: 第二种是通过提供颜色校正梯度。 如下所示的常规黑色到白色渐变将不起作用:

source: But creating custom ones will allow to map each channel to a different color:
es: Pero la creación de los personalizados permitirá mapear cada canal a un color diferente:
fr: Mais la création de canaux personnalisés permettra de mapper chaque canal à une couleur différente :
ja: しかし、カスタムのものを作成すると、各チャンネルを異なる色にマップすることができます:
zh_cn: 但是创建自定义的会允许将每个通道映射到不同的颜色:

source: Godot 3 provides a redesigned Environment resource, as well as a brand new post-processing system with many available effects right out of the box.
fr: Godot 3 fournit une ressource Environnement repensée, ainsi qu'un tout nouveau système de post-traitement avec de nombreux effets disponibles directement.
zh_cn: Godot 3提供了重新设计的环境资源，以及一个全新的后期处理系统，其开箱即用，具有许多可用的效果。

source: Finally there is an **Energy** setting, which is a multiplier, useful when working with HDR.
fr: Enfin, il y a un paramètre **Énergie**, qui est un facteur multiplicatif, utile lorsque l'on travaille en HDR.

source: Godot 3 provides a redesigned Environment resource, as well as a new post-processing system with many available effects right out of the box.
es: Godot 3 proporciona un recurso ambiental rediseñado, así como un nuevo sistema de post-procesamiento con muchos efectos disponibles de inmediato.

source: Finally, there is an **Energy** setting, which is a multiplier. It's useful when working with HDR.
es: Finalmente, hay un ajuste de **Energía**, que es un multiplicador. Es útil cuando se trabaja con HDR.

source: Finally, as the highest layers are created by stretching small blurred images, it is possible that some blockiness may be visible. Enabling **Bicubic Upscaling** gets rids of it, at a minimal performance cost. *Note that this is effective only when using the GLES3 backend.*
es: Finalmente, como las capas más altas se crean estirando pequeñas imágenes borrosas, es posible que se vea algún bloqueo. Habilitar la **Escalada Bicúbica** se deshace de ella, con un coste de rendimiento mínimo. *Nota que esto es efectivo sólo cuando se utiliza el backend GLES3.*
