Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/environment_and_post_processing.po
Languages: es, fr, ja, zh_cn

source: The simplest way to use auto exposure is to make sure outdoor lights (or other strong lights) have energy beyond 1.0. This is done by tweaking their **Energy** multiplier (on the Light itself). To make it consistent, the **Sky** usually needs to use the energy multiplier too, to match with the directional light. Normally, values between 3.0 and 6.0 are enough to simulate indoor-outdoor conditions.
es: La forma más simple de usar la autoexposición es asegurarse de que las luces exteriores (u otras luces fuertes) tengan una energía superior a 1.0. Esto se hace ajustando su multiplicador de **Energía** (en la propia luz). Para que sea consistente, el **Sky** usualmente necesita usar el multiplicador de energía también, para que coincida con la luz direccional. Normalmente, los valores entre 3,0 y 6,0 son suficientes para simular las condiciones interiores y exteriores.
fr: La manière la plus simple d'utiliser l'exposition automatique et de s'assurer que les éclairages extérieurs ( ou les autres puissants éclairages ) aient une énergie au delà de 1.0. Ceci est obtenu en manipulant leur multiplicateur **Energy** ( sur la lumière elle-même ). Pour le rendre cohérent, **Sky** nécessite généralement aussi le multiplicateur d'énergie, afin de correspondre aux lumières directionnelles. Habituellement, des valeurs entre 3.0 et 6.0 sont suffisantes pour simuler un environnement intérieur-extérieur.
ja: 自動露出を使用する最も簡単な方法は、屋外の照明(または他の強い照明)のエネルギーが1.0を超えるようにすることです。これは、(ライト自体の) **Energy** 乗数を微調整することによって行われます。通常、一貫性を持たせるために、\ **Sky** も指向性ライトと一致させるためにエネルギー乗数を使用する必要があります。一般的に、屋内と屋外の状態をシミュレートするには、3.0〜6.0の値で十分です。

source: By combining Auto Exposure with *Glow* post processing (more on that below), pixels that go over the tonemap **White** will bleed to the glow buffer, creating the typical bloom effect in photography.
es: Combinando la autoexposición con el postprocesamiento de *Brillo* (más sobre eso abajo), los píxeles que van sobre el mapa de tonos **Blanco** sangrarán al búfer de brillo, creando el típico efecto de florecimiento en la fotografía.
fr: En combinant Auto Exposure et le post-traitement *Glow* (plus d'informations ci-dessous), les pixels qui passent au-dessus de la tonemap **White** saignent dans le glow buffer, créant ainsi l'effet de bloom typique en photographie.
ja: 自動露出と *Glow* ポストプロセッシング(詳細は下記)を組み合わせることにより、トーンマップの **White** を超えたピクセルがグローバッファー流れ込み、典型的な写真のブルームエフェクトを作成できます。
zh_cn: 通过将自动曝光与* Glow *后期处理相结合(更多内容如下)，超过色调图** **的像素将会流向发光缓冲区，从而在摄影中创造典型的绽放效果。

source: The user-controllable values in the Auto Exposure section come with sensible defaults, but you can still tweak them:
es: Los valores controlables por el usuario en la sección de Exposición Automática vienen con valores por defecto sensatos, pero aún así puedes ajustarlos:
fr: Les valeurs contrôlables par l'utilisateur de la section Exposition automatique sont définies par défaut, mais vous pouvez toujours les modifier :
ja: Auto Exposureセクションのユーザーが制御可能な値には、適切なデフォルトがありますが、微調整ができます:

source: **Scale:** Value to scale the lighting. Brighter values produce brighter images, smaller ones produce darker ones.
es: **Escala:** Valor a escala de la iluminación. Los valores más brillantes producen imágenes más brillantes, los más pequeños producen imágenes más oscuras.
fr: **Echelle:** Valeur pour mettre l'éclairage à l'échelle. Des valeurs plus lumineuses produisent des images plus lumineuses, des valeurs plus petites produisent des images plus sombres.
ja: **Scale:** 照明をスケールする値。明るい値は明るい画像を生成し、小さい値は暗い画像を生成します。
zh_cn: **比例:** 用于缩放照明的值。 较亮的值会产生较亮的图像，较小的值会产生较暗的图像。

source: **Min Luma:** Minimum luminance that auto exposure will aim to adjust for. Luminance is the average of the light in all the pixels of the screen.
es: **Min Luma:** La luminancia mínima que la autoexposición intentará ajustar. La luminancia es el promedio de la luz en todos los píxeles de la pantalla.
fr: **Min Luma:**luminance minimale que l'exposition automatique visera pour ajuster. La luminance est la moyenne de la lumière dans tous les pixels de l'écran.
ja: **Min Luma:** 自動露出の調整対象となる最小輝度。輝度は、画面のすべてのピクセルの光の平均です。
zh_cn: ** Min Luma:** 自动曝光旨在调整的最小亮度。 亮度是屏幕所有像素中光线的平均值。

source: **Max Luma:** Maximum luminance that auto exposure will aim to adjust for.
es: **Max Luma:** Máxima luminancia que la autoexposición intentará ajustar.
fr: **Max Luma:**Luminance maximale que l'exposition automatique visera pour ajuster.
ja: **Max Luma:** 自動露出の調整対象となる最大輝度。
zh_cn: ** Max Luma:** 自动曝光旨在调整的最大亮度。

source: **Speed:** Speed at which luminance corrects itself. The higher the value, the faster correction happens.
es: **Velocidad:** Velocidad a la que se corrige la luminancia. Cuanto más alto es el valor, más rápido se corrige.
fr: **Vitesse:** Vitesse à laquelle la luminance se corrige d'elle-même. Plus la valeur est élevée, plus la correction est rapide.
ja: **Speed:** 輝度が補正される速度。値が大きいほど、より速い補正が行われます。
zh_cn: **速度:** 亮度校正的速度。 值越高，发生的校正越快。

source: Mid- and post-processing effects
es: Efectos de medio y post proceso
fr: Effets de mi et post-traitement
ja: 中間およびポストプロセッシングエフェクト

source: A large amount of widely-used mid- and post-processing effects are supported in the Environment.
es: Un montón de gran cantidad de efectos en medio y postprocesamiento son soportados por el ambiente.
fr: Un grand nombre d'effets de milieu et de post-traitement largement utilisés, sont pris en charge dans l'Environment.
ja: 環境(Environment)では、広く使用されている大量の中間プロセッシングおよびポストプロセッシングエフェクトがサポートされています。

source: Screen-Space Reflections (SSR)
es: Reflejos del espacio de la pantalla (SSR)
ja: スクリーンスペース反射(Ss Reflections/SSR)
zh_cn: 屏幕空间反射(SSR)

source: While Godot supports three sources of reflection data (Sky, ReflectionProbe, and GIProbe), they may not provide enough detail for all situations. Scenarios where Screen Space Reflections make the most sense are when objects are in contact with each other (object over floor, over a table, floating on water, etc).
es: Aunque Godot apoya tres fuentes de datos de reflexión (Sky, ReflectionProbe y GIProbe), puede que no proporcionen suficientes detalles para todas las situaciones. Los escenarios en los que los reflejos del espacio de pantalla tienen más sentido son cuando los objetos están en contacto entre sí (objeto sobre el suelo, sobre una mesa, flotando en el agua, etc.).
fr: Bien que Godot supporte trois sources de données de réflexion (Sky, ReflectionProbe et GIProbe), elles peuvent ne pas fournir suffisamment de détails pour toutes les situations. Les scénarios où les Screen Space Reflections ont le plus de sens sont ceux où les objets sont en contact les uns avec les autres (objet au-dessus du sol, au-dessus d'une table, flottant sur l'eau, etc).
ja: Godotは3つの反射データソース(Sky、ReflectionProbe、GIProbe)をサポートしていますが、すべての状況に対して十分な詳細を提供するわけではありません。スクリーンスペースの反射が最も意味のあるシナリオは、オブジェクトが互いに接触している場合です(床の上、テーブルの上、水に浮いているオブジェクトなど)。
zh_cn: 虽然Godot支持三种反射数据源(Sky，ReflectionProbe和GIProbe)，但它们可能无法为所有情况提供足够的细节。 屏幕空间反射最有意义的场景是物体彼此接触(地板上的物体，桌子上的物体，漂浮在水面上等)。

source: The other advantage (even if only enabled to a minimum), is that it works in real-time (while the other types of reflections are pre-computed). This can be used to make characters, cars, etc. reflect on surrounding surfaces when moving around.
es: La otra ventaja (aunque sólo sea mínima), es que funciona en tiempo real (mientras que los otros tipos de reflejos están precalculados). Esto puede utilizarse para hacer que los personajes, los coches, etc. se reflejen en las superficies circundantes cuando se mueven.
fr: L'autre avantage (même si activée uniquement au minimum), est qu'il fonctionne en temps réel (alors que les autres types de réflexions sont pré-calculées). Cela peut être utilisé pour faire des personnages, des voitures, etc. réfléchir sur les surfaces environnantes lors du déplacement.
ja: もう1つの利点は(最低限しか有効にしない場合でも)、リアルタイムで機能することです(他の種類の反射は事前に計算されます)。これを使用して、キャラクター、車などが動き回るときに周囲の表面に反映させることができます。

source: A few user-controlled parameters are available to better tweak the technique:
es: Se dispone de unos pocos parámetros controlados por el usuario para ajustar mejor la técnica:
fr: Quelques paramètres contrôlés par l'utilisateur sont disponibles pour mieux ajuster la technique :
ja: いくつかのユーザー制御パラメーターを使用して、この手法を微調整できます:
zh_cn: 一些用户控制的参数可用于更好地调整技术:

source: **Max Steps** determines the length of the reflection. The bigger this number, the more costly it is to compute.
es: **Max Steps** determina la longitud del reflejo. Cuanto más grande sea este número, más costoso es calcularlo.
fr: **Max Steps** détermine la longueur de la réflexion. Plus ce nombre est élevé, plus c'est coûteux à calculer.
ja: **Max Steps** は、反射の長さを決定します。この数値が大きいほど、計算にコストがかかります。
zh_cn: **最大步数**确定反射的长度。 这个数字越大，计算成本就越高。

source: **Fade In** allows adjusting the fade-in curve, which is useful to make the contact area softer.
es: **Fade In** permite ajustar la curva de desvanecimiento, lo que es útil para hacer el área de contacto más suave.
fr: **Fade In** permet d'ajuster la courbe de fondu enchaîné, ce qui est utile pour rendre la surface de contact plus douce.
ja: **Fade In** では、接触領域を柔らかくために役立つフェードイン曲線を調整できます。
zh_cn: **淡入**允许调整淡入曲线，这有助于使接触区域更柔和。

source: **Fade Out** allows adjusting the fade-out curve, so the step limit fades out softly.
es: **Fundido de salida** permite ajustar la curva de fundido de salida, de modo que el límite de paso se fundirá suavemente.
fr: **Fade Out** permet d'ajuster la courbe de fondu enchaîné, de sorte que la limite de pas s'estompe en douceur.
ja: **Fade Out** で、フェードアウト曲線を調整できるため、ステップの限界は柔らかくフェードアウトします。
zh_cn: **淡出**允许调整淡出曲线，因此步长限制会轻微淡出。

source: **Depth Tolerance** can be used for screen-space-ray hit tolerance to gaps. The bigger the value, the more gaps will be ignored.
es: **Tolerancia a la profundidad** puede ser usada para la tolerancia a los rayos de pantalla en los huecos. Cuanto mayor sea el valor, más huecos serán ignorados.
fr: **Depth Tolerance** peut être utilisée pour la tolérance d'impact des rayons dans l'espace de l'écran aux écarts. Plus la valeur est grande, plus il y aura d'écarts ignorés.
ja: **Depth Tolerance** は、ギャップに対するスクリーンスペースレイヒット許容値の調整に使用できます。値が大きいほど、無視されるギャップが多くなります。
zh_cn: ** Depth Tolerance **可用于屏幕空间射线对间隙的容差。 值越大，忽略的差距就越大。

source: **Roughness** will apply a screen-space blur to approximate roughness in objects with this material characteristic.
es: **Rugosidad** aplicará un desenfoque de espacio de pantalla para aproximar la rugosidad en los objetos con esta característica material.
fr: **L'option Rugosité** permet d'appliquer un flou de l'espace-écran pour obtenir une approximation de la rugosité des objets présentant cette caractéristique de matériau.
ja: **Roughness** は、スクリーンスペースのぼかしを適用して、このマテリアル特性を持つオブジェクトの粗さを近似します。
zh_cn: **粗糙度**将应用屏幕空间模糊来近似具有此材质特征的对象的粗糙度。

source: Keep in mind that screen-space-reflections only work for reflecting opaque geometry. Transparent objects can't be reflected.
es: Tengan en cuenta que los reflejos en el espacio de la pantalla sólo funcionan para reflejar una geometría opaca. Los objetos transparentes no pueden ser reflejados.
fr: Gardez à l'esprit que les réflexions de l'espace-écran ne fonctionnent que pour une géométrie opaque réfléchissante. Les objets transparents ne peuvent pas être réfléchis.
ja: スクリーンスペース反射は不透明なジオメトリを反射する場合にのみ機能することに注意してください。透明なオブジェクトは反射できません。
zh_cn: 请记住，屏幕空间反射仅适用于反射不透明几何体。 透明对象无法反映。

source: Screen-Space Ambient Occlusion (SSAO)
es: Oclusión ambiental en el espacio de la pantalla (SSAO)
ja: スクリーンスペース・アンビエントオクルージョン(Ssao/SSAO)
zh_cn: 屏幕空间环境遮挡(SSAO)

source: As mentioned in the **Ambient** section, areas where light from light nodes does not reach (either because it's outside the radius or shadowed) are lit with ambient light. Godot can simulate this using GIProbe, ReflectionProbe, the Sky, or a constant ambient color. The problem, however, is that all the methods proposed previously act more on a larger scale (large regions) than at the smaller geometry level.
es: Como se mencionó en la sección **Ambiente**, las zonas a las que no llega la luz de los nodos de luz (ya sea porque está fuera del radio o en sombra) se iluminan con luz ambiental. Godot puede simular esto usando la GIProbe, la ReflectionProbe, el Cielo, o un color ambiental constante. El problema, sin embargo, es que todos los métodos propuestos anteriormente actúan más en una escala mayor (grandes regiones) que en el nivel de geometría menor.
fr: Comme mentionné dans la section **Ambiant**, les zones que la lumière des nœuds lumineux n'atteint pas (soit parce qu'elle est à l'extérieur du rayon, soit parce qu'elle est dans l'ombre) sont éclairées par la lumière ambiante. Godot peut simuler cela en utilisant GIProbe, ReflectionProbe, le ciel ou une couleur ambiante constante. Le problème, cependant, c'est que toutes les méthodes proposées précédemment agissent davantage à plus grande échelle (grandes régions) plutôt qu'au niveau de la géométrie plus petite.
ja: **Ambient** セクションで述べたように、Lightノードからの光が(その範囲外にあるか、遮られているといった理由で)到達しない領域は環境光で照らされます。 Godotは、GIProbe、ReflectionProbe、Sky、または一定の環境色を使用してこれをシミュレートできます。しかしこれらの方法はすべて、小さなジオメトリ・レベルではなく、より大きなスケール (大きな領域)にて効果が表れるという欠点があります。

source: Constant ambient color and Sky are the same everywhere, while GI and Reflection probes have more local detail, but not enough to simulate situations where light is not able to fill inside hollow or concave features.
es: El color ambiental constante y el cielo son los mismos en todas partes, mientras que las sondas GI y de reflexión tienen más detalles locales, pero no lo suficiente como para simular situaciones en las que la luz no es capaz de llenar el interior de características huecas o cóncavas.
fr: La couleur ambiante constante et le ciel sont les mêmes partout, tandis que les sondes GI et Reflection ont plus de détails locaux, mais pas assez pour simuler des situations où la lumière n'est pas capable de remplir d'éléments creux ou concaves.
ja: 一定の環境色とSkyはどの場所でも同じですが、それに比べてGIおよびReflectionプローブはより局所的な詳細度を持つとはいえ、光が中空または凹面の形状を照らすことができない状況をシミュレートするには不十分です。

source: This can be simulated with Screen Space Ambient Occlusion. As you can see in the image below, its purpose is to make sure concave areas are darker, simulating a narrower path for the light to enter:
es: Esto puede ser simulado con la Oclusión Ambiental del Espacio de Pantalla. Como puedes ver en la imagen de abajo, su propósito es asegurarse de que las áreas cóncavas son más oscuras, simulando un camino más estrecho para que la luz entre:
fr: Cela peut être simulé à l'aide de Screen Space Ambient Occlusion. Comme vous pouvez le voir dans l'image ci-dessous, son but est de faire en sorte que les zones concaves soient plus sombres, simulant un chemin d'entrer de la lumière étroit :
ja: これは、スクリーンスペースアンビエントオクルージョンでシミュレートできます。下の画像でわかるように、その目的は、光が入る狭い経路をシミュレートして、凹面領域がより暗くなるようにすることです:

source: It is a common mistake to enable this effect, turn on a light, and not be able to appreciate it. This is because SSAO only acts on *ambient* light, not direct light.
es: Es un error común habilitar este efecto, encender una luz y no ser capaz de apreciarlo. Esto se debe a que el SSAO sólo actúa con la luz ambiental, no con la luz directa.
fr: C'est une erreur courante d'activer cet effet, d'allumer une lumière et de ne pas être capable de l'apprécier. En effet, SSAO n'agit que sur la lumière *ambiante* et non sur la lumière directe.
ja: よくある間違いとして、このエフェクトを有効にし、ライトをオンにしても、結果が確認できないというものです。これは、SSAOが直接光ではなく、\ *環境*\ 光のみに作用するためです。
zh_cn: 启用此效果，打开灯光并且无法欣赏它是一个常见的错误。 这是因为SSAO仅作用于* ambient * light，而不是直接光。

source: This is why, in the image above, the effect is less noticeable under the direct light (on the left). If you want to force SSAO to work with direct light too, use the **Light Affect** parameter (even though this is not correct, some artists like how it looks).
es: Por eso, en la imagen de arriba, el efecto es menos perceptible bajo la luz directa (a la izquierda). Si quieres forzar a SSAO a trabajar también con luz directa, usa el parámetro **Afecto de la luz** (aunque esto no es correcto, a algunos artistas les gusta cómo se ve).
fr: C'est pourquoi, dans l'image ci-dessus, l'effet est moins visible sous la lumière directe (à gauche). Si vous voulez forcer SSAO à travailler aussi avec la lumière directe, utilisez le paramètre **Light Affect** (même si ce n'est pas correct, certains artistes aiment son aspect).
ja: これが、上の画像で、直接光の下(左側)では効果が目立たない理由です。 SSAOを直接光でも機能させる場合は、\ **Light Affect** パラメーターを使用します(これは正しくありませんが、一部のアーティストはこの見た目が好きです)。

source: SSAO looks best when combined with a real source of indirect light, like GIProbe:
es: El SSAO se ve mejor cuando se combina con una fuente real de luz indirecta, como el GIProbe:
fr: SSAO est plus esthétique lorsqu'il est combiné avec une véritable source de lumière indirecte, comme GIProbe :
ja: SSAOは、GIProbeのような間接光の実際の光源と組み合わせたときに見栄えがします:
zh_cn: 当与真正的间接光源结合时，SSAO看起来最好，比如GIProbe:

source: Tweaking SSAO is possible with several parameters:
es: Es posible ajustar el SSAO con varios parámetros:
fr: Le réglage de SSAO est possible avec plusieurs paramètres :
ja: SSAOの調整は、いくつかのパラメーターで可能です:
zh_cn: 可以使用以下几个参数调整SSAO:

source: **Radius/Intensity:** To control the radius or intensity of the occlusion, these two parameters are available. Radius is in world (Metric) units.
es: **Radio/Intensidad:** Para controlar el radio o la intensidad de la oclusión, se dispone de estos dos parámetros. El radio está en unidades mundiales (métricas).
fr: **Radius/Intensity:** Pour contrôler le rayon ou l'intensité de l'occlusion, ces deux paramètres sont disponibles. Le rayon est en unités mondiales (métriques).
ja: **Radius/Intensity:** オクルージョンの半径または強度を制御するために、これら2つのパラメーターを使用できます。半径はワールド(メートル)単位です。
zh_cn: **半径/强度:** 要控制遮挡的半径或强度，可以使用这两个参数。 半径是世界(公制)单位。

source: **Radius2/Intensity2:** A Secondary radius/intensity can be used. Combining a large and a small radius AO generally works well.
es: **Radio2/Intensidad2:** Se puede utilizar un radio/intensidad secundario. Combinar un AO de radio grande y uno pequeño generalmente funciona bien.
fr: **Radius2/Intensity2:** Un rayon/intensité secondaire peut être utilisé. La combinaison d'un AO à grand et à petit rayon fonctionne généralement bien.
ja: **Radius2/Intensity2:** 第二の半径/強度を使用できます。一般に、半径の大きいAOと小さいAOを組み合わせるとうまくいきます。
zh_cn: ** Radius2 / Intensity2:** 可以使用辅助半径/强度。 结合大半径和小半径AO通常效果很好。

source: **Bias:** This can be tweaked to solve self occlusion, though the default generally works well enough.
es: **Bias:** Esto puede ser ajustado para resolver la auto-oclusión, aunque el predeterminado generalmente funciona bastante bien.
fr: **Bias:** Ceci peut être modifié pour résoudre l'auto-occlusion, bien que la valeur par défaut fonctionne généralement assez bien.
ja: **Bias:** これはセルフオクルージョンを解決するために微調整できますが、通常はデフォルトで十分に機能します。
zh_cn: **偏差:** 这可以通过调整来解决自我遮挡问题，但默认情况下通常效果不错。

source: **Light Affect:** SSAO only affects ambient light, but increasing this slider can make it also affect direct light. Some artists prefer this effect.
es: **Light Affect:** SSAO sólo afecta a la luz ambiental, pero aumentar este deslizador puede hacer que también afecte a la luz directa. Algunos artistas prefieren este efecto.
fr: **Light Affect:** SSAO n'affecte que la lumière ambiante, mais l'augmentation de ce curseur peut également affecter la lumière directe. Certains artistes préfèrent cet effet.
ja: **Light Affect:** SSAOは周囲光のみに影響しますが、このスライダーを大きくすると、直接光にも影響します。この効果を好むアーティストもいます。

source: **Ao Channel Affect:** If a value of zero is used, only the material's AO texture will be used for ambient occlusion; SSAO will not be applied. Values greater than 0 multiply the AO texture by the SSAO effect to varying degrees. This does not affect materials without an AO texture.
es: **Ao Channel Affect:** Si se utiliza un valor de cero, sólo se utilizará la textura AO del material para la oclusión ambiental; no se aplicará la SSAO. Los valores superiores a 0 multiplican la textura AO por el efecto SSAO en diferentes grados. Esto no afecta a los materiales sin una textura AO.
fr: **Ao Channel Affect : **Si une valeur de zéro est utilisée, seule la texture AO du matériau sera utilisée pour l'occlusion ambiante ; SSAO ne sera pas appliqué. Les valeurs supérieures à 0 multiplient la texture AO par l'effet SSAO à des degrés divers. Ceci n'affecte pas les matériaux sans texture AO.
ja: **Ao Channel Affect:** ゼロの値を使用すると、マテリアルのAOテクスチャのみがアンビエントオクルージョンに使用されます。 SSAOは適用されません。 0より大きい値は、AOテクスチャにSSAOエフェクトをさまざまな度合いで掛けます。これは、AOテクスチャのないマテリアルには影響しません。

source: **Quality:** Depending on quality, SSAO will take more samples over a sphere for every pixel. High quality only works well on modern GPUs.
es: **Calidad:** Dependiendo de la calidad, SSAO tomará más muestras sobre una esfera por cada píxel. La alta calidad sólo funciona bien en las GPU modernas.
fr: **Quality:** Selon la qualité, SSAO prélèvera plus d'échantillons sur une sphère pour chaque pixel. La haute qualité ne fonctionne bien que sur les GPU modernes.
ja: **Quality:** 品質に応じて、SSAOは、すべてのピクセルについて球体上のサンプルをより多く取得します。High qualityは、最新のGPUでのみ有効です。

source: **Blur:** Type of blur kernel used. The 1x1 kernel is a simple blur that preserves local detail better, but is not as efficient (generally works better with the high quality setting above), while 3x3 will soften the image better (with a bit of dithering-like effect), but does not preserve local detail as well.
es: **Desenfoque:** Tipo de núcleo borroso utilizado. El núcleo 1x1 es un desenfoque simple que conserva mejor los detalles locales, pero no es tan eficiente (generalmente funciona mejor con el ajuste de alta calidad de arriba), mientras que el 3x3 suavizará mejor la imagen (con un poco de efecto de vacilación), pero no conserva los detalles locales también.
fr: **Blur:** Type de noyau flou utilisé. Le noyau 1x1 est un simple flou qui préserve mieux les détails locaux, mais n'est pas aussi efficace (fonctionne généralement mieux avec le réglage de haute qualité ci-dessus), tandis que 3x3 adoucira mieux l'image (avec un peu d'effet dithering-like), mais ne conserve pas les détails locaux ainsi.
ja: **Blur:** 使用されるブラーカーネルのタイプ。 1x1カーネルは、局所の詳細度をより良く保つ単純なぼかしですが、それほど効果的ではありません。一方、3x3は画像をより柔らかくしますが(ディザリングのような効果が少しあります)、局所の詳細度を保ちません。

source: **Edge Sharpness**: This can be used to preserve the sharpness of edges (avoids areas without AO on creases).
es: **Edge Sharpness**: Esto puede ser usado para preservar la nitidez de los bordes (evita áreas sin AO en los pliegues).
fr: **Edge Sharpness** : Ceci peut être utilisé pour préserver la netteté des arêtes (évite les zones sans AO sur les plis).
ja: **Edge Sharpness**: エッジのシャープネスを維持するために使用することができます(折り目にAOのない領域を避けます)。
zh_cn: **边缘清晰度**:这可用于保持边缘的清晰度(避免折痕处没有AO的区域)。

source: Depth of Field / Far Blur
es: Profundidad de campo / Borrón lejano
fr: Profondeur de champ / Flou lointain
ja: 被写界深度(DOF)/遠方ぼかし(Far Blur)
zh_cn: 景深/远模糊

source: This effect simulates focal distance on high end cameras. It blurs objects behind a given range. It has an initial **Distance** with a **Transition** region (in world units):
es: Este efecto simula la distancia focal de las cámaras de alta gama. Desenfoca los objetos detrás de un rango determinado. Tiene una **Distancia** inicial con una región de **Transición** (en unidades mundiales):
fr: Cet effet simule la distance focale sur les appareils photo haut de gamme. Il brouille les objets derrière une plage donnée. Il a une **Distance** initiale avec une région de **Transition** (en unités mondiales) :
ja: このエフェクトは、ハイエンドカメラの焦点距離をシミュレートします。特定の範囲の背後にあるオブジェクトをぼかします。\ **Transition**(遷移)領域(ワールド単位)を持つ 開始 **Distance**(距離) を持っています:
zh_cn: 此效果可模拟高端相机的焦距。 它模糊了给定范围后面的物体。 它有一个** **距离**， **过渡** 区域(世界单位):
