Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/gi_probes.po
Languages: es, fr, zh_cn

source: Introduction
es: Introducción
zh_cn: 简介

source: This feature is only available when using the GLES3 backend. :ref:`doc_baked_lightmaps` can be used as an alternative when using the GLES2 renderer.
es: Esta característica sólo está disponible cuando se utiliza el backend GLES3. :ref:`doc_baked_lightmaps` puede utilizarse como alternativa cuando se utiliza el renderizador GLES2.
fr: Cette fonctionnalité est uniquement disponible lors de l’utilisation du backend GLES3. :ref:`doc_baked_lightmaps` peut être utilisé à la place du rendu GLES2.

source: Just like with :ref:`doc_reflection_probes`, and as stated in the :ref:`doc_spatial_material`, objects can show reflected or diffuse light. GI Probes are similar to Reflection Probes, but they use a different and more complex technique to produce indirect light and reflections.
es: Al igual que con :ref:`doc_reflection_probes`, y como se indica en el :ref:`doc_spatial_material`, los objetos pueden mostrar luz reflejada o difusa. Las GI Probes son similares a las Reflection Probes, pero utilizan una técnica diferente y más compleja para producir luz indirecta y reflejos.
fr: Tout comme avec les :ref:`doc_reflection_probes`, et comme indiqué dans le :ref:`doc_spatial_material`, les objets peuvent montrer une lumière réfléchie ou diffuse. Les GI Probes sont similaires aux Reflection Probes, mais elles utilisent une technique différente et plus complexe pour produire de la lumière indirecte et des réflexions.
zh_cn: 就像 :ref:`doc_reflection_probes`，并且如 :ref:`doc_spatial_material` 中所述，对象可以显示反射光或漫反射光。 GI探针类似于反射探针，但它们使用不同且更复杂的技术来产生间接光和反射。

source: The strength of GI Probes is real-time, high quality, indirect light. While the scene needs a quick pre-bake for the static objects that will be used, lights can be added, changed or removed, and this will be updated in real-time. Dynamic objects that move within one of these probes will also receive indirect lighting from the scene automatically.
es: La fuerza de las GI Probes es luz indirecta en tiempo real y de alta calidad. Mientras que la escena necesita un precalentamiento rápido para los objetos estáticos que se utilizarán, las luces pueden ser añadidas, cambiadas o eliminadas, y esto se actualizará en tiempo real. Los objetos dinámicos que se mueven dentro de una de estas sondas también recibirán luz indirecta de la escena automáticamente.
fr: La force des GI Probes est la lumière indirecte en temps réel de haute qualité. Alors que la scène a besoin d'une pré-préparation rapide pour les objets statiques qui seront utilisés, les lumières peuvent être ajoutées, modifiées ou supprimées, et ceci sera mis à jour en temps réel. Les objets dynamiques qui se déplacent à l'intérieur d'une de ces sondes recevront également un éclairage indirect de la scène automatiquement.
zh_cn: GI探针的强度是实时，高质量，间接光。 虽然场景需要对将要使用的静态对象进行快速预烘焙，但可以添加，更改或删除灯光，并且这将实时更新。 在其中一个探针内移动的动态对象也将自动从场景接收间接光照。

source: Just like with ``ReflectionProbe``, ``GIProbe`` can be blended (in a bit more limited way), so it is possible to provide full real-time lighting for a stage without having to resort to lightmaps.
es: Al igual que con ``ReflectionProbe``, ``GIProbe`` se puede mezclar (de una manera un poco más limitada), por lo que es posible proporcionar una iluminación completa en tiempo real para un escenario sin tener que recurrir a los mapas de luz.
fr: Tout comme avec ``ReflectionProbe``, ``GIProbe`` peut être mélangé (d'une manière un peu plus limitée), il est donc possible de fournir un éclairage complet en temps réel pour une scène sans avoir à recourir à des cartes de lumières.

source: The main downsides of ``GIProbe`` are:
es: Las principales desventajas del ``GIProbe`` son:
fr: Les principaux inconvénients des ``GIProbe`` sont :

source: A small amount of light leaking can occur if the level is not carefully designed. This must be artist-tweaked.
es: Puede producirse una pequeña fuga de luz si el nivel no se diseña cuidadosamente. Esto debe ser ajustado por el artista.
fr: Une petite quantité de lumière peut s'échapper si le niveau n'est pas conçu avec soin. Ceci doit-être peaufiné par l'artiste.
zh_cn: 如果没有仔细设计水平，可能会发生少量漏光。 这必须是艺术家调整的。

source: Performance requirements are higher than for lightmaps, so it may not run properly in low-end integrated GPUs (may need to reduce resolution).
es: Los requisitos de rendimiento son más altos que los de los mapas de luz, por lo que es posible que no funcione correctamente en las GPU integradas de gama baja (puede ser necesario reducir la resolución).
fr: Les exigences de performance sont plus élevées que pour les cartes de lumière, il se peut donc qu'il ne fonctionne pas correctement avec les GPU intégrés bas de gamme (il peut être nécessaire de réduire la résolution).
zh_cn: 性能要求高于光照贴图，因此在低端集成GPU中可能无法正常运行(可能需要降低分辨率)。

source: Reflections are voxelized, so they don't look as sharp as with ``ReflectionProbe``. However, in exchange they are volumetric, so any room size or shape works for them. Mixing them with Screen Space Reflection also works well.
es: Los reflejos están voxelizados, por lo que no se ven tan nítidos como con la "ReflectionProbe". Sin embargo, a cambio son volumétricos, por lo que cualquier tamaño o forma de habitación funciona para ellos. Mezclarlo con el Screen Space Reflection también funciona bien.
fr: Les reflets sont voxélisés, donc ils ne sont pas aussi nets qu'avec ``ReflectionProbe``. Cependant, en échange, ils sont volumétriques, donc n'importe quelle taille ou forme de pièce peut leur convenir. Les mélanger avec Screen Space Reflection fonctionne également bien.

source: They consume considerably more video memory than Reflection Probes, so they must be used with care in the right subdivision sizes.
es: Consumen considerablemente más memoria de video que las Reflection Probes, por lo que deben ser usadas con cuidado en los tamaños de subdivisión correctos.
fr: Ils consomment considérablement plus de mémoire vidéo que les sondes de réflexion, ils doivent donc être utilisés avec précaution dans les bonnes tailles de subdivision.

source: Setting up
es: Configurando
fr: Mise en place
zh_cn: 设置

source: Just like a ``ReflectionProbe``, simply set up the ``GIProbe`` by wrapping it around the geometry that will be affected.
es: Al igual que una "ReflectionProbe", simplemente coloca la "Giprobe" envolviéndola alrededor de la geometría que será afectada.
fr: Tout comme un ``ReflectionProbe``, configurez simplement le ``GIProbe`` en le faisant englober la géométrie qui sera affectée.

source: Afterwards, make sure to enable the geometry will be baked. This is important in order for ``GIProbe`` to recognize objects, otherwise they will be ignored:
es: Después, asegúrese de habilitar la geometría será horneada. Esto es importante para que "GIProbe" reconozca los objetos, de lo contrario serán ignorados:
fr: Ensuite, assurez-vous que la géométrie sera préparée. C'est important pour que ``GIProbe`` reconnaisse les objets, sinon ils seront ignorés :

source: Once the geometry is set up, push the Bake button that appears on the 3D editor toolbar to begin the pre-baking process:
es: Una vez configurada la geometría, pulse el botón Bake que aparece en la barra de herramientas del editor 3D para comenzar el proceso de pre-baking:
fr: Une fois la géométrie configurée, appuyez sur le bouton Bake (préparation) qui apparaît dans la barre d'outils de l'éditeur 3D pour commencer le processus de pré-préparation :

source: Adding lights
es: Agregando luces
fr: Ajout de lumières
zh_cn: 添加灯光

source: Unless there are materials with emission, ``GIProbe`` does nothing by default. Lights need to be added to the scene to have an effect.
es: A menos que haya materiales con emisión, "GIProbe" no hace nada por defecto. Las luces deben ser añadidas a la escena para tener un efecto.
fr: À moins qu'il n'y ait des matériaux avec émission,``GIProbe`` ne fait rien par défaut. Des lumières doivent être ajoutées à la scène pour avoir un effet.

source: The effect of indirect light can be viewed quickly (it is recommended you turn off all ambient/sky lighting to tweak this, though, as shown below):
es: El efecto de la luz indirecta se puede ver rápidamente (se recomienda apagar toda la iluminación ambiental/cielo para ajustarla, sin embargo, como se muestra a continuación):
fr: L'effet de la lumière indirecte peut être visualisé rapidement (il est recommandé d'éteindre tous les éclairages d'ambiance/ciel pour régler cette fonction, comme indiqué ci-dessous) :
zh_cn: 可以快速查看间接光的效果(建议您关闭所有环境/天空照明以调整它，但如下所示):

source: In some situations, though, indirect light may be too weak. Lights have an indirect multiplier to tweak this:
es: Sin embargo, en algunas situaciones, la luz indirecta puede ser demasiado débil. Las luces tienen un multiplicador indirecto para ajustar esto:
fr: Dans certaines situations, cependant, la lumière indirecte peut être trop faible. Les lumières ont un multiplicateur indirect pour régler cela :
zh_cn: 但在某些情况下，间接光线可能太弱。 灯具有间接乘数来调整:

source: And, as ``GIProbe`` lighting updates in real-time, this effect is immediate:
es: Y, como la iluminación de "GIProbe" se actualiza en tiempo real, este efecto es inmediato:
fr: Et comme l'éclairage de ``GIProbe`` est mis à jour en temps réel, cet effet est immédiat :

source: Reflections
es: Reflexiones
fr: Réflexions
zh_cn: 反射

source: For very metallic materials with low roughness, it's possible to appreciate voxel reflections. Keep in mind that these have far less detail than Reflection Probes or Screen Space Reflections, but fully reflect volumetrically.
es: Para materiales muy metálicos con poca rugosidad, es posible apreciar los reflejos de vóxel. Tengan en cuenta que estos tienen mucho menos detalle que las Reflection Probes o los Screen Space Reflections, pero reflejan completamente de forma volumétrica.
fr: Pour les matériaux très métalliques à faible rugosité, il est possible d'apprécier des reflets de voxel. Gardez à l'esprit que celles-ci ont beaucoup moins de détails que les sondes de réflexion ou Screen Space Reflections, mais qu'elles reflètent pleinement le volume.

source: ``GIProbe``\ s can be easily mixed with Reflection Probes and Screen Space Reflections, as a full 3-stage fallback-chain. This allows to have precise reflections where needed:
es: Los "GIProbe" pueden ser fácilmente mezclados con las Reflection Probes y los Screen Space Reflections, como una cadena de retroceso de 3 etapas. Esto permite tener reflejos precisos donde sea necesario:
fr: Les sondes ``GIProbe`` peuvent être facilement mélangées à des sondes de réflexion et à Screen Space Reflections, comme une chaîne de repli complète à 3 étapes. Cela permet d'avoir des réflexions précises là où c'est nécessaire :

source: GI Probes normally allow mixing with lighting from the sky. This can be disabled when turning on the *Interior* setting.
es: Las Gi Probes normalmente permiten mezclarse con la iluminación del cielo. Esto puede ser desactivado cuando se activa el ajuste *Interior*.
fr: Les GI Probes permettent normalement de mélanger avec l'éclairage du ciel. Cette fonction peut être désactivée lorsque vous activez le réglage *Interior*.
zh_cn: GI探头通常允许与来自天空的照明混合。 打开* Interior *设置时可以禁用此功能。

source: The difference becomes clear in the image below, where light from the sky goes from spreading inside to being ignored.
es: La diferencia se hace evidente en la imagen de abajo, donde la luz del cielo pasa de difundirse en el interior a ser ignorada.
fr: La différence devient claire dans l'image ci-dessous, où la lumière du ciel est diffuser à l'intérieur puis est ignorer.
zh_cn: 在下面的图像中，差异变得清晰，来自天空的光从内部传播到被忽略。

source: As complex buildings may mix interiors with exteriors, combining GIProbes for both parts works well.
es: Como los edificios complejos pueden mezclar los interiores con los exteriores, combinar los GIProbes para ambas partes funciona bien.
fr: Comme les bâtiments complexes peuvent mélanger l'intérieur et l'extérieur, la combinaison de GIProbes pour les deux parties fonctionne bien.
zh_cn: 由于复杂的建筑物可能将室内和室外混合在一起，因此将两个部件的GIProbes结合起来非常有效。

source: Tweaking
es: Tweaking (ajustes)
fr: Ajustement
zh_cn: 扭捏

source: GI Probes support a few parameters for tweaking:
es: Las GI Probes admiten algunos parámetros de tweaking:
fr: Les GI Probes prennent en charge quelques paramètres pour l'ajustement :
zh_cn: GI探针支持一些调整参数:

source: **Subdiv** Subdivision used for the probe. The default (128) is generally good for small- to medium-sized areas. Bigger subdivisions use more memory.
es: **Subdiv** Subdivisión utilizada para la sonda. El valor por defecto (128) es generalmente bueno para áreas pequeñas y medianas. Las subdivisiones más grandes usan más memoria.
fr: **Subdiv** Subdivision utilisée pour la sonde. La valeur par défaut (128) est généralement bonne pour les petites et moyennes régions. Les plus grandes subdivisions utilisent plus de mémoire.

source: **Extents** Size of the probe. Can be tweaked from the gizmo.
es: **Extents** Tamaño de la sonda. Puede ser ajustada desde el gizmo.
fr: **Extents** Taille de la sonde. Peut être modifié à partir du gadget.
zh_cn: **范围**探头大小。 可以从Gizmo调整。

source: **Dynamic Range** Maximum light energy the probe can absorb. Higher values allow brighter light, but with less color detail.
es: **Dynamic Range** Máxima energía lumínica que la sonda puede absorber. Los valores más altos permiten una luz más brillante, pero con menos detalle de color.
fr: **Dynamic Range** Énergie lumineuse maximale que la sonde peut absorber. Des valeurs plus élevées permettent d'obtenir une lumière plus brillante, mais avec moins de détails de couleur.
zh_cn: **动态范围**探头可以吸收的最大光能。 值越高，光线越亮，但颜色细节越少。

source: **Energy** Multiplier for all the probe. Can be used to make the indirect light brighter (although it's better to tweak this from the light itself).
es: **Energy** Multiplicador para toda la sonda. Se puede usar para hacer más brillante la luz indirecta (aunque es mejor ajustarlo a partir de la propia luz).
fr: **Energy** Multiplicateur pour toute la sonde. Peut être utilisé pour rendre la lumière indirecte plus brillante (bien qu'il soit préférable de l'ajuster à partir de la lumière elle-même).
zh_cn: **能量**所有探头的倍增器。 可用于使间接光更亮(尽管最好从灯本身调整它)。

source: **Propagation** How much light propagates through the probe internally.
es: **Propagation** Cuánta luz se propaga a través de la sonda internamente.
fr: **Propagation** La quantité de lumière qui se propage à l'intérieur de la sonde.
zh_cn: **传播**内部有多少光通过探头传播。

source: **Bias** Value used to avoid self-occlusion when doing voxel cone tracing, should generally be above 1.0 (1==voxel size).
es: **Bias** El valor utilizado para evitar la auto-oclusión cuando se hace el rastreo de conos de vóxeles, debe ser generalmente superior a 1.0 (1==tamaño de vóxel).
fr: **Bias** La valeur utilisée pour éviter l'auto-occlusion lors du traçage du cône de voxel doit généralement être supérieure à 1,0 (1== taille de voxel).
zh_cn: **偏差**用于避免在进行体素锥体追踪时自我遮挡的值，通常应高于1.0(1 ==体素大小)。

source: **Normal Bias** Alternative type of bias useful for some scenes. Experiment with this one if regular bias does not work.
es: **Normal Bias** Tipo de sesgo alternativo útil para algunas escenas. Experimenta con este si el bias normal no funciona.
fr: **Normal Bias** Autre type de biais utile pour certaines scènes. Expérimentez avec celui-ci si un biais régulier ne fonctionne pas.
zh_cn: **普通偏差**对某些场景有用的替代偏见类型。 如果常规偏差不起作用，请尝试使用此方法。

source: **Interior** Allows mixing with lighting from the sky.
es: **Interior** Permite mezclarse con la iluminación del cielo.
fr: **Interior** Permet de mélanger avec la l'éclairage du ciel.

source: **Compress** Currently broken. Do not use.
es: **Compress** Actualmente roto. No lo uses.
fr: **Compress** Actuellement non-fonctionnel. Ne pas utiliser.

source: **Data** Contains the light baked data after baking. If you are saving the data it should be saved as a .res file.
es: **Data** Contiene los datos de la luz baked después de baking. Si está guardando los datos, debería ser guardado como un archivo .res.
fr: **Data** Contient les données générées d'éclairage après la préparation. Si vous enregistrez les données, elles doivent être enregistrées sous un fichier .res.

source: Quality
es: Calidad
fr: Qualité
zh_cn: 质量

source: ``GIProbe``\ s are quite demanding. It is possible to use lower quality voxel cone tracing in exchange for more performance.
es: Los "Giprobe" son bastante exigentes. Es posible utilizar un trazado de cono de vóxel de menor calidad a cambio de un mayor rendimiento.
fr: Les ``GIProbe``\ s sont très coûteux. Il est possible d'utiliser un tracé de cône de voxel de qualité inférieure en échange d'une meilleure performance.

source: Interior vs exterior
fr: Intérieur vs extérieur
zh_cn: 内部与外部

source: GI Probes
zh_cn: GI探针
