Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/high_dynamic_range.po
Languages: fr, zh_cn

source: High dynamic range
zh_cn: 高动态范围

source: Introduction
zh_cn: 简介

source: Normally, an artist does all the 3D modelling, then all the texturing, looks at their awesome looking model in the 3D DCC and says "looks fantastic, ready for integration!" then goes into the game, lighting is setup and the game runs.
fr: Normalement, un artiste fait toute la modélisation 3D, puis toutes les textures, regarde son modèle d'apparence impressionnant dans le DCC 3D et dit "c'est fantastique, prêt pour l'intégration", puis va dans le jeu, l'éclairage est installé et le jeu fonctionne.
zh_cn: 通常情况下，艺术家会进行所有3D建模，然后进行所有纹理处理，在3D DCC中查看他们令人敬畏的模型并说“看起来很棒，可以进行整合！” 然后进入游戏，设置灯光并运行游戏。

source: To be more practical, imagine that in a regular scene, the intensity of a light (generally 1.0) is set to 5.0. The whole scene will turn very bright (towards white) and look horrible.
fr: Pour être plus pratique, imaginez que dans une scène régulière, l'intensité d'une lumière (généralement 1.0) est réglée à 5.0. Toute la scène deviendra très lumineuse (vers le blanc) et aura l'air horrible.
zh_cn: 更实际的是，想象一下在常规场景中，光的强度(通常为1.0)设置为5.0。 整个场景将变得非常明亮(朝向白色)并且看起来很可怕。

source: Except the scene is more contrasted because there is a higher light range at play. What is this all useful for? The idea is that the scene luminance will change while you move through the world, allowing situations like this to happen:
fr: Sauf que la scène est plus contrastée parce qu'il y a une plus grande plage lumineuse en jeu. À quoi tout cela sert-il ? L'idée est que la luminance de la scène va changer pendant que vous vous déplacez dans le monde, permettant à des situations comme celle-ci de se produire :
zh_cn: 除了场景更加对比，因为在比赛中有更高的光线范围。 这有什么用呢？ 我们的想法是，当您在世界各地移动时，场景亮度会发生变化，从而允许这样的情况发生:

source: Additionally, it is possible to set a threshold value to send to the glow buffer depending on the pixel luminance. This allows for more realistic light bleeding effects in the scene.
fr: En outre, il est possible de définir une valeur seuil à envoyer au tampon lumineux en fonction de la luminance des pixels. Cela permet d'obtenir des effets de saignement de lumière plus réalistes dans la scène.
zh_cn: 另外，可以根据像素亮度设置阈值以发送到辉光缓冲器。 这允许场景中更逼真的光线流失效果。

source: Linear color space
fr: Espace colorimétrique linéaire
zh_cn: 线性色彩空间

source: The problem with this technique is that computer monitors apply a gamma curve to adapt better to the way the human eye sees. Artists create their art on the screen too, so their art has an implicit gamma curve applied to it.
fr: Le problème avec cette technique est que les écrans d'ordinateur appliquent une courbe gamma pour mieux s'adapter à la façon dont l'œil humain voit. Les artistes créent aussi leur art à l'écran, de sorte qu'une courbe gamma implicite s'applique à leur art.
zh_cn: 该技术的问题在于计算机监视器应用伽马曲线以更好地适应人眼看到的方式。 艺术家也在屏幕上创作他们的艺术，因此他们的艺术有一个隐含的伽玛曲线应用于它。

source: Linear color space & asset pipeline
fr: Espace couleur linéaire et pipeline de ressource
zh_cn: 线性色彩空间和资源管道

source: Working in HDR is not just pressing a switch. First, imported image assets must be converted to linear space on import. There are two ways to do this:
fr: Travailler en HDR n'est pas seulement appuyer sur un bouton. Tout d'abord, les images importées doivent être converties en espace linéaire lors de l'importation. Il y a deux façons de le faire :
zh_cn: 在HDR中工作不仅仅是按下开关。 首先，导入的图像资源必须在导入时转换为线性空间。 有两种方法可以做到这一点:

source: Hardware sRGB -> linear conversion
fr: Hardware sRGB-> conversion linéaire
zh_cn: 硬件sRGB ->线性转换

source: This is the most correct way to use assets in linear-space, as the texture sampler on the GPU will do the conversion after reading the texel using floating point. This works fine on PC and consoles, but most mobile devices do no support it, or do not support it on compressed texture format (iOS for example).
fr: C'est la façon la plus correcte d'utiliser les ressources dans l'espace linéaire, car l'échantillonneur de texture sur le GPU effectuera la conversion après avoir lu le texel en virgule flottante. Cela fonctionne bien sur PC et consoles, mais la plupart des appareils mobiles ne le supportent pas, ou ne le supportent pas au format texture compressé (iOS par exemple).
zh_cn: 这是在线性空间中使用资源的最正确方法，因为GPU上的纹理采样器将在使用浮点读取纹素后执行转换。 这在PC和控制台上运行良好，但大多数移动设备不支持它，或者不支持压缩纹理格式(例如iOS)。

source: Linear -> sRGB at the end
fr: Linéaire -> sRGB à la fin
zh_cn: 线性 -> sRGB结尾

source: After all the rendering is done, the linear-space rendered image must be converted back to sRGB. To do this, simply enable sRGB conversion in the current :ref:`Environment <class_Environment>` (more on that below).
fr: Une fois le rendu terminé, l'image rendue dans l'espace linéaire doit être convertie en sRGB. Pour ce faire, il suffit d'activer la conversion sRGB dans le fichier courant :ref:`Environment <class_Environment>` (plus d'informations à ce sujet ci-dessous).
zh_cn: 完成所有渲染后，必须将线性空间渲染图像转换回sRGB。 要做到这一点，只需在当前启用sRGB转换 :ref:`Environment <class_Environment>` (更多内容见下文)。

source: Keep in mind that sRGB -> Linear and Linear -> sRGB conversions must always be **both** enabled. Failing to enable one of them will result in horrible visuals suitable only for avant-garde experimental indie games.
fr: Gardez à l'esprit que les conversions sRGB -> Linéaire et Linéaire -> sRGB doivent toujours être **toutes les deux** activées. Si l'une d'entre elles n'est pas activée, il en résultera d'horribles visuels qui ne conviendront qu'aux jeux indépendants expérimentaux d'avant-garde.
zh_cn: 请记住，sRGB ->线性和线性 -> sRGB转换必须始终 **都** 启用。 未能启用其中一个将导致可怕的视觉效果仅适用于前卫的实验性独立游戏。

source: Parameters of HDR
fr: Paramètres de HDR
zh_cn: HDR的参数

source: HDR is found in the :ref:`Environment <class_Environment>` resource. These are found most of the time inside a :ref:`WorldEnvironment <class_WorldEnvironment>` node or set in a camera. There are many parameters for HDR:
zh_cn: HDR可以在 :ref:`Environment <class_Environment>` 资源中找到。 这些在大多数情况下都可以在 :ref:`WorldEnvironment <class_WorldEnvironment>` 节点中找到或在相机中设置。 HDR有许多参数:

source: ToneMapper
zh_cn: 色调映射器

source: The ToneMapper is the heart of the algorithm. Many options for tonemappers are provided:
zh_cn: ToneMapper是算法的核心。 提供了许多色调映射器的选项:

source: **Linear:** Simplest tonemapper. It does its job for adjusting scene brightness, but if the differences in light are too big, it will cause colors to be too saturated.
zh_cn: **线性:** 最简单的色调映射器。 它的作用是调整场景亮度，但是如果光线的差异太大，会导致颜色过饱和。

source: **Log:** Similar to linear but not as extreme.
zh_cn: **日志:** 类似于线性而非极端。

source: Exposure
zh_cn: 曝光

source: The same exposure parameter as in real cameras. Controls how much light enters the camera. Higher values will result in a brighter scene, and lower values will result in a darker scene.
zh_cn: 与真实相机相同的曝光参数。 控制进入相机的光线量。 较高的值将导致更亮的场景，较低的值将导致较暗的场景。

source: White
zh_cn: 白色

source: Maximum value of white.
zh_cn: 白色的最大值。

source: Glow threshold
zh_cn: 发光阈值

source: Glow scale
zh_cn: 发光量表

source: Min luminance
zh_cn: 最低亮度

source: Lower bound value of light for the scene at which the tonemapper stops working. This allows dark scenes to remain dark.
zh_cn: 色调映射器停止工作的场景的光的下限值。 这允许黑暗场景保持黑暗。

source: Max luminance
zh_cn: 最大亮度

source: Upper bound value of light for the scene at which the tonemapper stops working. This allows bright scenes to remain saturated.
zh_cn: 色调映射器停止工作的场景的光的上限值。 这允许明亮的场景保持饱和。

source: Exposure adjustment speed
zh_cn: 曝光调整速度

source: So at what point does all this HDR business come into play? The idea is that instead of dealing with colors that go from black to white (0 to 1), we use colors whiter than white (for example, 0 to 8 times white).
fr: Alors, à quel moment toute cette histoire de HDR entre-t-elle en jeu ? L'idée est qu'au lieu de traiter les couleurs qui vont du noir au blanc (0 à 1), nous utilisons des couleurs plus blanches que le blanc (par exemple, 0 à 8 fois le blanc).

source: After this, the luminance of the scene is computed by averaging the luminance of every pixel of it, and this value is used to bring the scene back to normal ranges. This last operation is called tone-mapping. Finally, we are at a similar place from where we started:
fr: Ensuite, la luminance de la scène est calculée en faisant la moyenne de la luminance de chaque pixel de la scène, et cette valeur est utilisée pour ramener la scène à des plages normales. Cette dernière opération est appelée tone-mapping. Enfin, nous nous trouvons à un endroit similaire à celui où nous avons commencé :

source: The color space where images created on computer monitors exist is called "sRGB". All visual content that people have on their computers or download from the internet (such as pictures, movies, etc.) is in this colorspace.
fr: L’espace colorimétrique où existent les images créées sur les moniteurs d’ordinateur est appelé «sRGB». Tout le contenu visuel que les gens ont sur leurs ordinateurs ou télécharge à partir d’Internet (tels que des images, des films, etc.) est dans cet espace couleur.

source: The mathematics of HDR require that we multiply the scene by different values to adjust the luminance and exposure to different light ranges, and this curve gets in the way, as we need colors in linear space for this.
fr: Les mathématiques du HDR exigent que nous multipliions la scène par différentes valeurs pour ajuster la luminance et l'exposition à différentes plages de lumière, et cette courbe est un obstacle, car nous avons besoin pour cela de couleurs dans l'espace linéaire.

source: sRGB -> linear conversion on image import
fr: sRGB -> conversion linéaire lors de l'importation d'images

source: This is the most compatible way of using linear-space assets, and it will work everywhere, including all mobile devices. The main issue with this is loss of quality, as sRGB exists to avoid this same problem. Using 8 bits per channel to represent linear colors is inefficient from the point of view of the human eye. These textures might later be compressed too, which makes the problem worse.
fr: C'est la façon la plus compatible d'utiliser les ressources de l'espace linéaire, et elle fonctionnera partout, y compris sur tous les appareils mobiles. Le principal problème est la perte de qualité, car le sRGB existe pour éviter ce même problème. Utiliser 8 bits par canal pour représenter les couleurs linéaires est inefficace du point de vue de l'œil humain. Ces textures peuvent aussi être compressées plus tard, ce qui aggrave le problème.

source: In any case, though, this is the easy solution that works everywhere.
fr: Quoi qu'il en soit, c'est la solution facile qui fonctionne partout.
