Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/introduction_to_3d.po
Languages: de, es, zh_cn

source: You can hide the gizmos in the 3D view of the editor through this menu:
de: Sie können die Gizmos in der 3D-Ansicht des Editors über dieses Menü ausblenden:
zh_cn: 您可以通过以下菜单在编辑器的3D视图中隐藏小玩意:

source: To hide a specific type of gizmos, you can toggle them off in the "View" menu.
de: Um eine bestimmte Art von Gizmos auszublenden, können Sie sie im Menü "View" deaktivieren.
zh_cn: 要隐藏特定类型的小玩意，您可以在“视图”菜单中将其关闭。

source: No matter how many objects are placed in the 3D space, nothing will be displayed unless a :ref:`Camera <class_Camera>` is also added to the scene. Cameras can work in either orthogonal or perspective projections:
zh_cn: 无论在3D空间中放置多少物体，除非在场景中添加了 :ref:`相机 <class_Camera>` ，否则不会显示任何内容。 相机可以在正交或透视投影中工作:

source: Cameras are associated with (and only display to) a parent or grandparent viewport. Since the root of the scene tree is a viewport, cameras will display on it by default, but if sub-viewports (either as render target or picture-in-picture) are desired, they need their own children cameras to display.
de: Kameras sind mit einem übergeordneten Ansichtsfenster verbunden (und werden nur dort angezeigt). Da die Wurzel des Szenenbaums ein Ansichtsfenster ist, werden Kameras standardmäßig in diesem angezeigt. Wenn jedoch Unteransichtsfenster (entweder als Rendering-Ziel oder als Bild-im-Bild) gewünscht sind, müssen diese ihre eigenen untergeordneten Kameras anzeigen.
zh_cn: 摄像机与父视图或祖父母视区相关联，仅显示。 由于场景树的根是一个视区，默认情况下会在其上显示摄像机，但如果需要子视区(渲染目标或画中画)，则需要自己的子摄像头才能显示。

source: When dealing with multiple cameras, the following rules are enforced for each viewport:
de: Wenn man mit mehreren Kameras umgeht, werden folgende Regeln für jede Ansicht angewendet:
zh_cn: 处理多台摄像机时，每个视区都遵循以下规则:

source: There is no limitation on the number of lights, nor of types of lights, in Godot. As many as desired can be added (as long as performance allows).
zh_cn: Godot的灯光数量和灯光类型没有限制。 想加多少都可以(只要性能允许)。

source: It is possible to create custom geometry by using the :ref:`ArrayMesh <class_ArrayMesh>` resource directly. Simply create your arrays and use the :ref:`ArrayMesh.add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>` function. A helper class is also available, :ref:`SurfaceTool <class_SurfaceTool>`, which provides a more straightforward API and helpers for indexing, generating normals, tangents, etc.
de: Es ist möglich, benutzerdefinierte Geometrie mithilfe der Ressource :ref:`ArrayMesh <class_ArrayMesh>` direkt zu erstellen. Erstellen Sie einfach Ihre Arrays und verwenden Sie die Funktion :ref:`ArrayMesh.add_surface_from_arrays () <class_ArrayMesh_method_add_surface_from_arrays>`. Es steht auch eine Hilfsklasse zur Verfügung :ref:`SurfaceTool <class_SurfaceTool>`, die eine einfachere API und Hilfen zum Indizieren, Generieren von Normalen, Tangenten usw. bietet.

source: Godot uses the `metric <https://en.wikipedia.org/wiki/Metric_system>`__ system for everything in 3D, with 1 unit being equal to 1 meter. Physics and other areas are tuned for this scale. Therefore, attempting to use a different scale is usually a bad idea (unless you know what you are doing).
de: Godot verwendet für alles das `metrische <https://en.wikipedia.org/wiki/Metric_system>`__ System, wobei eine Einheit einem Meter entspricht. 3D-Physik und andere Bereiche sind darauf abgestimmt, daher ist der Versuch, einen anderen Maßstab zu verwenden, normalerweise eine schlechte Idee (es sei denn, Sie wissen, was Sie tun).

source: Moving objects in the 3D view is done through the manipulator gizmos. Each axis is represented by a color: Red, Green, Blue represent X, Y, Z respectively. This convention applies to the grid and other gizmos too (and also to the shader language, ordering of components for Vector3, Color, etc.).
de: Das Verschieben von Objekten in der 3D-Ansicht erfolgt über die Manipulator-Gizmos. Jede Achse wird durch eine Farbe dargestellt: Rot, Grün, Blau stehen für X, Y bzw. Z. Diese Konvention gilt auch für das Grid und andere Gizmos (und auch für die Shadersprache, die Reihenfolge der Komponenten für Vector3, Color usw.).

source: To snap placement or rotation, press :kbd:`Ctrl` while moving, scaling or rotating.
de: Um die Platzierung oder Drehung einzurasten, drücken Sie :kbd:`Strg` während des Verschiebens, Skalierens oder Drehens.

source: To center the view on the selected object, press :kbd:`F`.
de: Zum Zentrieren der Ansicht auf das ausgewählte Objekt, drücken Sie :kbd:`F`.

source: Translation status
de: Übersetzungsstatus
