Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/introduction_to_3d.po
Languages: de, es, zh_cn

source: Introduction to 3D
de: 3D Einführung
es: Introducción al 3D
zh_cn: 3D简介

source: Creating a 3D game can be challenging. That extra Z coordinate makes many of the common techniques that helped to make 2D games simple no longer work. To aid in this transition, it is worth mentioning that Godot uses similar APIs for 2D and 3D. Most nodes are the same and are present in both 2D and 3D versions. In fact, it is worth checking the 3D platformer tutorial, or the 3D kinematic character tutorials, which are almost identical to their 2D counterparts.
es: Crear un juego en 3D puede ser todo un reto. Esa coordenada Z extra hace que muchas de las técnicas comunes que ayudaron a hacer juegos 2D simples ya no funcionen. Para ayudar en esta transición, vale la pena mencionar que Godot utiliza APIs similares para 2D y 3D. La mayoría de los nodos son iguales y están presentes en las versiones 2D y 3D. De hecho, vale la pena comprobar el tutorial de plataformas 3D, o los tutoriales de personajes cinemáticos 3D, que son casi idénticos a sus homólogos 2D.
zh_cn: 创造一个3D游戏很有挑战性。 多余的Z坐标使许多有助于使2D游戏变得简单的常用技术不再起作用。 为了帮助实现这一转变，值得一提的是，Godot在2D和3D上使用了类似的API。 大多数节点是相同的，并且以2D和3D版本存在。 事实上，看看3D平台游戏教程或3D运动学角色教程是值得的，这些教程大部分与2D游戏相同。

source: In 3D, math is a little more complex than in 2D, so also checking the :ref:`doc_vector_math` in the wiki (which were especially created for game developers, not mathematicians or engineers) will help pave the way into efficiently developing 3D games.
es: En 3D, las matemáticas son un poco más complejas que en 2D, así que también revisar el :ref:`doc_vector_math` en el wiki (que fueron creados especialmente para desarrolladores de juegos, no para matemáticos o ingenieros) ayudará a allanar el camino hacia el desarrollo eficiente de juegos 3D.

source: Spatial node
es: Nodo Spatial
zh_cn: 空间节点

source: :ref:`Node2D <class_Node2D>` is the base node for 2D. :ref:`Control <class_Control>` is the base node for everything GUI. Following this reasoning, the 3D engine uses the :ref:`Spatial <class_Spatial>` node for everything 3D.
es: :ref:`Node2D <class_Node2D>` es el nodo base para 2D. :ref:`Control <class_Control>` es el nodo base para todo el GUI. Siguiendo este razonamiento, el motor 3D utiliza el nodo :ref:`Spatial <class_Spatial>` para todo lo que es 3D.
zh_cn: :ref:`Node2D <class_Node2D>` 是2D的基本节点。 :ref:`Control <class_Control>` 是所有GUI的基本节点。 按照这个推理，3D引擎中的所有3D物体使用 :ref:`Spatial <class_Spatial>` 节点。

source: Spatial nodes have a local transform, which is relative to the parent node (as long as the parent node is also **or inherits** of type Spatial). This transform can be accessed as a 4x3 :ref:`Transform <class_Transform>`, or as 3 :ref:`Vector3 <class_Vector3>` members representing location, Euler rotation (x,y and z angles) and scale.
es: Los nodos Spatial tienen una transformación local, que es relativa al nodo padre (siempre y cuando el nodo padre sea también **heredado** del tipo Spatial). Se puede acceder a esta transformación como un 4x3 :ref:`Transform <class_Transform>`, o como 3 :ref:`Vector3 <class_Vector3>` miembros que representan la ubicación, la rotación de Euler (ángulos x,y y z) y la escala.

source: 3D content
de: 3D Inhalt
es: Contenido 3D
zh_cn: 3D内容

source: Unlike 2D, where loading image content and drawing is straightforward, 3D is a little more difficult. The content needs to be created with special 3D tool (usually referred to as DCCs) and exported to an exchange file format in order to be imported in Godot (3D formats are not as standardized as images).
es: A diferencia de 2D, donde la carga de contenido y dibujo de imágenes es directa, 3D es un poco más difícil. El contenido debe crearse con una herramienta 3D especial (normalmente denominada DCC) y exportarse a un formato de archivo de intercambio para poder importarse en Godot (los formatos 3D no están tan estandarizados como las imágenes).

source: DCC-created models
es: Modelos creados por DCC
zh_cn: DCC 创建的模型

source: There are two pipelines to import 3D models in Godot. The first and most common one is through the :ref:`doc_importing_3d_scenes` importer, which allows to import entire scenes (just as they look in the DCC), including animation, skeletal rigs, blend shapes, etc.
es: Hay dos vías para importar modelos 3D en Godot. La primera y más común es a través del importador :ref:`doc_importing_3d_scenes`, que permite importar escenas completas (tal y como se ven en el DCC), incluyendo animaciones, rigs esqueléticos, blend shapes, etc.

source: The second pipeline is through the :ref:`doc_importing_3d_meshes` importer. This second method allows importing simple .OBJ files as mesh resources, which can be then put inside a :ref:`MeshInstance <class_MeshInstance>` node for display.
es: La segunda vía es a través del importador :ref:`doc_importing_3d_meshes`. Este segundo método permite importar archivos.OBJ simples como recursos de malla, que pueden ser colocados dentro de un nodo :ref:`MeshInstance <class_MeshInstance>` para su visualización.

source: Generated geometry
de: Generierte Geometrie
es: Geometría generada
zh_cn: 生成的几何体

source: It is possible to create custom geometry by using the :ref:`Mesh <class_Mesh>` resource directly. Simply create your arrays and use the :ref:`Mesh.add_surface() <class_Mesh_add_surface>` function. A helper class is also available, :ref:`SurfaceTool <class_SurfaceTool>`, which provides a more straightforward API and helpers for indexing, generating normals, tangents, etc.
es: Es posible crear geometría personalizada usando el recurso :ref:`Mesh <class_Mesh>` directamente. Simplemente crea tus arrays y usa la función :ref:`Mesh.add_surface() <class_Mesh_add_surface>`. También está disponible una clase helper, :ref:`SurfaceTool <class_SurfaceTool>`, que proporciona una API más sencilla y ayuda para indexar, generar normales, tangentes, etc.

source: In any case, this method is meant for generating static geometry (models that will not be updated often), as creating vertex arrays and submitting them to the 3D API has a significant performance cost.
de: In jedem Fall ist diese Methode zum Generieren statischer Geometrie (Modelle, die nicht häufig aktualisiert werden) gedacht, da das Erstellen von Vertex-Arrays und deren Übermittlung an die 3D-API erhebliche Leistungskosten verursacht.
es: En cualquier caso, este método está destinado a generar geometría estática (modelos que no se actualizarán con frecuencia), ya que la creación de arrays de vértices y su envío a la API 3D tiene un coste de rendimiento significativo.
zh_cn: 在任何情况下，这种方法都是为了用于生成静态几何体(不会经常更新的模型)，因为创建顶点数组并将它们提交给3D API具有显著的性能开销。

source: Immediate geometry
de: Unmittelbare Geometrie
es: Geometría inmediata
zh_cn: 立即几何体

source: If, instead, there is a requirement to generate simple geometry that will be updated often, Godot provides a special node, :ref:`ImmediateGeometry <class_ImmediateGeometry>` which provides an OpenGL 1.x style immediate-mode API to create points, lines, triangles, etc.
es: En cambio, si se requiere generar una geometría simple que se actualice con frecuencia, Godot proporciona un nodo especial, :ref:`ImmediateGeometry <class_ImmediateGeometry>` que proporciona una API de modo inmediato estilo OpenGL 1.x para crear puntos, líneas, triángulos, etc.

source: 2D in 3D
es: 2D en 3D
zh_cn: 3D环境下的2D

source: While Godot packs a powerful 2D engine, many types of games use 2D in a 3D environment. By using a fixed camera (either orthogonal or perspective) that does not rotate, nodes such as :ref:`Sprite3D <class_Sprite3D>` and :ref:`AnimatedSprite3D <class_AnimatedSprite3D>` can be used to create 2D games that take advantage of mixing with 3D backgrounds, more realistic parallax, lighting/shadow effects, etc.
de: Während Godot eine leistungsstarke 2D-Engine enthält, verwenden viele Arten von Spielen 2D in einer 3D-Umgebung. Durch die Verwendung einer festen Kamera (entweder orthogonal oder perspektivisch), die sich nicht dreht, können Nodes wie :ref:`Sprite3D <class_Sprite3D>` und :ref:`AnimatedSprite3D <class_AnimatedSprite3D>` verwendet werden, um 2D-Spiele zu erstellen, die das Mischen mit 3D-Hintergründen, realistische Parallax-Effekte, Licht- / Schatteneffekten usw. nutzen.
es: Mientras que Godot cuenta con un potente motor 2D, muchos tipos de juegos utilizan 2D en un entorno 3D. Utilizando una cámara fija (ya sea ortogonal o perspectiva) que no gira, nodos como :ref:`Sprite3D <class_Sprite3D>` y :ref:`AnimatedSprite3D <class_AnimatedSprite3D>` pueden ser usados para crear juegos 2D que se aprovechan de la mezcla con fondos 3D, parallax más realistas, efectos de iluminación/sombra, etc.
zh_cn: 虽然Godot包装了强大的2D引擎，但许多类型的游戏会使用在3D环境中的2D效果。 通过使用不旋转的固定相机(正交或透视)，可以使用诸如 :ref:`Sprite3D <class_Sprite3D>` 和 :ref:`AnimatedSprite3D <class_AnimatedSprite3D>` 等节点来创建混合了具有3D背景，更逼真的视差，灯光/阴影效果等的2D游戏。

source: The disadvantage is, of course, that added complexity and reduced performance in comparison to plain 2D, as well as the lack of reference of working in pixels.
de: Der Nachteil ist natürlich, dass die Komplexität zunimmt und die Leistung im Vergleich zu einfachem 2D, sowie die fehlenden Anhaltspunkte für die Arbeit in Pixeln verringert wird.
es: La desventaja es, por supuesto, que la complejidad añadida y el rendimiento reducido en comparación con 2D simple, así como la falta de referencia de trabajo en píxeles.
zh_cn: 当然，缺点在于与普通2D相比增加了复杂性并降低了与普通2D 相比的性能，以及缺乏使用像素作业的参考。

source: Environment
de: Umgebung
es: Entorno
zh_cn: 环境

source: Besides editing a scene, it is often common to edit the environment. Godot provides a :ref:`WorldEnvironment <class_WorldEnvironment>` node that allows changing the background color, mode (as in, put a skybox), and applying several types of built-in post-processing effects. Environments can also be overridden in the Camera.
de: Neben der Bearbeitung einer Szene ist es häufig üblich, die Umgebung zu bearbeiten. Godot bietet einen :ref:`WorldEnvironment <class_WorldEnvironment>`-Knoten, der es erlaubt, die Hintergrundfarbe, den Modus (z.B. wie setze ich eine Skybox) zu ändern und verschiedene Arten von eingebauten Nachbearbeitungseffekten anzuwenden. Umgebungen können auch in der Kamera überschrieben werden.
es: Además de editar una escena, a menudo es común editar el entorno. Godot proporciona un nodo :ref:`WorldEnvironment <class_WorldEnvironment>` que permite cambiar el color de fondo, el modo (como por ejemplo, poner un skybox), y aplicar varios tipos de efectos de post-procesamiento incorporados. Los entornos también se pueden anular en la cámara.
zh_cn: 除了编辑场景之外，编辑环境通常也很常见。 Godot提供了一个 :ref:`WorldEnvironment <class_WorldEnvironment>` 节点，该节点允许更改背景颜色，模式(例如放置天空盒)以及应用多种内置后处理效果。 相机中也可以覆盖环境。

source: 3D viewport
de: 3D Ansichtsfenster
es: Vista 3D
zh_cn: 3D 视区

source: Editing 3D scenes is done in the 3D tab. This tab can be selected manually, but it will be automatically enabled when a Spatial node is selected.
es: La edición de escenas 3D se realiza en la pestaña 3D. Esta pestaña se puede seleccionar manualmente, pero se habilitará automáticamente cuando se seleccione un nodo Spatial (espacial).
zh_cn: 编辑3D场景可以在3D选项卡中完成。 该选项卡可以手动选择，但在选择Spatial节点时将自动启用。

source: Default 3D scene navigation controls are similar to Blender (aiming to have some sort of consistency in the free software pipeline..), but options are included to customize mouse buttons and behavior to be similar to other tools in Editor Settings:
es: Los controles de navegación de escena 3D predeterminados son similares a Blender (con el objetivo de tener algún tipo de consistencia en el conducto de software libre ...), pero se incluyen opciones para personalizar los botones y el comportamiento del mouse para que sean similares a otras herramientas en Ajustes del Editor:

source: Coordinate system
de: Koordinatensystem
es: Sistema de coordenadas
zh_cn: 坐标系统

source: Godot uses the `metric <https://en.wikipedia.org/wiki/Metric_system>`__ system for everything. 3D Physics and other areas are tuned for this, so attempting to use a different scale is usually a bad idea (unless you know what you are doing).
es: Godot usa el sistema `métrico <https://es.wikipedia.org/wiki/Sistema_m%C3%A9trico_decimal>`__ para todo. La Física 3D y otras áreas están preparadas para esto, por lo que intentar usar una escala diferente suele ser una mala idea (a menos que sepas lo que estás haciendo).
zh_cn: Godot使用`metric <http://en.wikipedia.org/wiki/Metric_system>`__系统来处理所有事情。 3D物理和其他领域都在为此而调整，所以试图使用不同的缩放比例通常是一个坏主意(除非您知道您在做什么)。

source: When working with 3D assets, it's always best to work in the correct scale (set your DCC to metric). Godot allows scaling post-import and, while this works in most cases, in rare situations it may introduce floating point precision issues (and thus, glitches or artifacts) in delicate areas such as rendering or physics. So, make sure your artists always work in the right scale!
es: Al trabajar con recursos 3D, siempre es mejor trabajar en la escala correcta (ajusta el DCC a métrico). Godot permite escalar después de la importación y, aunque esto funciona en la mayoría de los casos, en situaciones poco frecuentes puede presentar problemas de precisión de coma flotante (y por lo tanto, errores o defectos) en áreas delicadas como el renderizado o la física. Por lo tanto ¡asegúrate de que tus artistas siempre trabajen en la escala correcta!

source: The Y coordinate is used for "up", though for most objects that need alignment (like lights, cameras, capsule collider, vehicle, etc.), the Z axis is used as a "pointing towards" direction. This convention roughly means that:
es: La coordenada Y se usa para "arriba", pensado para la mayoría de los objetos que necesitan alineación (como luces, cámaras, colisionador de cápsula, vehículo, etc.), el eje Z se usa como una dirección "apuntando al frente". Esta convención significa aproximadamente que:
zh_cn: Y坐标用于“向上”，但对于大多数需要对齐的物体(如灯光，摄像机，胶囊碰撞体，载具等)，Z轴用作“指向”方向。 这个约定大致意味着:

source: **X** is sides
de: **X** ist seitlich
es: **X** es los lados
zh_cn: ** X **是两边

source: **Y** is up/down
de: **Y** ist hoch/runter
es: **Y** es arriba/abajo
zh_cn: ** Y **是上/下

source: **Z** is front/back
de: **Z** ist vorne/hinten
es: **Z** es adelante/atrás
zh_cn: ** Z **是前/后

source: Space and manipulation gizmos
de: Raum- und Manipulations-Gizmos
es: Gizmos de espacio y manipulación
zh_cn: 空间和可操纵的小控件

source: Moving objects in the 3D view is done through the manipulator gizmos. Each axis is represented by a color: Red, Green, Blue represent X,Y,Z respectively. This convention applies to the grid and other gizmos too (and also to the shader language, ordering of components for Vector3,Color,etc.).
es: El movimiento de objetos en la vista 3D se realiza a través de los gizmos del manipulación. Cada eje está representado por un color: Rojo, Verde, Azul representan X, Y, Z respectivamente. Esta convención se aplica también a la cuadrícula y a otros gizmos (y también al lenguaje de shaders, el orden de los componentes para Vector3, Color, etc.).
zh_cn: 在3D视图中移动对象是通过操纵器小控件完成的。 每个轴用颜色表示:红色，绿色，蓝色分别代表X，Y，Z。 这个约定也适用于格子和其他小控件(也涉及着色器语言，Vector3，Color等组件的排序)。

source: Some useful keybindings:
de: Einige nützliche Tastenkürzel:
es: Algunos keybindings útiles:
zh_cn: 一些有用的键盘绑定:

source: To snap motion or rotation, press the "s" key while moving, scaling or rotating.
es: Para ajustar el movimiento o la rotación, pulsa la tecla "s" mientras te mueves, escalas o giras.

source: To center the view on the selected object, press the "f" key.
es: Para centrar la vista en el objeto seleccionado, pulsar la tecla "f".
zh_cn: 要将视图居中在所选对象上，请按“f”键。

source: View menu
de: Ansicht-Menü
es: Menú Ver
zh_cn: 视图菜单

source: The view options are controlled by the "[ view ]" menu. Pay attention to this little menu inside the window because it is often overlooked!
es: Las opciones de visualización se controlan mediante el menú "[ ver ]". ¡Presta atención a este pequeño menú dentro de la ventana porque a menudo se pasa por alto!

source: Default environment
de: Standard Umgebung
es: Entorno por defecto
zh_cn: 默认环境

source: When created from the Project Manager, the 3D environment has a default sky.
de: Beim Erstellen im Projektmanager hat die 3D-Umgebung einen Standardhimmel.
es: Cuando se crea desde el Administrador de Proyectos, el entorno 3D tiene un cielo por defecto.
zh_cn: 从项目管理器中创建时，3D环境具有默认的天空。

source: Given how physically based rendering works, it is advised to always try to work with a default environment in order to provide indirect and reflected light to your objects.
es: Dada la forma en que funciona la renderización basada en la física, se recomienda intentar siempre trabajar con un entorno predeterminado para proporcionar luz indirecta y reflejada a los objetos.
zh_cn: 鉴于基于物理的渲染工作流程，建议始终使用默认环境，以便为对象提供间接和反射光。

source: Cameras
de: Kameras
es: Cámaras
zh_cn: 相机

source: No matter how many objects are placed in 3D space, nothing will be displayed unless a :ref:`Camera <class_Camera>` is also added to the scene. Cameras can either work in orthogonal or perspective projections:
es: No importa cuántos objetos se coloquen en el espacio 3D, no se mostrará nada a menos que se añada una :ref: `Cámara <class_Camera>` a la escena. Las cámaras pueden trabajar en proyecciones ortogonales o en perspectiva:

source: Cameras are associated with and only display to a parent or grandparent viewport. Since the root of the scene tree is a viewport, cameras will display on it by default, but if sub-viewports (either as render target or picture-in-picture) are desired, they need their own children cameras to display.
es: Las cámaras están asociadas y sólo se muestran en la vista de un padre o abuelo. Dado que la raíz del árbol de escenas es un viewport, las cámaras se mostrarán en él de forma predeterminada, pero si se desean sub-viewports (ya sea como objetivo de render o como imagen-en-imagen), necesitan las cámaras de sus propios hijos para que se muestren.

source: When dealing with multiple cameras, the following rules are followed for each viewport:
es: Cuando se trata de varias cámaras, se siguen las siguientes reglas para cada viewport:

source: If no cameras are present in the scene tree, the first one that enters it will become the active camera. Further cameras entering the scene will be ignored (unless they are set as *current*).
de: Wenn keine Kameras im Szenenbaum vorhanden sind, wird die erste Kamera, die in die Szene eintritt, die aktive Kamera. Weitere Kameras die der Szene betreten werden ignoriert (es sei denn, sie sind als *aktuell* eingestellt).
es: Si no hay cámaras en el árbol de escenas, la primera que entre en él se convertirá en la cámara activa. Otras cámaras que entren en la escena serán ignoradas (a menos que estén configuradas como *actual*).
zh_cn: 如果场景树中没有摄像机，则第一个摄像机将成为活动摄像机。 进入场景的其他摄像机将被忽略(除非它们被设置为 *当前* )。

source: If a camera has the "*current*" property set, it will be used regardless of any other camera in the scene. If the property is set, it will become active, replacing the previous camera.
de: Wenn für eine Kamera die Eigenschaft "*current*" gesetzt ist, wird sie unabhängig von allen anderen Kameras in der Szene verwendet. Wenn die Eigenschaft gesetzt ist, wird sie aktiv und ersetzt die vorherige Kamera.
es: Si una cámara tiene la propiedad "*actual*" establecida, se utilizará independientemente de cualquier otra cámara de la escena. Si la propiedad está configurada, se activará, sustituyendo a la cámara anterior.
zh_cn: 如果相机具有“ *当前* ”属性设置，则无论场景中是否有其他相机，都会使用它。 如果该属性已设置，它将变为活动状态，取代之前的摄像头。

source: If an active camera leaves the scene tree, the first camera in tree-order will take its place.
de: Wenn eine aktive Kamera den Szenenbaum verlässt, wird die erste Kamera in der Baumreihenfolge an ihre Stelle treten.
es: Si una cámara activa deja el árbol de escena, la primera cámara en orden de árbol tomará su lugar.
zh_cn: 如果活动摄像机离开场景树，则按树形顺序排列的第一台摄像机将取代它。

source: Lights
de: Lichter
es: Luces
zh_cn: 灯光

source: There is no limitation on the number of lights nor of types of lights in Godot. As many as desired can be added (as long as performance allows).
es: No hay limitación en el número de luces ni de tipos de luces en Godot. Se pueden añadir tantos como se desee (siempre que el rendimiento lo permita).

source: In 3D, math is a little more complex than in 2D, so also checking the :ref:`doc_vector_math` entry in the wiki (which was especially created for game developers, not mathematicians or engineers) will help pave the way for you to develop 3D games efficiently.
de: In 3D ist Mathematik etwas komplexer als in 2D. Wenn Sie also den Eintrag :ref:`doc_vector_math` im Wiki ansehen (der speziell für Spieleentwickler erstellt wurde, nicht für Mathematiker oder Ingenieure), ebnen Sie sich den Weg zur effizienten 3D-Spiele Entwicklung.
zh_cn: 在3D中，数学比2D更复杂一些，所以看看wiki :ref:`doc_vector_math` (特别是为游戏开发者，而不是数学家或项目师创建的)将有助于为有效开发3D游戏铺平道路。

source: Spatial nodes have a local transform, which is relative to the parent node (as long as the parent node is also of **or inherits** from the type Spatial). This transform can be accessed as a 4x3 :ref:`Transform <class_Transform>`, or as 3 :ref:`Vector3 <class_Vector3>` members representing location, Euler rotation (x,y and z angles) and scale.
zh_cn: 空间节点有一个局部变换，它与父节点相关(只要父节点也是 **或者继承** Spatial类型)。 这个变换可以作为4x3 :ref:`Transform <class_Transform>` 或3个 :ref:`Vector3 <class_Vector3>` 成员来表示位置，欧拉旋转(x，y和z角度)和比例。

source: Unlike 2D, where loading image content and drawing is straightforward, 3D is a little more difficult. The content needs to be created with special 3D tools (usually referred to as DCCs) and exported to an exchange file format in order to be imported in Godot (3D formats are not as standardized as images).
zh_cn: 与2D不同，2D加载图像内容和绘图非常简单，但3D更难一些。 内容需要使用特殊的3D工具(通常称为DCC)创造，并导出为交换文件格式以导入Godot(3D格式不像图像那样标准化)。

source: If, instead, there is a requirement to generate simple geometry that will be updated often, Godot provides a special node, :ref:`ImmediateGeometry <class_ImmediateGeometry>`, which provides an OpenGL 1.x style immediate-mode API to create points, lines, triangles, etc.
zh_cn: 相反，如果需要生成会经常更新的简单几何体，Godot会提供一个特殊节点 :ref:`ImmediateGeometry <class_ImmediateGeometry>` ，它会提供OpenGL 1.x风格的即时模式API来创建点，线 ，三角形等。

source: Default 3D scene navigation controls are similar to Blender (aiming to have some sort of consistency in the free software pipeline..), but options are included to customize mouse buttons and behavior to be similar to other tools in the Editor Settings:
de: Die Standardsteuerelemente für die 3D-Szenennavigation ähneln Blender (mit dem Ziel, eine gewisse Konsistenz in der Pipeline freier Software zu haben...), aber es sind Optionen enthalten, um die Maustasten und das Verhalten so anzupassen, dass es anderen Werkzeugen in den Editor-Einstellungen ähnelt:
zh_cn: 默认的3D场景导航控件类似于Blender(旨在在自由软件管线中具有某种一致性)，但含有用于自定义鼠标按钮和行为的选项，它也与编辑器设置中的其他工具类似:

source: When working with 3D assets, it's always best to work in the correct scale (set your DCC to metric). Godot allows scaling post-import and, while this works in most cases, in rare situations it may introduce floating point precision issues (and thus, glitches or artifacts) in delicate areas, such as rendering or physics, so make sure your artists always work in the right scale!
zh_cn: 在使用3D资源时，最好以正确的比例工作(将您的DCC设置为度量标准)。 Godot允许缩放后导入，尽管这在大多数情况下都适用，但在极少数情况下，它可能会在诸如渲染或物理等敏感区域引入浮点精度问题(并因此引入毛刺或失真)。 所以，确保您的艺术家总是在正确的缩放比例下工作！

source: To snap placement or rotation, press the "s" key while moving, scaling or rotating.
zh_cn: 要快速移动或旋转，请在移动，缩放或旋转时按下“s”键。

source: The view options are controlled by the "View" menu in the viewport's toolbar.
de: Die Ansichtsoptionen werden über das Menü "Ansicht" in der Symbolleiste des Ansichtsfensters gesteuert.
zh_cn: 视图选项由视区工具栏中的“视图”菜单控制。
