Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/lights_and_shadows.po
Languages: fr, ja, zh_cn

source: Spot lights are similar to omni lights, except they emit light only into a cone (or "cutoff"). They are useful to simulate flashlights, car lights, reflectors, spots, etc. This type of light is also attenuated towards the opposite direction it points to.
fr: Les Spot lights sont semblables aux omni lights, sauf qu'elles émettent de la lumière uniquement dans un cône. elles sont utiles pour simuler des lampes de poche, des feux de voiture, des réflecteurs, des spots, etc. Ce type de lumière est également atténué dans la direction opposée vers laquelle elle pointe.
ja: スポットライトはオムニライトと似ていますが、コーン(または「カットオフ」)にのみ光を放出する点が異なります。懐中電灯、車のライト、反射板、スポットなどをシミュレートするのに役立ちます。このタイプのライトは、ライトが指し示す反対方向に向かって(角度が大きくなるほど)減衰します。
zh_cn: 聚光灯类似于全向光，除了它们只发光到锥形(或“截断”)。 它们可用于模拟手电筒，汽车灯，反射器，光点等。这种类型的光也会向其指向的相反方向衰减。

source: Spot lights share the same **Range** and **Attenuation** as **OmniLight**, and add two extra parameters:
fr: Les Spot lights partagent les mêmes **Range** et **Attenuation** que les **OmniLight**, et ajoutent deux paramètres supplémentaires :
ja: スポットライトは **OmniLight** と同じ **Range** および **Attenuation** を共有し、2つのパラメーターを追加します。
zh_cn: 聚光灯和 **Omni Light(全向光)** 共用 **Range(范围)** 和 **Attenuation(衰减)**，并添加两个额外参数:

source: **Angle**: The aperture angle of the light
fr: **Angle** : L’angle d’ouverture de la lumière
ja: **Angle**: ライトの開口角
zh_cn: **Angle(角度)** :光线的光圈角度

source: **Angle Attenuation**: The cone attenuation, which helps soften the cone borders.
fr: **Atténuation d’angle**: l’atténuation de cône, qui aide à adoucir les bords du cône.
ja: **Angle Attenuation**: コーンの減衰。コーンの境界を柔らかくするのに役立ちます。
zh_cn: **Angle Attenuation(角度衰减)** :锥形衰减，有助于软化锥形边界。

source: Spot shadow mapping
fr: Cartographie des ombres de Spot lights
ja: スポットライトのシャドウマッピング
zh_cn: 聚光灯阴影贴图

source: Spots don't need any parameters for shadow mapping. Keep in mind that, at more than 89 degrees of aperture, shadows stop functioning for spots, and you should consider using an Omni light instead.
fr: Les Spot lights n'ont pas besoin de paramètres pour la cartographie des ombres. Gardez à l'esprit qu'à plus de 89 degrés d'ouverture, les ombres cessent de fonctionner pour les Spot lights, et vous devriez envisager d'utiliser un Omni light à la place.
ja: スポットはシャドウマッピングのパラメーターを必要としません。 89度以上の絞りでは、スポットの影が機能しなくなるため、代わりにオムニライトを使用することを検討してください。
zh_cn: 聚光灯不需要任何阴影映射参数。 请记住，在超过89度的光圈下，阴影会停止对聚光灯起作用，你应该考虑使用全向光。

source: Shadow atlas
fr: Atlas d'ombre
ja: Shadow atlas(シャドウアトラス)
zh_cn: 影子图集

source: Unlike Directional lights, which have their own shadow texture, Omni and Spot lights are assigned to slots of a shadow atlas. This atlas can be configured in Project Settings -> Rendering -> Quality -> Shadow Atlas.
fr: Contrairement aux Directional lights, qui ont leur propre texture d'ombre, les Omni lights et Spot lights sont assignées aux emplacements d'un atlas d'ombre. Cet atlas peut être configuré dans Paramètres du projet -> Rendering -> Quality -> Shadow Atlas.
ja: 独自のシャドウテクスチャを持つ指向性ライトとは異なり、オムニライトとスポットライトはシャドウアトラスのスロットに割り当てられます。このアトラスは、[プロジェクト設定] → [Rendering ] → [Quality ] → [Shadow Atlas]で設定できます。
zh_cn: 与具有自己的阴影纹理的定向光不同，全向光和聚光灯被分配了阴影图集的槽位。 可以在Project Settings(项目设置) -> Render(渲染) -> Quality(质量) -> Shadow Atlas(阴影图集) 中配置此图集。

source: The resolution applies to the whole Shadow Atlas. This atlas is divided into four quadrants:
fr: La résolution s'applique à l'ensemble de l'Atlas d'ombres. Cet atlas est divisé en quatre quadrants :
ja: 解像度は、シャドウアトラス全体に適用されます。このアトラスは、4つの象限に分かれています:
zh_cn: 这个分辨率适用于整个影子图集。 该地图集分为四个象限:

source: Each quadrant can be subdivided to allocate any number of shadow maps; the following is the default subdivision:
fr: Chaque quadrant peut être subdivisé pour attribuer un nombre quelconque de cartes des ombres ; la subdivision par défaut est la suivante :
ja: 各象限を細分化して、シャドウマップをいくつでも割り当てることができます。以下はデフォルトのサブディビジョンです:
zh_cn: 每个象限可以细分，分配任意数量的阴影贴图。 以下是默认细分方式:

source: The allocation logic is simple. The biggest shadow map size (when no subdivision is used) represents a light the size of the screen (or bigger). Subdivisions (smaller maps) represent shadows for lights that are further away from view and proportionally smaller.
fr: La logique d'allocation est simple. La plus grande taille de carte d'ombres (lorsqu'aucune subdivision n'est utilisée) représente une lumière de la taille de l'écran (ou plus grande). Les subdivisions (cartes plus petites) représentent les ombres pour les lumières qui sont plus éloignées de la vue et proportionnellement plus petites.
ja: 割り当てロジックは簡単です。最大のシャドウマップサイズ(サブディビジョンが使用されていない場合)は、画面サイズ(またはそれ以上)のライトを表します。サブディビジョン(より小さなマップ)は、視界から遠く、比例的に小さいライトの影を表します。
zh_cn: 分配逻辑很简单。 最大的阴影贴图大小(当不使用细分时)表示一个屏幕大小(或更大)的光。细分区块(较小的贴图)表示远离视图并且成比例地较小的光的阴影。

source: Every frame, the following procedure is performed for all lights:
fr: Pour chaque image, la procédure suivante est exécutée pour toutes les lumières :
ja: すべてのフレームで、すべてのライトに対して次の手順が実行されます:
zh_cn: 每一帧，以下过程被应用于所有光:

source: Check if the light is on a slot of the right size. If not, re-render it and move it to a larger/smaller slot.
fr: Vérifiez si la lumière est sur un emplacement de la bonne taille. Si ce n'est pas le cas, re-rendez-le et déplacez-le dans un emplacement plus grand ou plus petit.
ja: ライトが適切なサイズのスロットにあるかどうかを確認します。そうでない場合は、再レンダリングして、より大きな/より小さなスロットに移動します。
zh_cn: 检查灯光是否在正确大小的插槽上。 如果没有，重新渲染它并将其移动到更大/更小的插槽。

source: Check if any object affecting the shadow map has changed. If it did, re-render the light.
fr: Vérifiez si un objet affectant la carte des ombres a changé. Si c'est le cas, re-rendez la lumière.
ja: シャドウマップに影響するオブジェクトが変更されていないか確認してください。もしそうなら、ライトを再レンダリングします。
zh_cn: 检查影响阴影贴图的任何对象是否已更改。 如果是的话，重新渲染光线。

source: If neither of the above has happened, nothing is done, and the shadow is left untouched.
fr: Si rien de ce qui précède ne s'est produit, rien n'est fait et l'ombre n'est pas touchée.
ja: 上記のいずれも発生していない場合、何も実行されず、影はそのまま残されます。
zh_cn: 如果上述情况均未发生，则不执行任何操作，阴影保持不变。

source: If the slots in a quadrant are full, lights are pushed back to smaller slots, depending on size and distance.
fr: Si les emplacements d'un quadrant sont pleins, les lumières sont repoussées vers des emplacements plus petits, selon la taille et la distance.
ja: 象限のスロットがいっぱいになると、サイズと距離に応じて、ライトは小さなスロットに押し込められます。
zh_cn: 如果一个象限中的槽位满了，光线会被推回到更小的槽位中，取决于大小和距离。

source: This allocation strategy works for most games, but you may want to use a separate one in some cases (for example, a top-down game where all lights are around the same size and quadrants may all have the same subdivision).
fr: Cette stratégie d'allocation fonctionne pour la plupart des jeux, mais vous pouvez en utiliser une autre dans certains cas (par exemple, un jeu de haut en bas où toutes les lumières sont de la même taille et où les quadrants peuvent avoir la même subdivision).
ja: この割り当て戦略は、ほとんどのゲームで機能しますが、場合によっては別のものを使用することもできます(たとえば、すべてのライトが同じサイズで、象限がすべて同じサブディビジョンを持つトップダウンゲーム)。
zh_cn: 此分配策略适用于大多数游戏，但在某些情况下你可能会想用一个单独分开的贴图(例如，一个自上向下看的游戏，其中所有灯光大小大概相同，所有象限的细分可能会具有相同大小)。

source: Shadow filter quality
fr: Qualité du filtre d'ombre
ja: シャドウフィルターの品質
zh_cn: 阴影滤波质量

source: The filter quality of shadows can be tweaked. This can be found in Project Settings -> Rendering -> Quality -> Shadows. Godot supports no filter, PCF5 and PCF13.
fr: La qualité du filtre des ombres peut être modifiée. Cela se trouve dans Paramètres du projet -> Rendering -> Quality -> Shadows. Godot supporte : aucun filtre, PCF5 et PCF13.
ja: 影のフィルター品質を調整できます。これは、[プロジェクト設定] → [Rendering ] → [Quality ] → [Shadows]にあります。 Godotはフィルターなし(Disabled)とPCF5およびPCF13をサポートします。
zh_cn: 可以调整阴影的滤波质量。 这可以在Project Settings(项目设置) -> Rendering(渲染) -> Quality(质量) -> Shadows(阴影)中找到。 Godot支持无滤波，PCF5和PCF13。

source: It affects the blockyness of the shadow outline:
fr: Il affecte l'aspect de bloc du contour de l'ombre :
ja: 影の輪郭のブロック性に影響します:
zh_cn: 它会影响阴影轮廓的块状程度:
