Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/lights_and_shadows.po
Languages: fr, ja, zh_cn

source: Lights and shadows
fr: Lumières et Ombres
zh_cn: 灯光和阴影

source: Introduction
ja: はじめに
zh_cn: 简介

source: Light sources emit light that mixes with the materials and produces a visible result. Light can come from several types of sources in a scene:
fr: Les sources lumineuses émettent une lumière qui se mélange aux matériaux et produit un résultat visible. La lumière peut provenir de plusieurs types de sources dans une scène :
ja: ライトは、マテリアルと混合して目に見える結果を生成する光を発します。光は、シーン内のいくつかのタイプのライトから発生します:
zh_cn: 灯发出的光与材质混合并产生可见的结果。 光可以来自场景中的几种类型的光源:

source: From the Material itself in the form of the emission color (though it does not affect nearby objects unless baked).
fr: De la matière elle-même sous la forme de la couleur d'émission (bien qu'elle n'affecte pas les objets proches à moins qu'elle ne soit préparée).
ja: emission colorの形のマテリアル自体から(ただし、焼き込みをしない限り近くのオブジェクトには影響しません)。
zh_cn: 以自发光颜色(Emission Color)的形式从材质(Material)本身发出，(虽然除非烘培贴图，否则它不会影响附近的物体)。

source: Light Nodes: Directional, Omni and Spot.
fr: Nœuds de lumière : Directional, Omni and Spot.
ja: Lightノード: Directional(指向性)、Omni(オムニ)、Spot(スポット)。
zh_cn: 光节点: 方向光(Directional)，万向光(Omni)，和聚光灯(Spot)。

source: Ambient Light in the :ref:`Environment <class_Environment>`.
fr: Lumière ambiante dans l':ref:`Environnement <class_Environment>`.
ja: :ref:`Environment <class_Environment>` のAmbient Light(環境光)。
zh_cn: :ref:`Environment <class_Environment>` 中的环境光。

source: Baked Light (read :ref:`doc_baked_lightmaps`).
fr: Lumière préparée (read :ref:`doc_baked_lightmaps`).
ja: Baked(焼き込み)ライト(read:ref:`doc_baked_lightmaps`)。
zh_cn: 烘焙光 (参见 :ref:`doc_baked_lightmaps`)。

source: The emission color is a material property. You can read more about it in the :ref:`doc_spatial_material` tutorial.
fr: La couleur d'émission est une propriété matérielle. Vous pouvez en savoir plus dans le tutoriel :ref:`doc_spatial_material`.
ja: emission colorはマテリアルプロパティです。詳細については、\ :ref:`doc_spatial_material` チュートリアルをご覧ください。
zh_cn: 自发光颜色是材质特性。 可以在 :ref:`doc_spatial_material` 教程中阅读更多相关内容。

source: Light nodes
fr: Nœuds de lumière
ja: Lightノード
zh_cn: 光节点

source: There are three types of light nodes: `Directional light`_, `Omni light`_ and `Spot light`_. Let's take a look at the common parameters for lights:
fr: Il existe trois types de nœuds lumière : `Directional light`_, `Omni light`_ et `Spot light`_. Jetons un coup d’œil aux paramètres communs pour les lumières :
ja: Lightノードには、\ `Directional light`_\ 、\ `Omni light`_ \ 、\ `Spot light`_ の3つのタイプがあります。ライトの一般的なパラメーターを見てみましょう:
zh_cn: 如前所述，有三种类型的光节点: 方向光 `Directional light`_ ，万向光 `Omni light`_ 和聚光灯 `Spot light`_ 。让我们来看看光的通用参数:

source: Each one has a specific function:
fr: Chacun a une fonction spécifique :
ja: それぞれに特定の機能があります:
zh_cn: 它们每一个都有特定的功能:

source: **Color**: Base color for emitted light.
fr: **Couleur**: Couleur de base de la lumière émise.
ja: **Color**: 放射する光の基本色。
zh_cn: **Color(颜色)** :发光的基色。

source: **Energy**: Energy multiplier. This is useful for saturating lights or working with :ref:`doc_high_dynamic_range`.
fr: **Energy** : Multiplicateur d'énergie. Ceci est utile pour saturer les lumières ou travailler avec :ref:`doc_high_dynamic_range`.
ja: **Energy**: エネルギー乗数。これは、ライトを飽和させる場合や、\ :ref:`doc_high_dynamic_range` で作業する場合に便利です。
zh_cn: **Energy(能量)** :能量乘数。这对于使灯光饱和或使用 :ref:`doc_high_dynamic_range` 非常有用。

source: **Indirect Energy**: Secondary multiplier used with indirect light (light bounces). This works in baked light or GIProbe.
fr: **Indirect Energy** : Multiplicateur secondaire utilisé avec la lumière indirecte (rebond de la lumière). Cela fonctionne en lumière préparée ou en GIProbe.
ja: **Indirect Energy**: 間接光で使用されるセカンダリ乗数(光の跳ね返り)。これは、焼き込みライトまたはGIProbeで機能します。
zh_cn: **Indirect Energy(间接能量)** :与间接光一起使用的次级乘数(光是会反弹的)。 这适用于烘焙的光线或GIProbe(GI探针)。

source: **Negative**: Light becomes subtractive instead of additive. It's sometimes useful to manually compensate some dark corners.
fr: **Negative** : La lumière devient soustractive au lieu d'être additive. Il est parfois utile de compenser manuellement certains coins sombres.
ja: **Negative**: 光は加算ではなく減算になります。暗い隅を手動で補正すると便利な場合があります。
zh_cn: **Negative(减色)** :光变为减色而不是添加。 手动补偿一些黑暗角落有时很有用。

source: **Specular**: Affects the intensity of the specular blob in objects affected by this light. At zero, this light becomes a pure diffuse light.
fr: **Specular** : Affecte l'intensité de la tache spéculaire dans les objets affectés par cette lumière. A zéro, cette lumière devient une lumière pure et diffuse.
ja: **Specular**: このライトの影響を受けるオブジェクトのスペキュラーblobの強度に影響します。ゼロにすると、この光は純粋な拡散(diffuse)光になります。
zh_cn: **反射(Specular)** :影响受此光影响的物体中镜面反射高光斑点的强度。 在值为零时，该光变为纯漫反射光。

source: **Bake Mode**: Sets the bake mode for the light. For more information see :ref:`doc_baked_lightmaps`
fr: **Bake Mode** : Sélectionne le mode de calcul pour la lumière. Pour plus d'information voire :ref :`doc_baked_lightmaps`
ja: **Bake Mode**: ライトの焼き込み(ベイク)モードを設定します。詳細については、次を参照してください。\ :ref:`doc_baked_lightmaps`
zh_cn: **Bake Mode(烘培模式)** :设置灯光的烘焙模式。有关更多信息，请参见 :ref:`doc_baked_lightmaps`

source: **Cull Mask**: Objects that are in the selected layers below will be affected by this light.
fr: **Cull Mask** : Les objets qui se trouvent dans les calques sélectionnés ci-dessous seront affectés par cette lumière.
ja: **Cull Mask**: 下の選択されたレイヤーにあるオブジェクトは、このライトの影響を受けます。
zh_cn: **Cull Mask(剔除遮罩)** :下面所选图层中的物体会受到此灯光的影响。

source: Shadow mapping
fr: Cartographie des ombres
ja: シャドウマッピング
zh_cn: 阴影贴图

source: Lights can optionally cast shadows. This gives them greater realism (light does not reach occluded areas), but it can incur a bigger performance cost. There is a list of generic shadow parameters, each also has a specific function:
fr: Les lumières peuvent optionnellement projeter des ombres. Cela leur donne plus de réalisme (la lumière n'atteint pas les zones occultées), mais cela peut entraîner un coût de performance plus élevé. Il existe une liste de paramètres d'ombre génériques, chacun ayant également une fonction spécifique :
ja: ライトはオプションで影を落とすことができます。これにより、よりリアルになります(光は遮蔽された領域に届かない)が、パフォーマンスコストが大きくなる可能性があります。一般的なshadowのパラメーターのリストがあり、それぞれに特定の機能があります:
zh_cn: 灯光可以可选地投射阴影。 这使它们具有更好的真实感(光线不会照到被遮挡的区域)，但它会带来更大的性能开销。有一个通用阴影参数列表，每个参数也有一个特定的功能:

source: **Enabled**: Check to enable shadow mapping in this light.
fr: **Enabled** : Cochez cette case pour activer la cartographie des ombres dans cette lumière.
ja: **Enabled**: チェックすると、このライトでシャドウマッピングが有効になります。
zh_cn: **Enabled(启用)** :勾选以启用阴影贴图。

source: **Color**: Areas occluded are multiplied by this color. It is black by default, but it can be changed to tint shadows.
fr: **Color** : Les zones occultées sont multipliées par cette couleur. elle est noire par défaut, mais elle peut être changée pour teinter les ombres.
ja: **Color**: 隠された領域にこの色が掛けられます。デフォルトでは黒ですが、色つきの影に変更できます。
zh_cn: **Color(颜色)** :遮挡的区域会被乘以此颜色。 默认为黑色，但可以更改来给阴影染色。

source: **Bias**: When this parameter is too small, self shadowing occurs. When too large, shadows separate from the casters. Tweak to what works best for you.
fr: **Biais:** Si ce paramètre est trop bas, l'ombre de l'objet risque de se projeter sur lui-même. Si elle est trop élevée, l'ombre se sépare de l'objet à son origine. Régler pour obtenir le meilleur résultat visuel.
ja: **Bias**: このパラメーターが小さすぎると、セルフシャドウ(自分自身に影を落とす)が発生します。大きすぎると、影が投影元から分離します。あなたに最適なものに微調整してください。
zh_cn: **Bias(偏移)** :当此参数太小时，阴影会打在物体自己身上。 当太大时，阴影与物体本体分开。 调整到最适合你的状态。

source: **Contact**: Performs a short screen-space raycast to reduce the gap generated by the bias. Contact shadows are only available when using the GLES3 backend.
fr: **Contact** : Effectue un raycast court dans l'espace de l'écran pour réduire l'espace généré par le biais. Les ombres de contact ne sont disponibles que lors de l'utilisation du backend GLES3.
ja: **Contact**: 短いスクリーンスペースレイキャストを実行して、バイアスによって生成されるギャップを減らします。 Contactは、GLES3バックエンドを使用している場合にのみ使用できます。
zh_cn: **Contact(接触)** :执行一个短促的屏幕空间光线投射，以减少上述偏差产生的间隙。接触阴影仅在使用GLES3后端是可用。

source: **Reverse Cull Faces**: Some scenes work better when shadow mapping is rendered with face-culling inverted.
fr: **Reverse Cull Faces** : Certaines scènes fonctionnent mieux lorsque la cartographie des ombres est rendue avec le face-culling inversé.
ja: **Reverse Cull Faces**: 一部のシーンは、face-cullingを逆にしてシャドウマッピングをレンダリングするとより効果的に動作します。
zh_cn: **Reverse Cull Faces(反向剔除平面)** :某些场景在阴影渲染时, 开启反向平面剔除会工作得更好。

source: Below is an image of what tweaking bias looks like. Default values work for most cases, but in general it depends on the size and complexity of geometry.
fr: Ci-dessous se trouve une image de ce à quoi ressemble un biais d'ajustement. Les valeurs par défaut fonctionnent dans la plupart des cas, mais en général cela dépend de la taille et de la complexité de la géométrie.
ja: 以下は、biasを調整した時の外観のイメージです。ほとんどの場合、デフォルト値で機能しますが、一般的にはジオメトリのサイズと複雑さで変わってきます。
zh_cn: 下图是调整Bias(偏移)的样子。 默认值适用于大多数情况，但通常取决于几何的大小和复杂程度。

source: Finally, if gaps can't be solved, the **Contact** option can help:
fr: Enfin, si les lacunes ne peuvent être résolues, l'option **Contact** peut vous aider :
ja: 最後に、ギャップを解決できない場合は、\ **Contact** オプションが役立ちます:
zh_cn: 最后，如果无法解决间隙，** Contact(接触)** 选项可以帮助:

source: Any sort of bias issues can always be fixed by increasing the shadow map resolution, although that may lead to decreased performance on low-end hardware.
fr: Toutes sortes de problèmes de biais peuvent toujours être corrigés en augmentant la résolution de la carte des ombres, bien que cela puisse conduire à une diminution des performances sur le hardware bas de gamme.
ja: シャドウマップの解像度を上げると、あらゆる種類のバイアスの問題をいつでも修正できますが、ローエンドハードウェアのパフォーマンスが低下する可能性があります。
zh_cn: 任何类型的偏差问题都可以通过增加阴影贴图分辨率来解决，尽管这可能会导致低端硬件性能下降。

source: Directional light
ja: 指向性(Directional)ライト
zh_cn: 方向光

source: This is the most common type of light and represents a light source very far away (such as the sun). It is also the cheapest light to compute and should be used whenever possible (although it's not the cheapest shadow-map to compute, but more on that later).
fr: C'est le type de lumière le plus courant et représente une source lumineuse très éloignée (comme le soleil). C'est aussi la lumière la moins chère à calculer et devrait être utilisée chaque fois que c'est possible (bien que ce ne soit pas la carte des ombres la moins chère à calculer, mais plus à ce sujet ultérieurement).
ja: これは最も一般的なタイプのライトであり、非常に遠くの光源(太陽など)を表します。また、計算するのに最も安価なライトであり、可能な限りこれを使用する必要があります(ただし、計算が最も安価なシャドウマップではありませんが、後で詳しく説明します)。
zh_cn: 这是最常见的光线类型，代表了很远的光源(如太阳)。它也是计算中最便宜的光，应该尽可能使用(虽然它不是计算起来最便宜的阴影贴图，但这点稍后再说)。

source: Directional light models an infinite number of parallel light rays covering the whole scene. The directional light node is represented by a big arrow which indicates the direction of the light rays. However, the position of the node does not affect the lighting at all and can be anywhere.
fr: Directional light modélise un nombre infini de rayons lumineux parallèles couvrant l'ensemble de la scène. Le nœud Directional light est représenté par une grande flèche qui indique la direction des rayons lumineux. Cependant, la position du nœud n'affecte pas du tout l'éclairage et peut être n'importe où.
ja: 指向性ライトは、シーン全体をカバーする無数の平行光線をモデル化します。directional lightノードは、光線の方向を示す大きな矢印で表されます。ただし、ノードの位置は照明にまったく影響せず、どこにでも配置できます。
zh_cn: 定向光模拟覆盖整个场景的无限数量的平行光线。 定向光节点由指示光线方向的大箭头表示。 但是，节点的位置根本不会影响照明，它可以在任何地方。

source: Every face whose front-side is hit by the light rays is lit, while the others stay dark. Most light types have specific parameters, but directional lights are pretty simple in nature, so they don't.
fr: Chaque face dont l'avant est frappé par les rayons lumineux est éclairée, tandis que les autres restent sombres. La plupart des types d'éclairage ont des paramètres spécifiques, mais les Directional light sont assez simples par nature, donc ils n'en ont pas.
ja: 前面が光線に当たっているすべての面が照らされ、他の面は暗くなります。ほとんどのライトタイプには特定のパラメーターがありますが、指向性ライトは本質的に非常に単純であるため、そのようなものはありません。
zh_cn: 每个表面的正面被光线照射，而其他部分则保持黑暗。 大多数灯光类型都有特定的参数，但定向灯本质上非常简单，所以它们没有。

source: Directional shadow mapping
fr: Cartographie des ombres directionnelles
ja: 指向性ライトのシャドウマッピング
zh_cn: 方向光阴影贴图

source: To compute shadow maps, the scene is rendered (only depth) from an orthogonal point of view that covers the whole scene (or up to the max distance). There is, however, a problem with this approach because objects closer to the camera receive blocky shadows.
fr: Pour calculer les cartes des ombres, la scène est rendue (uniquement en profondeur) d'un point de vue orthogonal qui couvre toute la scène (ou jusqu'à la distance maximale). Il y a cependant un problème avec cette approche car les objets plus proches de la caméra reçoivent des ombres pixelisées.
ja: シャドウ マップを計算するには、シーン全体をカバーする直交する視点(または最大距離まで)からシーンがレンダリングされます(奥行のみ)。しかしこれでは、カメラに近いオブジェクトはブロック状の影を受けるため、この方法には問題があります。
zh_cn: 为了计算阴影贴图，会从正交视图(仅深度)渲染整个场景(或直到最大距离)。但是，这种方法存在问题，因为靠近相机的物体会得到块状阴影。

source: To fix this, a technique named "Parallel Split Shadow Maps" (or PSSM) is used. This splits the view frustum in 2 or 4 areas. Each area gets its own shadow map. This allows small areas close to the viewer to have the same shadow resolution as a huge, far-away area.
fr: Pour résoudre ce problème, une technique appelée "Parallel Split Shadow Maps" (ou PSSM) est utilisée. Ceci divise le tronc de la vue en 2 ou 4 zones. Chaque région a sa propre carte de ombres. Cela permet à de petites zones proches du spectateur d'avoir la même résolution d'ombre qu'une grande zone éloignée.
ja: これを修正するには、"Parallel Split Shadow Maps"(またはPSSM)という名前の手法を使用します。これにより、フラスタム(視錐台)が2つまたは4つの領域に分割されます。各エリアには独自のシャドウマップがあります。これにより、視点に近い小さな領域は、遠くの大きな領域と同じ影の解像度を持つことができます。
zh_cn: 为了解决这个问题，使用了名为“Parallel Split Shadow Maps”(平行分割阴影，或PSSM)的技术。 这将视锥体分成2或4个区域。每个区域都有自己的阴影贴图。 这允许靠近观察者的小区域具有与巨大的遥远区域相同的阴影分辨率。

source: With this, shadows become more detailed:
fr: Avec cela, les ombres deviennent plus détaillées :
ja: これにより、影がより詳細になります:
zh_cn: 有了它，阴影变得更加详细:

source: To control PSSM, a number of parameters are exposed:
fr: Pour contrôler le PSSM, un certain nombre de paramètres sont exposés :
ja: PSSMを制御するために、いくつかのパラメーターが公開されています:
zh_cn: 为了控制PSSM，暴露了许多参数:

source: Each split distance is controlled relative to the camera far (or shadow **Max Distance** if greater than zero), so *0.0* is the eye position and *1.0* is where the shadow ends at a distance. Splits are in-between. Default values generally work well, but tweaking the first split a bit is common to give more detail to close objects (like a character in a third person game).
fr: Chaque distance divisée est contrôlée par rapport à la distance de la caméra (ou l'ombre **Max Distance** si supérieure à zéro), donc *0,0* est la position de l'œil et *1,0* est la position où l'ombre se termine à une distance. Les divisions sont entre les deux. Les valeurs par défaut fonctionnent généralement bien, mais il est courant d'ajuster un peu le premier fractionnement pour donner plus de détails aux objets proches (comme un personnage dans un jeu à la troisième personne).
ja: 各Split(分割)距離はカメラのFarを基準にして制御されるため(または、値が0より大きい場合はshadowの **Max Distance**)、\ *0.0* は目の位置で、\ *1.0* は影の処理が行われなくなる場所です。Splitはその中間にあります。通常、デフォルト値は適切に機能しますが、最初のSplitを少し調整することで、近くのオブジェクト(第三者のゲームのキャラクターなど)に精緻さを与えることが一般的です。
zh_cn: 每个分割距离都是相对于相机最远处(或阴影 **Max Distance(最大距离)** ，如果大于零)控制的，因此 *0.0* 是眼睛位置， *1.0* 是阴影在一定距离处结束的位置。分割介于两者之间。 默认值通常效果很好，但调整第一个分割数值是很常见的，可以为近处对象提供更多细节(比如第三人称游戏中的角色)。

source: Always make sure to set a shadow *Max Distance* according to what the scene needs. A lower maximum distance will result in better-looking shadows.
fr: Veillez toujours à définir une ombre *Max Distance* en fonction des besoins de la scène. Une distance maximale plus faible donnera de meilleures ombres.
ja: 必ず、シーンに必要な内容に応じてShadowの *Max Distance* を設定してください。最大距離を短くすると、影の見栄えが良くなります。
zh_cn: 始终确保根据场景需要设置阴影 *Max Distance(最大距离)* 。 最大距离越近，阴影的质量越高。

source: Sometimes, the transition between a split and the next can look bad. To fix this, the **"Blend Splits"** option can be turned on, which sacrifices detail in exchange for smoother transitions:
fr: Parfois, la transition entre une séparation et la suivante peut sembler mauvaise. Pour résoudre ce problème, l'option **"Blend Splits "** peut être activée, ce qui sacrifie les détails en échange de transitions plus fluides :
ja: 場合によっては、スプリットと次のスプリットとの間の移行が悪く見える場合があります。これを修正するには、\ **"Blend Splits"** オプションをオンにします。これにより、スムーズな移行と引き換えに精細度が犠牲になります:
zh_cn: 有时，一个分割与下一个之间的过渡看起来很糟糕。 要解决此问题，可以打开 **"Blend Splits"(混合分割)** 选项，牺牲细节以换取更平滑的过渡:

source: The **"Normal Bias"** parameter can be used to fix special cases of self shadowing when objects are perpendicular to the light. The only downside is that it makes the shadow a bit thinner.
fr: Le paramètre **"Normal Bias "** peut être utilisé pour fixer des cas particuliers d'ombrage automatique lorsque les objets sont perpendiculaires à la lumière. Le seul inconvénient est que cela rend l'ombre un peu plus mince.
ja: **"Normal Bias"** パラメーターを使用して、オブジェクトがライトに垂直な場合のセルフシャドウイングの特殊なケースを修正できます。唯一の欠点は、影が少し薄くなることです。
zh_cn: 当物体垂直于光线时，**"Normal Bias"(法线偏差)** 参数可用于修复自阴影的特殊情况。 唯一的缺点是它使阴影更薄。

source: The **"Bias Split Scale"** parameter can control extra bias for the splits that are far away. If self shadowing occurs only on the splits far away, this value can fix them.
fr: Le paramètre **"Bias Split Scale "** permet de contrôler le biais supplémentaire pour les divisions éloignées. Si l'ombrage automatique ne se produit que sur les fentes éloignées, cette valeur peut arranger ça.
ja: **"Bias Split Scale"** パラメーターは、遠く離れたスプリットの追加バイアスを制御できます。セルフシャドウイングが遠く離れたスプリットでのみ発生する場合、この値はそれらを修正できます。
zh_cn: **"Bias Split Scale"(偏差分割缩放)** 参数可以控制远处分割的额外偏差。 如果仅在远处的分割上发生自阴影，则此值可以修复它们。

source: Finally, the **"Depth Range"** has two settings:
fr: Enfin, la **"Depth Range "** a deux réglages :
ja: 最後に、\ **"Depth Range"** には2つの設定があります:
zh_cn: 最后， **"Depth Range"(深度范围)** 有两个设置:

source: **Stable**: Keeps the shadow stable while the camera moves, and the blocks that appear in the outline when close to the shadow edges remain in-place. This is the default and generally desired, but it reduces the effective shadow resolution.
fr: **Stable** : Garde l'ombre stable pendant que la caméra se déplace, et les blocs qui apparaissent dans le contour à proximité des bords de l'ombre restent en place. C'est le réglage par défaut et généralement souhaité, mais il réduit la résolution effective de l'ombre.
ja: **Stable**: カメラが動いている間、影を安定に保ちます。また、影のエッジに近いときにアウトラインに表示されるブロックはそのまま残ります。これはデフォルトであり、一般的に望ましいものですが、有効な影の解像度が低下します。
zh_cn: **Stable(稳定)** :在相机移动时保持阴影稳定，并且当靠近阴影边缘时出现在轮廓中的块保持原位。 这是默认, 通常想要的设置，但会降低有效的阴影分辨率。

source: **Optimized**: Tries to achieve the maximum resolution available at any given time. This may result in a "moving saw" effect on shadow edges, but at the same time the shadow looks more detailed (so this effect may be subtle enough to be forgiven).
fr: **Optimisé** : Essaie d'atteindre la résolution maximale disponible à tout moment. Il peut en résulter un effet de "scie en mouvement" sur les bords de l'ombre, mais en même temps l'ombre semble plus détaillée (donc cet effet peut être assez subtil pour être pardonné).
ja: **Optimized**: 常に利用可能な最大解像度を達成しようとします。これにより、影の端に「動くのこぎり」効果が生じる場合がありますが、同時に影はより詳細に見えます(なので、この効果は許されるほど微妙な場合があります)。
zh_cn: **Optimized(最优)** :会尝试在任何给定时间达到最大可用分辨率。 这可能会导致阴影边缘出现“移动锯”效果，但同时阴影看起来更加细致(因此这种效果可能非常轻微，可以被原谅)。

source: Just experiment which setting works better for your scene.
fr: Expérimentez simplement quel réglage convient le mieux à votre scène.
ja: シーンに適した設定を試してみてください。
zh_cn: 尝试哪种设置更适合你的场景。

source: Shadowmap size for directional lights can be changed in Project Settings -> Rendering -> Quality:
fr: La taille de la carte des ombres pour les éclairages directionnels peut être modifiée dans Paramètres du projet -> Rendering -> Quality :
ja: 指向性ライトのシャドウマップサイズは、[プロジェクト設定] → [Rendering ] → [Quality]で変更できます:
zh_cn: 可以在Project Settings(项目设置) ->Rendering(渲染) ->Quality(质量)中更改方向光的阴影贴图大小:

source: Increasing it can solve bias problems, but decrease performance. Shadow mapping is an art of tweaking.
fr: L'augmenter peut résoudre des problèmes de biais, mais diminue la performance. La cartographie des ombres est l'art de l'ajustement.
ja: 値を大きくすると、バイアスの問題は解決できますが、パフォーマンスは低下します。シャドウマッピングは微調整の技術です。
zh_cn: 增加它可以解决偏差问题，但会降低性能。 阴影贴图（Shadow mapping）是一门调整的艺术。

source: Omni light
ja: オムニ(Omni/全方位)ライト
zh_cn: 全向光

source: Omni light is a point source that emits light spherically in all directions up to a given radius.
fr: Omni light est une source ponctuelle qui émet une lumière sphérique dans toutes les directions jusqu'à un rayon donné.
ja: オムニライトは、特定の半径までのすべての方向に球形に光を放射する点光源です。
zh_cn: 全向光是一种点光源，可在所有方向上发射光，直至给定半径。

source: In real life, light attenuation is an inverse function, which means omni lights don't have a radius. This is a problem because it means computing several omni lights would become demanding.
fr: Dans la vie réelle, l'atténuation de la lumière est une fonction inverse, ce qui signifie que les lumières omnidirectionnelles n'ont pas de rayon. C'est un problème car cela signifie que le calcul de plusieurs Omni light deviendrait exigeant.
ja: 実際には、光の減衰は逆関数です。つまり、オムニライトには半径があるわけではありません。これは、複数のオムニライトの計算が要求されるようになることを意味するため、問題です。
zh_cn: 在现实生活中，光衰减是个和距离成反比的函数，这意味着全向光没有半径。这是一个问题，因为这意味着计算几个全向光会变得很困难。

source: To solve this, a *Range* is introduced together with an attenuation function.
fr: Pour résoudre ce problème, une *Range* est introduite avec une fonction d'atténuation.
ja: これを解決するために、Attenuation(減衰)関数とともに *Range* が導入されています。
zh_cn: 为了解决这个问题，引入了 *Range(范围)* 和衰减函数。

source: These two parameters allow tweaking how this works visually in order to find aesthetically pleasing results.
fr: Ces deux paramètres permettent d'ajuster visuellement le fonctionnement afin d'obtenir des résultats esthétiques.
ja: これらの2つのパラメーターを使用すると、視覚的に美しい結果を得るために、これが視覚的にどのように機能するかを微調整できます。
zh_cn: 这两个参数允许调整其在视觉上的工作方式，以便找到美学上令人愉悦的结果。

source: Omni shadow mapping
fr: Cartographie des ombres de Omni lights
ja: オムニライトのシャドウマッピング
zh_cn: 全向光阴影贴图

source: Omni light shadow mapping is relatively straightforward. The main issue that needs to be considered is the algorithm used to render it.
fr: La cartographie des ombres dû à un Omni light est relativement simple. Le principal problème à considérer est l'algorithme utilisé pour le rendu.
ja: オムニライトのシャドウマッピングは比較的簡単です。考慮する必要がある主な問題は、レンダリングに使用されるアルゴリズムです。
zh_cn: 全方位光影贴图相对简单。 需要考虑的主要问题是用于渲染它的算法。

source: Omni Shadows can be rendered as either **"Dual Paraboloid" or "Cube Mapped"**. The former renders quickly, but can cause deformations, while the later is more correct, but costlier.
fr: Les ombres omnidirectionnelles peuvent être rendues comme **"Dual Paraboloid" ou "Cube Mapped "**. Le premier rend rapidement, mais peut causer des déformations, tandis que le second est plus correct, mais plus coûteux.
ja: オムニシャドウは、\ **"Dual Paraboloid" または "Cube Mapped"** としてレンダリングできます。前者はすばやくレンダリングされますが、変形を引き起こす可能性があり、後者はより正確ですが、コストがかかります。
zh_cn: 全向光阴影可以渲染为 **"Dual Paraboloid"(双抛物面)或"Cube Mapped"(方形映射)**。 前者渲染速度很快但会导致变形，而后者更正确但成本更高。

source: If the objects being rendered are mostly irregular, Dual Paraboloid is usually enough. In any case, as these shadows are cached in a shadow atlas (more on that at the end), it may not make a difference in performance for most scenes.
fr: Si les objets rendus sont le plus souvent irréguliers, Dual Paraboloid est généralement suffisant. Quoi qu'il en soit, comme ces ombres sont cachées dans un atlas d'ombres (plus de détails à la fin), cela peut ne pas faire de différence de performance pour la plupart des scènes.
ja: レンダリングされるオブジェクトの大部分が不規則な場合、通常はDual Paraboloidで十分です。いずれにせよ、これらのシャドウはシャドウアトラスにキャッシュされるため(詳細については最後に説明します)、ほとんどのシーンでパフォーマンスに違いが生じることはありません。
zh_cn: 如果渲染的对象大部分是不规则的，那么Dual Paraboloid 通常就足够了。 无论怎么说，由于这些阴影被缓存在阴影图集中(后面会详细讲)，对于大多数场景而言，它可能不会对性能产生影响。

source: Spot light
ja: スポット(Spot)ライト
zh_cn: Spot Light(聚光灯)
