Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/spatial_material.po
Languages: fr, ja

source: Render priority
fr: Priorité de rendu
ja: Render priority(レンダリングの優先度)

source: The rendering order of objects can be changed, although this is mostly useful for transparent objects (or opaque objects that perform depth draw but no color draw, such as cracks on the floor).
fr: L'ordre de rendu des objets peut être modifié, bien que cela soit surtout utile pour les objets transparents (ou les objets opaques qui dessinent en profondeur mais pas en couleur, comme les fissures sur le sol).
ja: オブジェクトのレンダリング順序は変更できますが、これは主に透明なオブジェクト(または、床の亀裂などの深さの描画は行うが色の描画は行わない不透明なオブジェクト)に役立ちます。

source: Spatial Material
ja: Spatial(空間)マテリアル

source: Introduction
ja: はじめに

source: Transparent
ja: Transparent(透過)

source: Ensure Correct Normals
ja: Ensure Correct Normals(正しい法線を確保する)

source: Billboard Keep Scale
ja: Billboard Keep Scale(ビルボードキープスケール)

source: Albedo
ja: Albedo(アルベド)

source: Rim
ja: Rim(縁)

source: Transmission
ja: Transmission(トランスミッション)
