Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/spatial_material.po
Languages: fr, ja

source: ``SpatialMaterial`` is a default 3D material that aims to provide most of the features artists look for in a material, without the need for writing shader code. However, it can be converted to shader code if additional functionality is needed.
fr: Le ``SpatialMaterial`` est un matériau 3D par défaut qui vise à fournir la plupart des caractéristiques que les artistes recherchent dans un matériau, sans qu'il soit nécessaire d'écrire du code de shader. Cependant, il peut être converti en code shader si des fonctionnalités supplémentaires sont nécessaires.
ja: ``SpatialMaterial`` は、シェーダーコードを記述する必要なしに、アーティストがマテリアルで探すほとんどの機能を提供することを目的としたデフォルトの3Dマテリアルです。ただし、追加の機能が必要な場合は、シェーダーコードに変換できます。

source: This tutorial explains most parameters present in ``SpatialMaterial``.
fr: Ce tutoriel explique la plupart des paramètres présents dans ``SpatialMaterial``.
ja: このチュートリアルでは、\ ``SpatialMaterial`` に存在するほとんどのパラメーターについて説明します。

source: There are three ways to add a ``SpatialMaterial`` to an object. It can be added in the *Material* property of the mesh. It can be added in the *Material* property of the node using the mesh (such as a MeshInstance node), or in the *Material Override* property of the node using the mesh.
fr: Il existe trois façons d'ajouter un ``SpatialMaterial`` à un objet. Il peut être ajouté dans la propriété *Material* du maillage. Il peut être ajouté dans la propriété *Material* du nœud qui utilise le maillage (tel qu'un nœud MeshInstance), ou dans la propriété *Material Override* du nœud qui utilise le maillage.
ja: オブジェクトに ``SpatialMaterial`` を追加するには3つの方法があります。メッシュの *Material* プロパティに追加できます。メッシュを使用するノード(MeshInstanceノードなど)の *Material* プロパティ、またはメッシュを使用するノードの *Material Override* プロパティに追加できます。

source: If you add a material to the mesh itself, every time that mesh is used it will have that material. If you add a material to the node using the mesh, the material will only be used by that node, it will also override the material property of the mesh. If a material is added in the *Material Override* property of the node, it will only be used by that node. It will also override the regular material property of the node and the material property of the mesh.
fr: Si vous ajoutez un matériau au maillage lui-même, à chaque fois que ce maillage est utilisé, il aura ce matériau. Si vous ajoutez un matériau au nœud qui utilise le maillage, le matériau ne sera utilisé que par ce nœud, et remplacera également la propriété de matériau du maillage. Si un matériau est ajouté dans la propriété *Material Override* du nœud, il ne sera utilisé que par ce nœud. Il remplacera également la propriété de matériau ordinaire du nœud et la propriété de matériau du maillage.
ja: メッシュ自体にマテリアルを追加すると、そのメッシュが使用されるたびにそのマテリアルが追加されます。メッシュを使用してノードにマテリアルを追加すると、マテリアルはそのノードでのみ使用され、メッシュのマテリアルプロパティもオーバーライドします。マテリアルがノードの *Material Override* プロパティに追加された場合、そのノードでのみ使用されます。また、ノードの通常のマテリアルプロパティとメッシュのマテリアルプロパティもオーバーライドします。

source: Flags
fr: Drapeaux
ja: フラグ(Flags)

source: Spatial materials have many flags determining the general usage of a material.
fr: Les SpatialMaterial ont de nombreuses options qui déterminent l'utilisation générale d'un matériau.
ja: Spatialマテリアルには、マテリアルの一般的な使用を決定する多くのフラグがあります。

source: In Godot, materials are not transparent unless specifically configured to be. The main reason behind this is that transparent materials are rendered using a different technique (sorted from back to front and rendered in order).
fr: Dans Godot, les matériaux ne sont pas transparents à moins qu'ils ne soient spécifiquement configurés pour l'être. La raison principale en est que les matériaux transparents sont rendus selon une technique différente (triés de l'arrière vers l'avant et rendus dans l'ordre).
ja: Godotでは、特別に構成されていない限り、マテリアルは透明ではありません。この背後にある主な理由は、透明なマテリアルが異なる手法を使用してレンダリングされることです(背面から前面にソートされ、順番にレンダリングされます)。

source: This technique is less efficient (many state changes happen) and makes the materials unusable with many mid- and post-processing effects (such as SSAO, SSR, etc.) that require perfectly opaque geometry.
fr: Cette technique est moins efficace (de nombreux changements d'état se produisent) et rend les matériaux inutilisables avec de nombreux effets mi et post-traitement (tels que SSAO, SSR, etc.) qui nécessitent une géométrie parfaitement opaque.
ja: この手法は効率が低く(多くの状態変化が起こる)、完全に不透明なジオメトリを必要とする多くの中間および後処理効果(SSAO、SSRなど)でマテリアルを使用できなくなります。

source: For this reason, materials in Godot are assumed opaque unless specified otherwise. The main settings that enable transparency are:
fr: Pour cette raison, les matériaux dans Godot sont supposés opaques, sauf indication contraire. Les principaux paramètres qui permettent la transparence sont :
ja: このため、特に指定しない限り、Godotのマテリアルは不透明であると見なされます。透過性を有効にする主な設定は次のとおりです:

source: Transparent flag (this one)
fr: L'option Transparent (celle-ci)
ja: Transparentフラグ(この項目)

source: Blend mode set to other than "Mix"
fr: Mode de mélange réglé sur un mode autre que "Mix"
ja: "Mix"以外に設定されたブレンドモード

source: Enabling distance or proximity fade
fr: Activer le fondu de distance ou de proximité
ja: 距離または近接フェードの有効化

source: Use Shadow to Opacity
fr: Utiliser l'ombre pour l'opacité
ja: Use Shadow to Opacity(影を不透明度に使用)

source: Lighting modifies the alpha so shadowed areas are opaque and non-shadowed areas are transparent. Useful for overlaying shadows onto a camera feed in AR.
fr: L'éclairage modifie la transparence alpha de sorte que les zones ombrées soient opaques et les zones non ombrées soient transparentes. Cela peut servir à surimposer des ombres sur des images fournie par une caméra en réalité augmentée.
ja: ライティングはアルファを修正し、影のある領域は不透明になり、影のない領域は透明になります。 ARのカメラフィードに影を重ねるのに便利です。

source: Unshaded
fr: Sans ombre
ja: Unshaded(影なし)

source: In most cases it is common for materials to be affected by lighting (shaded).
fr: Dans la plupart des cas, il est courant que les matériaux soient affectés par l'éclairage (ombre).
ja: ほとんどの場合、マテリアルは照明(シェーディング)の影響を受けることが一般的です。

source: However, in some cases you might want to show just the albedo (color) and ignore the rest. Toggling this flag on will remove all shading and display pure, unlit color.
fr: Cependant, dans certains cas, vous pouvez afficher uniquement l'albédo (couleur) et ignorer le reste. L'activation de cette option supprimera toutes les ombres et affichera les couleurs pures et non éclairées.
ja: ただし、場合によっては、アルベド(色)のみを表示し、残りは無視したい場合があります。このフラグをオンに切り替えると、すべてのシェーディングが削除され、照明の影響を受けていない元々の色が表示されます。

source: Vertex Lighting
fr: Éclairage de sommet
ja: Vertex Lighting(頂点照明)

source: Godot has a more or less uniform cost per pixel thanks to depth pre-pass. All lighting calculations are made by running the lighting shader on every pixel.
fr: Godot a un coût par pixel plus ou moins uniforme grâce au pré-passage de profondeur. Tous les calculs d'éclairage sont effectués en exécutant le shader d'éclairage sur chaque pixel.
ja: Godotでは深度プリパスのおかげで、ピクセルあたりのコストはほぼ均一です。すべての照明計算は、すべてのピクセルで照明シェーダーを実行することによって行われます。

source: As these calculations are costly, performance can be brought down considerably in some corner cases such as drawing several layers of transparency (which is common in particle systems). Switching to per-vertex lighting may help in these cases.
fr: Comme ces calculs sont coûteux, les performances peuvent être considérablement réduites dans certains cas particuliers, comme le dessin de plusieurs couches de transparence (ce qui est courant dans les systèmes de particules). Dans ces cas, il peut être utile de passer à l'éclairage par sommet.
ja: これらの計算にはコストがかかるため、いくつもの透明度を持つレイヤーを描画する場合などの、一部のコーナーケース(極まれで厄介なケース)ではパフォーマンスが大幅に低下する可能性があります(これはパーティクルシステムでは一般的です)。これらの場合、頂点ごとの照明に切り替えると役立つ場合があります。

source: Additionally, on low-end or mobile devices, switching to vertex lighting can considerably increase rendering performance.
fr: De plus, sur les appareils bas de gamme ou mobiles, le passage à l'éclairage de sommet peut considérablement augmenter les performances de rendu.
ja: さらに、ローエンドまたはモバイルデバイスでは、頂点照明(vertex lighting)に切り替えると、レンダリングパフォーマンスが大幅に向上します。

source: Keep in mind that when vertex lighting is enabled, only directional lighting can produce shadows (for performance reasons).
fr: Gardez à l'esprit que lorsque l'éclairage de sommet est activé, seul l'éclairage directionnel peut produire des ombres (pour des raisons de performance).
ja: vertex lightingを有効にすると、指向性のライティングのみが影を生成できることに注意してください(パフォーマンス上の理由から)。

source: No Depth Test
fr: Aucun test de profondeur
ja: No Depth Test(深度テスト無し)

source: In order for close objects to appear over far away objects, depth testing is performed. Disabling it has the result of objects appearing over (or under) everything else.
fr: Pour que des objets proches apparaissent au-dessus d'objets éloignés, des tests de profondeur sont effectués. Sa désactivation a pour conséquence l'apparition d'objets au-dessus (ou au-dessous) de tout le reste.
ja: 近くのオブジェクトを遠くのオブジェクトの上に表示するために、深度テストが実行されます。無効にすると、オブジェクトが他のすべての上(または下)に表示されます。

source: Disabling this makes the most sense for drawing indicators in world space, and works very well with the *Render Priority* property of Material (see the bottom of this page).
fr: Désactiver cette option est utile pour dessiner des indicateurs dans l'espace du monde et fonctionne très bien avec la propriété *Render Priority* du matériel (voir le bas de cette page).
ja: これを無効にすることは、ワールド空間でインジケータを描画する場合に最適で、Materialの *Render Priority* プロパティともに非常にうまく機能します(このページの下部を参照)。

source: Use Point Size
fr: Utiliser la taille de point
ja: Use Point Size(ポイントのサイズを使用)

source: This option is only effective when the geometry rendered is made of points (generally it's made of triangles when imported from 3D DCCs). If so, then those points can be resized (see below).
fr: Cette option n'est efficace que lorsque la géométrie rendue est constituée de points (en général, elle est constituée de triangles lorsqu'elle est importée d'un DCC 3D). Si c'est le cas, ces points peuvent être redimensionnés (voir ci-dessous).
ja: このオプションは、レンダリングされるジオメトリがポイントで構成されている場合にのみ有効です(3D DCCからインポートされる場合、通常は三角形で構成されます)。その場合、それらのポイントのサイズを変更できます(以下を参照)。

source: World Triplanar
fr: Monde Triplanaire
ja: World Triplanar(ワールド空間でのTriplanar)

source: When using triplanar mapping (see below, in the UV1 and UV2 settings), triplanar is computed in object local space. This option makes triplanar work in world space.
fr: Lors de l'utilisation de la cartographie triplanaire (voir ci-dessous, dans les réglages UV1 et UV2), le triplanaire est calculé dans l'espace local de l'objet. Cette option permet de faire fonctionner le triplanaire dans l'espace du monde.
ja: Triplanarマッピングを使用する場合(UV1およびUV2設定で以下を参照)、Triplanarはオブジェクトのローカル空間で計算されます。このオプションは、ワールド空間でTriplanarを機能させます。

source: Fixed Size
fr: Taille fixe
ja: Fixed Size(固定サイズ)

source: This causes the object to be rendered at the same size no matter the distance. This is useful mostly for indicators (no depth test and high render priority) and some types of billboards.
fr: L'objet est ainsi rendu à la même taille quelle que soit la distance. Ceci est surtout utile pour les indicateurs (pas de test de profondeur et priorité de rendu élevée) et certains types de panneaux d’affichage.
ja: これにより、オブジェクトは距離に関係なく同じサイズでレンダリングされます。これは主にインジケーター(深度テストなし、高いレンダリング優先度)および一部のタイプのビルボードに役立ちます。

source: Do Not Receive Shadows
fr: Ne pas recevoir d'ombres
ja: Do Not Receive Shadows(影を受けない)

source: Makes the object not receive any kind of shadow that would otherwise be cast onto it.
fr: L'objet ne reçoit pas l'ombre qui aurait autrement été projetée sur lui.
ja: オブジェクトに影を付けないようにします。

source: Disable Ambient Light
fr: Désactiver la lumière ambiante
ja: Disable Ambient Light(アンビエントライト無効)

source: Makes the object not receive any kind of ambient lighting that would otherwise light it.
fr: L'objet ne reçoit aucun éclairage ambiant qui autrement l'éclairerait.
ja: 他のライトが無い場合でも照明を行うアンビエントライトをオブジェクトが受けないようにします。

source: Fixes normals when non-uniform scaling is used.
fr: Corrige les normales lorsque la mise à l'échelle n'est pas uniforme.
ja: 不均一なスケーリングが使用されている場合の法線を修正します。

source: Vertex Color
fr: Couleur de sommet
ja: Vertex Color(頂点色)

source: This setting allows choosing what is done by default to vertex colors that come from your 3D modelling application. By default, they are ignored.
fr: Ce paramètre permet de choisir ce qui est fait par défaut pour les couleurs de sommet qui proviennent de votre application de modélisation 3D. Par défaut, elles sont ignorées.

source: Use as Albedo
fr: Utiliser comme albedo
ja: Use as Albedo(アルベドとして使用)

source: Choosing this option means vertex color is used as albedo color.
fr: Choisir cette option signifie que la couleur du sommet est utilisée comme couleur albédo.
ja: このオプションを選択すると、頂点色がアルベド色として使用されます。

source: Is sRGB
fr: Est sRGB
ja: Is sRGB(これはsRGBです)

source: Most 3D DCCs will likely export vertex colors as sRGB, so toggling this option on will help them look correct.
fr: La plupart des DCC 3D exporteront probablement les couleurs de sommet comme sRVB, donc activer cette option les aidera à paraître corrects.
ja: ほとんどの3D DCCは頂点色をsRGBとしてエクスポートする可能性が高いため、このオプションをオンに切り替えると、正しく見えるようになります。

source: Parameters
fr: Paramètres

source: ``SpatialMaterial`` also has several configurable parameters to tweak many aspects of the rendering:
fr: ``SpatialMaterial`` possède également plusieurs paramètres configurables pour modifier de nombreux aspects du rendu :
ja: ``SpatialMaterial`` には、レンダリングのさまざまな側面を微調整するための設定可能なパラメーターもいくつか用意されています。

source: Diffuse Mode
fr: Mode diffus
ja: \ Diffuse Mode(拡散モード)

source: Specifies the algorithm used by diffuse scattering of light when hitting the object. The default is *Burley*. Other modes are also available:
fr: Spécifie l'algorithme utilisé pour la diffusion de la lumière lorsqu'elle frappe l'objet. La valeur par défaut est *Burley*. D'autres modes sont également disponibles :
ja: 光がオブジェクトに当たるときの拡散散乱で使用されるアルゴリズムを指定します。デフォルトは *Burley* です。他のモードも利用可能です:

source: **Burley:** Default mode, the original Disney Principled PBS diffuse algorithm.
fr: **Burley :** Mode par défaut, l'algorithme de diffusion original Disney Principled PBS.
ja: **Burley:** デフォルトモード、オリジナルのDisney Principled PBS拡散アルゴリズム。

source: **Lambert:** Is not affected by roughness.
fr: **Lambert :** n’est pas affecté par la dureté.
ja: **Lambert:** roughnessの影響を受けません。

source: **Lambert Wrap:** Extends Lambert to cover more than 90 degrees when roughness increases. Works great for hair and simulating cheap subsurface scattering. This implementation is energy conserving.
fr: **Lambert Wrap :** Étend de Lambert pour couvrir plus de 90 degrés lorsque la rugosité augmente. Idéal pour les cheveux et pour simuler la diffusion sous-surface à bas prix. Cette implémentation conserve l'énergie.
ja: **Lambert Wrap:** roughnessが増すと、Lambertを90度以上に広げます。髪の毛や低コストのサブサーフェススキャッタリングのシミュレーションに最適です。この実装は省エネルギーです。

source: **Oren Nayar:** This implementation aims to take microsurfacing into account (via roughness). Works well for clay-like materials and some types of cloth.
fr: **Oren Nayar :** Cette implémentation vise à prendre en compte le microrevêtement (via la rugosité). Convient bien aux matériaux argileux et à certains types de tissus.
ja: **Oren Nayar:** この実装は、(roughnessによる)マイクロサーフェシングを考慮することを目的としています。粘土のような素材やある種の布に適しています。

source: **Toon:** Provides a hard cut for lighting, with smoothing affected by roughness. It is recommended you disable sky contribution from your environment's ambient light settings or disable ambient light in the spatial material to achieve a better effect.
fr: **Toon :** Fournit une coupe dure pour l'éclairage, avec un lissage affecté par la rugosité. Il est recommandé de désactiver la contribution du ciel en fonction des réglages de la lumière ambiante de votre environnement ou de désactiver la lumière ambiante dans le spatial material pour obtenir un meilleur effet.
ja: **Toon:** roughnessの影響を受けたスムージングで、照明にハードカットを提供します。より良い効果を得るには、環境の環境光設定から空の影響を無効にするか、spatialマテリアルの環境光を無効にすることをお勧めします。

source: Specular Mode
fr: Mode spéculaire
ja: Specular Mode(鏡面反射モード )

source: Specifies how the specular blob will be rendered. The specular blob represents the shape of a light source reflected in the object.
fr: Spécifie comment la tâche spéculaire sera rendue. La tâche spéculaire représente la forme d'une source lumineuse réfléchie dans l'objet.
ja: 鏡面反射(スペキュラ)blob のレンダリング方法を指定します。鏡面反射blobは、オブジェクトに反射される光源の形状を表します。

source: **ShlickGGX:** The most common blob used by PBR 3D engines nowadays.
fr: **ShlickGGGX :** La tâche la plus communément utilisée par les moteurs 3D PBR de nos jours.
ja: **ShlickGGX:** PBR 3Dエンジンで最近使用されている最も一般的なblob。

source: **Blinn:** Common in previous-generation engines. Not worth using nowadays, but left here for the sake of compatibility.
fr: **Blinn :** Commun dans les moteurs des générations précédentes. Ne vaut pas la peine d'être utilisé de nos jours, mais laissé ici pour des raisons de compatibilité.
ja: **Blinn:** 前世代のエンジンで一般的。現在使用する価値はありませんが、互換性のためにここに残しました。

source: **Phong:** Same as above.
fr: **Phong :** Comme au-dessus.
ja: **Phong:** 上記と同じ。

source: **Toon:** Creates a toon blob, which changes size depending on roughness.
fr: **Toon :** Crée une tâche toon, qui change de taille en fonction de la rugosité.
ja: **Toon:** トゥーンblobを作成します。これは、roughnessに応じてサイズを変更します。

source: **Disabled:** Sometimes the blob gets in the way. Begone!
fr: **Disabled :** Parfois, la tâche est en travers du chemin. Va-t'en !
ja: **Disabled:** 時々blobが邪魔になります。なので立ち去りなさい！

source: Blend Mode
fr: Mode de fusion
ja: Blend Mode(ブレンドモード)

source: Controls the blend mode for the material. Keep in mind that any mode other than *Mix* forces the object to go through the transparent pipeline.
fr: Contrôle le mode de mélange du matériau. Gardez à l'esprit que tout mode autre que *Mix* force l'objet à passer par le pipeline transparent.
ja: マテリアルのブレンドモードをコントロールします。\ *Mix* 以外のモードでは、オブジェクトが強制的に透過パイプラインをスルーする(処理されない)ことに注意してください。

source: **Mix:** Default blend mode, alpha controls how much the object is visible.
fr: **Mix :** Mode de mélange par défaut, alpha contrôle la visibilité de l'objet.
ja: **Mix:** デフォルトのブレンドモード、アルファはオブジェクトの表示量(透け方)を制御します。

source: **Add:** Object is blended additively, nice for flares or some fire-like effects.
fr: **Add :** L'objet est mélangé de façon additive, agréable pour les fusées éclairantes ou pour certains effets de type feu.
ja: **Add:** オブジェクトは加算的にブレンドされ、フレアや火のようなエフェクトに適しています。

source: **Sub:** Object is subtracted.
fr: **Sub :** objet est soustrait.
ja: **Sub:** オブジェクトが減算されます。

source: **Mul:** Object is multiplied.
fr: **Mul :** objet est multiplié.
ja: **Mul:** オブジェクトが乗算されます。

source: Cull Mode
fr: Mode de Culling
ja: Cull Mode(カリングのモード)

source: Determines which side of the object is not drawn when backfaces are rendered:
fr: Détermine quel côté de l'objet n'est pas dessiné lorsque les faces arrière sont rendues :
ja: 背面がレンダリングされるときにオブジェクトのどちら側が描画されないかを決定します:

source: **Back:** The back of the object is culled when not visible (default).
fr: **Retour :** L’arrière de l'objet est éliminé lorsqu'il n'est pas visible (par défaut).
ja: **Back:** オブジェクトの背面は、表示されていないときにカリングされます(デフォルト)。

source: **Front:** The front of the object is culled when not visible.
fr: **Face avant :** La face avant de l'objet est éliminée lorsqu'elle n'est pas visible.
ja: **Front:** 表示されていない場合、オブジェクトの前面がカリングされます。

source: **Disabled:** Used for objects that are double-sided (no culling is performed).
fr: **Désactivé :** Utilisé pour les objets qui sont recto-verso (aucune élimination n'est effectuée).
ja: **Disabled:** 両面オブジェクトに使用します(カリングは実行されません)。

source: Depth Draw Mode
fr: Mode de dessin en profondeur
ja: Depth Draw Mode(深度描画モード)

source: Specifies when depth rendering must take place.
fr: Indique quand le rendu de profondeur doit avoir lieu.
ja: 深度レンダリングを実行する必要がある場合を指定します。

source: **Opaque Only (default):** Depth is only drawn for opaque objects.
fr: **Opaque Only(par défaut) :** La profondeur n'est dessinée que pour les objets opaques.
ja: **Opaque Only(デフォルト):** 深度(奥行き)は不透明オブジェクトに対してのみ描画されます。

source: **Always:** Depth draw is drawn for both opaque and transparent objects.
fr: **Always :** Le dessin en profondeur est dessiné pour les objets opaques et transparents.
ja: **Always:** 不透明オブジェクトと透明オブジェクトの両方に対して深度描画が描画されます。

source: **Never:** No depth draw takes place (do not confuse this with the No Depth Test option above).
fr: **Never :** Aucun dessin en profondeur n'a lieu (ne pas confondre avec l'option Aucun test de profondeur ci-dessus).
ja: **Never:** 深度描画は行われません(これを上記のNo Depth Test オプションと混同しないでください)。

source: **Depth Pre-Pass:** For transparent objects, an opaque pass is made first with the opaque parts, then transparency is drawn above. Use this option with transparent grass or tree foliage.
fr: **Pré-passe de profondeur :** Pour les objets transparents, une première passe est effectuée sur les parties opaques, puis la transparence est tracée par-dessus. Utilisez cette option avec de l'herbe ou du feuillage transparent.
ja: **Depth Pre-Pass:** 透明なオブジェクトの場合、まず不透明な部分で不透明なパスが作成され、次に透明度が上に描画されます。このオプションは、透明な草や木の葉で使用します。

source: Line Width
fr: Largeur de ligne
ja: Line Width(線幅)

source: When drawing lines, specify the width of the lines being drawn. This option is not available on most modern hardware.
fr: Lorsque vous tracez des lignes, indiquez la largeur des lignes à tracer. Cette option n'est pas disponible sur la plupart des hardware modernes.
ja: 線を描くとき、描かれる線の幅を指定します。このオプションは、ほとんどの最新のハードウェアでは使用できません。

source: Point Size
fr: Taille de point
ja: Point Size(ポイントサイズ)

source: When drawing points, specify the point size in pixels.
fr: Lorsque vous dessinez des points, spécifie la taille des points en pixels.
ja: ポイントを描画するときの、ポイントサイズをピクセル単位で指定します。

source: Billboard Mode
fr: Mode Billboard
ja: Billboard Mode(ビルボードモード)

source: Enables billboard mode for drawing materials. This controls how the object faces the camera:
fr: Active le mode ``Billboard`` pour le rendu du matériel. Ceci contrôle la façon dont l'objet est orienté par rapport à la caméra :
ja: 描画するマテリアルのビルボード モードを有効にします。これは、オブジェクトがカメラに向く方法を制御します:

source: **Disabled:** Billboard mode is disabled.
fr: **Désactivé :** Le mode ``Billboard`` est désactivé.
ja: **Disabled:** ビルボードモードは無効です。

source: **Enabled:** Billboard mode is enabled, the object's -Z axis will always face the camera.
fr: **Activé :** Le mode ``Billboard`` est activé. L'axe Z de l'objet fera toujours face à la caméra.
ja: **Enabled:** ビルボードモードが有効になっている場合、オブジェクトの-Z軸は常にカメラに向かいます。

source: **Y-Billboard:** The object's X axis will always be aligned with the camera.
fr: **Y-Billboard :** L'axe X de l'objet fera toujours face à la caméra.
ja: **Y-Billboard:** オブジェクトのX軸は常にカメラのX軸に合わせられます。

source: **Particles:** Most suited for particle systems, because it allows specifying animation options.
fr: **Particules :** Plus adapté aux systèmes de particules, car il permet de spécifier des options d'animation.
ja: **Particles:** アニメーションオプションを指定できるため、パーティクルシステムに最適です。

source: The above options are only enabled for Particle Billboard.
fr: Les options ci-dessus sont seulement activées pour les particules de type BillBoard.
ja: 上記のオプションは、Particle Billboardでのみ有効です。

source: Enables scaling a mesh in billboard mode.
fr: Autorise la mise à l'échelle d'un maillage en mode "panneau d'affichage".
ja: ビルボードモードでメッシュのスケーリングを有効にします。

source: Grow
fr: Croître
ja: Grow(成長/拡張)

source: Grows the object vertices in the direction pointed by their normals:
fr: Pousse les sommets de l’objet dans le sens indiqué par leurs normales :
ja: 法線が指す方向にオブジェクトの頂点を成長させます:
