Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/spatial_material.po
Languages: fr, ja

source: This is commonly used to create cheap outlines. Add a second material pass, make it black and unshaded, reverse culling (Cull Front), and add some grow:
fr: Ceci est couramment utilisé pour créer des contours bon marché. Ajoutez une deuxième passe de matériel, faites-le noir et sans ombres, faites une coupe inversée (Cull Front), et ajoutez un peu de grow :
ja: これは、一般的に安価にアウトラインを作成するために使用されます。2 番目のマテリアル パスを追加し、その色を黒にし、シェーディングなし、逆カリング(Cull Front)にして、Growをチックしたものをいくつか追加します:

source: Use Alpha Scissor
fr: Utiliser Alpha Scissor
ja: Use Alpha Scissor(アルファシザーを使用)

source: When transparency other than ``0`` or ``1`` is not needed, it's possible to set a threshold to prevent the object from rendering semi-transparent pixels.
fr: Lorsque la transparence autre que ``0`` ou ``1`` n'est pas nécessaire, il est possible de définir un seuil pour empêcher l'objet de rendre des pixels semi-transparents.
ja: ``0`` または ``1`` 以外の透明度が必要ない場合、しきい値を設定して、オブジェクトが半透明のピクセルをレンダリングしないようにすることができます。

source: This renders the object via the opaque pipeline, which is faster and allows it to use mid- and post-process effects such as SSAO, SSR, etc.
fr: L'objet est ainsi rendu via le pipeline opaque, qui est plus rapide et lui permet d'utiliser des effets mi et post-processus tels que SSAO, SSR, etc.
ja: これにより、不透明なパイプラインを介してオブジェクトがレンダリングされ、より高速になり、SSAO、SSRなどの中間および後処理効果を使用できるようになります。

source: Material colors, maps and channels
fr: Couleurs des matériaux, cartes et canaux
ja: マテリアルの色、マップ、チャンネル

source: Besides the parameters, what defines materials themselves are the colors, textures, and channels. Godot supports an extensive list of them. They are described in detail below:
fr: Outre les paramètres, ce qui définit les matériaux eux-mêmes sont les couleurs, les textures et les canaux. Godot en soutient une longue liste. Ils sont décrits en détail ci-dessous :
ja: パラメーターに加えて、マテリアル自体を定義するのは色、テクスチャ、およびチャンネルです。 Godotはそれらの広範なリストをサポートしています。以下で詳細に説明します:

source: *Albedo* is the base color for the material, on which all the other settings operate. When set to *Unshaded*, this is the only color that is visible. In previous versions of Godot, this channel was named *Diffuse*. The change of name mainly happened because, in PBR (Physically Based Rendering), this color affects many more calculations than just the diffuse lighting path.
fr: *Albedo* est la couleur de base du matériau, sur laquelle tous les autres réglages fonctionnent. Lorsqu'il est réglé sur *Unshaded*, c'est la seule couleur qui est visible. Dans les versions précédentes de Godot, ce canal s'appelait *Diffuse*. Le changement de nom s'est produit principalement parce que, dans le PBR (Physically Based Rendering), cette couleur affecte beaucoup plus de calculs que seulement le chemin d'éclairage diffus.
ja: *Albedo* は、他のすべての設定に関連するマテリアルのベースカラーです。\ *Unshaded* に設定すると、これが表示される唯一の色になります。 Godotの以前のバージョンでは、このチャネルの名前は *Diffuse* でした。名前の変更を行った主な理由は、PBR(Physically Based Rendering)では、この色が単なる拡散照明パスよりも多くの計算に影響するためです。

source: Albedo color and texture can be used together as they are multiplied.
fr: La couleur d'albédo et la texture peuvent être utilisés ensemble, étant multipliés.
ja: アルベドの色とテクスチャは、乗算されて一緒に使用されます。

source: *Alpha channel* in albedo color and texture is also used for the object transparency. If you use a color or texture with *alpha channel*, make sure to either enable transparency or *alpha scissoring* for it to work.
fr: Le *canal Alpha* de la couleur d'albédo et des textures est également utilisé pour la transparence de l'objet. Si vous utilisez une couleur ou une texture avec un *canal alpha*, assurez-vous d'activer la transparence ou l'*alpha scissoring* pour que cela fonctionne.
ja: アルベド色とテクスチャの *アルファチャンネル* は、オブジェクトの透明度にも使用されます。色またはテクスチャで *アルファチャンネル* を使用する場合は、transparencyを有効にするか、\*alpha scissoring* を有効にしてください。

source: Metallic
fr: Métallique
ja: Metallic(メタリック)

source: Godot uses a metallic model over competing models due to its simplicity. This parameter defines how reflective the material is. The more reflective, the less diffuse/ambient light affects the material and the more light is reflected. This model is called "energy-conserving".
fr: Godot utilise un modèle métallique par rapport aux modèles concurrents en raison de sa simplicité. Ce paramètre définit le degré de réflexion du matériau. Plus il est réfléchissant, moins la lumière diffuse/ambiante affecte le matériau et plus la lumière est réfléchie. Ce modèle est appelé "économie d'énergie".
ja: Godotは、そのシンプルさから、競合する他のモデルではなくMetalicモデルを使用しています。このパラメーターは、マテリアルの反射率を定義します。反射が多いほど、拡散光や周囲光が材料に影響を及ぼし、反射光が多くなります。このモデルは「省エネルギー」だといわれています。

source: The *Specular* parameter is a general amount for the reflectivity (unlike *Metallic*, this is not energy-conserving, so leave it at ``0.5`` and don't touch it unless you need to).
fr: Le paramètre *Specular* est une valeur générale pour la réflectivité (contrairement à *Metallic*, ce paramètre n'est pas économe en énergie, donc laissez-le à ``0.5`` et n'y touchez que si vous en avez besoin).
ja: *Specular* パラメーターは、反射率の一般的な量です(*Metallic* とは異なり、これはエネルギーを節約しませんので、\ ``0.5`` のままにして、必要でない限り触れないでください)。

source: The minimum internal reflectivity is ``0.04``, so it's impossible to make a material completely unreflective, just like in real life.
fr: La réflectivité interne minimale est de "0,04", il est donc impossible de rendre un matériau complètement non-réfléchissant, comme dans la vraie vie.
ja: 最小の内部反射率は ``0.04`` であるため、現実の世界のようにマテリアルを完全に無反射にすることはできません。

source: Roughness
fr: Rugosité
ja: Roughness(粗さ)

source: *Roughness* affects the way reflection happens. A value of ``0`` makes it a perfect mirror while a value of ``1`` completely blurs the reflection (simulating natural microsurfacing). Most common types of materials can be achieved with the right combination of *Metallic* and *Roughness*.
fr: *La rugosité* affecte la façon dont la réflexion se produit. Une valeur de ``0`` en fait un miroir parfait tandis qu'une valeur de ``1`` brouille complètement la réflexion (simulant la surface naturelle au niveau microscopique). La plupart des types de matériaux courants peuvent être obtenus avec la bonne combinaison de *Métallique* et *Rugosité*.
ja: *Roughness* は反射の発生方法に影響します。\ ``0`` の値は完璧な鏡になり、\ ``1`` の値は反射を完全にぼかします(自然なマイクロサーフェシングをシミュレートします)。最も一般的な種類のマテリアルは、\ *Metaric* と *Roughness* の適切な組み合わせで実現できます。

source: Emission
fr: Émission
ja: Emission(発光)

source: *Emission* specifies how much light is emitted by the material (keep in mind this does not include light surrounding geometry unless :ref:`doc_gi_probes` are used). This value is added to the resulting final image and is not affected by other lighting in the scene.
fr: *Emission* spécifie la quantité de lumière émise par le matériau (gardez à l'esprit que ceci n'inclut pas la géométrie de la lumière environnante sauf si :ref:`doc_gi_probes` sont utilisés). Cette valeur est ajoutée à l'image finale résultante et n'est pas affectée par les autres éclairages de la scène.
ja: *Emission* は、マテリアルから放射される光の量を指定します(これには、\ :ref:`doc_gi_probes` が使用されない限り、ジオメトリを囲む光は含まれないことに注意してください)。この値は、結果の最終画像に追加され、シーン内の他の照明の影響を受けません。

source: Normal map
fr: Normal map (carte de normales)

source: Normal mapping allows you to set a texture that represents finer shape detail. This does not modify geometry, only the incident angle for light. In Godot, only the red and green channels of normal maps are used for better compression and wider compatibility.
fr: Une normal map (carte de normales) vous permet de définir une texture qui représente un détail de forme plus fin. Cela ne modifie pas la géométrie, mais seulement l'angle d'incidence de la lumière. Dans Godot, seuls les canaux rouge et vert des normal maps sont utilisés pour une meilleure compression et une plus grande compatibilité.

source: Godot requires the normal map to use the X+, Y- and Z+ coordinates. In other words, if you've imported a material made to be used with another engine, you may have to convert the normal map so its Y axis is flipped. Otherwise, the normal map direction may appear to be inverted on the Y axis.
fr: Godot requiert que la normal map (carte de normales) utilise les coordonnées X+, Y- et Z+. En d'autres termes, si vous avez importé un matériau conçu pour être utilisé avec un autre moteur, vous devrez peut-être convertir la normal map pour que son axe Y soit inversé. Sinon, la direction de la normal map peut sembler inversée sur l'axe Y.
ja: Godotでは、X+、Y-、Z+の座標を使用するために、法線マップを変換する必要があります。つまり、他のエンジンで使用するために作られたマテリアルをインポートした場合、法線マップの Y 軸が反転するように変換する必要があるかもしれません。そうしないと、法線マップの方向がY軸上で反転して見えることがあります。

source: More information about normal maps (including a coordinate order table for popular engines) can be found `here <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.
fr: Vous trouverez plus d'informations sur les nomal map (incluant un tableau des coordonnées pour les moteurs les plus populaires) `ici <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.

source: Some fabrics have small micro-fur that causes light to scatter around it. Godot emulates this with the *Rim* parameter. Unlike other rim lighting implementations, which just use the emission channel, this one actually takes light into account (no light means no rim). This makes the effect considerably more believable.
fr: Certains tissus ont de petites micro fourrures qui diffusent la lumière autour d'eux. Godot l'émule avec le paramètre *Rim*. Contrairement à d'autres systèmes d'éclairage Rim, qui n'utilisent que le canal d'émission, celui-ci prend en compte la lumière (pas de lumière signifie pas de Rim). Cela rend l'effet beaucoup plus crédible.
ja: 一部の布地には、周囲に光を散乱させる小さなマイクロファーがあります。 Godotは、これを *Rim* パラメーターでエミュレートします。Emissionチャネルのみを使用する他のリム照明の実装とは異なり、この実装では実際に光が考慮されます(光がない場合はリムが現れないことを意味します)。これにより、より真実味を作り出す効果がえられます。

source: Rim size depends on roughness, and there is a special parameter to specify how it must be colored. If *Tint* is ``0``, the color of the light is used for the rim. If *Tint* is ``1``, then the albedo of the material is used. Using intermediate values generally works best.
fr: La taille de Rim dépend de la rugosité, et il existe un paramètre spécial pour spécifier comment elle doit être colorée. Si *Tint* est ``0``, la couleur de la lumière est utilisée pour le bord. Si *Tint* est ``1``, alors l'albédo du matériau est utilisé. L'utilisation de valeurs intermédiaires fonctionne généralement mieux.
ja: リムのサイズはroughnessに依存し、色の付け方を指定する特別なパラメーターがあります。\ *Tint*が ``0`` の場合、ライトの色がリムに使用されます。\ *Tint* が ``1`` の場合、素材のアルベドが使用されます。通常、中間値を使用するのが最適です。

source: Clearcoat
fr: Vernis transparent
ja: Clearcoat(クリアコート)

source: *This feature is only available when using the GLES3 backend.*
fr: *Cette fonction est disponible uniquement en utilisant l'arrière-plan GLES3*
ja: *この機能は、GLES3バックエンドを使用している場合にのみ使用できます。*

source: The *Clearcoat* parameter is used to add a secondary pass of transparent coat to the material. This is common in car paint and toys. In practice, it's a smaller specular blob added on top of the existing material.
fr: Le paramètre *Clearcoat* permet d'ajouter un second passage de couche transparente au matériau. C'est courant dans la peinture automobile et les jouets. En pratique, il s'agit d'une petite tache spéculaire ajoutée sur le matériau existant.
ja: *Clearcoat* パラメーターは、透明なコーティングの2次パスをマテリアルに追加するために使用されます。これは、車の塗装やおもちゃでは一般的です。実際には、既存のマテリアルの上に追加される小さなスペキュラblobです。

source: Anisotropy
fr: Anisotropie
ja: Anisotropy(異方性)

source: This changes the shape of the specular blob and aligns it to tangent space. Anisotropy is commonly used with hair, or to make materials such as brushed aluminum more realistic. It works especially well when combined with flowmaps.
fr: Cela change la forme de la tache spéculaire et l'aligne sur l'espace tangent. L'anisotropie est couramment utilisée avec les cheveux, ou pour rendre des matériaux comme l'aluminium brossé plus réalistes. Il fonctionne particulièrement bien lorsqu'il est combiné avec des cartes de flux.
ja: これにより、スペキュラblobの形状が変更され、接線空間に位置合わせされます。異方性は一般に髪の毛に使用されるか、ブラシをかけられたアルミニウムなどの素材をよりリアルにするために使用されます。フローマップ(flowmap)と組み合わせると、特にうまく機能します。

source: Ambient Occlusion
fr: Occlusion ambiante
ja: Ambient Occlusion(アンビエントオクルージョン)

source: It is possible to specify a baked ambient occlusion map. This map affects how much ambient light reaches each surface of the object (it does not affect direct light by default). While it is possible to use Screen-Space Ambient Occlusion (SSAO) to generate ambient occlusion, nothing beats the quality of a well-baked AO map. It is recommended to bake ambient occlusion whenever possible.
fr: Il est possible de spécifier une carte d'occlusion ambiante préparer. Cette carte affecte la quantité de lumière ambiante qui atteint chaque surface de l'objet (elle n'affecte pas la lumière directe par défaut). Bien qu'il soit possible d'utiliser Screen-Space Ambient Occlusion (SSAO) pour générer l'occlusion ambiante, rien ne vaut la qualité d'une carte d'AO bien faite. Il est recommandé de préparer l'occlusion ambiante dans la mesure du possible.
ja: 焼き込み(ベイク)処理されたアンビエントオクルージョンマップを指定することができます。このマップは、オブジェクトの各表面に到達する環境光の光量に影響します(デフォルトでは、直接光には影響しません)。スクリーンスペースアンビエントオクルージョン(SSAO)を使用してアンビエントオクルージョンを生成することは可能ですが、よく焼き込まれたAOマップの品質に勝るものはありません。可能な場合は、アンビエントオクルージョンを焼き込むことをお勧めします。

source: Depth
fr: Profondeur
ja: Depth(深度/奥行)

source: Setting a depth map on a material produces a ray-marched search to emulate the proper displacement of cavities along the view direction. This is not real added geometry, but an illusion of depth. It may not work for complex objects, but it produces a realistic depth effect for textures. For best results, *Depth* should be used together with normal mapping.
fr: Utiliser une carte de profondeur sur un matériau produit un balayage utilisant l'émission de rayons pour simuler le déplacement des reliefs dans la direction du point de vue. Il ne s'agit pas d'un ajout de géométrie mais d'une illusion de profondeur. Cela peut ne pas marcher pour les objets complexes, mais cela produit des effets réalistes sur les textures. Le paramètre *Profondeur* devrait être utilisé avec une normal map.
ja: マテリアルにDepthマップを設定すると、光線方向のサーチが行われ、ビュー方向に沿った凹凸の適切な変位がエミュレートされます。これは実際に追加されたジオメトリではなく、奥行きの錯覚です。複雑なオブジェクトでは機能しない場合がありますが、テクスチャにリアルな奥行き効果をもたらします。最良の結果を得るには、\ *Depth* を通常のマッピングと一緒に使用する必要があります。

source: Subsurface Scattering
fr: Diffusion souterraine
ja: Subsurface Scattering(サブサーフェススキャッタリング)

source: This effect emulates light that penetrates an object's surface, is scattered, and then comes out. It is useful to create realistic skin, marble, colored liquids, etc.
fr: Cet effet émule la lumière qui pénètre la surface d'un objet, est diffusée, puis sort. Il est utile pour créer une peau réaliste, du marbre, des liquides colorés, etc.
ja: この効果は、オブジェクトの表面を透過し、散乱してから出る光をエミュレートします。リアルな肌、大理石、色のついた液体などを作成すると便利です。

source: This controls how much light from the lit side (visible to light) is transferred to the dark side (opposite from the light). This works well for thin objects such as plant leaves, grass, human ears, etc.
fr: Contrôle la quantité de lumière du côté éclairé (visible à la lumière) qui est transférée vers le côté obscur (opposé à la lumière). Cela fonctionne bien pour les objets minces tels que les feuilles de plantes, l'herbe, les oreilles humaines, etc.
ja: これは、明るい側(光源から見える)からの光が暗い側(光源とは反対側)に透過される量を制御します。これは、植物の葉、草、人間の耳などの薄いオブジェクトに適しています。

source: Refraction
fr: Réfraction
ja: Refraction(屈折)

source: When refraction is enabled, it supersedes alpha blending, and Godot attempts to fetch information from behind the object being rendered instead. This allows distorting the transparency in a way similar to refraction in real life.
fr: Lorsque la réfraction est activée, elle remplace le mélange alpha, et Godot tente de récupérer les informations derrière l'objet rendu. Cela permet de déformer la transparence d'une manière similaire à la réfraction dans la vie réelle.
ja: Refractionが有効な場合、Godotはアルファブレンディングより優先して、レンダリングされるオブジェクトの背後から情報を取得しようとします。これにより、現実の屈折に似た方法で透明な部分を歪めることができます。

source: Detail
fr: Détail
ja: Detail(詳細)

source: Godot allows using secondary albedo and normal maps to generate a detail texture, which can be blended in many ways. By combining this with secondary UV or triplanar modes, many interesting textures can be achieved.
fr: Godot permet d'utiliser l'albédo secondaire et les normal maps (cartes de normales) pour générer une texture détaillée, qui peut être mélangée de plusieurs façons. En combinant cela avec des modes UV secondaires ou triplanaires, de nombreuses textures intéressantes peuvent être obtenues.
ja: Godot は、第二アルベドマップと法線マップを使用して、多くの方法でブレンドできるDetailテクスチャを生成することができます。これをセカンダリUV またはTriplanarモードと組み合わせることで、多くの興味深いテクスチャを実現できます。

source: There are several settings that control how detail is used.
fr: Il existe plusieurs paramètres qui contrôlent la façon dont le détail est utilisé.
ja: ディテールの使用をコントロールする設定がいくつかあります。

source: Mask: The detail mask is a black and white image used to control where the blending takes place on a texture. White is for the detail textures, Black is for the regular material textures, different shades of gray are for partial blending of the material textures and detail textures.
fr: Mask : Le masque de détail est une image en noir et blanc utilisée pour contrôler l'endroit où le mélange se fait sur une texture. Le blanc est pour les textures de détail, le noir est pour les textures matérielles régulières, les différentes nuances de gris sont pour le mélange partiel des textures matérielles et des textures de détail.

source: Blend Mode: These four modes control how the textures are blended together.
fr: Blend Mode : Ces quatre modes contrôlent la façon dont les textures sont mélangées.
ja: Blend Mode: これらの4つのモードは、テクスチャのブレンド方法をコントロールします。

source: Mix: Combines pixel values of both textures. At black, only show the material texture, at white, only show the detail texture. Values of gray create a smooth blend between the two.
fr: Mix : Combine les valeurs des pixels des deux textures. En noir, ne montre que la texture du matériau, en blanc, ne montre que la texture du détail. Les valeurs de gris créent un mélange lisse entre les deux.

source: Add: Adds pixel values of one Texture with the other. Unlike mix mode both textures are completely mixed at white parts of a mask and not at gray parts. The original texture is mostly unchanged at black
fr: Ajouter : Ajoute les valeurs des pixels d'une texture à l'autre. Contrairement au mode de mélange (mix mode), les deux textures sont complètement mélangées pour les parties blanches d'un masque et non dans les parties grises. La texture originale est pratiquement inchangée pour les parties noires

source: Sub: Subtracts pixel values of one texture with the other. The second texture is completely subtracted at white parts of a mask with only a little subtraction in black parts, gray parts being different levels of subtraction based on the exact texture.
fr: Sub : Soustrait les valeurs des pixels d'une texture à l'autre. La deuxième texture est entièrement soustraite dans les parties blanches d'un masque, avec seulement une petite soustraction dans les parties noires, les parties grises étant différents niveaux de soustraction basés sur la texture exacte.

source: Mul: Multiplies the RGB channel numbers for each pixel from the top texture with the values for the corresponding pixel from the bottom texture.
fr: Mul : Multiplie les nombres des canaux RVB pour chaque pixel de la texture supérieure par les valeurs du pixel correspondant de la texture inférieure.

source: Albedo: This is where you put an albedo texture you want to blend. If nothing is in this slot it will be interpreted as white by default.
fr: Albedo : C'est ici que vous mettez une texture d'albédo que vous voulez mélanger. Si rien ne se trouve dans ce créneau, elle sera interprétée comme blanche par défaut.

source: Normal: This is where you put a normal texture you want to blend. If nothing is in this slot it will be interpreted as a flat normal map. This can still be used even if the material does not have normal map enabled.
fr: Normal : C'est ici que vous mettez une texture de normales que vous voulez mélanger. Si rien ne se trouve dans ce créneau, elle sera interprétée comme une normal map (carte de normales) plate. Cette option peut être utilisée même si la normal map n'est pas activée pour le matériau.

source: UV1 and UV2
fr: UV1 et UV2
ja: UV1 and UV2(UV1およびUV2)

source: Godot supports two UV channels per material. Secondary UV is often useful for ambient occlusion or emission (baked light). UVs can be scaled and offset, which is useful when using repeating textures.
fr: Godot supporte deux canaux UV par matériau. Les UV secondaires sont souvent utiles pour l'occlusion ou l'émission ambiante (lumière préparée). Les UV peuvent être mis à l'échelle et décalés, ce qui est utile lors de l'utilisation de textures répétitives.
ja: Godotは、マテリアルごとに2つのUVチャネルをサポートします。第二UVは、アンビエントオクルージョンまたは放出(焼き込みライト)に役立つことがよくあります。 UVはスケーリングとオフセットが可能で、繰り返しテクスチャを使用する場合に便利です。

source: Triplanar Mapping
fr: Cartographie triplanaire
ja: Triplanar Mapping(三面マッピング)

source: Triplanar mapping is supported for both UV1 and UV2. This is an alternative way to obtain texture coordinates, sometimes called "Autotexture". Textures are sampled in X, Y and Z and blended by the normal. Triplanar mapping can be performed in either world space or object space.
fr: La cartographie triplanaire est disponible pour UV1 et UV2. C'est une méthode alternative permettant d'obtenir des coordonnées de textures, parfois appelée "texturage automatique". Les textures sont échantillonnées indépendamment suivant les axes X, Y et Z puis fusionnées selon la normale. La cartographie triplanaire peut être calculée dans le système de coordonnées global ou dans celui propre à l'objet.
ja: Triplanarマッピングは、UV1とUV2の両方でサポートされています。これは、テクスチャ座標を取得する代替方法であり、「オートテクスチャ」とも呼ばれます。テクスチャは、X、Y、Zでサンプリングされ、法線によってブレンドされます。 Triplanarマッピングは、ワールド空間またはオブジェクト空間で実行できます。

source: In the image below, you can see how all primitives share the same material with world triplanar, so the brick texture continues smoothly between them.
fr: Dans l'image ci-dessous, vous pouvez voir que toutes les primitives utilisent le même matériau avec l'option de triplan global, la texture de brique s'étend de façon ininterrompue d'un objet à l'autre.
ja: 下の画像では、すべてのプリミティブがワールドTriplanarと同じマテリアルを共有する方法を確認できるため、レンガのテクスチャはそれらの間でスムーズに連続しています。

source: Proximity and distance fade
fr: Fondu de proximité et distance
ja: Proximity and distance fade(近接および距離でのフェード)

source: Godot allows materials to fade by proximity to each other as well as depending on the distance from the viewer. Proximity fade is useful for effects such as soft particles or a mass of water with a smooth blending to the shores. Distance fade is useful for light shafts or indicators that are only present after a given distance.
fr: Godot permet aux matériaux de s'estomper par proximité les uns des autres ainsi que selon la distance par rapport au spectateur. Le fondu de proximité est utile pour des effets tels que des particules molles ou une masse d'eau avec un mélange lisse jusqu'aux rivages. Le fondu à distance est utile pour les puits de lumière ou les indicateurs qui ne sont visibles qu'après une distance donnée.
ja: Godotでは、視点からの距離やマテリアル同士の近さに応じてマテリアルをフェードさせることができます。Proximity フェードは、ソフトパーティクルや、海岸に滑らかにブレンドされた水の塊などの効果に役立ちます。Distanceフェードは、特定の距離より後にのみ存在するライトシャフトまたはインジケーターに役立ちます。

source: Keep in mind enabling these enables alpha blending, so abusing them for an entire scene is usually not a good idea.
fr: Gardez à l'esprit que l'activation de ces options permet le mélange alpha, donc en abuser pour une scène entière n'est généralement pas une bonne idée.
ja: これらを有効にするとアルファブレンディングが有効になるので、通常、シーン全体で乱用することはお勧めできません。
