Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/using_gridmaps.po
Languages: de, zh_cn

source: Using GridMaps
de: Verwenden von GridMap

source: Introduction
de: Einführung
zh_cn: 简介

source: :ref:`Gridmaps <class_GridMap>` are a tool for creating 3D game levels, similar to the way :ref:`TileMap <doc_using_tilemaps>` works in 2D. You start with a predefined collection of 3D meshes (a :ref:`class_MeshLibrary`) that can be placed on a grid, as if you were building a level with an unlimited amount of Lego blocks.
de: :ref:`GridMap <class_GridMap>` ist ein Tool zum Erstellen von 3D-Spielebenen, ähnlich wie :ref:`TileMap <doc_using_tilemaps>` in 2D. Sie beginnen mit einer vordefinierten Sammlung von 3D-Meshes (:ref:`class_MeshLibrary`), die in einem Raster platziert werden können, als würden Sie eine Ebene mit einer unbegrenzten Anzahl von Legoblöcken erstellen.
zh_cn: :ref:`Gridmaps <class_GridMap>` 是一种用于创建3D游戏关卡的工具，方式类似于2D中使用 :ref:`TileMap <doc_using_tilemaps>` 。使用一个定义好的可以放在一个网格中的 3D mesh (a :ref:`class_MeshLibrary`) (译注，grid和mesh都译作网格，这里为了清晰，mesh直接使用英文，grid则译作网格)对象集合搭建关卡，就像您使用无限多数量的乐高积木搭建世界一样。

source: Collisions and navigation can also be added to the meshes, just like you would do with the tiles of a tilemap.
de: Kollisionen und Navigation können ebenfalls zu den Meshes hinzugefügt werden, genau wie Sie es mit den Kacheln einer TileMap tun würden.
zh_cn: 就像使用tilemap的tile一样，碰撞和导航也可以添加到网格中。

source: Example project
de: Beispielprojekt
zh_cn: 示例项目

source: To learn how GridMaps work, start by downloading the sample project: :download:`gridmap_demo.zip <files/gridmap_demo.zip>`.
de: Um zu erfahren, wie GridMaps funktioniert, laden Sie zunächst das Beispielprojekt herunter: :download:`gridmap_demo.zip <files/gridmap_demo.zip>`.
zh_cn: 要学习GridMaps是怎么样工作的，请先下载示例项目: :download:`gridmap_demo.zip <files/gridmap_demo.zip>`。

source: Unzip this project and add it to the Project Manager using the "Import" button.
de: Entpacken Sie dieses Projekt und fügen Sie es über die Schaltfläche "Importieren" dem Projektmanager hinzu.
zh_cn: 解压缩此项目并使用“导入”按钮将其添加到项目管理器。

source: Creating a MeshLibrary
de: Erstellen einer MeshLibrary
zh_cn: 创建Mesh库

source: To begin, you need a :ref:`class_MeshLibrary`, which is a collection of individual meshes that can be used in the gridmap. Open the "MeshLibrary_Source.tscn" scene to see an example of how to set up the mesh library.
de: Zu Beginn benötigen Sie :ref:`class_MeshLibrary`, eine Sammlung einzelner Meshes, die in der GridMap verwendet werden können. Öffnen Sie die Szene "MeshLibrary_Source.tscn", um ein Beispiel für das Einrichten der MeshLibrary zu sehen.
zh_cn: 首先，您需要一个 :ref:`class_MeshLibrary`，它是可以在gridmap中使用的Mesh的集合。 打开“MeshLibrary_Source.tscn”场景以查看如何设置网格库的示例。

source: As you can see, this scene has a :ref:`class_Spatial` node as its root, and a number of :ref:`class_MeshInstance` node children.
de: Wie Sie sehen können hat diese Szene einen Node :ref:`class_Spatial` als Wurzel und eine Reihe von :ref: class_MeshInstance` Unter-Nodes.
zh_cn: 可以看到，这个场景有一个 :ref:`class_Spatial` 节点作为它的根，以及一些 :ref:`class_MeshInstance` 子节点。

source: If you don't need any physics in your scene, then you're done. However, in most cases you'll want to assign collision bodies to the meshes.
de: Wenn Sie in Ihrer Szene keine Physik benötigen sind Sie fertig. In den meisten Fällen möchten Sie den Meshes jedoch Kollisionskörper zuweisen.
zh_cn: 如果您的场景中不需要任何物理，那么到这里就完成了。 但是，在大多数情况下，您还需要给网格指定碰撞体。

source: Collisions
de: Kollisionen
zh_cn: 碰撞

source: You can manually assign a :ref:`class_StaticBody` and :ref:`class_CollisionShape` to each mesh. Alternatively, you can use the "Mesh" menu to automatically create the collision body based on the mesh data.
de: Sie können jedem Mesh manuell ein :ref:`class_StaticBody` und :ref:`class_CollisionShape` zuweisen. Alternativ können Sie das Menü "Mesh" verwenden, um den Kollisionskörper basierend auf den Mesh-Daten automatisch zu erstellen.
zh_cn: 您可以手动为每个Mesh指定 :ref:`class_StaticBody` 和 :ref:`class_CollisionShape`。或者，您可以使用“网格(Mesh)”菜单根据Mesh数据自动创建碰撞体。

source: Note that a "Convex" collision body will work better for simple meshes. For more complex shapes, select "Create Trimesh Static Body". Once each mesh has a physics body and collision shape assigned, your mesh library is ready to be used.
de: Beachten Sie, dass ein "konvexer" Kollisionskörper für einfache Netze besser funktioniert. Wählen Sie für komplexere Formen "Statischen Trimesh-Körper erstellen". Sobald jedem Mesh ein Physikkörper und eine Kollisionsform zugewiesen wurden, kann Ihre Mesh-Bibliothek verwendet werden.
zh_cn: 请注意，“凸(Convex)”碰撞体对于简单Mesh效果更好。 对于更复杂的形状，请选择“创建Trimesh静态体”。 一旦每个网格都分配了物理主体和碰撞形状，就可以使用Mesh库了。

source: Materials
de: Materialien
zh_cn: 材质

source: Only the materials from within the meshes are used when generating the mesh library. Materials set on the node will be ignored.
de: Beim Generieren der MeshLibrary werden nur die Materialien aus den Meshes verwendet, auf den Nodes festgelegte Materialien werden ignoriert.

source: Exporting the MeshLibrary
de: Exportieren der MeshLibrary
zh_cn: 导出Mesh库

source: To export the library, click on Scene -> Convert To.. -> MeshLibrary.., and save it as a resource.
de: Um die Bibliothek zu exportieren, klicken Sie auf Szene -> Konvertieren in .. -> MeshLibrary .. und speichern Sie sie als Ressource.
zh_cn: 要导出库，请单击“场景” ->“转换为...” ->“MeshLibrary(网格库)...”，并将其另存为资源。

source: You can find an already exported MeshLibrary in the project named "MeshLibrary.tres".
de: Eine bereits exportierte MeshLibrary finden Sie im Projekt "MeshLibrary.tres".
zh_cn: 可以在项目中找到已导出的名为“MeshLibrary.tres”的Mesh库。

source: Using GridMap
de: Verwenden von GridMap
zh_cn: 使用网格图(GridMap)

source: Create a new scene and add a GridMap node. Add the mesh library by dragging the resource file from the FileSystem dock and dropping it in the "Theme" property in the Inspector.
de: Erstellen Sie eine neue Szene und fügen Sie einen GridMap-Node hinzu. Fügen Sie die Mesh-Bibliothek hinzu, indem Sie die Ressourcendatei aus dem Dateisystem-Dock ziehen und in der Eigenschaft "Thema" im Inspektor ablegen.
zh_cn: 创建一个新场景并添加一个GridMap节点。 通过从“文件系统(FileSystem)”扩展面板拖动资源文件并将其放入Inspector中的“Theme(主题)”属性中来添加Mesh库。

source: The "Cell/Size" property should be set to the size of your meshes. You can leave it at the default value for the demo. Set the "Center Y" property to "Off".
de: Die Eigenschaft "Zelle/Größe" sollte auf die Größe Ihrer Mesh festgelegt werden. Sie können den Standardwert für das Beispiel beibehalten. Setzen Sie die Eigenschaft "Center Y" auf "Off".
zh_cn: “单元格/大小(Cell/Size)”属性应设置为Mesh的大小。 在本示例中您可以使用默认值。 将“Center Y”属性设置为“Off”。

source: Now you can start designing the level by choosing a tile from the palette and placing it with Left-Click in the editor window. To remove a tile, hold :kbd:`Shift` and use Right-click.
de: Jetzt können Sie mit dem Entwerfen der Ebene beginnen indem Sie eine Kachel aus der Palette auswählen und mit der linken Maustaste im Editorfenster platzieren. Um eine Kachel zu entfernen halten Sie :kbd:`Shift` gedrückt und klicken Sie mit der rechten Maustaste.

source: Click on the "GridMap" menu to see options and shortcuts. For example, pressing :kbd:`S` rotates a tile around the y-axis.
de: Klicken Sie auf das Menü "GridMap" um Optionen und Verknüpfungen anzuzeigen. Durch Drücken von :kbd:`S` wird beispielsweise eine Kachel um die Y-Achse gedreht.

source: Holding :kbd:`Shift` and dragging with the left mouse button will draw a selection box. You can duplicate or clear the selected area using the respective menu options.
de: Halten Sie :kbd:`Shift` gedrückt und ziehen Sie mit der linken Maustaste um ein Auswahlfeld zu zeichnen. Sie können den ausgewählten Bereich über die entsprechenden Menüoptionen duplizieren oder löschen.

source: In the menu, you can also change the axis you're drawing on, as well as shift the drawing plane higher or lower on its axis.
de: Im Menü können Sie auch die Achse ändern auf der Sie zeichnen und die Zeichnungsebene auf ihrer Achse nach oben oder unten verschieben.

source: Using GridMap in code
de: Verwenden von GridMap im Code
zh_cn: 在代码中使用GridMap

source: See :ref:`class_GridMap` for details on the node's methods and member variables.
de: Siehe :ref:`class_GridMap` für Details zu den Methoden und Mitgliedsvariablen des Nodes.
zh_cn: 有关节点方法和成员变量的详细信息，请参阅 :ref:`class_GridMap`。

source: Using gridmaps
zh_cn: 使用网格地图

source: Now you can start designing the level by choosing a tile from the palette and placing it with Left-Click in the editor window. To remove a tile, use Shift+Right-click.
zh_cn: 现在，您可以通过从调色板中选择一个图块并使用左键单击在编辑器窗口中放置来开始设计关卡。 要删除图块，请使用Shift + 右键单击。

source: Click on the "GridMap" menu to see options and shortcuts. For example, pressing "S" rotates a tile around the y-axis.
zh_cn: 单击“GridMap”菜单可以查看选项和快捷键。 例如，按下“S”围绕y轴旋转图块。

source: Holding <Shift> and dragging with the left mouse button will draw a selection box. You can duplicate or clear the selected area using the respective menu options.
zh_cn: 按住<Shift>并使用鼠标左键拖动将绘制一个选择框。 您可以使用相应的菜单选项复制或清除所选区域。
