Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shading/intro_to_shaders_water_workshop.po
Languages: de, es, fr, ja, zh_cn

source: Intro to shaders: 2D and 3D water
de: Einführung in Shader: Wasser in 2D und 3D
es: Introducción a los shaders: agua en 2D y 3D
fr: Introduction aux shaders : l'eau en 2D et 3D
ja: シェーダーの紹介: 2Dおよび3Dの水
zh_cn: 着色器简介:2D和3D水

source: In this hands-on video series, you will create your first water shaders in 2D and in 3D. If you're new to shaders, you should start 2D, because you need some basic understanding of the shading language, vertex and fragment shaders, to build upon. 3D adds quite a bit of complexity when it comes to writing shader programs, as you will see in the third video.
de: In dieser praktischen Videoserie erstellen Sie Ihren ersten Wasser-Shader in 2D und 3D. Wenn Sie mit Shadern noch nicht vertraut sind sollten Sie in 2D starten, da Sie ein grundlegendes Verständnis der Shader-Sprache sowie der Vertex- und Fragment-Shader benötigen, um darauf aufzubauen. 3D erhöht die Komplexität beim Schreiben von Shader-Programmen erheblich, wie Sie im dritten Video sehen werden.
es: En esta serie de videos prácticos, crearás tus primeros shaders de agua en 2D y en 3D. Si eres nuevo en el mundo de los shaders, deberías empezar con el 2D, porque necesitas un conocimiento básico del lenguaje shader, vértices y fragmentos de shader, para poder construirlo. El 3D añade bastante complejidad a la hora de escribir programas shader, como verás en el tercer vídeo.
fr: Dans cette série de vidéos pratiques, vous allez créer vos premiers shaders d'eau en 2D et en 3D. Si vous êtes novice en matière de shaders, vous devriez commencer par la 2D, car vous devez avoir une connaissance de base du langage de shading, des shaders de sommets et de fragments, pour pouvoir vous en servir. La 3D ajoute une certaine complexité lorsqu'il s'agit d'écrire des programmes de shaders, comme vous le verrez dans la troisième vidéo.
ja: このハンズオンビデオシリーズでは、最初のウォーターシェーダーを2Dおよび3Dで作成します。シェーダーを初めて使用する場合は、構築するためにシェーディング言語、頂点シェーダー、フラグメントシェーダーの基本的な理解が必要なため、2Dから開始する必要があります。 3Dは、3番目のビデオで見るように、シェーダープログラムの作成に関してかなり複雑になります。
zh_cn: 在这个动手实践的视频系列中，您将创建2D和3D中的第一个水着色器。 如果您是着色器的新手，则应该启动2D，因为您需要对着色语言，顶点和片段着色器有一些基本的了解才能构建。 在编写着色器程序时，3D会增加相当多的复杂性，您将在第三个视频中看到。

source: Watch the tutorials
de: Anleitungen ansehen
es: Mira los tutoriales
fr: Tutoriels vidéo
ja: チュートリアルを見る
zh_cn: 观看教程

source: You can watch the `full playlist on YouTube <https://www.youtube.com/watch?v=xoyk_A0RSpI&list=PLhqJJNjsQ7KHqNMYmTwtsYTeTrqrRP_fP>`__. Here are the individual videos:
de: Es gibt eine `vollständige Liste mit Anleitungen auf YouTube <https://www.youtube.com/watch?v=xoyk_A0RSpI&list=PLhqJJNjsQ7KHqNMYmTwtsYTeTrqrRP_fP>`__. Hier sind einige ausgewählte Videos:
es: Puedes ver la `lista de reproducción completa en YouTube <https://www.youtube.com/watch?v=xoyk_A0RSpI&list=PLhqJJNjsQ7KHqNMYmTwtsYTeTrqrRP_fP>`__. Aquí están los videos individuales:
fr: Vous pouvez regarder la `playlist complète sur YouTube <https://www.youtube.com/watch?v=xoyk_A0RSpI&list=PLhqJJNjsQ7KHqNMYmTwtsYTeTrqrRP_fP>`__. Voici les différentes vidéos :
ja: YouTubeの `フルプレイリスト <https://www.youtube.com/watch?v=xoyk_A0RSpI&list=PLhqJJNjsQ7KHqNMYmTwtsYTeTrqrRP_fP>`__をご覧ください。個々のビデオは次のとおりです:
zh_cn: 您可以在YouTube上观看 `完整播放列表 <https://www.youtube.com/watch?v=xoyk_A0RSpI&list=PLhqJJNjsQ7KHqNMYmTwtsYTeTrqrRP_fP>`__。 以下是各个视频:

source: `Intro to Shader Programming <https://www.youtube.com/watch?v=xoyk_A0RSpI>`__
de: `Einführung in Shader Programmierung <https://www.youtube.com/watch?v=xoyk_A0RSpI>`__
es: `Introducción a la programación de shaders (en ingés) <https://www.youtube.com/watch?v=xoyk_A0RSpI>`__
fr: `Présentation de la programmation de Shader <https://www.youtube.com/watch?v=xoyk_A0RSpI>`__
ja: `シェーダープログラミング入門 <https://www.youtube.com/watch?v=xoyk_A0RSpI>`__
zh_cn: `着色器编程简介 <https://www.youtube.com/watch?v=xoyk_A0RSpI>`__

source: `Animated Water and UV Coordinates <https://www.youtube.com/watch?v=U91nqeUe1qQ>`__
de: `Animiertes Wasser und UV Koordinaten <https://www.youtube.com/watch?v=U91nqeUe1qQ>`__
es: ``Coordenadas de agua y UV simuladas <https://www.youtube.com/watch?v=U91nqeUe1qQ>`__
fr: `Eau animée et des Coordonnées UV <https://www.youtube.com/watch?v=U91nqeUe1qQ>`__
ja: `アニメーションする水とUV座標 <https://www.youtube.com/watch?v=U91nqeUe1qQ>`__
zh_cn: `动画水和紫外线坐标 <https://www.youtube.com/watch?v=U91nqeUe1qQ>`__

source: `Water in 3D <https://www.youtube.com/watch?v=vm9Sdvhq6ho>`__
de: `Wasser in 3D <https://www.youtube.com/watch?v=vm9Sdvhq6ho>`__
es: `Agua en 3D (en inglés) <https://www.youtube.com/watch?v=vm9Sdvhq6ho>`__
fr: `L'eau en 3D <https://www.youtube.com/watch?v=vm9Sdvhq6ho>`__
ja: `3Dの水 <https://www.youtube.com/watch?v=vm9Sdvhq6ho>`__
zh_cn: `3D中的水 <https://www.youtube.com/watch?v=vm9Sdvhq6ho>`__

source: `Texture-based Deformation <https://www.youtube.com/watch?v=Pg79tztNZeA>`__
de: `Textur-basierte Deformation <https://www.youtube.com/watch?v=Pg79tztNZeA>`__
es: `Deformación basada en la textura <https://www.youtube.com/watch?v=Pg79tztNZeA>`__
fr: `Déformation basée sur la texture <https://www.youtube.com/watch?v=Pg79tztNZeA>`__
ja: `テクスチャベースの変形 <https://www.youtube.com/watch?v=Pg79tztNZeA>`__
zh_cn: `基于纹理的变形 <https://www.youtube.com/watch?v=Pg79tztNZeA>`__

source: `Merging the Two Waves Together <https://www.youtube.com/watch?v=aC5Yzx7tS74>`__
de: `Zwei Wellen zusammenführen <https://www.youtube.com/watch?v=aC5Yzx7tS74>`__
es: `Fusionando las dos olas juntas <https://www.youtube.com/watch?v=aC5Yzx7tS74>`__
fr: `Fusionner les deux vagues ensemble <https://www.youtube.com/watch?v=aC5Yzx7tS74>`__
ja: `2つの波を結合する <https://www.youtube.com/watch?v=aC5Yzx7tS74>`__
zh_cn: `将两波融合在一起 <https://www.youtube.com/watch?v=aC5Yzx7tS74>`__

source: `Functions in ShaderScript <https://www.youtube.com/watch?v=1eNWPbfph1E>`__
de: `Functionen in ShaderSkript <https://www.youtube.com/watch?v=1eNWPbfph1E>`__
es: `Funciones en ShaderScript <https://www.youtube.com/watch?v=1eNWPbfph1E>`__
fr: `Fonctions dans ShaderScript <https://www.youtube.com/watch?v=1eNWPbfph1E>`__
ja: `ShaderScriptの関数 <https://www.youtube.com/watch?v=1eNWPbfph1E>`__
zh_cn: `ShaderScript中的函数 <https://www.youtube.com/watch?v=1eNWPbfph1E>`__

source: `Water Shadow and Masking <https://www.youtube.com/watch?v=Xqv7C9mVhak>`__
de: `Schatten und Maskierung von Wasser <https://www.youtube.com/watch?v=Xqv7C9mVhak>`__
es: `Sombra de Agua y Enmascaramiento <https://www.youtube.com/watch?v=Xqv7C9mVhak>`__
fr: `Ombre d'eau et masquage <https://www.youtube.com/watch?v=Xqv7C9mVhak>`__
ja: `水の影とマスキング <https://www.youtube.com/watch?v=Xqv7C9mVhak>`__
zh_cn: `水影和遮蔽 <https://www.youtube.com/watch?v=Xqv7C9mVhak>`__

source: Download the source code
de: Quellcode herunterladen
es: Descarga código fuente
fr: Télécharger le code source
ja: ソースコードをダウンロードする
zh_cn: 下载源代码

source: Download the intro to shaders project here to follow along: :download:`2d_water_shader.zip <files/2d_water_shader.zip>`.
de: Die Einführung ins Shader Projekt kann hier heruntergeladen werden: `2d_water_shader.zip <files/2d_water_shader.zip>`.
es: Descarga el proyecto de introducción a shaders aquí para seguir el tutorial: :download:`2d_water_shader.zip <files/2d_water_shader.zip>`.
fr: Téléchargez l'introduction au projet shaders ici : :download:`2d_water_shader.zip <files/2d_water_shader.zip>`.
ja: 次から、シェーダープロジェクトのイントロ ::download:`2d_water_shader.zip <files/2d_water_shader.zip>` をダウンロードして ください。

source: It comes with a `start` folder to follow along with the 2D tutorials, and an `end` folder that contains the final code.
de: Die Datei enthält einen `Startordner`, der dieser 2D Einführung folgt, und einen `Endordner`, der den endgültigen Code enthält.
es: Viene con una carpeta de `start` para seguir junto con los tutoriales en 2D, y una carpeta de `end` que contiene el código final.
fr: Il contient un dossier `start` pour suivre les tutoriels en 2D, et un dossier `end` qui contient le code final.
ja: 2Dチュートリアルを実行するための `start` フォルダと、最終コードを含む` end` フォルダが付属しています。
zh_cn: 它附带一个跟随2D教程的 `start` 文件夹，以及一个包含最终代码的 `end` 文件夹。

source: You will find the 3D water project on `this GitHub repository <https://github.com/BastiaanOlij/shader_tutorial>`_. We didn't include it here, as it is a little heavy.
de: Sie finden das 3D-Wasserprojekt in `diesem GitHub-Repository <https://github.com/BastiaanOlij/shader_tutorial>`_. Wir haben es hier nicht aufgenommen, da es etwas schwieriger ist.
es: Encontrarás el proyecto de agua en 3D en el repositorio GitHub <https://github.com/BastiaanOlij/shader_tutorial>`_. No lo incluimos aquí, ya que es un poco pesado.
fr: Vous trouverez le projet 3D sur l'eau sur `ce dépôt GitHub <https://github.com/BastiaanOlij/shader_tutorial>`_. Nous ne l'avons pas inclus ici, car il est un peu lourd.
ja: 3Dウォータープロジェクトは、\ `このGitHubリポジトリ <https://github.com/BastiaanOlij/shader_tutorial> `_にあります。少し重いので、ここには含めませんでした。
