Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shading/shader_materials.po
Languages: de

source: Shader materials
de: Shader Materialien

source: Introduction
de: Einführung

source: For the most common cases, Godot provides ready to use materials for most types of shaders, such as :ref:`SpatialMaterial <class_SpatialMaterial>`, :ref:`CanvasItemMaterial <class_CanvasItemMaterial>` and :ref:`ParticlesMaterial <class_ParticlesMaterial>`. They are flexible implementations that cover most use cases.
de: In den häufigsten Fällen bietet Godot gebrauchsfertige Materialien für die meisten Arten von Shadern an, z.B. :ref:`SpatialMaterial <class_SpatialMaterial>` , :ref:`CanvasItemMaterial <class_CanvasItemMaterial>` und :ref:`ParticlesMaterial <class_ParticlesMaterial>`. Sie sind flexible Implementierungen, die die meisten Anwendungsfälle abdecken.

source: Shader materials allow writing a custom shader directly, for maximum flexibility. Examples of this are:
de: Shader-Materialien ermöglichen das direkte Schreiben eines benutzerdefinierten Shaders für maximale Flexibilität. Beispiele hierfür sind:

source: Create procedural textures.
de: Erstellen prozeduraler Texturen.

source: Create complex texture blending effects.
de: Erstellen Sie komplexe Texturüberblendungseffekte.

source: Create animated materials, or materials that change over time.
de: Erstellt animierte Materialien oder Materialien, die sich im Laufe der Zeit verändern.

source: Create refractive effects or other advanced effects.
de: Brechungseffekte oder andere fortgeschrittene Effekte erzeugen.

source: Create special lighting shaders for more exotic materials.
de: Erstellen Sie spezielle Beleuchtungs-Shader für exotischere Materialien.

source: Animate vertices, like tree leaves or grass.
de: Animieren Sie Eckpunkte, wie Baumblätter oder Gras.

source: Create custom particle code.
de: Benutzerdefinierten Partikelcode erstellen.

source: And much more!
de: Und vieles mehr!

source: Creating a ShaderMaterial
de: erzeugen eines Shader-Materials

source: Create a new ShaderMaterial in some object of your choice. Go to the "Material" property and create a ShaderMaterial.
de: Erstellen Sie ein neues ShaderMaterial in einem Objekt Ihrer Wahl. Gehen Sie zur Eigenschaft "Material" und erstellen Sie ein ShaderMaterial.

source: Next, click on the shader material to see its properties. From here you can create a shader or visual shader. Regular shaders use code to set their properties while a visual shader uses a node based workflow.
de: Klicken Sie anschließend auf das Shader-Material um dessen Eigenschaften anzuzeigen. Von hier aus können Sie einen Shader oder einen visuellen Shader erstellen. Normale Shader verwenden Code um ihre Eigenschaften festzulegen, während ein visueller Shader einen Node-basierten Ablauf verwendet.

source: If you need to you can convert a visual shader to a text shader. However you can't convert a text shader to a visual shader.
de: Bei Bedarf können Sie einen visuellen Shader in einen Text-Shader konvertieren. Sie können einen Text-Shader jedoch nicht in einen visuellen Shader konvertieren.

source: Choose one of them and you can start editing your shader.
de: Wählen Sie eine davon aus und Sie können mit der Bearbeitung Ihres Shaders beginnen.

source: If you create a regular shader click on it and the shader editor will open.
de: Wenn Sie einen regulären Shader erstellen, klicken Sie darauf und der Shader-Editor wird geöffnet.

source: If you create a visual shader the visual shader editor will open automatically.
de: Wenn Sie einen Visual Shader erstellen, wird der Visual Shader-Editor automatisch geöffnet.

source: In the visual shader editor you can click a button and see what your visual shader looks like as shader code. This can be useful if you're trying to replicate a text shader as nodes, or it can be used as a preview for converting your visual shader to a text shader.
de: Im Visual Shader-Editor können Sie auf eine Schaltfläche klicken und sehen, wie Ihr Visual Shader als Shader-Code aussieht. Dies kann nützlich sein, wenn Sie versuchen einen Text-Shader als Node zu replizieren oder es ist ebenfalls nützlich als Vorschau für die Konvertierung Ihres visuellen Shaders in einen Text-Shader.

source: To learn more about visual shaders, read :ref:`doc_visual_shaders`.
de: Weitere Informationen zu Visual Shadern finden Sie unter :ref:`doc_visual_shaders`.

source: Converting to ShaderMaterial
de: umwandeln in ein Shader-Material
