Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/index.po
Languages: de

source: Editor introduction
de: Einführung in den Editor

source: In this section, we cover the Godot editor in general, from its interface to using it with the command line.
de: In dieser Sektion wird der Godot Editor allgemein behandelt, von seiner Grafischen Schnittstelle bis zur Verwendung mit der Kommandozeile.

source: Editor's interface
de: Benutzeroberfläche des Editors

source: The following pages explain how to use the various windows, workspaces, and docks that make up the Godot editor. We cover some specific editors' interface in other sections where appropriate. For example, the :ref:`animation editor <doc_introduction_animation>`.
de: Die folgenden Seiten erklären die Benutzung der verschiedenen Fenster, Arbeitsumgebungen und Docks, die den Godot Editor ausmachen. Einige spezifische Benutzeroberflächen werden in anderen Sektionen behandelt, wenn es sich anbietet. Zum Beispiel der :ref:`Animations Editor<doc_introduction_animation>`.

source: Godot offers a native port of the editor running entirely on Android devices. The Android port can be downloaded from the `Android Downloads page <https://godotengine.org/download/android/>`__. While we strive for feature parity with the Desktop version of the editor, the Android port has a certain amount of caveats you should be aware of.
de: Godot bietet einen komplett nativen Port des Editors für Android Geräte an. Der Android Port kann von der `Android Downloads Seite<https://godotengine.org/download/android/>`__ heruntergeladen werden. Während wir Feature Gleichheit mit den Desktop Versionen anstreben, gibt es einige Nachteile des Android Ports, die Sie im Kopf behalten sollten.

source: Godot offers an HTML5 version of the editor running entirely in your browser. No download is required to use it, but it has a certain amount of caveats you should be aware of.
de: Godot bietet eine HTML5 Version des Editors an, die komplett in Ihrem Browser läuft. Kein Download wird benötigt um diese Version zu benutzen, doch es gibt einige Nachteile mit ihr, die Sie im Kopf behalten sollten.

source: Advanced features
de: Erweiterte Funktionen

source: The articles below focus on advanced features useful for experienced developers, such as calling Godot from the command line and using an external text editor like Visual Studio Code or Emacs.
de: Die folgenden Artikel beschäfigen sich mit fortgeschrittene Features, die für erfahrene Entwickler hilfreich sein können. Zum Beispiel das Ausführen von Godot mit der Kommandozeile oder die Benutzung externer Text Editoren, wie Visual Studio Code or Emacs.

source: Managing editor features
de: Editorfunktionen verwalten

source: Translation status
de: Übersetzungsstatus
