Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/community/contributing/bug_triage_guidelines.po
Languages: de, ja

source: Bug triage guidelines
de: Richtlinien für die Fehlerbehebung
ja: バグ分類のガイドライン

source: This page describes the typical workflow of the bug triage team aka bugsquad when handling issues and pull requests on Godot's `GitHub <https://github.com/godotengine/godot>`_ repository. It is bound to evolve together with the bugsquad, so do not hesitate to propose modifications to the following guidelines.
de: Diese Seite beschreibt den typischen Arbeitsablauf des Fehlerbeseitigungs-Teams (auch bekannt als Bugsquad) bei der Behandlung von Problemen und beim Abrufen von Anforderungen im Godot-Repository `GitHub <https://github.com/godotengine/godot>`_. Es muss sich zusammen mit dem Bugsquad weiterentwickeln. Zögern Sie also nicht, Änderungen an den folgenden Richtlinien vorzuschlagen.
ja: このページでは、Godotの`GitHub<https://github.com/godotengine/godot>`_\ repositoryで問題やプルリクエストを処理する際の、バグ分類チーム、別名バグチームの典型的なワークフローについて説明します。これはバグチームと一緒に進化することになっているので、次のガイドラインの修正を提案することをためらわないでください。

source: Issues management
de: Problem-Management
ja: 問題管理

source: GitHub proposes various features to manage issues:
de: GitHub bietet verschiedene Funktionen zum Verwalten von Problemen an:
ja: GitHubは課題を管理するためのさまざまな機能を提案します:

source: Set one or several labels from a predefined list
de: Setzen Sie einen oder mehrere Marker (Labels) aus einer vordefinierten Liste
ja: 定義済みリストから1つまたは複数のラベルを設定する

source: Set one milestone from a predefined list
de: Setzen Sie einen Meilenstein aus einer vordefinierten Liste
ja: 定義済みの一覧からマイルストーンを1つ設定する

source: Keep track of the issue in the project dashboard
de: Verfolgen Sie das Problem im Projekt-Dashboard
ja: プロジェクト・ダッシュボードで問題を追跡する

source: Define one contributor as "assignee" among the Godot engine organization members
de: Ernennen Sie einen Mitwirkenden zum "Zuständigen" unter den Mitgliedern der Godot Engine-Organisation
ja: Godotエンジン組織メンバーの間で1人の貢献者を「担当者」として定義します

source: As the Godot engine organization on GitHub currently has a restricted number of contributors, we do not use assignees extensively for now. All contributors are welcome to take on any issue, if relevant after mentioning it on the issue ticket and/or discussing the best way to resolve it with other developers.
de: Da die Godot-Engine-Organisation auf GitHub derzeit nur eine begrenzte Anzahl von Mitwirkenden hat, werden momentan nur wenige Zuständigen benötigt. Alle Mitwirkenden können sich jedes Problems annehmen, wenn dies relevant ist, nachdem sie es auf dem Problemticket erwähnt und/oder mit anderen Entwicklern besprochen haben, wie es am besten gelöst werden kann.
ja: GitHubのGodotエンジン組織には現在、限られた数の貢献者しかいないため当面は譲受人を広範囲に使用しません。すべての寄稿者は問題があればそれをissueチケットに記載したり、他の開発者と解決するための最善の方法を話し合った後で関連しているなら、どのような問題でも解決することを歓迎します。

source: For the time being we do not use the project dashboard feature either.
de: Derzeit verwenden wir auch nicht die Projekt-Dashboard-Funktion.
ja: 当面はプロジェクト・ダッシュボード機能も使用しません。

source: As far as possible, we try to assign labels (and milestones, when relevant) to both issues and pull requests.
de: Wir versuchen so weit wie möglich, sowohl Problemen als auch Pull-Anfragen Labels zuzuweisen (und gegebenenfalls Meilensteine).
ja: 可能な限り、ラベル(および関連する場合はマイルストーン)をissueとpull requestの両方に割り当てます。

source: Labels
de: Marker (Labels)
ja: ラベル

source: The following labels are currently defined in the Godot repository:
de: Die folgenden Bezeichnungen sind derzeit im Godot-Repository definiert:
ja: 現在、Godotリポジトリでは以下のラベルが定義されています:

source: **Categories:**
de: **Kategorien:**
ja: **カテゴリ:**

source: *Archived*: either a duplicate of another issue, or invalid. Such an issue would also be closed.
de: *Archived*: entweder ein Duplikat eines anderen Problems oder ungültig. Ein solches Problem wäre ebenfalls geschlossen.
ja: *Archived*：他の問題の重複、または無効です。 このような問題も解決されるでしょう。

source: *Bug*: describes something that is not working properly.
de: *Bug*: beschreibt etwas, das nicht richtig funktioniert.
ja: *Bug*:正しく動作していないものを示します。

source: *Confirmed*: has been confirmed by at least one other contributor than the bug reporter (typically for *Bug* reports). The purpose of this label is to let developers know which issues are still reproducible when they want to select what to work on. It is therefore a good practice to add in a comment on what platform and what version or commit of Godot the issue could be reproduced; if a developer looks at the issue one year later, the *Confirmed* label may not be relevant anymore.
de: *Confirmed*: wurde von mindestens einem anderen Mitwirkenden als dem Fehler-Reporter bestätigt (normalerweise für *Fehler*-Berichte). Dieses Label soll Entwickler zeigen (bei der Auswahl woran sie arbeiten möchten) welche Probleme noch reproduzierbar sind. Es ist daher eine gute Praxis in einem Kommentar hinzuzufügen, auf welcher Plattform und in welcher Version oder in welchem Version von Godot das Problem reproduziert werden könnte. Wenn sich ein Entwickler ein Jahr später mit dem Problem befasst, ist der Marker *Bestätigt* möglicherweise nicht mehr relevant.
ja: *Confirmed*\ :バグ報告者以外の少なくとも1人の貢献者によって確認されています(通常は\ *バグ*\ 報告用)。 このラベルの目的は、作業対象を選択するときに、どの問題がまだ再現可能であるかを開発者に知らせることです。 したがって、問題を再現できるプラットフォームとGodotのバージョンまたはコミットに関するコメントを追加することをお勧めします。 開発者が1年後に問題を見ると、Confirmedラベルはもう関係ないかもしれません。

source: *Discussion*: the issue is not consensual and needs further discussion to define what exactly should be done to address the topic.
de: *Discussion*: Das Problem ist nicht einvernehmlich und bedarf weiterer Diskussion, um zu definieren, was genau getan werden soll, um das Thema anzugehen.
ja: *Discussion*\ :問題は合意に達しておらず、トピックに対処するために何をすべきかを正確に定義するために、さらなる議論が必要です。

source: *Documentation*: issue related to the documentation. Mainly to request enhancements in the API documentation. Issues related to the ReadTheDocs documentation should be filed on the `godot-docs <https://github.com/godotengine/godot-docs>`_ repository.
de: *Documentation*: Problem im Zusammenhang mit der Dokumentation, hauptsächlich, um Verbesserungen in der API-Dokumentation anzufordern. Probleme im Zusammenhang mit der ReadTheDocs-Dokumentation sollten im `godot-docs <https://github.com/godotengine/godot-docs>`_ Repository abgelegt werden.
ja: *Documentation*\ : ドキュメントに関連する問題。主に APIドキュメントの機能強化を要求します。ReadTheDocs ドキュメントに関連する問題は、 `godot-docs <https://github.com/godotengine/godot-docs>`_\ リポジトリに提出する必要があります。

source: *Enhancement*: describes a proposed enhancement to an existing functionality.
de: *Enhancement*: Beschreibt eine vorgeschlagene Erweiterung einer vorhandenen Funktionalität.
ja: *Enhancement*\ : 既存の機能に対して提案された拡張機能について説明します。

source: *Feature proposal*: describes a wish for a new feature to be implemented.
de: *Feature proposal*: beschreibt den Wunsch nach Implementierung einer neuen Funktion.
ja: *Feature proposal*\ :新機能の実装希望を記載しています。

source: *Junior job*: the issue is *assumed* to be an easy one to fix, which makes it a great fit for junior contributors who need to become familiar with the code base.
de: *Junior job*: Es wird *angenommen*, dass das Problem leicht zu beheben ist, was es ideal für Junior-Mitwirkende macht, die sich mit der Codebasis vertraut machen müssen.
ja: *Junior job*\ :問題は\ *修正しやすいものであると仮定され*\ 、コードベースに精通する必要があるジュニア貢献者に最適です。

source: *Needs rebase*: the issue need a git rebase to be merged.
ja: *Needs rebase*\ : 問題をマージするにはgitリベースが必要です。

source: *Needs testing*: the issue/pull request could not be completely tested and thus need further testing. This can mean that it needs to be tested on different hardware/software configurations or even that the steps to reproduce are not certain.
de: *Needs testing*: Die Problem/Pull-Anforderung konnte nicht vollständig getestet werden und bedarf somit weiterer Tests. Dies kann bedeuten, dass es auf verschiedenen Hardware-/Softwarekonfigurationen getestet werden muss oder dass die zu reproduzierenden Schritte nicht sicher sind.
ja: *Needs testing*\ : 問題/プルリクエストを完全にテストできなかったため、さらにテストを行う必要があります。これは、異なるハードウェア/ソフトウェア構成でテストする必要があること、または再現する手順が明確でないことを意味します。

source: *PR welcome / hero wanted!*: Contributions for issues with these labels are especially welcome. Note that this **doesn't** mean you can't work on issues without these labels.
ja: *PR welcome / hero wanted!*\ :これらのラベルに関する問題への貢献を特に歓迎します。ただし、これらのラベルがないと問題に対処できないわけではありません。

source: *Tracker*: issue used to track other issues (like all issues related to the plugin system).
de: *Tracker*: Problem das verwendet wird, um andere Probleme zu verfolgen (wie alle Probleme im Zusammenhang mit dem Plugin-System).
ja: *Tracker*\ :他の問題を追跡するために使用される問題(プラグインシステムに関連するすべての問題のような)。

source: *Usability*: issues that directly impact user usability.
ja: *Usability*\ :ユーザーの使いやすさに直接影響を与える問題。

source: The categories are used for general triage of the issues. They can be combined in some way when relevant, e.g. an issue can be labelled *Enhancement* and *Usability* at the same time if it's an issue to improve usability. Or *Feature proposal* and *Discussion* if it's a non-consensual feature request, or one that is not precise enough to be worked on.
de: Die Kategorien werden für die allgemeine Analyse der Probleme verwendet. Sie können auf irgendeine Weise kombiniert werden, wenn dies relevant ist, z.B. ein Problem kann gleichzeitig als *Enhancement* und *Usability* bezeichnet werden, wenn es sich um ein Problem zur Verbesserung der Benutzerfreundlichkeit handelt. Oder *Feature proposal* und *Discussion*, wenn es sich um eine nicht einvernehmliche Funktionsanforderung handelt oder wenn diese nicht präzise genug ist, um bearbeitet zu werden.
ja: カテゴリは、問題の一般的な優先順位付けに使用されます。例えば、ユーザビリティを向上させるための問題であれば、\ *Enhancement*\ と\ *Usability* \というラベルを同時に付けることができます。あるいは、合意に達していない機能要求であったり、作業するのに十分に正確でないものであれば、\ *Feature proposal*\ と\ *Discussion*\ です。

source: **Topics:**
de: **Themen:**
ja: **トピック:**

source: *Assetlib*: relates to issues with the asset library.
de: *Assetlib*: Bezieht sich auf Probleme mit der Bestandsbibliothek.
ja: *Assetlib*\ :アセットライブラリの問題に関連します。

source: *Audio*: relates to the audio features (low and high level).
de: *Audio*: bezieht sich auf die Audiofunktionen (niedriger und hoher Stufe).
ja: *Audio*\ :オーディオ機能(低レベルと高レベル)に関連しています。

source: *Buildsystem*: relates to building issues, either linked to the SCons buildsystem or to compiler peculiarities.
de: *Buildsystem*: bezieht sich auf Build-Probleme, die entweder mit dem SCons-Buildsystem oder mit den Besonderheiten des Compilers zusammenhängen.
ja: *Buildsystem*\ :SConsビルドシステムまたはコンパイラの特殊性にリンクされたビルドの問題に関連します。

source: *Core*: anything related to the core engine. It might be further split later on as it's a pretty big topic.
de: *Core*: alles, was mit der Haupt-Engine zu tun hat. Es könnte später weiter aufgeteilt werden, da es ein ziemlich großes Thema ist.
ja: *Core*\ :コアエンジンに関連するもの。それはかなり大きな話題なので、後でさらに分割されるかもしれません。

source: *Drivers*: relates to issues with the drivers used by the engine.
de: *Drivers*: bezieht sich auf Probleme mit den von der Engine verwendeten Treibern.
ja: *Drivers*\ : エンジンで使用されるドライバの問題に関連します。

source: *Editor*: relates to issues in the editor (mainly UI).
de: *Editor*: bezieht sich auf Probleme im Editor (hauptsächlich UI).
ja: *Editor*\ :エディターの問題(主にUI)に関連します。

source: *GDNative*: relates to the GDNative module.
de: *GDNative*: bezieht sich auf das GDNative-Modul.
ja: *GDNative*\ :GDNativeモジュールに関連します。

source: *GDScript*: relates to GDScript.
de: *GDScript*: bezieht sich auf GDScript.
ja: *GDScript*\ :GDScript に関連します。

source: *Mono*: relates to the C# / Mono bindings.
de: *Mono*: bezieht sich auf C# / Mono Bindings.
ja: *Mono*\ : C#/Mono バインディングに関連します。

source: *Network*: relates to networking.
de: *Network*: bezieht sich auf Networking.
ja: *Network*\ :ネットワークに関連します。

source: *Physics*: relates to the physics engine (2D/3D).
de: *Physics*: bezieht sich auf die Physik Engine (2D/3D).
ja: *Physics*\ :物理エンジン(2D/3D)に関連します。

source: *Plugin*: relates to problems encountered while writing plugins.
de: *Plugin*: bezieht sich auf Probleme beim Schreiben von Plugins.
ja: *Plugin*\ :プラグインの書き込み中に発生した問題に関連しています。

source: *Porting*: relates to some specific platforms.
de: *Porting*: bezieht sich auf einige spezielle Plattformen.
ja: *Porting*\ :いくつかの特定のプラットフォームに関連しています。

source: *Rendering*: relates to the 2D and 3D rendering engines.
de: *Rendering*: bezieht sich auf die 2D und 3D Rendering Engine.
ja: *Rendering*\ :2Dおよび3Dレンダリングエンジンに関連します。

source: *VisualScript*: relates to issues with the visual scripting language.
de: *VisualScript*: bezieht sich auf Probleme mit der visuellen Skriptsprache.
ja: *VisualScript*\ : ビジュアルスクリプト言語の問題に関連します。

source: Issues would typically correspond to only one topic, though it's not unthinkable to see issues that fit two bills. The general idea is that there will be specialized contributors teams behind all topics, so they can focus on the issues labelled with their team's topic.
de: Probleme entsprechen normalerweise nur einem Thema, obwohl es nicht undenkbar ist, Probleme zu sehen, die zu zwei Themen passen. Die allgemeine Idee ist, dass hinter allen Themen spezialisierte Mitarbeiterteams stehen, damit sie sich auf die Themen konzentrieren können, die mit dem Thema ihres Teams gekennzeichnet sind.
ja: 通常、問題は1つのトピックにのみ対応しますが、2つの案に当てはまる問題を見つけることは考えられません。 一般的な考え方は、すべてのトピックの背後に専門の貢献者チームがあるため、チームのトピックでラベル付けされた問題に集中できるということです。

source: **Platforms:**
de: **Plattformen:**
ja: **プラットフォーム:**

source: By default, it is assumed that a given issue applies to all platforms. If one of the platform labels is used, it is then exclusive and the previous assumption doesn't stand anymore (so if it's a bug on e.g. Android and Linux exclusively, select those two platforms).
de: Standardmäßig wird davon ausgegangen, dass ein bestimmtes Problem für alle Plattformen gilt. Wenn eines der Plattform-Labels verwendet wird, ist es exklusiv und die vorherige Annahme gilt nicht mehr (wenn es sich also ausschließlich um einen Fehler unter Android und Linux handelt, wählen Sie diese beiden Plattformen aus).
ja: デフォルトでは、特定の問題がすべてのプラットフォームに適用されると想定されています。プラットフォームラベルのいずれかが使用された場合、それは排他的であり、以前の前提はもはや存在しません(AndroidとLinuxのみのバグの場合は、この2つのプラットフォームを選択してください。)。

source: Milestones
de: Meilensteine
ja: マイルス トーン

source: `Milestones <https://github.com/godotengine/godot/milestones>`_ correspond to planned future versions of Godot for which there is an existing roadmap. Issues that fit in the said roadmap should be filed under the corresponding milestone; if they don't correspond to any current roadmap, they should be left without milestone. As a rule of thumb, an issue corresponds to a given milestone if it concerns a feature that is new in the milestone, or a critical bug that can't be accepted in any future stable release, or anything that Juan wants to work on right now :)
ja: `マイルストーン <https://github.com/godotengine/godot/milestones>`_ \ は、既存のロードマップがあるGodotの将来のバージョンの計画に対応します。上記のロードマップに適合する問題は、対応するマイルストーンの下に提出されるべきです。;現在のロードマップに対応していない場合は、マイルストーンを設定しないでください。大ざっぱに言って、ある問題があるマイルストーンに対応するのは、そのマイルストーンの新しい機能や、将来の安定版リリースでは受け入れられない重大なバグ、あるいはJuanが今すぐ取り組みたいと思っていることに関係している場合です :)

source: Contributors are free to pick issues regardless of their assigned milestone; if a fix is proposed for a bug that was not deemed urgent and thus without milestone, it would likely still be very welcome.
de: Es steht den Mitwirkenden frei, Probleme unabhängig von ihrem zugewiesenen Meilenstein auszuwählen. Wenn ein Fix für einen Fehler vorgeschlagen wird, der nicht als dringend und damit ohne Meilenstein eingestuft wurde, wäre er wahrscheinlich immer noch sehr willkommen.
ja: 貢献者は、割り当てられたマイルストーンに関係なく、問題を自由に選択できます。 緊急とみなされなかったため、マイルストーンのないバグの修正が提案された場合、それでも大歓迎です。

source: *Needs rebase*: the issue need a Git rebase to be merged.
de: *Needs rebase*: Für das Problem muss eine Git-Rebase zusammengeführt werden.

source: `Milestones <https://github.com/godotengine/godot/milestones>`_ correspond to planned future versions of Godot for which there is an existing roadmap. Issues that fit in the said roadmap should be filed under the corresponding milestone; if they don't correspond to any current roadmap, they should be left without milestone. As a rule of thumb, an issue corresponds to a given milestone if it concerns a feature that is new in the milestone, or a critical bug that can't be accepted in any future stable release, or anything that Juan wants to work on right now. :)
de: `Meilensteine <https://github.com/godotengine/godot/milestones>`_ entsprechen geplanten zukünftigen Versionen von Godot, für die es eine bestehende Roadmap gibt. Probleme, die in diese Roadmap passen, sollten unter dem entsprechenden Meilenstein eingereicht werden. Wenn sie keiner aktuellen Roadmap entsprechen, sollten sie ohne Meilenstein bleiben. Als Faustregel gilt, dass ein Problem einem bestimmten Meilenstein entspricht, wenn es sich um eine Funktion handelt, die neu im Meilenstein ist, oder um einen kritischen Fehler, der in einer zukünftigen stabilen Version nicht akzeptiert werden kann, oder um etwas, an dem Juan richtig arbeiten möchte jetzt. :)
