Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/community/contributing/building_the_manual.po
Languages: de, fr

source: Building the manual with Sphinx
de: Erstellen des Handbuchs mit Sphinx
fr: Compiler le manuel avec Sphinx

source: This page explains how to build a local copy of the Godot manual using the Sphinx docs engine. This allows you to have local HTML files and build the documentation as a PDF, EPUB, or LaTeX file, for example.
de: Auf dieser Seite wird erklärt, wie Sie eine lokale Kopie des Godot-Handbuchs mithilfe der Sphinx docs-Engine erstellen können. Dies ermöglicht Ihnen, lokale HTML-Dateien zu haben und die Dokumentation z. B. als PDF-, EPUB- oder LaTeX-Datei zu erstellen.
fr: Cette page explique comment compiler une copie locale du manuel Godot en utilisant le moteur Sphinx docs. Cela vous permet d’avoir des fichiers HTML locaux et de créer la documentation sous la forme d’un fichier PDF, EPUB ou LaTeX, par exemple.

source: To get started, you need to:
de: Um zu beginnen, müssen Sie:
fr: Pour commencer, vous devez :

source: Clone the `godot-docs repository <https://github.com/godotengine/godot-docs/>`__.
de: Klonen Sie das `godot-docs-Repository <https://github.com/godotengine/godot-docs/>`__.
fr: Clonez le `dépôt godot-docs <https://github.com/godotengine/godot-docs/>`__.

source: Install `Sphinx <https://www.sphinx-doc.org/>`__
de: Installieren Sie `Sphinx <https://www.sphinx-doc.org/>`__
fr: Installer `Sphinx <https://www.sphinx-doc.org/>`__

source: To build the docs as HTML files, install the `readthedocs.org theme <https://github.com/snide/sphinx_rtd_theme>`__.
de: Um die Dokumente als HTML-Dateien zu erstellen, installieren Sie das `readthedocs.org design <https://github.com/snide/sphinx_rtd_theme>`__.
fr: Pour construire les docs en tant que fichiers HTML, installez le `thème readthedocs.org <https://github.com/snide/sphinx_rtd_theme>`__.

source: Install the Sphinx extensions defined in the `godot-docs repository <https://github.com/godotengine/godot-docs/>`__ ``requirements.txt`` file.
de: Installieren Sie die Sphinx-Erweiterungen, die in `godot-docs repository <https://github.com/godotengine/godot-docs/>`__ ``requirements.txt`` definiert sind.
fr: Installez les extensions Sphinx définies dans le fichier `godot-docs repository <https://github.com/godotengine/godot-docs/>`__ ``requirements.txt``.

source: We recommend using `pip <https://pip.pypa.io>`__, Python’s package manager to install all these tools. It comes pre-installed with `Python <https://www.python.org/>`__. Ensure that you install and use Python 3. Here are the commands to clone the repository and then install all requirements.
de: Wir empfehlen die Verwendung von `pip <https://pip.pypa.io>`__, dem Paketmanager von Python, um alle diese Werkzeuge zu installieren. Er wird mit `Python <https://www.python.org/>`__ vorinstalliert. Stellen Sie sicher, dass Sie Python 3 installieren und verwenden. Hier sind die Befehle, um das Repository zu klonen und dann alle Anforderungen zu installieren.
fr: Nous recommandons d'utiliser `pip <https://pip.pypa.io>`__, le gestionnaire de paquets de Python pour installer tous ces outils. Il est livré préinstallé avec `Python <https://www.python.org/>`__. Assurez-vous que vous installez et utilisez Python 3. Voici les commandes pour cloner le dépôt et ensuite installer toutes les exigences.

source: With the programs installed, you can build the HTML documentation from the root folder of this repository with the following command:
de: Wenn die Programme installiert sind, können Sie die HTML-Dokumentation aus dem Stammordner dieses Repositorys mit dem folgenden Befehl erstellen:
fr: Avec les programmes installés, vous pouvez compiler la documentation HTML depuis le répertoire racine avec la commande suivante :

source: If you run into errors, you may try the following command:
de: Wenn Sie auf Fehler stoßen, können Sie den folgenden Befehl versuchen:
fr: Si vous rencontrez des erreurs, vous pouvez essayer la commande suivante :

source: Building the documentation requires at least 8 GB of RAM to run without disk swapping, which slows it down. If you have at least 16 GB of RAM, you can speed up compilation by running:
de: Das Erstellen der Dokumentation erfordert mindestens 8 GB RAM, um ohne Festplattenswapping zu laufen, was es verlangsamt. Wenn Sie mindestens 16 GB RAM haben, können Sie die Kompilierung beschleunigen, indem Sie ausführen:
fr: La compilation de la documentation requiert au moins 8 Go de RAM pour fonctionner sans swapping, ce qui la ralentit. Si vous avez au moins 16 Go de RAM, vous pouvez accélérer la compilation en exécutant :

source: The compilation will take some time as the ``classes/`` folder contains hundreds of files.
de: Die Kompilierung wird einige Zeit dauern, da der Ordner ``classes/`` hunderte von Dateien enthält.
fr: La compilation prendra un certain temps car le dossier ``classes/`` contient des centaines de fichiers.

source: You can then browse the documentation by opening ``_build/html/index.html`` in your web browser.
de: Sie können dann die Dokumentation durchsuchen, indem Sie ``_build/html/index.html`` in Ihrem Webbrowser öffnen.
fr: Vous pouvez ensuite parcourir la documentation en ouvrant ``_build/html/index.html`` dans votre navigateur web.

source: In case you of a ``MemoryError`` or ``EOFError``, you can remove the ``classes/`` folder and run ``make`` again. This will drop the class references from the final HTML documentation but will keep the rest intact.
de: Falls Sie einen ``MemoryError`` oder ``EOFError`` erhalten, können Sie den Ordner ``classes/`` entfernen und ``make`` erneut ausführen. Dadurch werden die Klassenreferenzen aus der endgültigen HTML-Dokumentation entfernt, aber der Rest bleibt intakt.
fr: Si vous obtenez un ``MemoryError`` ou un ``EOFError``, vous pouvez supprimer le dossier ``classes/`` et relancer ``make``. Cela supprimera les références aux classes dans la documentation HTML finale mais gardera le reste intact.

source: If you delete the ``classes/`` folder, do not use ``git add .`` when working on a pull request or the whole ``classes/`` folder will be removed when you commit. See `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ for more detail.
de: Wenn Sie den Ordner ``classes/`` löschen, verwenden Sie nicht ``git add``, wenn Sie an einer Pull-Request arbeiten, sonst wird der gesamte Ordner ``classes/`` beim Commit entfernt. Siehe `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ für weitere Details.
fr: Si vous supprimez le dossier ``classes/``, n'utilisez pas ``git add .`` lorsque vous travaillez sur une pull request ou l'ensemble du dossier ``classes/`` sera supprimé lors du commit. Voir `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ pour plus de détails.

source: Alternatively, you can build the documentation by running the sphinx-build program manually:
de: Alternativ können Sie die Dokumentation auch erstellen, indem Sie das Programm sphinx-build manuell ausführen:
fr: Autrement, vous pouvez compiler la documentation en exécutant manuellement le programme sphinx-build :

source: Building with Sphinx and virtualenv
de: Komilieren mit Sphinx und virtualenv
fr: Compilation avec Sphinx et virtualenv

source: If you want your Sphinx installation scoped to the project, you can install sphinx-build using virtualenv. To do so, run this command from this repository's root folder:
de: Wenn Sie Ihre Sphinx-Installation auf das Projekt beschränken möchten, können Sie sphinx-build mit virtualenv installieren. Führen Sie dazu diesen Befehl aus dem Stammordner dieses Repositorys aus:
fr: Si vous voulez que votre installation de Sphinx soit appliqué au projet, vous pouvez installer sphinx-build en utilisant virtualenv. Pour le faire, exécutez cette commande depuis le répertoire racine :

source: Then, run ``make html`` as shown above.
de: Führen Sie dann ``make html`` wie oben gezeigt aus.
fr: Ensuite, exécutez ``make html`` comme indiqué ci-dessus.
