Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/community/contributing/documentation_guidelines.po
Languages: ja, ru

source: Documentation guidelines
ja: ドキュメントのガイドライン
ru: Руководство по документации

source: This page describes the rules to follow if you want to contribute to Godot Engine by writing or reviewing documentation, or by translating existing documentation. Also, have a look at README of the `godot-docs GitHub repository <https://github.com/godotengine/godot-docs>`_ and the `docs front page <https://docs.godotengine.org>`_ on what steps to follow and how to contact the docs team.
ru: На этой странице описаны правила, которых следует придерживаться, если вы хотите внести свой вклад в Godot Engine создавая, проверяя или переводя его документацию. Помимо этих правил ознакомьтесь с файлом README в `GitHub-репозитории godot-docs <https://github.com/godotengine/godot-docs>`_ и с `заглавной страницей этого сайта <https://docs.godotengine.org/ru/stable/>`_, чтобы узнать о том, какие шаги следует предпринять и как связаться с командой, работающей над документацией.

source: How to contribute
ja: 貢献する方法
ru: Как внести свой вклад

source: Creating or modifying documentation pages is mainly done via the `godot-docs GitHub repository <https://github.com/godotengine/godot-docs>`_. The HTML (or PDF and EPUB) documentation is generated from the .rst files (reStructuredText markup language) in that repository. Modifying those pages in a pull request and getting it merged will trigger a rebuild of the online documentation.
ja: ドキュメントページの作成または変更は、主に\ `godot-docs GitHub リポジトリ <https://github.com/godotengine/godot-docs>`_\ を介して行われます。HTML(またはPDFおよびEPUB)ドキュメントは、そのリポジトリの.rst ファイル (reStructuredTextマークアップ言語) から生成されます。プルリクエストでこれらのページを変更し、マージすると、オンラインドキュメントの再構築がトリガーされます。
ru: Создание или изменение страниц документации обычно осуществляется через `GitHub-репозитории godot-docs <https://github.com/godotengine/godot-docs>`_. Страницы HTML (или документы PDF и EPUB) генерируется из файлов .rst (язык разметки reStructuredText), находящихся в этом репозитории. Изменение этих файлов с помощью Pull request и Merging вызовет изменение онлайн-документации.

source: For details on Git usage and the pull request workflow, please refer to the :ref:`doc_pr_workflow` page. Most of what it describes regarding the main godotengine/godot repository is also valid for the docs repository.
ja: Gitの使用状況とプル要求ワークフローの詳細については、\ :ref:`doc_pr_workflow`\ ページを参照してください。メインの godotengine/godot リポジトリに関する記述のほとんどは、ドキュメントリポジトリにも有効です。
ru: Для получения подробной информации об использовании Git, в том числе - о механизме Pull request, обратитесь к странице :ref:`doc_pr_workflow`. Большая часть того, что там сказано относительно основного репозитория godotengine/godot, также применимо и к репозиторию godotengine/godot-docs.

source: The README.md file contains all the information you need to get you started, please read it. In particular, it contains some tips and tricks and links to reference documentation about the reStructuredText markup language.
ja: README.mdファイルには、あなたが開始するために必要なすべての情報が含まれていますので、それを読んでください。特に、reStructuredTextマークアップ言語に関する参考資料へのヒントとコツとリンクが含まれています。
ru: Файл README.md содержит всю информацию, необходимую для начала работы, поэтому пожалуйста, прочтите его. В частности, он содержит некоторые советы, рекомендации и ссылки на справочную информацию о языке разметки reStructuredText.

source: If you want to edit the **API reference**, please note that it should *not* be done in the godot-docs repository. Instead, you should edit the ``doc/classes/*`` XML files of Godot's main repository. These files are then later used to generate the in-editor documentation as well as the API reference of the online docs. Read more here: :ref:`doc_updating_the_class_reference`.
ja: **APIリファレンス**\ を編集する場合は、godot-docsリポジトリで\ *行ってはならない*\ ことに注意してください。 代わりに、Godotのメインリポジトリの ``doc/classes/*`` XMLファイルを編集する必要があります。 これらのファイルは、後でエディタ内のドキュメントとオンラインドキュメントのAPIリファレンスを生成するために使用されます。 詳細はこちら:\ :ref:`doc_updating_the_class_reference`\ 。
ru: Обратите внимание, что справочник **Godot API** нужно редактировать *не* в репозитории godot-docs. Вместо этого вам необходимо редактировать XML-файлы в каталоге `doc/classes/*` основного репозитория Godot. Эти файлы будут использованы для генерации как справки в редакторе Godot, так и веб-страниц в разделе Godot API. Подробнее читайте здесь: :ref:`doc_updating_the_class_reference`.

source: The 'Edit on GitHub' link
ja: 「GitHubで編集」リンク
ru: Ссылка 'Edit on GitHub'

source: If you're reading documentation on `docs.godotengine.org <https://docs.godotengine.org>`_, you'll see an **Edit on GitHub** hyperlink at the top right of the page. Once you've created a GitHub account, you can propose changes to a page you're reading as follows:
ru: Если вы читаете эту документацию на сайте `docs.godotengine.org <https://docs.godotengine.org>`_, то вы можете увидеть гиперссылку **Edit на GitHub** в правом верхнем углу страницы (примечание переводчика: это работает только для англоязычных страниц). При условии, что у вас есть учётная запись GitHub, вы можете предложить изменения для страницы, которую читаете, следующим образом:

source: Click the **Edit on GitHub** button.
ja: **Edit on GitHub** ボタンをクリックします。
ru: нажмите кнопку **Edit on GitHub**;

source: On the GitHub page you're taken to, click the pencil icon in the top-right corner near the **Raw**, **Blame** and **History** buttons. It has the tooltip "Edit the file in a fork of this project".
ja: 表示されたGitHubページで、右上の[**Raw**]、[**Blame**]、[**History**]ボタンの近くにある鉛筆アイコンをクリックします。このボタンのツールチップは "Edit the file in a fork of this project" です。
ru: на открывшейся странице GitHub нажмите значок карандаша в правом верхнем углу рядом с кнопками **Raw** и **Blame** - на нём будет всплывающая подсказка "Edit the file in a fork of this project" ("Редактировать файл в форке этого проекта");

source: Complete all the edits you want to make for that page.
ja: そのページに対して行うすべての編集を完了します。
ru: внесите необходимые на ваш взгляд изменения в текст страницы;

source: Summarize the changes you made in the form at the bottom of the page and click the button labelled **Propose file change** when done.
ru: кратко опишите внесённые изменения в форме внизу страницы и нажмите кнопку **Propose file change** (предложить изменение файла);

source: On the following screens, click the **Create pull request** button until you see a message like *Username wants to merge 1 commit into godotengine:master from Username:patch-6*.
ru: на следующей странице нажимайте кнопку **Create pull request** (создать запрос), пока не увидите сообщение типа *Username wants to merge 1 commit into godotengine:master from Username:patch-6*;

source: A reviewer will evaluate your changes and incorporate them into the docs if they're acceptable. You might also be asked to make modifications to your changes before they're included.
ru: рецензент оценит ваши изменения и, если они приемлемы, включит их в документацию; вас также могут попросить исправить что-то в вашем предложении, прежде чем принять его.

source: What makes good documentation?
ja: 優れたドキュメントとは何ですか?
ru: Что делает документацию хорошей?

source: Documentation should be well written in plain English, using well-formed sentences and various levels of sections and subsections. It should be clear and objective. Also, have a look at the :ref:`doc_docs_writing_guidelines`.
ru: Документация должна быть написана грамотно, на простом языке, с использованием хорошо сформулированных и структурированных предложений. Она должна быть ясной и объективной. Кроме того, взгляните на :ref:`doc_docs_writing_guidelines`.

source: We differentiate tutorial pages from other documentation pages by these definitions:
ja: チュートリアルページを他のドキュメントページと区別します:
ru: Мы разделяем страницы-уроки и прочие страницы документации по следующим признакам:

source: Tutorial: a page aiming at explaining how to use one or more concepts in the editor or scripts in order to achieve a specific goal with a learning purpose (e.g. "Making a simple 2d Pong game", "Applying forces to an object").
ja: チュートリアル:学習目的で特定の目標を達成するためにエディタまたはスクリプトで1つ以上の概念を使用する方法を説明することを目的としたページ(例:「シンプルな2D卓球ゲームを作る」、「オブジェクトに力を適用する」など)。
ru: урок (туториал): страница, предназначенная для объяснения того, как использовать одну или несколько концепций в редакторе или скриптах для решения конкретной задачи с целью обучения (примеры: "Создание простой 2D-игры в пинг-понг", "Применение сил к объекту");

source: Documentation: a page describing precisely one and only one concept at a time, if possible exhaustively (e.g. the list of methods of the Sprite class, or an overview of the input management in Godot).
ja: ドキュメント:可能であれば、一度に1つだけの概念を正確に記述するページ (Spriteクラスのメソッドの一覧やGodotの入力管理の概要など)。
ru: документация: страница, в рамках которой описывается одна и только одна концепция - настолько исчерпывающе, насколько это возможно (примеры: "Список методов класса Sprite", "Обзор управления входными данными в Godot").

source: You are free to write the kind of documentation you wish, as long as you respect the following rules (and the ones on the repo).
ja: 次のルール(およびレポのルール)を尊重する限り、希望する種類のドキュメントを自由に作成できます。
ru: Вы можете писать любую документацию, какую пожелаете - при условии соблюдения правил, описанных здесь и в репозитории.

source: Titles
ja: タイトル
ru: Заголовки

source: Always begin pages with their title and a Sphinx reference name:
ja: 常にタイトルと Sphinx参照名でページを開始します:
ru: Всегда начинайте файл с имени-ссылки для Sphinx и заголовка страницы:

source: The reference allows linking to this page using the ``:ref:`` format, e.g. ``:ref:`doc_insert_your_title_here``` would link to the above example page (note the lack of leading underscore in the reference).
ru: Первая строка позволяет инструменту Sphinx ссылаться на эту страницу в формате ``:ref:``; например ``:ref:`doc_insert_your_title_here``` будет ссылаться на приведённую выше страницу (обратите внимание на отсутствие начального подчёркивания в ссылке).

source: Also, avoid American CamelCase titles: title's first word should begin with a capitalized letter, and every following word should not. Thus, this is a good example:
ja: また、アメリカのキャメルケースのタイトルは避けてください。タイトルの最初の単語は大文字で始める必要があり、その後に続く単語はすべて大文字で始めるべきではありません。たとえば、次のようになります:
ru: Кроме того, избегайте использования заголовков в стиле American CamelCase - первое слово заголовка должно начинаться с заглавной буквы, а каждое следующее слово - со строчной. Вот это хороший пример:

source: Insert your title here
ja: Insert your title here (注:これは英文専用の留意項目です)
ru: Подставьте ваш заголовок здесь

source: And this is a bad example:
ja: これは悪い例です:
ru: А это - плохой пример:

source: Insert Your Title Here
ja: Insert Your Title Here (注:これは英文専用の留意項目です)
ru: Подставьте Ваш Заголовок Здесь

source: Only project, people and node class names should have capitalized first letter.
ja: プロジェクト名、ユーザー名、およびノードクラス名だけは先頭を大文字にしてください。
ru: Только имена собственные (названия проектов, имена людей) и наименования классов узлов должны начинаться с заглавной буквы.

source: Translating existing pages
ja: 既存のページの翻訳
ru: Перевод существующих страниц

source: You can help to translate the official Godot documentation on our `Hosted Weblate <https://hosted.weblate.org/engage/godot-engine/>`_.
ja: `Hosted Weblate <https://hosted.weblate.org/engage/godot-engine/>`_でGodotの公式ドキュメントを翻訳することができます。
ru: Вы можете помочь перевести официальную документацию Godot здесь: `Hosted Weblate <https://hosted.weblate.org/engage/godot-engine/>`_.

source: There also is the official `Godot i18n repository <https://github.com/godotengine/godot-docs-l10n>`_ where you can see when the data was last synchronized.
ru: Существует также официальный репозиторий `godot-docs-l10n <https://github.com/godotengine/godot-docs-l10n>`_ , где вы можете увидеть, когда данные были синхронизированы в последний раз.

source: License
ja: ライセンス
ru: Лицензия

source: This documentation and every page it contains is published under the terms of the `Creative Commons Attribution 3.0 license (CC-BY-3.0) <https://tldrlegal.com/license/creative-commons-attribution-(cc)>`_, with attribution to "Juan Linietsky, Ariel Manzur and the Godot community".
ja: このコンテンツは、"Juan Linietsky"、 "Ariel Manzur " そして "Godot Engine community" によって、クリエイティブ・コモンズ-表示 3.0( `CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_\ )ライセンスの下、管理されております。
ru: Эта документация и каждая содержащаяся в ней страница публикуются в соответствии с условиями лицензии Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://tldrlegal.com/license/creative-commons-attribution-(cc)>`_), за авторством "Juan Linietsky, Ariel Manzur и сообщество Godot".

source: By contributing to the documentation on the GitHub repository, you agree that your changes are distributed under this license.
ja: GitHubリポジトリのドキュメントに投稿することで、変更がこのライセンスの下で配布されることに同意します。
ru: Внося свой вклад в документацию через GitHub репозиторий, вы соглашаетесь с тем, что ваши изменения распространяются в соответствии с настоящей лицензией.
