Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/community/contributing/updating_the_class_reference.po
Languages: de, es, fr, ja, zh_cn, zh_tw

source: Contributing to the class reference
de: Beitrag zur Klassenreferenz
es: Contribuyendo a la referencia de la clase
zh_cn: 为类参考手册贡献
zh_tw: 參與貢獻類別參照文件

source: This guide also is available as a `video tutorial on YouTube <https://www.youtube.com/watch?v=5jeHXxeX-JY>`_.
de: Diese Anleitung ist auch verfügbar als `Videoanleitung auf Youtube <https://www.youtube.com/watch?v=y1E_y9AIqow>`_ .
es: Este guía esta disponible como un `video tutorial en Youtube <https://www.youtube.com/watch?v=5jeHXxeX-JY>`_.
fr: Ce guide est disponible sous forme de `tutoriel vidéo sur YouTube <https://www.youtube.com/watch?v=5jeHXxeX-JY>`_.
zh_cn: 本指南也可以在YouTube上以 `video tutorial on YouTube <https://www.youtube.com/watch?v=5jeHXxeX-JY>` _.
zh_tw: 本影片亦有 `在 YouTube 上以影片教學的形式 <https://www.youtube.com/watch?v=5jeHXxeX-JY>`_ 提供。

source: Godot ships with many nodes and singletons to help you develop your games. Each is a class, documented in the :ref:`class reference <toc-class-ref>`. This reference is essential for anyone learning the engine: it is available both online and in the engine.
de: Godot wird mit vielen Nodes und Singletons geliefert, um Ihnen bei der Entwicklung Ihrer Spiele zu helfen. Jedes ist eine Klasse, dokumentiert in :ref:`Klassenreferenz <toc-class-ref>`. Diese Referenz ist für jeden der die Engine lernt unerlässlich: Sie ist sowohl online als auch in der Engine verfügbar.
fr: Godot est livré avec de nombreux nœuds et singletons pour vous aider à développer vos jeux. Chacun est une classe, documentée dans le fichier :ref:`class reference <toc-class-ref>`. Cette référence est essentielle pour toute personne apprenant le moteur : elle est disponible en ligne et dans le moteur.
ja: Godotには、ゲームの開発に役立つ多くのノードとシングルトンが付属しています。各クラスは、\ :ref:`クラスリファレンス <toc-class-ref>` に記載されています。このリファレンスは、エンジンを学習している人にとって不可欠です。オンラインとエンジンの両方で利用できます。
zh_cn: Godot提供了许多节点和单例来帮助您开发游戏.每个节点都是一个类,记录在 :ref:`类参考手册 <toc-class-ref>` 中.这个参考手册对于任何学习该引擎的人来说都是必不可少的:它既可以在线也可以在引擎中使用.
zh_tw: Godot 提供了許多節點與單例來讓協助你開發遊戲。每個類別都在 :ref:`類別參照文件 <toc-class-ref>` 中提供說明文件。這份說明文件對於任何學習引擎的人來說都是不可或缺的：該文件可在線上以及引擎內取得。

source: But it's incomplete. Some methods, variables and signals lack descriptions. Others changed with recent releases and need updates. The developers can't write the entire reference on their own. Godot needs you, and all of us, to contribute.
de: Aber sie ist nicht vollständig. Einigen Methoden, Variablen und Signale fehlen die Beschreibungen. Andere haben sich mit den aktuellen Veröffentlichungen verändert und brauchen Anpassungen. Die Entwickler können nicht die gesamte Referenzdokumentation alleine schreiben. Godot braucht Sie und alle anderen um dabei zu helfen.
fr: Mais il est incomplet. Certaines méthodes, variables et signaux n'ont pas de description. D'autres ont changé avec les dernières versions et nécessitent des mises à jour. Les développeurs ne peuvent pas écrire toute la référence par eux-mêmes. Godot a besoin de votre contribution, et de celle de nous tous.
ja: しかし、それは不完全です。メソッド、変数、シグナルの中には、説明がないものもあります。最近のリリースで変更され、更新が必要なものもあります。開発者だけでリファレンス全体を作成することはできません。Godotには、あなたと私たちのすべての貢献が必要です。
zh_cn: 但参考手册尚未完善.有些方法、变量和信号缺乏描述.其他则随着最新版本进行了更改,需要更新.开发人员不能自己编写整个参考手册.Godot需要您和我们所有人为此做出贡献.
zh_tw: 但該參照文件並不完整。還缺少某些方法、變數與訊號的說明。而最近某些新版本的改動亦需要更新。開發人員無法自行撰寫整份參照文件。因此 Godot 需要你、以及我們全部的人來參與貢獻。

source: **Important:** If you are planning to make larger changes or a more substantial contribution, it is usually a good idea to create an issue (or a comment in an existing one) to let others know so they don't start working on the same thing too.
de: **Wichtig:** Wenn Sie größere Änderungen oder einen größeren Beitrag planen, ist es normalerweise eine gute Idee, den Sachverhalt in einem kurzen Kommentar mitzuteilen, damit andere informiert sind und nicht anfangen an der gleichen Sache zu arbeiten.
fr: **Important :** Si vous prévoyez d'apporter des changements plus importants ou une contribution plus substantielle, il est généralement judicieux de créer une issue (ou un commentaire dans une issue existante) pour en informer les autres afin qu'ils ne commencent pas à travailler sur la même chose.
ja: **重要:**\ 大規模な変更や大きな貢献を計画している場合は、問題(または既存の1のコメント)を作成して他の人に知らせ、同じ作業を開始しないようにすることをお勧めします。
zh_cn: **重要:** 如果您打算进行较大的更改或做出更大的贡献,通常最好创建一个问题(或在现有问题中发表评论),让其他人知道,以便他们不会也开始从事同一件事.
zh_tw: **重要：** 如果你有計劃要對程式碼做出較大的更改、或做出更多貢獻時，最好能建個 Issue (或在現有 Issue 上留言) 來讓其他人知道，避免有其他人也進行了同樣的工作。

source: Not sure where to start contributing? Take a look at the current class reference completion status `here <https://godotengine.github.io/doc-status/>`__.
de: Sie sind sich nicht sicher, wo Sie anfangen sollen, Beiträge zu leisten? Sehen Sie sich den aktuellen Abschlussstatus der Klassenreferenz `hier <https://godotengine.github.io/doc-status/>`__ an.
fr: Vous ne savez pas par où commencer pour contribuer ? Jetez un coup d'œil à l'état d'achèvement actuel des références de classe `ici <https://godotengine.github.io/doc-status/>`__.
zh_cn: 不知道从哪里开始作出贡献? 来看看目前的类基准的完成状态 `在这里,<https://godotengine.github.io/doc-status/>`__ .
zh_tw: 不確定要從哪裡開始參與貢獻嗎？請看看 `這裡 <https://godotengine.github.io/doc-status/>`__ 瞭解目前類別參照文件的完成度。

source: How to contribute
de: Wie man dazu beiträgt
fr: Comment contribuer
ja: 貢献する方法
zh_cn: 如何贡献
zh_tw: 如何參與貢獻

source: The class reference lies in the following XML files, in Godot's GitHub repository: `doc/classes/ <https://github.com/godotengine/godot/tree/master/doc/classes>`_.
de: Die Klassenreferenz befindet sich in den folgenden XML-Dateien im GitHub-Repository von Godot: `doc/classes/ <https://github.com/godotengine/godot/tree/master/doc/classes>`_.
fr: La référence de classe se trouve dans les fichiers XML suivants, dans le dépôt GitHub de Godot : `doc/classes/ <https://github.com/godotengine/godot/tree/master/doc/classes>`_.
ja: クラスリファレンスは、GodotのGitHubリポジトリにある次のXMLファイルにあります: `ドキュメント/クラス/ <https://github.com/godotengine/godot/tree/master/doc/classes>`_\ 。
zh_cn: 类参考手册位于Godot的GitHub存储库中 `doc/classes/ <https://github.com/godotengine/godot/tree/master/doc/classes>`_ 路径下的XML文件中.
zh_tw: 類別參考文件以 XML 格式在 Godot 的 GitHub 儲存庫中下列位置提供：`doc/classes/ <https://github.com/godotengine/godot/tree/master/doc/classes>`_ 。

source: There are 5 steps to update the class reference (full guide below):
de: Es gibt 5 Schritte zum Aktualisieren der Klassenreferenz (vollständige Anleitung unten):
fr: Il y a 5 étapes pour mettre à jour la référence de classe (guide complet ci-dessous) :
ja: クラスリファレンスを更新するには、次の5つの手順があります(以下の完全なガイド):
zh_cn: 有5个步骤来更新类参考手册(接下来会谈到完整指南):
zh_tw: 要更新類別參照文件有 5 個步驟 (完整指南在後方)：

source: Fork `Godot's repository <https://github.com/godotengine/godot>`_
fr: Fork `Dépôt de Godot <https://github.com/godotengine/godot>`_
ja: フォーク `Godotのリポジトリ <https://github.com/godotengine/godot>`_
zh_cn: 分叉 `Godot存储库 <https://github.com/godotengine/godot>`_
zh_tw: Fork `Godot 的儲存庫 <https://github.com/godotengine/godot>`_

source: Clone your fork on your computer
de: Klonen Sie Ihren Fork auf Ihrem Computer
fr: Clonez votre fork sur votre ordinateur
ja: コンピュータでフォークのクローンを作成する
zh_cn: 在电脑上克隆您的分叉
zh_tw: Clone 你的 Fork 到電腦上

source: Edit the class file in ``doc/classes/`` to write documentation
de: Bearbeiten Sie die Klassendatei in ``doc/classes/``, um Dokumentation zu schreiben
fr: Modifier le fichier de classe dans ``doc/classes/`` pour rédiger la documentation
ja: ``doc/classes/`` でクラス ファイルを編集してドキュメントを作成する
zh_cn: 在 ``doc/classes/`` 中编辑类文件以写入文档
zh_tw: 編輯 ``doc/classes/`` 中的類別檔案，並撰寫完整說明文件

source: Commit your changes and push them to your fork
de: Übernehmen Sie Ihre Änderungen und schieben Sie sie an Ihre Fork
fr: Commitez vos changements et pushez les dans votre fork
ja: 変更をコミットし、フォークにプッシュする
zh_cn: 提交您的更改并把它们推到您的分叉上
zh_tw: 將更改 Commit，並 Push 回你的 Fork 上

source: Make a pull request on the Godot repository
de: Stellen Sie eine Pull-Anfrage im Godot-Repository
fr: Faire une pull request sur le dépôt Godot
ja: Godotリポジトリでプルリクエストを行う
zh_cn: 在Godot存储库上拉取请求
zh_tw: 在 Godot 儲存庫上開啟 PR (Pull Request)

source: Always use these XML files to edit the API reference. Do not edit the generated .rst files :ref:`in the online documentation <toc-class-ref>`, hosted in the `godot-docs <https://github.com/godotengine/godot-docs>`_ repository.
de: Verwenden Sie immer diese XML-Dateien, um die API-Referenz zu bearbeiten. Bearbeiten Sie nicht die generierten .rst-Dateien :ref:`in der Online-Dokumentation <toc-class-ref>`, die im Repository `godot-docs <https://github.com/godotengine/godot-docs>`_ gehostet wird.
fr: Utilisez toujours ces fichiers XML pour modifier la référence de l'API. Ne modifiez pas les fichiers .rst générés :ref:`dans la documentation en ligne <toc-class-ref>`, hébergés dans le dépôt `godot-docs <https://github.com/godotengine/godot-docs>`_.
ja: APIリファレンスを編集するには、常にこれらのXMLファイルを使用してください。\ `godot-docs <https://github.com/godotengine/godot-docs>`_\ リポジトリでホストされている\ :ref:`オンラインドキュメントで <toc-class-ref>`\ 生成された.rstファイルを編集しないでください。
zh_cn: 总是使用这些XML文件来编辑API参考手册.不要编辑托管在 `godot-docs <https://github.com/godotengine/godot-docs>`_ 存储库中,在 :ref:`在线文档 <toc-class-ref>` 中生成的.rst文件.
zh_tw: 在編輯 API 參照文件時務必使用這些 XML 檔。請勿在 `godot-docs <https://github.com/godotengine/godot-docs>`_ 儲存庫的 :ref:`線上說明文件中 <toc-class-ref>` 編輯產生的 .rst 檔。

source: Get started with GitHub
de: Beginnen Sie mit GitHub
es: Comenzar con GitHub
fr: Débuter avec Github
ja: GitHubを使い始める
zh_cn: 开始使用GitHub
zh_tw: 開始使用 GitHub

source: If you're new to Git and GitHub, this guide will help you get started. You'll learn to:
de: Wenn Sie Git und GitHub noch nicht kennen, hilft Ihnen dieses Handbuch beim Einstieg. Sie werden lernen:
es: Si eres nuevo en Git y GitHub, esta guía te ayudará a empezar. Aprenderás a:
fr: Si vous débutez avec Git et GitHub, ce guide vous aidera à démarrer. Vous apprendrez à :
zh_cn: 如果你是Git和GitHub的新手,本指南将帮助你入门.你将学会:
zh_tw: 若你剛開始使用 Git 與 GitHub，本指南將協助你上手。你會學到：

source: Fork and clone Godot's repository
de: Forken und klonen des Godot Repository
es: Crea un Fork del repositorio de Godot y clonalo
fr: Fork et clone du dépôt de Godot
ja: フォークとクローンGodotのリポジトリ
zh_cn: 分叉和克隆Godot仓库
zh_tw: Fork 並 Clone Godot 的儲存庫

source: Keep your fork up to date with other contributors
de: Halten Sie Ihren Fork mit anderen Beitragenden auf dem Laufenden
es: Mantén tu fork actualizado con otros colaboradores
fr: Tenez votre fork à jour avec les autres contributeurs
ja: 他の貢献者とあなたのフォークを最新の状態に保つ
zh_cn: 保持分叉与其他贡献者同步
zh_tw: 將你的 Fork 與其他貢獻者保持更新

source: Create a pull request so your improvements end in the official docs
de: Erstellen Sie einen Pull Request, damit Ihre Verbesserungen in den offiziellen Dokumenten erscheinen
es: Crea un Pull Request para que tus mejoras sean incluidas en los docs oficiales
fr: Créez une pull request pour que vos améliorations se retrouvent dans la documentations officielles
ja: プルリクエストを作成して、公式ドキュメントで改善が終了できるようにします
zh_cn: 创建拉取请求,以便您的改进最终在官方文档中
zh_tw: 建立 PR (Pull Request) 來讓你改進的內容能顯現在官方說明文件中

source: If you're new to Git, the version control system Godot uses, go through `GitHub's interactive guide <https://try.github.io/levels/1/challenges/1>`_. You'll learn some essential vocabulary and get a sense for the tool.
de: Wenn Sie neu bei Git sind, dem Versionskontrollsystem, das Godot benutzt, gehen Sie `GitHubs interaktive Anleitung <https://try.github.io/levels/1/challenges/1>`_ durch. Sie werden einige wichtige Vokabeln lernen und ein Gefühl für das Werkzeug bekommen.
fr: Si vous êtes nouveau sur Git, le système de contrôle de version que Godot utilise, consultez le guide interactif `GitHub's interactive guide <https://try.github.io/levels/1/challenges/1>`_. Vous y apprendrez le vocabulaire essentiel et vous vous familiariserez avec l'outil.
zh_cn: 如果你是Godot使用的版本控制系统Git的新手,请阅读 `GitHub's interactive guide <https://try.github.io/levels/1/challenges/1>` _.你会学到一些基本的词汇,并对这个工具有所了解.
zh_tw: 如果你是第一次使用 Git，也就是 Godot 使用的版本控制系統，請先參考 `GitHub' 的互動式指南 (英語) <https://try.github.io/levels/1/challenges/1>`_ 。在該指南中可以學會一些必要的單詞，並對該工具有個概念。

source: Fork the Godot Engine into a GitHub repository of your own.
de: Forke die Godot-Engine in ein eigenes GitHub-Repository.
es: Crea un Fork propio de Godot Engine en un nuevo repositorio de Github.
fr: Fork le moteur Godot dans votre propre dépôt GitHub.
ja: Godotエンジンを独自のGitHubリポジトリにフォークします。
zh_cn: 分叉Godot引擎到您自己的GitHub存储库.
zh_tw: 將 Godot Engine Fork 到你自己的 GitHub 儲存庫中。

source: Clone the repository on your computer:
de: Klonen Sie das Repository auf Ihren Computer:
es: Clonar el repositorio en tu computadora:
fr: Clonez le dépôt sur votre ordinateur :
ja: コンピュータ上にリポジトリのクローンを作成します:
zh_cn: 在计算机上克隆存储库:
zh_tw: 將儲存庫 Clone 到電腦上：

source: Create a new branch to make your changes. It makes it a lot easier to sync your improvements with other docs writers. It's also easier to clean up your repository if you run into any issues with Git.
de: Erstellen Sie einen neuen Zweig um Ihre Änderungen vorzunehmen. Das macht es sehr viel einfacher, Ihre Verbesserungen mit anderen Autoren des Dokuments zu synchronisieren. Es ist auch einfacher, Ihr Repository aufzuräumen, wenn Sie auf irgendwelche Probleme mit Git stoßen.
fr: Créez une nouvelle branche pour effectuer vos changements. Cela facilite grandement la synchronisation de vos améliorations avec les autres auteurs de documentation. Il est également plus facile de nettoyer votre dépôt si vous rencontrez des problèmes avec Git.
zh_cn: 创建一个新的分支来进行你的修改.这使得你的改进与其他文档编写者的同步变得更加容易.如果你遇到任何关于Git的问题,也更容易清理你的仓库.
zh_tw: 建立新的分支來處理改動。使用分支可以更輕鬆地將這些改進與其他說明文件作者同步。同時，使用分支也可以在遇到 Git 問題的時候更輕鬆地清理儲存庫。

source: The new branch is the same as your master branch, until you start to write API docs. In the ``doc/`` folder, you'll find the class reference.
de: Der neue Zweig ist derselbe wie Ihr Hauptzweig, bis Sie beginnen API-Dokumente zu schreiben. Im Ordner ``doc/``` finden Sie die Klassenreferenz.
es: La nueva Branch es la misma que su Branch master hasta que empiece a escribir API docs. En el directorio ``doc/``, encontrará la referencia de la clase.
fr: La nouvelle branche est la même que votre branche principale, jusqu'à ce que vous commenciez à écrire de la documentation API. Dans le dossier ``doc/``, vous trouverez la référence de la classe.
ja: 新しいブランチは、APIドキュメントの作成を開始するまで、masterブランチと同じです。 ``doc/`` フォルダには、クラス参照が表示されます。
zh_cn: 在您开始编写API文档之前,新分支与主分支相同.在 ``doc /`` 文件夹中,您将找到类参考手册.
zh_tw: 新建立的分支在開始撰寫 API 文件前都與 master 分支相同。在 ``doc/`` 資料夾中可以找到類別參照文件。

source: How to keep your local clone up-to-date
de: Wie Sie Ihren lokalen Klon auf dem Laufenden halten können
es: Cómo mantener su copia local actualizada
fr: Comment tenir à jour votre clone local
ja: ローカルのクローンを最新の状態に保つ方法
zh_cn: 如何使本地克隆保持最新状态
zh_tw: 如何將本機 Clone 保持更新

source: Other writers contribute to Godot's documentation. Your local repository will fall behind it, and you'll have to synchronize it. Especially if other contributors update the class reference while you work on it.
de: Andere Autoren tragen zu Godots Dokumentation bei. Ihr lokales Repository fällt dahinter zurück, und Sie müssen es synchronisieren. Besonders wenn andere Mitwirkende die Klassenreferenz aktualisieren, während Sie daran arbeiten.
es: Otros escritores contribuyen a la documentación de Godot. Tu repositorio local quedará atras de ellos, y tendrás que sincronizarlo. Específicamente si otro colaborador modifica la referencia de la clase mientras trabajas en la misma.
fr: D'autres écrivains contribuent à la documentation de Godot. Votre dépôt local sera à la traîne et vous devrez le synchroniser. Surtout si d'autres contributeurs mettent à jour la référence de classe pendant que vous travaillez dessus.
ja: 他の人々もGodotのドキュメントに貢献しています。ローカルリポジトリではその貢献が反映されない為、能動的に同期する必要があります。特に、作業中に他の貢献者がクラス参照を更新した場合には注意してください。
zh_cn: 其他编写者为Godot的文档做出了贡献.您的本地存储库将落后于它,您将不得不同步它.特别是如果其他贡献者在您处理它时更新类参考手册.
zh_tw: 其他編寫者也會參與貢獻 Godot 的說明文件。Clone 到本機上的儲存庫會逐漸落後線上版本，並需要進行同步。尤其是當其他貢獻者在你編輯的這段期間內更新了類別參照文件時。

source: First add an ``upstream`` git *remote* to work with. Remotes are links to online repositories you can download new files from.
de: Fügen Sie zuerst ein ``upstream`` git *remote* hinzu, mit dem Sie arbeiten können. Remotes sind Links zu Online-Repositorien, von denen Sie neue Dateien herunterladen können.
es: Primero crea un ``upstream`` *remote* con git para trabajar en el. Remotes son links para repositorios online desde los cuales puedes descargar los nuevos archivos.
fr: Ajoutez d'abord un git *remote* ``upstream`` avec lequel travailler. Les remotes(distants) sont des liens vers des dépôts en ligne où vous pouvez télécharger de nouveaux fichiers.
ja: まず、 ``upstream`` のgit\ *リモート*\ を追加します。「Remotes」 は、新しいファイルをダウンロードできるオンライン・リポジトリへのリンクです。
zh_cn: 首先添加一个 ``upstream`` git *remote* 来使用.远程数据库是您可以从在线存储库中下载新文件的链接.
zh_tw: 首先，先新增 ``upstream`` git **remote** 。「Remote」就像是指向線上儲存庫的連結，可以用來下載新檔案。

source: You can check the list of all remote servers with:
de: Sie können die Liste aller Remote-Server überprüfen mit:
es: Puedes verificar la lista de todos los servidores remotos con:
fr: Vous pouvez consulter la liste de tous les serveurs distants avec :
ja: すべてのリモート サーバーの一覧を次のように確認できます:
zh_cn: 您可以使用以下命令检查所有远程服务器的列表:
zh_tw: 可以通過下列指令來檢視所有 Remote 的列表：

source: You should have two: ``origin``, your fork on GitHub that Git adds by default, and ``upstream``, that you just added:
de: Sie sollten zwei haben: ``origin``, Ihr Fork auf GitHub, die Git standardmäßig hinzufügt, und ```upstream``, die Sie gerade hinzugefügt haben:
es: Deberias tener dos : ``origin``, su fork en GitHub, que Git crea por defecto, y ``upstream``, que acabas de añadir:
fr: Vous devriez en avoir deux : ``origin``, votre fork sur GitHub, que Git ajoute par défaut, et ``upstream``, que vous venez d'ajouter :
zh_cn: 你应该有两个: ``origin`` ,Git默认添加的你在GitHub上的fork和你刚刚添加的 ``upstream`` :
zh_tw: 該指令應該會顯示兩個 Remote：``origin`` 為 GitHub 上的 Fork，由 Git 預設自動新增。另一個 ``upstream`` 則是我們剛才新增的：

source: Each time you want to sync your branch to the state of the upstream repository, enter:
de: Geben Sie jedes Mal, wenn Sie Ihren Branch mit dem Zustand des upstream Repository synchronisieren möchten, ein:
es: Cada vez que quieras sincronizar tu rama con el estado del repositorio upstream, introduce:
fr: Chaque fois que vous voulez synchroniser votre branche avec l'état du dépôt en amont(upstream), entrez :
ja: ブランチをアップストリームリポジトリの状態に同期するたびに、次のように入力します:
zh_cn: 每次要将分支同步到上游存储库的状态时,请输入:
zh_tw: 每次要將分支的狀態與 Upstream 儲存庫同步時，請輸入：

source: This command will first ``fetch``, or download the latest version of the Godot repository. Then, it will reapply your local changes on top.
de: Dieser Befehl ``holt`` zunächst die neueste Version des Godot-Repositorys herunter. Dann wendet er Ihre lokalen Änderungen wieder darauf an.
es: Este comando ira primeramente ``obtener``, o descargará la última versión del repositorio de Godot. Luego, volverá a aplicar tus cambios locales por encima.
fr: Cette commande va d'abord ``fetch``, ou télécharger la dernière version du dépôt Godot. Ensuite, elle appliquera à nouveau vos modifications locales par dessus.
ja: このコマンドは、最初に ``fetch`` を行うか、Godotリポジトリの最新バージョンをダウンロードします。次に、ローカルの変更が再度適用されます。
zh_cn: 此命令将首先 ``获取(fetch)``,或下载最新版本的Godot存储库.然后,它将重新应用您的本地更改.
zh_tw: 該指令會先進行 ``fetch`` ，也就是下載最新版的 Godot 儲存庫。然後，Git 會將目前本機上的修改重新套用至儲存庫的最上方。

source: If you made changes you don't want to keep in your local branch, use the following commands instead:
de: Wenn Sie Änderungen vorgenommen haben, die Sie nicht in Ihrem lokalen Zweig beibehalten wollen, verwenden Sie stattdessen die folgenden Befehle:
es: Si has hecho cambios que no quieres mantener en tu rama local, usa en su lugar los siguientes comandos:
fr: Si vous avez fait des changements que vous ne voulez pas garder dans votre branche locale, utilisez plutôt les commandes suivantes :
ja: ローカルブランチに残したくない変更を加えた場合は、代わりに次のコマンドを使用します:
zh_cn: 如果您进行了更改,且不希望保留在本地分支中,则请使用以下命令:
zh_tw: 如果有作出修改但不想保留本機上的分支，則改用下列指令：

source: **Warning:** The above command will reset your branch to the state of the ``upstream master`` branch. It will discard all local changes. Make sure to only run this *before* you make important changes.
de: **Warnung:** Der obige Befehl setzt Ihren Zweig auf den Stand des ``upstream master``-Zweigs zurück. Er verwirft alle lokalen Änderungen. Stellen Sie sicher, dass Sie diesen Befehl nur ausführen, *bevor* Sie wichtige Änderungen vornehmen.
es: **Atención** El comando de arriba restablecerá su Branch al estado del Branch``upstream master``. Descartará todos los cambios locales, asegúrese de ejecutar este solamente *antes* de realizar cambios importantes.
fr: **Avertissement :** La commande ci-dessus va remettre votre branche dans l'état de la branche ``upstream master``. Elle supprimera tous les changements locaux. Assurez-vous de n'exécuter cette commande qu'*avant* d'effectuer des changements importants.
ja: **警告:**\ 上記のコマンドは、ブランチを ``upstream master`` ブランチの状態にリセットします。 ローカルの変更はすべて破棄されます。 重要な変更を行う\ *前*\ にのみ、これを実行するようにしてください。
zh_cn: **警告:** 上述命令会将分支重置为 ``upstream master`` 分支的状态.它将丢弃所有本地更改.确保仅在进行重要更改 *之前* 运行此命令 .
zh_tw: **警告：** 上述指令會將目前分支的狀態重設為 ``upstream master`` 分支。使用該指令會取消所有本機上的更改。請只在 **進行重要更改前** 才執行該指令。

source: Another option is to delete the branch you're working on, synchronize the master branch with the Godot repository, and create a new branch:
de: Eine andere Möglichkeit ist, den Zweig, an dem Sie gerade arbeiten, zu löschen, den Master-Zweig mit dem Godot-Repository zu synchronisieren und einen neuen Zweig zu erstellen:
es: Otra opción es eliminar el Branch en el cual estas trabajando, sincronizar el Branch master con el repositorio de Godot, y crear otro Branch:
fr: Une autre option consiste à supprimer la branche sur laquelle vous travaillez, à synchroniser la branche maître(master) avec le dépôt Godot et à créer une nouvelle branche :
zh_cn: 另一个办法是删除你正在工作的分支,将主分支与Godot仓库同步,然后创建一个新的分支:
zh_tw: 另一種方法是刪除目前正在處理的分支，並將 master 分支與 Godot 儲存庫同步，然後再建立新分支：

source: If you're feeling lost by now, come to our `IRC channels <https://webchat.freenode.net/?channels=#godotengine>`_ and ask for help. Experienced Git users will give you a hand.
de: Wenn Sie sich mittlerweile verloren fühlen, kommen Sie in unsere `IRC-Kanäle <https://webchat.freenode.net/?channels=#godotengine>`_ und bitten Sie um Hilfe. Erfahrene Git-Benutzer werden Ihnen zur Hand gehen.
es: Si te sientes perdido, unete a nuestros `Canales IRC <http://webchat.freenode.net/?channels=#godotengine>` _ y pide ayuda. Usuarios experimentados en Git te darán una mano.
fr: Si vous vous sentez perdu, venez sur nos `canaux IRC <https://webchat.freenode.net/?channels=#godotengine>`_ et demandez de l'aide. Des utilisateurs expérimentés de Git vous donneront un coup de main.
zh_cn: 如果你现在感到迷茫,请到我们的 `IRC channels <https://webchat.freenode.net/?channels=#godotengine>` _ 来寻求帮助.有经验的Git用户会给你提供帮助的.
zh_tw: 如果不知道該怎麼做的話，請到我們的 `IRC 頻道 <https://webchat.freenode.net/?channels=#godotengine>`_ 上尋求幫助。有經驗的 Git 使用者會協助你。

source: Updating the documentation template
de: Aktualisieren der Dokumentationsvorlage
es: Actualizando plantilla de documentación
fr: Mise à jour du modèle de documentation
ja: ドキュメントテンプレートの更新
zh_cn: 更新文档模板
zh_tw: 更新說明文件樣板
