Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/community/contributing/updating_the_class_reference.po
Languages: de, es, fr, ja, zh_cn, zh_tw

source: When classes are modified in the source code, the documentation template might become outdated. To make sure that you are editing an up-to-date version, you first need to compile Godot (you can follow the :ref:`doc_introduction_to_the_buildsystem` page), and then run the following command (assuming 64-bit Linux):
de: Wenn Klassen im Quellcode geändert werden, kann die Dokumentationsvorlage veraltet sein. Um sicherzustellen, dass Sie eine aktuelle Version bearbeiten, müssen Sie zunächst Godot kompilieren (Sie können der Seite :ref:`doc_introduction_to_the_buildsystem` folgen), und dann den folgenden Befehl ausführen (unter der Annahme eines 64-Bit-Linux):
es: Cuando las clases son modificadas en el código fuente, el template de la documentación puede tornarse obsoleto. Para asegurarse de que esté editando una versión actualizada, debes compilar Godot (siguiendo la ref:`doc_introduction_to_the_buildsystem` referencia), y luego ejecutar el siguiente comando (asumiendo que estés utilizando Linux 64-bit):
fr: Lorsque des classes sont modifiées dans le code source, le modèle de documentation peut devenir obsolète. Pour vous assurer que vous éditez une version à jour, vous devez d'abord compiler Godot (vous pouvez suivre la page :ref:`doc_introduction_to_the_buildsystem`), puis exécuter la commande suivante (Linux 64 bits) :
ja: ソースコードでクラスが変更されると、ドキュメントテンプレートが古くなる可能性があります。最新バージョンを編集していることを確認するには、まずGodotをコンパイルする必要があります (\ :ref:`doc_introduction_to_the_buildsystem`\ ページに従ってから)。次のコマンドを実行します (64ビットLinuxを想定):
zh_cn: 在源代码中修改类时,文档模板可能会过时.为了确保您正在编辑最新版本,首先需要编译Godot(您可以按照 :ref:`doc_introduction_to_the_buildsystem` 页面),然后运行以下命令(假设64位Linux):
zh_tw: 當原始碼裡的類別被修改後，說明文件樣板就有可能過時。為了確保正在的是最新版本，請先編譯 Godot (可參考 :ref:`doc_introduction_to_the_buildsystem` 一頁)，然後執行下列指令 (假設為 64 位元 Linux)：

source: The XML files in doc/classes should then be up-to-date with current Godot Engine features. You can then check what changed using the ``git diff`` command. If there are changes to other classes than the one you are planning to document, please commit those changes first before starting to edit the template:
de: Die XML-Dateien in doc/classes sollten dann mit den aktuellen Funktionen der Godot Engine auf dem neuesten Stand sein. Sie können dann mit dem Befehl ``git diff`` überprüfen, was sich geändert hat. Wenn es Änderungen an anderen Klassen als der, die Sie dokumentieren möchten, gibt, übertragen Sie bitte zuerst diese Änderungen, bevor Sie mit der Bearbeitung der Vorlage beginnen:
es: Los archivos XML en doc/clases deberian estar actualizados con las características actuales de Godot Engine. Puedes verificar que fue modificado utilizando el comando ``git diff``. Si existen modificaciones en otras clases además de la que planeas documentar, por favor realiza un commit de estas modificaciones antes de empezar a editar el template:
fr: Les fichiers XML dans doc/classes devraient alors être à jour avec les fonctionnalités actuelles du moteur Godot. Vous pouvez alors vérifier ce qui a changé en utilisant la commande ``git diff``. S'il y a des changements dans d'autres classes que celle que vous envisagez de documenter, veuillez d'abord valider ces changements avant de commencer à modifier le modèle :
zh_cn: 这样,doc/classes中的XML文件应该是最新的,符合当前Godot引擎的特性.然后你可以用 ``git diff`` 命令检查哪些地方有变化.如果除了你打算记录的类之外,其他类也有变化,请在开始编辑模板之前先提交这些变化:
zh_tw: 接著，doc/classes 內的 XML 應該會更新為目前 Godot Engine 功能的版本。可以使用 ``git diff`` 指令進行確認。如果改動包含了你目前計劃要編輯的說明文件以外的類別，則請先將這些改動 Commit，然後再開始編輯樣板：

source: You are now ready to edit this file to add stuff.
de: Sie können diese Datei jetzt bearbeiten, um Inhalte hinzuzufügen.
es: Ahora estás listo para editar este archivo y añadir cosas.
fr: Vous êtes maintenant prêt à éditer ce fichier pour ajouter des choses.
ja: これで、このファイルを編集して追加する準備が整いました。
zh_cn: 您现在可以编辑此文件以添加内容.
zh_tw: 現在可以開始編輯這個檔案並新內容。

source: **Note:** If this has been done recently by another contributor, you don't forcefully need to go through these steps (unless you know that the class you plan to edit *has* been modified recently).
de: **Hinweis:** Wenn dies bereits kürzlich von einem anderen Beitragenden gemacht wurde, müssen Sie nicht zwingend alle diese Schritte durchgehen (außer Sie wissen, dass die zu editierende Klasse bereits kürzlich erst bearbeitet wurde).
es: **Nota:** Si esto fue realizado recientemente por otro colaborador, no necesitas seguir todos estos pasos (A menos que sepas que la clase que planeas editar *haya* sido modificada recientemente).
fr: **Note:** Si cela a été fait récemment par un autre contributeur, vous n'avez pas besoin de passer par ces étapes (sauf si vous savez que la classe que vous prévoyez d'éditer *a* été modifiée récemment).
ja: **注意:**\ 最近、別の貢献者がこれを行った場合は、これらの手順を強制的に実行する必要はありません(編集しようとしているクラスが最近\ *変更されたこと*\ がわかっている場合を除きます)。
zh_cn: **注意:** 如果最近已由其他撰稿人完成,则您不必强行执行这些步骤(除非您知道您计划编辑的类最近 *已* 被修改过).
zh_tw: **請注意：** 若最近已經有其他貢獻者更新過，則並不需一定要執行這些步驟 (除非確定要編輯的類別最近 **有被修改過**)。

source: Push and request a pull of your changes
de: Pushe und erstelle eine Pull Request
es: Solicitar push o pull de sus cambios
fr: Push et faire une pull request pour vos changements
ja: 変更のプルをプッシュしてリクエストする
zh_cn: 推送并请求拉取您的更改
zh_tw: Push 做出的改動並開啟 PR

source: Once your modifications are finished, push your changes on your GitHub repository:
de: Sobald deine Änderungen abgeschlossen sind, pushe die Änderungen auf dein GitHub-Repository:
es: Una vez que se hayan terminado las modificaciones, haz un push de los cambios en el repositorio de GitHub:
fr: Une fois vos modifications terminées, poussez vos modifications sur votre dépôt GitHub :
ja: 変更が完了したら、GitHubリポジトリで変更をプッシュします:
zh_cn: 完成修改后,在GitHub存储库上推送您的更改:
zh_tw: 完成修改後，請將改動 Push 到 GitHub 儲存庫中：

source: When it's done, you can ask for a Pull Request via the GitHub UI of your Godot fork.
de: Wenn das erledigt ist, können Sie über die GitHub-Benutzeroberfläche Ihres Godot-Forks eine Pull-Request stellen.
es: Cuando este listo, puedes hacer un Pull Request a través de la UI de GitHub de tu fork de Godot.
fr: Une fois que c'est fait, vous pouvez demander une Pull Request via l'interface utilisateur GitHub de votre fork Godot.
ja: 完了したら、GodotフォークのGitHubUIを介してプルリクエストを要求できます。
zh_cn: 完成后,您可以通过Godot分叉的GitHub UI请求拉取请求.
zh_tw: 完成後，便可通過 Godot Fork 上的 GitHub UI 來開啟 PR (Pull Request)。

source: Although you can edit files on GitHub, it's not recommended. As hundreds of contributors work on Godot, the Git history must stay clean. Each commit should bundle all related improvements you make to the class reference, a new feature, bug fixes... When you edit from GitHub, it will create a new branch and a Pull Request every time you want to save it. If a few days pass before your changes get a review, you won't be able to update to the latest version of the repository cleanly. Also, it's harder to keep clean indents from GitHub. And they're very important in the docs.
de: Obwohl Sie Dateien auf GitHub bearbeiten können, wird dies nicht empfohlen. Da Hunderte von Mitwirkenden an Godot arbeiten, muss die Git-Geschichte sauber bleiben. Jedes Commit sollte alle damit verbundenen Verbesserungen bündeln, die Sie an der Klassenreferenz vornehmen, eine neue Funktion, Fehlerbehebungen ... Wenn Sie von GitHub aus arbeiten, wird jedes Mal beim speichern ein neuer Zweig und eine Pull-Anforderung erstellt. Wenn ein paar Tagen vergehen, bevor Ihre Änderungen überprüft wurden, können Sie nicht sauber auf die neueste Version des Repositorys aktualisieren. Außerdem ist es schwieriger, saubere Einrückungen von GitHub fernzuhalten. Und sie sind sehr wichtig in den Dokumenten.
es: Si bien puedes alterar los archivos en GitHub, no lo recomendamos. Dado que cientos de colaboradores trabajan en Godot, el histórial de Git debe permanecer limpio. Cada commit debe incluir todo lo relacionado a las mejoras que hayas realizado a la referencia de clases, nueva característica, bug fix, etc. Cuando editas desde GitHub, este creará un nuevo branch y un Pull Request cada vez que quieras guardarlos. Si pasan algunos pocos días antes de que tus modificaciones sean revisadas, no serás capaz de actualizar a la última versión del repositorio limpiamente. También, es más difícil mantener las indentaciones de Github limpias. Y estas son muy importantes para la documentación.
fr: Bien que vous puissiez modifier des fichiers sur GitHub, ce n'est pas recommandé. Comme des centaines de contributeurs travaillent sur Godot, l'historique de Git doit rester propre. Chaque commit doit regrouper toutes les améliorations liées que vous apportez à la référence de classe, une nouvelle fonctionnalité, des corrections de bugs ... Lorsque vous éditez à partir de GitHub, il créera une nouvelle branche et une Pull Request à chaque fois que vous voudrez l'enregistrer. Si quelques jours s'écoulent avant que vos modifications ne soient examinées, vous ne pourrez pas effectuer proprement la mise à jour vers la dernière version du dépôt. En outre, il est plus difficile de conserver les idents de GitHub propres. Et ils sont très importants dans la documentation.
zh_cn: 虽然你可以在GitHub上编辑文件,但不建议这样做.由于数以百计的贡献者在Godot上工作,Git历史必须保持干净.每次提交都应该捆绑所有你对类参考的相关改进,一个新的功能,错误修复......当你从GitHub编辑时,每次你想保存时,它都会创建一个新的分支和一个Pull Request.如果过了几天你的修改才得到审查,你就不能干净利落地更新到最新版本的仓库.另外,要从GitHub上保持干净的缩进也比较困难.而它们对于文档是非常重要的.
zh_tw: 雖然也可以在 GitHub 上編輯檔案，但並不建議這麼做。由於有上百個貢獻者都參與了 Godot，因此必須確保有乾淨的 Git 歷史記錄。所有對類別參照文件的改進都應包含在同一個 Commit 內，包含新功能、Bug 修正…等。用 GitHub 編輯時，每次保存檔案都會建立新分支並開啟新 PR。如果過了幾天之後該更改才被審閱，則將無法乾淨利落地將分支更新到最新版本。另外，要用 GitHub 來保持整齊的縮排也很困難，而對於說明文件來說縮排很重要。

source: TL;DR: If you don't know what you're doing exactly, do not edit files from GitHub.
de: TL;DR: Wenn Sie nicht genau wissen was Sie tun, bearbeiten Sie keine Dateien aus GitHub.
es: En resumen: Si no sabes exactamente lo que haces, no alteres los archivos de GitHub.
fr: TL;DR : Si vous ne savez pas exactement ce que vous faites, ne modifiez pas les fichiers de GitHub.
ja: TL;DR:自分が何をしているか正確にわからない場合は、GitHubからファイルを編集しないでください。
zh_cn: 总结:如果您不知道自己在做什么,请不要编辑GitHub中的文件.
zh_tw: 用一句話來說：如果你不確定自己在做什麼的話，就不要在 GitHub 上編輯檔案。

source: How to edit class XML
de: Wie man Klassen-XML bearbeitet
es: Cómo editar una clase XML
fr: Comment modifier la classe XML
ja: クラスXMLを編集する方法
zh_cn: 如何编辑类XML
zh_tw: 如果編輯類別 XML

source: Edit the file for your chosen class in ``doc/classes/`` to update the class reference. The folder contains an XML file for each class. The XML lists the constants and methods you'll find in the class reference. Godot generates and updates the XML automatically.
de: Bearbeiten Sie die Datei für Ihre gewählte Klasse in ``doc/classes/``, um die Klassenreferenz zu aktualisieren. Der Ordner enthält eine XML-Datei für jede Klasse. Die XML-Datei listet die Konstanten und Methoden auf, die Sie in der Klassenreferenz finden. Godot generiert und aktualisiert das XML automatisch.
es: Edita el archivo para la clase elegida en ``doc/classes/``para actualizar la referencia de la clase. El directorio tiene un archivo XML para cada clase. Este archivo XML lista todas las constantes y métodos de la referencia de la clase. Godot genera y actualiza los XMLs automáticamente.
fr: Editez le fichier de la classe choisie dans ``doc/classes/`` pour mettre à jour la référence de la classe. Le dossier contient un fichier XML pour chaque classe. Le fichier XML énumère les constantes et les méthodes que vous trouverez dans la référence de classe. Godot génère et met à jour le XML automatiquement.
ja: 選択したクラスのファイルを ``doc/class/`` で編集して、クラスリファレンスを更新します。フォルダには、各クラスのXMLファイルが含まれています。XMLには、クラス参照に含まれる定数とメソッドが一覧表示されます。GodotはXMLを自動的に生成して更新します。
zh_cn: 在 ``doc/classes/`` 中编辑所选类的文件以更新类参考手册.该文件夹包含每个类的XML文件.XML列出了您在类参考手册中找到的常量和方法.Godot自动生成并更新XML.
zh_tw: 請編輯 ``doc/classes/`` 內所選類別的檔案來更新類別參照文件。該資料夾包含了用於各個類別的 XML 檔。這些 XML 中列出了可在類別參照文件中找到的常數與方法。Godot 會自動產生並更新 XML 檔。

source: Edit it using your favorite text editor. If you use a code editor, make sure that it doesn't change the indent style: tabs for the XML, and 4 spaces inside BBCode-style blocks. More on that below.
de: Bearbeiten Sie sie mit Ihrem bevorzugten Texteditor. Wenn Sie einen Code-Editor verwenden, stellen Sie bitte sicher, dass er den Einrückungsstil nicht verändert: Tabs für das XML und 4 Leerzeichen innerhalb von Blöcken im BBCode-Stil. Mehr dazu weiter unten.
es: Edítelo con su editor de texto favorito. Si usa un editor de código, asegúrese de que no cambie el estilo de sangría: pestañas para el XML y 4 espacios dentro de los bloques de estilo BBCode. Más sobre eso a continuación.
zh_cn: 用你喜欢的文本编辑器编辑它.如果你使用代码编辑器,请确保它不会改变缩进样式:XML使用制表符,而BBCode风格的块内使用4个空格.下面有更多这方面的内容.
zh_tw: 使用慣用的編輯器開啟 XML 檔。若使用程式碼編輯器，請確保不要更改到縮排樣式：XML 使用 Tab 資源，BBCode 風格的區塊中則使用 4 個空格。詳情見下方說明。

source: If you need to check that the modifications you've made are correct in the generated documentation, build Godot as described :ref:`here <toc-devel-compiling>`, run the editor and open the help for the page you modified.
de: Wenn Sie überprüfen müssen, ob die von Ihnen vorgenommenen Änderungen in der generierten Dokumentation korrekt sind, bauen Sie Godot wie :ref:`hier <toc-devel-compiling>` beschrieben , führen Sie den Editor aus und öffnen Sie die Hilfe für diese geänderte Seite.
es: Si necesitas verificar que las modificaciones que has hecho estan correctas en la documentación generada, compila Godot siguiendo ref:`estos pasos <toc-devel-compiling>`, ejecuta el editor y abre la página de ayuda para el material que hayas modificado.
fr: Si vous avez besoin de vérifier que les modifications que vous avez faites sont correctes dans la documentation générée, compilez Godot comme décrit :ref:`ici <toc-devel-compiling>`, exécutez l'éditeur et ouvrez l'aide pour la page que vous avez modifiée.
ja: 生成したドキュメントで行った変更が正しいことを確認する必要がある場合は、 \ :ref:`これ <toc-devel-compiling>` に従ってGodotをビルドし、エディタを実行して変更したページのヘルプを開きます。
zh_cn: 如果您需要在生成的文档中检查所做的修改是否正确,按照 :ref:`这里 <toc-devel-compiling>` 的描述构建Godot,运行编辑器并打开您所修改页面的帮助.
zh_tw: 若有需要確認在產生的文件中做出的修改是否正確，請依照 :ref:`此處 <toc-devel-compiling>` 的說明建置 Godot，然後執行編輯器並打開說明頁面檢視做出修改的頁面。

source: How to write the class reference
de: Wie man eine Klassenreferenz schreibt
es: Cómo escribir la referencia de la clase
fr: Comment écrire la référence de classe
ja: クラスリファレンスの書き方
zh_cn: 如何编写类参考手册
zh_tw: 如何撰寫類別參照文件

source: Each class has a brief and a long description. The brief description is always at the top of the page, while the full description lies below the list of methods, variables and constants. Methods, member variables, constants and signals are in separate categories or XML nodes. For each, learn how they work in Godot's source code, and fill their <description>.
de: Jede Klasse hat eine kurze und eine lange Beschreibung. Die Kurzbeschreibung befindet sich immer oben auf der Seite, während die vollständige Beschreibung unterhalb der Liste der Methoden, Variablen und Konstanten liegt. Methoden, Mitgliedsvariablen, Konstanten und Signale befinden sich in separaten Kategorien oder XML-Nodes. Lerne für jede dieser Kategorien, wie sie im Godot-Quellcode funktionieren, und fülle ihre <Beschreibung> aus.
es: Cada clase tiene una descripción larga y una corta. La descripción corta está siempre en el encabezado de la página, mientras que la descripción completa se encuentra debajo de la lista de los métodos, variables, constantes. Los metodos, variables del miembro, constantes y señales se encuentran separados por categorías o nodos de XML. Para cada uno, lee cómo funcionan en el código fuente de Godot, y completa su <description>.
fr: Chaque classe a une description brève et une description longue. La description brève se trouve toujours en haut de la page, tandis que la description complète se trouve en dessous de la liste des méthodes, des variables et des constantes. Les méthodes, les variables membres, les constantes et les signaux se trouvent dans des catégories séparées ou des nœuds XML. Pour chacun d'eux, apprenez comment ils fonctionnent dans le code source de Godot, et remplissez leur <description>.
ja: 各クラスには、簡単な説明と長い説明があります。 簡単な説明は常にページの上部にあり、完全な説明はメソッド、変数、定数のリストの下にあります。 メソッド、メンバー変数、定数、およびシグナルは、個別のカテゴリーまたはXMLノードにあります。 それぞれについて、Godotのソースコードでどのように機能するかを学習し、<description>を入力します。
zh_cn: 每个类都有一个简述和一个长的描述.简述始终位于页面顶部,而完整描述位于方法、变量和常量列表下方.方法、成员变量、常量和信号在不同的类别或XML节点中.对于以上每个,了解它们如何在Godot的源代码中工作,并填写它们的 <description> .
zh_tw: 各個類別都有一個簡短說明與長說明。簡短說明位於頁面頂部，而完整的長說明則位於方法、變數與常數列表下方。方法、成員變數、常數與訊號都放在個別分類或不同 XML 節點內。請從 Godot 的原始碼中瞭解這些功能各自如何運作，並填寫相應的 <descrioption>。

source: Our job is to add the missing text between these marks:
de: Unsere Aufgabe ist es, den fehlenden Text zwischen diesen Markierungen zu ergänzen:
es: Nuestro trabajo es añadir el texto que falta entre estas marcas:
fr: Notre travail consiste à ajouter le texte manquant entre ces marques :
ja: 私たちの仕事は、これらのマークの間に不足しているテキストを追加することです:
zh_cn: 我们的工作是在这些标记之间添加缺少的文本:
zh_tw: 我們的工作就是要填寫這些標籤內缺少的文字：

source: Write in a clear and simple language. Always follow the :ref:`writing guidelines <doc_docs_writing_guidelines>` to keep your descriptions short and easy to read. **Do not leave empty lines** in the descriptions: each line in the XML file will result in a new paragraph.
de: Schreiben Sie in einer klaren und einfachen Sprache. Befolgen Sie immer die folgenden Anweisungen :ref:`Schreibrichtlinien <doc_docs_writing_guidelines>`, um Ihre Beschreibungen kurz und leicht lesbar zu halten. **Lassen Sie keine leeren Zeilen** in den Beschreibungen: Jede Zeile in der XML-Datei führt zu einem neuen Absatz.
es: Escribe en un lenguaje simple y claro. Siempre siguiendo las :ref:`pautas y orientaciones <doc_docs_writing_guidelines>` para mantener tus descripciones cortas y fácil de leer. **No dejes lineas vacias** en las descripciones: cada línea en el archivo XML resultará en un nuevo párrafo.
fr: Écrivez dans un langage clair et simple. Suivez toujours les directives :ref:`writing guidelines <doc_docs_writing_guidelines>` pour garder vos descriptions courtes et faciles à lire. **Ne laissez pas de lignes vides** dans les descriptions : chaque ligne du fichier XML donnera lieu à un nouveau paragraphe.
ja: 明確でシンプルな言葉で書きます。常に\ :ref:`書き込みガイドライン <doc_docs_writing_guidelines>`\ に従って説明を短く読みやすくします。説明に\ **空の行を残さないようにしてください**\ 。
zh_cn: 用清晰简单的语言编写.始终遵循 :ref:`撰写指南 <doc_docs_writing_guidelines>` 以使您的描述简短易读.在描述中 **不要留下空行**:XML文件中的每一行都将生成一个新段落.
zh_tw: 請以清晰明瞭的文字撰寫。務必遵守 :ref:`撰寫方針 <doc_docs_writing_guidelines>` 以保持說明簡短且容易閱讀。在簡介中 **請不要保留空行** ：在 XML 檔中每一行都會開新段落。

source: Here's how a class looks like in XML:
de: So sieht eine Klasse in XML aus:
es: Así es como se ve una clase en XML:
fr: Voici à quoi ressemble une classe en XML :
ja: XMLでのクラスの外観は次のようにします:
zh_cn: 以下是XML中的类的样子:
zh_tw: 下列為類別在 XML 中的樣子：

source: Use a code editor like Vim, Atom, Code, Notepad++ or anything similar to edit the file quickly. Use the search function to find classes fast.
de: Verwendn Sie einen Code-Editor wie Vim, Atom, Code, Notepad++ oder etwas ähnliches, um die Datei schnell zu bearbeiten. Benutze die Suchfunktion, um Klassen schnell zu finden.
es: Usa un editor de código como Vim, Atom, Code, Notepad++ o similar para editar el archivo rápidamente. Usa la función de búsqueda para encontrar clases rápidamente.
fr: Utilisez un éditeur de code comme Vim, Atom, Code, Notepad++ ou autre pour éditer le fichier rapidement. Utilisez la fonction de recherche pour trouver rapidement des classes.
ja: Vim、Atom、Code、Notepad++などのコードエディタを使用して、ファイルをすばやく編集できます。検索機能を使用して、クラスを高速に検索します。
zh_cn: 使用代码编辑器,如Vim、Atom、Code、Notepad ++或类似的编辑器,快速编辑文件.使用搜索功能快速查找类.
zh_tw: 請使用 Vim, Atom, Code, Notepad++ 或其他類似的編輯器來快速編輯檔案。可使用搜尋功能來快速找到類別。

source: Improve formatting with BBCode style tags
de: Verbessern Sie die Formatierung mit BBCode-Tags
es: Mejore el formato con etiquetas de estilo BBCode
ja: BBCodeスタイルタグを使用した書式設定を改善する
zh_cn: 改进BBCode风格标签的格式
zh_tw: 使用 BBCode 風格的標籤來增強格式

source: Godot's class reference supports BBCode-like tags. They add nice formatting to the text. Here's the list of available tags:
de: Godots Klassenreferenz unterstützt BBCode-ähnliche Tags. Sie fügen dem Text eine schöne Formatierung hinzu. Hier ist die Liste der verfügbaren Tags:
es: Mejore el formato con etiquetas de estilo BBCode:
ja: Godotのクラスリファレンスは、BBCodeのようなタグをサポートしています。これらにより、テキストに素敵な書式を追加します。使用可能なタグの一覧です:
zh_cn: Godot的类参考支持类似BBCode的标签.它们为文本添加了漂亮的格式.下面是可用标签的列表:
zh_tw: Godot 的類別參照文件支援類似 BBCode 的標籤。這些標籤可以為文字加上格式。下面列出了所有可用的標籤：

source: Effect
de: Effekt
es: Efecto
fr: Effet
ja: 効果
zh_cn: 效果
zh_tw: 效果

source: Usage
de: Nutzung
es: Uso
fr: Utilisation
ja: 使用法
zh_cn: 用法
zh_tw: 使用量

source: Result
de: Ergebnis
es: Resultado
fr: Résultat
ja: 結果
zh_cn: 结果
zh_tw: 結果

source: Link a class
de: eine Klasse verlinken
es: Enlazar a una clase
fr: Lier une classe
ja: クラスをリンクする
zh_cn: 链接到一个类
zh_tw: 類別連結

source: Move the [Sprite].
de: bewege das [Sprite]
es: Mover el [Sprite].
fr: Déplacez le [Sprite].
ja: [Sprite] へ移動。
zh_cn: 移动[Sprite].
zh_tw: 移動 [Sprite]。

source: Move the :ref:`class_sprite`.
de: bewege das :ref:`class_sprite`
fr: Déplacez le :ref:`class_sprite`.
ja: :ref:`class_sprite` へ移動。
zh_cn: 移动 :ref:`class_Sprite`.
zh_tw: 移動 :ref:`class_sprite`。

source: [method methodname]
zh_tw: [method 方法名稱]

source: Link to a method in this class
de: Link zu einer Methode in dieser Klasse
es: Enlazar a un método de esta clase
fr: Lien vers une méthode dans cette classe
ja: このクラスのメソッドへのリンク
zh_cn: 链接到此类中的方法
zh_tw: 該類別中方法的連結

source: Call [method hide].
de: Rufe [method hide] auf.
es: Llama [metodo hide].
fr: Appelez [method hide].
ja: [method hide]を呼び出します。
zh_cn: 调用[method hide].
zh_tw: 呼叫 [method hide]。

source: See :ref:`hide <class_spatial_method_hide>`.
de: Siehe :ref:`hide <class_spatial_method_hide>`.
es: Ver :ref:`hide <class_spatial_method_hide>`.
fr: Voir :ref:`hide <class_spatial_method_hide>`.
ja: :ref:`hide <class_spatial_method_hide>` を参照してください。
zh_cn: 参见 :ref:`hide <class_Spatial_method_hide>`.
zh_tw: 參考 :ref:`hide <class_spatial_method_hide>` 。

source: [method Class.methodname]
es: [método Clase.nombremetodo]
zh_tw: [method 類別.方法名稱]

source: Link to another class's method
de: Link zur Methode einer anderen Klasse
es: Enlace al método de otra clase
fr: Lien vers la méthode d'une autre classe
ja: 別のクラスのメソッドへのリンク
zh_cn: 链接到另一个类的方法
zh_tw: 另一個類別的方法連結

source: Call [method Spatial.hide].
de: Rufe [method Spatial.hide] auf.
es: Llama [método Spatial.hide].
fr: Appelez [method Spatial.hide].
ja: [method Spatial.hide] を呼び出します。
zh_cn: 调用[method Spatial.hide].
zh_tw: 呼叫 [method Spatial.hide]。

source: [member membername]
es: [miembro nombremiembro]
zh_tw: [member 成員名稱]

source: Link to a member in this class
de: Link zu einem Mitglied in dieser Klasse
es: Enlazar a un miembro de esta clase
fr: Lien vers un membre dans cette classe
ja: このクラスのメンバーへのリンク
zh_cn: 链接到这个类的成员
zh_tw: 該類別中成員的連結

source: Get [member scale].
de: Rufe [member scale] ab.
es: Obtiene [miembro escala].
fr: Obtenir [member scale].
ja: [member scale] を取得します。
zh_cn: 获得[member scale].
zh_tw: 取得 [member scale]。

source: Get :ref:`scale <class_node2d_property_scale>`.
de: Hole :ref:`scale <class_node2d_property_scale>`.
fr: Obtenir :ref:`scale <class_node2d_property_scale>`.
ja: :ref:`scale <class_node2d_property_scale>` を取得します。
zh_cn: 获得 :ref:`scale <class_Node2d_property_scale>`.
zh_tw: 取得 :ref:`scale <class_node2d_property_scale>` 。

source: [member Class.membername]
es: [miembro Clase.nombremiembro]
zh_tw: [member 類別.成員名稱]

source: Link to another class's member
de: Link zum Mitglied einer anderen Klasse
es: Enlazar a otro miembro de la clase
fr: Lien vers un membre d'une autre classe
ja: 別のクラスのメンバーへのリンク
zh_cn: 链接到另一个类的成员
zh_tw: 另一個方法的成員連結

source: Get [member Node2D.scale].
de: Rufe [member Node2D.scale] ab.
fr: Obtenir [member Node2D.scale].
ja: [member Node2D.scale] を取得します。
zh_cn: 获得 [member Node2D.scale].
zh_tw: 取得 [member Node2D.scale]。

source: [signal signalname]
es: [signal nombresignal]
zh_tw: [signal 訊號名稱]
