Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/community/contributing/updating_the_class_reference.po
Languages: de, es, fr, ja, zh_cn, zh_tw

source: Link to a signal in this class
de: Link zu einem Signal in dieser Klasse
es: Enlazar con una señal de esta clase
fr: Lien vers un signal dans cette classe
ja: このクラスのシグナルへのリンク
zh_cn: 链接到此类中的信号
zh_tw: 該類別訊號的連結

source: Emit [signal renamed].
de: Sende [signal renamed].
fr: Émettre [signal renamed].
ja: [signal renamed] を発信します。
zh_cn: 发射 [signal renamed].
zh_tw: 發送 [signal renamed]。

source: Emit :ref:`renamed <class_node_signal_renamed>`.
de: Sende :ref:`renamed <class_node_signal_renamed>`.
fr: Émettre :ref:`renamed <class_node_signal_renamed>`.
ja: :ref:`renamed <class_node_signal_renamed>` を発信します。
zh_cn: 发射 :ref:`renamed <class_Node_signal_renamed>`.
zh_tw: 發送 :ref:`renamed <class_node_signal_renamed>`。

source: [signal Class.signalname]
es: [señal Clase.nombreseñal]
zh_tw: [signal 類別.訊號名稱]

source: Link to another class's signal
de: Link zum Signal einer anderen Klasse
es: Enlazar con la señal de otra clase
fr: Lien vers le signal d'une autre classe
ja: 別のクラスのシグナルへのリンク
zh_cn: 链接到另一个类的信号
zh_tw: 另一個類別的訊號連結

source: Emit [signal Node.renamed].
de: Sende [signal Node.renamed].
fr: Émettre [signal Node.renamed].
ja: [signal Node.renamed] を発信します。
zh_cn: 发射 [signal Node.renamed].
zh_tw: 發送 [signal Node.renamed]。

source: Bold
de: Fett
es: Negrita
fr: Gras
ja: 太字
zh_cn: 粗体
zh_tw: 粗體

source: Some [b]bold[/b] text.
de: Ein [b]fetter[/b] Text.
es: Un texto en [b]negrita[/b].
fr: Du texte en [b]gras[/b].
ja: とある [b]bold[/b] テキスト。
zh_cn: 一些[b]粗体[/b]文字.
zh_tw: 普通的 [b]粗體[/b] 文字。

source: Some **bold** text.
de: Ein **fetter** Text.
es: Algo de texto en **negrita**.
fr: Du texte en **gras**.
ja: とある **bold** テキスト。
zh_cn: 一些 **粗体** 文字.
zh_tw: 普通的 **粗體** 文字。

source: Italic
de: kursiv
es: Cursiva
fr: Italique
ja: 斜体
zh_cn: 斜体
zh_tw: 斜體

source: Some [i]italic[/i] text.
de: Ein [i]kursiver[/i] Text.
es: Un texto en [i]cursiva[/i].
fr: Du texte en [i]italique[/i].
ja: とある [i]italic[/i] テキスト。
zh_cn: 一些[i]斜体[/i]文字.
zh_tw: 普通的 [i]斜體[/i] 文字。

source: Some *italic* text.
de: Ein *kursiver* Text.
es: Algo de texto en *cursiva*.
fr: Du texte *italique*.
ja: とある *italic* テキスト。
zh_cn: 一些 *斜体* 文字.
zh_tw: 普通的 *斜體* 文字。

source: Monospace
ja: モノスペース
zh_cn: 等宽字体
zh_tw: 等寬字體

source: Some [code]monospace[/code] text.
de: Ein [code]monospace[/code] Text.
es: Un texto [code]monoespaciado[/code].
fr: Du texte [code]monospace[/code].
ja: とある [code]monospace[/code] テキスト。
zh_cn: 一些[code]等宽字体[/code] 文本.
zh_tw: 普通的 [code]等寬字體 (Monospace)[/code] 文字。

source: Some ``monospace`` text.
de: Ein ``monospace`` Text.
es: Algo de texto ``monospace``.
fr: Du texte ``monospace``.
ja: とある ``monospace`` テキスト。
zh_cn: 一些 ``等宽字体`` 文本.
zh_tw: 普通的 ``等寬字體 (Monospace)`` 文字。

source: Keyboard/mouse shortcut
de: Tastatur/Maus Kürzel
es: Atajo del teclado/ratón
fr: Raccourci clavier/souris
ja: キーボードとマウスのショートカット
zh_cn: 键盘和鼠标快捷键
zh_tw: 鍵盤或滑鼠快捷鍵

source: Some [kbd]Ctrl + C[/kbd] key.
de: Eine [kbd]Ctrl + C[/kbd] Taste.
es: Alguna tecla [kbd]Ctrl + C[/kbd].
fr: Des touches [kbd]Ctrl + C[/kbd].
ja: とある [kbd]Ctrl + C[/kbd] キー。
zh_cn: 一些[kbd]Ctrl + C[/kbd]键.
zh_tw: 普通的 [kbd]Ctrl + C[/kbd] 按鍵。

source: Some :kbd:`Ctrl + C` key.
de: Eine :kbd:`Ctrl + C` Taste.
fr: Des touches :kbd:`Ctrl + C`.
ja: とある :kbd:`Ctrl + C` キー。
zh_cn: 一些 :kbd:`Ctrl + C` 键.
zh_tw: 普通的 :kbd:`Ctrl + C` 按鍵。

source: Multiline preformatted block
de: Mehrzeiliger vorformatierter Block
es: Bloque pre-formateado con múltiples líneas
fr: Bloc multiligne préformaté
ja: マルチラインプリフォーマットブロック
zh_cn: 多行预格式化块
zh_tw: 多行預格式化區塊

source: *See below.*
de: *siehe unten*
es: *Ver a continuación.*
fr: *Voir ci-dessous.*
ja: *下記参照。*
zh_cn: *见下文.*
zh_tw: **參見下方。**

source: Use ``[codeblock]`` for pre-formatted code blocks. Inside ``[codeblock]``, always use **four spaces** for indentation (the parser will delete tabs). Example:
de: Verwenden Sie ``[Codeblock]`` für vorformatierte Codeblöcke. Verwenden Sie in ``[Codeblock]`` immer **vier Leerzeichen** zum Einrücken (der Parser löscht Tabulatoren). Beispiel:
es: Usa ``[bloque de código]`` para pre-formatear bloques de código. Dentro de ``[bloque de código]``, usa *cuatro espacios* para hacer sangría (el analizador eliminará las tabulaciones). Por ejemplo:
fr: Utiliser ``[codeblock]`` pour des blocs de code préformatés. À l'intérieur de ``[codeblock]``, utiliser toujours **quatre espaces** pour l'indentation (l'analyseur supprimera les tabulations). Par exemple :
ja: 事前にフォーマットされたコードブロックには ``[codeblock]`` を使用します。\ ``[codeblock]`` 内では、インデントには常に **4つのスペース** を使用します(パーサーはタブを削除します)。例:
zh_cn: 对预格式化的代码块使用 ``[codeblock]``.在 ``[codeblock]`` 中,始终使用 **四个空格** 进行缩进(解析器将删除制表符).例如:
zh_tw: 使用 ``[codeblock]`` 來標記預先格式化的程式碼區塊。在 ``[codeblock]`` 中，請務必使用 **四個空格** 來進行縮排 (剖析器會移除 Tab 字元)。例如：

source: Will display as:
de: Wird angezeigt als:
es: Se mostrará como:
fr: S'affichera comme cela :
ja: 次のように表示されます:
zh_cn: 将显示为:
zh_tw: 會顯示為：

source: To denote important information, add a paragraph starting with "[b]Note:[/b]" at the end of the description:
de: Um wichtige Informationen zu kennzeichnen, füge am Ende der Beschreibung einen Absatz hinzu, der mit "[b]Note:[/b]" beginnt:
zh_cn: 要表示重要信息,请在描述末尾添加一段以"[b]注:[/b]"开头的内容:
zh_tw: 若要標記出重要的資訊，可在說明最後新增以「[b]Note:[/b]」開頭的段落：

source: To denote crucial information that could cause security issues or loss of data if not followed carefully, add a paragraph starting with "[b]Warning:[/b]" at the end of the description:
de: Um wichtige Informationen zu kennzeichnen, die zu Sicherheitsproblemen oder Datenverlust führen können, wenn sie nicht sorgfältig beachtet werden, füge am Ende der Beschreibung einen Absatz hinzu, der mit "[b]Warning:[/b]" beginnt:
zh_cn: 为了表示如果不仔细遵循可能导致安全问题或数据丢失的关键信息,请在描述末尾添加一段以"[b]警告:[/b]"开头的内容:
zh_tw: 若要標記出未多加留意可能導致安全性問題或遺失資料的警示資訊，請在說明最後加上以「[b]Warning:[/b]」開頭的段落：

source: For deprecated properties, add a paragraph starting with "[i]Deprecated.[/i]". Notice the use of italics instead of bold:
de: Füge für veraltete Eigenschaften einen Absatz hinzu, der mit "[i]Deprecated.[/i]" beginnt. Beachte die Verwendung von Kursivschrift anstelle von Fettdruck:
zh_cn: 对于不推荐使用的属性,请添加以"[i]deprecated.[/i]"开头的段落.注意使用斜体代替粗体:
zh_tw: 而已停止維護的屬性，請加上以「[i]Deprecated.[/i]」開頭的段落。請注意，這裡使用的是斜體而非粗體：

source: In all the paragraphs described above, make sure the punctuation is part of the BBCode tags for consistency.
de: Stelle in allen oben beschriebenen Abschnitten sicher, dass die Interpunktion aus Gründen der Konsistenz Teil der BBCode-Tags ist.
zh_cn: 在上面描述的所有段落中,确保标点符号是BBCode标签的一部分,以保持一致性.
zh_tw: 請注意，上面描述的所有段落中，標點符號都是 BBCode 標籤中的一部分，請保持一致性。

source: I don't know what this method does!
de: Ich weiß nicht, was diese Methode macht!
es: ¡No sé que hace este método!
fr: Je ne sais pas ce que cette méthode fait !
ja: このメソッドが何をするのかわかりません！
zh_cn: 我不知道这个方法干什么用！
zh_tw: 我不知道這個方法做了什麼！

source: No problem. Leave it behind, and list the methods you skipped when you request a pull of your changes. Another writer will take care of it.
de: Kein Problem. Lassen Sie es hinter sich und listen Sie die Methoden auf, die Sie übersprungen haben, als Sie einen Abruf Ihrer Änderungen anforderten. Ein anderer Schreiber wird sich darum kümmern.
es: No hay problema. Déjalo atrás, y enumera los métodos que omitiste cuando solicitaste un pull de tus cambios. Otro redactor se encargará de ello.
fr: Aucun problème. Laissez-le derrière et lister les méthodes que vous avez passé quand vous faites un *pull request* de vos changements. Un autre contributeur s'en occupera.
ja: 大丈夫ですよ。そのままにしておき、変更のプルを要求したときにスキップしたメソッドをリストします。他の人が担当します。
zh_cn: 没问题.将其留下,并在您请求提取更改时列出跳过的方法.别的编写者会处理它.
zh_tw: 沒關係，先跳過即可。並請在為更改開啟 PR 時列出所有跳過的方法。其他編寫者會處理這些方法。

source: You can still have a look at the methods' implementation in Godot's source code on GitHub. Also, if you have doubts, feel free to ask on the `Q&A website <https://godotengine.org/qa/>`__ and on IRC (freenode, #godotengine).
de: Sie können sich immer noch die Implementierung der Methoden im Godot-Quellcode auf GitHub ansehen. Wenn Sie Zweifel haben, können Sie auch auf der Frage-und-Antwort-Website <https://godotengine.org/qa/> __ und im IRC (freenode, #godotengine) nachfragen.
es: Aún puedes echar un vistazo a la implementación de los métodos en el código fuente de Godot en Github . También, si tienes alguna duda, siéntete libre de preguntar en el `apartado web Preguntas y Respuestas <https://godotengine.org/qa/>`__ y en el IRC (freenode, #godotengine).
fr: Vous pouvez toujours regarder l'implémentation des méthodes dans le code source de Godot sur GitHub. Ainsi, si vous avez des doutes, n'hésitez pas à poser des questions sur le site web `Q&A site <https://godotengine.org/qa/>`__ et sur IRC (freenode, #godotengine).
ja: GitHubのGodotのソースコードでメソッドの実装を見ることができます。 また、疑問がある場合は、\ `Q＆A Webサイト <https://godotengine.org/qa/>`_\ およびIRC(freenode、＃godotengine)でお気軽にお問い合わせください。
zh_cn: 您仍然可以在GitHub上查看Godot源代码中方法的实现.此外,如果您有疑问,请随时在 `问答网站 <https://godotengine.org/qa/>`__ 和IRC(freenode,#godotengine)上询问.
zh_tw: 也可以在 GitHub 上 Godot 的原始碼中看看該方法的實作。另外，如果有疑慮時，歡迎在 `Q&A 網站 <https://godotengine.org/qa/>`__ 與 IRC (freenode, #godotengine) 上提問。

source: Localization
de: Lokalisierung
es: Traducciones
fr: Localisation
ja: ローカライズ
zh_cn: 本地化
zh_tw: 本地化

source: The documentation can be translated in any language on `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`__.
de: Die Dokumentation kann in eine beliebige Sprache auf `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`__ übersetzt werden.
es: La documentación se puede traducir en cualquier idioma en `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`__.
fr: La documentation peut être traduite dans n'importe quelle langue sur `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`__.
ja: ドキュメントは、\ `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`__ で任意の言語に翻訳できます。
zh_cn: 在 `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`__ 上的文档可以被翻译成任何语言.
zh_tw: 說明文件可以在 `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`__ 上翻譯為任意語言。

source: Translated strings are synced manually by documentation maintainers in the `godot-docs-l10n <https://github.com/godotengine/godot-docs-l10n>`__ repository.
de: Übersetzte Zeichenfolgen werden manuell von Dokumentationsbetreuern im Repository `godot-docs-l10n <https://github.com/godotengine/godot-docs-l10n>`__ synchronisiert.
es: Los encargados de la documentación sincronizan las cadenas traducidas manualmente en el repositorio `godot-docs-l10n <https://github.com/godotengine/godot-docs-l10n>`__.
fr: Les chaînes traduites sont synchronisées manuellement par les responsables de la documentation dans le dossier `godot-docs-l10n <https://github.com/godotengine/godot-docs-l10n>`__.
ja: 翻訳された文字列は、\ `godot-docs-l10n <https://github.com/godotengine/godot-docs-l10n>`__ リポジトリのドキュメントメンテナーによって手動で同期されます。
zh_cn: 翻译后的字符串由文档维护人员在 `godot-docs-l10n <https://github.com/godotengine/godot-docs-l10n>`__ 存储库中手动同步更新.
zh_tw: 翻譯字串是由說明文件維護人員手動同步到 `godot-docs-l10n <https://github.com/godotengine/godot-docs-l10n>`__ 儲存庫內。

source: Languages with a good level of completion have their own localized instances of ReadTheDocs. Open an issue on the ``godot-docs-l10n`` repository if you think that a new language is complete enough to get its own instance.
de: Sprachen mit einem guten Abschluss haben ihre eigenen lokalisierten Instanzen von ReadTheDocs. Öffnen Sie ein Problem im Repository ``godot-docs-l10n``, wenn Sie der Meinung sind, dass eine neue Sprache vollständig genug ist, um eine eigene Instanz zu erhalten.
es: Los lenguajes con un buen nivel de completación tienen sus propias instancias localizadas de ReadTheDocs. Abre un issue en el repositorio ``godot-docs-l10n`` si crees que un nuevo idioma es lo suficientemente completo como para obtener su propia instancia.
fr: Les langues avec un bon niveau d'achèvement ont leurs propres instances localisées de ReadTheDocs. Ouvrez un problème sur le dépôt ``godot-docs-l10n`` si vous pensez qu'un nouveau langage est assez complet pour obtenir sa propre instance.
ja: 完成度の高い言語には、独自のローカライズされたReadTheDocsのインスタンスがあります。新しい言語が独自のインスタンスを取得するのに十分であると思われる場合は、\ ``godot-docs-l10n`` リポジトリでissueをオープンします。
zh_cn: 具有良好完成程度的语言具有自己的手册本地化实例.如果您认为新语言足够完整可以获得自己的实例,请在 ``godot-docs-l10n`` 存储库中开启一个问题.
zh_tw: 有一定完成度的語言便會有自己的本地化 ReadTheDocs 實體。如果你認為有哪個語言的完成度夠高能開啟自己的實體時，請在 ``godot-docs-l10n`` 上開啟 Issue。

source: Fork Godot
de: Godot forken
es: Crea un Fork de Godot
ja: フォーク Godot
zh_cn: 分叉Godot

source: Tag
es: Etiqueta
fr: Balise
ja: タグ
zh_cn: 标签

source: Contribute to the Class Reference
fr: Contribuer à la référence des classes (API)

source: Edit it using your favorite text editor. If you use a code editor, make sure that it doesn't change the indent style: tabs for the XML, and 4 spaces inside BBcode-style blocks. More on that below.
fr: Modifiez-le à l'aide de votre éditeur de texte préféré. Si vous utilisez un éditeur de code, assurez-vous qu'il ne modifie pas le style d'indentation : des tabulations pour le XML, et 4 espaces à l'intérieur des blocs de style BBcode. Plus d'informations à ce sujet ci-dessous.

source: Improve formatting with BBcode style tags
fr: Améliorez le formatage avec les balises de style BBcode

source: Godot's class reference supports BBcode-like tags. They add nice formatting to the text. Here's the list of available tags:
fr: La référence de classe de Godot supporte les balises de type BBcode. Ils ajoutent un joli formatage au texte. Voici la liste des balises disponibles :
