Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/community/contributing/ways_to_contribute.po
Languages: pl

source: Ways to contribute
pl: Metody wspierania

source: Godot Engine is a non-profit, community-driven free and open source project. Almost all (but our lead dev Juan, more on that below) developers are working *pro bono* on their free time, out of personal interest and for the love of creating a libre engine of exceptional quality.
pl: Godot Engine jest projektem nienastawionym na zysk, skupioną wokół idei wolnego oprogramowania. Prawie wszyscy (oprócz głównego dewelopera Juana, więcej na ten temat poniżej) deweloperzy pracują *pro bono* w swoim czasie wolnym, z osobistego zainteresowania i z miłości do tworzenia wolnego i otwartego silnika wyjątkowej jakości.

source: This means that to thrive, Godot needs as many users as possible to get involved by contributing to the engine. There are many ways to contribute to such a big project, making it possible for everybody to bring something positive to the engine, regardless of their skill set:
pl: Oznacza to, że aby dobrze się rozwijać, Godot potrzebuje jak największej liczby użytkowników zaangażowanych w pracę przy silnika. Istnieje wiele sposobów, aby pomóc w realizacji tak dużego projektu, dzięki czemu każdy będzie mógł wnieść coś pozytywnego do silnika, niezależnie od swoich umiejętności:

source: **Make games.** It's no secret that, to convince new users and especially the industry at large that Godot is a relevant market player, we need great games made with Godot. We know that the engine has a lot of potential, both for 2D and 3D games, but given its young age we still lack big releases that will draw attention to Godot. So keep working on your awesome projects, each new game increases our credibility on the gamedev market!
pl: **Twórz gry.** Nie jest tajemnicą, że aby przekonać nowych użytkowników, a w szczególności branżę, że Godot jest ważnym graczem na rynku, potrzebujemy świetnych gier z Godotem. Wiemy, że silnik ma duży potencjał, zarówno dla gier 2D jak i 3D, ale biorąc pod uwagę jego młody wiek wciąż brakuje nam dużych wydawnictw, którzy zwrócą uwagę na Godota. Kontynuuj więc pracę nad swoimi wspaniałymi projektami, każda nowa gra zwiększa naszą wiarygodność na rynku gier!

source: **Get involved in the engine's development.** This can be by contributing code via pull requests, testing the development snapshots or directly the git *master* branch, report bugs or suggest enhancements on the issue tracker, improve the official documentation (both the class reference and tutorials) and its translations. The following sections will cover each of those "direct" ways of contributing to the engine.
pl: **Zaangażuj się w rozwój silnika.** Może to być poprzez dodawanie kodu poprzez pull requesty, testowanie wydań deweloperskich lub programu kompilowanego bezpośrednio z git *master*, zgłaszanie błędów lub sugerowanie ulepszeń w issue trackeru, ulepszanie oficjalnej dokumentacji (zarówno dokumentacji klas, jak i samouczków) oraz jej tłumaczeń. W kolejnych sekcjach omówiono każdy z tych "bezpośrednich" sposobów przyczyniania się do wspierania silnika.

source: Contributing code
pl: Pisanie kodu silnika

source: The possibility to study, use, modify and redistribute modifications of the engine's source code are the fundamental rights that Godot's `MIT <https://tldrlegal.com/license/mit-license>`_ license grants you, making it `free and open source software <https://en.wikipedia.org/wiki/Free_and_open-source_software>`_.
pl: Możliwość studiowania, używania, modyfikowania i redystrybucji modyfikacji kodu źródłowego silnika są podstawowymi prawami, które daje wam licencja Godota `MIT <https://tldrlegal.com/license/mit-license>`_, czyniąc go `wolnym i otwartym oprogramowaniem <https://en.wikipedia.org/wiki/Free_and_open-source_software>`_.

source: Contributing code changes upstream has two big advantages:
pl: Pisanie kodu silnika ma dwie duże zalety:

source: Technical details about the PR workflow are outlined in a specific section, :ref:`doc_pr_workflow`.
pl: Techniczne szczegóły na temat przepływu pracy PR są opisane w odrębnej sekcji, :ref:`doc_pr_workflow`.

source: Details about the code style guidelines and the ``clang-format`` tool used to enforce them are outlined in :ref:`doc_code_style_guidelines`.
pl: Szczegóły na temat wytycznych stylu kodu oraz narzędzia ``clang-format`` używanego do egzekwowania ich są opisane w :ref:`doc_code_style_guidelines`.

source: Testing and reporting issues
pl: Testowanie i zgłaszanie problemów

source: Another great way of contributing to the engine is to test development releases or the development branch and to report issues. It is also helpful to report issues discovered in stable releases, so that they can be fixed in the development branch and in future maintenance releases.
pl: Innym sposobem na udoskonalenie silnika jest testowanie niestabilnych wersji programu i zgłaszanie problemów. Pomocne jest również zgłaszanie problemów wykrytych w stabilnych wersjach, tak aby można je było naprawić w przyszłych wersjach.

source: Testing development versions
pl: Testowanie wersji deweloperskich

source: To help with the testing, you have several possibilities:
pl: Masz wiele możliwości by pomóc z testowaniem:

source: Compile the engine from source yourself, following the instructions of the :ref:`Compiling <toc-devel-compiling>` page for your platform.
pl: Skompiluj sam silnik ze źródła, postępując zgodnie z instrukcjami zawartymi na stronie :ref:`Kompilowanie <toc-devel-compiling>` dla twojej platformy.

source: Test official pre-release binaries when they are announced (usually on the blog and other community platforms), such as alpha, beta and release candidate (RC) builds.
pl: Testuj oficjalne przedpremierowe wydania tuż po ich ogłoszeniu (zazwyczaj na blogu i innych platformach społecznościowych), takie jak alfa, beta i kandydaci do wydania (RC).

source: Test "trusted" unofficial builds of the development branch; just ask community members for reliable providers. Whenever possible, it's best to use official binaries or to compile yourself though, to be sure about the provenance of your binaries.
pl: Testuj tylko "zaufane" kompilacje; po prostu zapytaj członków społeczności o wiarygodnych dostawców. Jeśli to tylko możliwe, najlepiej jest użyć oficjalnych plików binarnych lub skompilować się samemu, aby mieć pewność co do ich bezpieczeństwa.

source: Filing an issue on GitHub
pl: Zgłaszanie problemu na GitHubie

source: When you report a bug, you should keep in mind that the process is similar to an appointment with your doctor. You noticed *symptoms* that make you think that something might be wrong (the engine crashes, some features don't work as expected, etc.). It's the role of the bug triaging team and the developers to then help make the diagnosis of the issue you met, so that the actual cause of the bug can be identified and addressed.
pl: Zgłaszając błąd, należy pamiętać, że proces ten jest podobny do wizyty u lekarza. Zauważyłeś *symptomy*, które sprawiają, że myślisz, że coś może być nie tak (silnik się zacina lub wyłącza, niektóre funkcje nie działają zgodnie z oczekiwaniami itp.). Zadaniem zespołu zajmującego się znajdowaniem i opisywaniem błędów i programistów jest pomoc w postawieniu diagnozy problemu, z którym się zetknęliście, tak aby można było zidentyfikować i zająć się faktyczną przyczyną błędu.

source: You should therefore always ask yourself: what is relevant information to give so that other Godot contributors can understand the bug, identify it and hopefully fix it. Here are some of the most important infos that you should always provide:
pl: Dlatego powinieneś zawsze zadawać sobie pytanie: jakie istotne informacje należy podać, aby inni użytkownicy Godot mogli zrozumieć błąd, zidentyfikować go i, miejmy nadzieję, naprawić. Oto kilka z najważniejszych informacji, które należy zawsze podawać:

source: **Operating system.** Sometimes bugs are system-specific, i.e. they happen only on Windows, or only on Linux, etc. That's particularly relevant for all bugs related to OS interfaces, such as file management, input, window management, audio, etc.
pl: **System operacyjny**Czasami błędy są specyficzne dla danego systemu, tzn. występują tylko w systemie Windows lub tylko w systemie Linux itp. Jest to szczególnie istotne dla wszystkich błędów związanych z interfejsami OS, takimi jak zarządzanie plikami, wejściami, okienkami, dźwiękiem itp.

source: **Hardware.** Sometimes bugs are hardware-specific, i.e. they happen only on certain processors, graphic cards, etc. If you are able to, it can be helpful to include information on your hardware.
pl: **Sprzęt.** Czasami błędy są specyficzne dla sprzętu, tzn. występują tylko na niektórych procesorach, kartach graficznych itp. Jeśli jesteś w stanie, pomocne może być umieszczenie informacji o twoim sprzęcie.

source: Contributing to the documentation
pl: Wspieranie dokumentacji

source: There are two separate resources referred to as "documentation" in Godot:
pl: W Godocie istnieją dwa oddzielne zasoby zwane "dokumentacją":

source: To make Godot accessible to everyone, including users who may prefer resources in their native language instead of English, our community helps translate both the Godot editor and its documentation in many languages.
pl: By uczynić Godot dostępnym dla wszystkich, włączając użytkowników, którzy mogą woleć zasoby w swoim ojczystym języku a nie angielskim, nasza społeczność pomaga tłumaczyć zarówno edytor jaki i jego dokumentację na wiele języków.

source: See :ref:`doc_editor_and_docs_localization` for more details.
pl: Tu znajdziesz więcej :ref:`doc_editor_and_docs_localization`.

source: Translation status
pl: Status tłumaczenia
