Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/gui/bbcode_*_richtextlabel.po
Languages: es

source: BBCode in RichTextLabel
es: BBCode en RichTextLabel

source: Introduction
es: Introducción

source: Label nodes are great for displaying basic text, but they have limits. If you want to change the color of the text, or its alignment, that change affects all of the text in the Label node. You can't have only one part of the text be one color, or only one part of the text be centered. To get around this limitation you would use a :ref:`class_RichTextLabel`.
es: Los nodos de la etiqueta son geniales para mostrar el texto básico, pero tienen límites. Si quieres cambiar el color del texto, o su alineación, ese cambio afecta a todo el texto del nodo Label. No puedes hacer que sólo una parte del texto sea de un color, o que sólo una parte del texto esté centrada. Para sortear esta limitación usarías un :ref:`class_RichTextLabel`.

source: :ref:`class_RichTextLabel` allows the display of complex text markup in a Control. It has a built-in API for generating the markup, but can also parse a BBCode.
es: :ref:`class_RichTextLabel` permite la visualización de marcas de texto complejas en un Control. Tiene una API incorporada para generar el marcado, pero también puede analizar un BBCode.

source: Note that the BBCode tags can also be used, to some extent, in the :ref:`XML source of the class reference <doc_updating_the_class_reference>`.
es: Nótese que las etiquetas de BBCode también pueden ser usadas, hasta cierto punto, en el :ref:`XML source of the class reference <doc_updating_the_class_reference>`.

source: Using BBCode
es: Usando BBCode

source: For uniformly formatted text you can write in the "Text" property, but if you want to use BBCode markup you should use the "Text" property in the "Bb Code" section instead (``bbcode_text``). Writing to this property will trigger the parsing of your markup to format the text as requested. Before this happens, you need to toggle the "Enabled" checkbox in the "Bb Code" section (``bbcode_enabled``).
es: Para un texto con formato uniforme se puede escribir en la propiedad "Text", pero si se desea utilizar el marcado BBCode se debe utilizar la propiedad "Text" en la sección "Bb Code" (``bbcode_text``). Al escribir en esta propiedad se activará el análisis sintáctico de su marcado para dar formato al texto según lo solicitado. Antes de que esto ocurra, necesita activar la casilla de verificación "Enabled" en la sección "Bb Code" (``bbcode_enabled``).

source: For example, ``BBCode [color=blue]blue[/color]`` would render the word "blue" with a blue color.
es: Por ejemplo, "BBCode [color=blue]blue[/color]`` haría que la palabra "blue" tuviera un color azul.

source: You'll notice that after writing in the BBCode "Text" property the regular "Text" property now has the text without the BBCode. While the text property will be updated by the BBCode property, you can't edit the text property or you'll lose the BBCode markup. All changes to the text must be done in the BBCode parameter.
es: Notarán que después de escribir en la propiedad "Texto" del BBCode, la propiedad "Texto" normal ahora tiene el texto sin el BBCode. Mientras que la propiedad "Text" será actualizada por la propiedad BBCode, no puedes editar la propiedad texto o perderás el marcado BBCode. Todos los cambios en el texto deben hacerse en el parámetro BBCode.

source: For BBCode tags such as ``[b]`` (bold), ``[i]`` (italics) or ``[code]`` to work, you must set up custom fonts for the RichTextLabel node first.
es: Para que las etiquetas BBCode como ``[b]`` (negrita), ``[i]`` (cursiva) o ``[código]`` funcionen, debes configurar primero las fuentes personalizadas para el nodo RichTextLabel.

source: There are no BBCode tags to control vertical centering of text yet.
es: Todavía no hay etiquetas BBCode para controlar el centrado vertical del texto.

source: Reference
es: Referencia

source: Command
es: Comando

source: Tag
es: Etiqueta

source: Description
es: Descripción

source: **bold**
es: **negrita**

source: Makes {text} bold.
es: Hace {text} más oscuro.

source: **italics**
es: **cursiva**

source: Makes {text} italics.
es: Hace {text) cursiva.

source: **underline**
es: **Subrayado**

source: Makes {text} underline.
es: Subraya el {text}.

source: **strikethrough**
es: **tachado**

source: Makes {text} strikethrough.
es: Tachar el {text).

source: **code**
es: **codigo**

source: Makes {text} use the code font (which is typically monospace).
es: Hace que {text} utilice la fuente del código (que es típicamente monoespacio).

source: **center**
es: **centrado**

source: Makes {text} horizontally centered.
es: Centra horizontalmente el {text}.

source: **right**
es: **derecho**

source: Makes {text} horizontally right-aligned.
es: Centra horizontalmente al {text} a la derecha.

source: **fill**
es: **llenar**

source: Makes {text} fill the RichTextLabel's width.
es: Hace que el {text} se expanda a lo ancho del RchTextLabel.

source: **indent**
es: **indentar**

source: Increase the indentation level of {text}.
es: Aumentar el nivel de indentación del {text}.

source: Show {url} as such, underline it and make it clickable.
es: Mostrar {url} como tal, subrayarlo y hacer que se pueda hacer clic en él.

source: Makes {text} reference <url> (underlined and clickable).
es: Hace {text} de referencia <url> (subrayado y clicable).

source: **image**
es: **imagen**

source: Insert image at resource {path}.
es: Inserte la imagen en el recurso {path}.

source: **resized image**
es: **imagen redimensionada**

source: Insert image at resource {path} using <width> (keeps ratio).
es: Insertar la imagen en el recurso {path} usando <width> (mantiene la proporción).

source: ``[img=<width>x<height>]{path}[/img]``
es: ``[img=<ancho>x<altura>]{path}[/img]``

source: Insert image at resource {path} using <width>×<height>.
es: Insertar la imagen en el recurso {path} usando <ancho>×<alto>.

source: **font**
es: **fuente**

source: ``[font=<path>]{text}[/font]``
es: ``[font=<path>]{texto}[/font]``

source: Use custom font at <path> for {text}.
es: Usa la fuente personalizada en <path> para {text}.

source: Change {text} color; use name or # format, such as ``#ff00ff``.
es: Cambia el color del {text}; usa el nombre o el formato #, como ``#ff00ff``.

source: **table**
es: **tabla**

source: Creates a table with <number> of columns.
es: Crea una tabla con un <number> de columnas.

source: **cell**
es: **celda**

source: Adds cells with the {text} to the table.
es: Añade celdas con el {texto} a la tabla.

source: Built-in color names
es: Nombres de colores incorporados

source: List of valid color names for the [color=<name>] tag:
es: Lista de nombres de colores válidos para la etiqueta [color=<nombre>]:

source: aqua
es: agua

source: black
es: negro

source: blue
es: azul

source: fuchsia
es: fucsia

source: gray
es: gris

source: green
es: verde

source: lime
es: lima

source: maroon
es: granate

source: navy
es: azul marino

source: purple
es: violeta

source: silver
es: plata

source: teal
es: verde azulado

source: white
es: Blanco

source: yellow
es: Amarillo

source: Hexadecimal color codes
es: Códigos Hexadecimales de color

source: For opaque RGB colors, any valid 6-digit hexadecimal code is supported, e.g. ``[color=#ffffff]white[/color]``.
es: Para colores RGB opacos, cualquier código hexadecimal valido de 6-dígitos esta soportado, p.ej. ``[color=#ffffff]white[/color]``.

source: For transparent RGB colors, any 8-digit hexadecimal code can be used, e.g. ``[color=#88ffffff]translucent white[/color]``. In this case, note that the alpha channel is the **first** component of the color code, not the last one.
es: Para colores RGB transparentes, puede ser usado cualquier código hexadecimal valido de 8-dígitos, p.ej. ``[color=#88ffffff]translucent white[/color]``. En este caso, observa que el canal alpha es el **primer** componente del código de color, no el ultimo.

source: Image vertical offset
es: Desplazamiento vertical de la imagen

source: You use a custom font for your image in order to align it vertically.
es: Utilizas una fuente personalizada para tu imagen para alinearla verticalmente.

source: Create a ``BitmapFont`` resource
es: Crear un recurso ``BitmapFont``

source: Set this bitmap font with a positive value for the ``ascent`` property, that's your height offset
es: Ponga esta fuente de mapa de bits con un valor positivo para la propiedad ``ascent``, que es su desplazamiento de altura

source: Set the BBCode tag this way: ``[font=<font-path>][img]{image-path}[/img][/font]``
es: Ponga la etiqueta BBCode de esta manera: ``[font=<font-path>][img]{image-path}[/img][/font]``

source: Animation effects
es: Efectos de animación

source: BBCode can also be used to create different text animation effects. Five customizable effects are provided out of the box, and you can easily create your own.
es: BBCode también puede ser usado para crear diferentes efectos de animación de texto. Se proporcionan cinco efectos personalizables fuera de la caja, y puedes crear fácilmente los tuyos propios.

source: Wave
es: Ola

source: Wave makes the text go up and down. Its tag format is ``[wave amp=50 freq=2][/wave]``. ``amp`` controls how high and low the effect goes, and ``freq`` controls how fast the text goes up and down.
es: La onda hace que el texto suba y baje. Su formato de etiqueta es ``[wave amp=50 freq=2][/wave]``. ``amp`` controla cuán alto y bajo va el efecto, y ``freq`` controla cuán rápido el texto sube y baja.

source: Tornao makes the text move around in a circle. Its tag format is ``[tornado radius=5 freq=2][/tornado]``. ``radius`` is the radius of the circle that controls the offset, ``freq`` is how fast the text moves in a circle.
es: El tornado hace que el texto se mueva en un círculo. Su formato de etiqueta es ``[tornado radius=5 freq=2][/tornado]``. ``radius`` es el radio del círculo que controla el desplazamiento, ``freq`` es la velocidad con la que el texto se mueve en un círculo.

source: Shake
es: Agitado

source: Shake makes the text shake. Its tag format is ``[shake rate=5 level=10][/shake]``. ``rate`` controls how fast the text shakes, ``level`` controls how far the text is offset from the origin.
es: Agitar hace que el texto tiemble. Su formato de etiqueta es ``[Shake rate=5 level=10][/shake]``. ``rate`` controla la rapidez con que el texto se agita, ``level`` controla la distancia del texto desde el origen.

source: Fade
es: Desaparecer

source: Fade creates a fade effect over the text that is not animated. Its tag format is ``[fade start=4 length=14][/fade]``. ``start`` controls the starting position of the falloff relative to where the fade command is inserted, ``length`` controls over how many characters should the fade out take place.
es: El fundido crea un efecto de desvanecimiento sobre el texto que no está animado. Su formato de etiqueta es ``[fade start=4 length=14][/fade]``. ``start`` controla la posición inicial de la caída relativa a donde se inserta el comando fade, ``length`` controla sobre cuántos caracteres debe tener lugar el desvanecimiento.

source: Rainbow
es: Arcoiris

source: Rainbow gives the text a rainbow color that changes over time. Its tag format is ``[rainbow freq=0.2 sat=10 val=20][/rainbow]``. ``freq`` is the number of full rainbow cycles per second, ``sat`` is the saturation of the rainbow, ``val`` is the value of the rainbow.
es: El arcoiris le da al texto un color de arco iris que cambia con el tiempo. Su formato de etiqueta es ``[rainbow freq=0.2 sat=10 val=20][/rainbow]``. "freq" es el número de ciclos completos del arcoiris por segundo, "sat" es la saturación del arcoiris, "val" es el valor del arcoiris.

source: Custom BBCode tags and text effects
es: Etiquetas BBCode personalizadas y efectos de texto

source: You can extend the :ref:`class_RichTextEffect` resource type to create your own custom BBCode tags. You begin by extending the :ref:`class_RichTextEffect` resource type. Add the ``tool`` prefix to your GDScript file if you wish to have these custom effects run within the editor itself. The RichTextLabel does not need to have a script attached, nor does it need to be running in ``tool`` mode.
es: Puedes extender el tipo de recurso :ref:`class_RichTextEffect` para crear tus propias etiquetas BBCode personalizadas. Comienza extendiendo el tipo de recurso :ref:`class_RichTextEffect`. Añade el prefijo ``tool`` a tu archivo GDScript si deseas que estos efectos personalizados se ejecuten dentro del propio editor. El RichTextLabel no necesita tener un script adjunto, ni necesita estar ejecutándose en modo ``tool``.

source: There is only one function that you need to extend: ``_process_custom_fx(char_fx)``. Optionally, you can also provide a custom BBCode identifier simply by adding a member name ``bbcode``. The code will check the ``bbcode`` property automatically or will use the name of the file to determine what the BBCode tag should be.
es: Sólo hay una función que necesita extenderse: ``_process_custom_fx(char_fx)``. Opcionalmente, también puede proporcionar un identificador personalizado de BBCode simplemente añadiendo un nombre de miembro ``bbcode``. El código comprobará la propiedad ``bbcode`` automáticamente o utilizará el nombre del archivo para determinar cuál debe ser la etiqueta BBCode.

source: This is where the logic of each effect takes place and is called once per character during the draw phase of text rendering. This passes in a :ref:`class_CharFXTransform` object, which holds a few variables to control how the associated character is rendered:
es: Aquí es donde la lógica de cada efecto tiene lugar y se llama una vez por carácter durante la fase de dibujo de la representación del texto. Esto pasa en un objeto :ref:`class_CharFXTransform`, que contiene unas pocas variables para controlar cómo se renderiza el carácter asociado:

source: ``identity`` specifies which custom effect is being processed. You should use that for code flow control.
es: ``identity`` especifica qué efecto personalizado se está procesando. Deberías usar eso para el control del flujo de códigos.

source: ``relative_index`` tells you how far into a given custom effect block you are in as an index.
es: ``relative_index`` te dice cuán lejos estás en un bloque de efectos personalizados como índice.

source: ``absolute_index`` tells you how far into the entire text you are as an index.
es: ``absolute_index`` te dice dónde estás en el texto completo como un índice absoluto.

source: ``elapsed_time`` is the total amount of time the text effect has been running.
es: ``elapsed_time`` es la cantidad total de tiempo que el efecto de texto ha estado funcionando.

source: ``visible`` will tell you whether the character is visible or not and will also allow you to hide a given portion of text.
es: ``visible`` te dirá si el personaje es visible o no y también te permitirá ocultar una parte determinada del texto.

source: ``offset`` is an offset position relative to where the given character should render under normal circumstances.
es: ``offset`` es una posición de desplazamiento relativa a donde el carácter dado debe presentarse en circunstancias normales.

source: ``color`` is the color of a given character.
es: El ``color`` es el color de un personaje determinado.

source: Finally, ``env`` is a :ref:`class_Dictionary` of parameters assigned to a given custom effect. You can use :ref:`get() <class_Dictionary_method_get>` with an optional default value to retrieve each parameter, if specified by the user. For example ``[custom_fx spread=0.5 color=#FFFF00]test[/custom_fx]`` would have a float ``spread`` and Color ``color`` parameters in its ` `env`` Dictionary. See below for more usage examples.
es: Por último, ``env`` es un :ref:`class_Dictionary` de parámetros asignados a un efecto personalizado dado. Puede utilizar :ref:`get() <class_Dictionary_method_get>` con un valor predeterminado opcional para recuperar cada parámetro, si así lo especifica el usuario. Por ejemplo ``[custom_fx spread=0.5 color=#FFFF00]test[/custom_fx]`` tendría un parámetro real ``spread`` y de color ``color`` en su diccionario ``env``. Vea abajo para más ejemplos de uso.

source: The last thing to note about this function is that it is necessary to return a boolean ``true`` value to verify that the effect processed correctly. This way, if there's a problem with rendering a given character, it will back out of rendering custom effects entirely until the user fixes whatever error cropped up in their custom effect logic.
es: Lo último que hay que señalar de esta función es que es necesario devolver un valor booleano ``true`` para verificar que el efecto se procesó correctamente. De esta manera, si hay un problema con la renderización de un carácter dado, se retirará por completo de la renderización de los efectos personalizados hasta que el usuario arregle cualquier error surgido en su lógica de efectos personalizados.

source: Here are some examples of custom effects:
es: Aquí hay unos ejemplos de efectos personalizados:

source: Ghost
es: Fantasma

source: Pulse
es: Pulso

source: Matrix
es: Matriz

source: This will add a few new BBCode commands, which can be used like so:
es: Esto agregará unos nuevos comandos BBCode que pueden ser usados de este modo:
