Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/gui/gui_skinning.po
Languages: de, es, fr, ja, ru, zh_cn

source: If only a few controls need to be skinned, it is often not necessary to create a new theme. Controls offer their theme options as special kinds of properties. If checked, overriding will take place:
de: Wenn nur wenige Steuerelemente entworfen werden müssen, ist es häufig nicht erforderlich, ein neues Thema zu erstellen. Steuerelemente bieten ihre Themen-Optionen als spezielle Arten von Eigenschaften an. Wenn diese Option aktiviert ist, wird Folgendes überschrieben:
es: Si sólo hay que personalizar unos pocos controles, a menudo no es necesario crear un nuevo tema. Los controles ofrecen sus opciones de temas como tipos especiales de propiedades. Si están marcados, se anulan:
fr: Si seuls quelques contrôles doivent être personnalisés, il n'est souvent pas nécessaire de créer un nouveau thème. Les contrôles offrent leurs propres options de thème sous forme propriétés d'un type spécial. Lorsqu'elles sont cochées, le remplacement aura lieu :
ja: いくつかのコントロールのみをスキン化する必要がある場合、多くの場合、新しいテーマを作成する必要はありません。コントロールは、特別な種類のプロパティとしてテーマオプションを提供します。チェックをオンにすると、オーバーライドが行われます:
ru: Если требуется изменить внешний вид только для нескольких элементов управления, нет необходимости создавать новую тему. Каждый элемент управления предоставляет свои параметры для темы в виде отдельных свойств. Если такое свойство включено - оно будет использоваться вместо темы:
zh_cn: 如果只需要外观定制少数几个控件, 通常没有必要创建一个新主题. 控件提供其主题选项作为特殊类型的属性(在检查面板上). 一旦勾选, 覆写就会生效:

source: As can be seen in the image above, theme options have little check boxes. If checked, they can be used to override the value of the theme just for that control.
de: Wie im obigen Bild zu sehen ist, haben Themen-Optionen kleine Kontrollkästchen. Wenn diese Option aktiviert ist, können sie verwendet werden, um den Wert des Themas nur für dieses Steuerelement zu überschreiben.
es: Como se puede ver en la imagen de arriba, las opciones temáticas tienen pequeñas casillas de verificación. Si están marcadas, pueden usarse para anular el valor del tema sólo para ese control.
fr: Comme on peut le voir dans l'image ci-dessus, les options du thème ont de petites cases à cocher. Si elles sont cochées, elles peuvent être utilisées pour remplacer la valeur du thème juste pour ce control.
ja: 上の画像に見られるように、テーマオプションには小さなチェックボックスがあります。チェックされている場合、それらはコントロールのテーマの値をオーバーライドするために使用できます。
ru: Как видно на изображении выше, параметры в группах "Custom ..." имеют флажки-переключатели. Если такой флажок активировать, соответствующее свойство переопределит параметра темы для этого элемента управления.
zh_cn: 从上面的图片中可以看出, 主题选项有一些小复选框. 如果选中, 它们可以用来覆盖该控件的主题属性值.

source: Creating a theme
de: Ein Thema erstellen
es: Creando un tema
fr: Création d'un thème
ja: テーマの作成
ru: Создание темы
zh_cn: 创建主题

source: The simplest way to create a theme is to edit a theme resource. Create a Theme from the resource menu; the editor will appear immediately. After that, save it (for example, with the name mytheme.theme):
de: Der einfachste Weg, ein Thema zu erstellen, besteht darin, eine Themen-Ressource zu bearbeiten. Erstellen Sie ein Thema aus dem Ressourcenmenü; der Editor wird sofort angezeigt. Speichern Sie es anschließend (z.B. mit dem Namen mytheme.theme):
es: La forma más simple de crear un tema es editar un recurso temático. Crea un tema desde el menú de recursos; el editor aparecerá inmediatamente. Después de eso, guárdalo (por ejemplo, con el nombre mitema.tema):
fr: La façon la plus simple de créer un thème est d'éditer une ressource thème. Créez un Theme à partir du menu des ressources ; l'éditeur apparaîtra immédiatement. Après cela, enregistrez-le (par exemple, avec le nom mytheme.theme) :
ja: テーマを作成する最も簡単な方法は、テーマリソースを編集することです。リソースメニューからテーマを作成します。エディタがすぐに表示されます。その後、それを保存します(たとえば、mytheme.themeという名前で):
ru: Самый простой способ создать новую тему - отредактировать свойство Theme элемента управления. Выберите "New Theme" в выпадающем меню и появится редактор тем. После этого в том же выпадающем меню сохраните новую тему (например, с именем mytheme.theme):
zh_cn: 创建一个主题的最简单方法是编辑一个主题资源. 从资源菜单中创建一个主题；编辑器随之出现. 之后, 保存它 (例如, 名称为mytheme.theme):

source: This will create an empty theme that can later be loaded and assigned to controls.
de: Dadurch wird ein leeres Thema erstellt, das später geladen und Steuerelementen zugewiesen werden kann.
es: Esto creará un tema vacío que más tarde podrá ser cargado y asignado a los controles.
fr: Cela créera un thème vide qui pourra être chargé et assigné aux controls par la suite.
ja: これにより、後でコントロールに読み込んで割り当てることができる空のテーマが作成されます。
ru: Это создаст пустую тему, которую позже можно будет отредактировать и назначить другим элементам управления.
zh_cn: 这将创建一个空主题, 之后可以将其加载并分配给控件.

source: Example: theming a button
de: Beispiel: eine Schaltfäche entwerfen
es: Ejemplo: tematizar un botón
fr: Exemple : thème d'un bouton
ja: 例: ボタンのテーマ化
ru: Пример: создание темы для кнопок
zh_cn: 示例: 指定一个按钮的主题

source: Download these assets (:download:`skin_assets.zip <files/skin_assets.zip>`) and add them to your project. Open the theme editor, click on "Edit Theme" and select "Add Class Items":
de: Laden Sie diese Assets herunter (:download:`skin_assets.zip <files/skin_assets.zip>`) und fügen Sie sie Ihrem Projekt hinzu. Öffnen Sie den Themen-Editor, klicken Sie auf "Thema bearbeiten" und wählen Sie "Klassenelemente hinzufügen":
es: Descarga estos recursos (:download:`skin_assets.zip <files/skin_assets.zip>`) y agréguelos a su proyecto. Abre el editor de temas, haz clic en "Editar tema" y selecciona "Añadir Elementos de Clase":
fr: Téléchargez ces assets (:download:`skin_assets.zip <files/skin_assets.zip>`) et ajoutez les à votre projet. Ouvrez l'éditeur de thème, cliquez sur "Modifier le thème" ("Edit Theme" en anglais) et sélectionnez "Ajouter des objets de classe" ("Add Class Items") :
ja: これらのアセット(:download:`skin_assets.zip <files / skin_assets.zip>`)をダウンロードして、プロジェクトに追加します。テーマエディタを開き、 "Edit Theme" をクリックして、[クラスアイテム追加]を選択します:
ru: Загрузите набор ресурсов (:download:`skin_assets.zip <files/skin_assets.zip>`) и добавьте его в ваш проект. Откройте редактор тем и в меню "Edit Theme.." выберите "Add Class Items":
zh_cn: 下载这些资产(:download:`skin_assets.zip <files/skin_assets.zip>` )并将它们添加到你的项目中. 打开主题编辑器, 点击 "编辑主题", 选择 "Add Class Items" :

source: A menu will appear prompting the type of control to create. Select "Button":
de: Ein Menü wird angezeigt, in dem Sie aufgefordert werden, welche Art von Steuerelement erstellt werden soll. Wählen Sie "Schaltfläche":
es: Aparecerá un menú que indicará el tipo de control a crear. Seleccione "Botón":
fr: Un menu apparaîtra alors vous demendant le type de contrôle à créer. Sélectionnez "Bouton" ("Button") :
ja: 作成するコントロールのタイプを求めるメニューが表示されます。 "Button" を選択します:
ru: Появится окно выбора типа создаваемого элемента. Выберите "Button":
zh_cn: 然后将出现一个菜单, 提示要创建的控件类型. 选择 "Button":

source: Immediately, all button theme options will appear in the property editor, where they can be edited:
de: Sofort werden alle Optionen für Schaltflächendesigns im Eigenschafteneditor angezeigt, wo sie bearbeitet werden können:
es: Inmediatamente, todas las opciones del tema de los botones aparecerán en el editor de propiedades, donde pueden ser editadas:
fr: Immédiatement, toutes les options de thème du bouton apparaissent dans l'éditeur de propriétés, où elles peuvent être éditées :
ja: すぐに、すべてのボタンテーマオプションがプロパティエディタに表示され、そこで編集できます:
ru: Тема и её параметры, применимые для кнопок, появятся в инспекторе, где их можно будет редактировать:
zh_cn: 所有按钮主题选项都将立刻显示在属性面板中, 可以在其中进行编辑:

source: From ``Styles``, open the "Normal" drop-down menu next to where it probably says "null" and create a "New StyleBoxTexture", then edit it. A texture stylebox contains a texture and the size of the margins that will not stretch when the texture is stretched. This is called nine-patch or "3x3" stretching:
de: Öffnen Sie unter ``Styles`` das Dropdown-Menü "Normal" neben der Stelle, an der wahrscheinlich "null" steht, und erstellen Sie eine "Neue StyleBoxTexture", die Sie dann bearbeiten können. Eine Textur-Stylebox enthält eine Textur und die Größe der Ränder, die beim Strecken der Textur nicht gedehnt werden. Dies wird als Neuner-Muster oder "3x3"-Dehnung bezeichnet:
es: Desde ``Styles``, abre el menú desplegable "Normal" al lado de donde probablemente diga "null" y crea un "New StyleBoxTexture", luego edítalo. Un cuadro de estilo de textura contiene una textura y el tamaño de los márgenes que no se estirarán cuando la textura se estire. Esto se llama estiramiento de nueve parches o "3x3":
fr: A partir de ``Styles``, ouvrez le menu déroulant "Normal" à côté de l'endroit où il est probablement écrit "null" et créez un "New StyleBoxTexture", puis éditez-le. Une stylebox de texture contient essentiellement une texture et la taille des marges qui ne s'étireront pas lorsque la texture est étirée. Cela s'appelle nine-patch ou étirement "3x3" :
ru: В разделе "Styles" для параметра "Normal" откройте выпадающее меню (кнопка справа от параметра) и выберите в нём "New StyleBoxTexture", а затем откройте появившийся стиль, выбрав в том же меню "Редактировать". Вы необходимо указать текстуру и её размеры, а также размеры полей, которые не будут растягиваться при изменении размеров кнопки. Этот формат называется "9-patch" (дословно "девять лоскутов") или "растяжка 3 на 3":
zh_cn: 在 ``Styles`` 中，打开可能显示“空”旁边的“Normal”下拉菜单，选择“新建 StyleBoxTexture”，然后编辑。纹理样式盒包含一个纹理和边距的尺寸，当纹理被拉伸时，边距不会被拉伸。这就是所谓的九宫格或“3x3”拉伸：

source: Repeat the steps and add the other assets. There is no hover or disabled image in the example files, so use the same stylebox as in normal. Set the supplied font as the button font and change the font color to black. Soon, your button will look different and retro:
de: Wiederholen Sie die Schritte und fügen Sie die anderen Assets hinzu. In den Beispieldateien befindet sich kein schwebendes oder deaktiviertes Bild. Verwenden Sie daher dieselbe Stylebox wie im Normalfall. Stellen Sie die mitgelieferte Schriftart als Schaltflächenschriftart ein und ändern Sie die Schriftfarbe in Schwarz. Bald wird Ihre Schaltfläche anders und retro aussehen:
es: Repita los pasos y añada los otros activos. No hay ninguna imagen hover o desactivada en los archivos de ejemplo, así que utiliza el mismo cuadro de estilo que en el normal. Establezca la fuente suministrada como fuente de botón y cambie el color de la fuente a negro. Pronto, tu botón tendrá un aspecto diferente y retro:
fr: Répétez les étapes et ajoutez les autres assets. Il n'y a pas de survol ou d'image désactivée dans les fichiers d'exemple, donc utilisez la même stylebox que dans la version normale. Définissez la police fournie comme police de bouton et changez la couleur de la police en noir. Bientôt, votre bouton aura un aspect différent et rétro :
ja: 手順を繰り返して、他のアセットを追加します。サンプルファイルにはホバーまたは無効な画像がないため、通常と同じスタイルボックスを使用します。提供されたフォントをボタンのフォントとして設定し、フォントの色を黒に変更します。すぐに、ボタンはレトロな見ために変わります:
ru: Повторите эти шаги для оставшихся стилей. Среди файлов скачанного архива нет текстур для "Hover" и "Disabled", поэтому используйте те же, что и в "Normal". Установите шрифт из архива в качестве шрифта кнопки и измените его цвет на чёрный. Скоро ваши кнопки будет выглядеть по-другому, в стиле ретро:
zh_cn: 重复上述步骤并添加其他资源。示例文件中没有提供“Hover”和“Disabled”的图片，因此使用与“Normal”状态相同的样式盒。将提供的字体设置为按钮字体，并将字体颜色更改为黑色。很快地，你的按钮就看起来不同了，并且变得复古：

source: Save this theme to the .theme file. Go to the 2D editor and create a few buttons:
de: Speichern Sie dieses Thema in der .theme Datei. Gehen Sie zum 2D-Editor und erstellen Sie einige Schaltflächen:
es: Guarda este tema en el archivo .theme. Ve al editor 2D y crea algunos botones:
fr: Enregistrez ce thème dans le fichier .theme. Allez dans l'éditeur 2D et créez quelques boutons :
ja: このテーマを.themeファイルに保存します。 2Dエディタに移動して、いくつかのボタンを作成します:
ru: Сохраните свою тему в файле ``new_theme.theme``. Перейдите в 2D-редактор и создайте там несколько кнопок:
zh_cn: 把这个主题保存到 .theme文件中. 转到2D编辑器, 创建几个按钮:

source: Now, go to the root node of the scene and locate the "theme" property, replace it with the theme that was just created. It should look like this:
de: Gehen Sie nun zum Wurzel-Node der Szene und suchen Sie die Eigenschaft "theme". Ersetzen Sie sie durch das gerade erstellte Thema. Es sollte so aussehen:
es: Ahora, ve al nodo raíz de la escena y localiza la propiedad "theme", reemplázala por el tema que se acaba de crear. Debería verse así:
fr: Maintenant, allez au nœud racine de la scène et localisez la propriété "theme", remplacez-la par le thème qui vient d'être créé. Ça devrait ressembler à cela :
ja: 次に、シーンのルートノードに移動し、”Theme” プロパティを見つけて、作成したテーマに置き換えます。次のようになります:
ru: Теперь перейдите к корневому узлу сцены и измените свойство "Theme", установив в нём только что созданную тему. Это должно выглядеть примерно так:
zh_cn: 现在, 转到场景的根节点, 找到 "theme" 属性, 用刚刚创建的主题替换它. 它应该看起来像这样:

source: Congratulations! You have created a reusable GUI Theme!
de: Herzliche Glückwünsche! Sie haben ein wiederverwendbare GUI-Designvorlage bzw. GUI-Thema erstellt!
es: ¡Felicidades! ¡Has creado un tema GUI reutilizable!
fr: Félicitations ! Vous avez créé un thème GUI réutilisable !
ja: おめでとう！再利用可能なGUIテーマが作成されました！
ru: Получившуюся тему можно использовать и в других проектах, как обычный ресурс.
zh_cn: 恭喜咯！您已经创建了一个可反复使用的 GUI 主题!

source: In the example above, a new theme is created. The "font_color" option is changed and then applied to a label. As a result, the label (and all children and grandchildren labels) will use that color.
ja: 上記の例では、新しいテーマが作成されます。”font_color" オプションが変更され、ラベルに適用されます。その結果、ラベル(およびすべての子および孫ラベル)はその色を使用します。

source: In the inline help of Godot (in the script tab) you can check which theme options are overridable, or check the :ref:`Control <class_Control>` class reference.
ja: Godo のインライン ヘルプ(スクリプト タブ) で、オーバーライド可能なテーマ オプションを確認するか、\ :ref:`Control <class_Control>` クラスのリファレンスをチェックしてください。

source: From ``Styles``, open the "Normal" drop-down menu next to where it probably says "null" and create a "New StyleBoxTexture", then edit it. A texture stylebox basically contains a texture and the size of the margins that will not stretch when the texture is stretched. This is called "3x3" stretching:
ja: ``Styles`` 内で、"Normal" の横にある、おそらく[空]と表示されているドロップダウンメニューを開き、「新規 StyleBoxTexture」を作成して編集します。テクスチャスタイルボックスには、基本的にテクスチャと、テクスチャが引き伸ばされたときに引き伸ばされないマージンのサイズが含まれます。これは ”3x3" ストレッチングと呼ばれます:
