Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/gui/gui_skinning.po
Languages: de, es, fr, ja, ru, zh_cn

source: GUI skinning
de: GUI Aussehen
es: Skinning GUI
fr: Personnalisation de GUI
ja: GUIのスキン処理
ru: Внешний вид интерфейса
zh_cn: GUI 外观定制

source: Oh, beautiful GUI!
de: Oh, wunderschöne GUI!
es: ¡Oh, hermosa GUI!
fr: Oh, magnifique GUI !
ja: ああ、美しいGUI！
ru: О, красивые кнопочки!
zh_cn: 哦, 漂亮的GUI!

source: This tutorial is about advanced skinning of a user interface. Most games generally don't need this, as they end up just relying on :ref:`Label <class_Label>`, :ref:`TextureRect <class_TextureRect>`, :ref:`TextureButton <class_TextureButton>` and :ref:`TextureProgress <class_TextureProgress>`.
de: In dieser Anleitung geht es um das erweiterte Aussehen einer Benutzeroberfläche. Die meisten Spiele benötigen dies im Allgemeinen nicht, da sie sich nur auf Folgendes verlassen :ref:`Label <class_Label>`, :ref:`TextureRect <class_TextureRect>`, :ref:`TextureButton <class_TextureButton>` und :ref:`TextureProgress <class_TextureProgress>`.
es: Este tutorial trata sobre el revestimiento avanzado de la interfaz de usuario. La mayoría de los juegos generalmente no necesitan esto, ya que terminan confiando en :ref:`Label <class_Label>`, :ref:`TextureRect <class_TextureRect>`, :ref:`TextureButton <class_TextureButton>` y :ref:`TextureProgress <class_TextureProgress>`.
fr: Ce tutoriel concerne le skinning avancé d'une interface utilisateur. La plupart des jeux n'ont généralement pas besoin de cela, car ils s'appuient simplement sur des nœuds de type :ref:`Label <class_Label>`, :ref:`TextureRect <class_TextureRect>`, :ref:`TextureButton <class_TextureButton>` et :ref:`TextureProgress <class_TextureProgress>`.
ru: Этот урок посвящён изменению внешнего вида пользовательского интерфейса. Большинство игр, как правило, не нуждаются в этом, так как в конечном итоге просто полагаются на :ref:`Label <class_Label>`, :ref:`TextureRect <class_TextureRect>`, :ref:`TextureButton <class_TextureButton>` и :ref:`TextureProgress <class_TextureProgress>`.
zh_cn: 本教程是关于用户界面的高级外观定制. 大多数游戏一般不需要这个, 因为他们最终只依赖 :ref:`Label <class_Label>`, :ref:`TextureRect <class_TextureRect>`, :ref:`TextureButton <class_TextureButton>` 和 :ref:`TextureProgress <class_TextureProgress>`.

source: However, many types of games often need complex user interfaces, like MMOs, traditional RPGs, Simulators, Strategy, etc. These kinds of interface are also common in some games that include editors to create content, or interfaces for network connectivity.
de: Viele Arten von Spielen benötigen jedoch häufig komplexe Benutzeroberflächen, wie MMOs, traditionelle Rollenspiele, Simulationen, Strategiespiele usw. Diese Arten von Schnittstellen sind auch in einigen Spielen üblich, wie Editoren zum Erstellen von Inhalten oder Schnittstellen für die Netzwerkverbindung.
es: Sin embargo, muchos tipos de juegos suelen necesitar interfaces de usuario complejas, como los MMO, los juegos de rol tradicionales, los simuladores, la estrategia, etc. Estos tipos de interfaz también son comunes en algunos juegos que incluyen editores para crear contenido, o interfaces para la conectividad de la red.
fr: Cependant, de nombreux types de jeux nécessitent souvent des interfaces utilisateur complexes, comme les MMO, les RPG traditionnels, les simulateurs, les jeux de stratégie, etc. Ces types d'interface sont également courants dans certains jeux qui incluent des éditeurs pour créer du contenu, ou des interfaces pour la connectivité réseau.
ja: ただし、多くの種類のゲームでは、MMO、従来のRPG、シミュレーター、戦略などの複雑なユーザーインターフェイスが必要になることがよくあります。これらの種類のインターフェイスは、コンテンツを作成するエディタやネットワーク接続用のインターフェイスを含む一部のゲームでも一般的です。
ru: Однако некоторые жанры игр, такие как ММО, РПГ, симуляторы и стратегии, предполагают довольно сложный GUI. Также это касается игр, содержащих редактор для создания контента или интерфейс для подключения к сети.
zh_cn: 然而, 许多类型的游戏往往需要复杂的用户界面, 如MMO, 传统RPG, 模拟, 战略等. 这类界面在一些游戏中也很常见, 包括创建内容的编辑器, 或网络连接的界面.

source: Godot's user interface uses these kinds of control with the default theme, but they can be skinned to resemble pretty much any kind of user interface.
de: Die Benutzeroberfläche von Godot verwendet diese Art der Steuerung mit dem Standardthema, sie kann jedoch so gestaltet werden, dass sie so ziemlich jeder Art von Benutzeroberfläche ähnelt.
es: La interfaz de usuario de Godot utiliza estos tipos de control con el tema predeterminado, pero se pueden adaptar para que se asemejen a cualquier tipo de interfaz de usuario.
fr: L'interface utilisateur de Godot utilise ces types de contrôle avec le thème par défaut, mais ils peuvent être personnalisés pour ressembler à peu près à n'importe quel type d'interface utilisateur.
ja: Godotのユーザーインターフェイスは、デフォルトテーマでこれらの種類のコントロールを使用しますが、それらは、ほぼすべての種類のユーザーインターフェイスに似せてスキン化できます。
ru: Пользовательский интерфейс в Godot использует элементы управления с темой по умолчанию, но она может быть изменена так, чтобы любой элемент выглядел так, как вам нравится.
zh_cn: Godot的用户界面使用了这些带有默认主题的控件, 但它们可以被换上皮肤, 以类似于几乎任何类型的用户界面.

source: Theme
de: Designvorlagen (Thema)
es: Tema
fr: Thème
ja: テーマ
ru: Тема
zh_cn: 主题

source: The GUI is skinned through the :ref:`Theme <class_Theme>` resource. Theme contains all the information required to change the entire visual styling of all controls. Theme options are named, so it's not obvious which name changes what (especially from code), but several tools are provided. The ultimate place to look at what each theme option is for each control, which will always be more up to date than any documentation, is the file `scene/resources/default_theme/default_theme.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/default_theme/default_theme.cpp>`__. The rest of this document will explain the different tools used to customize the theme.
de: Das Aussehen der GUI wird durch die Ressource :ref:`Theme <class_Theme>` bestimmt. Diese Designvorlage (Thema) enthält alle Informationen, die erforderlich sind, um das gesamte visuelle Design aller Steuerelemente zu ändern. Die Themen-Optionen sind benannt, daher ist es nicht offensichtlich, welcher Name was ändert (besondere im Code), es werden jedoch mehrere Tools hierfür bereitgestellt. Der ultimative Ort, um zu sehen, welche Themen-Optionen wofür zuständig sind, ist die Datei `scene/resources/default_theme/default_theme.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/default_theme/default_theme.cpp>`__ (diese ist auch immer aktueller als jede Dokumentation). Im weiteren werden die verschiedenen Tools zum Anpassen des Themas erklärt.
es: La GUI se muestra a través del recurso :ref:`Theme <class_Theme>`. El tema contiene toda la información necesaria para cambiar el estilo visual de todos los controles. Las opciones del tema se nombran, así que no es obvio qué nombre cambia qué (especialmente del código), pero se proporcionan varias herramientas. El lugar definitivo para ver qué es cada opción de tema para cada control, que siempre estará más actualizado que cualquier documentación, es el archivo `scene/resources/default_theme/default_theme.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/default_theme/default_theme.cpp>`__. En el resto de este documento se explicarán las diferentes herramientas utilizadas para personalizar el tema.
fr: L'interface graphique est personnalisée via la ressource :ref:`Theme <class_Theme>`. Le thème contient toutes les informations nécessaires pour modifier l'intégralité du style visuel de tous les contrôles. Les options de thème sont nommées, il n'est donc pas évident de savoir quel nom change quoi (en particulier à partir du code), mais plusieurs outils sont fournis. L'endroit ultime pour voir quelle est chaque option de thème pour chaque contrôle, qui sera toujours plus à jour que toute documentation, est le fichier `scene/resources/default_theme/default_theme.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/default_theme/default_theme.cpp>`__. Le reste de ce document explique les différents outils utilisés pour personnaliser le thème.
ja: GUIは :ref:`Theme <class_Theme>` リソースを通じてスキン化されています。テーマには、すべてのコントロールの視覚的なスタイル全体を変更するために必要なすべての情報が含まれています。テーマオプションには名前が付けられているため、どの名前が(特にコードから)何を変更するかは明確ではありませんが、いくつかのツールが提供されています。各コントロールの各テーマオプションが何であるかを確認する究極の場所は、どのドキュメントよりも常に最新である、\ `scene/resources/default_theme/default_theme.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/default_theme/default_theme.cpp>`__ ファイルです。このドキュメントの残りの部分では、テーマのカスタマイズに使用されるさまざまなツールについて説明します。
ru: GUI изменяется с помощью ресурса :ref:`Theme <class_Theme>`. Тема содержит всю информацию, необходимую для визуализации всех элементов управления. Хотя параметры темы проименованы, иногда (особенно из кода) бывает не очевидно, что именно нужно изменить, поэтому для работы с темами предусмотрено несколько инструментов. В крайнем случае вы можете посмотреть файл `scene/resources/default_theme/default_theme.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/default_theme/default_theme.cpp>`__, чтобы понять назначение тех или иных свойств - этот файл всегда будет актуальнее, чем любая документация. В следующих разделах будут описаны инструменты, которые вы можете использовать для настройки темы.
zh_cn: GUI通过 :ref:`Theme <class_Theme>` 资源进行外观定制. 主题包含改变所有控件的整体样式所需的所有信息. 主题选项是命名的, 所以哪个名称更改什么并不明显(尤其是从代码中), 但提供了几个工具. 查看每个控件的每个主题选项的最终地方是 `scene/resources/default_theme/default_theme.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/default_theme/default_theme.cpp>`__ 文件, 它总是比任何文档都更新及时. 本文档的其余部分将说明用于定制主题的不同工具.

source: A Theme can be applied to any control in the scene. As a result, all children and grand-children controls will use that same theme, too (unless another theme is specified further down the tree). If a value is not found in a theme, it will be searched in themes higher up in the hierarchy, towards the root. If nothing was found, the default theme is used. This system allows for flexible overriding of themes in complex user interfaces.
de: Ein Thema kann auf jedes Steuerelement in der Szene angewendet werden. Infolgedessen verwenden auch alle untergeordneten Steuerelemente dasselbe Thema (es sei denn, ein anderes Thema wird weiter unten im Baum angegeben). Wenn ein Wert in einem Thema nicht gefunden wird, wird in Themen weiter oben in der Hierarchie in Richtung der Wurzel gesucht. Wenn nichts gefunden wurde, wird das Standardthema verwendet. Dieses System ermöglicht das flexible Überschreiben von Themen in komplexen Benutzeroberflächen.
es: El tema puede aplicarse a cualquier control en la escena. Como resultado, todos los controles de niños y nietos utilizarán también ese mismo tema (a menos que se especifique otro tema más abajo en el árbol). Si no se encuentra un valor en un tema, se buscará en los temas más altos de la jerarquía, hacia la raíz. Si no se encuentra nada, se utiliza el tema predeterminado. Este sistema permite la anulación flexible de temas en interfaces de usuario complejas.
fr: Un thème peut être appliqué à n'importe quel control de la scène. Par conséquent, tous les controls enfants et petits-enfants utiliseront également ce même thème (à moins qu'un autre thème ne soit spécifié plus bas dans l'arbre). Si une valeur n'est pas trouvée dans un thème, elle sera recherchée dans les thèmes plus haut dans la hiérarchie, vers la racine. Si rien n'a été trouvé, le thème par défaut est utilisé. Ce système permet une superposition flexible de thèmes dans des interfaces utilisateur complexes.
ja: テーマは、シーン内の任意のコントロールに適用できます。その結果、すべての子コントロールと孫コントロールも同じテーマを使用します(ツリーの下で別のテーマが指定されていない限り)。テーマで値が見つからない場合、ルートに向かって階層の上位のテーマで検索されます。何も見つからなかった場合、デフォルトのテーマが使用されます。このシステムにより、複雑なユーザーインターフェイスでテーマを柔軟にオーバーライドできます。
ru: Тема может быть применена к любому элементу управления в сцене. В результате все дочерние элементы управления также будут использовать эту тему (если только для них не будет назначена другая). Если какой-либо параметр не будет найден в текущей теме, Godot попытается найти его в темах выше по иерархии (ближе к корню). Если же ничего не найдено, будет применена тема по умолчанию. Такая система позволяет гибко настраивать темы в сложных пользовательских интерфейсах.
zh_cn: 一个主题可以应用于场景中的任何控件. 因此, 所有的子级和孙级控件也将使用相同的主题, 除非在树的下面指定了另一个主题. 如果在一个主题中没有找到一个值, 那么它将在层次结构中朝着根的方向高层主题中搜索. 如果没有找到, 则使用默认主题. 当前系统允许在复杂的用户界面中灵活地重写主题.

source: Don't use the custom theme option in the Project Settings, as there are known bugs with theme propagation. Instead, apply your theme to the root Control node's Theme property. It will propagate to instanced scenes automatically. To get correct theming in the editor for instanced scenes, you can apply the theme resource to the instanced scene's root node as well.
de: Verwenden Sie die benutzerdefinierte Themen-Option nicht in den Projekteinstellungen, da Fehler bei der Weitergabe von Themen bekannt sind. Wenden Sie Ihr Thema stattdessen auf die Thema-Eigenschaft des Wurzel-Kontroll-Nodes an. Es wird automatisch auf instanziierte Szenen übertragen. Um korrekte Themen im Editor für instanziierte Szenen zu erhalten, können Sie die Themenressource auch auf den Wurzel-Node der instanziierten Szene anwenden.
es: No uses la opción de tema personalizado en la configuración del proyecto, ya que hay errores conocidos de propagación del tema. En su lugar, aplica tu tema a la propiedad Theme del nodo de control raíz. Se propagará a las escenas instanciadas automáticamente. Para obtener la temática correcta en el editor de escenas instanciadas, también puedes aplicar el recurso del tema al nodo raíz de la escena instanciada.
fr: N'utilisez pas l'option de thème personnalisé dans les paramètres du projet, car il existe des bogues connus de propagation des thèmes. Appliquez plutôt votre thème à la propriété Theme du nœud de contrôle racine. Il se propagera automatiquement aux scènes instanciées. Pour obtenir une thématisation correcte dans l'éditeur pour les scènes instanciées, vous pouvez également appliquer la ressource de thème au nœud racine de la scèneinstanciée.
ru: Не используйте опцию "GUI/Theme/Custom" в настройках проекта, так как существуют известные ошибки с распространением темы. Вместо этого назначьте свою тему в свойстве Theme корневого узла Control. Это автоматически распространит тему на прикреплённые дочерние сцены во время работы игры. Однако чтобы темы правильно работали для прикреплённых сцен и в редакторе, вам необходимо также назначить тему для корневого узла каждой прикреплённой сцены.
zh_cn: 不要使用 Project Settings 中的自定义主题选项, 因为主题传播存在已知的错误. 取而代之的是, 将你的主题应用到根控制节点的主题属性中. 它将自动传播到实例场景中. 要想在编辑器中获得正确的实例场景主题, 你还可以将主题资源也应用到实例场景的根节点.

source: Theme options
de: Themen-Optionen
es: Opciones de temas
fr: Options de thèmes
ja: テーマのオプション
ru: Параметры темы
zh_cn: 主题选项

source: Each kind of option in a theme can be:
de: Ein Thema bietet folgende Optionen:
es: Cada tipo de opción en una plantilla puede ser:
fr: Chaque type d'option dans un thème peut être :
ja: テーマ内のオプションの種類は次のとおりです:
ru: Каждый параметр темы может быть:
zh_cn: 一个主题中的每种选项可以是：

source: **An integer constant**: A single numerical constant. Generally used to define spacing between components or alignment.
de: **Eine ganzzahlige Konstante**: Eine einzelne numerische Konstante. Wird im Allgemeinen verwendet, um den Abstand zwischen Komponenten oder die Ausrichtung zu definieren.
es: **Una constante entera**: Una única constante numérica. Generalmente se usa para definir el espacio entre componentes o la alineación.
fr: **Une constante entière** : Une seule constante numérique. Généralement utilisé pour définir l'espacement entre les composants ou l'alignement.
ja: **整数定数**: 単一の数値定数。通常、コンポーネント間の間隔または配置を定義するために使用されます。
ru: **целочисленной константой** - обычно используется для определения расстояний между компонентами или для выравнивания;
zh_cn: **整数常量** ：一个数值常量，一般用于定义组件的间距和对齐相关设置。

source: **A Color**: A single color, with or without transparency. Colors are usually applied to fonts and icons.
de: **Eine Farbe**: Eine einzelne Farbe mit oder ohne Transparenz. Farben werden normalerweise auf Schriftarten und Symbole angewendet.
es: **A Color**: Un solo color, con o sin transparencia. Los colores se aplican generalmente a las fuentes e iconos.
fr: **Une Couleur** : Une seule couleur, avec ou sans transparence. Les couleurs sont généralement appliquées aux polices et aux icônes.
ja: **色**: 透過の有無にかかわらず、単色。通常、色はフォントとアイコンに適用されます。
ru: **цветом**, с прозрачностью или без - обычно применяется к шрифтам и иконкам;
zh_cn: **颜色** ：单一颜色，具不具备透明度皆可。颜色通常应用于字体和图标。

source: **A Texture**: A single image. Textures are not often used, but when they are, they represent handles to pick or icons in a complex control (such as a file dialog).
de: **Eine Textur**: Ein einzelnes Bild. Texturen werden nicht oft verwendet, aber wenn dies der Fall ist, stellen sie zu wählende Handles oder Symbole in einem komplexen Steuerelement (z. B. einem Dateidialog) dar.
es: **A Texture**: Una sola imagen. Las texturas no se usan a menudo, pero cuando lo hacen, representan manijas para elegir o iconos en un control complejo (como un diálogo de archivo).
fr: **Une texture** : Une seule image. Les textures ne sont pas souvent utilisées, mais lorsqu'elles le sont, elles représentent des poignées à sélectionner ou des icônes dans un contrôle complexe (comme une boîte de dialogue de fichier).
ja: **テクスチャ**: 単一の画像。テクスチャはあまり使用されませんが、使用される場合は、選択用のハンドルまたは複雑なコントロール(ファイルダイアログなど)のアイコンを表します。
ru: **текстурой** - используется редко, обычно в качестве маркера выбора или иконки в составном элементе управления (таком как диалог выбора файла);
zh_cn: **纹理** ：一个单独的图像。纹理并不经常使用，但当它们被使用时，表示复杂控件中的选取手柄或图标（如文件对话框）。

source: **A Font**: Every control that uses text can be assigned the fonts used to draw strings.
de: **Eine Schriftart**: Jedem Steuerelement, das Text verwendet, können die zum Zeichnen von Zeichenfolgen verwendeten Schriftarten zugewiesen werden.
es: **A Font**: A cada control que usa texto se le pueden asignar las fuentes utilizadas para dibujar las strings.
fr: **Une Police** : Chaque control qui utilise du texte peut se voir attribuer les polices utilisées pour dessiner les chaînes de caractères.
ja: **フォント**: テキストを使用するすべてのコントロールには、文字列の描画に使用されるフォントを割り当てることができます。
ru: **шрифтом** - применяется в каждом элементе управления, который отображает текст;
zh_cn: **字体** ：每个使用文本的控件都可以设置字体用于绘制字符串。

source: **A StyleBox**: Stylebox is a resource that defines how to draw a panel in varying sizes (more information on them later).
de: **Eine StyleBox**: Stylebox ist eine Ressource, die definiert, wie ein Bedienfeld in verschiedenen Größen gezeichnet wird (weitere Informationen dazu später).
es: **A StyleBox**: Stylebox es un recurso que define cómo dibujar un panel en varios tamaños (más información sobre ellos más adelante).
fr: **Un StyleBox** : Stylebox est une ressource qui définit comment dessiner un panneau de différentes tailles (plus d'informations à ce sujet plus tard).
ja: **StyleBox **: Styleboxは、さまざまなサイズでパネルを描画する方法を定義するリソースです(詳細については後で説明します)。
ru: **StyleBox** - ресурс, определяющий вид элемента при различных размерах (позже об этом будет сказано подробнее).
zh_cn: **样式盒** ：样式盒（Stylebox）是一种资源，用以定义如何绘制不同大小的面板（更多信息见下文）。

source: Every option is associated with:
de: Jede Wahlmöglichkeit (Option) ist verbunden mit:
es: Cada opción está asociada con:
fr: Chaque option est associée à :
ja: すべてのオプションは、次の項目と関連付けられています:
ru: Каждый параметр темы определяется:
zh_cn: 每个选项都与以下内容关联:

source: A name (the name of the option)
de: einem Namen (Name der Option)
es: Un nombre (el nombre de la opción)
fr: Un nom (le nom de l'option)
ja: 名前(オプションの名前)
ru: именем этого параметра;
zh_cn: 名称 (选项的名称)

source: A Control (the name of the control)
de: einer Kontrolle (Name der Kontrolle)
es: A Control (el nombre del control)
fr: Un Control (le nom du control)
ja: コントロール(コントロールの名前)
ru: типом элемента управления, к которому он относится.
zh_cn: 控件 (控件的名称)

source: An example usage:
de: ein Beispiel:
es: Un ejemplo de uso:
fr: Un exemple d'utilisation :
ja: 使用例:
ru: Пример использования:
zh_cn: 示例用法:

source: In the example above, a new theme is created. The "font_color" option is changed and then applied to a label. Therefore, the label's text (and all children and grandchildren labels) will be red.
de: Im obigen Beispiel wird ein neues Thema erstellt. Die Option "font_color" wird geändert und dann auf ein Label angewendet. Daher ist der Text des Labels (und aller untergeordneten Elemente) rot.
es: En el ejemplo anterior, se crea un nuevo tema. Se cambia la opción "font_color" y se aplica a una etiqueta. Por lo tanto, el texto de la etiqueta (y todas las etiquetas de los hijos y nietos) será rojo.
fr: Dans l'exemple ci-dessus, un nouveau thème est créé. L'option "font_color" est modifiée puis appliquée à un label. Par conséquent, le label (et touts les labels enfants et petits-enfants) utilisera cette couleur.
ru: В этом примере создаётся новая тема "theme". В ней определяется параметр "font_color" для элементов типа "Label", а затем тема применяется к новому элементу "label". В результате текст этого элемента (а так же дочерних элементов) будет красным.
zh_cn: 在上面的例子中, 一个新主题被创建."font_color" 选项被改变, 然后应用于一个标签. 进而, 该标签的文本以及所有子级和孙级标签, 将是红色.

source: It is possible to override those options without using the theme directly, and only for a specific control, by using the override API in :ref:`Control.add_color_override() <class_Control_method_add_color_override>`:
de: Es ist möglich, diese Optionen zu überschreiben, ohne das Thema direkt und auch nur für ein bestimmtes Steuerelement zu verwenden, indem Sie die Überschreibungs-API verwenden in :ref:`Control.add_color_override() <class_Control_method_add_color_override>`:
es: Es posible anular esas opciones sin usar el tema directamente, y sólo para un control específico, usando la API de anulación en :ref:`Control.add_color_override() <class_Control_method_add_color_override>`:
fr: Il est possible de surcharger ces options sans utiliser directement le thème, et seulement pour un control spécifique, en utilisant l'API de surchargement dans :ref:`Control.add_color_override() <class_Control_method_add_color_override>` :
ja: :ref:`Control.add_color_override() <class_Control_method_add_color_override>` のオーバーライドAPIを使用することにより、テーマを直接使用せずに、特定のコントロールに対してだけ、これらのオプションをオーバーライドすることもできます。
ru: Этот же параметр можно изменить только для конкретного элемента управления и без прямого использования темы с помощью функции переопределения :ref:`Control.add_color_override() <class_Control_method_add_color_override>`:
zh_cn: 通过使用 :ref:`Control.add_color_override() <class_Control_method_add_color_override>` 中的重写API, 可以在不直接使用主题的情况下覆盖这些选项, 这只针对特定的控件:

source: In the inline help of Godot (in the Script tab), you can check which theme options are overridable, or check the :ref:`Control <class_Control>` class reference.
de: In der Inline-Hilfe von Godot (auf der Registerkarte "Skript") können Sie überprüfen, welche Themen-Optionen überschrieben werden können, oder sehen Sie in der Klassenreferenz :ref:`Control <class_Control>` nach.
es: En la ayuda en línea de Godot (en la pestaña Script), puede verificar qué opciones de tema son reemplazables, o verificar la referencia de clase :ref:`Control <class_Control>`.
fr: Dans l'aide en ligne de Godot (dans l'onglet script), vous pouvez vérifier quelles options du thème sont surchargeables, ou vérifier la référence de la classe :ref:`Control <class_Control>`.
ru: Во встроенном справочнике Godot (на вкладке Script) вы можете проверить, какие параметры темы могут быть переопределены; также вы можете найти эту информацию в описании класса :ref:`Control <class_Control>`.
zh_cn: 在Godot的内置帮助中(在脚本选项卡中), 你可以查看哪些主题选项是可重写的, 或者查看 :ref:`Control <class_Control>` 类的参考.

source: Customizing a control
de: Anpassen eines Steuerelements
es: Personalizando un control
fr: Personnalisation d'un contrôle
ja: コントロールのカスタマイズ
ru: Настройка элементов управления
zh_cn: 自定义控件
