Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/real_time_navigation_3d.po
Languages: de, fr, zh_cn

source: Real Time Navigation (3D)
de: Echtzeit-Navigation (3D)
zh_cn: 实时导航（3D）

source: Introduction
de: Einführung
zh_cn: 前言

source: Godot provides two nodes which can be used to achieve real time navigation in a 3D environment, :ref:`Navigation <class_Navigation>` and :ref:`NavigationMeshInstance <class_NavigationMeshInstance>`.
de: Godot bietet zwei Nodes, die für die Echtzeitnavigation in einer 3D-Umgebung verwendet werden können: :ref:`Navigation <class_Navigation>` und :ref:`NavigationMeshInstance <class_NavigationMeshInstance>`.
zh_cn: Godot 针对 3D 环境中的实时导航的实现提供了两个节点：\ :ref:`Navigation <class_Navigation>` 和 :ref:`NavigationMeshInstance <class_NavigationMeshInstance>`\ 。

source: A navigation mesh instance is used to hold a :ref:`NavigationMesh <class_NavigationMesh>`, which defines what areas in a scene can be navigated to. The :ref:`Navigation <class_Navigation>` node is then used for pathfinding with the navigation mesh.
de: Eine Navigations-Mesh-Instanz wird verwendet, um ein :ref:`NavigationMesh <class_NavigationMesh>` zu halten, das definiert, zu welchen Bereichen in einer Szene navigiert werden kann. Der :ref:`Navigation <class_Navigation>`-Node wird dann für die Pfadfindung mit dem Navigations-Mesh verwendet.
zh_cn: 导航网格（\ :ref:`NavigationMesh <class_NavigationMesh>`\ ）由导航网格实例（NavigationMeshInstance）持有 ，用于定义场景中的可导航区域。导航（\ :ref:`Navigation <class_Navigation>`\ ）节点根据导航网格进行寻路。

source: Setting up navigation
de: Einrichten der Navigation
zh_cn: 设置导航

source: To add navigation to a scene you need to add a navigation node, then a navigation mesh instance as a child of the navigation node. With the navigation mesh instance selected you need to go to the inspector and create a new navigation mesh.
de: Um eine Navigation zu einer Szene hinzuzufügen, müssen Sie einen Navigations-Node und dann eine Navigations-Mesh-Instanz als Kind des Navigations-Nodes hinzufügen. Wenn die Navigations-Mesh-Instanz ausgewählt ist, müssen Sie zum Inspektor gehen und ein neues Navigations-Mesh erstellen.
zh_cn: 要在场景中加入导航功能，你需要添加一个导航节点，然后为导航节点添加导航网格实例作为子节点。选中导航网格实例后，再在检查器中新建导航网格。

source: Click on the navigation mesh and you can now alter the properties that define how the navigation mesh is generated. You can find a full description for each of the properties in the class reference here: :ref:`NavigationMesh <class_NavigationMesh>`.
de: Klicken Sie auf das Navigations-Mesh und Sie können nun die Eigenschaften ändern, die die Erzeugung dieses Mesh festlegen. Eine vollständige Beschreibung der einzelnen Eigenschaften finden Sie in der Klassenreferenz: :ref:`NavigationMesh <class_NavigationMesh>`.
zh_cn: 点击导航网格后，你就可以通过调整其属性来控制导航网格的生成方式。你可以在 :ref:`NavigationMesh <class_NavigationMesh>` 的类参考手册中找到每个属性的完整说明。

source: After making the changes you want the mesh can be generated by clicking **Bake NavMesh** in the toolbar.
de: Nachdem Sie die gewünschten Änderungen vorgenommen haben, können Sie das Mesh erstellen, indem Sie in der Symbolleiste auf **NavMesh erstellen** klicken.
zh_cn: 调整完后，就可以点击工具栏上的\ **烘焙导航网格**\ 来生成网格。

source: Once the mesh has finished generating you should see the transparent navigation mesh above the areas in your scene that can be navigated to.
de: Sobald das Mesh fertig generiert ist, sollten Sie das transparente Navigations-Mesh über den Bereichen in Ihrer Szene sehen, zu denen navigiert werden kann.
zh_cn: 网格生成完后，你就能在场景中可以进行导航的位置上方看到半透明的导航网格了。

source: Keep in mind that the navmesh shows where the center of an entity can go. For example, if you set the agent radius to 0.5 then your navigation mesh will have a distance of 0.5 from any ledges or walls to prevent clipping into the wall or hanging off of the edge.
de: Beachten Sie, dass das Navmesh anzeigt, wo der Mittelpunkt eines Objekts liegen kann. Wenn Sie z.B. den Agentenradius auf 0,5 einstellen, dann hat Ihr Navigations-Mesh einen Abstand von 0,5 zu Vorsprüngen oder Wänden, um zu verhindern, dass es in die Wand rein ragt oder an einer Kante hängen bleibt.
zh_cn: 请注意，导航网格显示的是实体中心点所能到达的位置。例如，如果你将 agent radius 设为 0.5，那么你的导航网格与台阶或者墙壁之间就会有 0.5 的距离，防止穿进墙壁或从边缘掉下。

source: Generating a path
de: Erzeugen eines Pfades
zh_cn: 生成路径

source: To get a path between two areas on a map you use the navigation node method ``get_simple_path()``. The first argument is a Vector3 of the starting location, the next is a Vector3 of the end location. And the last argument is a boolean for whether or not agent properties of a navmesh are considered when generating a path.
de: Um einen Pfad zwischen zwei Bereichen auf einer Karte zu erhalten, verwendet man die Navigations-Node-Methode ``get_simple_path()``. Das erste Argument ist ein Vector3 für die Startposition, das nächste ein Vector3 für die Endposition. Das letzte Argument ist ein Boolescher Wert, der angibt, ob Agenten-Eigenschaften eines Navmeshs bei der Erstellung eines Pfades berücksichtigt werden oder nicht.
zh_cn: 要在地图上获取两个区域之间的路径，你可以使用导航节点的 ``get_simple_path()`` 方法。第一个参数是表示起始位置的 Vector3，接下来是表示结束位置的 Vector3。最后一个参数是一个布尔值，表示是否需要在生成路径时考虑 agent 属性。

source: The method will return a :ref:`PoolVector3Array <class_PoolVector3Array>` consisting of points that make a path. If there is no way to navigate to the end location the method will return a blank :ref:`PoolVector3Array <class_PoolVector3Array>`.
de: Die Methode gibt ein :ref:`PoolVector3Array <class_PoolVector3Array>` zurück, das aus Punkten besteht, die einen Pfad bilden. Wenn es keine Möglichkeit gibt, zum Endpunkt zu navigieren, gibt die Methode ein leeres :ref:`PoolVector3Array <class_PoolVector3Array>` zurück.
zh_cn: 该方法返回的是一个 :ref:`PoolVector3Array <class_PoolVector3Array>`\ ，由路径上的点组成。如果无法导航至结束位置，该方法会返回一个空 :ref:`PoolVector3Array <class_PoolVector3Array>`\ 。

source: Official example project
de: Offizielles Beispielprojekt
zh_cn: 官方示例项目

source: There is an official example project on how to use 3D navigation. You can find the repository `here <https://github.com/godotengine/godot-demo-projects/tree/master/3d/navmesh>`__. It can also be found in the asset library.
de: Es gibt ein offizielles Beispielprojekt für die Verwendung der 3D-Navigation. Sie können das Repository `hier <https://github.com/godotengine/godot-demo-projects/tree/master/3d/navmesh>`__ oder in der Asset-Bibliothek finden.
zh_cn: 官方有针对如何使用 3D 导航的示例项目，仓库在\ `这里 <https://github.com/godotengine/godot-demo-projects/tree/master/3d/navmesh>`__\ ，在素材库中也能找到。

source: Real Time Navigation (3D)
fr: Navigation en Temps Réel (3D)

source: Godot provides two nodes which can be used to achieve real time navigation in a 3D environment, :ref:`Navigation <class_Navigation>` and :ref:`NavigationMeshInstance <class_NavigationMeshInstance>`.
fr: Godot fournit deux nœuds qui peuvent être utilisés pour réaliser une navigation en temps réel dans un environnement 3D, :ref:`Navigation <class_Navigation>` et :ref:`NavigationMeshInstance <class_NavigationMeshInstance>`.

source: A navigation mesh instance is used to hold a :ref:`NavigationMesh <class_NavigationMesh>`, which defines what areas in a scene can be navigated to. The :ref:`Navigation <class_Navigation>` node is then used for pathfinding with the navigation mesh.
fr: Une instance de maillage de navigation est utilisée pour contenir un :ref:`NavigationMesh <class_NavigationMesh>`, qui définit les zones d'une scène vers lesquelles on peut naviguer. Le nœud :ref:`Navigation <class_Navigation>` est ensuite utilisé pour le pathfinding avec le maillage de navigation.

source: Setting up navigation
fr: Configurer la navigation

source: To add navigation to a scene you need to add a navigation node, then a navigation mesh instance as a child of the navigation node. With the navigation mesh instance selected you need to go to the inspector and create a new navigation mesh.
fr: Pour ajouter la navigation à une scène, vous devez ajouter un nœud de navigation, puis une instance de maillage de navigation comme enfant du nœud de navigation. Une fois l'instance de maillage de navigation sélectionnée, vous devez aller dans l'inspecteur et créer un nouveau maillage de navigation.

source: Click on the navigation mesh and you can now alter the properties that define how the navigation mesh is generated. You can find a full description for each of the properties in the class reference here: :ref:`NavigationMesh <class_NavigationMesh>`.
fr: Cliquez sur le maillage de navigation et vous pouvez maintenant modifier les propriétés qui définissent comment le maillage de navigation est généré. Vous pouvez trouver une description complète de chacune des propriétés dans la référence de la classe ici : :ref:`NavigationMesh <class_NavigationMesh>`.

source: After making the changes you want the mesh can be generated by clicking **Bake NavMesh** in the toolbar.
fr: Après avoir effectué les modifications souhaitées, le maillage peut être généré en cliquant sur **Bake NavMesh** dans la barre d'outils.

source: Once the mesh has finished generating you should see the transparent navigation mesh above the areas in your scene that can be navigated to.
fr: Une fois la génération du maillage terminée, vous devriez voir le maillage de navigation transparent au-dessus des zones de votre scène vers lesquelles vous pouvez naviguer.

source: Keep in mind that the navmesh shows where the center of an entity can go. For example, if you set the agent radius to 0.5 then your navigation mesh will have a distance of 0.5 from any ledges or walls to prevent clipping into the wall or hanging off of the edge.
fr: Gardez à l'esprit que le maillage de navigation indique où le centre d'une entité peut aller. Par exemple, si vous définissez le rayon de l'agent à 0,5, votre maillage de navigation sera à une distance de 0,5 de tout rebord ou mur afin d'éviter de s'accrocher au mur ou de se suspendre au bord.

source: Generating a path
fr: Générer un chemin

source: To get a path between two areas on a map you use the navigation node method ``get_simple_path()``. The first argument is a Vector3 of the starting location, the next is a Vector3 of the end location. And the last argument is a boolean for whether or not agent properties of a navmesh are considered when generating a path.
fr: Pour obtenir un chemin entre deux zones sur une carte, vous utilisez la méthode du noeud de navigation ``get_simple_path()``. Le premier argument est un Vector3 de l'emplacement de départ, le suivant est un Vector3 de l'emplacement d'arrivée. Et le dernier argument est un booléen qui indique si les propriétés de l'agent d'un navmesh sont prises en compte ou non lors de la génération d'un chemin.

source: The method will return a :ref:`PoolVector3Array <class_PoolVector3Array>` consisting of points that make a path. If there is no way to navigate to the end location the method will return a blank :ref:`PoolVector3Array <class_PoolVector3Array>`.
fr: La méthode retournera un :ref:`PoolVector3Array <class_PoolVector3Array>` constitué de points qui forment un chemin. S'il n'y a aucun moyen de naviguer jusqu'à l'emplacement final, la méthode renverra un :ref:`PoolVector3Array <class_PoolVector3Array>` vide.

source: Official example project
fr: Exemple de projet officiel

source: There is an official example project on how to use 3D navigation. You can find the repository `here <https://github.com/godotengine/godot-demo-projects/tree/master/3d/navmesh>`__. It can also be found in the asset library.
fr: Il existe un projet d'exemple officiel sur la façon d'utiliser la navigation 3D. Vous pouvez trouver le dépôt `ici <https://github.com/godotengine/godot-demo-projects/tree/master/3d/navmesh>`__. Vous pouvez également le trouver dans la bibliothèque d'asset.

source: Translation status
fr: État de la traduction
