Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/c_sharp/c_sharp_features.po
Languages: fr, ja

source: C# features
fr: Fonctionnalités C#

source: This page provides an overview of the commonly used features of both C# and Godot and how they are used together.
fr: Cette page donne un aperçu des fonctionnalités couramment utilisées de C# et de Godot, et de la façon dont elles sont utilisées ensemble.
ja: このページでは、C#とGodotの両方で一般的に使用される機能の概要と、それらの併用方法について説明します。

source: Type conversion and casting
fr: Conversion de type et Casting
ja: 型変換とキャスト

source: C# is a statically typed language. Therefore, you can't do the following:
fr: C# est un langage à typage statique. Par conséquent, vous ne pouvez pas faire ce qui suit :
ja: C#は静的に型指定された言語です。したがって、次の操作は実行できません:

source: The method ``GetNode()`` returns a ``Node`` instance. You must explicitly convert it to the desired derived type, ``Sprite`` in this case.
fr: La méthode ``GetNode()`` retourne une instance de ``Node``. Vous devez explicitement la convertir dans le type dérive que vous désirez. Dans cet exemple, il s'agit de ``Sprite``.
ja: メソッド ``GetNode()`` は ``Node`` インスタンスを返します。この場合は、明示的に目的の派生型 ``Sprite`` に変換する必要があります。

source: For this, you have various options in C#.
fr: Pour cela, en C#, vous disposez de plusieurs options.
ja: このために、C#にはさまざまなオプションがあります。

source: **Casting and Type Checking**
fr: **Casting et vérification de type**
ja: \ **キャストと型チェック**

source: Throws ``InvalidCastException`` if the returned node cannot be cast to Sprite. You would use it instead of the ``as`` operator if you are pretty sure it won't fail.
fr: Envoie ``InvalidCastException`` si le nœud retourné ne peut pas être concertit en Sprite. Utilisez le à la place de l'opérateur ``as`` si vous êtes presque sûr qu'il n'échouera pas.
ja: 返されたNodeをSpriteにキャストできない場合は、 ``InvalidCastException`` をスローします。失敗しないと確信している場合は、\ ``as`` 演算子の代わりにキャストを使用します。

source: **Using the AS operator**
fr: **Utilisation de l'opérateur AS**
ja: \ **AS演算子の使用**

source: The ``as`` operator returns ``null`` if the node cannot be cast to Sprite, and for that reason, it cannot be used with value types.
fr: L'opérateur ``as`` retourne ``null`` si le nœud ne peut pas être convertit en Sprite, et pour cette raison il ne peut pas être utilisé avec les types de valeurs.
ja: NodeをSpriteにキャストできない場合、\ ``as`` 演算子は ``null`` を返します。そのため、値型では使用できません。

source: **Using the generic methods**
fr: **Utilisation des méthodes génériques**
ja: **汎用メソッドを使用**

source: Generic methods are also provided to make this type conversion transparent.
fr: Des méthodes génériques sont également fournies pour rendre ce type de conversion transparent.
ja: この型変換を透過的にするための汎用メソッドも提供されています。

source: ``GetNode<T>()`` casts the node before returning it. It will throw an ``InvalidCastException`` if the node cannot be cast to the desired type.
fr: ``GetNode <T> ()`` convertit le nœud avant de le retourner. Il enverra une ``InvalidCastException`` si le nœud ne peut pas être converti au type désiré.
ja: ``GetNode<T>()`` は、ノードを返す前にノードをキャストします。ノードを目的の型にキャストできない場合は、\ ``InvalidCastException`` がスローされます。

source: ``GetNodeOrNull<T>()`` uses the ``as`` operator and will return ``null`` if the node cannot be cast to the desired type.
fr: ``GetNodeOrNull<T>()`` utilise l'opérateur ``as`` et retourne ``null`` si le nœud ne peut pas être converti au type désiré.
ja: ``GetNodeOrNull<T>()`` は ``as`` 演算子を使用し、ノードを目的の型にキャストできない場合は ``null`` を返します。

source: **Type checking using the IS operator**
fr: **Vérification du type à l'aide de l'opérateur IS**
ja: **IS演算子を使用した型チェック**

source: To check if the node can be cast to Sprite, you can use the ``is`` operator. The ``is`` operator returns false if the node cannot be cast to Sprite, otherwise it returns true.
fr: Pour vérifier si le nœud peut être convertit en Sprite, vous pouvez utiliser l'opérateur ``is``. L'opérateur ``is`` retourne false si le nœud ne peut pas être convertit en Sprite, sinon il retourne true.
ja: ノードをSpriteにキャストできるかどうかを確認するには、 ``is`` 演算子を使用できます。\ ``is`` 演算子は、ノードをSpriteにキャストできない場合はfalseを返し、できる場合はtrueを返します。

source: For more advanced type checking, you can look into `Pattern Matching <https://docs.microsoft.com/en-us/dotnet/csharp/pattern-matching>`_.
fr: Pour un contrôle de type plus avancé, vous pouvez regarder dans `Pattern Matching <https://docs.microsoft.com/en-us/dotnet/csharp/pattern-matching>`_.
ja: より高度な型チェックについては、 `パターンマッチング<https://docs.microsoft.com/ja-jp/dotnet/csharp/pattern-matching>` で調べることができます。

source: C# signals
fr: Signaux C#
ja: C#シグナル

source: For a complete C# example, see the **Handling a signal** section in the step by step :ref:`doc_scripting` tutorial.
fr: Pour un exemple complet en C#, voir la section **Manipuler un signal** dans le tutoriel Pas à pas :ref:`doc_scripting`.
ja: 完全なC#の例については、チュートリアル \ :ref:`doc_scripting` の\ **Handling a signal**\ を参照してください。

source: Declaring a signal in C# is done with the ``[Signal]`` attribute on a delegate.
fr: Déclarer un signal en C# se fait avec l'attribut ``[Signal]`` sur un delegate.
ja: C#でシグナルを宣言するには、デリゲートの ``[Signal]`` 属性を使います。

source: These signals can then be connected either in the editor or from code with ``Connect``. If you want to connect a signal in the editor, you need to (re)build the project assemblies to see the new signal. This build can be manually triggered by clicking the “Build” button at the top right corner of the editor window.
fr: Ces signaux peuvent ensuite être connectés soit dans l'éditeur, soit à partir du code avec ``Connect``. Si vous souhaitez connecter un signal dans l'éditeur, vous devez (re)construire les assemblys du projet pour voir le nouveau signal. Cela peut être déclenché manuellement en cliquant sur le bouton "Construire" dans le coin supérieur droit de la fenêtre de l'éditeur.
ja: これらのシグナルは、エディタまたは ``Connect`` を持つコードから接続することができます。エディタでシグナルを接続する場合は、新しいシグナルを表示するためにプロジェクトアセンブリを(再)ビルドする必要があります。このビルドは、エディタウィンドウの右上隅にある [ビルド] ボタンをクリックして手動でトリガーできます。

source: Emitting signals is done with the ``EmitSignal`` method.
fr: L'émission de signaux se fait avec la méthode ``EmitSignal``.
ja: シグナルの発信は ``EmitSignal`` メソッドで行われます。

source: Notice that you can always reference a signal name with the ``nameof`` keyword (applied on the delegate itself).
fr: Notez que vous pouvez toujours faire référence à un nom de signal avec le mot-clé ``nameof`` (appliqué sur le délégué lui-même).
ja: シグナル名はいつでも `` nameof`` キーワードで参照できることに注意してください(デリゲート自体に適用されます)。

source: It is possible to bind values when establishing a connection by passing a Godot array.
fr: Il est possible de lier des valeurs lors de l'établissement d'une connexion en passant un tableau Godot.

source: Signals support parameters and bound values of all the `built-in types <https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/built-in-types-table>`_ and Classes derived from :ref:`Godot.Object <class_Object>`. Consequently, any ``Node`` or ``Reference`` will be compatible automatically, but custom data objects will need to extend from `Godot.Object` or one of its subclasses.
fr: Les signaux supportent les paramètres et les valeurs liées de tous les `types intégrés <https://docs.microsoft.com/fr-fr/dotnet/csharp/language-reference/keywords/built-in-types-table>`_ et les classes dérivées de :ref:`Godot.Object <class_Object>`. Par conséquent, tout ``Node`` ou ``Reference`` sera automatiquement compatible mais les objets de données personnalisés devront hériter de `Godot.Object` ou l'une de ses sous-classes.
ja: シグナルは、すべての `組み込み型<https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/built-in-types-table>` と :ref:`Godot.Object <class_Object>` から派生したクラスのパラメーターとバインド値をサポートします。。したがって、すべての ``Node`` または ``Reference`` は自動的に互換性がありますが、カスタムデータオブジェクトは `Godot.Object` またはそのサブクラスの1つから拡張する必要があります。

source: Finally, signals can be created by calling ``AddUserSignal``, but be aware that it should be executed before any use of said signals (with ``Connect`` or ``EmitSignal``).
fr: Enfin, les signaux peuvent être créés en appelant ``AddUserSignal``, mais sachez que celui-ci doit être exécuté avant toute utilisation desdits signaux (avec ``Connect`` ou ``EmitSignal``).
ja: 最後に、シグナルは ``AddUserSignal`` を呼び出すことで作成できますが、シグナルを使用する前に(``Connect`` または ``EmitSignal`` を使って)実行する必要があることに注意してください。

source: Preprocessor defines
fr: Définition Préprocesseur
ja: プリプロセッサ定義

source: Godot has a set of defines that allow you to change your C# code depending on the environment you are compiling to.
fr: Godot a un jeu de "defines" permettant de changer de code C# selon l’environnement pour lequel vous compilez.
ja: Godotには、コンパイルする環境に応じてC#コードを変更できる一連の定義があります。

source: If you created your project before Godot 3.2, you have to modify or regenerate your `csproj` file to use this feature (compare ``<DefineConstants>`` with a new 3.2+ project).
fr: Si vous avez créé votre projet avant Godot 3.2, vous devez modifier ou re-générer votre fichier `csproj` pour utiliser cette fonctionnalité (comparez ``<DefineConstants>`` avec un nouveau projet 3.2+).
ja: Godot 3.2より前にプロジェクトを作成した場合、この機能を使用するには、\ `csproj` ファイルを変更または再生成する必要があります (``<DefineConstants>`` を新しい3.2+プロジェクトと比較してください)。

source: Examples
fr: Exemples
ja: 例

source: For example, you can change code based on the platform:
fr: Par exemple, vous pouvez changer de code, selon la plateforme :
ja: たとえば、プラットフォームに基づいてコードを変更できます:

source: Or you can detect which engine your code is in, useful for making cross-engine libraries:
fr: Ou vous pouvez détecter quel moteur votre code utilise, utile pour créer des librairies cross-engine :
ja: または、コードがどのエンジンにあるかを検出できます。これは、クロスエンジンライブラリを作成するのに役立ちます:

source: Full list of defines
fr: Liste complète des définitions
ja: 定義の完全なリスト

source: ``GODOT`` is always defined for Godot projects.
fr: ``GODOT`` est toujours défini dans un project Godot.
ja: Godotプロジェクトでは、\ ``GODOT`` が常に定義されています。

source: One of ``GODOT_64`` or ``GODOT_32`` is defined depending on if the architecture is 64-bit or 32-bit.
fr: ``GODOT_64`` ou ``GODOT_32`` est défini selon que l'architecture est 64-bit ou 32-bit.
ja: アーキテクチャが64ビットか32ビットかによって、\ ``GODOT_64`` または ``GODOT_32`` のいずれかが定義されます。

source: One of ``GODOT_X11``, ``GODOT_WINDOWS``, ``GODOT_OSX``, ``GODOT_ANDROID``, ``GODOT_IOS``, ``GODOT_HTML5``, or ``GODOT_SERVER`` depending on the OS. These names may change in the future. These are created from the ``get_name()`` method of the :ref:`OS <class_OS>` singleton, but not every possible OS the method returns is an OS that Godot with Mono runs on.
fr: ``GODOT_X11``, ``GODOT_WINDOWS``, ``GODOT_OSX``, ``GODOT_ANDROID``, ``GODOT_IOS``, ``GODOT_HTML5``, ou ``GODOT_SERVER`` est défini selon l'OS. Ces noms sont éventuellement amenés à changer dans le futur. Ils sont créer depuis la méthode ``get_name()`` du singleton :ref:``OS <class_OS>``, mais tous les OS potentiellement retournés ne sont pas des OS sur lesquels Godot peut fonctionner avec Mono.

source: When **exporting**, the following may also be defined depending on the export features:
fr: Quand vous **exportez**, les choses suivantes peuvent également être définies selon les caractéristiques d'exportation :
ja: **エクスポート** する場合、エクスポート機能に応じて以下も定義できます:

source: One of ``GODOT_PC``, ``GODOT_MOBILE``, or ``GODOT_WEB`` depending on the platform type.
fr: Un des ``GODOT_PC``, ``GODOT_MOBILE``, ou ``GODOT_WEB`` selon le type de plateforme.
ja: プラットフォームの種類に応じて、\ ``GODOT_PC``\ 、\ ``GODOT_MOBILE``\ 、または ``GODOT_WEB`` のいずれか。

source: One of ``GODOT_ARM64_V8A`` or ``GODOT_ARMEABI_V7A`` on Android only depending on the architecture.
fr: Un des ``GODOT_ARM64_V8A`` ou ``GODOT_ARMEABI_V7A`` sur Android seulement, selon l'architecture.
ja: アーキテクチャにのみ依存するAndroid上の ``GODOT_ARM64_V8A`` または ``GODOT_ARMEABI_V7A`` のいずれか。

source: One of ``GODOT_ARM64`` or ``GODOT_ARMV7`` on iOS only depending on the architecture.
fr: Un de ``GODOT_ARM64`` ou ``GODOT_ARMV7`` sur iOS uniquement en fonction de l'architecture.

source: Any of ``GODOT_S3TC``, ``GODOT_ETC``, and ``GODOT_ETC2`` depending on the texture compression type.
fr: N’importe lequel de ``GODOT_S3TC``, ``GODOT_ETC``, et ``GODOT_ETC2`` selon le type de compression des textures.

source: Any custom features added in the export menu will be capitalized and prefixed: ``foo`` -> ``GODOT_FOO``.
fr: Toute caractéristique ajoutée dans le menu d'exportation sera capitalisée et préfixée : ``foo`` -> ``GODOT_FOO``.
ja: エクスポートメニューに追加されたカスタム機能はすべて大文字になり、接頭辞が付けられます: ``foo`` → ``GODOT_FOO``\ 。

source: To see an example project, see the OS testing demo: https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test
fr: Pour voir un projet d’exemple, voyez la démo de système d’exploitation de test : https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test

source: It is possible to bind values when establishing a connection by passing an object array.
ja: オブジェクト配列を渡すことで、接続を確立するときに値をバインドできます。
