Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/c_sharp/c_sharp_basics.po
Languages: es, fr, ja, ko, pt_br, ru, uk, zh_tw

source: C# support in Godot's script editor is minimal. Consider using an external IDE or editor, such as `Visual Studio Code <https://code.visualstudio.com/>`_ or MonoDevelop. These provide autocompletion, debugging, and other useful features for C#. To select an external editor in Godot, click on **Editor → Editor Settings** and scroll down to **Mono**. Under **Mono**, click on **Editor**, and select your external editor of choice. Godot currently supports the following external editors:
es: El soporte de C# en el editor de scripts de Godot es mínimo. Considera utilizar un IDE o editor externo como `Visual Studio Code <https://code.visualstudio.com/>`_ o MonoDevelop. Estos proporcionan autocompletado, depuración y otras características útiles para C#. Para seleccionar un editor externo en Godot, haz clic en **Editor → Ajustes del Editor** y ve hacia abajo hasta **Mono**. En **Mono**, haz clic en **Editor** y selecciona el editor externo que desees. Godot soporta actualmente los siguientes editores externos:
fr: Le support du C# dans l'éditeur de script de Godot est minimal. Envisagez d'utiliser un IDE ou un éditeur externe, tel que Microsoft `Visual Studio Code <https://code.visualstudio.com/>`_, ou MonoDevelop. Ceux-ci fournissent l'auto-complétion, le débogage et d'autres fonctionnalités utiles lorsque vous travaillez avec C#. Pour sélectionner un éditeur externe dans Godot, cliquez sur **Éditeur → Paramètres de l'éditeur** et faites défiler vers le bas, jusqu'aux réglages **Mono**. Sous **Mono**, cliquez sur **Éditeur**, et sur cette page, choisissez l'éditeur externe de votre choix. Godot supporte actuellement les éditeurs externes suivants :
ja: GodotのスクリプトエディタでのC#のサポートは最小限です。外部IDEまたはエディタの使用を検討してください。これらは、C#のオートコンプリート、デバッグ、およびその他の便利な機能を提供します。Godotで外部エディタを選択するには、 **エディタ → エディタ設定** をクリックし、 **Mono** まで下にスクロールします。 **Mono** で、 **Editor** をクリックし、外部エディタを選択します。Godotは現在、次の外部エディタをサポートしています。
ru: В то время как Godot имеет собственный редактор скриптов, его поддержка C# минимальна; вместо этого рекомендовано использовать отдельную IDE или редактор, такой как `Visual Studio Code <https://code.visualstudio.com/>`_ или MonoDevelop. Они поддерживают авто-завершение кода, отладку и другие возможности полезные при разработке на C#. Для установки их в Godot, кликните по **Editor → Editor Settings** и прокрутите вниз к настройкам **Mono**. Под **Mono**, кликните по **Editor** и выберите внешний редактор на выбор:
uk: Підтримка C# в редакторі скриптів Godot мінімальна. Подумайте про використання зовнішнього IDE, або редактора, наприклад `Visual Studio Code<https://code.visualstudio.com/>`_ або MonoDevelop. Вони забезпечують автоматичне завершення, налагодження та інші корисні функції для C#. Щоб вибрати зовнішній редактор у Godot, натисніть **Редактор → Параметри редактора** та прокрутіть униз до **Mono**. У розділі **Mono** натисніть на **Editor**(Редактор) та виберіть зовнішній редактор на вибір. На даний момент Godot підтримує такі зовнішні редактори:

source: Visual Studio for Mac
fr: Visual Studio pour Mac
pt_br: Visual Studio para Mac
ru: Visual Studio для MacOS
uk: Visual Studio для Mac
zh_tw: Mac 版 Visual Studio

source: If you are using Visual Studio Code, ensure you download and install the `C# extension <https://marketplace.visualstudio.com/items?itemName=ms-vscode.csharp>`_ to enable features like syntax highlighting and IntelliSense.
es: Si usas Visual Studio Code, asegúrate de descargar e instalar la extensión de `C# <https://marketplace.visualstudio.com/items?itemName=ms-vscode.csharp>`_ para habilitar características como el resaltado de sintaxis y el IntelliSense.
fr: Si vous utilisez Visual Studio Code, assurez-vous bien que vous téléchargiez et installiez l'`extension C# <https://marketplace.visualstudio.com/items?itemName=ms-vscode.csharp>`_ pour permettre des fonctionnalités telles que IntelliSense et la surbrillance du code.
ja: Visual Studio Codeを使用している場合は、構文の強調表示やIntelliSenseなどの機能を有効にするために、必ず `C# extension <https://marketplace.visualstudio.com/items?itemName=ms-vscode.csharp>` をダウンロードしてインストールしてください。
ru: Если вы используете Visual Studio Code, убедитесь что загрузили и установили `C# расширение <https://marketplace.visualstudio.com/items?itemName=ms-vscode.csharp>`_ для включения подсветки синтаксиса и IntelliSense.
uk: Якщо ви використовуєте Visual Studio Code, переконайтеся, що ви завантажили та встановили `розширення C#<https://marketplace.visualstudio.com/items?itemName=ms-vscode.csharp>`_ , щоб увімкнути такі функції, як підсвічування синтаксису та IntelliSense.

source: If you are using Visual Studio 2019, you must follow the instructions found in the "Configure VS2019 for Debugging" section below.
fr: Si vous utilisez Visual Studio 2019, vous devez suivre les instructions figurant dans la section "Configurez VS2019 for Debugging" ci-dessous.
ja: Visual Studio 2019を使用している場合は、以下の「VS2019をデバッグ用に構成する」セクションに記載されている指示に従う必要があります。
uk: Якщо ви використовуєте Visual Studio 2019, ви повинні дотримуватися інструкцій, наведених нижче у розділі "Налаштування VS2019 для налагодження".

source: Creating a C# script
es: Creando un script de C#
fr: Création d'un script C#
ja: C#スクリプトの作成
ko: C# 스크립트 만들기
pt_br: Criando um script C#
ru: Создание C# скрипта
uk: Створення скрипту C#
zh_tw: 建立 C# 腳本

source: After you successfully set up C# for Godot, you should see the following option when selecting ``Attach script`` in the context menu of a node in your scene:
fr: Après avoir configuré avec succès C# pour Godot, vous devriez voir l'option suivante lorsque vous sélectionnez ``Attacher un script`` dans le menu contextuel d'un nœud de votre scène :
ja: Godot用にC#を正常に設定した後、シーン内のノードのコンテキストメニューで ``Attach script`` を選択すると、次のオプションが表示されます。
uk: Після успішного встановлення C# для Godot, ви маєте побачити наступний варіант при виборі ``Долучити скрипт вузла``:

source: Note that while some specifics change, most concepts work the same when using C# for scripting. If you're new to Godot, you may want to follow the tutorials on :ref:`doc_scripting` at this point. While some places in the documentation still lack C# examples, most concepts can be transferred easily from GDScript.
es: Observaras que, aunque algunos elementos específicos cambian, la mayoría funciona de la misma manera al usar C# para escribir código. Si estás comenzando con Godot, quizás sea buena idea en este momento mirar los tutoriales en :ref:`doc_scripting`. Aunque es cierto que algunas partes de la documentación no contiene ejemplos en C#, la mayoría de los ejemplos son fácilmente transferibles desde GDScript.
fr: Notez que bien que certaines spécificités changent, la plupart des choses fonctionnent de la même façon lorsque vous utilisez C# pour coder. Si vous êtes nouveau sur Godot, vous pouvez consulter les tutoriels sur :ref:`doc_scripting` à ce stade. Bien que certains endroits dans la documentation manquent encore d'exemples C#, la plupart des choses peuvent être facilement transposées à partir de GDScript.
ja: 一部の仕様は変更されますが、スクリプトにC#を使用する場合でも、ほとんどの概念はGDScriptと同じように機能することに注意してください。Godotを初めて使用する場合は、この時点で :ref:`doc_scripting` のチュートリアルに従うことをお勧めします。ドキュメント内のいくつかの場所にはまだC#の例が欠けていますが、ほとんどの概念はGDScriptから簡単に移行できます。
pt_br: Observe que, embora alguns detalhes sejam alterados, a maioria dos conceitos funcionam da mesma maneira quando se usa o C# para criação de scripts. Se você é novo no Godot, você pode querer examinar os tutoriais em :ref:`doc_scripting` neste ponto. Enquanto alguns lugares na documentação ainda não tenham exemplos de C#, a maioria dos conceitos podem ser facilmente transferidos do GDScript.
ru: Заметьте что хотя некоторые особенности изменились, большинство остались теми же во время использования C# для скриптинга. Если вы новичок в Godot, вы возможно захотите поизучать руководства из :ref:`doc_scripting` на этом месте. Тогда как в некоторых местах документации ещё отсутствуют примеры для C#, большинство концептов могут быть легко перенесены из GDScript.
uk: Зауважте, що хоча деякі специфіки змінилися, більшість концепцій, при використанні C# для скриптів, залишаються тими самими. Якщо ви новачок у Godot, ви, можливо, захочете познайомитися із уроками :ref:`doc_scripting`. Хоча в деяких місцях документації ще не вистачає прикладів C#, більшість концепцій можна легко перенести з GDScript.
zh_tw: 請注意，雖然某些功能不同，但使用 C# 撰寫腳本時大部分概念都一樣。若還不熟悉 Godot，則建議您先閱讀 :ref:`doc_scripting` 中的教學。雖然文件中的某些部分還沒有 C# 範例，但大部分概念都很容易從 GDScript 轉過來。

source: Project setup and workflow
es: Ajustes del proyecto y flujo de trabajo
fr: Mise en place du projet et flux de travail
ja: プロジェクトの設定とワークフロー
ko: 프로젝트 설정과 작업 흐름
pt_br: Configuração de projeto e fluxo de trabalho
ru: Настройка проекта и рабочего процесса
uk: Налаштування проекту та робочий процес
zh_tw: 專案設定與工作流程

source: When you create the first C# script, Godot initializes the C# project files for your Godot project. This includes generating a C# solution (``.sln``) and a project file (``.csproj``), as well as some utility files and folders (``.mono`` and ``Properties/AssemblyInfo.cs``). All of these but ``.mono`` are important and should be committed to your version control system. ``.mono`` can be safely added to the ignore list of your VCS. When troubleshooting, it can sometimes help to delete the ``.mono`` folder and let it regenerate.
es: Cuando creas el primer script en C#, Godot inicializa los archivos de proyecto de C# para tu proyecto actual. Esto incluye generar una solución C# (``.sln``) y un archivo de proyecto (``.csproj``) y también algunas utilidades y carpetas (``.mono``, y algunas veces ``Properties/AssemblyInfo.cs``). Todos estos salvo ``.mono`` son importantes y deben formar parte de tu sistema de control de versiones. ``.mono`` se puede añadir a la lista de ignorados de tu VCS. Cuando hay problemas, algunas veces ayuda borrar la carpeta ``.mono`` y dejar que se vuelva a generar.
fr: Lorsque vous créez le premier script C#, Godot initialise les fichiers de projet C# pour votre projet Godot. Cela inclut la génération d'une solution C# (``.sln``) et d'un projet (``.csproj``) ainsi que de certains fichiers et dossiers utilitaires (``.mono`` et ``Properties/AssemblyInfo.cs``). Tous ces fichiers sauf ``.mono`` sont importants et doivent être conservés dans votre système de contrôle de version. ``.mono`` peut être ajouté en toute sécurité à la liste des ignorés de votre système de contrôle de version. Lors du dépannage, il est parfois utile de supprimer le dossier ``.mono`` et de le laisser se régénérer.
ja: 最初のC#スクリプトを作成すると、GodotはGodotプロジェクトのC#プロジェクトファイルを初期化します。これには、C#ソリューション(``.sln``)とプロジェクトファイル(``.csproj``)の生成、およびいくつかのユーティリティファイルとフォルダ(``.mono`` および ``Properties/AssemblyInfo.cs``)の生成が含まれます。 ``.mono`` を除くこれらすべては重要であり、バージョン管理システム(VCS)にコミットする必要があります。 ``.mono`` は、VCSの無視リストに安全に追加できます。 ``.mono`` フォルダを削除して再生成すると、トラブルシューティングの際に役立つ場合があります。
pt_br: Quando você cria o primeiro script C#, o Godot inicializa os arquivos de projeto C# para seu projeto Godot. Isto inclui gerar uma solução C# (``.sln``) e um arquivo de projeto (``.csproj``) assim como alguns arquivos e pastas de utilitários (``.mono``, as vezes ``Properties/AssemblyInfo.cs``). Todos estes, exceto ``.mono``, são importantes e devem ser mantidos em seu sistema de controle de versão. O ``.mono`` pode ser adicionado com segurança à lista de ignorados do seu VCS. Para solucionar problemas, às vezes pode ajudar excluir a pasta ``.mono`` e deixá-la regenerar.
ru: Когда вы создали ваш первый скрипт C#, Godot инициализирует его проектными файлами C# для вашего проекта. Это включает генерацию решения(solution) C# (``.sln``) и проектного файла (``.csproj``), а также создаются ещё некоторые файлы и папки (``.mono`` и ``Properties/AssemblyInfo.cs``). Все они (кроме ``.mono``) важны и должны быть включены в вашу систему контроля версий. ``.mono`` можно спокойно добавить в лист исключений вашего VCS. Когда вы ищите проблему, иногда может помочь удаление папки ``.mono`` которая затем самовосстановится.
uk: Під час створення першого скрипту C# Godot ініціалізує файли проекту C# для вашого проекту Godot. Сюди входить генерація рішення C# (``.sln``) та файлу проекту (``.csproj``), а також деякі утилітні файли та папки (``.mono`` та ``Properties/AssemblyInfo.cs``). Все це, але ``.mono`` важливе і має бути присвячене вашій системі контролю версій. ``.mono`` можна безпечно додати до списку ігнорування вашого VCS. Під час усунення несправностей іноді може допомогти видалення папки ``.mono``, вона мала б само-відновитись.
zh_tw: 建立第一個 C# 腳本後，Godot 會為目前的 Godot 專案初始化 C# 專案檔。包含產生 C# 解決方案 (``.sln``) 與專案檔 (``.csproj``)、以及一些公用檔案與資料夾 (``.mono`` 與 ``Properties/AssemblyInfo.cs``)。這些檔案除了 ``.mono`` 之外都很重要，且應該被認可 (Commit) 至版本控制系統中。``.mono`` 可以安全地新增到 VCS 中的忽略列表內，有時候可能會需要刪除 ``.mono`` 資料夾並讓 Godot 重新產生。

source: Note that currently, there are some issues where Godot and the C# project don't stay in sync; if you delete, rename or move a C# script, the change may not be reflected in the C# project file. In cases like this, you will have to edit the C# project file manually.
fr: Notez qu'il y a actuellement des problèmes où le projet Godot et le projet C# ne restent pas synchronisés ; si vous supprimez, renommez ou déplacez des choses comme des scripts ou des nœuds, il se peut qu'ils ne correspondent plus dans le fichier du projet C#. Dans ce cas, il peut être utile d'éditer manuellement le fichier de projet C#.
ja: 現在、GodotとC#プロジェクトの同期が維持されないといういくつかの問題があります。 C#スクリプトを削除、名前変更、または移動した場合、変更がC#プロジェクトファイルに反映されない場合があります。このような場合、C#プロジェクトファイルを手動で編集する必要があります。

source: For example, if you created a script (e.g. ``Test.cs``) and delete it in Godot, compilation will fail because the missing file is still expected to be there by the C# project file. For now, you can simply open up the ``.csproj`` file and look for the ``ItemGroup``, there should be a line included like the following:
fr: Exemple : Si vous avez créé un script (par exemple ``Test.cs``) et que vous le supprimez dans Godot, la compilation échouera parce que le fichier manquant est toujours attendu par le fichier de projet C#. Vous pouvez pour l'instant simplement ouvrir le ``.csproj`` et chercher ``ItemGroup``, il devrait y avoir une ligne incluse comme ce qui suit :
ja: たとえば、スクリプト (例:``Test.cs``) を作成してGodotで削除した場合、C#プロジェクトファイル上では削除されたファイルがまだ存在することになっているため、コンパイルは失敗します。 この時点で単純に ``.csproj`` ファイルを開いて ``ItemGroup`` を探すと、次のような行が含まれているはずです。

source: Simply remove that line and your project should build correctly again. Same for renaming and moving things, simply rename and move them in the project file if needed.
fr: Enlevez simplement cette ligne et votre projet devrait à nouveau compiler correctement. De même pour renommer et déplacer des choses, il suffit de les renommer et de les déplacer dans le fichier projet si nécessaire.
ja: その行を削除するだけで、プロジェクトは再び正しくビルドされます。対象の名前を変更して移動する場合も同様です。必要に応じてプロジェクトファイル内の名前も変更して移動します。

source: Example
es: Ejemplo
fr: Exemple
ja: 例
ko: 예제
pt_br: Exemplo
ru: Пример
uk: Приклад
zh_tw: 範例

source: Here's a blank C# script with some comments to demonstrate how it works.
es: Aquí hay un script C# en blanco con algunos comentarios para demostrar cómo funciona.
fr: Voici un script C# vierge avec quelques commentaires pour montrer comment il fonctionne.
ja: 以下に、空白のC#スクリプトと、その動作を示すコメントを示します。
ko: 여기 몇 가지 주석으로 작업이 이루어지는 방법을 설명하는 공백 C# 스크립트가 있습니다.
pt_br: Aqui está um script C# em branco com alguns comentários para demonstrar como funciona.
ru: Это пустой C# скрипт с некоторыми комментариями, чтобы продемонстрировать, как он работает.
uk: Ось порожній скрипт C# з деякими коментарями, щоб продемонструвати, як він працює.
zh_tw: 下列為一個空白的 C# 腳本，包含了一些說明如何運作的註解。

source: As you can see, functions normally in global scope in GDScript like Godot's ``print`` function are available in the ``GD`` class which is part of the ``Godot`` namespace. For a list of methods in the ``GD`` class, see the class reference pages for :ref:`@GDScript <class_@gdscript>` and :ref:`@GlobalScope <class_@globalscope>`.
es: Como se puede ver, las funciones de alcance global en GDScript como la función ``print`` de Godot están disponibles en la clase ``GD`` que forma parte del espacio de nombres ``Godot``. Para ver una lista de los métodos de la clase ``GD``, consulta las páginas de referencia de la clase para :ref:`@GDScript <class_@gdscript>` y :ref:`@GlobalScope <class_@globalscope>`.
fr: Comme vous pouvez le voir, les fonctions normalement de portée globale dans GDScript comme la fonction ``print`` de Godot sont disponibles dans la classe ``GD`` qui fait partie de l'espace de nom ``Godot``. Pour une liste de méthodes dans la classe ``GD``, voir les pages de référence des classes pour :ref:`@GDScript <class_@gdscript>` et :ref:`@GlobalScope <class_@globalscope>`.
ja: ご覧のとおり、Godotの ``print`` 関数のようなGDScriptのグローバル スコープの関数は、\ ``Godot`` 名前空間の一部である ``GD`` クラスで使用できます。\ ``GD`` クラスのメソッドの一覧については、\ :ref:`@GDScript <class_@gdscript>` および :ref:`@GlobalScope <class_@globalscope>` のクラス リファレンス ページを参照してください。
pt_br: Como você pode ver, funções normalmente em escopo global no GDScript como a função ``print`` do Godot estão disponíveis na classe ``GD`` que é parte do namespace ``Godot``. Para uma lista de métodos na classe ``GD``, veja as páginas de referência de classe para :ref:`@GDScript <class_@gdscript>` e :ref:`@GlobalScope <class_@globalscope>`.
ru: Как видите, функции, которые в GDScript имеют глобальную область видимости, такие как функция ``print``, здесь доступны из класса ``GD``, который в свою очередь является частью пространства имен ``Godot``. Вы можете ознакомиться со списком методов класса ``GD`` на страницах справки класса :ref:`@GDScript <class_@gdscript>` и :ref:`@GlobalScope <class_@globalscope>`.
uk: Як бачите, звичайні функції з глобальною областю в GDScript, такі як функція ``print``, доступні в класі ``GD``, який є частиною простору імен Godot. Щоб переглянути список методів у класі ``GD``, див. Довідкові сторінки класів для :ref:`@GDScript<class_@gdscript>` та :ref:`@GlobalScope <class_@globalscope>`.
zh_tw: 就像這樣，在 GDScript 中通常在全域的函式，如 Godot 的 ``print`` 函式，都在 ``Godot`` 命名空間中的 ``GD`` 類別內。要取得 ``GD`` 類別中所有方法的列表，請參考類別參照頁面中的 :ref:`@GDScript <class_@gdscript>` 與 :ref:`@GlobalScope <class_@globalscope>` 。

source: Keep in mind that the class you wish to attach to your node should have the same name as the ``.cs`` file. Otherwise, you will get the following error and won't be able to run the scene: *"Cannot find class XXX for script res://XXX.cs"*
es: Ten en cuenta que la clase que deseas adjuntar a tu nodo debe ser nombrada igual que el archivo ``.cs``. De lo contrario, se producirá el siguiente error y no se podrá ejecutar la escena: *"Cannot find class XXX for script res://XXX.cs"*
fr: Gardez à l'esprit que la classe que vous souhaitez attacher à votre nœud doit avoir le même nom que le fichier ``.cs``. Sinon, vous obtiendrez l'erreur suivante et vous ne pourrez pas exécuter la scène : *"Cannot find class XXX for script res://XXX.cs"*
ja: ノードにアタッチしたいクラスは ``.cs`` ファイルと同じ名前にする必要があることに注意してください。そうしないと、次のエラーが発生し、シーンを実行できません: *"Cannot find class XXX for script res://XXX.cs"*
pt_br: Tenha em mente que a classe que você deseja anexar ao seu nó deve ser nomeada como um arquivo ``.cs``. Caso contrário, você receberá o seguinte erro e não poderá executar a cena: *"Não é possível encontrar a classe XXX para o script res://XXX.cs"*
ru: Помните, что класс, который вы хотите присоединить к вашему узлу, должен иметь то же имя, что и файл `` .cs``. В противном случае вы получите следующую ошибку и не сможете запустить сцену: * «Не удается найти класс XXX для сценария res://XXX.cs» *
uk: Майте на увазі, що клас, який ви хочете приєднати до свого вузла, повинен мати те саме ім'я, що і файл ``.cs``. В іншому випадку ви отримаєте таку помилку, і не зможете запустити сцену: *"Cannot find class XXX for script res://XXX.cs"* *("Неможливо знайти клас XXX для скрипту res://XXX.cs")*
zh_tw: 請記得，要附加到節點上的類別必須與 ``.cs`` 檔案的檔名相同。否則會得到下列錯誤且無法執行場景： **「Cannot find class XXX for script res://XXX.cs」**

source: General differences between C# and GDScript
es: Diferencias generales entre C# y GDScript
fr: Différences générales entre C# et GDScript
ja: C#とGDScriptの一般的な違い
ko: C#과 GDScript와의 일반적인 차이
pt_br: Diferenças gerais entre o C# e o GDScript
ru: Основные различия между C# и GDScript
uk: Основні відмінності між C# і GDScript
zh_tw: C# 與 GDScript 間的一般差異

source: The C# API uses ``PascalCase`` instead of ``snake_case`` in GDScript/C++. Where possible, fields and getters/setters have been converted to properties. In general, the C# Godot API strives to be as idiomatic as is reasonably possible.
es: La API de C# usa ``PascalCase`` en lugar de ``snake_case`` en GDScript/C++. Siempre que ha sido posible, los campos y los getters/setters han sido convertidos a propiedades. En general, la API de C# Godot se esfuerza por ser fluida tanto como sea razonablemente posible.
fr: L'API C# utilise le ``PascalCase`` au lieu du ``snake_case`` dans GDScript/C++. Dans la mesure du possible, les champs et les getters/setters ont été convertis en propriétés. En général, l'API Godot C# s'efforce d'être aussi idiomatique que possible.
ja: C# APIはGDScript/C++の ``snake_case`` の代わりに ``PascalCase`` を使います。 可能であれば、フィールドとゲッター/セッターはプロパティに変換されています。一般的に、C# Godot APIは合理的に可能な限り慣用的であるように努めています。
ko: GDScript/C++에서는 ``snake_case``\ 를 쓰지만 C# API는 ``PascalCase``\ 를 씁니다. 가능하면 공백과 getters/setters이 속성으로 변환됩니다. 일반적으로 C# Godot API는 합리적으로 가능한 것처럼 관용적이도록 노력합니다.
pt_br: A API do C# usa o ``PascalCase`` em vez do ``snake_case`` no GDScript/C++. Sempre que possível, fields e getters/setters foram convertidos em propriedades. Em geral, a API C# Godot se esforça para ser tão idiomática quanto for razoavelmente possível.
ru: В языке C# всё API использует стиль записи ``PascalCase`` вместо ``snake_case``, принятого в GDScript/C++. Поля и getters/setters представленны в виде свойств, там где это допустимо. В целом, Godot API на C# стримится быть наиболее наглядным, насколько это возможно.
uk: API C# використовує ``PascalCase`` замість ``snake_case`` в GDScript/C ++. Там де можливо, поля та гетери/сетери були перетворені у властивості. Взагалі API C# Godot прагне бути максимально ідіоматичним, наскільки це можливо.
zh_tw: C# API 使用 ``PascalCase`` 而不是 GDScript/C++ 的 ``snake_case`` 。欄位、Getter、Setter 都儘量轉換成屬性。一般來說，C# Godot API 都在合理情況下儘量保持其習慣。

source: For more information, see the :ref:`doc_c_sharp_differences` page.
es: Para más información, consulta la página :ref:`doc_c_sharp_differences`.
fr: Pour plus d'informations, voir la page :ref:`doc_c_sharp_differences`.
ja: 詳細については、\ :ref:`doc_c_sharp_differences` ページを参照してください。
pt_br: Para mais informações, veja a página :ref:`doc_c_sharp_differences`.
uk: Для отримання додаткової інформації дивіться сторінку :ref:`doc_c_sharp_differences`.
zh_tw: 更多資訊請參考 :ref:`doc_c_sharp_differences` 一頁。

source: Current gotchas and known issues
es: Problemas actuales y problemas conocidos
fr: Les pièges courants et les problèmes connus
ja: 現在の課題と既知の問題
ko: 현재 문제와 알려진 문제
pt_br: Pegadas gerais e problemas conhecidos
ru: Текущие ограничения и известные проблемы
uk: Поточні обмеження та відомі проблеми
zh_tw: 目前狀況與已知問題
