Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/c_sharp/c_sharp_basics.po
Languages: es, fr, ja, ko, pt_br, ru, uk, zh_tw

source: C# support is a new feature available since Godot 3.0. As such, you may still run into some issues, or find spots where the documentation could be improved. Please report issues with C# in Godot on the `engine GitHub page <https://github.com/godotengine/godot/issues>`_, and any documentation issues on the `documentation GitHub page <https://github.com/godotengine/godot-docs/issues>`_.
es: El soporte C# es una nueva característica en Godot 3.0. Como tal, es posible que todavía encuentres algunos problemas o puntos en los que la documentación podría mejorarse. Por favor, informe de los problemas con C# en Godot en `engine Github page <https://github.com/godotengine/godot/issues>`_. Y cualquier problema de documentación en `documentation Github Page <https://github.com/godotengine/godot-docs/issues>`_.
fr: Le support du C# est une nouvelle fonctionnalité depuis Godot 3.0. Ainsi, il se peut que vous rencontriez encore des problèmes ou que vous trouviez des endroits où la documentation pourrait être améliorée. Merci de signaler les problèmes avec C# dans Godot sur la `page Github du moteur de jeu <https://github.com/godotengine/godot/issues>`_. Et tout problème de documentation sur la `page GitHub de la documentation <https://github.com/godotengine/godot-docs/issues>`_.
ja: C#サポートは、Godot 3.0以降で利用可能な新しい機能です。そのため、依然としていくつかの問題に遭遇したり、ドキュメントを改善できる箇所が見つかる場合があります。 GodotのC#に関する問題を `engine GitHubページ<https://github.com/godotengine/godot/issues>` で報告し、ドキュメントの問題を `documentation GitHubページ<https://github.com/godotengine/godot-docs/issues> ` で報告してください。
pt_br: O suporte a C# é um recurso novo disponível desde o Godot 3.0. Por isso, você ainda pode se deparar com alguns problemas, ou encontrar lugares onde a documentação poderia ser melhorada. Por favor relate problemas com C# no Godot na `página do motor no Github <https://github.com/godotengine/godot/issues>`_, e qualquer problema de documentação na `página da documentação no Github <https://github.com/godotengine/godot-docs/issues>`_.
ru: Поддержка C# была введена в Godot 3.0. Из-за новизны, вы можете столкнуться с какими-то проблемами, или найти места где документация может быть улучшена. Пожалуйста сообщайте о проблемах с C# в Godot на `странице движка на GitHub <https://github.com/godotengine/godot/issues>`_, а о проблемах с документацией на `странице GitHub документации <https://github.com/godotengine/godot-docs/issues>`_.
uk: Підтримка C# - це нова функція, доступна з Godot 3.0. Таким чином, ви все ще можете зіткнутися з деякими проблемами, або знайти місця, де можна було б удосконалити документацію. Будь ласка, повідомте про проблеми з C# у Godot на `сторінці движка GitHub <https://github.com/godotengine/godot/issues>`_, та про будь-які проблеми з документацією на `сторінці документації GitHub<https://github.com/godotengine/godot-docs/issues>`_.
zh_tw: C# 是自 Godot 3.0 版起新增的新功能。因此可能還是會遇到一些問題，或是有文件需要改進的地方。請在 `Godot 的 GitHub 頁面 <https://github.com/godotengine/godot/issues>`_ 上回報與 C# 有關的問題，而文件相關的問題請於 `說明文件 GitHub 頁面 <https://github.com/godotengine/godot-docs/issues>`_ 回報。

source: This page provides a brief introduction to C#, both what it is and how to use it in Godot. Afterwards, you may want to look at :ref:`how to use specific features <doc_c_sharp_features>`, read about the :ref:`differences between the C# and the GDScript API <doc_c_sharp_differences>` and (re)visit the :ref:`Scripting section <doc_scripting>` of the step-by-step tutorial.
es: Esta página proporciona una breve introducción a C#, tanto lo que es y cómo usarlo en Godot. Después, puede que quiera ver :ref:`cómo usar características específicas <doc_c_sharp_features>`, lea sobre :ref:diferencias entre C# y GDScript API <doc_c_sharp_differences>` y (re)visite la sección :ref:`Scripting <doc_scripting>` del tutorial paso a paso.
fr: Cette page fournit une brève introduction au C#, à la fois ce qu'il est et comment l'utiliser dans Godot. Après, vous pouvez regarder :ref:`comment utiliser des fonctionnalités spécifiques à C# <doc_c_sharp_features>`, lire :ref:`les différences entre l'API C# et l'API GDScript <doc_c_sharp_differences>` et (re)visiter la :ref:`section sur les scripts <doc_scripting>` du tutoriel pas-à-pas.
ja: このページでは、C#の概要と、Godotでの使用方法の両方について簡単に紹介しています。その後、\ :ref:`特定の機能を使用する方法<doc_c_sharp_features>`\ 、\ :ref:`C#とGDScript APIの違い<doc_c_sharp_differences>`\ について読み、(再び)ステップバイステップチュートリアルの\ :ref:`スクリプトセクション<doc_scripting>`\ を参照してください。
ru: Эта страница предоставляет краткое введение в C#, о том что это и как использовать его в Godot. После, вас может заинтересовать чтение о том :ref:`как использовать особые возможности <doc_c_sharp_features>`, о :ref:`различиях между C# и GDScript API <doc_c_sharp_differences>` и (пере)посещение :ref:`Секции скриптинга <doc_scripting>` для пошагового руководства.
uk: На цій сторінці подано короткий вступ до C#, що це таке, та як його використовувати в Godot. Після цього, можливо, ви захочете ознайомитись із :ref:`використанням конкретних функцій <doc_c_sharp_features>`, прочитати про :ref:`відмінності між C# та API GDScript<doc_c_sharp_differences>` та (повторно) переглянути :ref:`розділ створення скриптів<doc_scripting>` покрокового підручника.
zh_tw: 本頁提供了 C# 的簡介，包含 C# 為何以及如何在 Godot 中使用。之後，建議您也閱讀 :ref:`如何使用特定功能 <doc_c_sharp_features>` 、:ref:`C# 與 GDScript API 的比較 <doc_c_sharp_differences>` 以及 (再次) 閱讀按部就班教學中的 :ref:`腳本段落 <doc_scripting>` 。

source: C# is a high-level programming language developed by Microsoft. In Godot, it is implemented with the Mono 6.x .NET framework, including full support for C# 8.0. Mono is an open source implementation of Microsoft's .NET Framework based on the ECMA standards for C# and the Common Language Runtime. A good starting point for checking its capabilities is the `Compatibility <http://www.mono-project.com/docs/about-mono/compatibility/>`_ page in the Mono documentation.
es: C# es un lenguaje de programación de alto nivel desarrollado por Microsoft. En Godot se implementa con el framework .NET Mono 6.x, incluyendo soporte completo para C# 8.0. Mono es una implementación de código abierto del Microsoft's .NET Framework basada en los estándares ECMA para C# y Common Language Runtime. Un buen punto de partida para comprobar sus capacidades es la página `Compatibilidad <http://www.mono-project.com/docs/about-mono/compatibility/>`_ de la documentación de Mono.
fr: C# est un langage de programmation de haut niveau développé par Microsoft. Dans Godot il est implémenté avec le framework Mono 6.x.NET incluant le support complet pour C# 8.0. Mono est une implémentation open source du Framework.NET de Microsoft basé sur les standards ECMA pour C# et le Common Language Runtime. Un bon point de départ pour vérifier ses capacités est la page `Compatibilité <http://www.mono-project.com/docs/about-mono/compatibility/>`_ dans la documentation Mono.
ja: C#は、マイクロソフトが開発した高度なプログラミング言語です。Godotでは、C# 8.0の完全なサポートを含むMono 6.x .NETフレームワークで実装されています。Monoは、C#および共通言語ランタイムのECMA標準に基づいたMicrosoftの.NET Frameworkのオープンソース実装です。その機能を確認するための良い出発点は、Monoドキュメントの `互換性 <http://www.mono-project.com/docs/about-mono/compatibility/>` ページです。
pt_br: C# é uma linguagem de programação de alto nível desenvolvida pela Microsoft. No Godot, ela é implementada com o framework Mono 5.2 .NET, incluindo suporte completo para o C# 8.0. O Mono é uma implementação de código aberto do .NET Framework da Microsoft, baseado nos padrões ECMA para C# e Common Language Runtime. Um bom ponto de partida para verificar seus recursos é a `página Compatibility <http://www.mono-project.com/docs/about-mono/compatibility/>`_ na documentação do Mono.
ru: C# это высокоуровневый язык программирования разработанный Microsoft. В Godot, он встроен с использованием фреймворка Mono 6.x .NET, включающий полную поддержку C# 8.0. Mono - это реализация Microsoft .NET Framework с открытым исходным кодом, базирующаяся на стандартах ECMA для C# и Common Language Runtime(CLR). Для изучения его возможностей смотрите страницу `Совместимость <http://www.mono-project.com/docs/about-mono/compatibility/>`_ в документации Mono.
uk: C# - мова програмування високого рівня, розроблена Microsoft. У Godot вона реалізована за допомогою Mono 6.x .NET, включаючи повну підтримку C# 8.0. Mono - це реалізація .NET Framework від Microsoft з відкритим кодом, яка базується на стандартах ECMA для C# та Common Language Runtime (Загальномовне Виконуюче Середовище). Гарною відправною точкою для перевірки його можливостей є сторінка `сумісності<http://www.mono-project.com/docs/about-mono/compatibility/>`_ в документації Mono.
zh_tw: C# 是由 Microsoft 開發的高級程式語言。在 Godot 中的 C# 是基於 Mono 6.x .NET 框架實作的，包含對 C# 8.0 的完整支援。Mono 是基於 C# 與通用語言執行環境的 ECMA 標準實作的開放原始碼版 Microsoft .NET 框架。從 Mono 文件的 `相容性 (英文) <http://www.mono-project.com/docs/about-mono/compatibility/>`_ 頁面開始是一個不錯的選項。

source: This is **not** a full-scale tutorial on the C# language as a whole. If you aren't already familiar with its syntax or features, see the `Microsoft C# guide <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ or look for a suitable introduction elsewhere.
es: Este es **no** un tutorial a gran escala sobre el lenguaje C# en general. Si aún no está familiarizado con su sintaxis o características, consulte la guía `Microsoft C# <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ o busque una introducción adecuada en otro lugar.
fr: Il ne s'agit **pas** d'un tutoriel complet sur le langage C# dans son ensemble. Si vous n'êtes pas déjà familier avec sa syntaxe ou ses fonctionnalités, consultez le guide `Microsoft C# <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ ou cherchez une introduction appropriée ailleurs.
ja: これはC#言語全体に関する本格的なチュートリアルでは\ **ありません**\ 。まだその構文や機能に慣れていなければ、 `Microsoft C#ガイド<https://docs.microsoft.com/en-us/dotnet/csharp/index>` や他の適切な入門書を参照してください。
ko: 이것은 전체적으로 C# 언어에 대한 본격적인 튜토리얼이 **아닙니다**. 문법이나 기능에 익숙하지 않다면 `Microsoft C# 가이드 <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_\ 를 보거나 다른 적합한 설명을 찾아보세요.
pt_br: Esse **não** é um tutorial completo e abrangente sobre a linguagem C#. Se você ainda não estiver familiarizado com sua sintaxe ou recursos, consulte o `guia C# da Microsoft <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ ou procure uma introdução adequada em outro lugar.
ru: Это **не** полномасштабное руководство по целому языку C#. Если вы не знакомы с его синтаксисом или возможностями, посмотрите `Microsoft C# руководство <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ или поищите подходящее введение где-нибудь ещё.
uk: Це **не** повномасштабний підручник з мови C#. Якщо ви ще не знайомі з її синтаксисом, або можливостями, перегляньте `посібник Microsoft C# <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ або знайдіть відповідний вступ у іншому місці.
zh_tw: 本教學 **不是** 完整的 C# 語言教學。若您不熟悉 C# 的語法與功能，請參考 `Microsoft C# 指南 <https://docs.microsoft.com/zh-tw/dotnet/csharp/index>`_ 或尋找其它合適的介紹。

source: Setting up C# for Godot
es: Configuración C# para Godot
fr: Configurer C# pour Godot
ja: Godot用のC#のセットアップ
pt_br: Configurando o C# para Godot
ru: Настройка C# для Godot
uk: Налаштування C# для Godot
zh_tw: 為 Godot 設定 C#

source: Download and install the latest version of `Visual Studio <https://visualstudio.microsoft.com/downloads/>`_ (*not* Visual Studio Code), which contains utilities required to use C# in Godot. If you don't plan on using the Visual Studio IDE, you can download just the `Visual Studio Build Tools <https://visualstudio.microsoft.com/thank-you-downloading-visual-studio/?sku=BuildTools&rel=15>`_ instead. Make sure you at least have the .NET Framework 4.5 targeting pack installed, you can get it using any of the installers mentioned above inside the "Individual components" tab.
es: Descarga e instala la última versión de `Visual Studio <https://visualstudio.microsoft.com/downloads/>`_ (*no* Visual Studio Code), que contiene las utilidades necesarias para utilizar C# en Godot. Si no planeas usar el IDE de Visual Studio, puedes descargar sólo `Visual Studio Build Tools <https://visualstudio.microsoft.com/thank-you-downloading-visual-studio/?sku=BuildTools&rel=15>`_ en su lugar. Asegúrate de tener instalado al menos el paquete .NET Framework 4.5, puedes obtenerlo usando cualquiera de los instaladores mencionados anteriormente dentro de la pestaña "Componentes individuales".
fr: Téléchargez et installez la dernière version de `Visual Studio <https://visualstudio.microsoft.com/downloads/>`_ (*pas* Visual Studio Code), qui contient les utilitaires requis pour utiliser C# dans Godot. Si vous ne prévoyez pas d'utiliser l'EDI Visual Studio, vous pouvez télécharger uniquement les outils de création de `Visual Studio Build Tools <https://visualstudio.microsoft.com/thank-you-downloading-visual-studio/?sku=BuildTools&rel=15>`_ à la place. Assurez-vous d'avoir au moins le paquet de ciblage .NET Framework 4.5 installé, vous pouvez l'obtenir en utilisant n'importe lequel des installateurs mentionnés ci-dessus dans l'onglet "Composants individuels".
ja: GodotでC#を使用するために必要なユーティリティが含まれている最新バージョンの `Visual Studio <https://visualstudio.microsoft.com/downloads/>` (Visual Studio Code*ではありません* )をダウンロードしてインストールします。 Visual Studio IDEを使用する予定がない場合は、代わりに `Visual Studioビルドツール<https://visualstudio.microsoft.com/thank-you-downloading-visual-studio/?sku=BuildTools&rel=15>` のみをダウンロードできます。少なくとも.NET Framework 4.5ターゲットパックがインストールされていることを確認してください。上記の "個別コンポーネント" タブ内のインストーラーのいずれかを使用して入手できます。
uk: Завантажте та встановіть останню версію `Visual Studio <https://visualstudio.microsoft.com/downloads/>`_ ( *не* Visual Studio Code), яка містить утиліти, необхідні для використання C# у Godot. Якщо ви не плануєте використовувати Visual Studio IDE, ви можете завантажити лише `інструменти Visual Studio<https://visualstudio.microsoft.com/thank-you-downloading-visual-studio/?sku=BuildTools&rel=15>`_ . Переконайтеся, що ви, принаймні, маєте встановлений пакет орієнтації .NET Framework 4.5, ви можете отримати його за допомогою будь-якого із згаданих вище встановщиків на вкладці "Особисті компоненти".

source: JetBrains Rider comes with bundled MSBuild, so nothing extra is required. Make sure to set the following preferences:
es: JetBrains Rider viene con MSBuild incluído, así que no se requiere nada extra. Asegúrate de configurar las siguientes preferencias:
fr: JetBrains Rider est livré avec MSBuild, aucune autre dépendance n'est requise. Assurez-vous de définir les préférences suivantes de cette manière :
ru: JetBrains Rider поставляется в комплекте с MSBuild, так что ничего лишнего не требуется. Обязательно установите следующие настройки:

source: In Godot:
fr: Dans Godot :

source: Mono External Editor to JetBrains Rider
fr: Éditeur externe Mono pour JetBrains Rider

source: Mono Build Tool to JetBrains Mono.
fr: Outils de compilation Mono pour JetBrains Mono.

source: In Rider:
es: En Rider:
fr: Dans Rider :
pt_br: No Rider:
ru: В Rider:
zh_tw: Rider 中：

source: Install **Godot support** plugin.
fr: Installez le plugin **Godot support**.

source: macOS and Linux
es: macOS y Linux
fr: macOS et Linux
ja: macOSおよびLinux
ru: macOS и Linux
uk: macOS і Linux

source: Download and install the latest version of the `Mono SDK <http://www.mono-project.com/download/>`_. As of Godot 3.1 beta 3, the version number doesn't matter since Godot bundles its own Mono 5.18 installation. We only need the Mono installation for NuGet and MSBuild which are required to use C# in Godot.
es: Descarga e instala la última versión del SDK Mono <http://www.mono-project.com/download/>. Como en el caso de Godot 3.1 beta 3, el número de versión no tiene importancia desde que Godot agrupa su propia instalación Mono 5.18. Solamente necesitaremos la instalación mono para NuGet y MSBuild, los cuales son requeridos para el uso de C# en Godot.
fr: Téléchargez et installez le dernière version de `Mono SDK <http://www.mono-project.com/download/>`_. A partir de Godot 3.1 beta 3, le version n'est plus importante, Godot apportant sa propre installation de Mono 5.18. Nous avons seulement besoin de l'installation de Mono pour NuGet et MSBuild, qui requièrent l'utilisation de C# dans Godot.
ja: `Mono SDK <http://www.mono-project.com/download/>` の最新バージョンをダウンロードしてインストールします。Godot 3.1 beta 3の時点では、Godotには独自のMono 5.18インストールがバンドルされているため、バージョン番号は重要ではありません。 GodotでC#を使用するために必要なNuGetおよびMSBuildのMonoインストールのみが必要です。
ru: Загрузите и установите последнюю версию `Mono SDK <http://www.mono-project.com/download/>`_. Начиная с Godot 3.1 beta 3, номер версии не играет роли, так как Godot поставляется с собственной сборкой Mono 5.18. Нам нужна Mono установка для NuGet и MSBuild которые нужны для использования C# в Godot.
uk: Завантажте та встановіть останню версію `Mono SDK <http://www.mono-project.com/download/>`_. Від Godot 3.1 beta 3, номер версії не має значення, оскільки Godot постачає власну установку Mono 5.18. Нам потрібна тільки установка Mono для NuGet і MSBuild, які необхідні для використання C# в Godot.

source: To download Mono on macOS, use the "Stable Channel" link from the `Mono Downloads Page <http://www.mono-project.com/download/>`_. The Visual Studio channel is an earlier version of Mono and will not work.
es: Para descargar Mono en macOS, utiliza el enlace "Stable Channel" de la página `Mono Downloads Page <http://www.mono-project.com/download/>`_. El canal Visual Studio es una versión anterior de Mono y no funcionará.
fr: Pour télécharger Mono sur macOS, utilisez le lien "Stable Channel" dans la page `téléchargements de Mono <http://www.mono-project.com/download/>`_. Le canal Visual Studio est une version antérieure de Mono et ne fonctionnera pas.
ja: macOSにMonoをダウンロードするには、 `Mono Downloads Page <http://www.mono-project.com/download/>` から "Stable Channel" リンクを使用します。 Visual StudioチャネルはMonoの以前のバージョンであり、機能しません。
ru: Для загрузки Mono на macOS, используйте ссылку на "Stable Channel" из `Страницы Загрузок Mono <http://www.mono-project.com/download/>`_. Канал Visual Studio это ранняя версия Mono которая не будет работать.
uk: Щоб завантажити Mono на macOS, скористайтеся посиланням "Стабільний канал" зі `сторінки завантаження Mono <http://www.mono-project.com/download/>`_. Канал Visual Studio - це більш рання версія Mono і не працюватиме.

source: Additional notes
es: Notas adicionales
fr: Informations supplémentaires
ja: その他の注意事項
pt_br: Notas adicionais
ru: Дополнительные заметки
uk: Додаткові примітки
zh_tw: 其他注意事項

source: Your Godot version must have Mono support enabled, so make sure to download the **Mono version** of Godot. If you are building Godot from source, make sure to follow the steps to enable Mono support in your build as outlined in the :ref:`doc_compiling_with_mono` page.
es: Tu versión de Godot debe tener habilitada la compatibilidad con Mono, así que asegúrate de descargar la ** versión Mono ** de Godot. Si estás compilando Godot desde el código fuente, asegúrate de seguir los pasos tal y cómo se describen en la página :ref :`doc_compiling_with_mono` para incluir soporte Mono en tu compilación.
fr: Votre version de Godot doit avoir le support Mono activé, alors assurez-vous de télécharger la version **Mono** de Godot. Si vous compilez Godot à partir des sources, assurez-vous de suivre les étapes pour activer le support Mono dans votre compilation comme indiqué dans la page :ref:`doc_compiling_with_mono`.
ja: Monoサポートが有効になっているGodotを使用する必要があるため、必ず **Mono version** のGodotをダウンロードしてください。ソースからGodotをビルドする場合は、 :ref:`doc_compiling_with_mono` ページに概説されている手順に従って、Monoサポートを有効にしてビルドしてください。
ru: Ваша версия Godot должна иметь включенную поддержку Mono, поэтому обязательно загрузите **Mono версию** Godot. Если вы собираете Godot из исходников, обязательно выполните действия, чтобы включить поддержку Mono в вашей сборке, как описано на странице :ref:`doc_compiling_with_mono`.
uk: У вашій версії Godot повинна бути включена підтримка Mono, тому обов'язково завантажте **Mono версію** Godot. Якщо ви створюєте Godot з джерела, не забудьте виконати кроки для увімкнення підтримки Mono у вашій збірці, як зазначено на сторінці :ref:`doc_compiling_with_mono`.

source: In summary, you must have installed Visual Studio or Mono (depending on your operating system) **and** the Mono-enabled version of Godot.
es: En resumen, debes tener instalado Visual Studio o Mono (dependiendo de tu sistema operativo) **y** la versión Mono de Godot.
fr: En résumé, vous devez avoir installé Visual Studio ou Mono (selon votre système d'exploitation) **et** la version avec Mono activé de Godot.
ja: 要約すると、Visual StudioまたはMono(オペレーティング システムによって異なります) **および** Mono対応バージョンのGodotがインストールされている必要があります。
ru: В итоге, вы должны иметь установленную Visual Studio или Mono (в зависимости от вашей операционной системы) **и** Mono-ориентированную версию Godot.
uk: В результаті, ви повинні встановити Visual Studio, або Mono, (залежно від вашої операційної системи) **та** придатну для Mono версію Godot.

source: Configuring an external editor
es: Configuración de un editor externo
fr: Configuration d'un éditeur externe
ja: 外部エディタの設定
ko: 외부 편집기 구성하기
pt_br: Configurando um editor externo
ru: Настройка внешнего редактора
uk: Налаштування зовнішнього редактора
zh_tw: 設定外部編輯器
