Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/c_sharp/c_sharp_basics.po
Languages: es, fr, ja, ko, pt_br, ru, uk, zh_tw

source: Godot has built-in support for workflows involving several popular C# IDEs. Built-in support for Visual Studio will be including in future versions, but in the meantime, the steps below can let you configure VS 2019 for use with Godot C# projects.
es: Godot tiene incorporado soporte para flujos de trabajo que involucran varios IDEs populares de C#. El soporte incorporado para Visual Studio se incluirá en futuras versiones, pero mientras tanto, los siguientes pasos pueden permitirte configurar Visual Studio 2019 para su uso con proyectos de Godot C#.
fr: Godot a un support intégré pour les flux de travail impliquant plusieurs IDE C# populaires. La prise en charge intégrée de Visual Studio sera incluse dans les prochaines versions, mais en attendant, les étapes ci-dessous peuvent vous permettre de configurer VS 2019 pour une utilisation avec les projets Godot C#.
ja: Godotには、いくつかの一般的なC# IDEに関係するワークフローのサポートが組み込まれています。 Visual Studioの組み込みサポートは将来のバージョンに含まれますが、それまでの間、以下の手順でGodot C# プロジェクトで使用するためにVS 2019を構成できます。
ru: Godot имеет встроенную поддержку рабочих процессов с участием нескольких популярных C# IDE. Встроенная поддержка Visual Studio будет включена в будущие версии, но пока что приведенные ниже шаги могут позволить вам настроить VS 2019 для использования с проектами Godot C#.
uk: Godot має вбудовану підтримку робочих процесів із залученням декількох популярних C# IDE. Вбудована підтримка Visual Studio буде включатись у майбутніх версіях, але тим часом, наведені нижче кроки дозволять вам налаштувати VS 2019 для використання з проектами Godot C#.
zh_tw: Godot 中內建支援在工作流程中整合數種流行的 C# IDE。對於 Visual Studio 的內建支援將於未來的版本提供，但目前，可以通過下列步驟來設定 VS 2019 給 Godot C# 專案使用。

source: Install VS 2019 with ``.NET desktop development`` and ``Desktop development with C++`` workloads selected.
es: Instalar Visual Studio 2019 con ".NET desktop development" y "Desktop development with C++" seleccionadas.
fr: Installez VS 2019 avec ``.NET desktop development`` et ``Desktop development with C++`` sélectionnées.
ja: ``.NETデスクトップ開発`` および `` C++によるデスクトップ開発`` ワークロードを選択してVS 2019をインストールします。
ru: Установите VS 2019 с выбранными рабочими нагрузками ``.NET desktop development`` и ``Desktop development with C++``.
uk: Встановіть VS 2019 з ``.NET desktop development`` і ``Desktop development with C++`` обрані робочі навантаження.
zh_tw: 安裝 VS 2019 時請選擇 ``.NET 桌面開發`` 與 ``以 C++ 進行桌面開發`` 工作負載。

source: **Ensure that you do not have Xamarin installed.** Do not choose the ``Mobile development with .NET`` workload. Xamarin changes the DLLs used by MonoDebugger, which breaks debugging.
es: **Asegúrate de no tener instalado Xamarin. No elijas la carga de trabajo de "Desarrollo móvil con .NET". Xamarin cambia las DLLs usadas por el MonoDebugger, lo que rompe la depuración.
fr: **Assurez-vous que Xamarin n'est pas installé** Ne choisissez pas le ``Mobile development with .NET``. Xamarin modifie les DLL utilisées par MonoDebugger, ce qui interrompt le débogage.
ja: **Xamarinがインストールされていないことを確認してください。** ``.NETワークロードによるモバイル開発`` を選択しないでください。 Xamarinは、MonoDebuggerが使用するDLLを変更し、デバッグを中断します。
ru: **Убедитесь, что у вас не установлен Xamarin.** Не выбирайте рабочую нагрузку ``Mobile development with .NET``. Xamarin изменяет DLLs, используемые MonoDebugger, что нарушает отладку.
uk: **Переконайтесь, що у вас не встановлено Xamarin.** Не вибирайте ``Mobile development with .NET``. Xamarin змінює DLL, використовувані MonoDebugger, що порушує налагодження.
zh_tw: **確保沒有安裝 Xamarin。** 不要選擇 ``以 .NET 進行行動開發`` 工作負載。Xamarin 會更改 MonoDebugger 使用的 DLL，會導致無法除錯。

source: Install the `VSMonoDebugger extension <https://marketplace.visualstudio.com/items?itemName=GordianDotNet.VSMonoDebugger0d62>`_.
es: Instala la extensión "VSMonoDebugger" <https://marketplace.visualstudio.com/items?itemName=GordianDotNet.VSMonoDebugger0d62>`_.
fr: Installez l'extension `VSMonoDebugger <https://marketplace.visualstudio.com/items?itemName=GordianDotNet.VSMonoDebugger0d62>`_.
ja: `VSMonoDebugger拡張機能 <https://marketplace.visualstudio.com/items?itemName=GordianDotNet.VSMonoDebugger0d62>`_ をインストールします。
ru: Установите `расширение VSMonoDebugger <https://marketplace.visualstudio.com/items?itemName=GordianDotNet.VSMonoDebugger0d62>`_.
uk: Встановіть `розширення VSMonoDebugger <https://marketplace.visualstudio.com/items?itemName=GordianDotNet.VSMonoDebugger0d62>`_.
zh_tw: 安裝 `VSMonoDebugger 擴充套件 <https://marketplace.visualstudio.com/items?itemName=GordianDotNet.VSMonoDebugger0d62>`_ 。

source: In VS 2019 --> Extensions --> Mono --> Settings:
es: En Visual Studio 2019 --> Extensiones --> Mono --> Configuración:
fr: Dans VS 2019 --> Extensions --> Mono --> Settings :
ja: VS2019で → 拡張機能 → Mono → Setting:
ru: В VS 2019 --> Extensions --> Mono --> Settings:
uk: У VS 2019 --> Extensions --> Mono --> Settings (VS 2019 -> Розширення -> Моно -> Налаштування):
zh_tw: 在 VS 2019 中 --> [擴充套件] -> [Mono] --> [設定]：

source: Select ``Debug/Deploy to local Windows``.
es: Selecciona "Debug/Deploy to local Windows".
fr: Sélectionnez ``Debug/Deploy to local Windows``.
ja: ``Debug/Deploy to local Windows``を選択してください。.
ru: Выберите ``Debug/Deploy to local Windows``.
uk: Виберіть ``Debug/Deploy to local Windows``.
zh_tw: 選擇 ``除錯／部署至 Windows`` 。

source: Leave ``Local Deploy Path`` blank.
es: Deje en blanco "Ruta de Despliegue Local".
fr: Laissez ``Local Deploy Path`` vide.
ja: ``Local Deploy Path``を空にしてください。
ru: Оставьте пустым ``Local Deploy Path``.
uk: Залиште порожнім ``Local Deploy Path``.
zh_tw: 將 ``本機部署路徑`` 留空。

source: Set the ``Mono Debug Port`` to the port in Godot --> Project --> Project Settings --> Mono --> Debugger Agent.
es: Coloca "Puerto de Depuración Mono" en el puerto en Godot --> Proyecto --> Configuración del Proyecto --> Mono --> Agente Depurador.
fr: Définissez le ``Mono Debug Port`` sur le port dans Godot --> Project --> Project Settings --> Mono --> Debugger Agent.
ja: Godot --> プロジェクト--> プロジェクト設定 --> Mono --> Debugger Agentで ``Mono Debug Port`` にポートを設定してください。
ru: Установите ``Mono Debug Port`` в порт в Godot --> Project --> Project Settings --> Mono --> Debugger Agent.
uk: Встановіть ``Mono Debug Port`` порт у Godot --> Проект --> Параметри проекту --> Mono --> Debugger Agent.
zh_tw: 將 ``Mono 除錯連接埠`` 設為 Godot 中 --> [專案] -> [專案設定] -> [Mono] -> [Debugger Agent] 中的連接埠。

source: Also select ``Wait for Debugger`` in the Godot Mono options. `This Godot Addon <https://godotengine.org/asset-library/asset/435>`_ may be helpful.
es: También selecciona "Esperar por el depurador" en las opciones de Godot Mono. "Este plugin Godot <https://godotengine.org/asset-library/asset/435>`_ puede ser útil.
fr: Sélectionnez également ``Wait for Debugger`` dans les options de la Mono Godot. `Cet addon Godot <https://godotengine.org/asset-library/asset/435>`_ peut être utile.
ja: また、GodotのMonoオプションで``Wait For Debugger`` オプションを選択してください。\ `このGodotアドオン <https://godotengine.org/asset-library/asset/435>` が役に立つかもしれません。
ru: Также выберите ``Wait for Debugger`` в настройках Godot Mono. `Этот аддон для Godot <https://godotengine.org/asset-library/asset/435>`_ может быть полезен.
uk: Виберіть також ``Wait for Debugger`` в параметрах Godot Mono. `Цей Godot Addon <https://godotengine.org/asset-library/asset/435>`_ може бути корисним.
zh_tw: 也在 Godot Mono 選項中選擇 ``Wait for Debugger`` 。`這個 Godot 擴充功能 <https://godotengine.org/asset-library/asset/435>`_ 也許有幫助。

source: Run the game in Godot. It should hang at the Godot splash screen while it waits for your debugger to attach.
es: Ejecuta el juego en Godot. Debería colgarse en la pantalla de bienvenida de Godot mientras espera a que tu depurador se conecte.
fr: Exécutez le jeu dans Godot. Il devrait se bloquer sur l'écran de démarrage Godot pendant qu'il attend que votre débogueur se connecte.
ja: Godotでゲームを実行してください。Godotのスプラッシュ・スクリーンでデバッガがアタッチされるのを待つために止まるでしょう。
ru: Запустите игру в Godot. Она должна зависнуть на заставке Godot в ожидании подключения вашего отладчика.
uk: Запустіть гру в Godot. Він повинен висіти на екрані привітання Godot, поки він чекає, коли ваш налагоджувач прикріпиться.
zh_tw: 在 Godot 中執行遊戲。這時應該會停止在 Godot 啟動畫面，並等待除錯工具附加到遊戲上。

source: In VS 2019, open your project and choose Extensions --> Mono --> Attach to Mono Debugger.
es: En Visual Studio 2019, abra su proyecto y elija Extensiones --> Mono --> Adjuntar al Depurador Mono.
fr: Dans VS 2019, ouvrez votre projet et choisissez Extensions --> Mono --> Attach to Mono Debugger.
ja: VS2019で、プロジェクトを開いて 拡張機能 --> Mono --> Attach to Mono Debugger を選択してください。
ru: В VS 2019 откройте свой проект и выберите Extensions --> Mono --> Attach to Mono Debugger.
uk: У VS 2019 відкрийте проект та виберіть Extensions --> Mono --> Attach to Mono Debugger (Розширення -> Моно -> Приєднати до Mono Debugger).
zh_tw: 在 VS 2019 中打開專案並選擇 [擴充套件] --> [Mono] -> [附加到 Mono 除錯工具]。

source: Configuring Visual Studio Code for debugging
es: Configurar el código de Visual Studio para la depuración
fr: Configuration de Visual Studio Code pour le débogage
ru: Настройка Visual Studio Code для отладки (дебаггинга)
zh_tw: 設定 Visual Studio Code 以進行除錯

source: To configure Visual Studio Code for debugging open up a project in Godot. Click on Project and open the project settings. Scroll down and click on Debugger Agent under the Mono category. Then turn on the setting "wait for debugger." Next, copy the port number and open up Visual Studio Code.
fr: Pour configurer Visual Studio Code pour le débogage, ouvrez un projet Godot. Cliquez sur Projet et ouvrez les paramètres du projet. Faites défiler vers le bas et cliquez sur "Debugger Agent" sous la catégorie "Mono". Activez ensuite le paramètre "wait for debugger". Ensuite, copiez le numéro de port et ouvrez Visual Studio Code.

source: You need to download the Mono Debug extension from Microsoft. Then open the Godot project folder. Go to the run tab and click on create a launch.json file. Select C# Mono from the dropdown menu. When the launch.json file is automatically opened, change the port number to the number you copied previously and save the file. On the run tab, switch the run setting from launch to attach. Whenever you want to debug, make sure Wait for Debugger is turned on in Godot, run the project, and run the debugger in Visual Studio Code.
fr: Vous devez télécharger l'extension Mono Debug de Microsoft. Ensuite, ouvrez le dossier du projet Godot. Allez dans l'onglet run et cliquez sur "create a launch.json file". Sélectionnez C# Mono dans le menu déroulant. Lorsque le fichier "launch.json" est automatiquement ouvert, changez le numéro de port pour celui que vous avez copié précédemment et enregistrez le fichier. Dans l'onglet run, changez le paramètre "run" de "launch" à "attach". Chaque fois que vous voulez déboguer, assurez-vous que l'option "Wait for Debugger" est activée dans Godot, exécutez le projet et lancez le débogueur dans Visual Studio Code.

source: C# basics
es: Conceptos básicos de C #
pt_br: Noções básicas de C#
ru: Основы C#
zh_tw: C# 基礎

source: Introduction
es: Introducción
ja: はじめに
ko: 소개
pt_br: Introdução
ru: Введение
uk: Вступ
zh_tw: 簡介

source: In Godot's Editor Settings:
es: En los Ajustes del Editor de Godot:
ru: В настройках редактора Godot:

source: Set **Mono External Editor** to **JetBrains Rider**.
es: Establece **Mono External Editor** a **JetBrains Rider**.
ru: Установите **Mono External Editor** на **JetBrains Rider**.

source: set **Mono Build Tool** to **JetBrains Mono**.
es: establezca **Mono Build Tool** en **JetBrains Mono**.

source: Set **MSBuild version** to either **Bundled with Rider** or **.NET Core**.
es: Establezca la **Vesión de MSBuild** para que ya sea incluido con Rider o **.NET Core**.
ru: Установите **MSBuild version** либо **в комплекте с Rider**, либо с **.NET Core**.

source: Install the **Godot support** plugin.
es: Instale el plugin de **Godot support**.
pt_br: Instale o plugin de **suporte do Godot**.
ru: Установите плагин **Godot support**(**Поддержка Godot**).
zh_tw: 安裝 **Godot support** 外掛。

source: If you are using Visual Studio 2019, you must follow the instructions found in the `:ref:doc_c_sharp_configuring_vs_2019_for_debugging` section below.
es: Si está utilizando Visual Studio 2019, debe seguir las instrucciones que se encuentran en la sección `:ref:doc_c_sharp_configuring_vs_2019_for_debugging` a continuación..
ru: Если вы используете Visual Studio 2019, вам необходимо следовать инструкциям, приведенным в разделе`:ref: настройка C# в VS 2019 для дебаггинга doc_c_sharp_configuring_vs_2019_for_debugging` ниже.

source: After you successfully set up C# for Godot, you should see the following option when selecting **Attach Script** in the context menu of a node in your scene:
es: Después de configurar con éxito C# para Godot, debería ver la siguiente opción al seleccionar **Añadir script** en el menú contextual de un nodo en su escena:
pt_br: Depois de configurar com sucesso o C# para Godot, você deverá ver a seguinte opção ao selecionar **Attach Script** no menu de contexto de um nó em sua cena:
zh_tw: 成功為 Godot 設定好 C# 後，應該可以在從場景中節點右鍵選單中選擇 **[附加腳本]** 時看到下列選項：

source: You need to (re)build the project assemblies whenever you want to see new exported variables or signals in the editor. This build can be manually triggered by clicking the word **Mono** at the bottom of the editor window to reveal the Mono panel, then clicking the **Build Project** button.
es: Necesita (re) construir los ensamblajes del proyecto cada vez que desee ver nuevas variables o señales exportadas en el editor. Esta compilación se puede activar manualmente haciendo clic en la palabra **Mono** en la parte inferior de la ventana del editor para revelar el panel Mono, luego haciendo clic en el botón **Crear proyecto**.
zh_tw: 使用 C# 時，若要看到新匯出的變數或訊號，就需要建置或重新建置專案。要重新建置專案可以手動點擊編輯器視窗底部的 **[Mono]** 文字來打開 Mono 面板，然後點擊 **[建置專案]** 按鈕。

source: You will also need to rebuild the project assemblies to apply changes in "tool" scripts.
es: También tendrás que reconstruir los ensamblajes del proyecto para aplicar los cambios en los scripts de las "herramientas".
pt_br: Você também precisará reconstruir os assemblies do projeto para aplicar alterações nos scripts de "ferramenta".
ru: Вам также потребуется перестроить сборки проекта, чтобы применить изменения в скриптовых "инструментах".
zh_tw: 接著還需要重新建置專案組建，以套用「工具」腳本中的改動。

source: As of Godot 3.2.2, exporting Mono projects is supported for desktop platforms (Linux, Windows and macOS), Android, HTML5, and iOS. The only platform not supported yet is UWP.
es: Así como Godot 3.2.2 soporta la exportación de proyectos Mono a plataformas de escritorio (Linux, Windows y macOS). Android, iOS, HTML5 y UWP no son compatibles actualmente.
ru: Для Godot 3.2.2., экспорт Mono проектов доступен для настольных платформ (Linux, Windows и macOS), Android, HTML5, и iOS. Единственная пока что не поддерживаемая платформа это UWP.

source: To configure debugging, open Visual Studio Code and download the Mono Debug extension from Microsoft and the Godot extension by Ignacio. Then open the Godot project folder in VS Code. Go to the Run tab and click on **create a launch.json file**. Select **C# Godot** from the dropdown menu. Now, when you start the debugger in VS Code your Godot project will run.
es: Para configurar la depuración, abre el código de Visual Studio y descarga la extensión Mono Debug de Microsoft y la extensión Godot hecha por Ignacio. Luego abre la carpeta del proyecto Godot en VS Code. Ve a la pestaña Ejecutar y haz clic en **crear un archivo launch.json**. Selecciona **C# Godot** en el menú desplegable. Ahora, cuando inicies el depurador en VS Code tu proyecto Godot se ejecutará.
ru: Чтобы настроить отладку, откройте Visual Studio Code и загрузите расширение Mono Debug от Microsoft и расширение Godot от Ignacio. Затем откройте папку проекта Godot в VS Code. Перейдите на вкладку Run и нажмите **create a launch.json file**. В раскрывающемся меню выберите **C# Godot**. Теперь, когда вы запустите отладчик в VS Code, ваш проект Godot будет запущен.
zh_tw: 若要設定除錯功能，請開啟 Visual Studio Code 並從 Microsoft 下載 Mono Debug 擴充套件與 Ignacio 製作的 Godot 擴充套件。接著以 VS Code 開啟 Godot 專案資料夾。然後前往 [執行] (Run) 分頁並點擊 **建立 launch.json 檔案** ，並從下拉選單中選擇 **C# Godot** 。接著便能在 VS Code 中開啟除錯工具來執行 Godot 專案。

source: Prerequisites
pt_br: Pré-requisitos

source: Install the latest stable version of `.NET Core SDK <https://dotnet.microsoft.com/download/dotnet-core>`__ (3.1 as of writing).
pt_br: Instale a versão estável mais recente do `.NET Core SDK <https://dotnet.microsoft.com/download/dotnet-core>`__ (3.1 no momento da escrita).

source: From Godot 3.2.3 onwards, installing Mono SDK is not a requirement anymore, except it is required if you are building the engine from source.
pt_br: A partir do Godot 3.2.3, a instalação do Mono SDK não é mais um requisito, exceto se você estiver compilando o motor a partir do código-fonte.

source: Godot bundles the parts of Mono needed to run already compiled games, however Godot does not include the tools required to build and compile games, such as MSBuild. These tools need to be installed separately. The required tools are included in the .NET Core SDK. MSBuild is also included in the Mono SDK, but it can't build C# projects with the new ``csproj`` format, therefore .NET Core SDK is required for Godot 3.2.3+.
pt_br: O Godot empacota as partes do mono necessárias para executar jogos já compilados, no entanto o Godot não inclui as ferramentas necessárias para construir e compilar jogos, como MSBuild. Estas ferramentas precisam ser instaladas separadamente. As ferramentas necessárias estão inclusas no SDK .NET Core. O MSBuild também está incluso no SDK Mono, mas ele não pode compilar projetos com o novo formato ``csproj``, portanto o SDK .NET Core é necessário para o Godot 3.2.3+.

source: In summary, you must have installed .NET Core SDK **and** the Mono-enabled version of Godot.
pt_br: Em resumo, você deve ter instalado o SDK .NET Core **e** a versão do Godot com Mono habilitada.

source: Be sure to install the 64-bit version of the SDK(s) if you are using the 64-bit version of Godot.
pt_br: Certifique-se de instalar a versão de 64 bits do(s) SDK(s) se estiver usando a versão de 64 bits do Godot.

source: If you are building Godot from source, install the latest stable version of `Mono <https://www.mono-project.com/download/stable/>`__, and make sure to follow the steps to enable Mono support in your build as outlined in the :ref:`doc_compiling_with_mono` page.
pt_br: Se você estiver compilando o Godot a partir do código-fonte, instale a versão estável mais recente do `Mono <https://www.mono-project.com/download/stable/>`__, e certifique-se de seguir os passos para habilitar o suporte ao Mono conforme descrito na página :ref:`doc_compiling_with_mono`.

source: C# support in Godot's built-in script editor is minimal. Consider using an external IDE or editor, such as `Visual Studio Code <https://code.visualstudio.com/>`__ or MonoDevelop. These provide autocompletion, debugging, and other useful features for C#. To select an external editor in Godot, click on **Editor → Editor Settings** and scroll down to **Mono**. Under **Mono**, click on **Editor**, and select your external editor of choice. Godot currently supports the following external editors:
pt_br: O suporte a C# no editor de scripts embutido do Godot é minimo. Considere usar uma IDE ou editor externos, como por exemplo `Visual Studio Code <https://code.visualstudio.com/>`_ ou MonoDevelop. Estes editores possuem preenchimento automático, ferramentas de depuração e outras funcionalidades úteis para o desenvolvimento em C#. Para selecionar um editor externo no Godot, clique em **Editor -> Configurações do Editor** e role a página até o **Mono**. Em **Mono**, clique em **Editor** então selecione o editor de sua preferência. Godot atualmente dá suporte aos seguintes editores externos:

source: See the following sections for how to configure an external editor:
pt_br: Veja as seções a seguir sobre como configurar um editor externo:

source: After reading the "Prerequisites" section, you can download and install `JetBrains Rider <https://www.jetbrains.com/rider/download>`__.
pt_br: Após ler a seção "Pré-requisitos", você pode baixar e instalar o `JetBrains Rider <https://www.jetbrains.com/rider/download>`__.

source: In Godot's **Editor → Editor Settings** menu:
pt_br: No menu **Editor → Configurações do Editor** do Godot:

source: Set **Mono** -> **Editor** -> **External Editor** to **JetBrains Rider**.
pt_br: Defina **Mono** -> **Editor** -> **External Editor** como **JetBrains Rider**.

source: Set **Mono** -> **Builds** -> **Build Tool** to **dotnet CLI**.
pt_br: Defina **Mono** -> **Builds** -> **Build Tool** para **dotnet CLI**.

source: Set **MSBuild version** to **.NET Core**.
pt_br: Defina a **versão do MSBuild** para **.NET Core**.

source: After reading the "Prerequisites" section, you can download and install `Visual Studio Code <https://code.visualstudio.com/download>`__ (aka VS Code).
pt_br: Após ler a seção "Pré-requisitos", você pode baixar e instalar o `Visual Studio Code <https://code.visualstudio.com/download>`__ (também conhecido como VS Code).

source: Set **Mono** -> **Editor** -> **External Editor** to **Visual Studio Code**.
pt_br: Defina **Mono** -> **Editor** -> **External Editor** para **Visual Studio Code**.

source: In Visual Studio Code:
pt_br: No Visual Studio Code:

source: Install the `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__ extension.
pt_br: Instale a extensão `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__.

source: Install the `Mono Debug <https://marketplace.visualstudio.com/items?itemName=ms-vscode.mono-debug>`__ extension.
pt_br: Instale a extensão `Mono Debug <https://marketplace.visualstudio.com/items?itemName=ms-vscode.mono-debug>`__.

source: Install the `C# Tools for Godot <https://marketplace.visualstudio.com/items?itemName=neikeq.godot-csharp-vscode>`__ extension.
pt_br: Instale a extensão `C# Tools for Godot <https://marketplace.visualstudio.com/items?itemName=neikeq.godot-csharp-vscode>`__.

source: To configure a project for debugging open the Godot project folder in VS Code. Go to the Run tab and click on **create a launch.json file**. Select **C# Godot** from the dropdown menu. Now, when you start the debugger in VS Code your Godot project will run.
pt_br: Para configurar um projeto para depuração, abra a pasta do seu projeto no VSCODE. Vá até a aba Run e clique em **create a launch.json file**. Selecione **C# Godot** no menu flutuante. Agora, quando você começar o depurador no VS Code, o seu projeto na Godot irá iniciar.

source: Visual Studio (Windows only)
pt_br: Visual Studio (somente Windows)

source: Download and install the latest version of `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__. Visual Studio will include the required SDKs if you have the correct workloads selected, so you don't need to manually install the things listed in the "Prerequisites" section.
pt_br: Baixe e instale a última versão do `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__. O Visual Studio incluirá os SDKs necessários se você tiver as cargas de trabalho corretas selecionadas, para que você não precise instalar manualmente as coisas listadas na seção "Pré-requisitos".

source: While installing Visual Studio, select these workloads:
pt_br: Ao instalar o Visual Studio, selecione estas cargas de trabalho:

source: Mobile development with .NET
pt_br: Desenvolvimento mobile com .NET

source: .NET Core cross-platform development
pt_br: Desenvolvimento de plataforma cruzada do .NET Core
