Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/c_sharp/c_sharp_basics.po
Languages: es, fr, ja, ko, pt_br, ru, uk, zh_tw

source: As C# support is quite new in Godot, there are some growing pains and things that need to be ironed out. Below is a list of the most important issues you should be aware of when diving into C# in Godot, but if in doubt, also take a look over the official `issue tracker for Mono issues <https://github.com/godotengine/godot/labels/topic%3Amono>`_.
es: Como el soporte de C# es bastante nuevo en Godot, hay algunos problemas de desarrollo y cosas que necesitan ser solucionadas. Abajo hay una lista de los temas más importantes que debes tener en cuenta cuando te sumerjas en C# en Godot, pero si tienes alguna duda, también puedes echar un vistazo al `rastreador oficial de incidencias de Mono <https://github.com/godotengine/godot/labels/topic%3Amono>`_.
fr: Comme le support C# est plutôt nouveau pour Godot, il y a des petits problèmes et des choses qui doivent encore être ajustées. Voici une liste des problèmes les plus importants dont vous devriez être conscient lorsque vous vous plongez avec C# dans Godot, mais en cas de doute, jetez également un coup d’œil sur le `tracker officiel des problèmes liés à Mono <https://github.com/godotengine/godot/labels/topic%3Amono>`_.
ja: GodotでのC#のサポートは非常に新しいため、いくつかの苦労や解決する必要があるものがあります。以下は、GodotでC#に飛び込む際に注意する必要がある最も重要な問題の一覧ですが、疑問がある場合は、公式の `issue tracker for Mono issues <https://github.com/godotengine/godot/labels/topic%3Amono>` もご覧ください。
pt_br: Como o suporte ao C# é bastante novo no Godot, existem alguns sacrifícios e coisas que ainda precisam ser resolvidas. Abaixo segue uma lista das questões mais importantes que você deve estar ciente ao mergulhar em C# no Godot, mas em caso de dúvida, também dê uma olhada no `rastreador de problemas para Mono <https://github.com/godotengine/godot/labels/topic%3Amono>`_ oficial.
ru: Поскольку поддержка C# введена относительно недавно, в ней всё ещё присутствуют "детские болячки" и проблемы, которые необходимо устранить. Ниже вы найдёте список наиболее важных проблем, о существовании которых вам следовало бы знать, при использовании C# вместе с Godot. Если есть какие-то сомнения, вы также можете заглянуть на `официальный трекер проблем/запросов Mono <https://github.com/godotengine/godot/labels/topic%3Amono>`_.
uk: Оскільки підтримка C# є абсолютно новою у Godot, є деякі дитячі болячки та речі, які потрібно випрасувати. Нижче наведено перелік найважливіших проблем, про які слід пам'ятати при використанні C# в Godot, але якщо ви сумніваєтесь, перегляньте офіційний `випуск трекера для випусків Mono <https://github.com/godotengine/godot/labels/topic%3Amono>`_.
zh_tw: 由於 Godot 中的 C# 支援還很新，所以還有一些需要解決的問題。下表為在 Godot 中使用 C# 需要注意的幾個最重要的問題，另外也請參考一下官方的 `Mono 問題追蹤器 <https://github.com/godotengine/godot/labels/topic%3Amono>`_ 。

source: As explained above, the C# project isn't always kept in sync automatically when things are deleted, renamed or moved in Godot (`#12917 <https://github.com/godotengine/godot/issues/12917>`_).
fr: Comme expliqué ci-dessus, le projet C# n'est pas toujours synchronisé automatiquement lorsque des choses sont supprimées, renommées ou déplacées dans Godot (`#12917 <https://github.com/godotengine/godot/issues/12917>`_).
ja: 上記で説明したように、C#プロジェクトは、Godotで削除、名前変更、または移動を行ったときに、常に自動的に同期されるとは限りません(`#12917 <https://github.com/godotengine/godot/issues/12917>`_)。

source: Writing editor plugins is possible, but it is currently quite convoluted.
es: Es posible crear plugins para el editor, pero actualmente es bastante complicado.
fr: L'écriture de plugins éditeur est possible, mais elle est actuellement assez compliquée.
ja: エディタプラグインの作成は可能ですが、現在は非常に複雑です。
pt_br: Escrever plugins para o editor é possível, mas atualmente é bastante complicado.
ru: Написание плагинов для редактора возможно, но в настоящее время это довольно затруднительно.
uk: Написання плагінів редактора можливе, але наразі це досить складно.
zh_tw: 雖然還是可以寫編輯器外掛，但目前很複雜。

source: State is currently not saved and restored when hot-reloading, with the exception of exported variables.
es: Actualmente, el estado no se está guardando y se restaura durante la recarga en caliente, con la excepción de las variables exportadas.
fr: L'état n'est actuellement ni sauvegardé, ni restauré lors d'un re-chargement à chaud, à l'exception des variables exportées.
ja: 現在、エクスポートされた変数を除き、状態(State)は保存およびホットリロード時に復元されません。
pt_br: Atualmente o estado não é salvo e restaurado durante o "hot-reloading", com exceção das variáveis exportadas.
ru: В данный момент, при выполнении горячей-перезагруки, состояние не сохраняется и не восстанавливается, за исключением экспортируемых переменных.
uk: Наразі стан не зберігається та не відновлюється під час гарячого перезавантаження, за винятком експортованих змінних.
zh_tw: 除了匯出的變數以外，熱重載時狀態不會保存並重新載入。

source: Exporting Mono projects is supported for desktop platforms (Linux, Windows and macOS), Android, HTML5, and iOS. UWP is not currently supported. (`#20271 <https://github.com/godotengine/godot/issues/20271>`_).
fr: L'exportation de projets Mono est prise en charge pour les plateformes de bureau (Linux, Windows et macOS), Android, HTML5 et iOS. L'UWP n'est pas pris en charge pour l'instant. (`#20271 <https://github.com/godotengine/godot/issues/20271>`_).

source: Attached C# scripts should refer to a class that has a class name that matches the file name.
es: Los scripts adjuntos de C# deben referirse a una clase que tenga el mismo nombre que el nombre del archivo. O lo que es lo mismo, el nombre de la clase que se declara en el script y el nombre del archivo deben ser igual.
fr: Les scripts C# joints doivent se référer à une classe dont le nom de classe correspond au nom du fichier.
ja: アタッチされた C#スクリプトは、ファイル名と一致するクラス名を持つクラスを参照する必要があります。
pt_br: Os scripts C# anexados devem se referir a uma classe que tenha um nome de classe que corresponda ao nome do arquivo.
ru: Прикрепленные C# скрипты должны относиться к классу, который имеет имя класса, соответствующее имени файла.
uk: Вкладені скрипти C# повинні стосуватися класу, який має ім'я класу, яке відповідає імені файлу.
zh_tw: 附加 C# 腳本時參照的類別名稱必須與檔名一致。

source: There are some methods such as ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` and signal connection method ``Connect()`` that rely on Godot's ``snake_case`` API naming conventions. So when using e.g. ``CallDeferred("AddChild")``, ``AddChild`` will not work because the API is expecting the original ``snake_case`` version ``add_child``. However, you can use any custom properties or methods without this limitation.
es: Hay algunos métodos como ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` y el método de conexión de señales ``Connect()`` que se basan en las convenciones de nomenclatura de la API ``snake_case`` de Godot. Así que cuando se utiliza, por ejemplo, ``CallDeferred("AddChild")``, ``AddChild`` no funcionará porque la API está esperando la versión original de ``snake_case`` ``add_child``. Sin embargo, puedes usar cualquier propiedad o método personalizado sin esta limitación.
fr: Il existe des méthodes telles que ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` et la méthode de connexion de signal ``Connect()`` qui reposent sur les conventions de nommage API ``snake_case`` de Godot. Ainsi, lorsque vous utilisez par exemple ``CallDeferred("AddChild")``, ``AddChild`` ne fonctionnera pas car l'API attend la version originale ``snake_case`` version ``add_child``. Cependant, vous pouvez utiliser n'importe quelles propriétés ou méthodes personnalisées sans cette limitation.
ja: Godot の ``snake_case`` API 命名規則に依存する ``Get()``/``Set()`` 、\ ``Call()``/``CallDeferred()`` 及びシグナル接続メソッド ``Connect()`` などのメソッドがあります。したがって、例えば ``CallDeferred("AddChild")`` を使用する場合、APIは本来の ``snake_case`` バージョンである ``add_child``を期待しているため、\ ``AddChild`` では動作しません。ただし、任意のカスタムプロパティまたはカスタムメソッドはこの制限なしに使用できます。
pt_br: Existem alguns métodos como ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` e método de conexão de sinal ``Connect()`` que dependem dos padrões de nomeação da API ``snake_case`` de Godot. Então, por exemplo ao usar ``CallDeferred("AddChild")``, ``AddChild`` não vai funcionar porque a API está esperando a chamada no formato ``snake_case`` como ``add_child``. No entanto, você pode usar quaisquer propriedades ou métodos personalizados sem essa limitação.
ru: Есть некоторые методы, такие как `` Get () `` / `` Set () ``, `` Call () `` / `` CallDeferred () `` и метод соединения сигналов `` Connect () ``, которые полагаются на соглашениях именования API ``snake_case`` от Godot. Так, например, при использовании `` CallDeferred ("AddChild") ``, `` AddChild`` не будет работать, потому что API ожидает исходную `` snake_case`` версию `` add_child``. Однако вы можете использовать любые пользовательские свойства или методы без этого ограничения.
uk: Існують деякі методи, такі як ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` і метод з'єднання сигналів ``Connect()``, які покладаються на умови іменування API Godot ``snake_case``. Тому при використанні, наприклад ``CallDeferred("AddChild")``, ``AddChild`` не буде працювати, оскільки API очікує версію ``snake_case``, тобто ``add_child``. Однак ви можете використовувати будь-які власні властивості, або методи, без цього обмеження.
zh_tw: 有些方法，如 ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` 與訊號連接方法 ``Connect()`` 都還依賴 Godot 的 ``snake_case`` API 命名規範。所以使用如 ``CallDeferred("AddChild")`` 時，無法正常使用 ``AddChild`` ，因為 API 預期使用原本 ``snake_case`` 版的 ``add_child`` 。但依然可以使用自定屬性與方法而不受此限。

source: Performance of C# in Godot
es: Rendimiento de C# en Godot
fr: Performance du C# dans Godot
ja: GodotにおけるC#のパフォーマンス
ko: Godot에서 C#의 퍼포먼스
pt_br: Desempenho do C# no Godot
ru: Производительность C# в Godot
uk: Продуктивність C# у Godot
zh_tw: Godot 中的 C# 效能

source: According to some preliminary `benchmarks <https://github.com/cart/godot3-bunnymark>`_, the performance of C# in Godot — while generally in the same order of magnitude — is roughly **~4×** that of GDScript in some naive cases. C++ is still a little faster; the specifics are going to vary according to your use case. GDScript is likely fast enough for most general scripting workloads. C# is faster, but requires some expensive marshalling when talking to Godot.
es: De acuerdo con algunos `benchmarks preliminares <https://github.com/cart/godot3-bunnymark>`_, el rendimiento de C# en Godot - aunque generalmente en el mismo orden de magnitud - es aproximadamente **~4×** el de GDScript en algunos casos ingenuos. C++ es todavía un poco más rápido; las especificaciones van a variar de acuerdo a su caso de uso. GDScript probablemente sea lo suficientemente rápido para la mayoría de las cargas de trabajo de scripting habituales. C# es más rápido, pero requiere de una organización más costosa cuando se comunica con Godot.
fr: Selon quelques `benchmarks préliminaires <https://github.com/cart/godot3-bunnymark>`_, la performance du C# dans Godot - bien que généralement du même ordre de grandeur - est approximativement **~4x** celle du GDScript dans certains cas naïfs. Le C++ est encore un peu plus rapide ; les spécificités vont varier en fonction de votre cas d'utilisation. GDScript est probablement assez rapide pour la plupart des charges de travail des script en général. C# est plus rapide, mais nécessite une transformation des objets coûteuse lorsqu'il parle à Godot.
ja: いくつかの予備的な `ベンチマーク <https://github.com/cart/godot3-bunnymark>` によると、一般的にGodot のC#のパフォーマンスはGDScriptと同程度ですが、いくつかの単純なケースではGDScriptの約 **～4倍** です。C++はさらにもう少し高速です。具体的な内容はユースケースによって異なります。GDScriptは、ほとんどの一般的なスクリプトワークロードに対して十分に高速である可能性があります。C#そのものは高速ですが、Godotと通信するときに負荷の高い形式変換処理が必要です。
pt_br: De acordo com alguns `benchmarks <https://github.com/cart/godot3-bunnymark>`_ preliminares, o desempenho do C# no Godot — embora geralmente na mesma ordem de magnitude — é aproximadamente **~ 4x** o do GDScript em alguns casos simples. Para o desempenho total, o C++ ainda é um pouco mais rápido; os detalhes vão variar de acordo com o seu caso de uso. O GDScript provavelmente é rápido o suficiente para a maioria das cargas de trabalho de scripts gerais. O C# é mais rápido, mas requer algum treinamento custoso quando falamos do Godot.
ru: Согласно некоторым предварительным`бенчмарк-тестам <https://github.com/cart/godot3-bunnymark>`_, производительность C# в Godot — пусть и находится в пределах одного порядка велечины — приблизительно **в ~4 раза** выше, чем в GDScript в некоторых наивных случаях. В то же время, C++ до сих пор является немного быстрее; специфика будет меняться, в зависимости от случаев использования. И всё же, быстродействия GDScript, вероятно, вполне достаточно для большинства основных скриптовых задач. Хоть C# и производительнее, но требует выполнение достаточно ресурсоёмкого маршалинга, когда речь заходит об использовании C# в Godot.
uk: Згідно з деякими попередніми `benchmarks <https://github.com/cart/godot3-bunnymark>`_, ефективність C# в Godot - хоча в цілому тої самої величини - в деяких наївних випадках приблизно в 4-ри рази вище, ніж у GDScript. C++ все ще трохи швидший; характеристики залежать від Вашого випадку використання. GDScript, ймовірно, досить швидкий для більшості загальних скриптів. C# швидше, але вимагає дорогого марширування в діалозі з Godot.
zh_tw: 根據一些初步的 `效能評定 <https://github.com/cart/godot3-bunnymark>`_ ，在一般情況下，Godot 中的 C# 效能比起一些單純的 GDScript 情況還要快上 **～ 4 倍** 。C++ 依然稍微快一點。實際情況還是依據使用方式而異。GDScript 一般來說對於普通的程式編寫來說已經夠快了，而 C# 雖然更快，但與 Godot 通訊時則需要耗費許多吃效能的封送處理。

source: Using NuGet packages in Godot
es: Uso de los paquetes NuGet en Godot
fr: Utilisation des packages Nuget dans Godot
ja: GodotでのNuGetパッケージの使用
pt_br: Usando pacotes NuGet no Godot
ru: Использование пакетов NuGet в Godot
uk: Використання пакетів Nuget у Godot
zh_tw: 在 Godot 中使用 NuGet 套件

source: `NuGet <https://www.nuget.org/>`_ packages can be installed and used with Godot, as with any C# project. Many IDEs are able to add packages directly. They can also be added manually by adding the package reference in the ``.csproj`` file located in the project root:
es: Los paquetes `NuGet <https://www.nuget.org/>`_ pueden ser instalados y usados en Godot, como en cualquier proyecto C#. Muchos IDEs pueden añadir paquetes directamente. También se pueden añadir manualmente añadiendo la referencia del paquete en el archivo ``.csproj`` ubicado en la raíz del proyecto:
fr: Les packages `NuGet <https://www.nuget.org/>`_ peuvent être installés et utilisés avec Godot, comme pour tout projet C#. De nombreux IDE peuvent ajouter des packages directement. Ils peuvent également être ajoutés manuellement en ajoutant la référence du package dans le fichier ``.csproj`` situé à la racine du projet :
ja: `NuGet <https://www.nuget.org/>` パッケージは、他のC#プロジェクトと同様に、Godotでインストールおよび使用できます。多くのIDEは、パッケージを直接追加できます。プロジェクトのルートにある ``.csproj`` ファイルにパッケージ参照を追加することにより、手動で追加することもできます:
pt_br: Pacotes `NuGet <https://www.nuget.org/>`_ podem ser instalados e usados com o Godot, como qualquer projeto. Muitas IDEs podem adicionar pacotes diretamente. Eles também podem ser adicionados manualmente adicionando a referência do pacote no arquivo ``.csproj`` localizado na pasta principal do projeto:
ru: `NuGet <https://www.nuget.org/>`_ пакеты могут быть установлены и использованы вместе с Godot, как и в любом другом C# проекте. Множество IDE способны добавлять пакеты напрямую. Если необходимо, вы можете добавить их вручную, добавив ссылку на пакет в ``.csproj`` файл, который расположен в корне проекта:
uk: Пакети `NuGet<https://www.nuget.org/>`_ можна встановлювати та використовувати з Godot, як і будь-який проект C#. Багато IDE можуть додавати пакети безпосередньо. Їх також можна додати вручну, додавши посилання на пакет у файл ``.csproj``, що знаходиться в корені проекту:
zh_tw: 可以在 Godot 中配合任意 C# 專案安裝與使用 `NuGet <https://www.nuget.org/>`_ 套件。許多 IDE 都支援直接新增套件，這些套件也可以通過在專案根目錄的 ``.csproj`` 檔內加上套件參照來手動新增：

source: By default, tools like NuGet put ``Version`` as an attribute of the ```PackageReference``` Node. **You must manually create a Version node as shown above.** This is because the version of MSBuild used requires this. (This will be fixed in Godot 4.0.)
es: Por defecto, herramientas como NuGet colocan "Version" como un atributo del nodo "PackageReference". **Debes crear manualmente un nodo de Version como se muestra arriba.** Esto se debe a que la versión de MSBuild usada requiere esto. (Esto se arreglará en Godot 4.0.)
fr: Par défaut, les outils tel que NuGet ajoutent un attribut ``Version`` au nœud ```PackageReference```. **Vous devez manuellement créer une Version de nœud, comme montré ci-dessus.** La version de MSBuild utilisée le requiert. (Cela sera corrigé dans Godot 4.0.)
ja: デフォルトでは、NuGetのようなツールは ``Version`` を ```PackageReference``` ノードの属性として配置します。\ **上記のように、バージョンノードを手動で作成する必要があります。** これは、使用するMSBuildのバージョンで必要なためです。(これはGodot 4.0で修正される予定です。)
ru: По умолчанию, утилиты вроде NuGet в качестве атрибута для ```PackageReference``` используют ``Version``. **Вы должны создать узел Version вручную как показано выше.** Это требуется используемой версией MSBuild. (Будет исправлено в Godot 4.0.)
uk: За замовчуванням такі інструменти, як NuGet, ставлять ``Version`` як атрибут Вузла```PackageReference```. **Ви повинні створити Version вузла вручну, як показано вище**. Це тому, що використовувана версія MSBuild вимагає цього. (Це буде виправлено в Godot 4.0.)
zh_tw: 預設情況下，如 NuGet 之類的工具會將 ``Version`` 放在 ```PackageReference``` 節點的屬性中。 **必須手動如上所示建立 Version 節點。** 需要這麼做是因為目前的 MSBuild 版本所需。 (該問題將於 Godot 4.0 版修正。)

source: Whenever packages are added or modified, run ``nuget restore`` (*not* ``dotnet restore``) in the root of the project directory. To ensure that NuGet packages will be available for msbuild to use, run:
es: Cada vez que se añadan o modifiquen paquetes, ejecuta ``nuget restore`` (*no* ``dotnet restore``) en la raíz del directorio del proyecto. Para asegurarse de que los paquetes NuGet estén disponibles para ser usados por msbuild, ejecuta:
fr: Chaque fois que des packages sont ajoutés ou modifiés, exécutez ``nuget restore`` (*pas* ``dotnet restore``) à la racine du répertoire du projet. Afin de vous assurer que les packages NuGet seront disponibles pour msbuild, exécutez :
ja: パッケージが追加または変更されるたびに、プロジェクトディレクトリのルートで ``nuget restore`` (``dotnet restore`` *ではなく*) を実行します。Nubuildパッケージをmsbuildで使用できるようにするには、次を実行します:
ru: Всякий раз, когда пакеты были добавлены или модифицированы, следует запускать ``nuget restore`` (*не*``dotnet restore``)в корневой папке проекта. Чтобы убедиться, что пакеты NuGet будут доступны в msbuild, выполните:
uk: Кожного разу, коли пакети додаються, чи змінюються, запустіть ``nuget restore`` (*не* ``dotnet restore``) у корені каталогу проекту. Щоб переконатися, що пакети NuGet будуть доступні для msbuild для використання, запустіть:
zh_tw: 每當套件新增或修改後，請在專案根目錄執行 ``nuget restore`` (**不是** ``dotnet restore``)。要確保 msbuild 能使用 NuGet 套件，請執行：

source: Profiling your C# code
es: Evaluando tu código C#
fr: Profilage de votre code C#
ja: C#コードのプロファイリング
pt_br: Perfilando seu código C#
ru: Профилирование вашего C# кода
uk: Профілювання коду C #
zh_tw: 對 C# 程式進行程式碼剖析

source: `Mono log profiler <https://www.mono-project.com/docs/debug+profile/profile/profiler/>`_ is available for Linux and macOS. Due to a Mono change, it does not work on Windows currently.
es: `Mono log profiler <https://www.mono-project.com/docs/debug+profile/profile/profiler/>`_ está disponible para Linux y macOS. Debido a un cambio de Mono, no funciona en Windows actualmente.
fr: `Mono log profiler <https://www.mono-project.com/docs/debug+profile/profile/profiler/>`_ est disponible pour Linux et macOS. En raison d'un changement de Mono, il ne fonctionne pas sur Windows actuellement.
ja: `Mono log profiler <https://www.mono-project.com/docs/debug+profile/profile/profiler/>`_ はLinuxおよびmacOSで利用可能です。\ Monoの変更により、現在Windowsでは機能しません。
pt_br: `Mono log profiler <https://www.mono-project.com/docs/debug+profile/profile/profiler/>`_ está disponível para Linux e macOS. Devido a uma mudança do Mono, ele não funciona no Windows atualmente.
ru: `Mono log profiler (Mono профайлер логов) <https://www.mono-project.com/docs/debug+profile/profile/profiler/>` _ доступен для Linux и macOS. Из-за изменения Mono, он не работает на Windows на данный момент.
uk: `Профілер логів Mono <https://www.mono-project.com/docs/debug+profile/profile/profiler/>`_ доступний для Linux та macOS. Внаслідок зміни Mono, він наразі не працює в Windows.
zh_tw: 在 Linux 與 macOS 中可以使用 `Mono Log Profiler <https://www.mono-project.com/docs/debug+profile/profile/profiler/>`_ 。由於 Mono 的更改，目前該工具無法在 Windows 上使用。

source: External Mono profiler like `JetBrains dotTrace <https://www.jetbrains.com/profiler/>`_ can be used as described `here <https://github.com/godotengine/godot/pull/34382>`_.
es: Un perfil Mono externo como `JetBrains dotTrace <https://www.jetbrains.com/profiler/>`_ puede ser usado como se describe `aquí <https://github.com/godotengine/godot/pull/34382>`_.
fr: Un profiler Mono externe comme `JetBrains dotTrace <https://www.jetbrains.com/profiler/>`_ peut être utilisé comme décrit `ici <https://github.com/godotengine/godot/pull/34382>`_.
ja: `こちら<https://github.com/godotengine/godot/pull/34382>` _ で説明されている方法で、\ `JetBrains dotTrace <https://www.jetbrains.com/profiler/>` _ のような外部のMonoプロファイラーを使用できます。
pt_br: Profiler de Mono Externo como `JetBrains dotTrace <https://www.jetbrains.com/profiler/>`_ pode ser usado como descrito `aqui <https://github.com/godotengine/godot/pull/34382>`_.
ru: Внешний моно-профилировщик, такой как `JetBrains dotTrace <https://www.jetbrains.com/profiler/>` _, можно использовать, как описано `здесь <https://github.com/godotengine/godot/pull/34382>` _.
uk: Зовнішній Mono профілер типу `JetBrains dotTrace <https://www.jetbrains.com/profiler/>`_ можна використовувати, як описано `тут<https://github.com/godotengine/godot/pull/34382>`_.
zh_tw: 如 `JetBrains dotTrace <https://www.jetbrains.com/profiler/>`_ 等外部 Mono 剖析器可以按照 `這裡 <https://github.com/godotengine/godot/pull/34382>`_ 說明的方式使用。

source: Configuring VS 2019 for debugging
es: Configurando Visual Studio 2019 para la depuración
fr: Configuration de VS 2019 pour le débogage
ja: VS2019をデバッグ用に構成する
ru: Настройка VS 2019 для отладки
uk: Налаштування VS 2019 для налагодження
zh_tw: 設定 VS 2019 以進行除錯
