Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/android_custom_build.po
Languages: de, es, fr, ja, ko, ru, uk, zh_cn, zh_tw

source: We need to setup the directory structure this way for the sdkmanager (inside the bin folder) to work.
de: Wir müssen die Verzeichnisstruktur auf diese Weise einrichten, damit der sdkmanager (innerhalb des Ordners bin) funktioniert.
es: Necesitamos configurar la estructura de este modo para que funcione el sdkmanager (dentro de la carpeta bin).
fr: Nous devons configurer la structure des répertoires de cette façon pour que le sdkmanager (à l'intérieur du dossier bin) fonctionne.
ru: Нам нужно настроить структуру каталогов таким образом, чтобы sdkmanager (внутри папки bin) работал.
zh_cn: 为了让sdkmanager（在bin文件夹下）能正常工作，需要用这种方式设置目录结构。
zh_tw: 需要像這樣建立資料夾結構，這樣 sdkmanager (在 bin 資料夾內) 才能正常使用。

source: Accepting the licenses
de: Die Lizenz akzeptieren
es: Aceptando las licencias
fr: Acceptation des licences
ja: ライセンスへの同意
ru: Принятие лицензий
zh_cn: 接受许可证
zh_tw: 同意授權條款

source: To be able to use the Android SDK tools, Google requires you to accept its licenses.
de: Um die Android SDK-Tools verwenden zu können, müssen Sie Googles Lizenzen akzeptieren.
es: Para poder utilizar las herramientas de Android SDK, Google requiere que aceptes sus licencias.
fr: Pour pouvoir utiliser les outils du SDK Android, Google vous demande d'accepter ses licences.
ja: Android SDKツールを使用できるようにするには、そのライセンスに同意する必要があります。
ru: Чтобы использовать инструменты Android SDK, Google требует, чтобы вы приняли его лицензии.
zh_cn: 谷歌要求你接受对应的许可证，才可以使用Android SDK工具。
zh_tw: Google 要求要同意授權條款才能使用 Android SDK。

source: To do this, the ``sdkmanager`` must be executed from the command line with a special argument. Navigate to the ``tools/bin`` directory inside the SDK folder (instructions provided for Windows users, as Linux and macOS users are expected to understand how command line navigation works):
de: Dazu muss der ``sdkmanager`` von der Kommandozeile aus mit einem speziellen Argument ausgeführt werden. Navigieren Sie zum Verzeichnis ``tools/bin`` innerhalb des SDK-Ordners (Anweisungen für Windows-Benutzer, da von Linux- und MacOS-Benutzern erwartet wird, dass sie verstehen, wie die Kommandozeilen-Navigation funktioniert):
es: Para hacer esto, el ``sdkmanager`` debe ejecutarse desde línea de comandos con un argumento especial. Navega al directorio ``tools/bin`` dentro de la carpeta SDK (las instrucciones proporcionadas son para usuarios de Windows, ya que se espera que los usuarios de Linux y macOS entiendan cómo funciona la navegación por la línea de comandos):
fr: Pour ce faire, le ``sdkmanager`` doit être exécuté depuis la ligne de commande avec un argument spécial. Naviguez jusqu'au répertoire ``tools/bin`` à l'intérieur du dossier SDK (instructions fournies pour les utilisateurs de Windows, car les utilisateurs de Linux et de MacOS doivent comprendre comment fonctionne la navigation en ligne de commande) :
ja: これを行うには、コマンドラインから特別な引数を指定して ``sdkmanager`` を実行する必要があります。SDKフォルダ内の ``tools/bin`` ディレクトリに移動します(LinuxおよびmacOSユーザーはコマンドラインナビゲーションのしくみを理解することが求められているため、Windowsユーザー向けの手順を参照してください):
ru: Для этого sdkmanager должен быть запущен из командной строки со специальным аргументом. Перейдите в каталог tools / bin внутри папки SDK (инструкции предназначены для пользователей Windows, поскольку пользователи Linux и macOS должны понимать, как работает навигация по командной строке):
zh_cn: 要做到这一点，``sdkmanager`` 必须通过命令行执行，并提供一个特殊参数。导航到SDK文件夹内的 ``tools/bin`` 目录（为Windows用户提供了说明，因为Linux和macOS用户应该了解命令行导航的工作方式）:
zh_tw: 要同意授權條款，必須先從命令行中使用特別的引數來執行 ``sdkmanager`` 。前往 SDK 資料夾中的 ``tools/bin`` 資料夾 (下列解釋了 Windows 中的步驟，我們假設 Linux 與 macOS 使用者已經瞭解如何在命令行中移動目錄)：

source: Then open a command line window:
de: Öffnen Sie dann ein Befehlszeilenfenster:
es: Luego abre una venta de linea de comandos:
fr: Ouvrez ensuite une fenêtre de ligne de commande :
ja: 次に、コマンド ラインウィンドウを開きます:
ko: 그 후 명령줄 창을 엽니다:
ru: Затем откройте окно командной строки:
zh_cn: 然后打开命令行窗口：
zh_tw: 接著打開命令行視窗：

source: In there, run ``sdkmanager --licenses``:
de: falls vorhanden, starten Sie ``sdkmanager --licenses``:
es: Una vez allí, ejecuta ``sdkmanager --licenses``:
fr: Là-dedans, lancez ``sdkmanager --licenses`` :
ja: そこで ``sdkmanager --licenses`` を実行します:
ru: Там запустите sdkmanager --licenses:
zh_cn: 在那里，运行 ``sdkmanager --licenses``:
zh_tw: 在此處執行 ``sdkmanager --licenses`` ：

source: This will ask you to accept several licenses, just write ``y`` and press :kbd:`Enter` on every of them until it's done.
de: Damit werden Sie aufgefordert, mehrere Lizenzen zu akzeptieren, schreiben Sie einfach ``y`` und drücken Sie :kbd:`Enter` auf jede von ihnen, bis es fertig ist.
es: Este preguntara por la aceptación de varias licencias, solamente escribe ``y`` y presiona :kbd:`Enter` en cada uno de ellos hasta que termine.
fr: Ceci vous demandera d'accepter plusieurs licences, écrivez simplement ``y`` et appuyez sur :kbd:`Enter` sur chacune d'elles.
ja: これにより、いくつかのライセンスを受け入れるように求められます。\ ``y`` と入力し、すべてが完了するまで :kbd:`Enter` を押します。
ru: Вам будет предложено принять несколько лицензий, просто напишите «y» и нажимайте: kbd: ʻEnter` на каждой из них, пока это не будет сделано.
zh_cn: 这将要求你接受几个许可证，只要在每个许可证上写上 ``y`` ，然后按 :kbd:`Enter` ，直到完成。
zh_tw: 接著會要求你同意數個授權條款，請在每次授權條款出現後按 ``y`` 然後點擊 :kbd:`Enter` 直到完成。

source: Afterwards, install the platform tools (this is required to install ``adb``):
de: Installieren Sie danach die Plattform-Tools (dies ist erforderlich, um ``adb`` zu installieren):
es: Después, instala las herramientas de plataforma (esto es necesario para instalar ``adb``):
fr: Ensuite, installez les outils de la plate-forme (ceci est nécessaire pour installer ``adb``) :
ja: その後、プラットフォームツールをインストールします(``adb`` をインストールするために必要です):
ru: После этого установите инструменты платформы (это необходимо для установки ʻadb`):
zh_cn: 之后，安装平台工具（安装 ``adb`` 需要这个）:
zh_tw: 接著，安裝平台工具 (在安裝 ``adb`` 前必要的步驟)：

source: If you get an error saying ``Warning: Could not create settings``, try ``./sdkmanager --sdk_root=../../ --licenses`` or ``./sdkmanager --sdk_root=../../ platform-tools``. These must be executed inside the ``/tools/bin/`` folder because the path for ``--sdk_root`` is relative.
de: Wenn Sie einen Fehler mit der Meldung ``Warning: Could not create settings``, versuchen Sie ``./sdkmanager --sdk_root=../../ --licenses`` oder ``./sdkmanager --sdk_root=../../ platform-tools``. Diese müssen innerhalb des Ordners ``/tools/bin/`` ausgeführt werden, da der Pfad für ``--sdk_root`` relativ ist.
es: Si aparece un error diciendo ``Warning: Could not create settings``, intenta ``./sdkmanager --sdk_root=../../ --licenses`` o ``./sdkmanager --sdk_root=../../ platform-tools``. Esos deben ser ejecutados dentro de la carpeta ``/tools/bin/`` porque la ruta para ``--sdk_root`` es relativa.
fr: Si vous obtenez une erreur disant ``Warning: Could not create settings``, essayez ``./sdkmanager --sdk_root=../../ --licenses`` ou ``./sdkmanager --sdk_root=../../ platform-tools``. Ceux-ci doivent être exécutés dans le dossier ``/tools/bin/`` car le chemin pour ``--sdk_root`` est relatif.
ru: Если вы получаете сообщение об ошибке `` Предупреждение: не удалось создать настройки '', попробуйте `` ./sdkmanager --sdk_root = .. / .. / --licenses '' или `` ./sdkmanager --sdk_root = .. /../ платформенные инструменты ''. Они должны выполняться внутри папки / tools / bin /, поскольку путь для --sdk_root является относительным.
zh_cn: 如果收到一条这样的报错 ``Warning: Could not create settings``，尝试 ``./sdkmanager --sdk_root=../../ --licenses`` 或``./sdkmanager --sdk_root=../../ platform-tools``。这些命令必须在``/tools/bin/``文件夹里执行，因为 ``--sdk_root`` 路径是相对的。
zh_tw: 如果遇到 ``Warning: Could not create settings`` 錯誤，請試試 ``./sdkmanager --sdk_root=../../ --licenses`` 或 ``./sdkmanager --sdk_root=../../ platform-tools`` 。這兩個指令必須在 ``/tools/bin/`` 資料夾中執行，因為 ``--sdk_root`` 的路徑是相對路徑。

source: Generating the keystore
de: Einen Keystore (Schlüsselwert) generieren
es: Generación del keystore
fr: Génération du keystore
ja: キーストアの作成
ru: Создание хранилища ключей
zh_cn: 生成密钥库
zh_tw: 產生金鑰儲存區

source: Once the *platform tools* are installed, the last step is to generate a debug keystore (this is needed to build). Go up two folders by writing:
de: Sobald die *Plattform-Tools* installiert sind, besteht der letzte Schritt darin, einen Debug-Keystore zu generieren (dieser wird zum Builden benötigt). Gehen Sie zwei Ordner hoch, indem Sie schreiben:
es: Una vez se hayan instalado las *herramientas de plataforma*, el último paso es generar un debug keystore (esto es necesario para la compilación). Sube dos carpetas escribiendo:
fr: Une fois les *outils de la plate-forme* installés, la dernière étape consiste à générer un keystore de débogage (nécessaire pour générer). Remontez deux dossiers en écrivant :
ja: *プラットフォームツール* をインストールしたら、最後のステップはデバッグキーストアを生成することです(これはビルドに必要です)。次のように記述して、2つのフォルダに移動します:
ru: После установки * инструментов платформы * последним шагом будет создание хранилища ключей отладки (это необходимо для сборки). Поднимитесь на две папки вверх, написав:
zh_cn: 一旦安装了 *平台工具*，最后一步是生成调试密钥存储库（这是构建所需要的）。通过这样写，向上返回两个文件夹：
zh_tw: **平台工具** 安裝完成後，最後一個步驟就是產生除錯用金鑰儲存區了 (需要有這個才能建置)。通過下列指令來前往上兩層資料夾：

source: (or open a new shell in the ``android-sdk`` folder).
de: (oder öffnen Sie eine neue Shell im Ordner ``android-sdk``).
es: (o abre una nueva consola en la carpeta ``android-sdk``).
fr: (ou ouvrez un nouveau shell dans le dossier ``android-sdk``).
ja: (または ``android-sdk`` フォルダで新しいシェルを開きます)。
ru: (или откройте новую оболочку в папке «android-sdk»).
zh_cn: （或者在 ``android-sdk`` 文件夹中打开一个新的Shell）。
zh_tw: (或是在 ``android-sdk`` 資料夾中開啟新 Shell)。

source: And you need to input the following line (This should work out of the box. However, if you haven't set the ``JAVA_HOME`` variable on Windows, there are further instructions below):
de: Und Sie müssen die folgende Zeile eingeben (Dies sollte ohne weiteres möglich sein. Wenn Sie jedoch die ``JAVA_HOME`` Variable unter Windows nicht gesetzt haben, gibt es unten weitere Anweisungen):
es: Y debe ingresar la siguiente línea (Esto debería funcionar de inmediato. Sin embargo, si no ha configurado la variable ``JAVA_HOME`` en Windows, hay más instrucciones a continuación):
ru: И вам нужно ввести следующую строку (это должно работать из коробки. Однако, если вы не установили переменную JAVA_HOME в Windows, дальнейшие инструкции приведены ниже):
zh_cn: 然后你需要输入以下一行（这应该是开箱即用的，如果你没有在Windows上设置 ``JAVA_HOME`` 变量，下面有进一步的说明）:
zh_tw: 接著需要輸入下列這行指令 (Linux 與 macOS 中該指令應該可以直接執行，而如果在 Windows 上沒設定 ``JAVA_HOME`` 變數，請參考本頁稍後的說明)：

source: On Windows, if you did not install the ``JAVA_HOME`` variable, the full path to Java should be provided. You need to add ``&`` at the beginning of the line if you use PowerShell; it's not needed for the regular ``cmd.exe`` console.
de: Unter Windows sollte, sofern die ``JAVA_HOME``-Variable nicht installiert wurde, der vollständige Pfad zu Java bereitgestellt werden. Fügen Sie ``&`` am Zeilenanfang ein, wenn Sie PowerShell benutzen; es ist nicht für die reguläre ``cmd.exe`` erforderlich.
es: En Windows, si no instaló la variable ``JAVA_HOME``, se debe proporcionar la ruta completa a Java. Debe agregar ``&`` al comienzo de la línea si usa PowerShell; no es necesario para la consola normal ``cmd.exe``.
ru: В Windows, если вы не установили переменную JAVA_HOME, необходимо указать полный путь к Java. Если вы используете PowerShell, вам нужно добавить & в начале строки; для обычной консоли cmd.exe он не нужен.
zh_cn: 在Windows上，如果你没有设置 ``JAVA_HOME`` 变量，应该提供Java的完整路径。如果使用PowerShell，需要在行首添加 ``&`` ；普通的 ``cmd.exe`` 控制台不需要。
zh_tw: 在 Windows 上，如果在安裝時沒設定 ``JAVA_HOME`` 變數，則必須要提供完整的 Java 路徑。如果使用 PowerShell 的話則必須在這行開頭加上 ``&`` ，而普通的 ``cmd.exe`` 主控台則不需要。

source: To make it clearer, here is an capture of a line that works on PowerShell (by adding ``&`` and the full Java path before ``keytool.exe``). Again, keep in mind that you need Java installed:
de: Um es klarer zu machen, hier ist eine Aufnahme einer Zeile, die auf PowerShell funktioniert (durch Hinzufügen von ``&`` und dem vollständigen Java-Pfad vor ``keytool.exe``). Auch hier ist zu beachten, dass Sie Java installiert haben müssen:
es: Para hacerlo mas claro, aquí hay una captura de la línea que funciona en PowerShell (añadiendo un ``&`` y la ruta completa de Java a ``keytool.exe``). Nuevamente, recuerda que necesitas Java instalado:
fr: Pour plus de clarté, voici une capture d'une ligne qui fonctionne sur PowerShell (en ajoutant ``&`` et le chemin Java complet avant ``keytool.exe``). Encore une fois, n'oubliez pas que vous devez avoir installé Java :
ja: わかりやすくするために、PowerShellで機能する行のキャプチャを次に示します(``&`` と ``keytool.exe`` の前に完全なJavaパスを追加する)。繰り返しますが、Javaをインストールする必要があることに注意してください。
ru: Чтобы было понятнее, вот запись строки, которая работает в PowerShell (добавив `` & '' и полный путь Java перед `` keytool.exe ''). Опять же, имейте в виду, что вам необходимо установить Java:
zh_cn: 为了更清楚地说明这一点，这里有一行在PowerShell上运行的代码（在 ``keytool.exe`` 之前添加 ``&`` 和完整的Java路径）。同样，请记住，你需要安装Java:
zh_tw: 再講得清除一點，下列為該如何在 PowerShell 中執行該指令的截圖 (即有加上 ``&`` 以及在 ``keytool.exe`` 前面加上完整的 Java 路徑)。再強調一次，必須要先安裝 Java：

source: (right-click and open the image in a new tab if this appears too small)
de: (klicken Sie mit der rechten Maustaste und öffnen Sie das Bild in einer neuen Registerkarte, falls diese zu klein erscheint)
es: (haz clic derecho y abre la imagen en una nueva pestaña si es demasiado pequeña)
fr: (cliquez avec le bouton droit de la souris et ouvrez l'image dans un nouvel onglet si celle-ci apparaît trop petite)
ja: (画像が小さすぎる場合は、右クリックして新しいタブで開きます)
ru: (щелкните правой кнопкой мыши и откройте изображение в новой вкладке, если оно кажется слишком маленьким)
zh_cn: (如果图片太小，请右击并在新标签页中打开图片)
zh_tw: (如果圖片太小的話，可以右鍵點擊圖片並選擇在 [新分頁中開啟圖片])

source: Setting up Godot
de: Godot einrichten
es: Configurando Godot
fr: Configuration de Godot
ja: ゴドーの設定
ko: Godot에서 설정하기
ru: Настройка Годо
zh_cn: 设置Godot
zh_tw: 設定 Godot

source: Go to the **Editor Settings** and set up a few fields in **Export > Android**. Make sure they look like the following:
de: Gehen Sie zu den **Editor-Einstellungen** und richten Sie einige Felder in **Export > Android** ein. Stellen Sie sicher, dass sie wie die folgenden aussehen:
es: Ve a **Configuración del Editor** y define algunos campos en **Exportar > Android**. Asegúrate que se vea como se muestra a continuación:
fr: Allez dans **Editor Settings** et configurez quelques champs dans **Export > Android**. Assurez-vous qu'ils ressemblent à ce qui suit :
ja: **エディタ設定**\ に移動し、\ **Export > Android** でいくつかのフィールドを設定します。次のように表示されていることを確認します。
ru: Перейдите в ** Настройки редактора ** и настройте несколько полей в ** Экспорт> Android **. Убедитесь, что они выглядят следующим образом:
zh_cn: 转到 *编辑器设置* 并在 *导出->安卓* 中设置几个字段。确保它们看起来像下面这样：
zh_tw: 前往 **[編輯器設定]** 並在 **[Export] > [Android]** 中設定一些欄位。請確保要像下圖這樣設定：

source: As it can be seen, most paths are inside either the ``android-sdk`` folder you originally created, or inside the Java install. For Linux and macOS users, ``jarsigner`` is often located in ``/usr/bin``.
de: Wie Sie sehen können, befinden sich die meisten Pfade entweder in dem ``android-sdk`` Ordner, den Sie ursprünglich erstellt haben, oder innerhalb der Java-Installation. Für Linux- und MacOS-Benutzer befindet sich ``jarsigner`` häufig in ``/usr/bin``.
es: Como puedes ver, la mayoría de las rutas van, o dentro de la carpeta ``android-sdk`` que creaste inicialmente, o dentro de la carpeta de instalación de Java. Para usuarios de Linux y macOS, ``jarsigner`` está usualmente en "/usr/bin".
fr: Comme on peut le voir, la plupart des chemins se trouvent soit dans le dossier ``android-sdk`` que vous avez créé à l'origine, soit dans l'installation Java. Pour les utilisateurs de Linux et de MacOS, ``jarsigner`` est souvent situé dans ``/usr/bin``.
ja: ご覧のように、ほとんどのパスは、最初に作成した ``android-sdk`` フォルダ内、またはJavaインストール内にあります。Linuxおよび macOSユーザーの場合、一般的に ``jarsigner`` は ``/usr/bin`` 内にあります。
ru: Как можно видеть, большинство путей находятся либо внутри папки «android-sdk», которую вы изначально создали, либо внутри установки Java. Для пользователей Linux и macOS jarsigner часто находится в / usr / bin.
zh_cn: 可以看到，大多数路径都在你最初创建的 ``android-sdk`` 文件夹内，或者在Java安装中。对于Linux和macOS用户， ``jarsigner`` 通常位于 ``/usr/bin`` 中。
zh_tw: 就像上圖看到的這樣，大多數的路徑不是在剛才建立的 ``android-sdk`` 資料夾中就是在 Java 的安裝路徑中。而 Linux 與 macOS 使用者的話，``jarsigner`` 通常會放在 ``/usr/bin`` 中。

source: With this, you should be all set.
de: Damit sollten Sie fertig sein.
es: Con todo esto, ya deberías estar preparado.
fr: Avec ça, vous devriez être prêts.
ja: これで、すべての準備が整います。
ko: 이것으로 모두 설정되었습니다.
ru: С этим у вас должно быть всё готово.
zh_cn: 有了这个，您应该已经准备就绪。
zh_tw: 這樣一來，應該就準備完畢了。

source: Install the Android SDK (Android Studio)
de: Installieren Sie das Android SDK (Android Studio)
es: Instalar Android SDK (Android Studio)
fr: Installer le SDK Android (Android Studio)
ja: Android SDK(Android Studio)のインストール
ko: Android SDK 설치하기 (Android 스튜디오)
ru: Установите Android SDK (Android Studio)
zh_cn: 安装安卓SDK（Android Studio）
zh_tw: 安裝 Android SDK (Android Studio)

source: If you just finished installing the SDK via the command-line tools, feel free to skip this section entirely. The Android Studio path is easier, but it takes up more disk space. It's also useful if you plan to develop Godot for Android (modify the Java source code) or if you plan to develop add-ons.
de: Wenn Sie gerade erst die Installation des SDK über die Befehlszeilen-Tools abgeschlossen haben, können Sie diesen Abschnitt auch ganz überspringen. Der Android Studio-Pfad ist einfacher, nimmt aber mehr Speicherplatz auf der Festplatte in Anspruch. Er ist auch nützlich, wenn Sie planen, Godot für Android zu entwickeln (den Java-Quellcode zu modifizieren) oder wenn Sie planen, Add-Ons zu entwickeln.
es: Si acabas de instalar el SDK a través de las herramientas de línea de comandos, no dudes en saltarte esta sección por completo. La ruta de Android Studio es más fácil, pero ocupa más espacio en disco. También es útil si planeas desarrollar Godot para Android (modificar el código fuente de Java) o si planeas desarrollar add-ons.
fr: Si vous venez de terminer l'installation du SDK via les outils en ligne de commande, n'hésitez pas à sauter entièrement cette section. Le chemin Android Studio est plus facile, mais il prend plus d'espace disque. C'est également utile si vous prévoyez de développer Godot pour Android (modifier le code source Java) ou si vous prévoyez de développer des add-ons.
ja: コマンドラインツールを使用してSDKのインストールを完了している場合は、このセクションを完全にスキップしてください。 Android Studioを使用する道筋は手順が簡単ですが、より多くのディスク容量を占有します。ですが、 Android用のGodotの開発(Javaソースコードの変更)を計画している場合、またはアドオンの開発を計画している場合にも役立ちます。
ru: Если вы только что завершили установку SDK с помощью инструментов командной строки, можете полностью пропустить этот раздел. Путь к Android Studio проще, но он занимает больше места на диске. Это также полезно, если вы планируете разрабатывать Godot для Android (изменять исходный код Java) или если вы планируете разрабатывать дополнения.
zh_cn: 如果你刚刚通过命令行工具安装完SDK，可以完全跳过本节。Android Studio路径更简单，但它占用的磁盘空间更大。如果你打算开发Godot for Android（修改Java源代码），或者你打算开发附加组件，它也很有用。
zh_tw: 如果已經通過命令行來完成安裝，則可以直接跳過本段。用 Android Studio 的方法比較簡單，但會花比較多硬碟空間。這種方法也比較適合有需要為 Android 開發 Godot 的情況 (修改 Java 原始碼) 或有計劃要開發增益集。

source: Download and install Android Studio
de: Laden Sie Android Studio herunter und installieren es
es: Descargar e instalar Android Studio
fr: Télécharger et installer Android Studio
ja: Android Studioのダウンロードとインストール
ru: Скачайте и установите Android Studio
zh_cn: 下载并安装Android Studio
zh_tw: 下載與安裝 Android Studio

source: Download the latest version of Android Studio. When installing, pay attention to where the *android-sdk* directory is created.
de: Laden Sie die neueste Version von Android Studio herunter. Achten Sie bei der Installation darauf, wo das Verzeichnis *android-sdk* erstellt wird.
es: Descarga la última versión de Android Studio. En la instalación, presta atención en dónde el directorio *android-sdk* es creado.
fr: Téléchargez la dernière version d'Android Studio. Lors de l'installation, faites attention à l'endroit où le répertoire *android-sdk* est créé.
ja: Android Studioの最新バージョンをダウンロードします。インストール時に、\ *android-sdk* ディレクトリが作成される場所に注意してください。
ko: 최신 Android 스튜디오를 다운로드합니다. 설치할 때, 어디에 *android-sdk* 디렉토리가 만들어지는 지 확인하세요.
ru: Загрузите последнюю версию Android Studio. При установке обратите внимание на то, где создается каталог *android-sdk*.
zh_cn: 下载最新版本的Android Studio。安装时，请注意 ``android-sdk`` 目录创建的位置。
zh_tw: 下載最新版本的 Android Studio。安裝是，請注意 **android-sdk`` 資料夾是建立在哪裡。

source: This is funny, the path it proposes by default contains whitespace (and complains about it). It must be changed.
de: Das ist lustig. Der Pfad, den es standardmäßig vorschlägt enthält Leerzeichen (und beschwert sich darüber). Er muss geändert werden.
es: Esto es divertido, la dirección que propone por defecto contiene espacio (y se queja de ello). Debe ser cambiada.
fr: C'est drôle, le chemin qu'il propose par défaut contient des espaces blancs (et il s'en plaint). Il faut la changer.
ja: これは奇妙な事ですが、デフォルトで提案するパスには空白が含まれています(そして、それについて文句を言います)。なので、変更する必要があります。
ko: 이게 재밌는 것이, 기본적으로 제안하는 경로에는 공백이 포함됩니다 (그리고 그것에 불평합니다). 이것은 바꾸어야 합니다.
ru: Это забавно: путь, который он предлагает по умолчанию, содержит пробелы (и жалуется на это). Это нужно изменить.
zh_cn: 这很有趣，默认情况下，它建议的路径包含空格（您会为此抱怨不已）。所以它必须改变。
zh_tw: 很有趣的部分是，Android 預設建議的安裝路徑包含了空格 (而且不會報錯)。必須修改該路徑。

source: In any case, it's better to select a different path inside your user folders. The recommended one is usually:
de: In jedem Fall ist es besser, einen anderen Pfad innerhalb des Benutzerverzeichnisses zu wählen. Der empfohlene ist in der Regel:
es: En cualquier caso, será mejor seleccionar un camino diferente dentro de tus archivos de usuarios. El recomendado es usualmente:
fr: Dans tous les cas, il est préférable de sélectionner un chemin différent dans vos dossiers utilisateur. La plus recommandée est habituellement :
ja: いずれにしても、ユーザーフォルダ内で別のパスを選択するほうが良いでしょう。通常は次をお勧めします:
ko: 어쨌든, 사용자 폴더 내에서 다른 경로를 선택하는 것이 좋습니다. 추천하는 경로는 보통 이렇습니다:
ru: В любом случае лучше выбрать другой путь внутри ваших пользовательских папок. Обычно, рекомендуемый вариант:
zh_cn: 无论如何，最好在用户文件夹中选择不同的路径。推荐的方法通常是：
zh_tw: 無論如何，最好要選擇使用者資料夾內的其他路徑。建議的路徑通常是：

source: Replace *yourusername* by your actual user name. Once it's correct, select from the list above in the same screen:
de: Ersetzen Sie *yourusername* durch Ihren tatsächlichen Benutzernamen. Sobald er korrekt ist, wählen Sie aus der Liste oben im selben Bildschirm aus:
es: Reemplaza *yourusername* por tu nombre de usuario real. Cuando todo esté correcto, selecciona una de las opciones de la lista anterior en la misma pantalla:
fr: Remplacez *votre nom d'utilisateur* par votre nom d'utilisateur actuel. Une fois que c'est correct, sélectionnez dans la liste ci-dessus dans le même écran :
ja: * yourusername * を実際のユーザー名に置き換えます。正しい場合は、同じ画面で上記のリストから選択します。
ko: *yourusername* 부분을 실제 사용자 이름으로 바꿉니다. 올바르면 위와 같은 화면에서 다음을 선택하세요:
ru: Замените *yourusername* своим фактическим именем пользователя. Если всё будет правильно, выберите из списка выше на том же экране:
zh_cn: 用实际用户名替换 ``yourusername``。一旦正确，在同一屏幕上从以上列表中选择：
zh_tw: 將 **yourname** 取代為實際的使用者名稱。設定好了之後，在同一個畫面中勾選下表中的項目：

source: Android SDK Platform
fr: Plate-forme Android SDK
ru: Платформа Android SDK
zh_cn: Android SDK 平台工具
