Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/android_custom_build.po
Languages: de, es, fr, ja, ko, ru, uk, zh_cn, zh_tw

source: Custom builds for Android
de: Benutzerdefinierte Builds für Android
es: Compilación personalizada para Android
fr: Builds personnalisées pour Android
ja: Android向けのカスタムビルド
ko: Android 용 커스텀 빌드
ru: Пользовательские сборки для Android
uk: Власні збірки для Android
zh_cn: 为Android平台自定义编译
zh_tw: 為 Android 平台自定建置

source: Godot provides the option to use custom build Android templates. Instead of using the already pre-built template that ships with Godot, an actual Android Java project gets installed into your project folder. Godot will then build it and use it as an export template every time you export the project.
de: Godot bietet die Möglichkeit, benutzerdefinierte Android-Vorlagen zu verwenden. Anstatt die bereits vorgefertigte Vorlage zu verwenden, die im Lieferumfang von Godot enthalten ist, wird ein aktuelles Android Java-Projekt in Ihrem Projektordner installiert. Godot erstellt es dann und verwendet es jedes Mal als Exportvorlage, wenn Sie das Projekt exportieren.
es: Godot provee la opción de usar templates de Android personalizados. En lugar de usar los templates pre-compilados que se distribuyen con Godot, un proyecto actual Java de Android es instalado en tu carpeta de proyecto. Godot lo compilará y lo usará como template cada vez que exportes el proyecto.
fr: Godot offre la possibilité d’utiliser des modèles Android de build personnalisés. Au lieu d’utiliser le modèle déjà pré-construit qui est livré avec Godot, un projet Java Android réel est installé dans votre dossier de projet. Godot va ensuite le construire et l’utiliser comme modèle d’exportation chaque fois que vous exportez le projet.
ja: Godotには、カスタムビルド Androidテンプレートを使用するオプションが用意されています。Godotに同梱されている既製のテンプレートを使用する代わりに、実際のAndroid Javaプロジェクトがプロジェクトフォルダにインストールされます。Godotはそれをビルドし、プロジェクトをエクスポートするたびにエクスポートテンプレートとして使用します。
ko: Godot는 커스텀 빌드 Android 템플릿을 사용하기 위한 설정을 제공합니다. Godot와 함께 제공되는 미리 빌드된 템플릿을 사용하는 대신, 실제로 Android Java 프로젝트를 프로젝트 폴더에 설치합니다. Godot는 이제 프로젝트를 빌드하며, 프로젝트를 내보낼 때마다 내보내기 템플릿으로 사용될 것입니다.
ru: Godot предоставляет возможность использовать собственные шаблоны сборки Android. Вместо использования уже готового шаблона, поставляемого с Godot, в папку вашего проекта устанавливается настоящий Java-проект Android. Затем Godot построит его и будет использовать в качестве шаблона экспорта каждый раз, когда вы экспортируете проект.
uk: Godot надає можливість використовувати власні зразки Android для збірки. Замість того, щоб використовувати вже заздалегідь створений зразок, який постачається з Godot, у папку вашого проєкту встановлюється фактичний проєкт Android Java. Потім Godot буде створювати його та використовувати, як зразок експорту кожного разу, коли ви експортуєте проєкт.
zh_cn: Godot提供了使用自定义构建Android模板的选项。与使用Godot附带的已预先构建好的模板不同，而是将实际的安卓Java项目安装到项目文件夹中。然后Godot将构建它，并在每次导出项目时将其作为导出模板使用。
zh_tw: Godot 中有可以使用自定 Android 樣板的選項。不是使用 Godot 附帶的預編譯樣板，而是將真正的 Android Java 專案安裝到專案資料夾中。Godot 接著會建置該 Java 專案，並使用建置結果來在每次匯出專案是作為匯出樣板使用。

source: There are some reasons why you may want to do this:
de: Es gibt einige Gründe, warum Sie dies vielleicht tun möchten:
es: Hay algunas razones por las que puedes querer hacer esto:
fr: Il y a certaines raisons pour lesquelles vous pourriez vouloir le faire :
ja: これを行う理由はいくつかあります:
ko: 이렇게 하고 싶어하는 몇 가지 이유가 있습니다:
ru: Есть несколько причин, по которым вы можете захотеть это сделать:
uk: Є кілька причин, через які ви можете не захотіти робити це:
zh_cn: 出于某些原因，您可能想要这样做：
zh_tw: 有幾個原因會需要這麼做：

source: Modify the project before it's built.
de: Ändern Sie das Projekt, bevor es erstellt wird.
es: Modifica el proyecto antes de compilarlo.
fr: Modifier le projet avant sa construction.
ja: ビルドする前にプロジェクトを変更します。
ru: Измените проект до его создания.
uk: Зміна проєкту до його збірки.
zh_cn: 在构建项目之前对其进行修改。
zh_tw: 要在建置前修改專案。

source: Add external SDKs that build with your project.
de: Füge externe SDKs die mit Ihrem Projekt verarbeitet werden.
es: Añade SDKs externos que se compilan con tu proyecto.
fr: Ajoutez des SDK externes qui se construisent avec votre projet.
ja: プロジェクトでビルドする外部SDKを追加します。
ru: Добавьте внешние SDK, которые собираются вместе с вашим проектом.
uk: Додавання зовнішніх SDK, які збираються разом із вашим проєктом.
zh_cn: 添加与您的项目一起构建的外部SDK。
zh_tw: 建置專案時要加上外部 SDK。

source: Configuring the custom build is a more or less straightforward process, but it may take a while to get used to how the Android SDK works.
de: Die Konfiguration des benutzerdefinierten Builds ist ein mehr oder weniger unkomplizierter Prozess, aber es kann eine Weile dauern, bis man sich an die Funktionsweise des Android SDK gewöhnt hat.
es: La configuración de la compilación personalizada es un proceso más o menos sencillo, pero puede llevar un tiempo acostumbrarse a cómo funciona el SDK de Android.
fr: La configuration de la compilation personnalisée est un processus plus ou moins simple, mais cela peut prendre un certain temps pour s'habituer au fonctionnement du SDK Android.
ja: カスタムビルドの設定は、多かれ少なかれ簡単なプロセスですが、Android SDKの動作に慣れるまでに時間がかかる場合があります。
ru: Настройка пользовательской сборки - более или менее простой процесс, но может потребоваться время, чтобы привыкнуть к тому, как работает Android SDK.
zh_cn: 配置自定义构建或多或少是一个简单的过程，但是要适应Android SDK的工作方式可能需要一段时间。
zh_tw: 設定自定建置不一定是個簡單的過程，可能需要花點時間才能習慣 Android SDK 的使用方法。

source: Instructions will be provided as detailed as possible to do this process.
de: Für diesen Prozess werden so detaillierte Anweisungen wie möglich bereitgestellt.
es: Se proporcionarán instrucciones lo más detalladas posible para realizar este proceso.
fr: Des instructions aussi détaillées que possible vous seront fournies pour effectuer ce processus.
ja: このプロセスを行うための手順は、可能な限り詳細に提供されます。
ko: 이 과정을 따르기 위해 가능한 디테일하게 설명하겠습니다.
ru: Для этого будут даны как можно более подробные инструкции.
zh_cn: 将提供尽可能详细的说明来完成这一过程。
zh_tw: 我們儘量提供該過程的詳細說明。

source: Set up the custom build environment
de: Einrichten der benutzerdefinierten Buildumgebung
es: Configurar el entorno de compilación personalizada
fr: Configurer l'environnement de construction sur mesure
ja: カスタムビルド環境をセットアップする
ru: Настройка пользовательской среды сборки
uk: Налаштування середовища власної збірки
zh_cn: 设置自定义构建环境
zh_tw: 設定自定建置環境

source: Go to the Project menu, and install the *Custom Build* template:
de: Gehen Sie zum Projekt-Menü und installieren Sie die Vorlage *Custom Build*:
es: Ve al menu de Proyectos e instala la plantilla *Estructura Personalizada*:
fr: Allez dans le menu Projet, et installez le modèle *Custom Build* :
ja: [プロジェクト] メニューに移動し、\ *カスタム ビルド* テンプレートをインストールします。
ko: 프로젝트 메뉴로 갑니다, 그리고 *Custom Build* 템플릿을 설치합니다:
ru: Перейдите в меню **Project** и установите шаблон *Custom Build*:
uk: Перейдіть в меню **Проєкт** та встановіть шаблон **Custom Build** (Власна збірка):
zh_cn: 进入项目菜单，安装 *自定义构建* 模板：
zh_tw: 前往 [專案]，然後安裝 **自定建置** 樣板：

source: Make sure export templates are downloaded. If not, this menu will help you download them.
de: Stellen Sie sicher, dass Exportvorlagen heruntergeladen werden. Falls nicht, hilft Ihnen dieses Menü beim Herunterladen.
es: Asegurate de que las plantillas de exportación esten descargadas. Si no lo están, este menú te ayudara a descargarlas.
fr: Assurez-vous que les modèles d'exportation sont téléchargés. Sinon, ce menu vous aidera à le faire.
ja: エクスポート テンプレートがダウンロードされていることを確認します。そうでない場合は、このメニューを使用してダウンロードできます。
ru: Убедитесь, что шаблоны экспорта загружены. Если нет, то это меню поможет вам их скачать.
uk: Переконайтеся, що шаблони експорту завантажені. Якщо ні, то це меню допоможе вам завантажити їх.
zh_cn: 确保已下载导出模板。如果没有，此菜单将帮助您下载它们。
zh_tw: 請確定有下載匯出樣板。若沒下載的話，該選單會協助下載。

source: A Gradle-based Android project will be created under ``res://android/build``. Editing these files is not needed unless you want to :ref:`create your own add-ons<doc_android_plugin>`, or you really need to modify the project.
de: Ein Gradle-basiertes Android-Projekt wird unter ``res://android/build`` erstellt. Eine Bearbeitung dieser Dateien ist nicht notwendig, es sei denn, Sie wollen :ref:`Ihre eigenen Add-ons erstellen<doc_android_plugin>`, oder Sie müssen das Projekt wirklich modifizieren.
es: Se creará un proyecto de Android basado en Gradle en ``res: // android / build``. No es necesario editar estos archivos a menos que lo desee :ref:`create your own add-ons<doc_android_plugin>`, o realmente necesita modificar el proyecto.
ru: Проект Android на основе Gradle будет создан в каталоге `` res: // android / build ''. Редактировать эти файлы не нужно, если вы не хотите: ref: `создавать свои собственные надстройки <doc_android_plugin>`, или вам действительно нужно изменить проект.
uk: Проєкт Android на базі Gradle буде створений в ``res://android/build``. Редагувати ці файли не потрібно, якщо ви не хочете :ref:`створювати власні доповнення<doc_android_plugin>`, або вам дійсно потрібно змінити проєкт.
zh_cn: 将在 ``res://android/build`` 下创建一个基于Gradle的Android项目，不需要编辑这些文件，除非你想 :ref:`创建你自己的add-ons<doc_android_plugin>` ，或者真的需要修改项目。
zh_tw: 安裝後會在 ``res://android/build`` 中建立一個基於 Grandle 的 Android 專案。除非想要 :ref:`建立自己的增益集` 或是真的有需要修改專案，否則沒有必要修改這些檔案。

source: Install the Android SDK (command-line version)
de: Installieren des Android SDK (Befehlszeilenversion)
es: Instala el Android SDK (versión de linea de comandos)
fr: Installer le SDK Android (version en ligne de commande)
ja: Android SDKのインストール(コマンドラインバージョン)
ru: Установите Android SDK (версия для командной строки)
zh_cn: 安装Android SDK（命令行版本）
zh_tw: 安裝 Android SDK (命令行版本)

source: These are the steps for installing the Android SDK using command line. The advantage of this approach is the simplicity and small download/install size. It can be more challenging though. The Android Studio approach is easier, but it requires downloading and installing Android Studio (which may require more than 1 GB of storage).
de: Dies sind die Schritte zur Installation des Android SDK über die Befehlszeile. Der Vorteil dieses Ansatzes liegt in der Einfachheit und der geringen Download-/Installationsgröße. Es kann jedoch schwieriger sein. Der Ansatz mit Android Studio ist einfacher, erfordert jedoch das Herunterladen und Installieren von Android Studio (was mehr als 1 GB Speicherplatz erfordern kann).
es: Estos son los pasos para la instalación de Android SDK usando la línea de comandos. La gran ventaja de este método es la simplicidad y el pequeño tamaño de descarga/instalación. Aunque puede ser algo mas desafiante. El enfoque de Android Studio es mas fácil, pero este requiere la descarga e instalación de Android Studio (Lo cual puede requerir mas de 1gb de espacio).
fr: Voici les étapes pour installer le SDK Android en utilisant la ligne de commande. L'avantage de cette approche est la simplicité et la petite taille de téléchargement / installation. Cela peut être un peu plus difficile, cependant. L'approche d'Android Studio est plus simple mais nécessite le téléchargement et l'installation d'Android Studio (qui peut nécessiter plus de 1 Go de stockage).
ja: コマンド ラインを使用してAndroid SDKをインストールする手順を次に示します。このアプローチの利点は、シンプルさと小さなダウンロード/インストールサイズです。しかし、それはかなり挑戦的な作業です。Android Studioのアプローチは簡単ですが、Android Studioのダウンロードとインストールが必要です(1GBを超えるストレージが必要な場合があります)。
ru: Это шаги для установки Android SDK с помощью командной строки. Преимущество такого подхода - простота и небольшой размер загрузки / установки. Хотя это может быть сложнее. Подход Android Studio проще, но он требует загрузки и установки Android Studio (для чего может потребоваться более 1 ГБ памяти).
zh_cn: 以上就是使用命令行安装Android SDK的步骤，这种方法的优点是简单、下载和安装尺寸小。不过可能比较有挑战性。Android Studio的方法比较简单，但需要下载安装Android Studio（可能需要超过1GB的存储空间）。
zh_tw: 下面為使用命令行安裝 Android SDK 的步驟。這種做法的好處是比較簡單，而且下載／安裝的檔案也比較小。雖然可能比較有挑戰性。用 Android Studio 的方法比較簡單，但會需要下載並安裝 Android Studio (然後可能會需要至少 1 GB 的儲存空間)。

source: Install a JDK
de: Installation eines JDK
es: Instala un JDK
fr: Installer un kit de développement Java (JDK)
ja: JDKのインストール
ru: Установите JDK
zh_cn: 安装JDK
zh_tw: 安裝 JDK

source: The Android SDK doesn't come with Java, so it needs to be installed manually. You need to install a Java SDK (**not** just the runtime or JRE). `OpenJDK 8 <https://adoptopenjdk.net/index.html>`__ is required, newer versions won't work.
de: Das Android-SDK wird nicht mit Java geliefert, also muss es manuell installiert werden. Sie müssen ein Java SDK installieren (**nicht** nur die Runtime oder JRE). `OpenJDK 8 <https://adoptopenjdk.net/index.html>`__ ist erforderlich, neuere Versionen werden nicht funktionieren.
es: Android SDK no viene con Java, así que este necesita ser instalado manualmente. Instala Java SDK (**no** sólo el runtime o JRE). `OpenJDK 8 <https://adoptopenjdk.net/index.html>`__ es requerido. Versiones más nuevas no funcionarán.
fr: Le SDK Android n'est pas fourni avec Java, il doit donc être installé manuellement. Vous devez installer un SDK Java (**pas** seulement le runtime ou JRE). `OpenJDK 8 <https://adoptopenjdk.net/index.html>`__ est requis, les versions ultérieures ne fonctionneront pas.
ru: Android SDK не поставляется с Java, поэтому его необходимо установить вручную. Вам необходимо установить Java SDK (** не ** только среду выполнения или JRE). ʻOpenJDK 8 <https://adoptopenjdk.net/index.html> `__ требуется, более новые версии работать не будут.
zh_cn: 安卓SDK不附带Java，因此需要手动安装。需要安装一个Java SDK（ **不** 只是运行时或JRE）。需要安装 `OpenJDK 8 <https://adoptopenjdk.net/index.html>`__ ，太新的版本无法使用。
zh_tw: Android SDK 沒有附帶 Java，所以會需要手動安裝。需要安裝 Java SDK (**不只是** 執行環境或 JRE)。需要使用 `OpenJDK 8 <https://adoptopenjdk.net/index.html>`__ ，不支援更新的版本。

source: On Windows, make sure that you enable "Set ``JAVA_HOME`` variable" in the *Custom Setup* view of the installer. You have to restart Godot after this, otherwise Godot can't find the ``JAVA_HOME`` variable.
de: Unter Windows stellen Sie sicher, dass Sie die Variable "Set ``JAVA_HOME``" in der Ansicht *Custom Setup* des Installationsprogramms aktivieren. Danach müssen Sie Godot neu starten, sonst kann Godot die ```JAVA_HOME`` Variable nicht finden.
es: En Windows, asegúrate de habilitar "Colocar la variable``JAVA_HOME`` en la vista *Instalación Personalizada* del instalador. Tienes que reiniciar a Godot después de esto, de lo contrario Godot no podrás encontrar la variable ``JAVA_HOME``.
ru: В Windows убедитесь, что вы включили параметр «Установить переменную JAVA_HOME`` в представлении * Custom Setup * программы установки. После этого вам необходимо перезапустить Godot, иначе Godot не сможет найти переменную JAVA_HOME.
zh_cn: Windows上, 在安装界面的 *Custom Setup*确保你启用了 "Set ``JAVA_HOME`` variable"。这之后你必须重新启动Godot，不然Godot将无法找到``JAVA_HOME`` 变量。
zh_tw: 在 Windows 上請確保有在安裝程式的 **自定安裝 (Custom Setup)** 畫面中勾選「設定 ``JAVA_HOME`` 變數 (Set ``JavaHome`` Variable)」。設定好該選項後會需要重新啟動 Godot，否則 Godot 會找不到 ``JAVA_HOME`` 變數。

source: Download the command-line tools
de: Hilfsmittel für die Kommandozeile herunterladen
es: Descarga las herramientas de la línea de comandos
fr: Télécharger les outils de ligne de commande
ja: コマンドラインツールをダウンロード
ru: Загрузите инструменты командной строки
zh_cn: 下载命令行工具
zh_tw: 下載命令行工具

source: Go to the `Android Studio download page <https://developer.android.com/studio/#command-tools>`_. To save disk space, you don't want the full IDE, so don't download it.
de: Gehen Sie auf die `Android Studio Download-Seite <https://developer.android.com/studio/#command-tools>`_. Um Speicherplatz zu sparen, wollen Sie nicht die komplette IDE, also laden Sie diese nicht herunter.
es: Ve a `Android Studio download page <https://developer.android.com/studio/#command-tools>`_. Para horrar espacio en disco, no querrás todo el IDE, así que no es necesario descargarlo.
fr: Allez sur la page de téléchargement `Android Studio <https://developer.android.com/studio/#command-tools>`_. Pour économiser de l'espace disque, vous ne voulez pas de l'IDE complet, alors ne le téléchargez pas.
ja: `Android Studioダウンロードページ <https://developer.android.com/studio/#command-tools>`_ に移動します。完全なIDEは必要ないので、ディスク容量を節約するために、それはダウンロードしないでください。
ru: Перейдите на страницу загрузки ʻAndroid Studio <https://developer.android.com/studio/#command-tools> `_. Чтобы сэкономить место на диске, вам не нужна полная IDE, поэтому не загружайте ее.
zh_cn: 前往`Android Studio 下载页 <https://developer.android.com/studio/#command-tools>`_。为了节省磁盘空间，你应该不想要完整的IDE，所以不要下载那个。
zh_tw: 前往 `Android Studio 下載頁面 <https://developer.android.com/studio/#command-tools>`_ 。為了節省空間，我們不想下載完整 IDE，所以不要下載。

source: If you do want Android Studio, read further down for instructions for doing the same using Android Studio.
de: Wenn Sie Android Studio verwenden möchten, lesen Sie weiter unten die Anweisungen für die gleiche Vorgehensweise mit Android Studio.
es: Si quieres Android Studio, lee más abajo para instrucciones para hacer lo mismo usando Android Studio.
fr: Si vous voulez Android Studio, lisez plus loin dans la documentation pour faire la même chose avec Android Studio.
ja: Android Studioが必要な場合は、Android Studioを使用して同じことを行うための手順をさらに読んでください。
ru: Если вам действительно нужна Android Studio, прочтите инструкции, как сделать то же самое с Android Studio.
zh_cn: 如果你确实想要Android Studio，请查看后面关于在Android Studio中操作的说明。
zh_tw: 如果真的想用 Android Studio 的話，請往下閱讀以瞭解如何用 Android Studio 來達成相同目的。

source: Look on that page for the *Command line tools only* section. Currently, they are listed under *Download Options*. Scroll down a bit until you see them and download the ZIP file for your platform.
de: Auf dieser Seite finden Sie den Abschnitt *Nur Befehlszeilen-Tools*. Derzeit sind sie unter *Download-Optionen* aufgelistet. Scrollen Sie ein wenig nach unten, bis Sie sie sehen, und laden Sie die ZIP-Datei für Ihre Plattform herunter.
es: Busque en esa página la sección *Solo herramientas de línea de comandos*. Actualmente, se enumeran en *Opciones de descarga*. Desplácese hacia abajo un poco hasta que los vea y descargue el archivo ZIP para su plataforma.
ru: Найдите на этой странице раздел * Только инструменты командной строки *. В настоящее время они перечислены в разделе * Параметры загрузки *. Прокрутите немного вниз, пока не увидите их, и загрузите ZIP-файл для своей платформы.
zh_cn: 在该页面上查看 *仅命令行工具* 部分。目前，它们被列在 *下载选项* 下。向下滚动一点，直到你看到它们，然后下载适用于您的平台的ZIP文件。
zh_tw: 找到該頁面中的 **Command line tools only** (僅命令行工具) 段落。目前，這個段落列在 **Download Options** (下載選項) 中。稍微向下滾動一點即可看到該選項，然後請下載適用於你平台的 ZIP 檔案。

source: This may appear a little confusing, but be sure to follow these instructions carefully:
de: Das mag ein wenig verwirrend erscheinen, aber befolgen Sie diese Anweisungen sorgfältig:
es: Esto puede parecer un poco confuso, pero asegúrate de seguir estas instrucciones con cuidado:
fr: Cela peut sembler un peu déroutant, mais assurez-vous de suivre attentivement ces instructions :
ja: これは少しわかりにくいかもしれませんが、次の指示に注意深く従ってください。
ko: 약간 혼란스러울 수 있습니다, 그러므로 다음 설명을 주의깊게 따르세요:
ru: Это может показаться немного запутанным, но обязательно внимательно следуйте этим инструкциям:
zh_cn: 这可能有点令人困惑，请务必认真遵循以下说明：
zh_tw: 接著看起來可能有點容易搞混，但請確實小心遵守下列步驟：

source: Create a new folder anywhere you want named ``android-sdk`` (it **must** be an empty directory). On Windows, the following path is usually good enough:
de: Erstellen Sie irgendwo einen neuen Ordner namens ``android-sdk`` (es **muss** ein leeres Verzeichnis sein). Unter Windows ist der folgende Pfad normalerweise gut genug:
es: Crea un nueva carpeta donde quieras, llamada ``android-sdk`` (**debe** ser un directorio vacío). En Windows, la siguiente ruta suele ser suficiente:
fr: Créez un nouveau dossier nommé ``android-sdk`` (il **doit** être un répertoire vide). Sous Windows, le chemin suivant est généralement suffisant :
ja: 任意の場所に ``android-sdk`` という名前の新しいフォルダを作成します(空のディレクトリで\ **なければなりません**)。 Windowsでは、通常、次のパスで十分です。
ru: Создайте новую папку в любом месте с именем «android-sdk» (это ** должен ** быть пустой каталог). В Windows обычно достаточно следующего пути:
zh_cn: 在你想要的任何地方，创建一个名为 ``android-sdk`` 的文件夹（**必须**是个空目录）。在Windows平台上，用下面这个路径就可以了：
zh_tw: 在任意地方建立一個新資料夾，並命名為 ``android-sdk`` (這個資料夾 **必須** 為空資料夾)。在 Windows 上，通常使用下列路徑就夠了：

source: Create an empty folder named ``cmdline-tools`` inside of the ``android-sdk`` folder. Then unzip the Android SDK ZIP file into the ``android-sdk/cmdline-tools`` folder.
de: Erstellen Sie einen leeren Ordner namens ``cmdline-tools`` innerhalb des Ordners ``android-sdk``. Entpacken Sie dann die ZIP-Datei des Android SDK in den Ordner ``android-sdk/cmdline-tools``.
es: Crea una carpeta vacía llamada ``cmdline-tools`` dentro de la carpeta ``android-sdk``. Luego descomprime el archivo ZIP del SDK de Android en la carpeta ``android-sdk/cmdline-tools``.
ru: Создайте пустую папку с именем cmdline-tools внутри папки android-sdk. Затем распакуйте ZIP-файл Android SDK в папку «android-sdk / cmdline-tools».
zh_cn: 在``android-sdk``文件夹中创建一个 ``cmdline-tools`` 的空文件夹。然后将 Android SDK 压缩文件解压到``android-sdk/cmdline-tools`` 文件夹。
zh_tw: 在 ``android-sdk`` 資料夾中建立一個命名為 ``cmdline-tools`` 的空資料夾。接著將 Android SDK 的 ZIP 壓縮檔解壓到 ``android-sdk/cmdline-tools`` 資料夾中。

source: If you're on Windows, you must not extract the ZIP archive with the default Windows extractor (e.g. Windows Explorer). You have to use another tool like 7zip, WinRAR or the Powershell ``Expand-Archive`` command. If you extract the archive with the default Windows extractor, the files are not extracted correctly and you will run into errors later on!
de: Wenn Sie unter Windows arbeiten, dürfen Sie das ZIP-Archiv nicht mit dem Standard-Windows-Extraktor (z.B. Windows Explorer) extrahieren. Sie müssen ein anderes Werkzeug wie 7zip, WinRAR oder den Powershell-Befehl ``Expand-Archive`` verwenden. Wenn Sie das Archiv mit dem Standard-Windows-Extraktor extrahieren, werden die Dateien nicht korrekt extrahiert, und Sie werden später auf Fehler stoßen!
es: Si estás en Windows, no debes extraer el archivo ZIP con el extractor predeterminado de Windows (por ejemplo, el Explorador de Windows). Tienes que usar otra herramienta como 7zip, WinRAR o el comando ``Expand-Archive`` de Powershell. !Si extraes el archivo con el extractor de Windows por defecto, los archivos no son extraidos correctamente y te encontrarás con errores más tarde!
ru: Если вы используете Windows, вы не должны извлекать ZIP-архив с помощью экстрактора Windows по умолчанию (например, Windows Explorer). Вы должны использовать другой инструмент, например 7zip, WinRAR или команду Powershell «Expand-Archive». Если вы извлекаете архив с помощью экстрактора Windows по умолчанию, файлы извлекаются неправильно, и вы столкнетесь с ошибками позже!
zh_cn: 如果是Windows平台，禁止使用默认的Widnows解压工具（比如 Windows Explorer）解压ZIP压缩包。必须使用其他工具，比如 7zip, WinRAR 或者 Powershell 的``Expand-Archive`` 命令。如果使用默认的解压工具解压压缩包，文件将不会被正确解压，之后也会运行错误！
zh_tw: 若使用 Windows，則不可以使用預設的 Windows 解壓縮工具來解壓縮 (如檔案總管)。必須要使用如 7zip, WinRAR 或 Powershell 的 ``Expand-Archive`` 指令。若通過預設的 Windows 解壓工具來解壓縮的話，將無法正確解壓縮檔案，而之後執行的時候會發生錯誤！

source: The ``cmdline-tools`` folder should now contain the unzipped folder called ``tools``. Finally, rename the ``tools`` folder to ``latest``.
de: Der Ordner ``cmdline-tools`` sollte nun den entpackten Ordner namens ``tools`` enthalten. Benennen Sie den Ordner ``tools`` schließlich in ``latest`` um.
es: La carpeta ``cmdline-tools`` debería contener ahora la carpeta descomprimida llamada ``tools``. Finalmente, renombra la carpeta ``tools`` a ``latest``.
ru: Папка cmdline-tools теперь должна содержать распакованную папку под названием tools. Наконец, переименуйте папку «tools» в «latest».
zh_cn: ``cmdline-tools``文件夹现在应该包含解压之后的文件夹 ``tools``。最后，把``tools`` 文件夹重命名为``latest``。
zh_tw: ``cmdline-tools`` 資料夾現在應該要包含解壓出來的 ``tools`` 資料夾。接著，請將 ``tools`` 資料夾更名為 ``latest`` 。

source: Your final directory structure should look like this :
de: Ihre endgültige Verzeichnisstruktur sollte folgendermaßen aussehen:
es: Su estructura de directorio final debería verse así:
ru: Ваша окончательная структура каталогов должна выглядеть так:
zh_cn: 你的最终目录结构应该是这样的 :
zh_tw: 最後，資料夾結構應該會長這樣：
