Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/android_custom_build.po
Languages: de, es, fr, ja, ko, ru, uk, zh_cn, zh_tw

source: The rest are not needed, because the build system will fetch them itself. After selecting them, go on with the installation.
de: Der Rest wird nicht benötigt, da das Build-System sie selbst abruft. Fahren Sie mit der Installation fort, nachdem Sie sie ausgewählt haben.
es: El resto no son necesarios, porque el sistema de armado los extraerá él mismo. Después de seleccionarlos, continua con la instalación.
fr: Le reste n'est pas nécessaire, car le système de génération les récupérera lui-même. Après les avoir sélectionnées, poursuivez l'installation.
ja: それらを選択した後、インストールに進みます。その他の項目はビルド システムが自動で選択するため、手動での選択は必要ありません。
ko: 나머지는 필요없습니다, 빌드 시스템이 자체적으로 이들을 가져오기 때문이죠. 선택한 추 설치를 계속하세요.
ru: Остальные не нужны, потому что система сборки сама их загрузит. Выбрав их, продолжайте установку.
zh_cn: 其余都不需要，因为构建系统会自动获取它们。选定它们后，继续安装。
zh_tw: 剩下的都不需要，因為建置系統會自動取得所需要的東西。選擇好了之後，繼續安裝。

source: Go to the folder where you installed ``android-sdk`` in the previous step, use File Explorer and open a command line tool there:
de: Gehen Sie zum Ordner, wo Sie ``Android-Sdk`` im vorigen Schritt installiert haben, benutzen Sie den Datei-Explorer und öffnen dort eine Eingabeaufforderung:
es: Ve al archivo donde instalaste ``android-sdk`` en el paso previo, usa el Explorador de Archivos y abre una herramienta de línea de comandos allí:
fr: Allez dans le dossier où vous avez installé ``android-sdk`` à l'étape précédente, utilisez l'explorateur de fichiers et ouvrez un outil en ligne de commande :
ja: 前の手順で ``android-sdk`` をインストールしたフォルダに移動し、エクスプローラーを使用してコマンドラインツールを開きます:
ru: Перейдите в папку, в которую вы установили ``android-sdk`` на предыдущем шаге, используйте проводник и откройте там инструмент командной строки:
zh_cn: 进入上一步安装 ``android-sdk`` 的文件夹，使用文件资源管理器，在那里打开一个命令行工具:
zh_tw: 前往上一部安裝 ``android-sdk`` 的資料夾。打開檔案總管，並在此處開啟命令行：

source: The actual command line to type is the following. On Linux and macOS, it should work out of the box, but on Windows, it needs additional details (keep reading afterwards).
de: Die tatsächlich einzugebende Befehl lautet wie folgt. Unter Linux und MacOS sollte es sofort funktionieren, aber unter Windows benötigt sie zusätzliche Details (lesen Sie danach weiter).
es: La línea de comandos a escribir es la siguiente. En Linux y macOS esto debería de funcionar directamente, pero en Windows se necesitan detalles adicionales (lee a continuación).
fr: La ligne de commande à taper est la suivante. Sous Linux et macOS, il devrait fonctionner immédiatement, mais sous Windows, il a besoin de détails supplémentaires (continuez à lire par la suite).
ja: 入力する実際のコマンドラインは次のとおりです。 LinuxおよびmacOSでは、そのまま使用できますが、Windowsでは、細かい追加が必要です(後ほど説明があります)。
ru: Фактическая командная строка для ввода следующая. В Linux и macOS он должен работать из коробки, но в Windows требуются дополнительные сведения (продолжайте читать позже).
zh_cn: 实际要输入的命令行如下。在Linux和macOS上，它应该是开箱即用的，但在Windows上，它需要更多的细节（请继续向后阅读）。
zh_tw: 實際要使用的指令列如下。在 Linux 與 macOS 中，應該可以直接使用，但 Windows 則有細節需注意 (請繼續閱讀)。

source: On Windows, the full path to Java should be provided (and ``&`` needs to be added at the beginning on the line if you use PowerShell, it's not needed for the regular ``cmd.exe`` console). Don't worry, at least by using Android Studio on Windows, Java comes bundled with it.
de: Unter Windows sollte der vollständige Pfad zu Java angegeben werden (und ``&`` muss am Anfang der Zeile hinzugefügt werden, wenn PowerShell verwendet wird, für die reguläre ``cmd.exe`` Konsole wird dies nicht benötigt). Keine Sorge, bei Verwendung von Android Studio unter Windows ist Java mitgeliefert.
es: En Windows, debe ser provista la ruta completa a Java (y un ``&`` necesita ser añadido al comienzo de la línea si ocupas PowerShell, no es necesario en la consola regular ``cmd.exe``). No te preocupes, al menos por usar Android Studio en Windows, Java viene con este.
fr: Sous Windows, le chemin complet vers Java doit être fourni (et ``&`` doit être ajouté au début de la ligne si vous utilisez PowerShell, ce n'est pas nécessaire pour la console ``cmd.exe`` régulière). Ne vous inquiétez pas, au moins en utilisant Android Studio sous Windows, Java est livré avec.
ja: Windowsでは、Javaへのフルパスを指定する必要があります(PowerShellを使用する場合は、行の先頭に ``&`` を追加する必要があります。通常の ``cmd.exe`` コンソールには必要ありません)。WindowsでAndroid Studioを使用すると、最低でもJavaがバンドルされるので、Javaについて心配する必要はありません。
ru: В Windows должен быть указан полный путь к Java (и в начале строки необходимо добавить символ ``&``, если вы используете PowerShell, это не требуется для обычной консоли ``cmd.exe``). Не волнуйтесь, по крайней мере, при использовании Android Studio в Windows, Java идёт в комплекте.
zh_cn: 在Windows上，应该提供Java的完整路径（如果使用PowerShell，需要在行首添加 ``&`` ，普通的 ``cmd.exe`` 控制台不需要）。别担心，至少在Windows上使用Android Studio，Java是捆绑在一起的。
zh_tw: 在 Windows 上必須提供完整的 Java 路徑 (而如果是用 PowerShell，則必須在開頭加上 ``&`` ，一般的 ``cmd.exe`` 主控台則不需要) 。別擔心，如果是用 Windows 上的 SDK 的話，有附帶 Java。

source: To make it clearer, here is a screen capture of a line that works on PowerShell (by adding ``&`` and the full Java Path to ``keytool.exe``; remove ``&`` if you use ``cmd.exe``). It uses a path to the Java version that comes with Android Studio:
de: Um es klarer zu machen ist hier ein Screenshot einer Zeile, die auf der PowerShell funktioniert (durch Hinzufügen von ``&`` und dem vollständigen Java-Pfad zu ``keytool.exe``; entferne ``&``, wenn Sie ``cmd.exe`` verwenden). Es wird ein Pfad zur Java-Version verwendet, die mit Android Studio geliefert wird:
es: Para hacerlo mas claro, aquí hay una captura de una línea que funciona en PowerShell (añadiendo un ``&`` y la ruta completa de Java a ``keytool.exe``, remueve ``&`` si utilizas ``cmd.exe``). Usa una ruta a la versión de Java que viene con Android Studio:
fr: Pour plus de clarté, voici une capture d'écran d'une ligne qui fonctionne sur PowerShell (en ajoutant ``&`` et le chemin Java complet à ``keytool.exe`` ; supprimez ``&`` si vous utilisez ``cmd.exe``). Il utilise un chemin vers la version Java fournie avec Android Studio :
ja: わかりやすくするために、PowerShellで機能する行のスクリーンキャプチャを次に示します(``&`` と、Javaへのフルパスを ``keytool.exe`` に追加します。\ ``cmd.exe`` を使用する場合は ``&``を削除します)。このパスにはAndroid Studioに付属しているJavaバージョンへのパスを使用します:
ru: Чтобы было понятнее, вот скриншот строки, которая работает в PowerShell (добавив ``&`` и полный путь Java к ``keytool.exe``; удалите ``&``', если вы используете ``cmd.exe``). Он использует путь к версии Java, которая поставляется с Android Studio:
zh_cn: 为了更清楚地说明这一点，这里是PowerShell上工作的一行的屏幕截图（通过添加 ``&`` 和完整的Java路径到 ``keytool.exe`` ；如果你使用 ``cmd.exe`` ，则删除 ``&`` ）。它使用的是Android Studio自带的Java版本的路径:
zh_tw: 講得更清楚一點，下圖為在 PowerShell 中使用該指令的截圖 (在前面加上了 ``&`` 並在 ``keytool.exe`` 前面使用了完整的 Java 路徑。若使用 ``cmd.exe`` 則不要加上 ``&``)。下圖中使用了 Android Studio 附帶的 Java 路徑：

source: Enabling the custom build and exporting
de: Aktivieren der benutzerdefinierten Builds und Exports
es: Habilitando la compilación y exportación personalizada
fr: Activation de la génération et de l’exportation personnalisées
ja: カスタムビルドとエクスポートの有効化
ru: Включение пользовательской сборки и экспорт
uk: Увімкнення власної збірки та експорту
zh_cn: 启用自定义构建和导出
zh_tw: 啟用自定建置與匯出

source: When setting up the Android project in the **Project > Export** dialog, **Custom Build** needs to be enabled:
de: Wenn Sie das Android-Projekt im Dialogfeld **Projekt > Exportieren** einrichten, muss **Custom Build** aktiviert sein:
es: Cuando configures el proyecto Android en el cuadro de diálogo **Project > Export**, es necesario activar **Custom Build**:
fr: Lors de la configuration du projet Android dans la boîte de dialogue **Project > Export**, **Custom Build** doit être activé :
ja: **プロジェクト>エクスポート** ダイアログでAndroidプロジェクトを設定する場合、\ **Custom Build** を有効にする必要があります。
ru: При настройке проекта Android в диалоговом окне **Project> Export** необходимо включить **Custom Build** (Пользовательская сборка):
uk: При створенні проєкту Android в **Проєкт > Експорт** необхідно увімкнути **Custom Build** (Власна збірка):
zh_cn: 在 **Project > Export** [项目>导出]对话框中设置Android项目时，需要启用 **Custom Build** [自定义构建]:
zh_tw: 在 **[專案] > [匯出]** 中設定好 Android 專案後，也需要啟用 **Custom Build** ：

source: From now on, attempting to export the project or one-click deploy will call the `Gradle <https://gradle.org/>`__ build system to generate fresh templates (this window will appear every time):
de: Von nun an wird bei dem Versuch das Projekt zu exportieren oder mit einem Klick bereitzustellen, das `Gradle <https://gradle.org/>`__ Build-System aufgerufen, um neue Vorlagen zu generieren (dieses Fenster erscheint jedes Mal):
es: Por ahora, intentar exportar el proyecto o un despliegue de un clic va a llamar el sistema de compilación `Gradle <https://gradle.org/>`__ para generar plantillas frescas (esta ventana aparecerá siempre):
fr: Désormais, tenter d'exporter le projet ou de déployer en un clic appellera le système de compilation `Gradle <https://gradle.org/>`__ pour générer de nouveaux modèles (cette fenêtre apparaîtra à chaque fois) :
ja: 今後、プロジェクトのエクスポートまたはワンクリックデプロイを試みると、\ `Gradle <https://gradle.org/>` ビルドシステムが呼び出され、新しいテンプレートが生成されます(このウィンドウは毎回表示されます):
ru: С этого момента попытка экспорта проекта или развёртывания в один клик вызовет систему сборки `Gradle <https://gradle.org/>`__ для создания новых шаблонов (это окно будет появляться каждый раз):
uk: Відтепер спроба експортувати проєкт, або розгортання одним клацанням, викликатиме систему побудови `Gradle <https://gradle.org/>`__ для створення нових шаблонів (це вікно буде появлятися кожного разу):
zh_cn: 从现在开始，尝试导出项目或一键部署会调用 `Gradle <https://gradle.org/>`__ 构建系统来生成新的模板（每次都会出现这个窗口）:
zh_tw: 接著，只要匯出專案或單鍵部署時，就會呼叫 ``Gradle <https://gradle.org/>`_ 建置系統，並產生新的樣板 (該視窗每次都會出現)：

source: The templates built will be used automatically afterwards, so no further configuration is needed.
de: Die erstellten Vorlagen werden anschließend automatisch verwendet, sodass keine weitere Konfiguration erforderlich ist.
es: Las plantillas generadas se utilizarán automáticamente posteriormente, por lo que no es necesario realizar ninguna otra configuración.
fr: Les modèles construits seront utilisés automatiquement par la suite, donc aucune configuration supplémentaire n'est nécessaire.
ja: 作成されたテンプレートは後で自動的に使用されるため、それ以上の構成は必要ありません。
ko: 작성된 템플릿은 나중에 자동으로 사용되므로, 더 이상 구성할 필요가 없습니다.
ru: Созданные шаблоны будут впоследствии использоваться автоматически, поэтому дальнейшая настройка не потребуется.
uk: Потім побудовані шаблони будуть використовуватися автоматично, тому подальша конфігурація не потрібна.
zh_cn: 生成的模板将在以后自动使用，因此不需要进一步的配置。
zh_tw: 接著會自動使用樣板建置，不需要進一步設定。

source: This will create an Gradle-based Android project in ``res://android/build`` and place a ``.gdignore`` file in ``res://android`` so the Godot filesystem ignores this folder. Editing these files is not needed unless you want to :ref:`create your own add-ons<doc_android_plugin>`, or you really need to modify the project.
fr: Cela créera un projet Android basé sur Gradle dans ``res://android/build`` et placera un fichier ``.gdignore`` dans ``res://android`` de sorte que le système de fichiers Godot ignore ce dossier. L'édition de ces fichiers n'est pas nécessaire à moins que vous ne vouliez :ref:`créer vos propres add-ons<doc_android_plugin>`, ou que vous ayez vraiment besoin de modifier le projet.

source: Look on that page for the *Command line tools only* section. Currently, they are listed under *Download Options*. Scroll down a bit until you see them.
fr: Cherchez dans cette page les *Outils de ligne de commande*. Actuellement, ils sont listés sous *Options de téléchargement*. Faites défiler un peu vers le bas jusqu'à ce que vous les voyiez.

source: Download the ZIP file for your platform, there will be a single ``tools`` folder inside:
fr: Téléchargez le fichier ZIP pour votre plateforme, il y aura un seul dossier ``tools`` à l'intérieur :

source: If you already have an android-sdk folder, normally located in ``%LOCALAPPDATA%\Android\Sdk``, then use this folder instead of creating an empty ``android-sdk`` folder.
fr: Si vous avez déjà un dossier android-sdk, normalement situé dans ``%LOCALAPPDATA%\Android\Sdk``, alors utilisez ce dossier au lieu de créer un dossier ``android-sdk`` vide.

source: Unzip the Android SDK ZIP file into the ``android-sdk`` folder. This folder should now contain the unzipped folder called ``tools``. Rename ``tools`` to ``latest``. Finally, create an empty folder named ``cmdline-tools`` and place ``latest`` into it. Your final directory structure should look like this :
fr: Décompressez le fichier ZIP du SDK Android dans le dossier ``android-sdk``. Ce dossier devrait maintenant contenir le dossier dézippé appelé ``tools``. Renommez ``tools`` en ``latest``. Enfin, créez un dossier vide nommé ``cmdline-tools`` et placez-y ``latest``. La structure finale de votre répertoire devrait ressembler à ceci :

source: And you need to input the following line (on Linux and macOS, this should work out of the box, for Windows there are further instructions below):
fr: Et vous devez entrer la ligne suivante (sous Unixes, cela devrait fonctionner immédiatement, pour Windows il y a d'autres instructions ci-dessous) :

source: On Windows, the full path to Java should be provided. You need to add ``&`` at the beginning of the line if you use PowerShell; it's not needed for the regular ``cmd.exe`` console.
fr: Sous Windows, le chemin complet vers Java doit être fourni. Vous devez ajouter ``&`` au début de la ligne si vous utilisez PowerShell ; ce n'est pas nécessaire pour la console régulière ``cmd.exe``.

source: Android SDK
fr: SDK Android

source: Add external SDKs that build with your project
ko: 프로젝트가 있는 빌드에 외부 SDK를 추가하기

source: Configuring custom build is a more or less straightforward process, but it may take a while to get used to how the Android SDK works.
ko: 커스텀 빌드를 구성하는 것은 다소 간단한 과정이지만, Android SDK가 작동하는 방식에 익숙해지는 데는 시간이 걸릴 수 있습니다.

source: Set up the Custom Build environment
ko: 커스텀 빌드 환경 설정하기

source: Make sure export templates are downloaded. If not, this menu will aid you to do it.
ko: 내보내기 템플릿을 다운로드했어야 합니다. 그렇지 않았더라도 이 메뉴가 도움을 줄 것입니다.

source: This will create an Gradle-based Android project in *"res://android/build"*, and place a .gdignore file in *"res://android"* so Godot filesystem ignores this folder. Editing these files is not needed unless you want to :ref:`create your own add-ons<doc_android_plugin>`, or you really need to modify the project.
ko: 이것은 *"res://android/build"*\ 에 Gradle 기반 Android 프로젝트를 만듭니다, 그리고 .gdignore 파일을 *"res://android"*\ 에 놓습니다, 따라서 Godot 파일 시스템은 이 폴더를 무시합니다. :ref:`자신만의 애드온을 만들기<doc_android_plugin>`\ 나, 정말로 프로젝트를 수정해야 하는 경우가 아니면 이 파일들은 편집하지 않아도 됩니다.

source: Install the Android SDK (Command Line Version)
ko: Android SDK 설치하기 (명령줄 버전)

source: These are the steps for installing the Android SDK using command line. The advantage of this approach is the simplicity and small download/install size. It can be a bit more challenging, though. The Android Studio approach is easier but it requires downloading and installing Android Studio (which may require more than 1gb of storage).
ko: 명령줄을 사용해서 Android SDK를 설치하려면 몇 가지 절차가 있습니다. 이 방식의 장점은 간단하며 작은 다운로드/설치 크기입니다. 그렇지만 조금 더 힘들 수 있습니다. Android 스튜디오 방식은 더 쉽지만, Android 스튜디오를 다운로드하고 설치해야 합니다 (이는 1기가보다 더 클 수도 있습니다).

source: Install Java
ko: Java 설치하기

source: Android SDK does not come with Java, so it needs to be installed manually. Instal Java SDK (**not** runtime or JRE). OpenSDK 8 is recommended, otherwise Oracle's Java SDK for version 8 will work. Later versions may not work for Android development.
ko: Android SDK에는 Java가 포함되지 않습니다, 따라서 수동으로 설치해야 합니다. Java SDK를 설치합니다 (runtime이나 JRE가 **아닙니다**). OpenSDK 8을 추천합니다, 다른 방법으로 Oracle의 버전 8 용 Java SDK도 가능합니다. 이후 버전은 Android 개발에 작동하지 않을 수 있습니다.

source: Download the command line tools
ko: 명령줄 도구 다운로드하기

source: Go to Google's website for downloading the Android SDK. A search will take you to the *Android Studio* download page. You don't want it, so don't download (if you do want it, read further down for instructions for doing the same using Android Studio).
ko: Android SDK를 다운로드하기 위해 구글 웹사이트로 갑니다. 검색을 통해 *Android 스튜디오* 다운로드 페이지로 갑니다. Android 스튜디오를 원한 것은 아니므로, 다운로드하지 않습니다 (원한다면, 하단에서 Android 스튜디오를 사용해 같은 작업을 하는 설명을 읽으세요).

source: Look in that page for the *Command Line Tools*. Currently, they are listed under *Download Options*. Scroll down a bit until you see them.
ko: 해당 페이지에서 *Command Line Tools*\ 를 찾아봅니다. 현재 *Download Options* 아래에 있습니다. 아래로 화면을 스크롤합니다.

source: Download the zip file for your platform, inside there will be a single *tools* folder:
ko: 플랫폼에 맞는 zip 파일을 다운로드합니다, 거기에는 하나의 *tools* 폴더가 있습니다:

source: Create a new folder anywhere you want named *android-sdk* (it **must** be an empty directory). On Windows,
ko: 아무 위치에서 새 폴더를 만들고 *android-sdk*\ 로 이름을 짓습니다 (**빈 디렉토리이어야 합니다). Windows에서는,

source: Accepting the Licenses
ko: 라이선스 수락하기

source: Everything would be more or less rosy up to here, but in order to even do anything, Google requires you to accept its licenses.
ko: 여기에서 하는 모든 것이 좋거나 나쁠 수 있습니다, 하지만 무엇을 하든 지 구글은 라이선스 수락을 요청합니다.

source: To do this, the *sdkmanager* must be executed from command line with a special argument. Navigate to the *tools/bin* directory inside the sdk folder (instructions provided for Windows users, as Unix users are expected to understand how command line navigation works):
ko: 수락하기 위해선, *sdkmanager*\ 를 특별한 인수를 가진 명령줄에서 실행해야 합니다. sdk 폴더 내의 *tools/bin* 디렉토리로 갑니다 (Windows 사용자를 위한 설명이며, Unix 사용자는 명령줄 내비게이션이 작동하는 방식을 알고 있다고 가정합니다):

source: In there, manually run sdkmanager with the "--licenses" argument:
ko: 여기서 "--licenses" 인수가 있는 sdkmanager를 수동으로 실행합니다:

source: This will ask you to accept several licenses, just write *"y"* and press *enter* on every of them until it's done.
ko: 이것으로 몇 가지 라이선스를 수락하는 요청들이 들어옵니다, 모든 요청이 끝날 때까지 *"y"*\ 를 치고 *엔터*\ 를 누릅니다.

source: Afterwards, install the platform tools (this is needed to install *adb*):
ko: 그런 다음, 플랫폼 도구를 실행합니다 (*adb*\ 를 설치하는 데 필요합니다):

source: Generating the Keystore
ko: Keystore 생성하기

source: Once *platform tools* are installed, the last step is to generate a debug keystore (this is needed to build). Go up two folders by writing:
ko: *플랫폼 도구*\ 를 설치하면, 마지막 단계는 디버그 Keystore를 생성하는 것입니다 (빌드에 필요합니다). 다음 명령을 쳐서 두 폴더 위로 이동합니다:

source: (or open a new shell on the *android-sdk* folder).
ko: (혹은 *android-sdk* 폴더에서 새 셸을 엽니다).

source: And you need to input the following line (on Unixes this should work out of the box, for Windows there are further instructions below):
ko: 그리고 다음 문장을 입력해야 합니다 (Unix에서 즉시 실행될 것이며, Windows에서는 아래 추가 설명이 있습니다):

source: On Windows, the full path to Java should be provided (and & needs to be added at the beginning on the line if you use PowerShell, it's not needed for regular console).
ko: Windows에서는, Java를 향하는 전체 경로를 제공해야 합니다 (그리고 PowerShell을 사용한다면 문장의 시작에 &를 추가해야 합니다, 일반적인 콘솔에는 필요하지 않습니다).

source: To make it clearer, here is an capture of a line that works on PowerShell (by adding & and the full Java Path to keytool.exe). Again, keep in mind that you need Java installed:
ko: 명확하게 하기 위해, PowerShell에서 작동하는 문장 캡쳐본이 있습니다 (&를 추가하고 keytool.exe에 대한 전체 Java 경로를 추가함). 다시 말하지만, Java가 설치되어 있어야 합니다:

source: (right-click, then open the image in a new tab if this appears too small)
ko: (이미지가 너무 작으면, 우클릭하고 새 탭에서 이미지를 여세요)

source: Go to the *Editor Settings* and set up a few fields in *Export -> Android*. Make sure they look like the following:
ko: *편집기 설정*\ 으로 가서 *Export -> Android*\ 의 몇 가지 영역을 설정합니다. 다음과 같아야 합니다:

source: (again, right-click, then open the image in a new tab if this appears too small)
ko: (또 이미지가 너무 작으면, 우클릭하고 새 탭에서 이미지를 여세요)

source: As it can be seen, most paths are inside either *android-sdk* you originally created, or inside the Java install. For Unix users, *jarsigner* is often in "/usr/bin".
ko: 보시다시피, 대부분의 경로는 원래 만든 *android-sdk*\ 에 있거나 Java 내부에 있습니다. Unix 사용자의 경우, *jarsigner*\ 는 종종 "/usr/bin"\ 에 있습니다.

source: If you just finished installing the SDK via command line tools, feel free to skip this section entirely. The Android Studio path is easier, but it takes up more disk space. It's also useful if you plan to develop Godot for Android (modify the Java source code) or if you plan to develop Add-Ons.
ko: 명령줄 도구를 통해 SDK 설치하기를 끝냈다면, 이 섹션은 편하게 넘어가세요. Android 스튜디오 경로는 더 쉽지만, 더 많은 디스크 공간을 차지합니다. Android 용 Godot를 개발하려는 계획이라면 (Java 소스 코드 수정), 혹은 애드온을 개발할 계획이라면 좋을 것입니다.

source: Download and Install Android Studio
ko: Android 스튜디오 다운로드하고 설치하기

source: You thought that by going the Android Studio way you could escape the Keystore generation, but no. It's back to haunt you.
ko: Android 스튜디오 방식으로는 Keystore 생성에서 벗어날 수 있다고 생각했을텐데요, 아닙니다. 다시 돌아왔습니다.

source: Go to the folder where you installed android-sdk in the previous step, use File Explorer and open a command line tool there:
ko: 이전 단계에서 android-sdk를 설치한 폴더로 가서, 파일 탐색기를 사용하고 거기에서 명령줄 도구를 엽니다:

source: The actual command line to type is the following. On Unixes it should work out of the box, but on Windows it needs additional details (keep reading afterwards).
ko: 실제 입력할 명령 문장은 다음과 같습니다. Unix에서 이것은 즉시 작동하지만, Windows에서는 추가 세부 사항이 필요합니다 (계속 읽어주세요).

source: On Windows, the full path to Java should be provided (and & needs to be added at the beginning on the line if you use PowerShell, it's not needed for regular commandline). Don't worry, at least by using Android Studio on Windows, Java comes bundled with it.
ko: Windows에서는, Java에 대한 전체 경로를 제공해야 합니다 (그리고 PowerShell을 사용한다면, 문장의 시작 부분에 &를 추가해야 합니다, 일반 명령줄에서는 필요하지 않습니다). 걱정하지 마세요, 적어도 Windows에서 Android 스튜디오를 쓴다면, Java가 번들로 제공됩니다.

source: To make it clearer, here is a screen capture of a line that works on PowerShell (by adding & and the full Java Path to keytool.exe, remove & if you use regular console). It uses a path to the Java version that comes with Android Studio:
ko: 명확하게 하기 위해, PowerShell에서 작동하는 문장 캡쳐본이 있습니다 (&를 추가하고 keytool.exe에 대한 전체 Java 경로를 추가합니다, 일반 콘솔을 사용한다면 &를 제거하세요). Android 스튜디오와 함께 제공되는 Java 버전에 대한 경로를 사용합니다:

source: Enabling Custom Build and Exporting
ko: 커스텀 빌드를 활성화하고 내보내기

source: When setting up the Android project in the *Project -> Export* dialog, *custom build* needs to be enabled:
ko: *프로젝트 -> 내보내기* 대화 상자에서 Android 프로젝트를 설정할 때, *custiom build*\ 가 켜져있어야 합니다:

source: From now on, attempting to export the project or one-click deploy will call the *Gradle* build system to generate fresh templates (this window will appear every time):
ko: 지금부터 프로젝트를 내보내거나, 원 클릭 배포를 하면 *Gradle* 빌드 시스템으로 새로운 템플릿을 생성하게 됩니다 (매 번 이 창이 나타날 것입니다):

source: Configuring the custom build is a fairly straightforward process. But first you need to follow the steps in :ref:`exporting for android<doc_exporting_for_android>` up to **Setting it up in Godot**. After doing that, follow the steps below.
uk: Налаштування власної збірки є досить простим процесом. Але спочатку потрібно виконати кроки :ref:`експорту для android<doc_exporting_for_android>` аж до **налаштування в Godot**. Після цього виконайте наведені нижче дії.
