Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/changing_application_icon_for_windows.po
Languages: es, fr, ko, pl, uk, zh_cn, zh_tw

source: Changing application icon for windows
es: Cambiar el icono de la aplicación para Windows
fr: Changer l'icone de l'application pour windows
pl: Zmiana ikony aplikacji dla systemu windows

source: By default, the exported game icon will be the Godot icon. Most likely you will want to change that for your game. There are two types of icons that can be changed: the file icon and the taskbar icon.
es: Por defecto, el icono del juego exportado será el icono de Godot. Lo más probable es que quieras cambiar esto para tu juego. Hay dos tipos de iconos que se pueden cambiar: el icono del archivo y el icono de la barra de tareas.
fr: Par défaut, l'icône du jeu exporté sera l'icône de Godot. Il y a beaucoup de chance que vous souhaitiez changer cela pour votre jeu. Il y a deux types d'icônes pouvant être changées: l'icône du fichier et l'icône de la barre des tâches.

source: Changing the taskbar icon
es: Cambiar el icono de la barra de tareas
fr: Changer l'icône de la barre des tâches
ko: 작업 표시줄 아이콘 바꾸기
pl: Zmiana ikony paska zadań
uk: Зміна піктограми панелі завдань
zh_cn: 更改任务栏图标
zh_tw: 更改工作列圖示

source: The taskbar icon is the icon that shows up on the taskbar when your game is running.
es: El icono de la barra de tareas es el icono que aparece en la barra de tareas cuando se está ejecutando el juego.
fr: L'icône de la barre des tâches correspond à celle qui apparaît sur la barre des tâches quand le jeu est lancé.
pl: Ikona paska zadań, to ta, która pokazuje się na pasku zadań gdy gra jest uruchomiona.

source: To change the taskbar icon, go to Project>Project Settings>Application>Config>Icon. Click on the folder icon and select your desired icon.
es: Para cambiar el icono de la barra de tareas, vaya a Proyecto>Ajustes del proyecto>Application>Config>Icon. Haz clic en el icono de la carpeta y selecciona el icono deseado.
fr: Pour changer l'icône de la barre des tâches, allez dans Projet>Paramètres du projet>Application>Config>Icône. Cliquez sur l'icône du dossier et sélectionnez l'icône désirée.

source: This is also the icon that gets displayed in the Godot project list.
es: Este es el icono que también será mostrado en la lista de proyectos de Godot.
fr: C'est aussi cette icône qui apparait dans la liste des projets Godot.
ko: Godot 프로젝트 목록에서 표시되는 아이콘이기도 합니다.
uk: Цей значок також відображається у списку проектів Godot.
zh_cn: 这也是Godot项目列表中显示的图标。
zh_tw: 該圖示也是用來顯示在 Godot 專案列表的圖示。

source: Changing the file icon
es: Cambiar el ícono del archivo
fr: Changer l'icône du fichier
ko: 파일 아이콘 바꾸기
uk: Зміна піктограми файлу
zh_cn: 更改文件图标
zh_tw: 更改檔案圖示

source: The file icon is the icon of the executable that you click on to start the game.
es: El icono de archivo es el icono del ejecutable sobre el que se hace clic para iniciar el juego.
fr: L'icône du fichier est celle de l'exécutable sur lequel on clique pour lancer le jeu.
pl: Ikona pliku jest ikoną pliku wykonywalnego, na którą klikniesz, aby rozpocząć grę.

source: Before selecting it in the export options, you will need to install an extra tool called **rcedit**. You can download it here: https://github.com/electron/rcedit/releases
es: Antes de seleccionarlo en las opciones de exportación, necesitarás instalar una herramienta extra llamada **rcedit*. La puedes descargar desde aquí: https://github.com/electron/rcedit/releases
fr: Avant de le sélectionner dans les options d'exportation, vous allez devoir installer un outil supplémentaire appelé **rcedit**. Vous pouvez le télécharger ici: https://github.com/electron/rcedit/releases
pl: Przed wybraniem go w opcjach eksportu należy zainstalować dodatkowe narzędzie o nazwie **rcedit**. Można go pobrać tutaj: https://github.com/electron/rcedit/releases

source: After downloading, you need to tell Godot the path to the **rcedit** executable on your computer. Go to Editor>Editor Settings>Export>Windows. Click on the folder icon for the **rcedit** entry. Navigate to and select the **rcedit** executable.
es: Después de descargar, necesitarás indicarle a Godot la ruta al ejecutable de **rcedit** en tu computadora. Ir a Editor>Ajustes del Editor>Export>Windows. Clic en el botón con ícono de carpeta en la entrada **rcedit**. Navegue y seleccione el ejecutable **rcedit**.
fr: Aprèsle téléchargement, vous devez entrer l'emplacement de l'exécutable **rcedit** à Godot. Allez dans Editeur>Paramètres de l'éditeur>Exporter>Windows. Cliquez sur l'icône du dossier pour **rcedit**, puis sélectionnez l'exécutable **rcedit**.
pl: Po pobraniu musisz podać Godotowi ścieżkę do pliku wykonywalnego **rcedit** na twoim komputerze. Przejdź do Edytor>Ustawienia edytora>Eksport>Windows. Kliknij ikonę folderu dla wpisu **rcedit**. Przejdź do wykonywalnego pliku **rcedit** i wybierz go.

source: For Linux users, you will also need to install wine in order to use rcedit. For more information, check https://www.winehq.org/
es: Usuarios de Linux también deberán instalar wine para poder usar rcedit. Para más información, ver https://www.winehq.org/
fr: Pour les utilisateurs de Linux, vous allez aussi devoir installer wine pour pouvoir utiliser rcedit. Pour plus d'informations, allez voir https://www.winehq.org/
pl: Dla użytkowników Linuksa będziesz również musiał zainstalować wine aby użyć rcedit. Więcej informacji można znaleźć na stronie https://www.winehq.org/

source: Now you have everything ready for changing the file icon. To do that, you will need to specify the icon when exporting. Go to Project>Export. Assuming you have a windows desktop preset ready, in the options, under Application, you will find Icon, select your desired image in ICO format as your file icon.
es: Ahora todo está listo para cambiar el ícono de archivo. Para ello, deberás especificar el icono al exportar. Ve a Proyecto>Exportar. Suponiendo que tengas listo un preset de Windows Desktop listo, en las opciones, dentro de Application, encontrarás Icon, seleccionar la imagen deseada en formato ICO como icono de archivo.
pl: Teraz masz wszystko gotowe do zmiany ikony pliku. W tym celu podczas eksportowania należy określić ikonę. Przejdź do Projekt>Eksport. Zakładając, że masz już gotowe ustawienia w systemie Windows, w opcjach, pod Aplikacja znajdziesz ikonę, wybierz żądany obraz w formacie ICO jako ikonę pliku.

source: To export an ICO image, you can use GIMP. For more details, please refer to this tutorial: http://skyboygames.com/easily-create-a-windows-app-icon-with-gimp/
es: Para exportar una imagen ICO, se puede utilizar GIMP. Para más detalles, referirse a este tutorial: http://skyboygames.com/easily-create-a-windows-app-icon-with-gimp/
fr: Pour exporter une image en format ICO, vous pouvez utiliser GIMP. Pour plus de détails, référez-vous à ce tutoriel: http://skyboygames.com/easily-create-a-windows-app-icon-with-gimp/
pl: Aby wyeksportować obraz ICO, można użyć GIMP. Więcej informacji na ten temat można znaleźć w poradniku: http://skyboygames.com/easily-create-a-windows-app-icon-with-gimp/

source: Check the documentation for more info about exporting.
es: Revisar la documentación para más información sobre exportación.
fr: Consultez la documentation pour en savoir plus sur l'exportation.
pl: Zapoznaj się z dokumentacją, aby uzyskać więcej informacji na temat eksportu.

source: Testing the result
es: Probando el resultado
fr: Tester le résultat
ko: 결과 시험하기
pl: Testowanie
uk: Тестування результату
zh_cn: 测试结果
zh_tw: 測試結果

source: You can now export the game and see whether you have change the icons successfully or not. If everything works fine, you will see this.
es: Ahora puedes exportar el juego y ver si los cambios de íconos fueron exitosos o no. Si todo funciona bien, verás esto.
fr: Vous pouvez à présent exporter le jeu et voir si vous avez réussi à changer l'icône. Si tout va bien, vous devriez voir ceci.
pl: Teraz możesz wyeksportować grę i sprawdzić, czy ikony zostały zmienione.

source: Icon (ICO) file requirements
es: Requerimientos de archivos de íconos (ICO)
fr: Exigences des fichiers icônes (ICO)
pl: Wymagania dotyczące ikon (ICO)

source: Regardless of which program you use to create your ICO file, there are some requirements to ensure the icon (and your executable) works on Windows.
es: Independientemente de qué programas usas para crear archivos ICO, estos son algunos requerimientos para asegurarse de que el ícono (y su ejecutable) funcionan en Windows.
fr: Quelque soit le programme que vous utilisez pour créer votre fichier ICO, il y a quelques exigences permettant de s'assurer que l'icône (et l'exécutable) fonctionnent sur Windows.
pl: Niezależnie od tego, którego programu używasz do utworzenia pliku ICO, są pewne wymagania, aby ikona (i plik wykonywalny) działały w systemie Windows.

source: This is a bit tricky, as can be seen in the following StackOverflow threads: `one <https://stackoverflow.com/questions/3236115/which-icon-sizes-should-my-windows-applications-icon-include>`__, `two <https://stackoverflow.com/questions/40749785/windows-10-all-icon-resolutions-on-all-dpi-settings-format-pixel-art-as-icon>`__.
es: Esto es un poco complicado, como se puede ver en los siguientes hilos de StackOverflow: `uno <https://stackoverflow.com/questions/3236115/which-icon-sizes-should-my-windows-applications-icon-include>`__, `dos <https://stackoverflow.com/questions/40749785/windows-10-all-icon-resolutions-on-all-dpi-settings-format-pixel-art-as-icon>`__.
fr: C'est assez difficile, come on peut le voir dans ces questions sur StackOverflow: `un <https://stackoverflow.com/questions/3236115/which-icon-sizes-should-my-windows-applications-icon-include>`__, `deux <https://stackoverflow.com/questions/40749785/windows-10-all-icon-resolutions-on-all-dpi-settings-format-pixel-art-as-icon>`__.
pl: Jest to nieco trudne, co widać na przykładzie StackOverflow: `pierwszy przykład <https://stackoverflow.com/questions/3236115/which-icon-sizes-should-my-windows-applications-icon-include>`__, `drugi przykład <https://stackoverflow.com/questions/40749785/windows-10-all-icon-resolutions-on-all-dpi-settings-format-pixel-art-as-icon>`__.

source: Your ICO file should at least contain icons in the following resolutions: 16x16, 48x48 and 256x256. They should also be uncompressed. The 256x256 icon *can* be compressed, but this breaks backwards compatibility with Windows XP.
es: Tu archivo ICO debe contener al menos íconos para las siguientes resoluciones: 16x16, 48x48 and 256x256. Además no deben estar comprimidos. El ícono 256x256 *puede* ser comprimido, pero esto romperá compatibilidad con Windows XP.
fr: Votre fichier ICO devrait contenir au moins les résolutions suivantes: 16x16, 48x48 et 256x256. Il devrait aussi ne pas être compressé. L'icône 256x256 *peut* être compressée, mais cela brise la compatibilité avec WindowsXP.
pl: Plik ICO powinien zawierać co najmniej ikony w następujących rozdzielczościach: 16x16, 48x48 i 256x256. Powinny być również nieskompresowane. Ikona 256x256 może być skompresowana, ale to usuwa wsteczną kompatybilność z systemem Windows XP.

source: If you want to fully support high-DPI screens, this is the full list of supported icon sizes on Windows 10: 16, 20, 24, 28, 30, 31, 32, 40, 42, 47, 48, 56, 60, 63, 84 and one larger than 255px. (I.e. 256 or 512 or 1024)
es: Si quieres soporte completo para pantallas high-DPI, esta es la lista de tamaños de íconos soportados en Windows 10: 16, 20, 24, 28, 30, 31, 32, 40, 42, 47, 48, 56, 60, 63, 84 y una mayor a 255px. (por ej. 256, 512 o 1024)
fr: Si vous voulez supporter les écrans haut-DPI, voici la liste exhaustive des tailles d'icônes supportées sur Windows 10: 16, 20, 24, 28, 30, 31, 32, 40, 42, 47, 48, 56, 60, 63, 84 et une plus grande que 255px (ex: 256, 512 ou 1024)
pl: Jeśli chcesz w pełni obsługiwać ekrany o wysokiej rozdzielczości, jest to pełna lista obsługiwanych rozmiarów ikon w systemie Windows 10: 16, 20, 24, 28, 30, 31, 32, 40, 42, 47, 48, 56, 60, 63, 84 i jedna większa od 255px. (Tj. 256 lub 512 lub 1024)

source: Note that for high-DPI compression may be used, also they should be using 24bpp mode in contrast to the lower resolutions.
es: Tener en cuenta que la compresión para high-DPI puede ser usada, también deberán usar modo 24bpp a diferencia de resoluciones menores.
fr: Notez qu'il est possible d'utiliser de la compression pour les écrans haut-DPI, et qu'il est recommandé d'utiliser le mode 24bpp pour contraster avec les résolutions inférieures.
pl: Należy pamiętać, że w przypadku kompresji HighDPI należy używać trybu 24bpp, w przeciwieństwie do niższych rozdzielczości.

source: Changing application icon for Windows
ko: Windows에 응용 프로그램 아이콘 바꾸기
uk: Зміна іконки програми для Windows
zh_cn: 更改Windows的应用程序图标
zh_tw: 為 Windows 更改應用程式圖示

source: By default, the exported project's icon will be the Godot icon. You will most likely want to change that for your project. There are two types of icons that can be changed on Windows: the file icon and the taskbar icon.
ko: 기본적으로 내보낸 프로젝트의 아이콘은 Godot 아이콘입니다. 프로젝트를 위해 아이콘을 바꾸고 싶을 것입니다. Windows에서 바꿀 수 있는 두 가지 유형의 아이콘이 있습니다: 파일 아이콘하고 작업 표시줄 아이콘입니다.
uk: За замовчуванням піктограмою експортованого проекту буде значок Godot. Ви, швидше за все, захочете змінити це для свого проекту. Існує два типи піктограм, які можна змінити в Windows: значок файлу та значок панелі завдань.
zh_cn: 默认情况下，导出项目的图标将是Godot图标。您很可能想要为您的项目更改它。在Windows上可以更改两种类型的图标：文件图标和任务栏图标。
zh_tw: 預設情況下，匯出專案的圖示會是 Godot 圖示。通常我們會想為專案更改圖示。在 Windows 有兩種類型的圖示可以更改：檔案圖示與工作列圖示。

source: The taskbar icon is the icon that shows up on the taskbar when your project is running.
ko: 작업 표시줄 아이콘은 프로젝트가 실행하면 작업 표시줄에 나타나는 아이콘입니다.
uk: Піктограма панелі завдань - це значок, який з’являється на панелі завдань під час запуску проекту.
zh_cn: 任务栏图标是项目运行时显示在任务栏上的图标。
zh_tw: 工作列圖示即為專案執行時顯示在工作列上的圖示。

source: To change the taskbar icon, go to **Project → Project Settings → Application → Config → Icon**. Click on the folder icon and select your desired icon.
ko: 작업 표시줄 아이콘을 바꾸기 위해선, **프로젝트 → 프로젝트 설정 → Application → Config → Icon**\ 으로 갑니다. 폴더 아이콘을 클릭하고 원하는 아이콘을 선택합니다.
uk: Щоб змінити значок панелі завдань, перейдіть до **Проект → Параметри проекту → Application (Застосування) → Config (Налаштування) → Icon (Піктограма). Клацніть зображення папки та виберіть потрібний значок.
zh_cn: 要更改任务栏图标，请转到 **项目→项目设置→应用程序→配置→图标** 。单击文件夹图标，然后选择所需的图标。
zh_tw: 要更改工作列圖示，請前往 **[專案] → [專案設定] → [Application] → [Config] → [Icon]** 。點擊資料夾圖示並選擇想要的圖示。

source: The file icon is the icon of the executable that you click on to start the project.
ko: 파일 아이콘은 프로젝트를 실행하기 위해 클릭하는 실행 파일의 아이콘입니다.
uk: Піктограма файлу - це піктограма виконуваного файлу, яку ви натискаєте, щоб запустити проект.
zh_cn: 文件图标是您单击以启动游戏的可执行文件的图标。
zh_tw: 檔案圖示即為啟動專案時點擊的執行檔的圖示。

source: Before selecting it in the export options, you will need to install an extra tool called **rcedit**. You can download it `here <https://github.com/electron/rcedit/releases>`_.
ko: 내보내기 설정에서 아이콘을 선택하기 전에, **rcedit**\ 이라는 추가 도구를 설치해야합니다. `여기서 <https://github.com/electron/rcedit/releases>`_ 다운로드할 수 있습니다.
uk: Перш ніж вибрати її в опціях експорту, вам потрібно буде встановити додатковий інструмент під назвою **rcedit**. Завантажити його можна `тут<https://github.com/electron/rcedit/releases>`_.
zh_cn: 在导出选项中选择它之前，您需要额外安装一个名为 **rcedit** 的工具。您可以在 `这里 <https://github.com/electron/rcedit/releases>`_ 下载它。
zh_tw: 與匯出選項中選擇圖示前，還必須要安裝一個名為 **rcedit** 的額外工具。可以在 `此處 <https://github.com/electron/rcedit/releases>`_ 下載。

source: After downloading, you need to tell Godot the path to the rcedit executable on your computer. Go to **Editor → Editor Settings → Export → Windows**. Click on the folder icon for the **rcedit** entry. Navigate to and select the rcedit executable.
ko: 다운로드한 후, Godot에 컴퓨터에서 rcedit 실행 파일의 경로를 주어야 합니다. **편집기 → 편집기 설정 → Export → Windows**\ 로 갑니다. **rcedit** 항목의 폴더 아이콘을 클릭합니다. rcedit 실행 파일로 가서 선택합니다.
uk: Після завантаження потрібно вказати Godot шлях до виконуваного файлу rcedit на вашому комп'ютері. Перейдіть до **Редактор → Параметри редактора → Export → Windows**. Клацніть зображення папки щоб записати **rcedit**. Перейдіть та виберіть виконуваний файл rcedit.
zh_cn: 下载后，您需要告诉Godot，计算机上rcedit可执行文件的路径。转到 **编辑器→编辑器设置→导出→Windows** 。单击 **rcedit** 条目的文件夹图标。导航到并选择rcedit可执行文件。
zh_tw: 下載後，需要讓 Godot 知道電腦上的 rcedit 執行檔路徑。前往 **[編輯器] → [編輯器設定] → [Editor] → [Windows]** 。點擊 **rcedit** 欄位的資料夾圖示。前往並選擇 rcedit 執行檔。

source: Linux and macOS users will also need to install `WINE <https://www.winehq.org/>`_ to use rcedit.
ko: Linux와 macOS 사용자는 rcedit를 사용하려면 `WINE <https://www.winehq.org/>`_\ 을 별도로 설치해야 합니다.
uk: Користувачам Linux та macOS для використання rcedit потрібно буде встановити ще й `WINE<https://www.winehq.org/>`_.
zh_cn: Linux和macOS用户还需要安装 `WINE <https://www.winehq.org/>`_ 才能使用rcedit。
zh_tw: Linux 與 macOS 使用者還需要安裝 `WINE <https://www.winehq.org/>`_ 來使用 rcedit。

source: You should now have everything in place to change the file icon. To do that, you will need to specify the icon when exporting. Go to **Project → Export**. Assuming you have already created a Windows Desktop preset, select your icon in ICO format in the **Application → Icon** field.
ko: 이제 파일 아이콘을 바꾸기 위한 준비가 되었습니다. 하기 위해선, 내보낼 때 아이콘을 지정해야 합니다. **프로젝트 → 내보내기**\ 로 갑니다. 이미 Windows 데스크톱 프리셋이 준비되었다고 가정합니다, **Application → Icon** 영역에서 ICO 형식으로 된 아이콘을 선택합니다.
uk: Тепер у вас має бути все необхідне для заміни піктограми файлу. Для цього вам потрібно буде вказати піктограму під час експорту. Перейдіть до **Проект → Експорт**. Якщо припустити, що ви вже створили попередньо встановлену програму Windows Desktop, виберіть піктограму у форматі ICO у полі **Application → Icon**.
zh_cn: 您现在应该已准备好所有内容来更改文件图标。为此，您需要在导出时指定图标。转到 **项目→导出** 。假设您已经创建了Windows桌面预设，请在 **应用程序→图标** 字段中选择ICO格式的图标。
zh_tw: 現在已經準備好所有更改檔案圖示所需的準備了。要更改檔案圖示，需要在匯出時指定圖示。前往 **[專案] → [匯出]** 。這裡我們假設已有 Windows 桌面預設設定。在 **[Application] → [Icon]** 欄位中選擇 ICO 格式的圖示。

source: You can use software such as GIMP to export an ICO image. For more information, please refer to `this tutorial <http://skyboygames.com/easily-create-a-windows-app-icon-with-gimp/>`_.
ko: GIMP와 같은 소프트웨어로 ICO 이미지를 내보낼 수 있습니다. 더 자세한 정보는 `이 튜토리얼 <http://skyboygames.com/easily-create-a-windows-app-icon-with-gimp/>`_\ 을 참고하세요.
uk: Ви можете використовувати програмне забезпечення, наприклад GIMP, для експорту зображення ICO. Для отримання додаткової інформації зверніться до `цього підручника<http://skyboygames.com/easily-create-a-windows-app-icon-with-gimp/>`_.
zh_cn: 您可以使用GIMP等软件导出ICO图像。有关更多信息，请参阅 `该教程 <http://skyboygames.com/easily-create-a-windows-app-icon-with-gimp/>`_ 。
zh_tw: 也可以使用如 GIMP 之類的軟體來匯出 ICO 圖片。更多資訊請參考 `這篇教學 (英文) <http://skyboygames.com/easily-create-a-windows-app-icon-with-gimp/>`_ 。

source: You can now export the project. If it worked correctly, you should see this:
ko: 이제 프로젝트를 내보낼 수 있습니다. 작업이 잘 됬다면 이렇게 보여야 합니다:
uk: Тепер ви можете експортувати проект. Якщо він працював правильно, ви повинні побачити таке:
zh_cn: 您现在可以导出项目了。如果它正常工作，您应该看到：
zh_tw: 現在可以匯出專案了。若一切正常，應該可以看到這個結果：

source: ICO file requirements
ko: ICO 파일 요구사항
uk: Вимоги до файлу ICO
zh_cn: ICO文件要求
zh_tw: ICO 檔案需求

source: Regardless of which program you use to create your `ICO file <https://en.wikipedia.org/wiki/ICO_(file_format)>`_, there are some requirements to ensure the icon (and your executable) works on Windows.
ko: `ICO 파일 <https://en.wikipedia.org/wiki/ICO_(file_format)>`_\ 을 만드는 어떤 프로그램이든 관계없이, Windows에 맞는 아이콘 (그리고 실행 파일)에는 몇 가지 요구사항이 있습니다.
uk: Незалежно від того, яку програму ви використовуєте для створення свого `ICO-файлу<https://en.wikipedia.org/wiki/ICO_(file_format)>`_, існують деякі вимоги до піктограми (і вашого виконуваного файлу) для її роботи в Windows.
zh_cn: 无论您使用哪个程序创建 `ICO文件 <https://en.wikipedia.org/wiki/ICO_(file_format)>`_ ，都有一些要求可以确保图标（和您的可执行文件）在Windows上运行。
zh_tw: 無論是使用哪個程式來建立 `ICO 檔案 <https://zh.wikipedia.org/zh-tw/ICO>`_ ，都需要確保有符合一些需求，才能讓圖示 (與執行檔) 能在 Windows 上使用。

source: This is a bit tricky, as can be seen in the following Stack Overflow threads: `one <https://stackoverflow.com/q/3236115/>`_, `two <https://stackoverflow.com/q/40749785/>`_.
ko: 다음 Stack Overflow 스레드가 있을 정도로 조금 까다롭습니다: `하나 <https://stackoverflow.com/q/3236115/>`_, `둘 <https://stackoverflow.com/q/40749785/>`_.
zh_cn: 这有点棘手，可以在下面的Stack Overflow线程中看到: `其一 <https://stackoverflow.com/q/3236115/>`_ 、 `其二 <https://stackoverflow.com/q/40749785/>`_ 。
zh_tw: 就像下列的 Stack Overflow 討論串中說的一樣，搞這個有點麻煩：`討論串一 (英文) <https://stackoverflow.com/q/3236115/>`_ 、 `討論串二 (英文) <https://stackoverflow.com/q/40749785/>`_ 。

source: Your ICO file should at least contain icons in the following resolutions: 16×16, 48×48 and 256×256.
ko: ICO 파일은 적어도 아이콘이 다음 화면 비율에 있어야 합니다: 16x16, 48x48 그리고 256x256.
uk: Ваш ICO-файл повинен містити піктограми хоча би в таких роздільних здатностях: 16 × 16, 48 × 48 та 256 × 256.
zh_cn: 您的ICO文件至少应包含以下分辨率的图标：16×16、88×48和256×256。
zh_tw: ICO 當應至少包含下列解析圖的圖示：16×16, 48×48 與 256×256。

source: If you want to fully support high-DPI screens, this is the full list of supported icon sizes on Windows 10: 16, 20, 24, 28, 30, 31, 32, 40, 42, 47, 48, 56, 60, 63, 84 and one larger than 255 pixels (such as 256, 512 or 1024).
ko: 높은 DPI 화면을 완벽하게 지원하고 싶다면, 다음은 Windows 10에서 지원하는 아이콘 크기 전체 목록입니다: 16, 20, 24, 28, 30, 31, 32, 40, 42, 47, 48, 56, 60, 63, 84 그리고 255 화소보다 큰 것 하나 (256, 512 또는 1024같은 것).
uk: Якщо ви хочете повністю підтримувати екрани з високою роздільною здатністю, то ось повний перелік підтримуваних розмірів піктограм у Windows 10: 16, 20, 24, 28, 30, 31, 32, 40, 42, 47, 48, 56, 60, 63, 84 та один розміром більше 255 пікселів (наприклад, 256, 512, або 1024).
zh_cn: 如果您想完全支持高DPI屏幕，这是Windows 10上支持的图标大小的完整列表:16, 20, 24, 28, 30, 31, 32, 40, 42, 47, 48, 56, 60, 63, 84 和一个大于255像素（例如256,512或1024）。
zh_tw: 若要完全支援高 DPI 螢幕，則下列大小為要在 Windows 10 上支援的完整列表：10: 16, 20, 24, 28, 30, 31, 32, 40, 42, 47, 48, 56, 60, 63, 84 以及一個大於 255 像素的圖示 (如 256, 512 或 1024)。

source: It is also possible to convert a PNG image to an hiDPI-friendly ICO file using this `ImageMagick <https://www.imagemagick.org/>`_ command:
ko: 다음 `ImageMagick <https://www.imagemagick.org/>`_ 명령문을 사용하면 PNG 이미지를 hiDPI 친화적인 ICO 파일로 변환할 수 있습니다:
uk: Також можна конвертувати зображення PNG у файл ICO, сприятливий для hiDPI, за допомогою цієї команди `ImageMagick <https://www.imagemagick.org/>`_:
zh_cn: 也可以使用这个 `ImageMagick <https://www.imagemagick.org/>`_ 命令，将PNG图像转换为hiDPI友好的ICO文件：
zh_tw: 也可以使用這個 `ImageMagick <https://www.imagemagick.org/>`_ 指令來將 PNG 圖片轉換為對 hiDPI 友善的 ICO 檔案：
