Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/customizing_html5_shell.po
Languages: es, fr

source: Customizing the Web export HTML page
es: Personalizando la página HTML de exportación a Web
fr: Personnalisation de la page HTML d'exportation Web

source: Rather than the default HTML page that comes with the export templates, it is also possible to use a custom HTML page. This allows drastic customization of the final web presentation and behavior. The path to the custom HTML page is specified in the export options as ``Html/Custom Html Shell``.
es: En lugar de la página HTML que viene por defecto con las plantillas de exportación, también es posible personalizar la página HTML. Esto permite una personalización drástica de la presentación y comportamiento de la página web. La ruta de la página HTML personalizada está especificada en las opciones de exportación como ``Html/Custom Html Shell``.
fr: Plutôt que la page HTML par défaut qui vient avec les modèles d'exportation, il est également possible d'utiliser une page HTML personnalisée. Cela permet une personnalisation totale de la présentation web finale et du comportement. Le chemin d'accès à la page HTML personnalisée est spécifié dans les options d'exportation ``Html/Custom Html Shell``.

source: The default HTML page is available in the Godot Engine repository at `/mist/dist/html/default.html <https://github.com/godotengine/godot/blob/master/misc/dist/html/default.html>`_. Some simple use-cases where customizing the default page is useful include:
es: La página HTML por defecto está disponible en el repositorio del motor Godot en `/mist/dist/html/default.html <https://github.com/godotengine/godot/blob/master/misc/dist/html/default.html>`_. Algunos casos de uso simple donde es útil personalizar la página por defecto incluyen:

source: Loading files from a different directory
es: Cargar archivos de diferentes directorios
fr: Chargement de fichiers à partir d'un autre répertoire

source: Loading a ``.zip`` file instead of a ``.pck`` file as main pack
es: Cargar archivos ``.zip`` en lugar de ``.pck`` como paquete principal
fr: Chargement d'un fichier ``.zip`` au lieu d'un fichier ``.pck`` comme paquet principal

source: Loading engine files from a different directory than the main pack file
es: Cargar archivos del motor desde un directorio distinto al paquete de datos principal
fr: Chargement des fichiers du moteur à partir d'un répertoire différent de celui du fichier pack principal

source: Loading some extra files before the engine starts, so they are available in the file system later
es: Cargar archivos extra antes de que arranque el motor, así estarán disponibles en el sistema de archivos luego
fr: Chargement de certains fichiers supplémentaires avant le démarrage du moteur, de sorte qu'ils soient disponibles dans le système de fichiers plus tard

source: Passing custom "command line" arguments, e.g. ``-s`` to start a MainLoop script
es: Pasar argumentos de la línea de comandos, por ejemplo, ``-s`` para iniciar un script MainLoop
fr: Passer des arguments de "ligne de commande" personnalisés, par exemple ``-s`` pour démarrer un script de boucle principale

source: Placeholder substitution
es: Sustitución de parámetros
fr: Substitution de caractères génériques

source: When exporting the game, several placeholders in the HTML page are substituted by values dependening on the export:
es: Cuando se exporta el juego, muchos placeholders en la página HTML son sustituidos por valores de acuerdo a la exportación:

source: Placeholder
es: Parámetros
fr: Chaîne substituable

source: substituted by
es: sustituido por
fr: remplacée par

source: Basename of exported files without suffixes, e.g. ``game`` when exporting ``game.html``
es: Nombre base de los archivos exportados sin sufijos, ej. ``game`` cuando se exporta ``game.html``
fr: Nom de base des fichiers exportés sans suffixes, par exemple ``jeu`` lors de l'exportation de ``jeu.html``

source: ``true`` if debugging, ``false`` otherwise
es: ``true`` si es de depuración, ``false`` en caso contrario
fr: ``true`` si en débogage, ``false`` sinon

source: Custom string to include just before the end of the HTML ``<head>`` element
es: Cadena personalizada para incluir antes del final del elemento HTML ``<head>``
fr: Chaîne personnalisée à inclure juste avant la fin de l'élément HTML ``<head>``

source: The HTML file must evaluate the JavaScript file ``$GODOT_BASENAME.js``. This file defines a global ``Engine`` object used to start the engine, :ref:`see below <doc_javascript_engine_object>` for details.
es: El arcivo HTML debe evaluar el archivo JavaScript ``$GODOT_BASENAME.js``. Este archivo define un objeto global ``Engine`` usado al iniciar el motor, :ref:`ver debajo <doc_javascript_engine_object>` para más detalles.
fr: Le fichier HTML doit évaluer le fichier JavaScript ``$GODOT_BASENAME.js``. Ce fichier définit un objet global ``Engine`` utilisé pour démarrer le moteur, :ref:`voir ci-dessous <doc_javascript_engine_object>` pour plus de détails.

source: The boot splash image is exported as ``$GODOT_BASENAME.png`` and can be used e.g. in ``<img />`` elements.
es: La imagen splash de inicio es exportada como ``$GODOT_BASENAME.png`` y puede ser usada en elementos como ``<img />``.
fr: L'image de démarrage est exportée en tant que ``$GODOT_BASENAME.png`` et peut être utilisée par exemple dans des éléments ``<img />``.

source: ``$GODOT_DEBUG_ENABLED`` can be useful to optionally display e.g. an output console or other debug tools.
es: ``$GODOT_DEBUG_ENABLED`` puede ser útil para, opcionalmente, mostrar salida de consola u otras herramientas de depuración.
fr: ``$GODOT_DEBUG_ENABLED`` peut être utile pour afficher facultativement par exemple une console de sortie ou d'autres outils de débogage.

source: ``$GODOT_HEAD_INCLUDE`` is substituted with the string specified by the export option ``Html/Head Include``.
es: ``$GODOT_HEAD_INCLUDE`` es sustituida con la cadena especificada por la opción de exportación ``Html/Head Include``.

source: The ``Engine`` object
es: El objeto ``Engine``
fr: L'objet ``Engine``

source: The JavaScript global object ``Engine`` is defined by ``$GODOT_BASENAME.js`` and serves as an interface to the engine start-up process.
es: El objeto global JavaScript es definido por ``$GODOT_BASENAME.js`` y sirve como una interfaz para los procesos de inicio del motor.
fr: L'objet global JavaScript ``Engine`` est défini par ``$GODOT_BASENAME.js`` et sert d'interface pour le processus de démarrage du moteur.

source: The object itself has only two methods, ``load()`` and ``unload()``.
es: El objeto tiene solamente dos métodos, ``load()`` y ``unload()``.
fr: L'objet lui-même n'a que deux méthodes, ``load()``et ``unload()``.

source: Loads the engine from the passed base path.
es: Carga el motor desde la ruta indicada.
fr: Charge le moteur à partir du chemin de base transmis.

source: Returns a promise that resolves once the engine is loaded.
es: Devuelve una promesa de que resolverá una vez cargado el motor.
fr: Renvoie une promesse qui se résout une fois le moteur chargé.

source: Unloads the module to free memory. This is called automatically once the module is instantiated unless explicitly disabled.
es: Descarga el módulo para liberar memoria. Esto es llamado automáticamente una vez que el módulo es instanciado a menos que sea deshabilitado explícitamente.
fr: Décharge le module pour libérer de la mémoire. Ceci est appelé automatiquement une fois que le module est instancié, à moins qu'il ne soit explicitement désactivé.

source: Returns ``true`` if the given major version of WebGL is available, ``false`` otherwise. Defaults to ``1`` for WebGL 1.0.
es: Devuelve ``true`` si la versión mayor de WebGL dada está disponible, ``false`` falso de otro modo. Por defecto es ``1`` para WebGL 1.0.
fr: Retourne ``true`` si la version majeure donnée de WebGL est disponible, ``false` sinon. Par défaut à ``1`` pour WebGL 1.0.

source: Starting an ``Engine`` instance
es: Comenzando una instancia de ``Engine``
fr: Démarrage d'une instance ``Engine``

source: The more interesting interface is accessed by instantiating ``Engine`` using the ``new`` operator:
es: La interfaz más interesante es accedida instanciando ``Engine`` usando el operador ``new``:
fr: L'interface la plus intéressante est accessible en instanciant ``Engine`` à l'aide de l'opérateur ``new`` :

source: This ``Engine`` instance, referred to as ``engine`` with a lower-case ``e`` from here, is a startable instance of the engine, usually a game. To start such an instance, the global ``Engine`` object must be loaded, then the ``engine`` instance must be initialized and started.
es: Esta instancia ``Engine``, referida como ``engine`` con una ``e`` minúscula desde ahora, es una instancia iniciable desde el motor, usualmente un juego. Para iniciar esta instancia, el objeto global ``Engine`` debe ser cargado, luego, la instancia ``engine`` debe ser inicializada e iniciada.

source: Initializes the instance. If the engine wasn't loaded yet, a base path must be passed from which the engine will be loaded.
es: Inicializa la instancia. Si el motor no fue cargado todavía, una ruta base debe ser pasada desde donte el motor será gargado.
fr: Initialise l'instance. Si le moteur n'a pas encore été chargé, un chemin de base à partir duquel le moteur sera chargé doit être passé en paramètre.

source: Returns a promise that resolves once the engine is loaded and initialized. It can then be started with ``engine.startGame()``
es: Devuelve una promesa de que resolverá cuando el motor es cargado e inicializado. Puede ser iniciada con ``engine.startGame()``
fr: Retourne une promesse qui est tenue une fois que le moteur est chargé et initialisé. Le moteur peut alors être démarré avec ``engine.startGame()``

source: This loads a file so it is available in the file system once the instance is started. This must be called **before** starting the instance.
es: Esto carga un archivo para que esté disponible en el sistema de archivos una vez que la instancia es iniciada. Esto debe llamarse **antes** de iniciar la instancia.
fr: Cette méthode charge un fichier pour qu'il soit disponible dans le système de fichiers une fois que l'instance est démarrée. Elle doit être appelée **avant** de démarrer l'instance.

source: If ``file`` is a string, the file will be loaded from that URL. If ``file`` is an ``ArrayBuffer`` or a view on one, the buffer will used as content of the file.
es: Si el ``file`` es una cadena, el archivo será cargado desde una URL. Si ``file`` es un ``ArrayBuffer`` o una vista de uno, el buffer será usado como un contenido del archivo.

source: If ``path`` is a string, it specifies the path by which the file will be available. This is mandatory if ``file`` is not a string. Otherwise, the path is derived from the URL of the loaded file.
es: Si ``path`` es una cadena, especifica la ruta en la cual el archivo estará disponible. Es mandatorio si ``file`` no es una cadena. De otro modo, la ruta será derivada desde la URL del archivo cargado.
fr: Si ``path`` est une chaîne de caractères, elle spécifie le chemin à partir duquel le fichier sera disponible. Ceci est obligatoire si ``file`` n'est pas une chaîne de caractères. Autrement, le chemin est dérivé de l'URL du fichier chargé.

source: Returns a promise that resolves once the file is preloaded.
es: Devuelve una promesa de que resolverá una vez el archivo es precargado.
fr: Retourne une promesse qui est tenue une fois que le fichier est préchargé.

source: Starts the instance of the engine, handing the passed strings as arguments to the ``main()`` function. This allows great control over how the engine is used, but usually the other methods whose names start with ``engine.start`` are simpler to use.
es: Comienza la instancia del motor, pasando la cadena indicada como argumento de la función ``main()``. Esto permite un gran control sobre cómo el motor es usado, pero usualmente los otros métodos cuyos nombres comienzan con ``engine.start`` son más simples de usar.
fr: Démarre l'instance du moteur, en passant les chaînes de caractères passées en arguments à la fonction ``main()``. Cela permet un grand contrôle sur la façon dont le moteur est utilisé, mais généralement les autres méthodes dont le nom commence par ``engine.start`` sont plus simples à utiliser.

source: Returns a promise that resolves once the engine started.
es: Devuelve una promesa de que resolverá una vez el motor a iniciado.
fr: Renvoie une promesse qui se résout une fois le moteur démarré.

source: Starts the game with the main pack loaded from the passed URL string and starts the engine with it.
es: Comienza el juego con el paquete principal cargado desde la cadena URL indicada e inicia el motor.
fr: Démarre le jeu avec le pack principal chargé à partir de l'URL passée et démarre le moteur avec.

source: If the engine isn't loaded yet, the base path of the passed URL will be used to load the engine.
es: Si el motor no está cargado todavía, la ruta base de la URL indicada será utilizada para cargar el motor.
fr: Si le moteur n'est pas encore chargé, le chemin de base de l'URL passée sera utilisé pour charger le moteur.

source: Returns a promise that resolves once the game started.
es: Devuelve una promesa de que resolverá una vez que el juego ha arrancado.
fr: Renvoie une promesse qui se résout une fois le jeu démarré.

source: Configuring start-up behaviour
es: Configurando comportamiento de inicio
fr: Configuration du comportement de démarrage

source: Beside starting the engine, other methods of the engine instance allow configuring the behavior:
es: Además de comenzar el engine, otros métodos de la instancia engine permite configurar el comportamiento:
fr: Outre le démarrage du moteur, d'autres méthodes de l'instance du moteur permettent de configurer le comportement :

source: Sets whether the Engine will be unloaded automatically after the instance is initialized. This frees browser memory by unloading files that are no longer needed once the instance is initialized. However, if more instances of the engine will be started, the Engine will have to be loaded again.
es: Especifica si Engine será removido automáticamente una vez que la instancia es inicializada. Esto libera memoria del navegador removiendo archivos cargados que no son necesarios una vez que la instancia es inicializada. Sin embargo, si más instancias de engine son iniciadas, Engine tendrá que ser cargado nuevamente.
fr: Définit si ``Engine`` sera déchargé automatiquement après l'initialisation de l'instance. Cela libère la mémoire du navigateur en déchargeant les fichiers qui ne sont plus nécessaires une fois l'instance initialisée. Cependant, si d'autres instances du moteur sont démarrées, ``Engine`` devra être à nouveau chargé.

source: Defaults to ``true``.
es: Es ``true`` por defecto.
fr: Par défaut à ``true``.

source: By default, the first canvas element on the page is used for rendering. By calling this method, another canvas can be specified.
es: Por defecto, el primer elemento del área de trabajo de la página se utiliza para el renderizado. Llamando a este método, se puede especificar otra área de trabajo.
fr: Par défaut, le premier élément canevas de la page est utilisé pour le rendu. En appelant cette méthode, un autre canevas peut être spécifié.

source: Sets whether the canvas will be resized to the width and height specified in the project settings on start. Defaults to ``true``.
es: Establece si el área de trabajo se redimensionará a la anchura y la altura especificadas en la configuración del proyecto al inicio. Por defecto es ``true``.
fr: Définit si le canevas sera redimensionné à la largeur et à la hauteur spécifiées dans les paramètres du projet au démarrage. La valeur par défaut est ``true``.

source: By default, the engine will try to guess the locale to use from the JavaScript environment. It is usually preferable to use a server-side user-specified locale, or at least use the locale requested in the HTTP ``Accept-Language`` header. This method allows specifying such a custom locale string.
es: Por defecto, el motor tratará de adivinar la localización a usar desde el entorno JavaScript. Es usualemente preferible para usar una localización especificada por el usuario desde el lado del servidor, o al menos usará la localización solicitada en la cabecera HTTP ``Accept-Language``. Este método permitirá especificar la cadena de localización personalizada.
fr: Par défaut, le moteur essaiera de deviner quelle version de langue utiliser à partir de l'environnement JavaScript. Il est généralement préférable d'utiliser une version de langue spécifiée par l'utilisateur côté serveur, ou du moins d'utiliser la version de langue demandée dans l'en-tête HTTP ``Accept-Language``. Cette méthode permet de spécifier une telle version personnalisée.

source: By default, the base name of the loaded engine files is used for the executable name. This method allows specifying another name.
es: Por defecto, el nombre base de los archivos del engine cargados son usados para el nombre del ejecutable. Este método permite especificar otro nombre.
fr: Par défaut, le nom de base des fichiers du moteur chargé est utilisé pour le nom de l'exécutable. Cette méthode permet de spécifier un autre nom.

source: Customizing the presentation
es: Personalizando la presentación
fr: Personnalisation de la présentation

source: The following methods are used to implement the presentation:
es: Los siguientes métodos son usados para implementar la presentación:
fr: Les méthodes suivantes sont utilisées pour implémenter la présentation :

source: This method is used to display download progress. The passed callback function is called with two number arguments, the first argument specifies bytes loaded so far, the second argument specifies the total number of bytes to load.
es: Este método es usado para mostrar el progreso de la descarga. La función callback pasada es llamada con dos números de argumento, el primer argumento especifica los bytes cargados, el segundo especifica el total de bytes a cargar.
fr: Cette méthode est utilisée pour afficher la progression du téléchargement. La fonction passée est appelée avec deux nombres en arguments, le premier spécifiant le nombre d'octets déjà téléchargés et le second indiquant le nombre total d'octets à télécharger.

source: If the total is 0, it couldn't be calculated. Possible reasons include:
es: Si el total es 0, no puede ser calculado. Posibles razones incluyen:
fr: Si le total est 0, il ne pouvait pas être calculé. Les raisons possibles sont :

source: Files are delivered with server-side chunked compression
es: Los archivos son distribuidos con chunked compression del lado del servidor
fr: Les fichiers sont délivrés avec une compression par tronçons réalisée par le serveur

source: Files are delivered with server-side compression on Chromium
es: Los archivos son distribuidos con compresión del lado del servidor en Chromium
fr: Les fichiers sont délivrés avec une compression côté serveur sur Chromium

source: Not all file downloads have started yet (usually on servers without multi-threading)
es: Algunas descargas no han iniciado todavía (usualmente en servidores sin multi-threading)
fr: Les téléchargements de fichiers n'ont pas encore tous démarré (en général sur des serveurs sans multi-threading)

source: These methods allow implementing custom behavior for the ``stdout`` and ``stderr`` streams. The functions passed in will be called with one string argument specifying the string to print.
es: Esos métodos permiten implementar comportamientos personalizados para los streams de ``stdout`` y ``stderr``. Las funciones pasadas serán llamadas con un argumento en forma de cadena, especificando la cadena a imprimir.
fr: Ces méthodes permettent d'implémenter un comportement personalisé pour ``stdout`` et ``stderr``. Les fonctions passées seront appelées avec une chaîne de caractères correspondant au texte devant être affiché en argument.

source: These methods should usually only be used in debug pages. The ``$GODOT_DEBUG_ENABLED`` placeholder can be used to check for this.
es: Esos métodos deben, usualmente, solo ser usados en páginas de depuración; El parámetro ``$GODOT_DEBUG_ENABLED`` puede ser usado para verificar esto.
fr: Ces méthodes ne devraient généralement être utilisées que dans les pages de débogage. Le terme générique ``$GODOT_DEBUG_ENABLED`` peut être utilisé pour vérifier ça.

source: By default, ``console.log()`` and ``console.warn()`` are used respectively.
es: Por defecto, ``console.log()`` y ``console.warn()`` son usadas respectivamente.
fr: Par défaut, ``console.log()`` et ``console.warn()`` sont utilisées respectivement.

source: Accessing the Emscripten ``Module``
es: Accediendo el módulo Emscripten
fr: Accès au ``Module`` Emscripten en cours

source: If you know what you're doing, you can access the runtime environment (Emscripten's ``Module``) as ``engine.rtenv``. Check the official Emscripten documentation for information on how to use it: https://kripken.github.io/emscripten-site/docs/api_reference/module.html
es: Si sabes lo que estás haciendo, puedes acceder al entorno de ejecución (módulo Emscripten) como ``engine.rtenv``. Revisa la documentación oficial para información de cómo usarlo: https://kripken.github.io/emscripten-site/docs/api_reference/module.html
fr: Si vous savez ce que vous faites, vous pouvez accéder à l’environnement d'exécution (le ``Module`` d'Emscripten) avec ``engine.rtenv``. Consultez la documentation d'Emscripten pour plus d'information sur son utilisation : https://kripken.github.io/emscripten-site/docs/api_reference/module.html
