Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/exporting_for_web.po
Languages: de, es, fr, ja, pt_br, ru, zh_tw

source: As mentioned :ref:`above <doc_javascript_export_options>` multi-threading is only available if the appropriate **Export Type** is set and support for it across browsers is still limited.
es: Como se mencionó :ref:`arriba <doc_javascript_export_options>` el multi-threading sólo está disponible si se establece el **Tipo de Exportación** apropiado y el soporte para ello en los navegadores es todavía limitado.
fr: Comme mentionné :ref:`au-dessus de <doc_javascript_export_options>` le multi-threading n'est disponible que si le **Export Type** approprié est défini et sa prise en charge par les navigateurs est encore limitée.
ru: Как уже упоминалось :ref:`выше <doc_javascript_export_options>` многопоточность доступна только в том случае, если установлен соответствующий **Тип экспорта** и его поддержка в браузерах по-прежнему ограничена.

source: Requires a :ref:`secure context <doc_javascript_secure_contexts>`. Browsers are also starting to require that the web page is served with specific `cross-origin isolation headers <https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Embedder-Policy>`__.
es: Requiere un :ref:`contexto seguro <doc_javascript_secure_contexts>`. Los navegadores también están empezando a exigir que la página web se sirva con cabeceras específicas de `aislamiento entre orígenes <https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Embedder-Policy>`__.
fr: Nécessite un :ref:`secure context <doc_javascript_secure_contexts>`. Les navigateurs commencent également à exiger que la page web soit servie avec des `cross-origin isolation headers spécifique <https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Embedder-Policy>`__.
ru: Требуется :ref:`безопасный контекст <doc_javascript_secure_contexts>`. Браузеры также начинают требовать, чтобы веб-страница обслуживалась с определенными `заголовками изоляции между источниками <https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Embedder-Policy > `__.

source: As mentioned :ref:`above <doc_javascript_export_options>` GDNative is only available if the appropriate **Export Type** is set.
es: Como se mencionó :ref:`arriba <doc_javascript_export_options>` GDNative sólo está disponible si se establece el **Tipo de exportación** apropiado.
fr: Comme mentionné :ref:`au-dessus <doc_javascript_export_options>` GDNative n'est disponible que si le **Export Type** approprié est défini.
ru: Как уже упоминалось :ref:`выше <doc_javascript_export_options>` GDNative доступен, только если установлен соответствующий **Тип экспорта**.

source: The export will also copy the required GDNative ``.wasm`` files to the output folder (and must be uploaded to your server along with your game).
es: La exportación también copiará los archivos requeridos de GDNative `` .wasm `` en la carpeta de salida (y debe cargarse en su servidor junto con su juego).
fr: L'exportation copiera également les fichiers GDNative ``.wasm`` nécessaires dans le dossier de sortie (et doivent être téléchargés sur votre serveur avec votre jeu).
ru: При экспорте также будут скопированы необходимые файлы GDNative с расширением ``.wasm `` в выходную папку (их необходимо загрузить на ваш сервер вместе с игрой).

source: Full screen and mouse capture
de: Aufnahme des gesamten Bildschirms und der Maus
es: Captura de pantalla completa y ratón
fr: Capture plein écran et à la souris
ja: フルスクリーンとマウスキャプチャ
pt_br: Tecla cheia e captura do mouse
ru: Полный экран и захват мыши
zh_tw: 全螢幕與滑鼠截取

source: Browsers do not allow arbitrarily **entering full screen**. The same goes for **capturing the cursor**. Instead, these actions have to occur as a response to a JavaScript input event. In Godot, this means entering full screen from within a pressed input event callback such as ``_input`` or ``_unhandled_input``. Querying the :ref:`class_Input` singleton is not sufficient, the relevant input event must currently be active.
de: Browser erlauben keinen willkürlichen **Vollbildmodus**. Dasselbe gilt für das **Erfassen des Cursors**. Stattdessen müssen diese Aktionen als Antwort auf ein JavaScript-Eingabeereignis erfolgen. In Godot bedeutet dies den Vollbildmodus aus einem gedrückten Eingabe-Ereignis-Callback wie ``_input`` oder ``_unhandled_input``. Die Abfrage des :ref:`class_Input`-Singletons reicht nicht aus, das entsprechende Eingabeereignis muss aktuell aktiv sein.
es: Los navegadores no permiten **ingresar a pantalla completa** arbitrariamente. Lo mismo ocurre con **capturar el cursor**. En su lugar, estas acciones tienen que ocurrir como respuesta a un evento de entrada de JavaScript. En Godot, implica que se debe cambiar pantalla completa desde una llamada de entrada como ``_input`` o ``_unhandled_input``. Consultando el singleton :ref:`class_Input` no será suficiente, el evento correspondiente debe estar actualmente activo.
fr: Les navigateurs n'autorisent pas l'accès arbitraire **en plein écran**. Il en va de même pour **la capture du curseur**. Au lieu de cela, ces actions doivent se produire en réponse à un événement d'entrée JavaScript. Dans Godot, cela signifie qu'il faut entrer en plein écran à partir d'un rappel d'événement d'entrée pressé tel que ``_input`` ou ``_unhandled_input``. Interroger le singleton :ref:`class_Input` n'est pas suffisant, l'événement d'entrée pertinent doit être actuellement actif.
ja: ブラウザは、任意に **フルスクリーンに入る** ことを許可しません。同じことが **カーソルのキャプチャ** にも当てはまります。代わりに、これらのアクションはJavaScript入力イベントへの応答として発生する必要があります。Godotでは、これは、\ ``_ input`` や ``_unhandled_input`` などの押された入力イベントコールバック内から全画面表示に入ることを意味します。\ :ref:`class_Input` シングルトンを照会するだけでは不十分です。関連する入力イベントは現在アクティブでなければなりません。
pt_br: Navegadores não permitem **entrar em tela cheia** livremente. O mesmo vale para **capturar o cursor**. Para isso, essas ações devem ocorrer como uma resposta para um evento de input no JavaScript. No Godot, isso significa entrar em tela cheia a partir de um evento de input como ``_input`` ou ``_unhandled_input``. Acessar o singleton :ref:`class_Input` não é suficiente, o evento relevante precisa estar ativo no momento.
ru: Браузеры не позволяют произвольно **переходить в полноэкранный режим**. То же самое касается **захвата курсора**. Вместо этого эти действия должны происходить как ответ на событие ввода JavaScript. В Godot это означает переход в полноэкранный режим из нажатой функции обратного вызова события ввода, такой как ``_input`` или ``_unhandled_input``. Запроса синглтона :ref:`class_Input` недостаточно, соответствующее событие ввода в настоящее время должно быть активным.
zh_tw: 瀏覽器不允許任意 **進入全螢幕** 模式。同樣地，也不允許隨時 **截取滑鼠遊標** 。這些操作必須要改為用 JavaScript 輸入事件來處理。這代表，在 Godot 中必須要在按鍵輸入事件回呼 (如 ``_input`` 或 ``_unhandled_input``) 中才能進入全螢幕。用 :ref:``class_Input``單例來查詢還不夠，必須要啟用相關的輸入事件。

source: For the same reason, the full screen project setting doesn't work unless the engine is started from within a valid input event handler. This requires :ref:`customization of the HTML page <doc_customizing_html5_shell>`.
de: Aus dem gleichen Grund funktioniert die Vollbild-Projekteinstellung nur, wenn die Engine in einem gültigen Eingabeereignishandler gestartet wird. Dies erfordert eine :ref:`Anpassung der HTML-Seite <doc_customizing_html5_shell>`.
es: Por la misma razón, la opción de proyecto a pantalla completa no funciona a menos que el motor sea lanzado desde un manejador de eventos de entrada válido. Esto requiere :ref:`customizar la página HTML <doc_customizing_html5_shell>`.
fr: Pour la même raison, le réglage du projet en plein écran ne fonctionne pas à moins que le moteur ne soit démarré à partir d'un gestionnaire d'événements d'entrée valide. Cela nécessite :ref:`customization of the HTML page <doc_customizing_html5_shell>`.
ja: 同じ理由で、エンジンが有効な入力イベントハンドラ内から起動されない限り、全画面表示のプロジェクト設定は機能しません。これには :ref:`HTMLページのカスタマイズ<doc_customizing_html5_shell>` が必要です。
pt_br: Pelo mesmo motivo, a opção de projeto de tela cheia não funciona a não ser que o motor seja iniciado a partir de um manipulador de evento de entrada válido. Isso requer uma :ref:`personalização da página HTML <doc_customizing_html5_shell>`.
ru: По той же причине настройка полноэкранного проекта не работает, если движок не запущен из допустимого обработчика событий ввода. Для этого требуется :ref:`настройка HTML-страницы <doc_customizing_html5_shell>`.
zh_tw: 出於相同原因，除非引擎是從有效的輸入事件處理常式中開始的，否則無法使用全螢幕專案設定。要設定則需要 :ref:`自定 HTML 頁面 <doc_customizing_html5_shell>` 。

source: Chrome restricts how websites may play audio. It may be necessary for the player to click or tap or press a key to enable audio.
de: Chrome schränkt die Wiedergabe von Audio auf Websites ein. Möglicherweise benötigt der Player einen Tastendruck oder Aktivierung um Audio zu aktivieren.
es: Chrome restringe como las páginas web pueden reproducir sonido. Puede que sea necesario para el jugador hacer clic, tocar la pantalla o presionar un botón para habilitar el sonido.
fr: Chrome restreint la façon dont les sites Web peuvent jouer de l'audio. Il peut être nécessaire pour le joueur de cliquer ou de toucher ou d'appuyer sur une touche pour activer l'audio.
ja: Chromeは、ウェブサイトでの音声の再生方法を制限しています。プレイヤーがオーディオを有効にするには、クリックしたりタップするなどの、キーを押す操作が必要がある場合があります。
pt_br: O Chrome restringe como os sites reproduzem áudio. Pode ser necessário que o jogador clique, toque ou pressione uma tecla para ativar o áudio.
ru: Chrome ограничивает воспроизведение аудио на веб-сайтах. Возможно, игроку потребуется щёлкнуть, коснуться или нажать клавишу, чтобы включить звук.
zh_tw: Chrome 會顯示網站能否播放音訊。可能有需要玩家點擊、輕觸或按按鍵來啟用音訊。

source: Google offers additional information about their `Web Audio autoplay policies <https://sites.google.com/a/chromium.org/dev/audio-video/autoplay>`__.
de: Google bietet zusätzliche Informationen zu den Richtlinien für die `automatische Wiedergabe von Web-Audio <https://sites.google.com/a/chromium.org/dev/audio-video/autoplay>`__.
es: Google ofrece información adicional acerca de su `política de reproducción automática de Web Audio <https://sites.google.com/a/chromium.org/dev/audio-video/autoplay>`__.
fr: Google offre des informations supplémentaires sur leur `Web Audio autoplay politiques <https://sites.google.com/a/chromium.org/dev/audio-video/autoplay>`__.
ja: Googleは、\ `Webオーディオの自動再生ポリシー<https://sites.google.com/a/chromium.org/dev/audio-video/autoplay> ` に関する追加情報を提供しています。
pt_br: O Google oferece informações adicionais sobre suas `Políticas de autoplay (Web Audio autoplay policies) <https://sites.google.com/a/chromium.org/dev/audio-video/autoplay>`__.
ru: Google предлагает дополнительную информацию о своих `политиках автоматического воспроизведения веб-аудио <https://sites.google.com/a/chromium.org/dev/audio-video/autoplay>`__.
zh_tw: Google 有提供關於 `網頁音訊自動播放政策 (英文) <https://sites.google.com/a/chromium.org/dev/audio-video/autoplay>`__ 的額外資訊。

source: Access to microphone requires a :ref:`secure context <doc_javascript_secure_contexts>`.
es: El acceso al micrófono requiere :ref:`secure context <doc_javascript_secure_contexts>`.
fr: L'accès au microphone nécessite un:ref:`secure context <doc_javascript_secure_contexts>`.
ru: Для доступа к микрофону требуется :ref:`безопасный контекст <doc_javascript_secure_contexts>`.

source: Networking
de: Netzwerke
es: Redes
fr: Réseau
pt_br: Trabalho em rede
ru: Сеть

source: Low level networking is not implemented due to lacking support in browsers.
es: Las redes de bajo nivel no se implementan debido a la falta de soporte en los navegadores.
fr: La mise en réseau de bas niveau n'est pas mise en œuvre en raison de l'absence de support dans les navigateurs.
ru: Сеть на низком уровне не реализована из-за отсутствия поддержки в браузерах.

source: Currently, only :ref:`HTTP client <doc_http_client_class>`, :ref:`HTTP requests <doc_http_request_class>`, :ref:`WebSocket (client) <doc_websocket>` and :ref:`WebRTC <doc_webrtc>` are supported.
es: Actualmente, solo están soportados: `HTTP client <doc_http_client_class>`, :ref:`HTTP requests <doc_http_request_class>`, :ref:`WebSocket (client) <doc_websocket>` y :ref:`WebRTC <doc_webrtc>`.
fr: Actuellement, seuls :ref:`HTTP client <doc_http_client_class>`, :ref:`HTTP requests <doc_http_request_class>`, :ref:`WebSocket (client) <doc_websocket>` et :ref:`WebRTC <doc_webrtc>` sont supportés.
ru: В настоящее время поддерживаются только :ref:`HTTP-клиент <doc_http_client_class>`, :ref:`HTTP-запросы <doc_http_request_class>`, :ref:`WebSocket (клиент) <doc_websocket>` и :ref:`WebRTC <doc_webrtc>`.

source: The HTTP classes also have several restrictions on the HTML5 platform:
es: Las clases HTTP también tienen varias restricciones en la plataforma HTML5:
fr: Les classes HTTP ont plusieurs restrictions sur la plate-forme HTML5 :
ru: Классы HTTP также имеют ряд ограничений на платформе HTML5:

source: Accessing or changing the ``StreamPeer`` is not possible
de: Der Zugriff auf den ``StreamPeer`` ist nicht möglich
es: No es posible acceder o cambiar el ``StreamPeer``
fr: L'accès ou la modification du ``StreamPeer`` n'est pas possible
ja: ``StreamPeer`` へのアクセスおよび変更はできません
pt_br: Acessar ou modificar o``StreamPeer`` não é possível
ru: Доступ или изменение ``StreamPeer`` невозможно
zh_tw: 無法存取或更改 ``StreamPeer``

source: Threaded/Blocking mode is not available
de: Threaded/Blocking-Modus ist nicht verfügbar
es: El modo de hilos/bloqueo no está disponible
fr: Le mode Threaded/Blocking n'est pas disponible
ja: スレッド/ブロックモードは使用できません
pt_br: O modo Threaded/Blocking não está disponível
ru: Потоковый (threaded) и режим блокирования (blocking mode) не доступны
zh_tw: 無法使用 Threaded/Blocking 模式

source: Cannot progress more than once per frame, so polling in a loop will freeze
de: Der Fortschritt kann nicht mehr als einmal pro Frame ausgeführt werden, sodass die Abfrage in einer Schleife einfriert
es: No se puede progresar más de una vez por fotograma, por lo que el sondeo en un bucle se congelará
fr: Ne peut pas progresser plus d'une fois par image, dès lors l'interrogation dans une boucle se figera
ja: フレームごとに複数回進行できないため、ループ内のポーリングはフリーズします
pt_br: Não pode progredir mais de uma vez por quadro, então a sondagem em loop irá congelar
ru: Не может изменяться более чем раз в кадр, поэтому опрос в цикле приведет к зависаниям
zh_tw: 每幀無法處理多次，因此在迴圈內輪詢會導致程式凍結

source: No chunked responses
de: Keine zerstückelten Antworten
es: No hay respuestas fragmentadas
fr: Pas de réponses fragmentées
ja: チャンク応答なし
pt_br: Sem respostas fragmentadas
ru: Нет отрывочных ответов
zh_tw: 無法區塊回覆

source: Host verification cannot be disabled
de: Die Host-Verifizierung kann nicht deaktiviert werden
es: La verificación del host no se puede deshabilitar
fr: La vérification de l'hôte ne peut pas être désactivée
ja: ホスト検証を無効にできません
pt_br: A verificação de host não pode ser desativada
ru: Проверка хоста не может быть отключена
zh_tw: 無法禁用主機驗證

source: Subject to `same-origin policy <https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy>`__
de: Vorbehaltlich der `same-origin policy <https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy>`__
es: Sujeto a la `política de mismo origen <https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy>`__
fr: Sujet à la `politique de même origine <https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy>`_
ja: `同一生成元ポリシー <https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy>`__\ に従います
pt_br: Sujeito à `política de mesma origem <https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy>`__
ru: В соответствии `same-origin policy <https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy>`__
zh_tw: 必須遵守 `同源政策 (Same-origin policy) <https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy>`__

source: Clipboard
es: Portapapeles
fr: Presse-papiers
ru: Буфер обмена

source: Clipboard synchronization between engine and the operating system requires a browser supporting the `Clipboard API <https://developer.mozilla.org/en-US/docs/Web/API/Clipboard_API>`__, additionally, due to the API asynchronous nature might not be reliable when accessed from GDScript.
es: La sincronización del portapapeles entre el motor (Godot) y el sistema operativo requiere de un navegador que soporte la `Clipboard API <https://developer.mozilla.org/es/docs/Web/API/Clipboard_API>`__, además, debido a la naturaleza de la API asíncrona, el portapapeles, podría no ser de confianza cuando se accede desde GDScript.
ru: Синхронизация буфера обмена между движком и операционной системой требует браузер, поддерживающий API буфера обмена `<https://developer.mozilla.org/en-US/docs/Web/API/Clipboard_API> `__, кроме того, из-за асинхронного характера API может быть ненадежным при доступе из GDScript.

source: Requires a :ref:`secure context <doc_javascript_secure_contexts>`.
es: Requiere un: ref: `secure context <doc_javascript_secure_contexts>`.
ru: Требуется :ref:`безопасный контекст <doc_javascript_secure_contexts>`.

source: Gamepads
es: Mandos de juego
ru: Геймпады

source: Gamepads will not be detected until one of their button is pressed. Gamepads might have the wrong mapping depending on the browser/OS/gamepad combination, sadly the `Gamepad API <https://developer.mozilla.org/en-US/docs/Web/API/Gamepad_API/Using_the_Gamepad_API>`__ does not provide a reliable way to detect the gamepad information necessary to remap them based on model/vendor/OS due to privacy considerations.
es: Los Mandos no se detectarán hasta que se presione uno de sus botones. Los Mandos pueden tener un mapeo incorrecto dependiendo de la combinación de navegador / sistema operativo / mando, lamentablemente la API de Gamepad <https://developer.mozilla.org/en-US/docs/Web/API/Gamepad_API/Using_the_Gamepad_API> `__ no proporcionan una forma fiable de detectar la información del mando necesaria para reasignarlos según el modelo / proveedor / sistema operativo debido a consideraciones de privacidad.
ru: Геймпады не будут обнаружены, пока не будет нажата одна из их кнопок. Геймпады могут иметь неправильное отображение в зависимости от комбинации браузера/ОС/геймпада, к сожалению, `API Геймпада <https://developer.mozilla.org/en-US/docs/Web/API/Gamepad_API/Using_the_Gamepad_API>`__ не обеспечивают надежный способ обнаружения информации геймпада, необходимой для их переназначения на основе модели/поставщика/ОС из соображений конфиденциальности.

source: Boot splash is not displayed
de: Boot Splash wird nicht angezeigt
es: La pantalla de inicio no es mostrada
fr: Le boot splash n'est pas affiché
ja: 起動スプラッシュが表示されない
pt_br: O splash de inicialização não é exibido
ru: Загрузочная заставка не отображается
zh_tw: 不會顯示啟動畫面

source: The default HTML page does not display the boot splash while loading. However, the image is exported as a PNG file, so :ref:`custom HTML pages <doc_customizing_html5_shell>` can display it.
de: Auf der Standard-HTML-Seite wird beim Laden kein Boot Splash angezeigt. Das Bild wird jedoch als PNG-Datei exportiert, sodass :ref:`benutzerdefinierte HTML-Seiten <doc_customizing_html5_shell>` es anzeigen können.
es: La página HTML por defecto no muestra la pantalla de inicio mientras se carga. Sin embargo, la imagen es exportada como un archivo PNG, así :ref:`las páginas HTML customizadas <doc_customizing_html5_shell>` pueden mostrarla.
fr: La page HTML par défaut n'affiche pas le boot splash pendant le chargement. Cependant, l'image est exportée au format PNG, donc :ref:`pages HTML personnalisées <doc_customizing_html5_shell>` peut l'afficher.
ja: デフォルトのHTMLページは、ロード中に起動スプラッシュを表示しません。ただし、画像はPNGファイルとしてエクスポートされるため、\ :ref:`カスタムHTMLページ<doc_customizing_html5_shell>` で表示できます。
pt_br: A página HTML padrão não exibe o splash de inicialização durante o carregamento. No entanto, a imagem é exportada como um arquivo PNG, para que :ref:`páginas HTML personalizadas <doc_customizing_html5_shell>` possam exibi-la.
ru: HTML-страница по умолчанию не отображает загрузочную заставку во время загрузки. Тем не менее, изображение экспортируется в виде PNG-файла, поэтому :ref:`настройка HTML страницы <doc_customizing_html5_shell>` могут его отобразить.
zh_tw: 預設 HTML 頁面不會在載入時顯示啟動畫面。但，圖片是匯出為 PNG 檔案，所以 :ref:`自定 HTML 頁面 <doc_customizing_html5_shell>` 可以顯示圖片。

source: Shader language limitations
de: Einschränkungen der Shader-Sprache
es: Limitaciones del lenguaje de shaders
fr: Limitations du langage de shader
pt_br: Limitações de linguagem de shader
ru: Ограничения языка шейдеров
zh_tw: 著色器語言限制

source: When exporting a GLES2 project to HTML5, WebGL 1.0 will be used. WebGL 1.0 doesn't support dynamic loops, so shaders using those won't work there.
de: Beim Exportieren eines GLES2-Projekts nach HTML5 wird WebGL 1.0 verwendet. WebGL 1.0 unterstützt keine dynamischen Schleifen, daher funktionieren dort keine Shader, die diese verwenden.
es: Cuando se exporta un proyecto GLES2 a HTML5, se utiliza WebGL 1.0. WebGL 1.0 no soporta bucles dinámicos, así que los shaders que los usan no funcionarán allí.
fr: Lors de l'exportation d'un projet GLES2 vers HTML5, WebGL 1.0 sera utilisé. WebGL 1.0 ne prend pas en charge les boucles dynamiques, donc les shaders qui les utilisent ne fonctionneront pas.
pt_br: Ao exportar um projeto GLES2 para HTML5, o WebGL 1.0 será usado. O WebGL 1.0 não oferece suporte a loops dinâmicos, portanto, os shaders que os usam não funcionam lá.
ru: При экспорте проекта GLES2 в HTML5 будет использоваться WebGL 1.0. WebGL 1.0 не поддерживает динамические циклы, поэтому использующие их шейдеры там работать не будут.
zh_tw: 當匯出 GLES2 專案為 HTML5 時會使用 WebGL 1.0。WebGL 1.0 不支援動態循環，因此使用動態循環的著色器將不會運作。

source: Serving the files
de: Dateien bereitstellen
es: Entrega de archivos
fr: Distribuer les fichiers
ja: ファイルの提供
pt_br: Servindo os arquivos
ru: Обслуживание файлов
zh_tw: 提供檔案

source: Exporting for the web generates several files to be served from a web server, including a default HTML page for presentation. A custom HTML file can be used, see :ref:`doc_customizing_html5_shell`.
de: Beim Exportieren für das Web werden mehrere Dateien erzeugt, die von einem Webserver bereitgestellt werden, einschließlich einer Standard-HTML-Seite für die Präsentation. Eine benutzerdefinierte HTML-Datei kann verwendet werden, siehe :ref:`doc_customizing_html5_shell`.
es: Exportar para la web genera varios archivos para ser servidos desde un servidor web, incluyendo una página HTML por defecto para la presentación. Se puede utilizar un archivo HTML personalizado, visita :ref:`doc_customizing_html5_shell`.
fr: L'exportation pour le Web génère plusieurs fichiers à transférer depuis un serveur Web, y compris une page HTML par défaut de présentation. Un fichier HTML personnalisé peut être utilisé, voir :ref:`doc_customizing_html5_shell`.
ja: Web用にエクスポートすると、プレゼンテーション用のデフォルトのHTMLページなど、Webサーバーから提供される複数のファイルが生成されます。 カスタムHTMLファイルを使用できます。\ :ref:`doc_customizing_html5_shell`\ を参照して下さい。
pt_br: Exportar para a web gera muitos arquivos que serão servidos a partir de um servidor web, incluindo uma página HTML padrão para apresentação. Um arquivo HTML personalizado pode ser usado, veja :ref:`doc_customizing_html5_shell`.
ru: При экспорте в Интернет создается несколько файлов для обслуживания с веб-сервера, включая HTML-страницу по умолчанию для презентации. Можно использовать собственный HTML-файл, см. :ref:`doc_customizing_html5_shell`.
zh_tw: 匯出網頁會產生多個用來在網頁伺服器上提供的檔案，其中包含一個用來顯示的預設 HTML 頁面。可以使用自定 HTML 檔案，請參考 :ref:`doc_customizing_html5_shell` 。
