Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/exporting_projects.po
Languages: es, fr

source: Exporting projects
es: Exportando proyectos
fr: Exporter des projets

source: Why exporting?
es: ¿Porqué exportar?
fr: Pourquoi exporter ?

source: Originally, Godot did not have any means to export projects. The developers would compile the proper binaries and build the packages for each platform manually.
es: Originariamente, Godot no tenía ningún medio para exportar proyectos. Los desarrolladores tenían que compilar los archivos binarios necesarios y hacer el empaquetado para cada plataforma manualmente.
fr: A l'origine, Godot n'avait aucun moyen d'exporter des projets. Les développeurs compilaient les binaires appropriés et construisaient les paquets pour chaque plate-forme manuellement.

source: When more developers (and even non-programmers) started using it, and when our company started taking more projects at the same time, it became evident that this was a bottleneck.
es: Cuando más desarrolladores (y algunos no-programadores) empezaron a usarlo, y cuando nuestra compañía empezó a recibir más y más proyectos a la vez, se volvió evidente que aquello era un cuello de botella.
fr: Lorsque plus de développeurs (et même des non-programmeurs) ont commencé à l'utiliser, et quand notre société a commencé à prendre plus de projets en même temps, il est devenu évident qu'il s'agissait d'un goulot d'étranglement.

source: On PC
es: En PC
fr: Sur PC

source: Distributing a game project on PC with Godot is rather easy. Drop the godot.exe (or godot) binary together in the same place as the engine.cfg file, zip it and you are done. This can be taken advantage of to make custom installers.
es: Distribuir un proyecto de juego en PC con Godot es bastante fácil. Deje el binario godot.exe (o godot) en el mismo lugar que el archivo engine.cfg, comprímalo y listo. Esto puede ser utilizado para hacer instaladores personalizados.

source: It sounds simple, but there are probably a few reasons why the developer may not want to do this. The first one is that it may not be desirable to distribute loads of files. Some developers may not like curious users peeking at how the game was made, others may find it inelegant, etc.
es: Suena sencillo, pero probablemente haya algunas razones por las que el desarrollador no quiera hacer esto. La primera es que podría no ser conveniente distribuir una gran cantidad de archivos. Algunos desarrolladores no les gustará que los usuarios curiosos se fijen en cómo se hizo el juego, otros pueden encontrarlo poco elegante, etc.

source: Another reason is that, for distribution, the developer might prefer a specially compiled binary, which is smaller in size, more optimized and does not include tools inside (like the editor, debugger, etc.).
es: Otra razón es que, para su distribución, el desarrollador puede preferir una compilación binaria específica, que es más pequeña en tamaño, más optimizada y no incluye las herramientas (como el editor, el debugger, etc...).
fr: Une autre raison est que, pour la distribution, le développeur peut préférer un binaire spécialement compilé, qui est plus petit en taille, plus optimisé et n'inclut pas d'outils à l'intérieur (comme l'éditeur, le débogueur, etc.).

source: Finally, Godot has a simple but efficient system for creating DLCs as extra package files.
es: Finalmente, Godot tiene un sistema simple pero eficiente para creat DLCs como archivos empaquetados adicionales.
fr: Enfin, Godot dispose d'un système simple mais efficace pour créer des DLCs en tant que fichiers de paquets supplémentaires.

source: On mobile
es: En móvil
fr: Sur mobile

source: The same scenario in mobile is a little worse. To distribute a project in those devices, a binary for each of those platforms is built, then added to a native project together with the game data.
es: El mismo escenario en dispositivos móviles es un poco peor. Para distribuir un proyecto en estos dispositivos, se compila un archivo binario para cada una de las plataformas y después se añade a un proyecto nativo junto con los datos del juego.
fr: Le même scénario dans le mobile est légèrement pire. Pour distribuer un projet dans ces appareils, un binaire pour chacune de ces plates-formes est construit, puis ajouté à un projet natif avec les données du jeu.

source: This can be troublesome because it means that the developer must be familiarized with the SDK of each platform before even being able to export. While learning each SDK is always encouraged, it can be frustrating to be forced to do it at an undesired time.
es: Esto puede ser problemático porque significa que el desarrollador debe de estar familiarizado con los kits de desarrollo de cada plataforma antes de ser capaz de exportar. Aunque siempre es recomendable estudiar cada kit de desarrollo, puede ser frustrante verse forzado a hacerlo cuando no se desea.
fr: Cela peut être gênant car cela signifie que le développeur doit se familiariser avec le SDK de chaque plate-forme avant même de pouvoir exporter. Bien que l'apprentissage de chaque SDK soit toujours encouragé, il peut être frustrant d'être forcé de le faire à un moment non désiré.

source: There is also another problem with this approach. Different devices prefer some data in different formats to run. The main example of this is texture compression. All PC hardware uses S3TC (BC) compression and that has been standardized for more than a decade, but mobile devices use different formats for texture compression, such as PVRCT (iOS) or ETC (Android).
es: Hay otro problema con este sistema. Diferentes dispositivos prefieren algunos tipos de datos en formatos diferentes para funcionar. El mayor ejemplo de esto es la compresión de texturas. Todo el hardware de PC usa compresión S3TC (BC) y ese ha sido el estándar desde hace más de una década, pero los dispositivos móviles usan diferentes formatos para la compresión de texturas, como el PVRCT (iOS) o ETC (Android).
fr: Il y a aussi un autre problème avec cette approche. Les différents appareils préfèrent certaines données dans des formats différents. L'exemple principal est la compression de texture. Tout le matériel PC utilise la compression S3TC (BC), standardisée depuis plus d'une décennie, mais les appareils mobiles utilisent des formats différents pour la compression de texture, tels que PVRCT (iOS) ou ETC (Android).

source: Export menu
es: Menú de exportación
fr: Menu d'exportation

source: After many attempts at different export workflows, the current one has proven to work the best. At the time of this writing, not all platforms are supported yet, but the supported platforms continue to grow.
es: Después de diversos intentos con diferentes flujos de exportación, el sistema actual ha demostrado ser el mejor. En el mismo instante en el que se escribe esto, no todas las plataformas están soportadas, pero su número continúa creciendo.
fr: Après de nombreuses tentatives de différents flux d'exportation, le flux actuel s'est avéré être le plus efficace. Au moment d'écrire ces lignes, toutes les plates-formes ne sont pas encore prises en charge, mais les plates-formes prises en charge continuent de croître.

source: To open the export menu, click the "Export" button:
es: Para abrir el menú de exportación, haga clic en el botón "Exportar":

source: The export menu will open, however it will be completely empty.
es: Se abrirá el menú de exportación, no obstante estará completamente vacío.
fr: Le menu d'exportation s'ouvrira, mais il sera complètement vide.

source: That is because we need to add an export preset. To do that click the `Add..` button at the top of the export menu. This will open a drop down list of platforms to choose from for an export preset.
es: Esto es porque primero necesitamos añadir algunos presets. Para añadirlos haz clic en el botón `Añadir` que hay encima del menú de exportación. Esto abrirá una lista con todas la plataformas elegibles para hacer un preset de exportación.
fr: C'est parce que nous devons ajouter un préréglage d'exportation. Pour ce faire, cliquez sur le bouton `Ajouter...` en haut du menu d'exportation. Cela ouvrira une liste déroulante de plates-formes pour lesquelles choisir un préréglage d'exportation.

source: The default options are often enough to export, so tweaking them is not necessary, but provide extra control. However, many platforms require additional tools (SDKs) to be installed to be able to export. Additionally, Godot needs export templates installed to create packages. The export menu will complain when something is missing and will not allow the user to export for that platform until they resolve it:
es: Las opciones por defecto deberían ser suficientes para hacer una exportación, por lo tanto, ajustarlas no es necesario, pero proporciona un nivel extra de control. Ahora bien, muchas plataformas necesitan la instalación de herramientas adicionales (SDKs) para poder exportar. Adicionalmente, Godot necesita las plantillas de exportación instaladas para crear los empaquetados. El menú de exportación se quejará cuando algo no esté instalado y no dejará que el usuario exporte hasta que las dependencias sean resueltas:
fr: Les options par défaut sont souvent suffisantes pour l'exportation, il n'est donc pas nécessaire de les modifier, mais fournissent un contrôle supplémentaire. Cependant, de nombreuses plates-formes nécessitent l'installation d'outils supplémentaires (SDK) pour pouvoir exporter. De plus, Godot a besoin de modèles d'exportation installés pour créer des paquets. Le menu d'exportation se plaindra lorsqu'il manque quelque chose et ne permettra pas à l'utilisateur d'exporter pour cette plate-forme tant qu'il ne l'aura pas résolu :

source: At that time, the user is expected to come back to the documentation and follow instructions on how to properly set up that platform.
es: En ese momento, se espera que el usuario vuelva a la documentación y siga las instrucciones de como configurar adecuadamente esa plataforma.
fr: À ce moment-là, l'utilisateur doit revenir à la documentation et suivre les instructions sur la façon de configurer correctement cette plate-forme.

source: Export templates
es: Plantillas de exportación
fr: Exporter des modèles

source: Apart from setting up the platform, the export templates must be installed to be able to export projects. They can be obtained as a .tpz (a renamed .zip) file from the `download page of the website <https://www.godotengine.org/download>`_.
es: Aparte de configurar la plataforma, las plantillas de exportación deben de instalarse para poder exportar proyectos. Se pueden conseguir como un archivo .tpz (un .zip renombrado) desde la `página de descarga de la web <https://www.godotengine.org/download>`_.
fr: Outre la mise en place de la plate-forme, les modèles d'exportation doivent être installés pour pouvoir exporter des projets. Ils peuvent être obtenus sous la forme d'un fichier .tpz (un fichier .zip renommé) à partir de la `page de téléchargement du site Web <https://www.godotengine.org/download>`_.

source: Once downloaded, they can be installed using the "Install Export Templates" option in the editor:
es: Una vez descargadas, se pueden instalar usando la opción del editor "Instalar Plantillas de Exportación":
fr: Une fois téléchargés, ils peuvent être installés à l'aide de l'option "Installer des modèles d'exportation" dans l'éditeur :

source: Export mode
es: Modo de exportación
fr: Mode d'exportation

source: When exporting, Godot makes a list of all the files to export and then creates the package. There are 3 different modes for exporting:
es: Cuando se exporta, Godot hace una lista de todos los archivos a exportar y después hace el empaquetamiento. Hay 3 diferentes modos de exportación:
fr: Lors de l'exportation, Godot fait une liste de tous les fichiers à exporter et crée ensuite le paquet. Il existe 3 modes différents pour l'exportation :

source: Export every single file in the project
es: Exportar todos los archivos del proyecto
fr: Exporter chaque fichier situé dans le projet

source: Export only resources (+custom filter), this is default.
es: Exportar solo los recursos (+filtro personalizado), esta es la opción por defecto.
fr: Exporter uniquement les ressources (+ filtre personnalisé), c'est le mode par défaut.

source: Export only selected resources (+custom filter)
es: Exportar solo los recursos seleccionados (+filtro personalizado)
fr: Exporter uniquement les ressources sélectionnées (+ filtre personnalisé)

source: **Export every single file** - This mode exports every single file in the project. This is good to test if something is being forgotten, but developers often have a lot of unrelated stuff around in the dev directory, which makes it a bad idea.
es: **Exportar todos los archivos del proyecto** - Este modo exporta todos los archivos del proyecto. Esto sirve para comprobar si se nos ha olvidado algo, pero los desarrolladores suelen tener muchos archivos innecesarios en el directorio de desarrollo, lo que hace que usar esta opción pueda ser una mala idea.
fr: **Exporter tous les fichiers** - Ce mode exporte tous les fichiers du projet. Ceci est bien pour tester si quelque chose a été oublié, mais les développeurs ont souvent beaucoup de choses sans rapport dans le répertoire de dev, ce qui en fait une mauvaise idée.

source: **Export only resources** - Only resources are exported. For most projects, this is enough. However many developers like to use custom datafiles in their games. To compensate for this, filters can be added for extra extensions (like, *.txt,*.csv, etc.).
es: **Exportar solo los recursos** - Solo se exportan los recursos. Para la mayoría de los proyectos esto es suficiente. No obstante, a muchos desarrolladores les gusta tener tipos de archivos personalizados en sus juegos. Para compensar esto, se pueden añadir filtros para extensiones adicionales (como . *.txt, *.csv, etc.).
fr: **Exporter seulement les ressources** - Seules les ressources sont exportées. Pour la plupart des projets, c'est suffisant. Cependant, de nombreux développeurs aiment utiliser des fichiers de données personnalisés dans leurs jeux. Pour compenser cela, des filtres peuvent être ajoutés pour des extensions supplémentaires (comme *.txt,*.csv,*.csv, etc.).

source: **Export only selected resources** - Only select resources from a list are exported. This is probably overkill for most projects, but in some cases it is justified (usually huge projects). This mode offers total control of what is exported. Individual resources can be selected and dependency detection is performed to ensure that everything needed is added. As a plus, this mode allows to "Bundle" scenes and dependencies into a single file, which is *really* useful for games distributed on optical media.
es: **Exportar solo los recursos seleccionados** - Solo se exportan los recursos de la lista. Esto probablemente es demasiado para muchos proyectos, pero en algunos casos está justificado (usualmente en proyectos enormes). Este modo ofrece un control total de lo que se exporta. Hay que seleccionar cada recurso individualmente y la detección de dependencias se ejecuta para asegurarnos de que se añade todo lo necesario. Como algo adicional, este modo permite "Empaquetar" escenas y dependencias en un archivo único, lo que es **verdaderamente** útil para los juegos que se distribuyan en dispositivos ópticos.
fr: **Exporter uniquement les ressources sélectionnées** - Seules les ressources sélectionnées dans une liste sont exportées. C'est probablement exagéré pour la plupart des projets, mais dans certains cas, c'est justifié (généralement des projets de grande envergure). Ce mode offre un contrôle total de ce qui est exporté. Les ressources individuelles peuvent être sélectionnées et la détection des dépendances est effectuée pour s'assurer que tout ce qui est nécessaire est ajouté. De plus, ce mode permet de regrouper les scènes et les dépendances dans un seul fichier, ce qui est *vraiment* utile pour les jeux distribués sur support optique.

source: Export from Command Line
es: Exportar desde la línea de comandos
fr: Exporter à partir de la ligne de commande

source: In production it is useful to automate builds, and Godot supports this with the ``--export`` and ``--export-debug`` command line parameters. Exporting from command line still requires an export template to define the export parameters. A basic invocation of the export would be ``godot --export "Windows Desktop" some_name``
es: En producción es útil automatizar las compilaciones, y Godot ofrece soporte a esto con los parámetros de línea de commandos ``--export`` y ``--export-debug``. Exportar desde la línea de comandos aún requiere una plantilla de exportación para definir los parámetros de exportación. Una invocación básica de exportación podría se ``godot --export "Windows Desktop" some_name``
fr: En production, il est utile d'automatiser les builds, et Godot le supporte avec les paramètres de ligne de commande ``--export`` et ``--export-debug``. L'exportation à partir de la ligne de commande nécessite toujours un modèle d'exportation pour définir les paramètres d'exportation. Une invocation basique de l'exportation serait ``godot -exporter "Windows Desktop" un_nom_quelconque``

source: Which, assuming there is a preset called "Windows Desktop" and the template can be found, will export to ``some_name.exe``. The output path is relative to the project path or absolute. It does not respect the directory the command was invoked from.
es: Asumiendo que hay un preset llamado "Windows Desktop" y que la plantilla se puede encontrar, se exportará a ``some_name.exe``. La ruta de salida es relativa a la ruta del proyecto o absoluta. No se respeta el directorio desde el que el comando fue invocado.
fr: Ce qui, en supposant qu'il y a un preset appelé "Windows Desktop" et que le modèle puisse être trouvé, sera exporté vers ``un_nom_quelqconque.exe``. Le chemin de sortie est relatif au chemin du projet ou absolu. Il ne respecte pas le répertoire à partir duquel la commande a été invoquée.

source: You can also configure it to export only the .pck or .zip file (allowing a single export to be used with multiple Godot executables). This takes place if:
es: También puedes configurarlo para exportar sólo el archivo.pck o .zip (permitiendo que una sola exportación sea usada con múltiples ejecutables de Godot). Esto sucede si:

source: The export preset is not marked as runnable
es: El preset de exportación no está marcado como ejecutable
fr: Le préréglage d'exportation n'est pas marqué comme exécutable

source: The target name ends with `.pck` or with `.zip`
es: El nombre elegido acaba con `.pck`o con `.zip`
fr: Le nom de la cible se termine par `.pck` ou par `.zip`

source: It is often useful to combine the ``--export`` flag with the ``--path`` flag, and to create a dedicated export template for automated export: ``godot --path path/to/project --export "pck" game_name.pck``
es: A menudo es útil combinar el flag ``--export`` con el flag ``--path``, y crear una plantilla de exportación dedicada a exportar de manera automatizada: ``godot --path path/to/project --export "pck" game_name.pck``
fr: Il est souvent utile de combiner le drapeau ``--export`` avec le drapeau ``--path`` et de créer un modèle d'exportation dédié pour l'exportation automatisée : ``godot --path chemin/du/projet --export "pck" nom_du_jeu.pck``
