Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/exporting_for_web.po
Languages: de, es, fr, ja, pt_br, ru, zh_tw

source: Exporting for the Web
de: Exportieren für das Web
es: Exportar para la Web
fr: Exporter pour le Web
ja: Webのエクスポート
pt_br: Exportando para a Web
ru: Экспорт для Интернета
zh_tw: 為 Web 匯出

source: HTML5 export allows publishing games made in Godot Engine to the browser. This requires support for `WebAssembly <https://webassembly.org/>`__ and `WebGL <https://www.khronos.org/webgl/>`__ in the user's browser.
de: Der HTML5-Export ermöglicht die Veröffentlichung von in Godot Engine erstellten Spielen im Browser. Dies erfordert die Unterstützung von `WebAssembly <https://webassembly.org/>`__ und `WebGL <https://www.khronos.org/webgl/>`__ im Browser des Benutzers.
es: Exportar a HTML5 permite publicar juegos hechos en Godot Engine en el navegador. Esto requiere soporte para las tecnologías recientes `WebAssembly <https://webassembly.org/>`__ y `WebGL 2.0 <https://www.khronos.org/webgl/>`__ en el navegador del usuario.
fr: L'exportation HTML5 permet de publier les jeux réalisés avec le moteur Godot dans le navigateur. Cela nécessite le support de `WebAssembly <https://webassembly.org/>`__ et `WebGL <https://www.khronos.org/webgl/>`__ dans le navigateur de l'utilisateur.
ja: HTML5エクスポートは、ブラウザにGodotエンジンで作られたゲームを公開することができます。これには、ユーザーのブラウザで `WebAssembly <https://webassembly.org/>`_ と `WebGL <https://www.khronos.org/webgl/>`_ をサポートする必要があります。
pt_br: A exportação HTML5 permite que jogos feitos com Godot Engine sejam publicados para navegadores. É necessário que o navegador do usuário tenha suporte para `WebAssembly <https://webassembly.org/>`__ e `WebGL <https://www.khronos.org/webgl/>`__ .
ru: Экспорт HTML5 позволяет публиковать игры, созданные в Godot Engine, в браузере. Для этого требуется поддержка `WebAssembly <https://webassembly.org/>`__ и `WebGL <https://www.khronos.org/webgl/>`__ в браузере пользователя.
zh_tw: 匯出 HTML5 可以將 Godot Engine 做的遊戲發佈在瀏覽器上。該功能需要使用者瀏覽器有支援 `WebAssembly <https://webassembly.org/>`__ 與 `WebGL <https://www.khronos.org/webgl/>`__ 。

source: Use the browser-integrated developer console, usually opened with :kbd:`F12`, to view **debug information** like JavaScript, engine, and WebGL errors.
de: Verwenden Sie die in den Browser integrierte Entwicklerkonsole, die normalerweise mit :kbd:`F12` geöffnet wird, um **Debug-Informationen** wie JavaScript-, Engine- und WebGL-Fehler anzuzeigen.
es: Usa la consola de desarrollo integrada en el navegador, usualmente se abre presionando :kbd:`F12`, para ver **información de depuración** como JavaScript, el motor, y errores de WebGL.
fr: Utilisez la console de développement intégrée au navigateur, généralement ouverte avec :kbd:`F12`, pour afficher **les informations de débogage** comme les erreurs JavaScript, moteur et WebGL.
ja: 通常は :kbd:`F12` で開いたブラウザ統合開発者コンソールを使用して、JavaScript、エンジン、WebGL エラーなどの **デバッグ情報** を表示します。
pt_br: Use o console de desenvolvedor integrado no navegador, geralmente aberto com :kbd:`F12`, para ver **informações de debug** do JavaScript, do motor e erros de WebGL.
ru: Используйте встроенную в браузер консоль разработчика, обычно открываемую с помощью :kbd:`F12`, для просмотра **отладочной информации**, такой как ошибки JavaScript, движка и WebGL.
zh_tw: 使用整合在瀏覽器內的開發者主控台 (通常可以按 :kbd:`F12` 打開)，即可檢視如 JavaScript、引擎與 WebGL 錯誤之類的 **除錯資訊** 。

source: `There are significant bugs when running HTML5 projects on iOS <https://github.com/godotengine/godot/issues?q=is:issue+is:open+label:platform:html5+ios>`__ (regardless of the browser). We recommend using :ref:`iOS' native export functionality <doc_exporting_for_ios>` instead, as it will also result in better performance.
es: `Hay errores importantes al ejecutar proyectos HTML5 en iOS <https://github.com/godotengine/godot/issues?q=is:issue+is:open+label:platform:html5+ios>` __ (independientemente del navegador). Recomendamos utilizar :ref:`la funcionalidad de exportación nativa de iOS <doc_exporting_for_ios>` en su lugar, ya que también dará como resultado un mejor rendimiento.
fr: `Il y a des bogues importants lors de l'exécution de projets HTML5 sur iOS <https://github.com/godotengine/godot/issues?q=is:issue+is:open+label:platform:html5+ios>`__ (quel que soit le navigateur). Nous recommandons d'utiliser la :ref:`fonctionnalité d'exportation native de iOS <doc_exporting_for_ios>` à la place, car elle permet également d'obtenir de meilleures performances.
pt_br: `Existem bugs significativos ao executar projetos HTML5 no iOS <https://github.com/godotengine/godot/issues?q=is:issue+is:open+label:platform:html5+ios>`__ (independentemente do navegador). Em vez disso nós recomendamos usar :ref:`iOS' native export functionality <doc_exporting_for_ios>`, pois também resultará em melhor desempenho.
ru: `Возникают значительные ошибки при запуске HTML5-проектов на iOS <https://github.com/godotengine/godot/issues?q=is:issue+is:open+label:platform:html5+ios>`__ (независимо от браузера). Мы рекомендуем использовать :ref:`iOS` родную функциональность экспорта <doc_exporting_for_ios>` вместо этого, так как это также приведет к лучшей производительности.

source: WebGL version
es: Versión de WebGL

source: Depending on your choice of renderer, Godot can target WebGL 1.0 (*GLES2*) or WebGL 2.0 (*GLES3*).
es: Dependiendo de su elección de renderizador, Godot puede apuntar a WebGL 1.0 (* GLES2 *) o WebGL 2.0 (* GLES3 *).

source: WebGL 1.0 is the recommended option if you want your project to be supported on all browsers with the best performance.
es: WebGL 1.0 es la opción recomendada si desea que su proyecto sea compatible con todos los navegadores con el mejor rendimiento.

source: Godot's GLES3 renderer targets high end devices, and the performance using WebGL 2.0 can be subpar. Some features are also not supported in WebGL 2.0 specifically.
es: El renderizador GLES3 de Godot apunta a dispositivos de gama alta, y el rendimiento con WebGL 2.0 puede ser insatisfactorio. Algunas funciones tampoco son compatibles con WebGL 2.0 específicamente.

source: Additionally, while most browsers support WebGL 2.0, this is not yet the case for **Safari**. WebGL 2.0 support is coming in Safari 15 for macOS, and is not available yet for any **iOS** browser (all WebKit-based like Safari). See `Can I use WebGL 2.0 <https://caniuse.com/webgl2>`__ for details.
es: Además, aunque la mayoría de los navegadores son compatibles con WebGL 2.0, este todavía no es el caso de **Safari**. La compatibilidad con WebGL 2.0 viene en Safari 15 para macOS y aún no está disponible para ningún navegador **iOS** (todos basados en WebKit como Safari). Consulte `¿Puedo usar WebGL 2.0 <https://caniuse.com/webgl2>` __ para obtener más detalles.

source: Export options
de: Exportoptionen
es: Opciones de exportación
fr: Options d'exportation
ja: エクスポートオプション
pt_br: Opções de exportação
ru: Опции экспорта
zh_tw: 匯出選項

source: If a runnable web export template is available, a button appears between the *Stop scene* and *Play edited Scene* buttons in the editor to quickly open the game in the default browser for testing.
de: Wenn eine ausführbare Web-Exportvorlage verfügbar ist, wird im Editor eine Schaltfläche zwischen den Schaltflächen *Szene stoppen* und *Bearbeitete Szene abspielen* angezeigt, um das Spiel schnell im Standardbrowser zum Testen zu öffnen.
es: Si hay disponible una plantilla de exportación web ejecutable, aparece un botón entre los botones *Detener escena* y *Reproducir escena* en el editor para abrir rápidamente el juego en el navegador predeterminado para realizar pruebas.
fr: Si un modèle d'exportation Web fonctionnel est disponible, un bouton apparaît entre les boutons *Arrêter la scène* et *Jouer la scène éditée* dans l'éditeur pour ouvrir rapidement le jeu dans le navigateur par défaut pour le tester.
ja: 実行可能なWeb書き出しテンプレートが使用可能な場合は、エディタの [シーンを停止] ボタンと [編集したシーンを再生] ボタンの間にボタンが表示され、既定のブラウザでゲームをすばやく開いてテストできます。
pt_br: Se uma exportação executável web está disponível, um botão aparecerá entre os botões *Pausar cena* e *Jogar Cena editada* no editor para abrir o jogo rapidamente no seu navegador padrão para teste.
ru: Если доступен работоспособный шаблон для экспорта, появляется кнопка между кнопками *Остановка сцены* и *Запустить измененную сцену* в редакторе чтобы быстро открыть игру в браузере по умолчанию для тестов.
zh_tw: 若有可執行的網頁匯出樣板，則在編輯器上 **[停止場景]** 與 **[執行編輯的場景]** 按鈕中間會多一個按鈕，可以用來在預設瀏覽器中快速開啟遊戲來測試。

source: You can choose the **Export Type** to select which features will be available:
es: Puede elegir el ** Tipo de exportación ** para seleccionar qué funciones estarán disponibles:
fr: Vous pouvez choisir le **Type d'exportation** pour sélectionner les fonctionnalités qui seront disponibles :
pt_br: Você pode escolher o **Tipo de Exportação** para selecionar quais recursos estarão disponíveis:
ru: Вы можете выбрать **Тип экспорта**, чтобы выбрать, какие функции будут доступны:

source: *Regular*: is the most compatible across browsers, will not support threads, nor GDNative.
es: * Regular *: es el más compatible en todos los navegadores, no admite subprocesos ni GDNative.
fr: *Regular* : est le plus compatible avec tous les navigateurs, ne supporte pas les threads, ni GDNative.
pt_br: *Normal*: é o mais compatível entre navegadores, mas não oferece suporte a threads, nem GDNative.
ru: *Regular*: наиболее совместим с браузерами, не будет поддерживать потоки и GDNative.

source: *Threads*: will require the browser to support `SharedArrayBuffer <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/SharedArrayBuffer>`__. See `Can I use SharedArrayBuffer <https://caniuse.com/sharedarraybuffer>`__ for details.
es: *Hilos*: requerirá que el navegador admita `SharedArrayBuffer <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/SharedArrayBuffer>`__. Consulte `¿Puedo usar SharedArrayBuffer <https://caniuse.com/sharedarraybuffer>` __ para obtener más detalles.

source: *GDNative*: enables GDNative support but makes the binary bigger and slower to load.
es: * GDNative *: habilita la compatibilidad con GDNative pero hace que el binario sea más grande y más lento de cargar.
fr: *GDNative* : active le support GDNative mais rend le binaire plus gros et plus lent à charger.
ru: *GDNative*: включает поддержку GDNative, но увеличивает размер двоичного файла и замедляет загрузку.

source: If you plan to use :ref:`VRAM compression <doc_import_images>` make sure that **Vram Texture Compression** is enabled for the targeted platforms (enabling both **For Desktop** and **For Mobile** will result in a bigger, but more compatible export).
es: Si tiene previsto utilizar :ref:`Compresión de la memoria RAM <doc_import_images>` asegúrese de que **Compresión de la textura de la memoria RAM** está activada para las plataformas a las que se dirige (si activa tanto **Para escritorio** como **Para móvil**, la exportación será mayor, pero más compatible).
fr: Si vous prévoyez d'utiliser :ref:`Compression VRAM <doc_import_images>`, assurez-vous que **Vram Texture Compression** est activée pour les plateformes ciblées (activer à la fois **For Desktop** et **For Mobile** entraînera une exportation plus grosse, mais plus compatible).
ru: Если вы планируете использовать :ref:`Сжатие VRAM <doc_import_images>`, убедитесь, что **Сжатие текстур Vram** включено для целевых платформ (включение **для настольных компьютеров** и **для мобильных** приведет к большему, но более совместимому экспорту).

source: If a path to a **Custom HTML shell** file is given, it will be used instead of the default HTML page. See :ref:`doc_customizing_html5_shell`.
de: Wenn man einen Pfad zu einer **benutzerdefinierten HTML-Shell**-Datei angibt, wird dieser anstelle der Standard-HTML-Seite verwendet. Siehe :ref:`doc_customizing_html5_shell`.
es: Si se da una ruta a un archivo **HTML shell personalizado**, se utilizará en lugar de la página HTML predeterminada. Ver :ref:`doc_customizing_html5_shell`.
fr: Si un chemin d'accès à un fichier **Custom HTML shell** est fourni, il sera utilisé à la place de la page HTML par défaut. Voir :ref:`doc_customizing_html5_shell`.
ja: カスタムHTMLシェルファイルへのパスが指定されている場合、デフォルトのHTMLページの代わりにそれが使用されます。\ :ref:`doc_customizing_html5_shell`\ を参照してください。
pt_br: Se um caminho para o arquivo **Página HTML personalizado** for especificado, ele será utilizado ao invés da página HTML padrão. Veja :ref:`doc_customizing_html5_shell`.
ru: Если дан путь для файла **пользовательской HTML оболочки**, он будет использован вместо стандартной HTML страницы. Смотрите :ref:`doc_customizing_html5_shell`.
zh_tw: 若有設定 **預設 HTML Shell** 檔案，則會用這個檔案而非預設 HTML 頁面。請參考 :ref:doc_customizing_html5_shell` 。

source: **Head Include** is appended into the ``<head>`` element of the generated HTML page. This allows to, for example, load webfonts and third-party JavaScript APIs, include CSS, or run JavaScript code.
de: **Head Include** wird an das Element <head> der generierten HTML-Seite angehängt. Auf diese Weise können Sie beispielsweise Webfonts und JavaScript-APIs von Drittanbietern laden, CSS hinzufügen oder JavaScript-Code ausführen.
es: **Head Include** se agrega al elemento ``<head>`` de la página HTML generada. Esto permite, por ejemplo, cargar fuentes web y APIs JavaScript de terceros, incluir CSS o ejecutar código JavaScript.
fr: **Head Include** est ajouté à l'élément ``<head>`` de la page HTML générée. Cela permet, par exemple, de charger des polices Web et des API JavaScript tierces, d'inclure du CSS ou d'exécuter du code JavaScript.
ja: **Head Include**\ は、生成されたHTMLページの ``<head>`` 要素に追加されます。これにより、たとえば、WebfontsやサードパーティのJavaScript APIをロードしたり、CSSを組み込んだり、JavaScriptコードを実行したりできます。
pt_br: **Incluído no Cabeçalho** é inserido no elemento ``<head>`` da página HTML gerada. Isso permite, por exemplo, carregar webfonts e APIs JavaScript, incluindo CSS, ou executar código JavaScript.
ru: **Head Include** соединена с элементом ``<head>`` созданной HTML страницы. Это позволяет, к примеру, загружать вебшрифты и сторонние JavaScript API, включать CSS, или использовать код Javascript.
zh_tw: **Head Include** 會被加到產生的 HTML 頁面中 ``<head>`` 元素的尾端。這樣便可以達成如載入 Webfont 或第三方 JavaScript API、加上 CSS 或執行 JavaScript 等功能。

source: **Export types** other then *Regular* are not yet supported by the C# version.
es: ** Tipos de exportación ** que no sean * Regular * aún no son compatibles con la versión C #.
fr: **Export types** autres que *Regular* ne sont pas encore pris en charge par la version C#.
ru: **Типы экспорта**, кроме *Regular*, пока не поддерживаются версией C#.

source: Limitations
de: Limitierungen
es: Limitaciones
fr: Limites
ja: 制限事項
pt_br: Limitações
ru: Ограничения
zh_tw: 限制

source: For security and privacy reasons, many features that work effortlessly on native platforms are more complicated on the web platform. Following is a list of limitations you should be aware of when porting a Godot game to the web.
de: Aus Sicherheits- und Datenschutzgründen sind viele Funktionen, die auf nativen Plattformen mühelos funktionieren, auf der Webplattform komplizierter. Im Folgenden finden Sie eine Liste der Einschränkungen, die Sie beim Portieren eines Godot-Spiels ins Web beachten sollten.
es: Por razones de seguridad y privacidad, muchas de las funciones que funcionan sin esfuerzo en plataformas nativas son más complicadas en la plataforma web. A continuación hay una lista de limitaciones que debes tener en cuenta a la hora de portar un juego Godot a la web.
fr: Pour des raisons de sécurité et de confidentialité, de nombreuses fonctionnalités qui fonctionnent sans effort sur les plates-formes natives sont plus compliquées sur la plate-forme Web. Voici une liste de limitations dont vous devez être conscient lorsque vous portez un jeu Godot sur le web.
ja: セキュリティとプライバシーの理由から、ネイティブ プラットフォームで簡単に動作する多くの機能は、Web プラットフォーム上でより複雑になります。GodotゲームをWebに移植する際に注意する必要がある制限事項の一覧を次に示します。
pt_br: Por motivos de segurança e privacidade, muitas funcionalidades que funcionam sem problemas nas plataformas nativas são mais complicadas na plataforma web. A seguir há uma lista das limitações que se deve estar ciente quando for portar um game do Godot para a web.
ru: По соображениям безопасности и конфиденциальности многие функции, которые легко работают на собственных платформах, на веб-платформе являются более сложными. Ниже приводится список ограничений, о которых следует помнить при переносе игры Godot в Интернет.
zh_tw: 由於安全性與隱私權問題，要將許多在原生平台上能輕鬆運作的功能放到 Web 平台上會很複雜。以下列出了一些在將 Godot 遊戲移植到網頁時應注意的限制。

source: Browser vendors are making more and more functionalities only available in `secure contexts <https://developer.mozilla.org/en-US/docs/Web/Security/Secure_Contexts>`_, this means that such features are only be available if the web page is served via a secure HTTPS connection (localhost is usually exempt from such requirement).
es: Los proveedores de navegadores están haciendo más y más funcionalidades solo disponibles en `contextos seguros <https://developer.mozilla.org/en-US/docs/Web/Security/Secure_Contexts>` _, esto significa que tales características solo están disponibles si la página web se sirve a través de una conexión HTTPS segura (localhost generalmente está exento de tal requisito).
fr: Les fournisseurs de navigateurs rendent de plus en plus de fonctionnalités disponibles uniquement dans des `contextes sécurisés <https://developer.mozilla.org/en-US/docs/Web/Security/Secure_Contexts>`_, ce qui signifie que ces fonctionnalités ne sont disponibles que si la page web est servie via une connexion HTTPS sécurisée (localhost est généralement exempt de cette exigence).
ru: Поставщики браузеров делают все больше и больше функций, доступных только в `безопасных контекстах <https://developer.mozilla.org/en-US/docs/Web/Security/Secure_Contexts>` _, это означает, что такие функции доступны только в том случае, если веб-страница обслуживается через безопасное соединение HTTPS (localhost обычно освобождается от такого требования).

source: Check the `list of open HTML5 issues on GitHub <https://github.com/godotengine/godot/issues?q=is:open+is:issue+label:platform:html5>`__ to see if the functionality you're interested in has an issue yet. If not, open one to communicate your interest.
de: Überprüfen Sie die `Liste der offenen HTML5-Probleme auf GitHub <https://github.com/godotengine/godot/issues?q=is:open+is:issue+label:platform:html5>`__, um zu sehen, ob die Funktionalität, an der Sie interessiert sind, schon ein Problem hat. Falls nicht, öffnen Sie eines, um Ihr Interesse mitzuteilen.
es: Revisa la `lista de issues abiertos sobre HTML5 en Github <https://github.com/godotengine/godot/issues?q=is:open+is:issue+label:platform:html5>`__ para ver si la funcionalidad que te interesa ya tiene un problema reportado. Si no, inicia uno para hacernos llegar tu interés.
fr: Consultez la `liste des issues(problèmes) HTML5 ouvertes sur Github <https://github.com/godotengine/godot/issues?q=is:open+is:issue+label:platform:html5>`__ pour voir si la fonctionnalité qui vous intéresse a déjà une issue. Sinon, ouvrez une pour communiquer votre préoccupation.
pt_br: Cheque a `lista aberta de problemas do HTML no GitHub <https://github.com/godotengine/godot/issues?q=is:open+is:issue+label:platform:html5>`__ para ver se a funcionalidade que você está interessado tem algum problema. Se não, abra uma requisição e comunique o seu interesse.
ru: Проверьте `список открытых проблем HTML5 на GitHub <https://github.com/godotengine/godot/issues?q=is:open+is:issue+label:platform:html5>`__, чтобы увидеть, есть ли проблема, которая вас еще интересует. Если нет, откройте одну, чтобы сообщить свой интерес.
zh_tw: 請瀏覽 `GitHub 上的 HTML5 問題列表 <https://github.com/godotengine/godot/issues?q=is:open+is:issue+label:platform:html5>`__ 以瞭解您有興趣的功能目前是否有問題。若列表上沒有，可以開啟 Issue 來與大家交流。

source: Using cookies for data persistence
de: Verwenden von Cookies für die Datenbeständigkeit
es: Uso de cookies para la persistencia de datos
fr: Utilisation des cookies pour la persistance des données
ja: データ永続化のためのクッキーの使用
pt_br: Usar cookies para dados persistentes
ru: Использование файлов cookie для сохранения данных
zh_tw: 使用 Cookie 來保留資料

source: Users must **allow cookies** (specifically IndexedDB) if persistence of the ``user://`` file system is desired. When playing a game presented in an ``iframe``, **third-party** cookies must also be enabled. Incognito/private browsing mode also prevents persistence.
de: Benutzer müssen **Cookies zulassen** (insbesondere IndexedDB) wenn das Dateisystems ``user: //`` gewünscht wird. Wenn Sie ein Spiel spielen, das in einem ``iframe`` präsentiert wird, müssen **Cookies von Drittanbietern** ebenfalls aktiviert sein. Der Inkognito bzw. Privat-Modus verhindert auch diese Datennutzung.
es: Los usuarios deben **permitir cookies** (específicamente IndexedDB) si se desea la persistencia del sistema de archivos ``user://``. Cuando se juega a un juego presentado en un ``iframe``, también deben estar habilitadas las cookies de **terceros**. El modo de navegación de incógnito/privado también evita la persistencia.
fr: Les utilisateurs doivent **allow cookies** (spécifiquement IndexedDB) si la persistance du système de fichiers ``user :// `` est souhaitée. Lors de l'exécution d'un jeu présenté dans une ``iframe``, les cookies **third-party** doivent également être activés. Le mode de navigation incognito/privé empêche également la persistance.
ja: ``user://`` ファイルシステムの永続性が必要な場合、ユーザーは\ **Cookie(特にIndexedDB)を許可する**\ 必要があります。 ``iframe`` で提供されているゲームを再生する場合は、\ **サードパーティ**\ のCookieも有効にする必要があります。Incognito/privateブラウジングモードも永続性を妨げます。
pt_br: Usuários precisam **permitir cookies** (especificamente IndexedDB) se a persistência do sistema de arquivos ``user://``é desejada. Quando um jogo é exibido em um ``iframe``, **cookies de terceiros** também precisam estar ativados. Navegação anônima/privada também impede persistência.
ru: Пользователи должны **разрешить использование файлов cookie** (в частности, IndexedDB), если требуется сохранение файловой системы ``user: //``. При воспроизведении игры, представленной в ``iframe, также должны быть включены **сторонние** файлы cookie. Режим инкогнито/приватного просмотра также предотвращает постоянство.
zh_tw: 若要保留 ``user://`` 檔案系統中的資料，則使用者必須要 **允許 Cookie** (尤其是 IndexedDB)。若在 ``iframe`` 內玩遊戲的話，則必須同時啟用 **第三方** Cookie。隱私模式也會防止保留資料。

source: The method ``OS.is_userfs_persistent()`` can be used to check if the ``user://`` file system is persistent, but can give false positives in some cases.
de: Die Methode ``OS.is_userfs_persistent()`` kann verwendet werden um zu überprüfen, ob das Dateisystem ``user: //`` nutzbar ist, kann aber in einigen Fällen falsche Erfolgs-Ergebnisse liefern.
es: El método ``OS.is_userfs_persistent()`` puede usarse para comprobar si el sistema de ficheros ``user://`` es persistente, pero puede dar falsos positivos en algunos casos.
fr: La méthode ``OS.is_userfs_persistent()`` peut être utilisée pour vérifier si le système de fichiers ``user://`` est persistant, mais peut donner des faux positifs dans certains cas.
ja: ``OS.is_userfs_persistent()`` というメソッドを使うと、\ ``user://`` ファイルシステムが永続的かどうかをチェックすることができますが、場合によっては誤検出することもあります。
pt_br: O método ``OS.is_userfs_persistent()`` pode ser utilizado para checar se o sistema de arquivos ``user://`` é persistente, mas pode dar falso positivo em alguns casos.
ru: Метод ``OS.is_userfs_persistent()`` может использоваться для проверки того, является ли файловая система ``user://`` постоянным, но в некоторых случаях может давать ложные срабатывания.
zh_tw: ``OS.is_userfs_persistent()`` 方法可以用來檢查 ``user://`` 檔案系統是否會被保留，但有時候檢查結果不會是正確的。

source: Threads
es: Hilos
fr: Sujets
ja: スレッド
ru: Потоки
zh_tw: 執行緒
