Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/exporting_for_web.po
Languages: de, es, fr, ja, pt_br, ru, zh_tw

source: Each project must generate their own HTML file. On export, several text placeholders are replaced in the generated HTML file specifically for the given export options. Any direct modifications to that HTML file will be lost in future exports. To customize the generated file, use the **Custom HTML shell** option.
fr: Chaque projet doit générer son propre fichier HTML. Lors de l'exportation, plusieurs caractères génériques de texte sont remplacés dans le fichier HTML généré spécifiquement pour les options d'exportation données. Toute modification directe du fichier HTML généré sera perdue dans les exportations futures. Pour personnaliser le fichier généré, utilisez l'option **Custom HTML shell**.
ru: Каждый проект должен генерировать свой собственный HTML-файл. При экспорте в сгенерированном HTML-файле заменяется несколько текстовых заполнителей специально для заданных параметров экспорта. Любые прямые изменения в этом HTML-файле будут потеряны при последующем экспорте. Чтобы настроить сгенерированный файл, используйте опцию **Custom HTML shell**.

source: Audio
pt_br: Áudio
ru: Аудио

source: Until the *OpenGL ES 3* renderer is removed from Godot in favor of *Vulkan*, HTML5 export uses *WebGL 2* when the *GLES3* option is selected.
de: Bis der *OpenGL ES 3* Renderer zugunsten von *Vulkan* aus Godot entfernt wird, verwendet der HTML5-Export *WebGL 2* wenn die Option *GLES3* ausgewählt ist.
fr: Jusqu'à ce que le moteur de rendu *OpenGL ES 3* soit supprimé de Godot en faveur de *Vulkan*, l'exportation HTML5 utilise *WebGL 2* lorsque l'option *GLES3* est sélectionnée.
ja: *OpenGL ES 3* レンダラーがGodotから削除され *Vulkan* が採用されるまで、\ *GLES3* オプションが選択されている場合、HTML5エクスポートでは *WebGL 2* が使用されます。
zh_tw: 直到 Godot 將 **OpenGL ES 3** 轉譯器刪除並改用 **Vulkan** 之前，HTML5 匯出都在選擇 **GLES3** 時使用 **WebGL 2** 。

source: Using WebGL 2 is not recommended due to its expected removal from Godot without replacement.
de: Die Verwendung von WebGL 2 wird nicht empfohlen, da es voraussichtlich aus Godot ersatzlos entfernt wird.
fr: L'utilisation de WebGL 2 n'est pas recommandée en raison de son retrait prévu de Godot sans remplacement.
zh_tw: 由於未來 Godot 會將 WebGL 2 移除，且不會有替換方案，所以不建議使用。

source: WebGL 2 is not supported in all browsers. **Firefox** and **Chromium** (Chrome, Opera) are the most popular supported browsers, **Safari** and **Edge** do not work. On **iOS**, all browsers are based on WebKit (i.e. Safari), so they will also not work.
de: WebGL 2 wird nicht in allen Browsern unterstützt. **Firefox** und **Chromium** (Chrome, Opera) sind die beliebtesten unterstützten Browser. **Safari** und **Edge** funktionieren nicht. Unter **iOS** basieren alle Browser auf WebKit (d.H. Safari), sodass sie auch nicht funktionieren.
fr: WebGL 2 n'est pas supporté dans tous les navigateurs. **Firefox** et **Chromium** (Chrome, Opera) sont les navigateurs les plus populaires, **Safari** et **Edge** ne fonctionnent pas. Sous **iOS**, tous les navigateurs sont basés sur WebKit (i.e. Safari), donc ils ne fonctionneront pas non plus.
ja: WebGL 2はすべてのブラウザーでサポートされているわけではありません。\ **Firefox** と **Chromium系** (クローム、オペラ)は、最も人気のあるWebGL 2をサポートしているブラウザですが、\ **Safari** と **Edge** では動作しません。\ **iOS** では、すべてのブラウザは、WebKitの(すなわち、Safariなど)に基づいているので、同様に動作しません。
zh_tw: 並非所有瀏覽器都支援 WebGL 2。 **Firefox** 與 **Chromium** (Chrome, Opera) 為支援的瀏覽器中最受歡迎的，而 **Safari** 與 **Edge** 則不支援。 **iOS** 上所有的瀏覽器都是基於 WebKit 的 (即 Safari)，所以全部都不支援。

source: Godot's WebGL 2 renderer has issues with 3D and is no longer maintained.
de: Der WebGL 2-Renderer von Godot hat Probleme mit 3D und wird nicht länger unterstützt.
fr: Le moteur de rendu WebGL 2 de Godot a des problèmes avec la 3D et n'est plus maintenu.
ja: GodotのWebGL 2レンダラーには3Dの問題があり、メンテナンスが行われなくなりました。
zh_tw: Godot 的 WebGL 2 轉譯器有一些 3D 問題，而且已停止維護。

source: *Threads*: will require the browser to support `SharedArrayBuffer <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/SharedArrayBuffer>`__
fr: *Threads* : le navigateur devra prendre en charge `SharedArrayBuffer <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/SharedArrayBuffer>`__

source: Many browsers, including Firefox and Chromium-based browsers, will not load exported projects when **opened locally** per ``file://`` protocol. To get around this, use a local server.
ja: FirefoxやChromiumベースのブラウザを含む、多くのブラウザは、\ ``file://`` プロトコルごとに\ **ローカルで開いたとき**\ に、エクスポートされたプロジェクトをロードしません。 これを回避するには、ローカルサーバーを使用します。
zh_tw: 包含 Firefox 與基於 Chromium 的瀏覽器在內，都無法以 ``file:`` 協定在 **本機** 開啟匯出的專案。要解決這個問題，請使用本機伺服器。

source: `There are significant bugs when running HTML5 projects on iOS <https://github.com/godotengine/godot/issues/26554>`__ (regardless of the browser). We recommend using :ref:`iOS' native export functionality <doc_exporting_for_ios>` instead, as it will also result in better performance.
zh_tw: `在 iOS 上執行 HTML5 專案有個重大 Bug <https://github.com/godotengine/godot/issues/26554>`__ (不論哪個瀏覽器)。我們建議改用 :ref:`iOS 的原生匯出功能 <doc_exporting_for_ios>` ，以獲得最佳結果。

source: Audio autoplay
ja: オーディオ自動再生
zh_tw: 音訊自動播放

source: :ref:`class_HTTPClient` and :ref:`class_HTTPRequest`
ja: :ref:`class_HTTPClient` と :ref:`class_HTTPRequest`
zh_tw: :ref:`class_HTTPClient` 與 :ref:`class_HTTPRequest`

source: The HTTP classes have several restrictions on the HTML5 platform:
ja: HTTPクラスには、HTML5プラットフォームに関するいくつかの制限があります。
zh_tw: 在 HTML5 平台上，HTTP 類別有一些限制：

source: Exported ``.html`` file must not be reused
ja: エクスポートされた ``.html`` ファイルを再利用することはできません
zh_tw: 匯出的 ``.html`` 檔案無法重複使用

source: Each project must generate their own HTML file. On export, several text placeholders are replaced in the **generated HTML file** specifically for the given export options. Any direct modifications to the **generated HTML file** will be lost in future exports. To customize the generated file, see :ref:`doc_customizing_html5_shell`.
ja: それぞれのプロジェクトはそれ自身のHTMLファイルを生成しなければなりません。エクスポート時に、特定のエクスポートオプション用に **生成されたHTMLファイル** に複数のテキスト プレースホルダが置き換えられます。他の直接の **生成されたHTMLファイル** への変更は以後のエクスポートでは失われます。生成されたファイルのカスタマイズは、\ :ref:`doc_customizing_html5_shell`\ を見て下さい。
zh_tw: 每個專案都會產生自己的 HTML 檔案。匯出時，**產生的 HTML 檔案** 中的各個預留位置都會依據給定的匯出選項取代。若直接修改 **產生的 HTML 檔案** ，則未來匯出的時候都會遺失這些修改。若要自定產生的檔案，請參考 :ref:`doc_customizing_html5_shell` 。

source: Unimplemented functionality
ja: 実装されていない機能
zh_tw: 未實作的功能

source: The following functionality is currently unavailable on the HTML5 platform:
ja: 現在、HTML5 プラットフォームでは次の機能を使用できません:
zh_tw: 下列功能目前不在 HTML5 上支援：

source: Clipboard synchronization between engine and operating system
zh_tw: 在引擎與作業系統間的剪貼簿同步

source: Networking other than :ref:`class_HTTPClient` and :ref:`class_WebSocketClient`
ja: :ref:`class_HTTPClient` および :ref:`class_WebSocketClient` 以外のネットワーク処理
zh_tw: 除了 :ref:`class_HTTPClient` 與 :ref:`class_WebSocketClient` 之外的網路

source: HTML5 export templates may be built without support for the singleton. With such templates, and on platforms other than HTML5, calling ``JavaScript.eval`` will also return ``null``. The availability of the singleton can be checked with the ``JavaScript`` :ref:`feature tag <doc_feature_tags>`::
ja: HTML5エクスポートテンプレートは、シングルトンをサポートせずに構築できます。 このようなテンプレートおよびHTML5以外のプラットフォームでは、 ``JavaScript.eval`` を呼び出すと ``null`` も返されます。 シングルトンの可用性は、 ``JavaScript`` :ref:`feature tag <doc_feature_tags>`\ で確認できます:
zh_tw: 建構的 HTML5 匯出樣板也有可能不支援該單例。這種樣板在 HTML5 之外的平台上呼叫 ``JavaScript.eval`` 也會回傳 ``null`` 。可以通過 ``JavaScript`` :ref:`功能標籤` 來檢查是否可使用該單例：

source: GDNative
de: GDNativ

source: HTML5 export templates may be :ref:`built <doc_compiling_for_web>` without support for the singleton to improve security. With such templates, and on platforms other than HTML5, calling ``JavaScript.eval`` will also return ``null``. The availability of the singleton can be checked with the ``JavaScript`` :ref:`feature tag <doc_feature_tags>`::
de: HTML5-Exportvorlagen können ohne Unterstützung für das Singleton :ref:`gebuilded <doc_compiling_for_web>` sein, um die Sicherheit zu verbessern. Mit solchen Vorlagen und auf anderen Plattformen als HTML5 wird der Aufruf von ``JavaScript.eval`` auch ``null`` zurückgeben. Die Verfügbarkeit des Singletons kann mit dem ``JavaScript`` :ref:`feature tag <doc_feature_tags>` geprüft werden::
