Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/exporting_for_web.po
Languages: de, es, fr, ja, pt_br, ru, zh_tw

source: The generated ``.html`` file can be used as ``DirectoryIndex`` in Apache servers and can be renamed to e.g. ``index.html`` at any time, its name is never depended on by default.
de: Die generierte ``.html`` Datei kann als ``Verzeichnisindex`` in Apache-Servern verwendet werden und kann jederzeit in z.B. ``index.html`` umbenannt werden, ihr Name ist standardmäßig nie davon abhängig.
es: El archivo ``.html`` generado puede ser usado como ``DirectoryIndex`` en los servidores Apache y puede ser renombrado a e.g. ``index.html`` en cualquier momento, nunca dependerá de su nombre por defecto.
fr: Le fichier ``.html`` généré peut être utilisé comme ``DirectoryIndex`` dans les serveurs Apache et peut être renommé, par exemple, ``index.html`` à tout moment, son nom n'étant jamais utilisé par défaut.
ja: 生成された ``.html`` ファイルは、Apacheサーバーで ``DirectoryIndex`` として使用でき、いつでも ``index.html`` などの名前に変更できますが、その名前はデフォルトでは全く依存しません。
pt_br: O arquivo ``.html`` gerado pode ser usado como ``DirectoryIndex`` em servidores Apache e podem ser renomeados para, por exemplo, ``index.html`` a qualquer momento, ele não depende do nome por padrão.
ru: Сгенерированный файл ``.html`` может использоваться как ``DirectoryIndex`` на серверах Apache и может быть переименован, например, в ``index.html``, его имя по умолчанию никогда не зависит от него.
zh_tw: 產生的 ``.html`` 可以用來在 Apache 伺服器中的 ``DirectoryIndex`` 功能中使用，並且可以隨時重命名為如 ``index.html`` 之類的名稱。預設情況下不會依賴其檔名。

source: The HTML page draws the game at maximum size within the browser window. This way it can be inserted into an ``<iframe>`` with the game's size, as is common on most web game hosting sites.
de: Die HTML-Seite zeichnet das Spiel in maximaler Größe innerhalb des Browserfensters. Auf diese Weise kann sie in einen ``<iframe>`` mit der Größe des Spiels eingefügt werden, wie es auf den meisten Webspiel-Hosting-Sites üblich ist.
es: La página HTML dibujará el juego en el tamaño máximo dentro de la ventana del navegador. De esta manera se puede insertar en un ``<iframe>`` con el tamaño del juego, como es común en la mayoría de los sitios web de alojamiento de juegos.
fr: La page HTML dessine le jeu à sa taille maximale dans la fenêtre du navigateur. De cette façon, il peut être inséré dans un ``<iframe>`` avec la taille du jeu, comme c'est courant sur la plupart des sites d'hébergement de jeux web.
ja: HTMLページは、ブラウザウィンドウ内で最大サイズでゲームを描画します。この方法で、ほとんどのWebゲームホスティングサイトで一般的であるように、ゲームのサイズで ``<iframe>`` に挿入できます。
pt_br: A página HTML desenha o jogo no tamanho máximo dentro da janela do navegador. Desta forma, ele pode ser inserido em um ``<iframe>`` com o tamanho do jogo, como é comum na maioria dos sites de hospedagem de jogos na web.
ru: Страница HTML отображает игру в максимально возможном для окна браузера разрешении. Можно использовать ``<iframe>`` с указанием разрешения игры, как это обычно и делают на сайтах с веб-играми.
zh_tw: HTML 頁面會以瀏覽器視窗的最大尺寸來繪製遊戲。這樣便可將其插入在遊戲大小的 ``<iframe>`` 中，大多數遊戲在託管網頁中都是這麼做。

source: The other exported files are served as they are, next to the ``.html`` file, names unchanged. The ``.wasm`` file is a binary WebAssembly module implementing the engine. The ``.pck`` file is the Godot main pack containing your game. The ``.js`` file contains start-up code and is used by the ``.html`` file to access the engine. The ``.png`` file contains the boot splash image. It is not used in the default HTML page, but is included for :ref:`custom HTML pages <doc_customizing_html5_shell>`.
de: Die anderen exportierten Dateien werden so, wie sie sind, neben der ``.html`` Datei serviert, Namen unverändert. Die ``.wasm`` Datei ist ein binäres WebAssembly-Modul, das die Engine implementiert. Die ``.pck`` Datei ist das Godot-Hauptpaket, das Ihr Spiel enthält. Die ``.js`` Datei enthält den Startcode und wird von der ``.html`` Datei benutzt, um auf die Engine zuzugreifen. Die ``.png`` Datei enthält das Boot-Splash-Image. Es wird nicht in der Standard-HTML-Seite verwendet, ist aber für :ref:`eigene HTML Seiten <doc_customizing_html5_shell>` enthalten.
es: Los otros archivos exportados se sirven tal cual, junto al archivo ``.html``, sin cambios en los nombres. El archivo ``.wasm`` es un módulo binario de WebAssembly que implementa el motor. El archivo ``.pck`` es el paquete principal de Godot que contiene tu juego. El archivo ``.js`` contiene código de inicio y es usado por el archivo ``.html`` para acceder al motor. El archivo ``.png`` contiene la imagen de bienvenida al inicio. No se utiliza en la página HTML por defecto, pero se incluye para :ref:`páginas HTML personalizadas <doc_customizing_html5_shell>`.
fr: Les autres fichiers exportés sont transférés tels quels, à côté du fichier ``.html``, noms inchangés. Le fichier ``.wasm`` est un module WebAssembly binaire implémentant le moteur. Le fichier ``.pck`` est le pack principal de Godot contenant votre jeu. Le fichier ``.js`` contient du code de démarrage et est utilisé par le fichier ``.html`` pour accéder au moteur. Le fichier ``.png`` contient l'image de démarrage. Il n'est pas utilisé dans la page HTML par défaut, mais est inclus pour :ref:`pages HTML personnalisées <doc_customizing_html5_shell>`.
ja: エクスポートされた他のファイルは、 ``.html`` ファイルの横にある名前のままで提供されます。 ``.wasm`` ファイルは、エンジンを実装するバイナリWebAssemblyモジュールです。 ``.pck`` ファイルは、ゲームを含むGodotメインパックです。 ``.js`` ファイルには起動コードが含まれており、エンジンにアクセスするために ``.html`` ファイルによって使用されます。 ``.png`` ファイルには、ブートスプラッシュイメージが含まれています。 デフォルトのHTMLページでは使用されませんが、 \ :ref:`カスタムHTMLページ <doc_customizing_html5_shell>`\ に含まれています。
pt_br: Os outros arquivos exportados são servidos como estão, próximos do arquivo ``.html``, com seus nomes inalterados. O arquivo ``.wasm`` é um módulo binário WebAssembly que implementa a engine. O arquivo ``.pck`` é o pacote principal do Godot que contém seu jogo. O arquivo ``.js`` contém códigos de inicialização e é utilizado pelo arquivo ``.html`` para acessar a engine. O arquivo ``.png`` contém a imagem inicial de inicialização. Não é utilizado na página HTML padrão, mas é incluído para :ref:`páginas HTML personalizadas <doc_customizing_html5_shell>`.
ru: Другие экспортируемые файлы служат как они есть, рядом с ``.html``файлом, без изменения имен. ``.wasm`` файл это двоичный модуль WebAssembly, который реализует движок. ``.pck`` файл это главный пакет Godot который содержит вашу игру. ``.js``файл содержит код для запуска и используется ``.html`` файлом для доступа к движку. ``.png`` файл содержит загрузочную заставку. Он не используется в стандартной HTML странице, но включен для :ref:`видоизмененных HTML страниц <doc_customizing_html5_shell>`.
zh_tw: 除了 ``.html`` 外其他的檔案都是以原本的樣子來提供，名稱不變。 ``.wasm`` 檔案為實作引擎的二進位 WebAssembly 模組。 ``.pck`` 檔案則是包含遊戲的 Godot 主要套件。 ``.js`` 檔案包含了由 ``.html`` 檔案用來存取引擎的啟動程式碼。 ``.png`` 檔案包含了啟動畫面，預設的 HTML 頁面不會使用到，但可以用 :ref:`自定 HTML 頁面 <doc_customizing_html5_shell>` 來顯示。

source: The ``.pck`` file is binary, usually delivered with the MIME-type :mimetype:`application/octet-stream`. The ``.wasm`` file is delivered as :mimetype:`application/wasm`.
de: Die ``.pck`` Datei ist binär und wird normalerweise mit dem MIME-Typ :mimetype:`application/octet-stream` geliefert. Die Datei ``.wasm`` wird als :mimetype:`application/wasm` geliefert.
es: El archivo ``.pck`` es binario, normalmente se entrega con el MIME-type :mimetype:`application/octet-stream`. El archivo ``.wasm`` se entrega como :mimetype:`application/wasm`.
fr: Le fichier ``.pck`` est binaire, généralement fourni avec le MIME-type :mimetype:`application/octet-stream`. Le fichier ``.wasm`` est fourni sous la forme :mimetype:`application/wasm`.
ja: ``.pck`` ファイルはバイナリで、通常はMIMEタイプ :mimetype:`application/octet-stream` で配信されます。``.wasm`` ファイルは :mimetype:`application/wasm` として配信されます。
pt_br: O arquivo ``.pck`` é binário, normalmente entregue com o tipo MIME :mimetype:`application/octet-stream`. O arquivo ``.wasm`` é entregue como :mimetype:`application/wasm`.
ru: Файл ``.pck`` является двоичным, обычно поставляется с MIME-типом :mimetype:`application/octet-stream`. Файл ``.wasm`` поставляется как :mimetype:`application/wasm`.
zh_tw: ``.pck`` 檔案為二進位形式，通常會以 MIME 類型 :mimetype:`application/octet-strem` 來傳送。 ``.wasm`` 則是 :mimetype:`application/wasm` 。

source: Delivering the WebAssembly module (``.wasm``) with a MIME-type other than :mimetype:`application/wasm` can prevent some start-up optimizations.
de: Die Auslieferung des WebAssembly-Moduls (``.wasm``) mit einem anderen MIME-Typ als :mimetype:`application/wasm` kann einige Start-Optimierungen verhindern.
es: Emitir el modulo WebAssembly (``.wasm``) con un tipo MIME diferente a :mimetype:`application/wasm` puede evitar algunas optimizaciones de arranque.
fr: La livraison du module WebAssembly (``.wasm``) avec un type MIME autre que :mimetype:`application/wasm` peut empêcher certaines optimisations de démarrage.
ja: :mimetype:`application/wasm` 以外のMIMEタイプでWebAssemblyモジュール(``.wasm``)を配信すると、起動時の最適化が妨げられる可能性があります。
pt_br: Entregar o módulo WebAssembly (``.wasm``) com um tipo MIME diferente de :mimetype: `application/wasm` pode prevenir algumas otimizações de inicialização.
ru: Доставка модуля WebAssembly (``.wasm``) с помощью MIME-типа отличным от :mimetype:`application/wasm`может предотвратить некоторые оптимизации запуска.
zh_tw: 使用 :mimetype:`application/wasm` 之外的 MIME 類型來傳遞 WebAssembly 模組 (``.wasm`) 可以防止一些啟動最佳化。

source: Delivering the files with server-side compression is recommended especially for the ``.pck`` and ``.wasm`` files, which are usually large in size. The WebAssembly module compresses particularly well, down to around a quarter of its original size with gzip compression.
de: Die Lieferung der Dateien mit serverseitiger Kompression wird besonders für die ``.pck`` und ``.wasm`` Dateien empfohlen, die normalerweise groß sind. Das WebAssembly-Modul komprimiert besonders gut, mit gzip-Kompression auf etwa ein Viertel seiner ursprünglichen Größe.
es: Se recomienda entregar los archivos con compresión del lado del servidor especialmente para los archivos ``.pck`` y ``.wasm``, que suelen ser de gran tamaño. El módulo WebAssembly se comprime particularmente bien, hasta alrededor de un cuarto de su tamaño original con compresión gzip.
fr: La distribution des fichiers avec une compression côté serveur est recommandée spécialement pour les fichiers ``.pck`` et ``.wasm``, qui sont généralement de grande taille. Le module WebAssembly comprime particulièrement bien, avec environ un quart de la taille d'origine avec la compression gzip.
ja: サーバー側の圧縮でファイルを配信することは、通常はサイズが大きい ``.pck`` ファイルと ``.wasm`` ファイルで特に推奨されます。WebAssemblyモジュールは、gzip圧縮によって元のサイズの約4分の1にまで圧縮されています。
pt_br: Hospedar os arquivos com compressão no lado do servidor é recomendada principalmente pelos arquivos ``.pck`` e ``.wasm``, que geralmente são arquivos grandes. O módulo WebAssembly comprime muito bem, até cerca de um quarto do seu tamanho original com compressão gzip.
ru: Доставка файлов с сжатием на стороне сервера особенно рекомендуется для ``.pck`` и ``.wasm``файлов, которые обычно большого размера. Модуль WebAssembly сжимает особенно хорошо, вплоть до четверти изначального размера с сжатием gzip.
zh_tw: 建議以伺服器端壓縮來傳送這些檔案，特別是 ``.pck`` 與 ``.wasm`` ，這兩種檔案大小通常很大。WebAssembly 模組特別適合壓縮，使用 gzip 通常能壓縮到小於原本的四分之一。

source: **Hosts that provide on-the-fly compression:** GitHub Pages (gzip)
es: **Host que proveen compresión sobre la marcha:** GitHub Pages (gzip)
ru: **Хосты, предоставляющие сжатие на лету:** GitHub Pages (gzip)

source: **Hosts that don't provide on-the-fly compression:** itch.io, GitLab Pages (`supports manual gzip precompression <https://webd97.de/post/gitlab-pages-compression/>`__)
es: **Host que no proveen compresión sobre la marcha:** itch.io, GitLab Pages (`soporta precompresión manual con gzip <https://webd97.de/post/gitlab-pages-compression/>`__)
ru: **Хосты, которые не предоставляют сжатие на лету:**itch.io, GitLab Pages (`поддерживает предварительное сжатие gzip вручную <https://webd97.de/post/gitlab-pages-compression/>`__)

source: Calling JavaScript from script
de: Aufruf von JavaScript aus dem Skript
es: Llamada a JavaScript desde script
fr: Appel de JavaScript depuis un script
ja: スクリプトからJavaScriptを呼び出す
pt_br: Chamando JavaScript a partir do script
ru: Вызов JavaScript из сприпта (сценария)
zh_tw: 從腳本中呼叫 JavaScript

source: In web builds, the ``JavaScript`` singleton is implemented. It offers a single method called ``eval`` that works similarly to the JavaScript function of the same name. It takes a string as an argument and executes it as JavaScript code. This allows interacting with the browser in ways not possible with script languages integrated into Godot.
de: In Webbuilds ist der JavaScript-Singleton implementiert. Es bietet eine einzige Methode namens "eval", die ähnlich wie die gleichnamige JavaScript-Funktion funktioniert. Es nimmt eine Zeichenfolge als Argument und führt sie als JavaScript-Code aus. Dies ermöglicht die Interaktion mit dem Browser auf eine Weise, die mit in Godot integrierten Skriptsprachen nicht möglich ist.
es: En las desarrollos web, se implementa el singleton ``JavaScript``. Ofrece un único método llamado ``eval`` que funciona de forma similar a la función JavaScript del mismo nombre. Toma una cadena como argumento y la ejecuta como código JavaScript. Esto permite interactuar con el navegador de formas que no son posibles con lenguajes de script integrados en Godot.
fr: Dans les versions Web, le singleton ``JavaScript`` est implémenté. If offre une seule méthode appelée ``eval`` qui fonctionne de manière similaire à la fonction JavaScript du même nom. Il prend une chaîne comme argument et l'exécute en tant que code JavaScript. Cela permet d’interagir avec le navigateur selon des façons qui ne seraient pas possibles avec les langages de scripts intégrés à Godot.
ja: Webビルドでは、\ ``JavaScript`` シングルトンが実装されます。同名のJavaScript関数と同様に機能する ``eval`` と呼ばれる単一のメソッドを提供します。文字列を引数として受け取り、JavaScriptコードとして実行します。これにより、Godotに統合されたスクリプト言語では不可能な方法でブラウザと対話できます。
pt_br: Em compilações web, o singleton ``JavaScript`` é implementado. Ele oferece um único método chamado ``eval`` que funciona de forma semelhante à função JavaScript de mesmo nome. Ele pega uma string como argumento e a executa como código JavaScript. Isso permite interagir com o navegador de maneiras não possíveis com linguagens de script integradas ao Godot.
ru: В веб-сборки включен синглтон ``JavaScript``. Он предлагает единственный метод названный ``eval`` который работает схоже с функцией Javascript названной так же. Этот метод как аргумент берет строку и выполняет её как код Javascript. Это позволяет взаимодействовать с браузером такими путями, которые не были бы возможны со встроенными в Godot скриптовыми языками.
zh_tw: 在網頁建構中有實作 ``JavaScript`` 單例。該單例只提供了一個名為 ``eval`` 的方法，類似 JavaScript 中相同名稱的函式。該方法接受單一字串引數，會將該字串作為 JavaScript 程式碼來執行。這樣便可用 Godot 整合腳本中無法實現的方法來與瀏覽器互動。

source: The value of the last JavaScript statement is converted to a GDScript value and returned by ``eval()`` under certain circumstances:
de: Der Wert der letzten JavaScript-Anweisung wird in einen GDScript-Wert konvertiert und unter bestimmten Umständen von ``eval()`` zurückgegeben:
es: El valor de la última sentencia JavaScript es convertido a un valor GDScript y devuelto por ``eval()`` bajo ciertas circunstancias:
fr: La valeur de la dernière déclaration JavaScript est convertie en une valeur GDScript et renvoyée par ``eval()`` dans certaines circonstances :
ja: 最後のJavaScriptステートメントの値はGDScriptの値に変換され、特定の状況下では ``eval()`` によって返されます:
pt_br: O valor da última instrução do JavaScript é convertido para um valor GDScript e retornado por ``eval()`` sob certas circunstâncias:
ru: Значение последнего выражения Javascript превращается в значение GDScript и возвращается ``eval()`` при определенных обстоятельствах:
zh_tw: 特定情況下，最後一個 JavaScript 陳述式的回傳值會轉換為 GDScript 值，並由 ``eval()`` 回傳：

source: JavaScript ``number`` is returned as GDScript :ref:`class_float`
de: JavaScript ``Nummer`` wird in GDScript zurückgegeben als :ref: `class_float`
es: JavaScript ``number`` se devuelve como GDScript :ref:`class_float`
fr: Un ``number`` JavaScript est retourné en tant que GDScript :ref:`class_float`
ja: JavaScript番号はGDScriptとして返されます :ref:`class_float`
pt_br: Um ``número`` do JavaScript é retornado como GDScript :ref:`class_float`
ru: ``Число`` в Javascript возвращается как класс GDScript :ref:`class_float`(число с плавающей точкой)
zh_tw: JavaScript ``number`` 型會以 GDScript :ref:`class_float` 回傳

source: JavaScript ``boolean`` is returned as GDScript :ref:`class_bool`
de: JavaScript ``boolean`` wird in GDScript zurückgegeben als :ref:`class_bool`
es: JavaScript ``boolean`` se devuelve como GDScript :ref:`class_bool`
fr: Un ``boolean`` JavaScript est retourné en tant que GDScript :ref:`class_bool`
ja: JavaScriptブール値はGDScriptとして返されます :ref:`class_bool`
pt_br: O valor ``booleano`` do JavaScript é retornado como GDScript :ref:`class_bool`
ru: ``Булевое``значение в Javascript возвращается как класс GDScript :ref:`class_bool` (булевое значение)
zh_tw: JavaScript ``bool`` 型會以 GDScript :ref:`class_bool` 回傳

source: JavaScript ``string`` is returned as GDScript :ref:`class_String`
de: JavaScript ``string`` wird in GDScript zurückgegeben als :ref:`class_String`
es: JavaScript ``string`` se devuelve como GDScript :ref:`class_String`
fr: Un ``string`` JavaScript est retournée en tant que GDScript :ref:`class_String`
ja: JavaScript文字列はGDScriptとして返されます :ref:`class_String`
pt_br: O valor do tipo ``string`` no JavaScript é retornado como GDScript :ref:`class_String`
ru: ``Строка`` в Javascript возвращается как класс GDScript :ref:`class_String`(строка)
zh_tw: JavaScript ``string`` 型會以 GDScript :ref:`class_String` 回傳

source: JavaScript ``ArrayBuffer``, ``TypedArray`` and ``DataView`` are returned as GDScript :ref:`class_PoolByteArray`
de: JavaScript ``ArrayBuffer``, ``TypedArray`` und ``DataView`` werden in GDScript zurückgegeben als :ref:`class_PoolByteArray`
es: JavaScript ``ArrayBuffer``, ``TypedArray`` y ``DataView`` se devuelven como GDScript :ref:`class_PoolByteArray`
fr: JavaScript ``ArrayBuffer``, ``TypedArray`` et ``DataView`` sont retournés en tant que GDScript :ref:`class_PoolByteArray`
ja: JavaScriptのArrayBuffer、TypedArray、DataViewはGDScriptとして返されます :ref:`class_PoolByteArray`
pt_br: No JavaScript os valores do tipo ``ArrayBuffer``, ``TypedArray`` e ``DataView`` são retornados como GDScript :ref:`class_PoolByteArray`
ru: JavaScript ``ArrayBuffer``, ``TypedArray`` и ``DataView`` возвращается как класс GDScript :ref:`class_PoolByteArray`
zh_tw: JavaScript ``ArrayBuffer``, ``TypedArray`` 與 ``DataView`` 型會以 GDScript :ref:`class_PoolByteArray` 回傳

source: Any other JavaScript value is returned as ``null``.
de: Jeder andere JavaScript-Wert wird zurückgegeben als ``null``.
es: Cualquier otro valor de JavaScript se devuelve como ``null``.
fr: Toute autre valeur JavaScript est retournée comme ``null``.
ja: その他の JavaScriptの値は ``null`` として返されます。
pt_br: Qualquer outro valor no JavaScript é retornado como ``null``.
ru: Любое другое значение в Javascript возвращено как ``null`` (``ноль``).
zh_tw: 其他的 JavaScript 值則會回傳為 ``null`` 。

source: HTML5 export templates may be :ref:`built <doc_compiling_for_web>` without support for the singleton to improve security. With such templates, and on platforms other than HTML5, calling ``JavaScript.eval`` will also return ``null``. The availability of the singleton can be checked with the ``JavaScript`` :ref:`feature tag <doc_feature_tags>`::
es: Las plantillas de exportación HTML5 pueden ser: ref:`built <doc_compiling_for_web>` sin soporte para el singleton para mejorar la seguridad. Con tales plantillas, y en plataformas distintas de HTML5, llamar a ``JavaScript.eval`` también devolverá ``null``. La disponibilidad del singleton se puede verificar con el ``JavaScript`` :ref:`feature tag <doc_feature_tags>`::
ru: Шаблоны для экспорта HTML5 могут быть :ref:`built <doc_compiling_for_web>` без поддержки синглтона для повышения безопасности. С такими шаблонами и на платформах, отличных от HTML5, вызов ``JavaScript.eval`` также вернет ``null``. Наличие синглтона можно проверить с помощью тега ``JavaScript`` :ref:``feature tag <doc_feature_tags>`::

source: GDScript's multi-line strings, surrounded by 3 quotes ``"""`` as in ``my_func3()`` above, are useful to keep JavaScript code readable.
de: Die mehrzeiligen Strings von GDScript, umgeben von 3 Anführungszeichen ``"""`` wie in ``my_func3()`` oben, sind nützlich, um JavaScript-Code lesbar zu halten.
es: Los strings multilinea de GDScript, rodeados por 3 comillas dobles ``"""`` como arriba en ``my_func3()``, son útiles para mantener el código JavaScript más legible.
fr: Les chaînes multi-lignes de GDScript, entourées de 3 guillemets ``"""`` comme dans ``my_func3()`` ci-dessus, sont utiles pour garder le code JavaScript lisible.
ja: 上記の ``my_func3()`` のように、3つの引用符 ``"""`` で囲まれたGDScriptの複数行の文字列は、JavaScriptコードを読みやすくするのに役立ちます。
pt_br: As strings de várias linhas do GDScript, cercadas por 3 aspas ``"""`` como em ``my_func3()``acima, são úteis para manter o código JavaScript legível.
ru: Многострочные строки GDScript, окруженные 3 кавычками ``"""``, как в ``my_func3()`` выше, полезны для сохранения читабельности кода JavaScript.
zh_tw: GDScript 的多行字串是由三個引號 ``"""`` 來包圍，如同上方 ``my_func3()`` 中的範例，適用於讓 JavaScript 更容易閱讀。

source: The ``eval`` method also accepts a second, optional Boolean argument, which specifies whether to execute the code in the global execution context, defaulting to ``false`` to prevent polluting the global namespace::
de: Die ``eval`` Methode akzeptiert auch ein zweites, optionales boolesches Argument, das angibt, ob der Code im globalen Ausführungskontext ausgeführt werden soll, wobei die Voreinstellung auf ``false`` steht, um eine Verschmutzung des globalen Namensraums zu verhindern::
es: El método ``eval`` también acepta un segundo argumento booleano opcional, que especifica si se debe ejecutar el código en el contexto de ejecución global, por defecto ``false`` para evitar contaminar el espacio de nombres global:
fr: La méthode ``eval`` accepte également un deuxième argument facultatif, booléen, qui spécifie si le code doit être exécuté dans le contexte d'exécution global, la valeur par défaut étant ``faux`` pour éviter de polluer l'espace de nom global :
ja: ``eval`` メソッドはグローバルな実行コンテキストでコードを実行するかどうかを指定する2番目のオプションのブール引数も受け入れます。デフォルトではグローバルな名前空間を汚染しないように ``false`` になります:
pt_br: O método ``eval`` também aceita um segundo argumento do tipo ``Booleano`` que determina se o código deve ser executado no contexto global, padrão ``falso`` para prevenir poluir o namespace global::
ru: Метод ``eval`` также принимает второй необязательный логический аргумент, который указывает, следует ли выполнять код в глобальном контексте выполнения, по умолчанию - ``false``, чтобы предотвратить загрязнение глобального пространства имен::
zh_tw: ``eval`` 方法也接受第二個可選的布林引數，可以用來指定是否要在全域執行上下文中執行程式碼。預設值為 ``false`` ，以防止汙染全域命名空間：
