Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/exporting_for_uwp.po
Languages: ja, ko, uk, zh_cn

source: Exporting for Universal Windows Platform
ja: ユニバーサルWindowsプラットフォームのエクスポート
ko: 유니버설 윈도우 플랫폼으로 내보내기
uk: Експорт для універсальної платформи Windows
zh_cn: 为通用Windows平台导出

source: There's no extra requirement to export an ``.appx`` package that can be installed as a Windows App or submitted to the Windows Store. Exporting UWP packages also works from any platform, not only from Windows.
ja: Windowsアプリとしてインストールしたり、Windowsストアに送信したりできる ``.appx`` パッケージをエクスポートするための追加の要件はありません。 UWPパッケージのエクスポートは、Windowsだけでなく、どのプラットフォームからでも機能します。
ko: 윈도우 앱으로 설치하거나 윈도우 스토어에 제출할 수 있는 ``.appx`` 패키지를 내보내기 위한 추가 요구사항은 없습니다. UWP 패키지를 내보내는 것은 윈도우 뿐만 아니라 어느 플랫폼에서든지 가능합니다.
uk: Немає ніяких додаткових вимог для експортування пакета ``.appx``, який можна встановити як програму Windows, або надіслати до магазину Windows. Експорт пакетів UWP також працює з будь-якої платформи, а не лише з Windows.
zh_cn: 导出一个 ``.appx`` 包没有额外的要求，它可以作为Windows应用程序被安装，或提交到Windows应用商店。也可以在任何平台上，而不仅仅是从Windows上，导出UWP软件包。

source: However, if you want to install and run the app, you need to sign it with a trusted signature. Godot supports automatic signing of packages with external tools.
uk: Однак, якщо ви хочете встановити та запустити програму, вам потрібно підписати її надійним підписом. Godot підтримує автоматичне підписання пакетів зовнішніми інструментами.

source: Also, make sure the Publisher Name you set when exporting the package matches the name used on the certificate.
ja: また、パッケージをエクスポートするときに設定した発行元名が証明書で使用される名前と一致していることを確認します。
ko: 그리고 패키지를 내보낼 때 설정한 퍼블리셔 이름이 인증서에 사용되는 이름과 같아야 합니다.
uk: Крім того, переконайтесь, що ім’я видавця, яке ви встановили під час експорту пакету, відповідає імені, яке використовується в сертифікаті.
zh_cn: 此外，请确保导出包时，设置的发布者名称，与证书上使用的名称相匹配。

source: Limitations on Xbox One
ja: XboxOneの制限事項
ko: Xbox One의 제한사항
uk: Обмеження на Xbox One
zh_cn: Xbox One的限制

source: As described in the `UWP documentation <https://docs.microsoft.com/en-us/windows/uwp/xbox-apps/system-resource-allocation>`__:
ja: `UWPドキュメント<https://docs.microsoft.com/en-us/windows/uwp/xbox-apps/system-resource-allocation>` で説明されているように:
ko: `UWP 문서 <https://docs.microsoft.com/en-us/windows/uwp/xbox-apps/system-resource-allocation>`__\ 의 설명에 따라:
uk: Як описано в `документації UWP <https://docs.microsoft.com/en-us/windows/uwp/xbox-apps/system-resource-allocation>`__:
zh_cn: 如 `UWP文档 <https://docs.microsoft.com/en-us/windows/uwp/xbox-apps/system-resource-allocation>`__ 中所述：

source: Submitted as an "App"
ja: "アプリケーション"として提出
ko: "App"으로 제출됨
uk: Подано як "Додаток"
zh_cn: 提交为 ``App``

source: available memory is 1GB
ja: 使用可能なメモリは1GBです
ko: 사용 가능한 메모리는 1GB이다
uk: доступна пам'ять 1GB
zh_cn: 可用内存为1GB

source: share of 2-4 CPU cores
ja: 2-4 CPUコアの共有
ko: 2-4 CPU 코어의 점유율
uk: частка 2-4 ядер процесора
zh_cn: 共享2-4个CPU核

source: shared access of GPU power (45%)
ja: GPUパワーの共有アクセス(45%)
ko: GPU 전력의 공유 액세스 (45%)
uk: загальний доступ до потужності графічного процесора (45%)
zh_cn: 共享GPU能力（45％）

source: Submitted as a "Game" (through `Xbox Live Creators Program <https://www.xbox.com/en-US/developers/creators-program>`__)
ja: "ゲーム"として提出(`Xbox Liveクリエイタープログラム <https://www.xbox.com/en-US/developers/creators-program>' を通じて)
ko: "Game"으로 제출됨 (`Xbox Live 크리에이터스 프로그램 <https://www.xbox.com/ko-kr/developers/creators-program>`__\ 을 통해)
uk: Подано як "Гру" (через `Xbox Live Creators Program <https://www.xbox.com/en-US/developers/creators-program>`__)
zh_cn: 提交为 ``游戏`` （通过 `Xbox Live创意者计划 <https://www.xbox.com/zh-CN/developers/creators-program>`__）

source: available memory is 5GB
ja: 使用可能なメモリは5GBです
ko: 사용 가능한 메모리는 5GB이다
uk: доступна пам'ять 5GB
zh_cn: 可用内存为5GB

source: 4 exclusive CPU cores and 2 shared CPU cores
ja: 4つの排他的なCPUコアと2つの共有CPUコア
ko: 4개의 전용 CPU 코어와 2개의 공유 CPU 코어
uk: 4 ексклюзивні ядра процесора та 2 загальних ядра процесора
zh_cn: 4个专用CPU内核和2个共享CPU内核

source: exclusive access to GPU power (100%)
ja: GPU電源への排他的アクセス(100%)
ko: GPU 전력에 대한 독점적 액세스 (100%)
uk: ексклюзивний доступ до потужності графічного процесора (100%)
zh_cn: 独享GPU能力（100％）

source: Exceeding these memory limitations will cause allocation failures and the application will crash.
ja: これらのメモリ制限を超えると、割り当てエラーが発生し、アプリケーションがクラッシュします。
ko: 이 메모리 한도를 넘게되면 할당에 실패하고 애플리케이션이 팅길 것입니다.
uk: Перевищення цих обмежень пам’яті призведе до помилок розподілу, і програма вийде з ладу.
zh_cn: 超过这些内存限制将导致分配失败，并且应用程序将崩溃。

source: Creating a signing certificate
ja: 署名証明書の作成
ko: 서명 인증서 만들기
uk: Створення сертифіката підпису
zh_cn: 创建签名证书

source: This requires the ``MakeCert.exe`` and ``Pvk2Pfx.exe`` tools, which come with the Windows SDK. If you use Visual Studio, you can open one of its Developer Prompts, since it comes with these tools and they can be located in the path.
ja: これには、Windows SDKに付属の ``MakeCert.exe`` と ``Pvk2Pfx.exe`` ツールが必要です。Visual Studioを使用する場合は、これらのツールが付属しており、パス内に配置できるため、開発者プロンプトの 1 つを開くことができます。
ko: 윈도우 SDK에 있는 ``MakeCert.exe``\ 와 ``Pvk2Pfx.exe`` 도구가 필요합니다. Visual Stuido를 사용한다면, 이 도구들을 갖고 있고 경로가 존재하기 때문에, Developer Prompts에서 이것을 열 수 있습니다.
uk: Для цього потрібні інструменти ``MakeCert.exe`` та ``Pvk2Pfx.exe``, що входять до складу Windows SDK. Якщо ви використовуєте Visual Studio, ви можете відкрити один із запитів розробника, оскільки він постачається з цими інструментами, і вони можуть бути розміщені на шляху.
zh_cn: 这需要Windows SDK附带的 ``MakeCert.exe`` 和 ``Pvk2Pfx.exe`` 工具。如果您使用Visual Studio，则可以打开其中一个开发者命令提示符，因为它附带了这些工具，并且它们可以在路径中定位。

source: You can get more detailed instructions from `Microsoft's documentation <https://msdn.microsoft.com/en-us/library/windows/desktop/jj835832(v=vs.85).aspx>`__.
ja: 詳細な手順については、`マイクロソフトのドキュメント <https://msdn.microsoft.com/en-us/library/windows/desktop/jj835832(v=vs.85).aspx>`_\ _から詳細な手順を参照できます。
ko: 더 자세한 설명은 `Microsoft의 문서 <https://msdn.microsoft.com/en-us/library/windows/desktop/jj835832(v=vs.85).aspx>`__\ 에서 확인할 수 있습니다.
uk: Ви можете отримати більш детальну інструкцію з `документації Microsoft <https://msdn.microsoft.com/en-us/library/windows/desktop/jj835832(v=vs.85).aspx>`__.
zh_cn: 您可以从 `Microsoft的文档 <https://msdn.microsoft.com/en-us/library/windows/desktop/jj835832(v=vs.85).aspx>`__ 获得更详细的说明。

source: First, run ``MakeCert`` to create a private key::
ja: まず、 ``MakeCert`` を実行して秘密鍵を作成します:
ko: 먼저, 개인 키를 만들기 위해 ``MakeCert``\ 를 실행합니다::
uk: Спочатку запустіть ``MakeCert``, щоб створити приватний ключ:
zh_cn: 首先，运行 ``MakeCert`` 来创建私钥：

source: Where ``publisherName`` matches the Publisher Name of your package and ``expirationDate`` is in the ``mm/dd/yyyy`` format.
ja: ここで、 ``publisherName`` はパッケージのパブリッシャー名と一致し、 ``expirationDate`` は ``mm/dd/yyyy`` 形式です。
ko: 여기서 ``publisherName``\ 은 패키지 내 퍼블리셔 이름과 일치하고 ``expirationDate``\ 가 ``mm/dd/yyyy`` 형식입니다.
uk: Де ``publisherName`` збігається з Іменем видавця вашого пакету, а ``expirationDate`` має формат ``mm/dd/yyyy``.
zh_cn: 其中 ``publisherName`` 匹配包的发布者名称，``expirationDate` `是 ``mm/dd/yyyy`` 格式。

source: Next, create a Personal Information Exchange (.pfx) file using ``Pvk2Pfx.exe``::
ja: 次に、 ``Pvk2Pfx.exe`` を使ってPersonal Information Exchange(.pfx)ファイルを作成します:
ko: 다음으로, ``Pvk2Pfx.exe``\ 를 사용해서 개인 정보 교환 (.pfx) 파일을 만듭니다::
uk: Далі створіть файл обміну персональною інформацією (.pfx), використовуючи ``Pvk2Pfx.exe``::
zh_cn: 接下来，使用 ``Pvk2Pfx.exe`` 创建个人信息交换（.pfx）文件：

source: If you don't specify a password with ``/po`` argument, the PFX will have the same password as the private key.
ja: ``/po`` 引数を持つパスワードを指定しない場合、PFXは秘密キーと同じパスワードを持ちます。
ko: ``/po`` 인수로 암호를 지정하지 않으면, PFX는 개인 키와 같은 암호일 것입니다.
uk: Якщо ви не вкажете пароль з аргументом ``/po``, то PFX матиме той самий пароль, що і приватний ключ.
zh_cn: 如果未使用 ``/ po`` 参数指定密码，则PFX将具有与私钥相同的密码。

source: You will also need to trust this certificate in order to be able to install your app. Open the Command Prompt as Administrator and run the following command::
ja: また、アプリをインストールするには、この証明書を信頼する必要があります:
ko: 그리고 앱을 설치하도록 하기 위해 이 인증서를 신뢰하여야 합니다. 관리자 권한으로 명령 프롬포트를 열고 다음 명령을 실행하세요::
uk: Вам також доведеться довіряти цьому сертифікату, щоб мати можливість встановити програму. Відкрийте командний рядок як адміністратор і запустіть таку команду:
zh_cn: 您还需要信任此证书才能安装您的应用。以管理员身份打开命令提示符并运行以下命令：

source: Setting up automatic signing
uk: Налаштування автоматичного підписання

source: To setup automatic signing on export you need to go to Editor Settings > Export > Uwp. From there you need to click on the folder for ``Signtool``, and navigate to the ``SignTool.exe`` file on your computer.
uk: Щоб налаштувати автоматичне підписання під час експорту, потрібно зайти в **Параметри редактора> Експорт> Uwp**. знайти там папку для ``Signtool`` і перейти до файлу ``SignTool.exe`` на вашому комп’ютері.

source: After setting that up close the editor settings, go to Project > Export, and select the UWP preset. Under the ``Signing`` options click on the folder next to ``Certificate`` and go to the certificate file. Then enter the pfxPassword in the password field.
uk: Після встановлення цього режиму закрийте параметри редактора, перейдіть у меню **Проєкт> Експорт** та виберіть попередньо встановлену UWP. У розділі параметрів ``Signing`` натисніть на папку поруч з ``Certificate`` і перейдіть до файлу сертифіката. Потім введіть pfxPassword у поле для пароля.

source: Your project will now be automatically signed on export.
uk: Тепер ваш проєкт буде автоматично підписаний під час експорту.

source: If you want to sign an exported app manually run ``SignTool.exe`` and use the following command.
uk: Якщо ви хочете підписати експортовану програму вручну, запустіть ``SignTool.exe`` та скористайтеся наступною командою.

source: Installing the package
ja: パッケージのインストール
ko: 패키지 설치하기
uk: Встановлення пакета
zh_cn: 安装包

source: As of the Windows 10 Anniversary Update, you are able to install packages simply by double clicking the ``.appx`` file from Windows Explorer.
ja: Windows10周年記念アップデートの時点で、Windowsエクスプローラから``.appx``ファイルをダブルクリックするだけでパッケージをインストールすることができます。
ko: 윈도우 10 1주년 업데이트로, 파일 탐색기에서 단순히 ``.appx`` 파일을 더블 클릭하는 것으로 패키지를 설치할 수 있습니다.
uk: Починаючи з оновлення Windows 10 Anniversary, ви можете встановлювати пакети, просто двічі клацнувши файл ``.appx`` у Провіднику Windows.
zh_cn: 从Windows 10周年更新开始，只需双击Windows资源管理器中的 ``.appx`` 文件即可安装软件包。

source: It's also possible to install by using the ``Add-AppxPackage`` PowerShell cmdlet.
ja: また、 ``Add-AppxPackage`` PowerShell cmdletを使用してインストールすることも可能です。
ko: ``Add-AppxPackage`` PowerShell cmdlet을 사용해서 설치할 수도 있습니다.
uk: Також їх можна встановити за допомогою командлета PowerShell ``Add-AppxPackage``.
zh_cn: 也可以使用 ``Add-AppxPackage`` PowerShell cmdlet进行安装。

source: If you want to update your already installed app, you must update the version number on the new package or first uninstall the previous package.
ja: 既にインストールされているアプリを更新する場合は、新しいパッケージのバージョン番号を更新するか、前のパッケージを最初にアンインストールする必要があります。
ko: 이미 설치된 앱을 업데이트 하는 경우, 새 패키지의 버전 이름을 업데이트하거나 먼저 이전 패키지를 제거해야합니다.
uk: Якщо ви хочете оновити вже встановлену програму, вам слід оновити номер версії нового пакету, або спочатку видалити попередній пакет.
zh_cn: 如果要更新已安装的应用程序，则必须更新新软件包上的版本号或首先卸载以前的软件包。

source: However, if you want to install and run the app, you need to sign it with a trusted signature. Currently, Godot does not support signing of packages, so you need to use external tools to do so.
ko: 하지만, 앱을 설치하고 실행하고 싶다면, 신뢰할 수 있는 서명으로 서명해야합니다. 현재 Godot는 패키지 서명을 지원하지 않으므로, 외부의 도구를 사용해야합니다.
zh_cn: 但是，如果要安装并运行应用程序，则需要使用可信签名对其进行签名。目前，Godot不支持签名包，因此您需要使用外部工具来执行此操作。

source: Signing the package
ko: 패키지 서명하기
zh_cn: 签名包

source: Finally, use ``SignTool.exe`` from the Windows SDK or Visual Studio::
ko: 마지막으로, 윈도우 SDK나 Visual Studio에서 ``SignTool.exe``\ 를 사용합니다::
zh_cn: 最后，使用Windows SDK或Visual Studio中的 ``SignTool.exe``：
