Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/feature_tags.po
Languages: cs, de, es, fr, pt_br

source: Feature tags
cs: Štítky (tagy) pro vlastnosti
es: Etiquetas de características
fr: Tags de fonctionnalité

source: Introduction
cs: Úvod
de: Einführung
es: Introducción
pt_br: Introdução

source: Godot has a special system to tag availability of features. Each *feature* is represented as a string, which can refer to many of the following:
cs: Godot má speciální systém označování dostupnosti funkcí. Každá *funkce* je reprezentována jako řetězec, který může odkazovat na mnoho z následujících položek:
de: Godot verfügt über ein spezielles System zur Kennzeichnung der Verfügbarkeit von Funktionen. Jedes *Merkmal* wird als Zeichenfolge dargestellt, das sich auf viele der folgenden Elemente beziehen kann:
es: Godot tiene un sistema especial para etiquetar la disponibilidad de las características. Cada *característica* se representa como una cadena, y puede referirse a muchas de las siguientes:
fr: Godot a un système spécial pour marquer la disponibilité des fonctionnalités. Chaque *fonctionnalité* est représentée par une chaîne de caractères, qui peut se référer à plusieurs des éléments suivants :
pt_br: Godot tem um sistema especial para marcar a disponibilidade de recursos. Cada *recurso* é representado como uma string, que pode se referir a muitos dos seguintes:

source: Platform name.
cs: Název platformy.
de: Plattform Name.
es: Nombre de la plataforma.
fr: Nom de la plate-forme.
pt_br: Nome da plataforma.

source: Platform architecture (64-bit or 32-bit, x86 or ARM).
cs: Architektura platformy (64bitová nebo 32bitová, x86 nebo ARM).
de: Plattformarchitektur (64-Bit oder 32-Bit, x86 oder ARM).
es: Arquitectura de la plataforma (64 o 32 bits, x86 o ARM).
fr: Architecture de plate-forme (64 bits ou 32 bits, x86 ou ARM).
pt_br: Arquitetura da plataforma (64-bits ou 32-bits, x86 ou ARM).

source: Platform type (desktop, mobile, Web).
cs: Typ platformy (stolní počítač, mobilní zařízení, web).
de: Plattformtyp (Desktop, Mobile, Web).
es: Tipo de plataforma (escritorio, móvil, web).
fr: Type de plate-forme (bureau, mobile, Web).
pt_br: Tipo da plataforma (desktop, celular, Web).

source: Supported texture compression algorithms on the platform.
cs: Podporované algoritmy komprese textur na platformě.
de: Unterstützte Texturkomprimierungsalgorithmen auf der Plattform.
es: Algoritmos de compresión de texturas soportados en la plataforma.
fr: Algorithme de compression de texture supportée par la plateforme.
pt_br: Algoritmos de compressão de textura suportados na plataforma.

source: Whether a build is ``debug`` or ``release`` (``debug`` includes the editor).
cs: Zda je sestavení ``debug`` nebo ``release`` (``debug`` zahrnuje editor).
de: Ob ein Build ``debug`` oder ``release`` ist (``debug`` enthält den Editor).
es: Si la compilación es de depuración (``debug``, con editor) o final (``release``).
fr: Qu'il s'agisse d'une compilation de débogage ``debug`` ou de production ``release`` (``debug'' inclut l'éditeur).
pt_br: Se uma compilação é ``debug`` ou ``release`` (``depuração`` inclui o editor).

source: Whether the project is running from the editor or a "standalone" binary.
cs: Zda je projekt spuštěn z editoru, nebo jako samostatná binárka.
de: Ob das Projekt über den Editor oder eine "eigenständige" Binärdatei ausgeführt wird.
es: Si el proyecto está corriendo desde el editor o como un binario 'independiente'.
fr: Si le projet est exécuté à partir de l'éditeur ou d'un fichier binaire "autonome".
pt_br: Se o projeto está sendo executado pelo editor ou um binário "standalone".

source: Many more things.
cs: Mnoho dalších věcí.
de: Viele weitere Dinge.
es: Muchas más cosas.
fr: Et bien d'autres choses.
pt_br: Muitas outras coisas.

source: Features can be queried at run-time from the singleton API by calling:
cs: Funkce lze za běhu vyhledávat rozhraní singletonu voláním:
de: Features können zur Laufzeit über die Singleton-API abgefragt werden, indem Folgendes aufgerufen wird:
es: Las funciones pueden consultarse en tiempo de ejecución desde llamadas a la API del singleton haciendo:
fr: Les fonctionnalités peuvent être interrogées à l’exécution auprès du singleton API en appelant :
pt_br: Os recursos podem ser consultados em tempo de execução da API singleton chamando:

source: Default features
cs: Výchozí vlastnosti
de: Standardfunktionen
es: Características por defecto
fr: Fonctionnalités par défaut
pt_br: Recursos padrão

source: Here is a list of most feature tags in Godot. Keep in mind they are **case-sensitive**:
cs: Zde je seznam většiny tagů pro vlastnostiv systému v Godot. Mějte na paměti, že jsou **citlivé na velikost písmen**:
de: Hier ist eine Liste der meisten Feature-Tags in Godot. Beachten Sie, dass bei ihnen die Groß- und Kleinschreibung beachtet wird:
es: Aquí hay una lista de la mayoría de las etiquetas de características en Godot. Tenga en cuenta que son *sensibles a mayúsculas y minúsculas*:
fr: Voici une liste de la plupart des tags de fonctionnalités de Godot. Gardez à l'esprit qu'ils sont *sensibles à la casse* :
pt_br: Aqui está uma lista da maioria das tags de funcionalidades em Godot. Tenha em mente que eles são **case-sensitive**:

source: **Feature tag**
cs: **Tag pro vlastnost**
es: **Etiquetas de características**
fr: **Tag de fonctionnalité**

source: **Description**
cs: **Popis**
de: **Beschreibung**
es: **Descripción**
pt_br: **Descrição**

source: Running on Android
cs: Běží na Androidu
de: Läuft auf Android
es: Ejecución en Android
fr: Éxécution sur Android
pt_br: Executando no Android

source: Running on HTML5
cs: Spuštění v HTML5
de: Läuft unter HTML5
es: Ejecución en HTML5
fr: Éxécution en HTML5
pt_br: Executando em HTML5

source: :ref:`JavaScript singleton <doc_javascript_eval>` is available
cs: :ref:`JavaScript singleton <doc_javascript_eval>` je k dispozici
de: :ref:`JavaScript singleton <doc_javascript_eval>` ist verfügbar
es: El :ref:`singleton JavaScript <doc_javascript_eval>` está disponible
fr: Le :ref:`singleton JavaScript <doc_javascript_eval>` est disponible
pt_br: :ref:`JavaScript singleton <doc_javascript_eval>` está disponível

source: Running on macOS
cs: Běží na macOS
de: Läuft unter MacOS
es: Ejecución en macOS
fr: Éxécution sur macOS
pt_br: Executando no macOS

source: Running on iOS
cs: Běží na iOS
de: Läuft unter iOS
es: Ejecución en iOS
fr: Éxécution sur iOS
pt_br: Executando no iOS

source: Running on UWP
cs: Běží na UWP
de: Läuft unter UWP
es: Ejecución en UWP
fr: Éxécution sur UWP
pt_br: Executando em UWP

source: Running on Windows
cs: Běží na Windows
de: Läuft unter Windows
es: Ejecución en Windows
fr: Éxécution sur Windows
pt_br: Executando no Windows

source: Running on X11 (Linux/BSD desktop)
cs: Běží na X11 (Linux/BSD desktop)
de: Läuft unter X11 (Linux/BSD-Desktop)
es: Corriendo sobre X11 (Linux/BSD en escritorio)
fr: Fonctionnant sur X11 (bureau Linux / BSD)
pt_br: Executando no X11 (desktop Linux/BSD)

source: Running on the headless server platform
cs: Běh na platformě headless serveru
de: Läuft auf der Headless-Server-Plattform
es: Ejecución en la plataforma de servidor sin interfaz gráfica
fr: En cours d'exécution sur la plate-forme serveur
pt_br: Executando na plataforma de servidor headless

source: **debug**
cs: **ladění**

source: Running on a debug build (including the editor)
cs: Běží na sestavení ladění (včetně editoru)
de: Läuft auf einem Debug-Build (einschließlich des Editors)
es: Ejecutando en una versión de depuración (incluyendo el editor)
fr: Exécution sur un binaire de débogage
pt_br: Executando uma compilação de debug (incluindo o editor)

source: **release**
cs: **uvolnění**
de: **Veröffentlichung**
es: **versión**

source: Running on a release build
cs: Běží na buildu vydání
de: Läuft auf einem Release-Build
es: Ejecución en una versión de lanzamiento
fr: Éxécution sur un binaire de déploiement
pt_br: Executando em uma compilação de release

source: Running on an editor build
cs: Běží na sestavení editoru
de: Läuft auf einem Editor-Build
es: Ejecutando en una compilación con editor
fr: Exécuter sur une compilation éditeur

source: **standalone**
cs: **samostatný**
es: **independiente**

source: Running on a non-editor build
cs: Běží na sestavě bez editoru
de: Läuft auf einem Nicht-Editor-Build
es: Ejecutando en una compilación sin editor
fr: Exécuter sur une compilation non-éditeur

source: Running on a 64-bit build (any architecture)
cs: Běží na 64bitové verzi (libovolná architektura)
de: Läuft auf einem 64-bit System (jede Architektur)
es: Ejecutando en una versión de 64 bits (cualquier arquitectura)
fr: Exécution sur une version 64-bits (toutes architectures)
pt_br: Executando em uma compilação de 64-bits (qualquer arquitetura)

source: Running on a 32-bit build (any architecture)
cs: Běží na 32bitové verzi (libovolná architektura)
de: Läuft auf einem 32-bit System (jede Architektur)
es: Ejecutando en una versión de 32 bits (cualquier arquitectura)
fr: Éxécution sur une version 32-bits (toutes architectures)
pt_br: Executando em uma compilação de 32-bits (qualquer arquitetura)

source: Running on a 64-bit x86 build
cs: Běží na 64bitové verzi x86
de: Läuft auf einem 64-bit x86
es: Ejecutando en una compilación de 64 bits
fr: Exécution sur une compilation 64 bits x86
pt_br: Executando em uma compilação x86 de 64-bits

source: Running on a 32-bit x86 build
cs: Běží na 32bitové verzi x86
de: Läuft auf einem 32-bit x86
es: Ejecutando en una compilación de 32 bits x86
fr: Exécution sur une version 32 bits x86
pt_br: Executando em uma compilação x86 de 32-bits

source: Running on a 64-bit ARM build
cs: Běží na 64bitové verzi ARM
de: Läuft auf einem 64-bit ARM
es: Ejecutando en una versión de 64 bits ARM
fr: Exécution sur une compilation 64 bits d'ARM
pt_br: Executando uma compilação ARM de 64-bits

source: Running on a 32-bit ARM build
cs: Běží na 32bitové verzi ARM
de: Läuft auf einem 32-Bit ARM
es: Ejecutando en una versión de 32 bits ARM
fr: Exécution sur une version 32 bits ARM
pt_br: Executando uma compilação ARM de 32-bits

source: **mobile**
cs: **mobilní**
es: **móvil**
pt_br: **móvel**

source: Host OS is a mobile platform
cs: Hostitelský OS je mobilní platforma
de: Host OS ist eine mobile Plattform
es: El sistema operativo anfitrión es una plataforma móvil
fr: L’OS hôte est une plateforme mobile
pt_br: Host OS é uma plataforma móvel

source: Host OS is a PC platform (desktop/laptop)
cs: Hostitelský operační systém je platforma PC (stolní počítač/notebook)
de: Host OS ist eine PC-Plattform (Desktop/Laptop)
es: El sistema operativo anfitrión es una PC (escritorio/laptop)
fr: L’OS hôte est une plateforme PC (bureau/ordinateu portable)
pt_br: Host OS é uma plataforma para PC (desktop/laptop)

source: Host OS is a Web browser
cs: Hostitelský OS je webový prohlížeč
de: Das Host OS ist ein Webbrowser
es: El sistema operativo anfitrión es un navegador Web
fr: L’OS hôte est un serveur web
pt_br: Host OS é um navegador da Web

source: Textures using ETC1 compression are supported
cs: Podporovány jsou textury využívající kompresi ETC1
de: Texturen mit ETC1-Komprimierung werden unterstützt
es: Las texturas que utilizan una compresión ETC1 son soportadas
fr: Les textures utllisant une compression ETC1 sont supportées
pt_br: Texturas usando compactação ETC1 são suportadas

source: Textures using ETC2 compression are supported
cs: Podporovány jsou textury využívající kompresi ETC2
de: Texturen mit ETC2-Komprimierung werden unterstützt
es: Las texturas que utilizan una compresión ETC2 son soportadas
fr: Les textures utllisant une compression ETC2 sont supportées
pt_br: Texturas usando compactação ETC2 são suportadas

source: Textures using S3TC (DXT/BC) compression are supported
cs: Podporovány jsou textury využívající kompresi S3TC (DXT/BC)
de: Texturen die S3TC (DXT/BC) Kompression nutzen, werden unterstützt
es: Las texturas que utilizan una compresión S3TC (DXT/BC) son soportadas
fr: Les textures utllisant une compression S3TC (DXT/BC) sont supportées
pt_br: Texturas usando compactação S3TC (DXT/BC) são suportadas

source: Textures using PVRTC compression are supported
cs: Podporovány jsou textury využívající kompresi PVRTC
de: Texturen mit PVRTC-Komprimierung werden unterstützt
es: Las texturas que utilizan una compresión PVRTC son soportadas
fr: Les textures utllisant une compression PVRTC sont supportées
pt_br: Texturas usando compactação PVRTC são suportadas

source: Custom features
cs: Vlastní funkce
de: Benutzerdefinierte Funktionen
es: Funcionalidades personalizadas
fr: Fonctionnalités personnalisées
pt_br: Funções personalizadas

source: It is possible to add custom features to a build; use the relevant field in the *export preset* used to generate it:
cs: Do sestavení je možné přidat vlastní funkce; použijte příslušné pole v předvolbě *exportu* k jeho vygenerování:
de: Es ist möglich, benutzerdefinierte Features zu einem Build hinzuzufügen; verwenden Sie dazu das entsprechende Feld in der *Exportvoreinstellung*, die zur Erstellung des Builds verwendet wurde:
es: Es posible añadir funciones personalizadas a una compilación, usa el campo correspondiente en el *preset de exportación* utilizado para generarla:
fr: Il est possible d'ajouter des fonctionnalités personnalisées à une compilation, il suffit d'utiliser le champ correspondant dans le *préréglage d'exportation* utilisé pour le générer :
pt_br: É possível adicionar funções personalizados a uma compilação; usar o campo relevante no *pré-conjunto de exportação* usado para gerá-lo:

source: Overriding project settings
cs: Přepsání nastavení projektu
de: Projekteinstellungen überschreiben
es: Sobrescribir los ajustes del proyecto
fr: Écraser les paramètres du projet
pt_br: Substituindo configurações do projeto

source: Features can be used to override specific configuration values in the *Project Settings*. This allows you to better customize any configuration when doing a build.
cs: Funkce lze použít k přepsání konkrétních konfiguračních hodnot v *Nastavení projektu*. To umožňuje lépe přizpůsobit jakoukoli konfiguraci při sestavování.
de: Funktionen können verwendet werden, um bestimmte Konfigurationswerte in den *Projekt-Einstellungen* außer Kraft zu setzen. Dadurch können Sie jede Konfiguration beim Erstellen eines Builds besser anpassen.
es: Las características se pueden utilizar para sobrescribir valores de configuración específicos en los" Ajustes del proyecto". Esto permite personalizar mejor cualquier configuración al hacer una compilación.
fr: Des fonctionnalités peuvent être utilisées pour remplacer des valeurs de configuration spécifiques dans les *paramètres du projet*. Cela permet de mieux personnaliser n'importe quelle configuration lors d'une compilation.
pt_br: Funções podem ser usados para substituir valores específicos de configuração nas *Configurações de Projeto*. Isso permite que você personalize melhor qualquer configuração ao fazer uma compilação.

source: In the following example, a different icon is added for the demo build of the game (which was customized in a special export preset, which, in turn, includes only demo levels).
cs: V následujícím příkladu je přidána jiná ikona pro demo sestavení hry (které bylo upraveno ve speciální předvolbě exportu, která naoplátku obsahuje pouze demo úrovně).
de: Im folgenden Beispiel wird ein anderes Symbol für den Demo-Build des Spiels hinzugefügt (der in einer speziellen Exportvoreinstellung angepasst wurde, die wiederum nur Demo-Levels enthält).
es: En el siguiente ejemplo, se añade un icono diferente para la compilación de la demo del juego (que se personalizó en un preset de exportación especial que, a su vez, sólo incluye niveles de demo).
fr: Dans l'exemple suivant, une icône différente est ajoutée pour la compilation de la démo du jeu (qui a été personnalisé dans un préréglage d'exportation spécial, qui, à son tour, n'inclut que des niveaux de démo).
pt_br: No exemplo a seguir, um ícone diferente é adicionado para a construção demo do jogo (que foi personalizado em um pré-conjunto especial de exportação, que, por sua vez, inclui apenas níveis para demonstração).

source: After overriding, a new field is added for this specific configuration:
cs: Po přepsání se přidá nové pole pro tuto konkrétní konfiguraci:
de: Nach dem Überschreiben wird ein neues Feld für diese spezielle Konfiguration hinzugefügt:
es: Después de sobrescribir, se añade un nuevo campo para esta configuración específica:
fr: Après écrasement, un nouveau champ est ajouté pour cette configuration spécifique :
pt_br: Depois da sobreposição, um novo campo é adicionado para esta configuração específica:

source: When using the :ref:`project settings "override.cfg" functionality <class_ProjectSettings>` (which is unrelated to feature tags), remember that feature tags still apply. Therefore, make sure to *also* override the setting with the desired feature tag(s) if you want them to override base project settings on all platforms and configurations.
cs: Při použití funkce :ref:`nastavení projektu "override.cfg" <class_ProjectSettings>` (která se značkami funkcí nesouvisí) nezapomeňte, že značky funkcí stále platí. Proto se ujistěte, že *také* přepíšete nastavení požadovanou značkou (značkami) funkcí, pokud chcete, aby přepsaly základní nastavení projektu na všech platformách a konfiguracích.
de: Benutzt man die Funktion :ref:`project settings "override.cfg" functionality <class_ProjectSettings>` (die unabhängig von den feature tags ist), sollte man beachten, dass die feature tags dennoch gelten. Aus diesem Grund sollte sichergestellt werden, dass die Einstellungen mit den/dem gewünschten feature tag(s) überschrieben werden, wenn Basis-Projekt-Einstellungen auf allen Plattformen und in allen Konfigurationen überschrieben werden sollen.

source: Default overrides
cs: Výchozí přepsání
de: Standardüberschreibungen
es: Sobreescritura de valores por defecto
fr: Écrasements par défaut
pt_br: Substituições padrão

source: There are already a lot of settings that come with overrides by default; they can be found in many sections of the project settings.
cs: Ve výchozím nastavení je již mnoho nastavení, která jsou přepisovatelná; najdete je v mnoha částech nastavení projektu.
de: Es gibt bereits eine Vielzahl von Einstellungen, die standardmäßig mit Überschreibungen versehen sind; sie sind in vielen Abschnitten der Projekteinstellungen zu finden.
es: Ya hay muchos ajustes que vienen con sobreescrituras por defecto, se pueden encontrar en las secciones de los ajustes del proyecto.
fr: Il y a déjà beaucoup de paramètres qui sont fournis avec des remplacements par défaut, ils peuvent être trouvés dans de nombreuses sections des paramètres du projet.
pt_br: Já existem muitas configurações que vêm com substituições por padrão; eles podem ser encontrados em muitas seções das configurações do projeto.

source: Customizing the build
cs: Přizpůsobení sestavení
de: Den Build anpassen
es: Personalización de la Compilación
fr: Personnalisation de la compilation
pt_br: Personalizando a compilação

source: Feature tags can be used to customize a build process too, by writing a custom **ExportPlugin**. They are also used to specify which shared library is loaded and exported in **GDNative**.
cs: Značky funkcí lze použít také k přizpůsobení procesu sestavení, a to napsáním vlastního **ExportPlugin**. Používají se také k určení, která sdílená knihovna se načte a vyexportuje v **GDNative**.
de: Feature-Tags können auch verwendet werden, um einen Build-Prozess anzupassen, indem ein benutzerdefiniertes **ExportPlugin** geschrieben wird. Sie werden auch verwendet, um anzugeben, welche Shared Library in **GDNative** geladen und exportiert wird.
es: Las etiquetas de características pueden ser usadas para personalizar el proceso de compilación, escribiendo un **ExportPlugin** personalizado. También son usadas para especificar qué librerías serán cargadas y exportadas en **GDNative**.
fr: Les tags de fonctionnalité peuvent aussi être utilisés pour personnaliser un processus de compilation, en écrivant un fichier **ExportPlugin** personnalisé. Ils sont également utilisés pour spécifier quelle bibliothèque partagée est chargée et exportée dans **GDNative**.
pt_br: As tags de funções também podem ser usadas para personalizar um processo de compilação, escrevendo um **ExportPlugin** personalizado. Eles também são usados para especificar qual biblioteca compartilhada é carregada e exportada em **GDNative**.

source: **Server**
pt_br: **Servidor**
