Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/export/one-click_deploy.po
Languages: de, es, fr, ja, ru, zh_tw

source: One-click deploy
de: Bereitstellen mit einem Klick
es: Despliegue con un solo clic
fr: Déploiement en un clic
ja: ワンクリック・デプロイ
ru: Развёртывание в один клик
zh_tw: 單鍵部署

source: One-click deploy is only available once you've added an export template marked as **Runnable** in the Export dialog. You can mark several export presets as runnable, but only one preset per platform may be marked as runnable. If you mark a second preset in a given platform as runnable, the other preset will no longer be marked as runnable.
de: Die Bereitstellung mit einem Klick ist nur verfügbar, wenn eine Exportvorlage hinzugefügt wurde, die im Export-Dialogfeld als **Runnable** (lauffähig) gekennzeichnet ist. Es können mehrere Exportvoreinstellungen als lauffähig markiert werden, allerdings darf pro Plattform nur eine einzige Voreinstellung als lauffähig markiert werden. Wird dagegen eine zweite Voreinstellung in einer bestimmten Plattform ebenfalls als lauffähig markiert, wird die andere Voreinstellung nicht mehr als lauffähig markiert.

source: **Android:** Exports the project with debugging enabled and runs it on the connected device.
de: **Android:** Exportiert das Projekt mit aktiviertem Debugging und führt es auf dem verbundenen Gerät aus.

source: Make sure to follow the steps described in :ref:`doc_exporting_for_android`. Otherwise, the one-click deploy button won't appear.
de: Befolgen Sie unbedingt die in :ref:`doc_exporting_for_android` beschriebenen Schritte. Andernfalls wird der Button zur 1-Klick-Bereitstellung mit nicht angezeigt.

source: If you have more than one device connected, Godot will ask you which device the project should be exported to.
de: Falls mehr als ein Gerät angeschlossen ist, fragt Godot auf welches Gerät das Projekt exportiert werden soll.

source: **HTML5:** Starts a local web server and runs the exported project by opening the default web browser.
de: **HTML5:** Startet einen lokalen Webserver und startet das exportierte Projekt, indem der Standardbrowser geöffnet wird.

source: Support for more platforms such as iOS is planned.
de: Die Unterstützung für weitere Plattformen wie iOS ist geplant.

source: If deploying to Android, enable developer mode on your mobile device then enable USB debugging in the device's settings.
de: Aktivieren Sie bei der Bereitstellung für Android den Entwicklermodus auf Ihrem mobilen Gerät und aktivieren Sie dann das USB-Debugging in den Einstellungen des Geräts.

source: After enabling USB debugging, connect the device to your PC using an USB cable.
de: Verbinden Sie das Gerät über ein USB-Kabel mit Ihrem PC, nachdem das USB-Debugging aktiviert wurde.

source: For advanced users, it should also be possible to use wireless ADB.
de: Für fortgeschrittene Benutzer sollte es auch möglich sein, drahtloses ADB zu verwenden.

source: Make sure there is an export preset marked as **Runnable** for the target platform (Android or HTML5).
de: Es sollte sichergestellt werden, dass für die Zielplattform (Android oder HTML5) eine als **Runnable** gekennzeichnete Exportvorgabe vorhanden ist.

source: If everything is configured correctly and with no errors, platform-specific icons will appear in the top-right corner of the editor.
de: Wenn alles richtig und fehlerfrei konfiguriert ist, erscheinen plattform-spezifische Icons in der oberen rechten Ecke des Editors.

source: Click the button to export to the desired platform in one click.
de: Klicken Sie auf den Button, um mit einem Klick auf die gewünschte Plattform zu exportieren.

source: Sounds good, what is it?
es: Suena bien, ¿qué es?
fr: Ça a l'air bien, qu'est-ce que c'est ?
ja: いいですね、それは何ですか？
ru: Звучит хорошо, но что это?
zh_tw: 聽起來不錯，那是什麼？

source: This feature will pop up automatically once a platform is properly configured and a supported device is connected to the computer. Since things can go wrong at many levels (platform may not be configured correctly, SDK may be incorrectly installed, device may be improperly configured, kitty ate the USB cable, etc.), it's good to let the user know that it exists.
es: Esta característica aparecerá automáticamente una vez que una nueva plataforma sea configurada correctamente y que un dispositivo soportado esté conectado al computador. Ya que las cosas pueden fallar en muchos niveles (La plataforma no se ha configurado correctamente, el SDK pudo haberse instalado con errores, el dispositivo puede estar mal configurado, el gatito se comió el cable USB, etc), es bueno dejar que el usuario sepa que existe.
fr: Cette fonction apparaîtra automatiquement une fois qu'une plate-forme est correctement configurée et qu'un dispositif pris en charge est connecté à l'ordinateur. Comme les choses peuvent mal tourner à de nombreux niveaux (la plate-forme peut ne pas être configurée correctement, le SDK peut être mal installé, le périphérique peut être mal configuré, le chaton a mangé le câble USB, etc), il est bon de faire savoir à l'utilisateur qu'il existe.

source: Some platforms (at the time of this writing, only Android and Blackberry 10) can detect when a USB device is connected to the computer, and offer the user to automatically export, install and run the project (in debug mode) on the device. This feature is called, in industry buzz-words, "One Click Deploy" (though, it's technically two clicks...).
es: Algunas plataformas (en el momento de escribir este artículo, sólo Android y Blackberry 10) pueden detectar cuándo un dispositivo USB está conectado a la computadora y ofrecer al usuario la posibilidad de exportar, instalar y ejecutar automáticamente el proyecto (en modo depuración) en el dispositivo. Esta característica se llama, en palabras de moda de la industria, "Despliegue con un solo clic" (o "One Click Deploy", aunque, técnicamente son dos clics...).
fr: Certaines plates-formes (au moment d'écrire ces lignes, seuls Android et Blackberry 10) peuvent détecter quand un périphérique USB est connecté à l'ordinateur, et offrir à l'utilisateur d'exporter, installer et exécuter automatiquement le projet (en mode débogage) sur le périphérique. Cette fonctionnalité est appelée, dans les mots à la mode de l'industrie, "One Click Deploy" ("déploiement en un clic", bien qu'il s'agisse techniquement de deux clics...).

source: Steps for one-click deploy
es: Pasos para el despliegue con un solo clic
fr: Étapes de déploiement en un clic
ja: ワンクリック・デプロイの手順
ru: Шаги по развёртыванию в один клик
zh_tw: 單鍵部署步驟

source: Configure target platform.
es: Configura la plataforma de destino.
fr: Configurer la plate-forme cible.
ja: ターゲットプラットフォームを構成します。
ru: Настройка целевой платформы.
zh_tw: 設定目標平台。

source: Configure device (make sure it's in developer mode, likes the computer, usb is recognized, usb cable is plugged, etc.).
es: Configure el dispositivo (asegúrese de que está en modo desarrollador, como si fuera una computadora, USB es reconocido, el cable USB está conectado, etc.).

source: Connect the device..
es: Conecta el dispositivo...
fr: Connectez l'appareil...

source: And voila!
es: ¡Y listo!

source: Click once.. and deploy!
es: Haga clic una vez... y despliegue!
fr: Cliquez une fois... et déployez !

source: Configure device (make sure it's in developer mode, likes the computer, usb cable is plugged, usb is recognized, etc.).
fr: Configurez l'appareil (assurez-vous qu'il est en mode développeur, qu'il aime l'ordinateur, que le câble usb est branché, que l'usb est reconnu, etc.).

source: And voilà!
fr: Et voilà !
ja: そしてほら!
ru: И вуаля!
zh_tw: 水哦！

source: This feature will pop up automatically once a platform is properly configured and a supported device is connected to the computer. Since things can go wrong at many levels (platform may not be configured correctly, SDK may be incorrectly installed, device may be improperly configured, etc.), it's good to let the user know that it exists.
ja: これの特徴は、プラットフォームが正しく構成され、サポートされているデバイスがコンピュータに接続されると、自動的にポップアップ表示される事です。多くのレベルで問題が発生する可能性があるため(プラットフォームが正しく設定されていない、SDKが正しくインストールされていない、デバイスが正しく設定されていない、デバイスが不適切に設定されている可能性がある、等)、それが存在することをユーザーに知らせるのは良いことです。
ru: Эта функция появится автоматически после правильной настройки платформы и подключения поддерживаемого устройства к компьютеру. Поскольку что-то может пойти не так на многих уровнях (платформа может быть неправильно настроена, SDK может быть неправильно установлен, устройство может быть неправильно настроено и т.д.), хорошо сообщить пользователю, что она существует.
zh_tw: 這個功能會在有正確配置平台且將支援的裝置連接到電腦上後彈出。由於很多地方都有可能出問題 (平台可能未正確設定、可能沒正確安裝 SDK、裝置可能為正確設定…等)，所以讓使用者知道有單鍵部署這功能存在也不錯。

source: Some platforms (at the time of this writing, only Android) can detect when a USB device is connected to the computer, and offer the user to automatically export, install and run the project (in debug mode) on the device. This feature is called, in industry buzzwords, "One-Click Deploy".
ja: 一部のプラットフォーム (このドキュメントの執筆時点では、Androidのみ)は、USBデバイスがコンピュータに接続されているタイミングを検出し、デバイス上でプロジェクトを自動的にエクスポート、インストール、および実行するようにユーザーに提供できます(デバッグモードで)。この機能は、業界の流行語で "One Click Deploy" と呼ばれています。
ru: Некоторые платформы (на момент написания этой статьи только Android) могут обнаруживать, когда USB-устройство подключено к компьютеру, и предлагать пользователю автоматически экспортировать, установить и запустить проект (в режиме отладки) на устройстве. В промышленности эта функция называется "Развёртывание в один клик" (One-Click Deploy).
zh_tw: 有些平台 (在本文撰寫時，只有 Android) 可以在 USB 裝置連接到電腦上時自動偵測，並提供使用者在該裝置上自動匯出、安裝與 (以除錯模式) 執行專案的功能，用業界的流行語來說，就是「單鍵部署」。

source: Configure device (make sure it's in developer mode, likes the computer, USB cable is plugged, USB is recognized, etc.).
ja: デバイスを構成します(デベロッパーモードであること、同様にコンピューターにUSBケーブルが接続されていること、USBが認識されていることなどを確認します)。
ru: Настройте устройство (убедитесь, что оно находится в режиме разработчика, «видит» компьютер, USB-кабель подключен, USB распознан и т.д.).
zh_tw: 設定裝置 (請確定裝置有在開發者模式中，電腦也一樣，要插入 USB 線、有偵測到 USB…等)。

source: Connect the device...
ja: デバイスを接続します...
ru: Подключите устройство...
zh_tw: 連接裝置...

source: Click once... and deploy!
ja: 1 回クリックすると...デプロイ完了!
ru: Щёлкните один раз ... и разверните!
zh_tw: 點一下... 然後就部署了！
