Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/misc/change_scenes_manually.po
Languages: de

source: Change scenes manually
de: Szenen manuell ändern

source: Unloads memory.
de: Speicher freigeben.

source: Pro: RAM is no longer dragging the dead weight.
de: Pro: RAM wird nicht mehr für die unnötigen Sachen verschwendet.

source: Con: Returning to that scene is now more expensive since it must be loaded back into memory again (takes time AND memory). Not a problem if returning soon is unnecessary.
de: Kontra: Die Rückkehr zu dieser Szene ist jetzt teurer, da sie wieder in den Speicher geladen werden muss (benötigt Zeit UND Speicher). Kein Problem, wenn eine baldige Rückkehr nicht erforderlich ist.

source: Con: No longer have access to that scene's data. Not a problem if using that data soon is unnecessary.
de: Kontra: Sie haben keinen Zugriff mehr auf die Daten dieser Szene. Kein Problem, wenn die baldige Verwendung dieser Daten nicht erforderlich ist.

source: Note: It can be useful to preserve the data in a soon-to-be-deleted scene by re-attaching one or more of its nodes to a different scene, or even directly to the :ref:`SceneTree <class_SceneTree>`.
de: Hinweis: Es kann nützlich sein die Daten in einer bald zu löschenden Szene beizubehalten, indem Sie einen oder mehrere seiner Nodes erneut an eine andere Szene anhängen oder sogar direkt an :ref:`SceneTree <class_SceneTree>`.

source: Processing stops.
de: Abarbeitung stoppt.

source: Pro: No nodes means no process, physics process, or input handling. The CPU is available to work on the new scene's contents.
de: Pro: Kein Nodes bedeutet keinen Prozess, keinen physikalischen Prozess oder keine Eingabebehandlung. Die CPU steht zur Verfügung um den Inhalt der neuen Szene zu bearbeiten.

source: Con: Those nodes' processing and input handling no longer operate. Not a problem if using the updated data is unnecessary.
de: Kontra: Die Verarbeitung und Eingabeverarbeitung dieser Nodes funktioniert nicht mehr. Kein Problem, wenn die Verwendung der aktualisierten Daten nicht erforderlich ist.

source: **We can hide the existing scene.** By changing the visibility or collision detection of the nodes, we can hide the entire node sub-tree from the player's perspective.
de: **Wir können die vorhandene Szene ausblenden.** Durch Ändern der Sichtbarkeit oder Kollisionserkennung der Nodes können wir den gesamten Node-Unterbaum aus der Sicht des Spielers ausblenden.

source: Memory still exists.
de: Speicher ist noch vorhanden.

source: Pro: One can still access the data if need be.
de: Pro: Man kann bei Bedarf immer noch auf die Daten zugreifen.

source: Pro: There's no need to move any more nodes around to save data.
de: Pro: Es ist nicht erforderlich weitere Nodes zu verschieben um Daten zu speichern.

source: Con: More data is being kept in memory which will be become a problem on memory-sensitive platforms like web or mobile.
de: Kontra: Es werden mehr Daten im Speicher gehalten, was auf speichersensitiven Plattformen wie Web oder Mobile zu einem Problem wird.

source: Processing continues.
de: Abarbeitung geht weiter.

source: Pro: Data continues to receive processing updates, so the scene will keep updated any data within it that relies on delta time or frame data.
de: Pro: Daten erhalten weiterhin Verarbeitungsaktualisierungen, sodass die Szene alle darin enthaltenen Daten aktualisiert, die auf Delta-Zeit oder Framedaten beruhen.

source: Pro: Nodes are still members of groups (since groups belong to the :ref:`SceneTree <class_SceneTree>`).
de: Pro: Nodes sind immer noch Mitglieder von Gruppen (da Gruppen zum :ref:`Szenenbaum <class_SceneTree>` gehören).

source: Con: The CPU's attention is now divided between both scenes. Too much load could result in low frame rates. One should be sure to test performance as they go to ensure the target platform can support the load they are giving it.
de: Kontra: Die Aufmerksamkeit der CPU wird jetzt auf beide Szenen aufgeteilt. Zu viel Last kann zu niedrigen Bildraten führen. Man sollte sicher sein die Leistung zu testen, um sicherzustellen, dass die Zielplattform die gegebene Last unterstützt.

source: **We can remove the existing scene from the tree.** Assign a variable to the existing scene's root node. Then use :ref:`Node.remove_child(Node) <class_Node_method_remove_child>` to detach the entire scene from the tree.
de: **Wir können die vorhandene Szene aus dem Baum entfernen.** Weisen Sie dem Wurzel-Node der vorhandenen Szene eine Variable zu. Verwenden Sie dann :ref:`Node.remove_child (Node) <class_Node_method_remove_child>` um die gesamte Szene vom Baum zu trennen.

source: Memory still exists (similar pros/cons as with hiding it from view).
de: Speicher ist noch vorhanden (ähnliche Vor- und Nachteile wie beim Ausblenden).

source: Processing stops (similar pros/cons as with deleting it completely).
de: Die Verarbeitung wird gestoppt (ähnliche Vor- und Nachteile wie beim vollständigen Löschen).

source: Pro: This variation of "hiding" it is much easier to show/hide. Rather than potentially keeping track of multiple changes to the scene, one must only call the one method add/remove_child pair of methods. It is similar to disabling game objects in other engines.
de: Pro: Diese Variante des "Versteckens" ist viel einfacher zu zeigen bzw. zu verstecken. Anstatt möglicherweise mehrere Änderungen an der Szene zu verfolgen, muss nur das eine Methodenpaar add/remove_child aufgerufen werden. Es ähnelt dem Deaktivieren von Spielobjekten in anderen Engines.

source: Con: Unlike with hiding it from view only, the data contained within the scene will become stale if it relies on delta time, input, groups, or other data that is derived from :ref:`SceneTree <class_SceneTree>` access.
de: Kontra: Anders als beim Ausblenden nur aus der Ansicht werden die in der Szene enthaltenen Daten veraltet, wenn sie auf Delta-Zeit, Eingaben, Gruppen oder anderen Daten beruhen, die abgeleitet sind vom :ref:`Szenenbaum <class_SceneTree>`.

source: There are also cases where one may wish to have many scenes present at the same time. Perhaps one is adding their own singleton at runtime, or preserving a a scene's data between scene changes (adding the scene to the root node).
de: Es gibt auch Fälle in denen viele Szenen gleichzeitig vorhanden sein sollen. Möglicherweise fügt man zur Laufzeit einen eigenen Singleton hinzu oder behält die Daten einer Szene zwischen Szenenänderungen bei (Hinzufügen der Szene zum Wurzel-Node).

source: Each option will have cases where it is best appropriate, so one must examine the effects of each and determine what path best fits their unique situation.
de: Für jede Option gibt es Fälle für die sie am besten geeignet ist. Daher muss man die Auswirkungen der einzelnen Optionen untersuchen und bestimmen, welche davon am besten zu ihrer individuellen Situation passt.
