Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/misc/gles2_gles3_differences.po
Languages: fr, ja

source: Differences between GLES2 and GLES3
fr: Différences entre GLES2 et GLES3
ja: GLES2とGLES3の違い

source: This page documents the differences between GLES2 and GLES3 that are by design and are not the result of bugs. There may be differences that are unintentional, but they should be reported as bugs.
fr: Cette page explore les différences entre GLES2 et GLES3 dues à leur conception et qui ne sont pas le résultat de bugs. Il peut exister des différences non intentionnelles, mais elles doivent être signalées comme des bugs.
ja: このページには、設計によるものであり、バグの結果ではないGLES2とGLES3の違いが記載されています。意図しない違いもあるかもしれませんが、それはバグとして報告する必要があります。

source: "GLES2" and "GLES3" are the names used in Godot for the two OpenGL-based rendering backends. In terms of graphics APIs, the GLES2 backend maps to OpenGL 2.1 on desktop, OpenGL ES 2.0 on mobile and WebGL 1.0 on the web. The GLES3 backend maps to OpenGL 3.3 on desktop, OpenGL ES 3.0 on mobile and WebGL 2.0 on the web.
fr: "GLES2" et "GLES3" sont les noms utilisés dans Godot pour les deux backends de rendu basés sur OpenGL. En termes d'API graphiques, le backend GLES2 correspond à OpenGL 2.1 sur ordinateur de bureau, OpenGL ES 2.0 sur mobile et WebGL 1.0 sur le web. Le backend GLES3 est correspond à OpenGL 3.3 sur ordinateur de bureau, OpenGL ES 3.0 sur mobile et WebGL 2.0 sur le web.
ja: "GLES2" と "GLES3" は、2つのOpenGLベースのレンダリングバックエンドのGodotで使用される名前です。グラフィックAPIに関しては、GLES2バックエンドはデスクトップのOpenGL 2.1、モバイルのOpenGL ES 2.0、およびWebのWebGL 1.0にマップされます。 GLES3バックエンドは、デスクトップのOpenGL 3.3、モバイルのOpenGL ES 3.0、およびWebのWebGL 2.0にマップします。

source: Particles
fr: Particules
ja: パーティクル

source: GLES2 cannot use the :ref:`Particles <class_Particles>` or :ref:`Particles2D <class_Particles2D>` nodes as they require advanced GPU features. Instead, use :ref:`CPUParticles <class_CPUParticles>` or :ref:`CPUParticles2D <class_CPUParticles2D>`, which provides a similar interface to a :ref:`ParticlesMaterial <class_ParticlesMaterial>`.
fr: GLES2 ne peut pas utiliser les nœuds :ref:`Particles <class_Particles>` ou :ref:`Particles2D <class_Particles2D>` car ils nécessitent des fonctionnalités GPU avancées. Utilisez plutôt :ref:`CPUParticles <class_CPUParticles>` ou :ref:`CPUParticles2D <class_CPUParticles2D>`, qui fournit une interface similaire à un :ref:`ParticlesMaterial <class_ParticlesMaterial>`.
ja: 高度なGPU機能を必要とするため、(それに対応していない)GLES2では :ref:`Particles <class_Particles>` または :ref:`Particles2D <class_Particles2D>` ノードを使用できません。代わりに、\ :ref:`CPUParticles <class_CPUParticles>` または :ref:`CPUParticles2D <class_CPUParticles2D>` を使用します。これは、\ :ref:`ParticlesMaterial <class_ParticlesMaterial>` と同様のインターフェースを提供します。

source: Particles and Particles2D can be converted to their CPU equivalent node with the "Convert to CPUParticles" option in the editor.
fr: Particles et Particles2D peuvent être converties en leur nœud équivalent CPU avec l'option "Convert to CPUParticles" dans l'éditeur.
ja: ParticlesとParticles2Dは、エディタの[CPUパーティクルに変換]オプションを使用して、相当するCPUタイプのノードに変換できます。

source: ``SCREEN_TEXTURE`` mip-maps
fr: Mip-maps ``SCREEN_TEXTURE``
ja: ``SCREEN_TEXTURE`` ミップマップ

source: In GLES2, ``SCREEN_TEXTURE`` (accessed via a :ref:`ShaderMaterial <class_ShaderMaterial>`) does not have computed mip-maps. So when accessing at a different LOD, the texture will not appear blurry.
fr: Dans GLES2, ``SCREEN_TEXTURE`` (accessible via un :ref:`ShaderMaterial <class_ShaderMaterial>`) n'a pas de mip-maps calculées. Ainsi, lors d'un accès à un autre LOD, la texture n'apparaîtra pas floue.
ja: GLES2では、\ ``SCREEN_TEXTURE``(:ref:`ShaderMaterial <class_ShaderMaterial>` を介してアクセス)には計算済のミップマップがありません。そのため、異なるLODでアクセスする場合に、テクスチャの解像度は変更されません。

source: While GLES2 supports ``DEPTH_TEXTURE`` in shaders, it may not work on some old hardware (especially mobile).
fr: Bien que GLES2 supporte ``DEPTH_TEXTURE`` dans les shaders, il peut ne pas fonctionner sur certains vieux hardware (en particulier les mobiles).
ja: GLES2はシェーダーで ``DEPTH_TEXTURE`` をサポートしますが、一部の古いハードウェア(特にモバイル)では機能しない場合があります。

source: Color space
fr: Espace de couleurs
ja: 色空間

source: GLES2 and GLES3 are in different color spaces. This means that colors will appear slightly different between them especially when lighting is used.
fr: GLES2 et GLES3 sont dans des espaces de couleur différents. Cela signifie que les couleurs apparaîtront légèrement différentes entre eux, en particulier lorsque l'éclairage est utilisé.

source: If your game is going to use both GLES2 and GLES3, you can use an ``if`` statement check and see if the output is in sRGB, using ``OUTPUT_IS_SRGB``. ``OUTPUT_IS_SRGB`` is ``true`` in GLES2 and ``false`` in GLES3.
fr: Si votre jeu doit utiliser à la fois GLES2 et GLES3, vous pouvez utiliser une vérification avec l'instruction ``if`` et voir si la sortie est en sRGB, en utilisant ``OUTPUT_IS_SRGB``. ``OUTPUT_IS_SRGB`` est ``true`` dans GLES2 et ``false`` dans GLES3.
ja: ゲームでGLES2とGLES3の両方を使用する場合、\ ``if`` ステートメントチェックと ``OUTPUT_IS_SRGB`` を使用して出力がsRGBであるかどうかを確認できます。\ ``OUTPUT_IS_SRGB`` はGLES2では ``true`` で、GLES3では ``false`` です。

source: GLES2 is not capable of using High Dynamic Range (HDR) rendering features. If HDR is set for your project, or for a given viewport, Godot will still user Low Dynamic Range (LDR) which limits viewport values to the ``0-1`` range.
fr: GLES2 n'est pas capable d'utiliser les fonctions de rendu de High Dynamic Range (HDR). Si le HDR est défini pour votre projet, ou pour une fenêtre donnée, Godot utilisera toujours le Low Dynamic Range (LDR) qui limite les valeurs de la fenêtre à la plage ``0-1``.

source: SpatialMaterial features
fr: Fonctionnalités SpatialMaterial
ja: SpatialMaterialの機能

source: In GLES2, the following advanced rendering features in the :ref:`SpatialMaterial <class_SpatialMaterial>` are missing:
fr: Dans GLES2, les fonctionnalités de rendu avancées suivantes de :ref:`SpatialMaterial <class_SpatialMaterial>` sont manquantes :
ja: GLES2では、\ :ref:`SpatialMaterial <class_SpatialMaterial>` の次の高度なレンダリング機能がありません:

source: Refraction
fr: Réfraction
ja: Refraction(屈折)

source: Subsurface scattering
fr: Diffusion sous la surface
ja: サブサーフェススキャタリング

source: Anisotropy
fr: Anisotropie
ja: Anisotropy(異方性)

source: Clearcoat
fr: Vernis transparent
ja: Clearcoat(クリアコート)

source: Depth mapping
fr: Cartographie de la profondeur
ja: 深度マッピング

source: When using SpatialMaterials they will not even appear in the editor.
fr: Lorsque vous utilisez SpatialMaterials, ils n'apparaissent même pas dans l'éditeur.
ja: SpatialMaterialsを使用する場合、エディタには表示されません。

source: In custom :ref:`ShaderMaterials <class_ShaderMaterial>`, you can set values for these features but they will be non-functional. For example, you will still be able to set the ``SSS`` built-in (which normally adds subsurface scattering) in your shader, but nothing will happen.
fr: Dans les :ref:`ShaderMaterials <class_ShaderMaterial>` personnalisés, vous pouvez définir des valeurs pour ces fonctionnalités mais elles seront non fonctionnelles. Par exemple, vous pourrez toujours définir le ``SSS`` intégré (qui ajoute normalement la diffusion sous la surface) dans votre shader, mais rien ne se passera.
ja: カスタム :ref:`ShaderMaterials <class_ShaderMaterial>` では、これらの機能の値を設定できますが、機能はしません。たとえば、シェーダーで ``SSS`` ビルトイン(通常はサブサーフェス スキャタリングを追加)を設定することはできますが、何も起こりません。

source: Environment features
fr: Fonctionnalités de l’environnement
ja: 環境機能

source: In GLES2, the following features in the :ref:`Environment <class_Environment>` are missing:
fr: Dans GLES2, les fonctionnalités suivantes dans le :ref:`Environnement <class_Environment>` manquent :
ja: GLES2では、\ :ref:`Environment <class_Environment>` に次の機能がありません:

source: Auto exposure
fr: Exposition automatique
ja: 自動露出

source: Screen space ambient occlusion
fr: Occlusion de l'espace ambiant de l'écran
ja: スクリーンスペースアンビエントオクルージョン

source: That means that in GLES2 environments you can only set:
fr: Cela signifie que dans les environnements GLES2, vous ne pouvez que régler :
ja: つまり、GLES2の環境では次の設定のみが可能です:

source: Sky (including procedural sky)
fr: Sky(ciel) (y compris le sky(ciel) de procédure)
ja: 空(手続き型の空を含む)

source: Ambient light
fr: Lumière ambiante
ja: 環境光

source: Fog
fr: Brouillard
ja: Fog(霧)

source: Depth of field
fr: Profondeur de champ
ja: 被写界深度

source: Glow (also known as bloom)
fr: Glow (aussi appelée bloom)
ja: グロー(ブルームとも呼ばれます)

source: Adjustment
fr: Ajustement
ja: 調整

source: :ref:`GIProbes <class_GIProbe>` do not work in GLES2. Instead use :ref:`Baked Lightmaps <class_BakedLightmap>`. For a description of how baked lightmaps work see the :ref:`Baked Lightmaps tutorial <doc_baked_lightmaps>`.
fr: :ref:`GIProbes <class_GIProbe>` ne fonctionne pas dans GLES2. Utilisez plutôt :ref:`Baked Lightmaps <class_BakedLightmap>`. Pour une description du fonctionnement des baked lightmaps, voir le tutoriel :ref:`Baked Lightmaps <doc_baked_lightmaps>`.
ja: :ref:`GIProbes <class_GIProbe>` はGLES2では機能しません。代わりに、\ :ref:`Baked Lightmaps <class_BakedLightmap>` を使用します。ベイク処理されたライトマップの機能の説明については、\ :ref:`Baked Lightmaps tutorial <doc_baked_lightmaps>` を参照してください。

source: Contact shadows
fr: Ombres de contact
ja: コンタクトシャドウ

source: The ``shadow_contact`` property of :ref:`Lights <class_Light>` is not supported in GLES2 and so does nothing.
fr: La propriété ``shadow_contact`` de :ref:`Lights <class_Light>` n'est pas supportée dans GLES2 et ne fait donc rien.
ja: :ref:`Lights <class_Light>` の ``shadow_contact`` プロパティはGLES2ではサポートされていないため、何もしません。

source: Light performance
fr: Performance de la lumière
ja: ライトの性能

source: In GLES2, performance scales poorly with several lights, as each light is processed in a separate render pass (in opposition to GLES3 which is all done in a single pass). Try to limit scenes to as few lights as possible in order to achieve greatest performance.
fr: Dans GLES2, les performances évoluent mal avec plusieurs lumières, car chaque lumière est traitée dans une passe de rendu distincte (contrairement à GLES3 qui le fait en une seule passe). Essayez de limiter les scènes à un minimum de lumières afin d'obtenir les meilleures performances.
ja: GLES2では、各ライトが個別のレンダーパスで処理されるため、GLES2では(1回のパスで行われるGLES3に対して)ライトの増加に伴いパフォーマンスが低下します。最高のパフォーマンスを実現するために、シーンをできるだけ少ないライトに制限してください。

source: Texture compression
fr: Compression de texture
ja: テクスチャ圧縮

source: On mobile, GLES2 requires ETC texture compression, while GLES3 requires ETC2. ETC2 is enabled by default, so if exporting to mobile using GLES2 make sure to set the project setting ``rendering/vram_compression/import_etc`` and then reimport textures.
fr: Sur les mobiles, GLES2 nécessite une compression de texture ETC, tandis que GLES3 nécessite ETC2. ETC2 est activé par défaut, donc si vous exportez vers mobile en utilisant GLES2, assurez-vous de définir le paramètre de projet ``rendering/vram_compression/import_etc`` et ensuite réimportez les textures.
ja: モバイルでは、GLES2にはETCテクスチャ圧縮が必要ですが、GLES3にはETC2が必要です。 ETC2はデフォルトで有効になっているため、GLES2を使用してモバイルにエクスポートする場合は、プロジェクト設定 ``rendering/vram_compression/import_etc`` を設定してからテクスチャを再インポートしてください。

source: Since ETC doesn't support transparency, you must reimport textures that contain an alpha channel to use the Uncompressed, Lossy or Lossless compression mode (instead of Video RAM). This can be done in the Import dock after selecting them in the FileSystem dock.
fr: Comme le CTE ne prend pas en charge la transparence, vous devez réimporter les textures qui contiennent un canal alpha pour utiliser le mode de compression Uncompressed, Lossy ou Lossless (au lieu de Video RAM). Cela peut être fait dans le dock d'importation après les avoir sélectionnées dans le dock du système de fichiers.
ja: ETCは透明度をサポートしていないため、アルファチャネルを含むテクスチャを再インポートして、(ビデオRAMの代わりに)非圧縮、非可逆、または可逆圧縮モードを使用する必要があります。これは、ファイルシステムドックでそれらを選択した後、インポートドックで実行できます。

source: Blend shapes
fr: Mélange de formes
ja: 形状のブレンド

source: Blend shapes are not supported in GLES2.
fr: Le mélange de formes(Blend shapes) n'est pas pris en charge dans le GLES2.
ja: ブレンドシェイプはGLES2ではサポートされていません。

source: Shading language
fr: Langue de shading
ja: シェーディング言語

source: GLES3 provides many built-in functions that GLES2 does not. Below is a list of functions that are not available or are have limited support in GLES2.
fr: GLES3 offre de nombreuses fonctions intégrées que GLES2 n'offre pas. Voici une liste des fonctions qui ne sont pas disponibles ou qui ont un support limité dans GLES2.
ja: GLES3は、GLES2にはない多くの組み込み関数を提供します。以下は、GLES2で使用できない機能またはサポートが制限されている機能のリストです。

source: For a complete list of built-in GLSL functions see the :ref:`Shading Language doc <doc_shading_language>`.
fr: Pour une liste complète des fonctions GLSL intégrées, voir le document :ref:`Shading Language doc <doc_shading_language>`.
ja: 組み込みGLSL関数の完全なリストについては、\ :ref:`Shading Language doc <doc_shading_language>` を参照してください。

source: Function
fr: Fonction
ja: 関数

source: See workaround below
fr: Voir la solution de contournement ci-dessous
ja: 以下の回避策を参照してください

source: **bias** not available in vertex shader
fr: **bias** non disponibles dans le shader de vertex
ja: **bias** は頂点シェーダーでは使用できません

source: Only available in vertex shader on some hardware
fr: Uniquement disponible dans le shader de vertex sur certains hardware
ja: 一部のハードウェアの頂点シェーダーでのみ使用可能

source: Functions not in GLES2's GLSL were added with Godots own shader standard library. These functions may perform worse in GLES2 compared to GLES3.
fr: Les fonctions qui ne sont pas dans le GLES2 ont été ajoutées avec la bibliothèque standard de shaders de Godots. Ces fonctions peuvent être moins performantes dans GLES2 par rapport à GLES3.
ja: GLES2のGLSLにない関数は、Godot独自のシェーダー標準ライブラリで追加されました。これらの関数は、GLES3と比較してGLES2ではパフォーマンスが低下する可能性があります。

source: ``textureSize()`` workaround
fr: Solution de contournement pour ``textureSize()``
ja: ``textureSize()`` 回避策

source: GLES2 does not support ``textureSize()``. You can get the size of a texture the old fashioned way by passing in a uniform with the texture size yourself.
fr: GLES2 ne supporte pas ``textureSize()``. Vous pouvez obtenir la taille d'une texture à l'ancienne en passant une variable uniform avec la taille de la texture vous-même.
ja: GLES2は ``textureSize()`` をサポートしていません。テクスチャサイズのユニフォームを自分で渡すことで、古い方法でテクスチャのサイズを取得できます。

source: Built in variables and render modes
fr: Variables intégrées et modes de rendu
ja: 組み込み変数とレンダリングモード

source: Godot also provides many built-in variables and render modes. Some cannot be supported in GLES2. Below is a list of built-in variables and render modes that, when written to, will have no effect or could even cause issues when using the GLES2 backend.
fr: Godot fournit également de nombreuses variables intégrées et modes de rendu. Certains ne sont pas pris en charge dans GLES2. Vous trouverez ci-dessous une liste des variables intégrées et des modes de rendu qui, lorsqu'ils sont écrits, n'auront aucun effet ou pourraient même causer des problèmes lors de l'utilisation du backend GLES2.
ja: Godotは、多くの組み込み変数とレンダリングモードも提供します。 GLES2でサポートできないものもあります。以下は、ビルトイン変数とレンダリングモードのリストです。これらは、書き込まれたときに効果がなかったり、GLES2バックエンドの使用時に問題が発生したりする可能性さえあります。

source: Variable / Render Mode
fr: Mode de rendu / variable
ja: 変数/レンダリング モード

source: Tonemapping
ja: トーンマッピング

source: Screen space reflections
ja: スクリーンスペースリフレクション
