Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/misc/pausing_games.po
Languages: ru, zh_cn

source: Pausing games
ru: Пауза в играх
zh_cn: 暂停游戏

source: Pause?
ru: Пауза?
zh_cn: 暂停？

source: In most games it is desirable to, at some point, interrupt the game to do something else, such as taking a break or changing options. However this is not as simple as it seems. The game might be stopped, but it might be desirable that some menus and animations continue working.
ru: В большинстве игр желательно, прерывать игру в определённой точке, чтобы сделать что-нибудь ещё, к примеру перерыв или изменение настроек. Хотя это не так просто как кажется. Игра может быть остановлена, но при этом некоторые меню и анимации должны продолжать работать.
zh_cn: 在大多数游戏中，希望在某些时候中断游戏以做其他事情，例如休息或改变选项。 然而，这并不像看起来那么简单。 游戏可能会停止，但可能需要一些菜单和动画继续工作。

source: Implementing a fine-grained control for what can be paused (and what can not) is a lot of work, so a simple framework for pausing is provided in Godot.
ru: Внедрение филигранного контроля на то что может быть приостановлено (а что не может) это куча работы, так что в Godot встроен простой фреймворк для пауз.
zh_cn: 对可暂停(以及不可暂停)的内容实现细节控制需要大量工作，因此Godot提供了一个简单的暂停框架。

source: How pausing works
ru: Как работает пауза
zh_cn: 如何暂停工作

source: To set pause mode, the pause state must be set. This is done by assigning ``true`` to the :ref:`SceneTree.paused <class_SceneTree_property_paused>` property:
ru: Чтобы установить режим паузы, нужно установить состояние паузы. Это можно сделать присвоив ``true`` свойству :ref:`SceneTree.paused <class_SceneTree_property_paused>`:
zh_cn: 要设置暂停模式，必须设置暂停状态。 这是通过为 :参考:`场景树.暂停<类_场景树_属性_暂停>` 成员变量赋予“真”值来完成的:

source: Doing so will have the following behavior:
ru: Это приведёт к тому что:
zh_cn: 这样做会产生以下行为:

source: 2D and 3D physics will be stopped.
ru: 2D и 3D физика остановятся.
zh_cn: 2D和3D物理将被停止。

source: ``_process`` and ``_physics_process`` will not be called anymore in nodes.
zh_cn: 将不再在节点中调用“_处理”和“_物理_处理”函数。

source: ``_input`` and ``_input_event`` will not be called anymore either.
ru: ``_input`` и``_input_event`` также не будут вызываться.
zh_cn: “_输入”和“_输入_事件”也不再被调用。

source: This effectively stops the whole game. Calling this function from a script, by default, will result in an unrecoverable state (nothing will work anymore!).
ru: Это эффективно останавливает целую игру. Вызов этой функции из скрипта, по умолчанию, приведёт неисправимому состоянию (ничего не будет работать!).
zh_cn: 这有效地阻止了整个游戏。 默认情况下，从脚本调用此函数将导致不可恢复的状态(游戏永久暂停！)。

source: White-listing nodes
ru: Белый список нодов
zh_cn: 白名单节点

source: Before enabling pause, make sure that nodes that must keep working during pause are white-listed. This is done by editing the "Pause Mode" property in a node:
ru: Прежде чем делать паузу, убедитесь что ноды которые должны работать во время паузы занесены в белый список. Это выполняется через редактирование свойства "Pause Mode" в ноде:
zh_cn: 在启用暂停之前，请确保在暂停期间必须继续工作的节点已列入白名单。 这是通过编辑节点中的“暂停模式”属性来完成的:

source: By default all nodes have this property in the "Inherit" state. This means, that they will only process (or not) depending on what this same property is set on the parent node. If the parent is set to "Inherit" , then the grandparent will be checked and so on. Ultimately, if a state can't be found in any of the grandparents, the pause state in SceneTree is used. This means that, by default, when the game is paused every node will be paused.
ru: По умолчанию во всех нодах это свойство установлено в состояние "Inherit". Это означает, что они будут обрабатываться (или нет) в зависимости от установки данного свойства в родительской ноде. Если в родителе установлено "Inherit", то родитель данного родителя будет проверяться и так далее. В конечном итоге, если состояние не было найдено не в одном из родителей, будет использовано состояние SceneTree/ Это означает, что по умолчанию, когда игра ставится на паузу каждая нода будет остановлена.
zh_cn: 默认情况下，所有节点的此属性都是“继承”状态。 这意味着，它们只会处理(或不处理)，具体取决于父节点上设置的相同属性。 如果父项设置为“继承”，则将检查祖父项，依此类推。 最终，如果在任何祖父中找不到状态，则使用SceneTree中的暂停状态。 这意味着，默认情况下，当游戏暂停时，每个节点都将暂停。

source: So the three possible states for a node are:
ru: Существует три возможных состояния для ноды:
zh_cn: 节点的三种可能状态有:

source: **Inherit**: Process depending on the state of the parent, grandparent, etc. The first parent that has a non-Inherit state.
ru: **Inherit**: Процесс зависит от состояния родителя, родителя-родителя, итд. Т.е первый родитель который будет иметь не-Inherit состояние.
zh_cn: **继承** : 进程取决于父，祖父节点等的状态。具有非继承状态的第一个父节点。

source: **Stop**: Stop the node no matter what (and children in Inherit mode). When paused this node will not process.
ru: **Stop**: Останавливает ноду в любом случае (и потомков в состоянии Inherit). Когда пауза происходит эта нода не будет обрабатываться.
zh_cn: **停止** : 无论什么情况下，停止节点(以及继承模式下的子节点)。 当暂停时，此节点将不会被放入进程。

source: **Process**: Process the node no matter what (and children in Inherit mode). Paused or not this node will process.
ru: **Process**: Обрабатывать эту ноду в любом случае (и потомков в состоянии Inherit). Вне зависимости от паузы эта нода будет обрабатываться.
zh_cn: **进程** : 无论什么情况下, 处理节点(以及继承模式下的子节点)。 无论暂停或不暂停, 此节点仍会在进程中。

source: Example
zh_cn: 示例

source: An example of this is creating a popup or panel with controls inside, and set its pause mode to "Process" then hide it:
ru: Например создадим поп-ап или панель с элементами управления внутри, установим режим паузы в "Process" а затем скроем её:
zh_cn: 一个示例是创建一个带有控件的弹出窗口或面板，并将其暂停模式设置为“进程”然后隐藏它:

source: Just by setting the root of the pause popup to "Process", all children and grandchildren will inherit that state. This way, this branch of the scene tree will continue working when paused.
ru: Просто установив корень всплывающего окна в "Process", все потомки и потомки потомков будут наследовать это состояние. Таким образом, эта часть дерева сцены продолжит работу во время паузы.
zh_cn: 只需设置暂停弹出窗口的根节点项为“进程”，所有子孙都将继承该状态。 这样，场景树的这个分支将在暂停时继续工作。

source: Finally, make it so when a pause button is pressed (any button will do), enable the pause and show the pause screen.
ru: Наконец, сделайте так чтобы нажатая кнопка паузы (любая кнопка подойдёт), включала паузу и показывала экран паузы.
zh_cn: 最后，当按下暂停按钮(任何按钮都可以)时，启用暂停并显示暂停屏幕。

source: To remove the pause, do the opposite when the pause screen is closed:
ru: Для отключения паузы, сделайте обратное когда экран паузы закрывается:
zh_cn: 要删除暂停，请在暂停屏幕关闭时执行相反操作:

source: And that should be all!
ru: Вот и всё!
zh_cn: 就是这样，喵！

source: ``_process and ``_physics_process`` will not be called anymore in nodes.
ru: ``_process и ``_physics_process`` не будут вызываться в нодах.
