Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/misc/running_code_*_the_editor.po
Languages: fr, ru, zh_cn

source: Running code in the editor
fr: Exécuter le code dans l'éditeur
ru: Запуск кода в редакторе
zh_cn: 在编辑器中运行代码

source: What is ``tool``?
fr: Que signifie ``tool`` ?
ru: Что такое ``tool``?
zh_cn: ``tool`` 是什么？

source: ``tool`` is a powerful line of code that, when added at the top of your script, makes it execute in the editor. You can also decide which parts of the script execute in the editor, which in game, and which in both.
fr: ``tool`` est une puissante ligne de code qui, lorsqu'elle est ajoutée en haut de votre script, lui permet de s'exécuter dans l'éditeur. Vous pouvez également définir quelles parties du script s'exécutent dans l'éditeur, dans le jeu, ou les deux.
ru: ``tool`` это мощная строка кода, которая будучи добавлена на верх вашего скрипта, делает его выполняемым в редакторе. Вы также можете определить какие части скрипта будут выполняться в редакторе, какие в игре, а какие и там и там.
zh_cn: ``tool`` 是一个强大的代码行,当添加到脚本的顶部时,它会在编辑器中执行. 您还可以决定脚本的哪些部分在编辑器中执行,哪部分在游戏中执行,以及哪部分在两者中均执行.

source: You can use it for doing many things, but it is mostly useful in level design for visually presenting things that are hard to predict ourselves. Here are some use cases:
fr: Vous pouvez l'utiliser pour faire beaucoup de choses, mais c'est surtout utile dans la conception de niveaux pour représenter visuellement des choses qui sont difficiles à prévoir nous-mêmes. Voici quelques cas d'utilisation :
ru: Вы можете использовать её для достижения многих вещей, но это наиболее полезно для дизайна уровней и визуальных представлений вещей которые сложно предсказать. Здесь показаны некоторые примеры использования:
zh_cn: 您可以使用它来做很多事情,它在层次设计中非常有用,可以直观地呈现难以预测的事物. 以下是一些用例:

source: If you have a cannon that shoots cannonballs affected by physics (gravity), you can draw the cannonball's trajectory in the editor, making level design a lot easier.
fr: Si vous avez un canon qui tire des boulets de canon affectés par la physique (gravité), vous pouvez dessiner la trajectoire du boulet de canon dans l'éditeur, ce qui facilite grandement la conception des niveaux.
zh_cn: 如果你有一门发射受物理学(重力)影响的炮弹的大炮,你可以在编辑器中画出炮弹的轨迹,使关卡设计容易得多.

source: If you have jumppads with varying jump heights, you can draw the maximum jump height a player would reach if it jumped on one, also making level design easier.
fr: Si vous avez des tremplins avec différentes hauteurs de saut, vous pouvez dessiner la hauteur maximum que le joueur atteindrait s'il sautait sur l'un d'eux, facilitant encore une fois la conception du niveau.
ru: Если у вас есть прыжковые платформы с различными высотами прыжка, для каждой из них вы сможете нарисовать максимальную высоту на которую игрок может подпрыгнуть, что также делает дизайн уровней лёгким.
zh_cn: 如果您有不同跳跃高度的跳线,您可以绘制游戏角色能跳过的最大跳跃高度,也可以让关卡设计变得更容易.

source: If your player doesn't use a sprite, but draws itself using code, you can make that drawing code execute in the editor to see your player.
fr: Si votre personnage n'utilise pas de sprite mais se dessine lui même depuis le code, vous pouvez faire en sorte que ce code de dessin s'exécute dans l'éditeur, vous permettant ainsi de voir votre joueur.
ru: Если ваш игрок не использует спрайт, но рисует его из кода, вы можете сделать эту отрисовку выполняемой в редакторе так что вы увидите вашего игрока.
zh_cn: 如果您的游戏角色不使用精灵,却使用代码来绘制,您可以在编辑器中执行该绘图代码以查看您的游戏角色.

source: ``tool`` scripts run inside the editor, and let you access the scene tree of the currently edited scene. This is a powerful feature which also comes with caveats, as the editor does not include protections for potential misuse of ``tool`` scripts. Be **extremely** cautious when manipulating the scene tree, especially via :ref:`Node.queue_free<class_Node_method_queue_free>`, as it can cause crashes if you free a node while the editor runs logic involving it.
fr: Les scripts ``tool`` s'exécutent à l'intérieur de l'éditeur, et vous permettent d'accéder à l'arbre de la scène en cours d'édition. Il s'agit d'une fonctionnalité puissante qui s'accompagne également de mises en garde, car l'éditeur n'inclut pas de protections contre les mauvaises utilisations des scripts ``tool``. Soyez **extrêmement** prudent lorsque vous manipulez l'arbre de la scène, en particulier en utilisant :ref:`Node.queue_free<class_Node_method_queue_free>` car cela peut causer des plantages si vous libérez un nœud pendant que l'éditeur exécute une logique l'impliquant.
zh_cn: ``tool`` 脚本在编辑器内运行,让你访问当前编辑的场景树.这是一个强大的功能,但也有一些注意事项,因为编辑器不包括对 ``tool`` 脚本潜在滥用的保护.在操作场景树时,尤其是通过 :ref:`Node.queue_free<class_Node_method_queue_free>` 时,要 **极其** 谨慎,因为如果你在编辑器运行涉及到节点的逻辑时释放该节点,可能会导致崩溃.

source: How to use it
fr: Comment l'utiliser
ru: Как использовать это
zh_cn: 如何使用它

source: To turn a script into a tool, add the keyword ``tool`` at the top of your code.
fr: Pour transformer un script en outil, ajoutez le mot-clé ``tool`` en haut de votre code.
zh_cn: 要把一个脚本变成一个工具,在你的代码顶部添加关键字 ``tool`` .

source: To check if you are currently in the editor, use: ``Engine.editor_hint``.
fr: Pour vérifier si vous êtes actuellement dans l'éditeur, utilisez : ``Engine.editor_hint``.
ru: Для проверки что вы находитесь в редакторе, используйте ``Engine.editor_hint``.
zh_cn: 要检查您当前是否在编辑器中,请使用 : ``Engine.editor_hint``.

source: For example, if you want to execute some code only in the editor, use:
fr: Par exemple, si vous souhaitez exécuter du code uniquement dans l'éditeur, utilisez :
zh_cn: 例如,如果你想只在编辑器中执行一些代码,可以使用:

source: On the other hand, if you want to execute code only in game, simply negate the same statement:
fr: En revanche, si vous voulez exécuter du code uniquement dans le jeu, il suffit d'utiliser la négation de l'expression précédente :
zh_cn: 另一方面,如果你想只在游戏中执行代码,只需否定相同的语句:

source: Pieces of code do not have either of the 2 conditions above will run both in-editor and in-game.
fr: Les morceaux de code qui n'utilisent aucune des 2 conditions ci-dessus seront exécutés à la fois dans l'éditeur et dans le jeu.
zh_cn: 不具备上述两个条件之一的代码片断将在编辑器和游戏中运行.

source: Here is how a ``_process()`` function might look for you:
fr: Voici à quoi une fonction ``_process()`` pourrait ressembler pour vous :
zh_cn: 以下是 ``_process()`` 函数的示例:

source: Modifications in editor are permanent. For example, in the following case, when we remove the script, the node will keep its rotation. Be careful to avoid making unwanted modifications.
fr: Les modifications dans l'éditeur sont permanentes. Dans notre cas, lorsque nous supprimons le script, le nœud conserve sa rotation. Faites attention à ne pas faire de modifications non souhaitées.
zh_cn: 编辑器中的修改是永久性的.例如,在下面的情况下,当我们删除脚本时,节点将保持其旋转.要注意避免做不需要的修改.

source: Try it out
fr: Testez-le
ru: Попробуйте
zh_cn: 试试看

source: Add a ``Sprite`` node to your scene and set the texture to Godot icon. Attach and open a script, and change it to this:
fr: Ajoutez un nœud ``Sprite`` à votre scène et donnez lui la texture de l'icône Godot. Attachez-lui un script, ouvrez-le, et changez-le en ceci :
ru: Добавьте нод ``Sprite`` на вашу сцену и установить текстуру на иконку Godot. Присоедините и откройте скрипт, и измените его на это:
zh_cn: 在场景中添加一个 ``Sprite`` 节点,并将纹理设置为Godot图标. 添加并打开脚本,并将其更改为:

source: Save the script and return to the editor. You should now see your object rotate. If you run the game, it will also rotate.
fr: Sauvegardez le script et revenez à l'éditeur. Vous devriez maintenant voir votre objet tourner. Si vous lancez le jeu, il tournera également.
ru: Сохраните скрипт и вернитесь в редактор. Вы должны увидеть как ваш объект вращается. Если вы запустите игру, он также будет вращаться.
zh_cn: 保存脚本并返回编辑器. 现在您应该看到您的对象在旋转. 如果您运行游戏,它也会旋转.

source: If you don't see the changes, reload the scene (close it and open it again).
fr: Si vous ne voyez pas les modifications, rechargez la scène (fermez-la et ouvrez-la à nouveau).
ru: Если вы не увидели изменений, перезагрузите сцену (закройте и откройте снова).
zh_cn: 如果您没有看到变化,请重新加载场景(关闭它并再次打开).

source: Now let's choose which code runs when. Modify your ``_process()`` function to look like this:
fr: Choisissons maintenant quel code fonctionne à quel moment. Modifiez votre fonction ``_process()`` pour qu'elle ressemble à ceci :
ru: Теперь давайте выберем когда и какой код запустится. Измените функцию ``_process()`` чтобы она выглядела вот так:
zh_cn: 现在让我们选择何时运行代码. 将 ``_process()`` 函数修改为:

source: Save the script. Now the object will spin clockwise in the editor, but if you run the game, it will spin counter-clockwise.
fr: Sauvegardez le script. Maintenant, l'objet tournera dans le sens horaire dans l'éditeur, mais si vous exécutez le jeu, il tournera dans le sens antihoraire.
ru: Сохраните скрипт. Теперь объект будет вращаться по часовой стрелке в редакторе, но если вы запустите игру он будет вращаться против часовой стрелки.
zh_cn: 保存脚本. 现在,对象将在编辑器中顺时针旋转,但如果您运行游戏,它将逆时针旋转.

source: Editing variables
fr: Édition des variables
zh_cn: 编辑变量

source: Add and export a variable speed to the script. The function set_speed after "setget" is executed with your input to change the variable. Modify ``_process()`` to include the rotation speed.
fr: Ajouter et exporter une vitesse variable au script. La fonction set_speed après "setget" est exécutée avec votre entrée pour modifier la variable. Modifiez ``_process()`` pour inclure la vitesse de rotation.
zh_cn: 在脚本中添加并导出一个变量速度.在 "setget" 之后的函数set_speed与你的输入一起执行,以改变这个变量.修改 ``_process()`` 以包含旋转速度.

source: Code from other nodes doesn't run in the editor. Your access to other nodes is limited. You can access the tree and nodes, and their default properties, but you can't access user variables. If you want to do so, other nodes have to run in the editor too. AutoLoad nodes cannot be accessed in the editor at all.
fr: Le code des autres nœuds ne s'exécute pas dans l'éditeur. Votre accès aux autres nœuds est limité. Vous pouvez accéder à l'arbre et aux nœuds, ainsi qu'à leurs propriétés par défaut, mais vous ne pouvez pas accéder aux variables définies par l'utilisateur. Si vous voulez le faire, les autres nœuds doivent également s'exécuter dans l'éditeur. Les nœuds chargés automatiquement (Autoload) ne sont pas du tout accessibles dans l'éditeur.
ru: Код из других нодов не запускается в редакторе. Ваш доступ к другим нодам ограничен. Вы можете получить доступ к древу и нодам, и их свойствам по умолчанию, но вы не можете получить доступ к переменным пользователя. Если вы хотите сделать это, другие ноды должны также запустится в редакторе. AutoLoad ноды не могут быть доступны из редактора вообще.
zh_cn: 其他节点的代码不会在编辑器中运行. 您对其他节点的访问权限被限制了. 您可以访问树和节点及其默认属性,但无法访问用户变量. 如果要这样做,其他节点也必须在编辑器中运行. AutoLoad节点时无法在编辑器中访问的.

source: Instancing scenes
fr: Instancier des scènes
ru: Инстанцирование сцен
zh_cn: 实例化场景

source: You can instantiate packed scenes normally and add them to the scene currently opened in the editor. Be sure to set the scene root as the owner of all the nodes created this way or the nodes won't be visible in the editor.
fr: Vous pouvez instancier des scènes emballées normalement et les ajouter à la scène actuellement ouverte dans l'éditeur. Assurez-vous de définir la racine de la scène comme étant le propriétaire de tous les nœuds créés de cette manière, sinon les nœuds ne seront pas visibles dans l'éditeur.
zh_cn: 你可以正常实例化打包的场景,并将它们添加到编辑器中当前打开的场景中.一定要将场景根节点设置为所有以这种方式创建的节点的所有者,否则这些节点在编辑器中就不可见.

source: If you are using ``tool``:
fr: Si vous utilisez un ``tool`` :
zh_cn: 如果你使用的是 ``tool`` :

source: If you are using :ref:`EditorScript<class_EditorScript>`:
fr: Si vous utilisez :ref:`EditorScript<class_EditorScript>` :
zh_cn: 如果你使用 :ref:`EditorScript<class_EditorScript>` :

source: Using ``tool`` improperly can yield many errors. It is advised to first write the code how you want it, and only then add the ``tool`` keyword to the top. Also, make sure to separate code that runs in-editor from code that runs in-game. This way, you can find bugs more easily.
fr: L'utilisation inappropriée de ``tool`` peut entraîner de nombreuses erreurs. Il est conseillé d'écrire d'abord le code comme vous le souhaitez, et seulement ensuite d'ajouter le mot-clé ``tool`` en haut. Veillez également à diviser votre code en une partie qui fonctionne dans l'éditeur et une partie qui s'exécute dans le jeu. De cette manières, vous pourrez trouver les bogues plus facilement.
zh_cn: 不适当地使用 ``tool`` 会产生许多错误.建议首先按照你想要的方式写代码,然后才在上面添加 ``tool`` 关键字.另外,要确保把在编辑器中运行的代码和在游戏中运行的代码分开.这样,你可以更容易地发现错误.

source: If you have a cannon that shoots cannonballs affected by physics (gravity), you can draw cannonball's trajectory in the editor, making level design a lot easier.
ru: Если у вас есть пушка которая стреляет ядрами которые взаимодействуют с физикой (гравитацией), вы может рисовать траекторию ядер в редактор, делая дизайн уровней намного проще.

source: To turn a script into a tool, add ``tool`` keyword at the top of your code.
ru: Чтобы сделать ваш скрипт исполняемым, поместите ключевое слово ``tool`` в самый верх вашего кода.

source: For example, if you want to execute some code only in editor, use:
ru: Например, если вы хотите исполнять некоторый код только в редакторе, используйте:

source: On the other hand, if you want to execute code only in game, simply negate previous expression:
ru: С другой стороны, если вы хотите исполнять код только в игре, просто инвертируйте предыдущее выражение:

source: Pieces of code that are not having any of the 2 conditions above will run both in editor and in game.
ru: Части кода которые не будут иметь ни одного из 2 условий запустятся и в редакторе и в игре.

source: Here is how a ``_process()`` function might look like for you:
ru: Здесь показано как может выглядеть функция ``_process()``:

source: Modifications in editor are permanent. In our case, when we remove the script, the node will keep its rotation direction. Be careful so that you don't make unwanted modifications.
ru: Изменения в редакторе постоянны. Другими словами, когда вы удаляете скрипт, ваш нод будет сохранять направление вращения. Будьте осторожны чтобы не сделать нежелательных изменений.

source: Using ``tool`` improperly can yield many errors. It is advised to first write the code how you want it, and only then add the ``tool`` keyword to the top. Also make sure you divide your code into part that runs in editor and part that runs in game. This way you can find your bug easier.
ru: Неправильное использование ``tool`` может привести к многим ошибкам. Рекомендуется вначале писать код так как вы хотите чтобы он работал, и лишь затем добавлять ``tool`` на верх. Также убедитесь какие части кода запускаются в редакторе, а какие в игре. Таким образом вы легче найдёте ошибки.
