Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/misc/state_design_pattern.po
Languages: fr, ja, pt_br, zh_cn

source: State design pattern
fr: Modèle de conception état
ja: ステート(状態)設計パターン
pt_br: Padrão de projeto State
zh_cn: 状态设计模式

source: Introduction
ja: はじめに
pt_br: Introdução
zh_cn: 简介

source: Scripting a game can be difficult when there are many states that need to handled, but only one script can be attached to a node at a time. Instead of creating a state machine within the player's control script, it would make development simpler if the states were separated out into different classes.
fr: Écrire les scripts d'un jeu peut être difficile lorsqu'il y a de nombreux états à gérer, mais un seul script peut être attaché à un nœud à la fois. Au lieu de créer une machine à états dans le script de contrôle du joueur, le développement serait plus simple si les états étaient séparés en différentes classes.
ja: 処理が必要な状態が多数ある場合、ゲームのスクリプトを作成するのは困難ですが、一度に1つのノードに接続できるスクリプトは1つだけです。プレイヤーの制御スクリプト内にステートマシンを作成する代わりに、ステートが異なるクラスに分けられていれば、開発が簡単になります。
pt_br: Escrever um jogo pode ser difícil quando há muitos estados que necessitam ser manipulados, mas apenas um script pode ser anexado a um nó por vez. Em vez de criar uma máquina de estados no script de controle do jogador, o desenvolvimento poderia ser simplificado se os estados forem separados em diferentes classes.
zh_cn: 当有许多状态需要处理, 但一次只能将一个脚本附加到一个节点上时, 编写游戏脚本是很困难的. 与其在玩家的控制脚本中创建一个状态机, 不如将状态分离出来, 分成不同的类, 这样会使开发更加简单.

source: There are many ways to implement a state machine with Godot, and some other methods are below:
fr: Il existe de nombreuses façons de mettre en place une machine à état avec Godot, et quelques autres méthodes sont présentées ci-dessous :
ja: Godotでステートマシンを実装する方法は多数ありますが、他にもいくつかの方法があります:
pt_br: Existem muitas formas de implementar uma máquina de estados com Godot, e alguns desses métodos estão logo abaixo:
zh_cn: 用Godot实现状态机的方法有很多, 下面是一些其他方法:

source: The player can have a child node for each state, which are called when utilized.
fr: Le joueur peut avoir un nœud enfant pour chaque état, qui sont appelés lorsqu'ils sont utilisés.
ja: プレイヤーは、ステートごとに子ノードを持つことができます。子ノードは、使用されるときに呼び出されます。
pt_br: O jogador pode ter um nó filho para cada estado, cujo são chamados quando utilizados.
zh_cn: 玩家的每一个状态都可以有一个子节点, 在使用时会被调用.

source: Enums can be used in conjunction with a match statement.
fr: Les énumérations peuvent être utilisées en conjonction avec une instruction match.
ja: 列挙型は、matchステートメントと組み合わせて使用できます。
pt_br: Os enums podem ser utilizados em conjunto com uma declaração de match.
zh_cn: Enums可以与匹配语句一起使用.

source: The state scripts themselves could be swapped out from a node dynamically at run-time.
fr: Les scripts d'état eux-mêmes peuvent être échangés dynamiquement à partir d'un nœud au moment de l'exécution.
ja: ステートスクリプト自体は、実行時にノードから動的に交換できます。
pt_br: Os próprios scripts de estado podem ser trocados de um nó dinamicamente em tempo de execução.
zh_cn: 状态脚本本身可以在运行时动态地从一个节点上换掉.

source: This tutorial will focus only on adding and removing nodes which have a state script attached. Each state script will be an implementation of a different state.
fr: Ce tutoriel se concentrera uniquement sur l'ajout et la suppression des nœuds auxquels un script d'état est attaché. Chaque script d'état sera une implémentation d'un état différent.
ja: このチュートリアルでは、ステートスクリプトがアタッチされているノードの追加と削除のみに焦点を当てます。各ステートスクリプトは、異なるステートの実装になります。
pt_br: Este tutorial se concentrará apenas em adicionar e remover nós que tem um script de estado anexado. Cada script de estado será uma implementação de um estado diferente.
zh_cn: 本教程将只专注于添加和删除附加有状态脚本的节点. 每个状态脚本将是不同状态的实现.

source: There is a great resource explaining the concept of the state design pattern here: https://gameprogrammingpatterns.com/state.html
fr: Il existe une excellente ressource expliquant le concept de modèle de conception état ici : https://gameprogrammingpatterns.com/state.html
ja: ここにステート設計パターンの概念を説明する素晴らしいリソースがあります (英語): https://gameprogrammingpatterns.com/state.html
pt_br: Há um ótimo recurso explicando o conceito do padrão de projeto State aqui: https://gameprogrammingpatterns.com/state.html
zh_cn: 这里有一个很好的资源来解释状态设计模式的概念 : https://gameprogrammingpatterns.com/state.html

source: Script setup
fr: Configuration du script
ja: スクリプトのセットアップ
zh_cn: 脚本设置

source: The feature of inheritance is useful for getting started with this design principle. A class should be created that describes the base features of the player. For now, a player will be limited to two actions: **move left**, **move right**. This means there will be two states: **idle** and **run**.
fr: La caractéristique de l'héritage est utile pour commencer à appliquer ce principe de conception. Une classe doit être créée qui décrit les caractéristiques de base du joueur. Pour l'instant, un joueur sera limité à deux actions : **move left**, **move right**. Cela signifie qu'il y aura deux états : **idle** et **run**.
ja: 継承の機能は、この設計原則を始めるのに役立ちます。プレイヤーの基本機能を記述するクラスを作成する必要があります。今のところ、プレイヤーは2つのアクションに制限されます: **左に移動**\ 、\ **右に移動**\ 。これは、\ **idle** と **run** の2つのステートがあることを意味します。
zh_cn: 继承的特性对于开始使用这个设计原则是很有用的. 应该创建一个类来描述玩家的基本功能. 现在, 一个玩家将被限制为两个动作. **向左移动** , **向右移动** . 这意味着将有两种状态. **闲置** 和 **运行** .

source: Below is the generic state, from which all other states will inherit.
fr: Voici l'état générique, dont tous les autres états hériteront.
ja: 以下は、他のすべてのステートが継承する一般的なステートです。
pt_br: Logo abaixo está o estado genérico, do qual todos outros estados herdarão.
zh_cn: 下面是通用状态, 所有其他状态都将从该状态继承.

source: A few notes on the above script. First, this implementation uses a ``setup(change_state, animated_sprite, persistent_state)`` method to assign references. These references will be instantiated in the parent of this state. This helps with something in programming known as *cohesion*. The state of the player does not want the responsibility of creating these variables, but does want to be able to use them. However, this does make the state *coupled* to the state's parent. This means that the state is highly reliant on whether it has a parent which contains these variables. So, remember that *coupling* and *cohesion* are important concepts when it comes to code management.
fr: Quelques notes sur le script ci-dessus. Premièrement, cette implémentation utilise une méthode ``setup(change_state, animated_sprite, persistent_state)`` pour assigner les références. Ces références seront instanciées dans le parent de cet état. Cela aide à quelque chose appelé en programmation *cohesion*. L'état du joueur ne veut pas avoir la responsabilité de créer ces variables, mais il veut pouvoir les utiliser. Cependant, cela rend l'état *couplé* au parent de l'état. Cela signifie que l'état dépend fortement du fait qu'il ait un parent qui contient ces variables. Donc, rappelez-vous que le *couplage* et la *cohésion* sont des concepts importants lorsqu'il s'agit de la gestion du code.
ja: 上記のスクリプトに関するいくつかの注意事項。まず、この実装は ``setup(change_state, animated_sprite, persistent_state)`` メソッドを使用して参照を割り当てます。これらの参照は、この状態の親でインスタンス化されます。これは、*凝集* として知られるプログラミングの考えに役立ちます。プレイヤーの状態は、これらの変数を作成する責任を負いませんが、これらを使用できるようにしたいと考えています。ただし、これにより、ステートはステートの親に *結合* されます。これは、ステートがこれらの変数を含む親を持っているかどうかに大きく依存していることを意味します。したがって、コード管理に関しては、\ *結合* と *凝集* が重要な概念であることを忘れないでください。
pt_br: Algumas notas do script acima. Primeiro, esta implementação usa um método ``setup(change_state, animated_sprite, persistent_state)`` para atribuir referências. Essas referências serão instanciadas no pai desse estado. Isso ajuda com algo na programação conhecido como *coesão*. O estado do jogador não deseja a responsabilidade de criar essas variáveis, mas deseja poder utilizá-las. No entanto, isso torna o estado *acoplado* ao pai do estado. Isso significa que o estado é altamente dependente de ter um pai que contenha essas variáveis. Portanto, lembre-se de que *acoplamento* e *coesão* são conceitos importantes quando se trata de gerenciamento de código.
zh_cn: 对上面的脚本做一些说明. 首先, 这个实现使用了一个``setup(change_state, animated_sprite, persistent_state)``方法来分配引用. 这些引用将在这个状态的父体中被实例化. 这有助于在编程中被称为*内聚的东西. 玩家的状态不希望承担创建这些变量的责任, 但确实希望能够使用它们. 然而, 这确实使状态与状态的父体*耦合. 这意味着, 状态高度依赖于它是否有一个包含这些变量的父体. 所以, 请记住, 当涉及到代码管理时,*耦合* 和 *内聚* 是重要的概念.

source: See the following page for more details on cohesion and coupling: https://courses.cs.washington.edu/courses/cse403/96sp/coupling-cohesion.html
fr: Voir la page suivante pour plus de détails sur la cohésion et le couplage : https://courses.cs.washington.edu/courses/cse403/96sp/coupling-cohesion.html
ja: 凝集と結合の詳細については、次のページを参照してください: https://courses.cs.washington.edu/courses/cse403/96sp/couple-cohesion.html
pt_br: Consulte a página a seguir para obter mais detalhes sobre coesão e acoplamento: https://courses.cs.washington.edu/courses/cse403/96sp/coupling-cohesion.html
zh_cn: 有关内聚力和耦合的更多详情, 请参见以下网页:https://courses.cs.washington.edu/courses/cse403/96sp/coupling-cohesion.html

source: Second, there are some methods in the script for moving, but no implementation. The state script just uses ``pass`` to show that it will not execute any instructions when the methods are called. This is important.
fr: Deuxièmement, le scénario prévoit certaines méthodes de déplacement, mais aucune implementation. Le script d'état utilise simplement ``pass`` pour montrer qu'il n'exécutera aucune instruction lorsque les méthodes sont appelées. Ceci est important.
ja: 2つ目は、スクリプトには移動のためのメソッドがいくつかありますが、実装はありません。ステートスクリプトは単に ``pass`` を使用して、メソッドが呼び出されたときに命令を実行しないことを示します。これは重要です。
zh_cn: 其次, 脚本中还有一些移动的方法, 但没有实现. 这一点很重要.

source: Third, the ``_physics_process(delta)`` method is actually implemented here. This allows the states to have a default ``_physics_process(delta)`` implementation where ``velocity`` is used to move the player. The way that the states can modify the movement of the player is to use the ``velocity`` variable defined in their base class.
fr: Troisièmement, la méthode ``physics_process(delta)`` est implémentée ici. Cela permet aux états d'avoir une implémentation par défaut de ``phyics_process(delta)`` où la ``velocity`` est utilisée pour déplacer le joueur. La façon dont les états peuvent modifier le mouvement du joueur est d'utiliser la variable ``velocity`` définie dans leur classe de base.
zh_cn: 第三, 这里实际上实现了 ``_physics_process(delta)`` 方法. 这使得状态可以有一个默认的 ``_physics_process(delta)`` 实现, 其中 ``velocity`` 用于移动玩家. 状态可以修改玩家移动的方法是使用定义在其基类中的 ``velocity`` 变量.

source: Finally, this script is actually being designated as a class named ``State``. This makes refactoring the code easier, since the file path from using the ``load()`` and ``preload()`` functions in Godot will not be needed.
zh_cn: 最后, 这个脚本实际上被指定为一个名为 ``State`` 的类. 这使得重构代码变得更容易, 因为在Godot中使用 ``load()`` 和 ``preload()`` 函数的文件路径将不再需要.

source: So, now that there is a base state, the two states discussed earlier can be implemented.
fr: Ainsi, maintenant qu'il existe un état de base, les deux états dont il a été question plus haut peuvent être mis en œuvre.
ja: そのため、基準ステートがあるので、前に説明した2つの状態を実装できます。
pt_br: Portanto, agora que existe um estado base, os dois estados discutidos anteriormente podem ser implementados.
zh_cn: 所以, 现在有了基础状态, 前面讨论的两种状态就可以实现了.

source: Since the ``Run`` and ``Idle`` states extend from ``State`` which extends ``Node2D``, the function ``_physics_process(delta)`` is called from the **bottom-up** meaning ``Run`` and ``Idle`` will call their implementation of ``_physics_process(delta)``, then ``State`` will call its implementation, then ``Node2D`` will call its own implementation and so on. This may seem strange, but it is only relevant for predefined functions such as ``_ready()``, ``_process(delta)``, etc. Custom functions use the normal inheritance rules of overriding the base implementation.
zh_cn: 由于 ``Run`` 和 ``Idle`` 状态是从 ``State`` 延伸出来的, 而 ``State`` 又是 ``Node2D`` 的延伸, 所以函数 ``_physics_process(delta)`` 是从 **底向上** 调用的, 也就是说 ``Run`` 和 ``Idle`` 将调用它们的实现 ``_physics_process(delta)`` . 然后 ``State`` 将调用它的实现, 然后 ``Node2D`` 将调用它自己的实现, 以此类推. 这可能看起来很奇怪, 但它只与预定义函数有关, 如 ``_ready()`` , ``_process(delta)`` 等. 自定义函数使用正常的继承规则, 即覆盖基础实现.

source: There is a roundabout method for obtaining a state instance. A state factory can be used.
zh_cn: 有一种迂回的方法可以获得一个状态实例. 可以使用状态工厂.

source: This will look for states in a dictionary and return the state if found.
fr: Cela recherchera les états dans un dictionnaire et retournera l'état s'il est trouvé.
ja: これにより、dictionary内のステートが検索され、見つかった場合はそのステートが返されます。
pt_br: Isso procurará por estados em um dicionário e retornará o estado, se encontrado.
zh_cn: 这将在字典中查找状态, 如果找到则返回状态.

source: Now that all the states are defined with their own scripts, it is time to figure out how those references that passed to them will be instantiated. Since these references will not change it makes sense to call this new script ``persistent_state.gd``.
fr: Maintenant que tous les états sont définis avec leurs propres scripts, il est temps de comprendre comment les références qui leur sont passées seront instanciées. Étant donné que ces références ne changeront pas, il est logique d'appeler ce nouveau script ``persistent_state.gd``.
ja: すべてのステートが独自のスクリプトで定義されたので、渡された参照がどのようにインスタンス化されるかを理解する時が来ました。これらの参照は変更されないため、この新しいスクリプト ``persistent_state.gd`` を呼び出すことは理にかなっています。
pt_br: Agora que todos os estados estão definidos com seus próprios scripts, é hora de descobrir como as referências que passaram para eles serão instanciadas. Como essas referências não mudam, faz sentido chamar esse novo script de ``persistent_state.gd``.
zh_cn: 现在, 所有的状态都用自己的脚本定义了, 现在是时候弄清楚如何实例化那些传递给它们的引用了. 由于这些引用不会改变, 所以调用这个新脚本 ``persistent_state.gd`` 是有意义的.

source: The ``persistent_state.gd`` script contains code for detecting input. This was to make the tutorial simple, but it is not usually best practice to do this.
fr: Le script ``persistent_state.gd`` contient du code pour détecter les entrées. C'était pour rendre le tutoriel simple, mais ce n'est généralement pas la meilleure pratique de le faire.
ja: ``persistent_state.gd`` スクリプトには、入力を検出するためのコードが含まれています。これはチュートリアルを簡単にするためでしたが、通常これを行うのはベストプラクティスではありません。
pt_br: O script ``persistent_state.gd`` contém código para detecção de entrada. Isso foi feito para simplificar o tutorial, mas geralmente não é uma prática recomendada fazer isso.
zh_cn: ``persistent_state.gd`` 脚本包含检测输入的代码. 这是为了使教程简单化, 但通常这样做不是最好的做法.

source: Project setup
fr: Configuration du projet
ja: プロジェクトの設定
pt_br: Configuração do projeto
zh_cn: 项目设置

source: This tutorial made an assumption that the node it would be attached to contained a child node which is an :ref:`AnimatedSprite <class_AnimatedSprite>`. There is also the assumption that this :ref:`AnimatedSprite <class_AnimatedSprite>` has at least two animations, the idle and run animations. Also, the top-level node is assumed to be a :ref:`KinematicBody2D <class_KinematicBody2D>`.
fr: Ce tutoriel suppose que le noeud auquel il est attaché contient un noeud enfant qui est un :ref:`AnimatedSprite <class_AnimatedSprite>`. Il y a aussi l'hypothèse que ce :ref:`AnimatedSprite <class_AnimatedSprite>` a au moins deux animations, l' animations= au repos et celle de cours. De plus, le noeud de plus haut niveau est supposé être un :ref:`KinematicBody2D <class_KinematicBody2D>`.
ja: このチュートリアルでは、接続先のノードに、\ :ref:`AnimatedSprite <class_AnimatedSprite>` である子ノードが含まれると仮定しました。また、この :ref:`AnimatedSprite <class_AnimatedSprite>` には、少なくとも2つのアニメーション(待機アニメーションと走るアニメーション)があるという仮定があります。また、最上位ノードは :ref:`KinematicBody2D <class_KinematicBody2D>` であると想定されます。
zh_cn: 本教程做了一个假设, 即它要连接的节点包含一个子节点, 这个子节点是一个 :ref:`AnimatedSprite <class_AnimatedSprite>`. 还有一个假设是, 这个 :ref:`AnimatedSprite <class_AnimatedSprite>` 至少有两个动画, 即空闲和运行动画. 另外, 还假设顶层节点是一个 :ref:`KinematicBody2D <class_KinematicBody2D>`.

source: The zip file of the llama used in this tutorial is :download:`here <files/llama.zip>`. The source was from `piskel_llama <https://www.piskelapp.com/p/agxzfnBpc2tlbC1hcHByEwsSBlBpc2tlbBiAgICfx5ygCQw/edit>`_, but I couldn't find the original creator information on that page... There is also a good tutorial for sprite animation already. See :ref:`2D Sprite Animation <doc_2d_sprite_animation>`.
zh_cn: 本教程中使用的骆驼的压缩文件是: 下载: `here <files/llama.zip>` . 源自 `piskel_llama <https://www.piskelapp.com/p/agxzfnBpc2tlbC1hcHByEwsSBlBpc2tlbBiAgICfx5ygCQw/edit>`_ , 但我在那个页面上找不到原创作者的信息...... 还有一个好的精灵动画教程已经有了. 参见 :ref:`2D 精灵动画 <doc_2d_sprite_animation>` .

source: So, the only script that must be attached is ``persistent_state.gd``, which should be attached to the top node of the player, which is a :ref:`KinematicBody2D <class_KinematicBody2D>`.
fr: Ainsi, le seul script qui doit être attaché est ``persistent_state.gd``, qui doit être attaché au noeud de plus au niveau du joueur, qui est un :ref:`KinematicBody2D <class_KinematicBody2D>`.
ja: したがって、アタッチする必要がある唯一のスクリプトは ``persistent_state.gd`` で、これはプレイヤーの最上位ノードにアタッチする必要があります。これは :ref:`KinematicBody2D <class_KinematicBody2D>` です。
pt_br: Portanto, o único script que deve ser anexado é o ``persistent_state.gd``, que deve ser anexado ao nó superior do player, que é :ref:`KinematicBody2D <class_KinematicBody2D>`.
zh_cn: 所以, 唯一必须附加的脚本是 ``persistent_state.gd`` , 它应该附加在玩家的顶部节点上, 这是一个 :ref:`KinematicBody2D <class_KinematicBody2D>` .

source: Now the player has utilized the state design pattern to implement its two different states. The nice part of this pattern is that if one wanted to add another state, then it would involve creating another class that need only focus on itself and how it changes to another state. Each state is functionally separated and instantiated dynamically.
fr: Maintenant, le joueur a utilisé le modèle de conception d'état pour implémenter ses deux états différents. La bonne partie de ce modèle est que si l'on voulait ajouter un autre état, cela impliquerait de créer une autre classe qui ne doit se concentrer que sur elle-même et sur la façon dont elle passe à un autre état. Chaque état est fonctionnellement séparé et instancié dynamiquement.
ja: プレイヤーは、ステート設計パターンを使用して、2つの異なるステートを実装しました。このパターンの良い点は、別のステートを追加する場合は、自分自身と他のステートにどのように変化するかにのみに焦点を当てる別のクラスを作成すれば済むということです。各ステートは機能的に分離され、動的にインスタンス化されます。
pt_br: Agora o jogador utilizou o padrão de projeto State para implementar seus dois estados diferentes. A parte boa desse padrão é que, se alguém quiser adicionar outro estado, isso envolveria a criação de outra classe que só precisa se concentrar em si mesma e em como ela muda para outro estado. Cada estado é uma funcionalidade separada e instanciada dinamicamente.
zh_cn: 现在玩家已经利用状态设计模式实现了它的两种不同的状态. 这种模式的好处是, 如果想要添加另一个状态, 那么就需要创建另一个类, 而这个类只需要关注自己以及如何变化到另一个状态. 每个状态在功能上是分离的, 并且是动态实例化的.

source: Finally, this script is actually being designated as a class named ``State``. This makes refactoring the code easier, since the file path from using the ``load()`` and ``preload()`` functions in godot will not be needed.
fr: Enfin, ce script est en fait désigné comme une classe nommée ``State``. Cela rend la refactorisation du code plus facile, puisque le chemin d'accès au fichier ne sera pas nécessaire pour utiliser les fonctions ``load()`` et ``preload()`` dans godot.

source: The since the ``Run`` and ``Idle`` states extend from ``State`` which extends ``Node2D``, the function ``_physics_process(delta)`` is called from the **bottom-up** meaning ``Run`` and ``Idle`` will call their implementation of ``_physics_process(delta)``, then ``State`` will call its implementation, then ``Node2D`` will call its own implementation and so on. This may seem strange, but it is only relevant for predefined functions such as ``_ready()``, ``_process(delta)``, etc. Custom functions use the normal inheritance rules of overriding the base implementation.
fr: Puisque les états ``Run`` et ``Idle`` s'étendent à partir de ``State`` qui étend de ``Node2D``, la fonction ``_physics_process(delta)`` est appelée à partir de **bottom-up**, ce qui signifie ``Run`` et ``Idle`` appelleront leur implémentation de ``_physics_process(delta)``, puis ``State`` appellera sot implémentation, puis `Node2D`` appellera sa propre implémentation et ainsi de suite. Cela peut sembler étrange, mais cela n'est pertinent que pour des fonctions prédéfinies telles que ``_ready()``, ``_process(delta)``, etc. Les fonctions personnalisées utilisent les règles d'héritage normales qui consistent à surcharger l'implémentation de base.

source: There is a round-about method for obtaining a state instance. A state factory can be used.
fr: Il existe une méthode indirecte pour obtenir une instance d'état. Une usine à état peut être utilisée.

source: The zip file of the llama used in this tutorial is :download:`here <files/llama.zip>`. The source was from `piskel_llama <https://www.piskelapp.com/p/agxzfnBpc2tlbC1hcHByEwsSBlBpc2tlbBiAgICfx5ygCQw/edit>`_, but I couldn't find the original creator information on that page though... There is also a good tutorial for sprite animation already. See :ref:`2D Sprite Animation <doc_2d_sprite_animation>`.
fr: Le fichier zip du llama utilisé dans ce tutoriel est :download:`ici <files/llama.zip>`. La source provient de `piskel_llama <https://www.piskelapp.com/p/agxzfnBpc2tlbC1hcHByEwsSBlBpc2tlbBiAgICfx5ygCQw/edit>`_, mais je n'ai pas pu trouver d'informations sur le créateur original sur cette page... Il y a aussi déjà un bon tutoriel sur l'animation de sprites. Voir :ref:`2D Sprite Animation <doc_2d_sprite_animation>`.
