Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/index.po
Languages: de, es, fi, it, ko, pt_br, ru, zh_cn

source: General
de: Allgemein
fi: Yleistä
it: Informazioni Generali
ko: 일반
pt_br: Geral
ru: Основное
zh_cn: 综述

source: Getting started
de: Erste Schritte
es: Comenzando
fi: Alkuun pääseminen
it: Per iniziare
ko: 시작하기
pt_br: Primeiros passos
ru: Начало работы
zh_cn: 入门

source: Tutorials
de: Anleitungen
es: Tutoriales
fi: Opetusohjelmat
it: Tutorial
ko: 튜토리얼
pt_br: Tutoriais
ru: Уроки
zh_cn: 手册

source: Development
de: Entwicklung
es: Desarrollo
fi: Kehitys
it: Sviluppo
ko: 개발
pt_br: Desenvolvimento
ru: Разработка
zh_cn: 与开发相关

source: Community
es: Comunidad
fi: Yhteisö
it: Comunità
ko: 커뮤니티
pt_br: Comunidade
ru: Сообщество
zh_cn: 社区生态

source: Class reference
de: Klassenreferenz
es: Referencia de clase
fi: Luokka viitteet
it: Riferimento classe
ko: 클래스 레퍼런스
pt_br: Referência de classe
ru: Классы движка
zh_cn: 代码参考

source: Godot Docs – *3.3* branch
de: Godot-Dokumentation – *3.3*-Zweig
ko: Godot 문서 – *3.3* 브랜치
ru: Документация Godot – ветка *3.3*

source: Godot's documentation is available in various languages and versions. Expand the "Read the Docs" panel at the bottom of the sidebar to see the list.
de: Die Godot-Dokumentation ist in verschiedenen Sprachen und Versionen vorhanden. Öffnen Sie die "Read the Docs"-Schaltfläche unten in der Seitenleiste, um die Liste zu öffnen.
es: La documentación de Godot está disponible en varios idiomas y versiones. Expande el panel "Read the Docs" en la parte inferior de la barra lateral para ver la lista.
fi: Godotin dokumentaatio on saatavilla monina eri kielinä ja versioina. Laajenna "Lue dokumentit" paneeli sivupaneelin alareunasta nähdäksesi listan.
it: La documentazione di Godot è disponibile in diverse lingue e versioni. Espandi il pannello "Read the Docs" in fondo alla barra laterale per vedere la lista.
ko: Godot의 문서는 다양한 언어와 버전으로 이용할 수 있습니다. 사이드바의 아래쪽 "Read the Docs" 패널에서 언어 목록을 확인해보세요.
pt_br: A documentação do Godot está disponível em vários idiomas e versões. Expanda o painel "Ler a Documentação" na parte inferior da barra lateral para ver a lista.
ru: Документация Godot доступна на различных языках и для разных версий. Разверните панель "Read the Docs" в нижней части боковой панели, чтобы увидеть весь список.
zh_cn: Godot文档支持多语言多版本，点击网页左下角的 "Read the Docs" 查看详情。

source: This is the documentation for the stable 3.3 branch. Looking for the documentation of the current **development** branch? `Have a look here <https://docs.godotengine.org/en/latest>`_. You can also browse the documentation for the previous stable `3.2 <https://docs.godotengine.org/en/3.2>`_ branch.
de: Dies ist die Dokumentation für die offizielle Version 3.3. Wenn Sie stattdessen nach der aktuellen **in Entwicklung** befindlichen Version suchen, finde Sie diese hier: <https://docs.godotengine.org/en/latest>. Sie können die Dokumentation der vorhergehenden stabilen Version 3.2 unter: <https://docs.godotengine.org/en/3.2> finden.
ko: 이 문서는 안정(stable) 버전 3.3 브랜치의 문서입니다. 현재 **개발 버전** 브랜치의 문서를 찾으신다면 이 링크를 살펴보세요 <http://docs.godotengine.org/en/latest>`_. 이전 안정 버전 `3.2 <https://docs.godotengine.org/en/3.2>`_ 브랜치의 문서도 확인 가능합니다.
ru: Это документация для стабильной ветки 3.3. Ищете документацию по текущей разрабатываемой версии? Взгляните `сюда <https://docs.godotengine.org/ru/latest>`_. Вы также можете найти документацию к предыдущей стабильной версии (на английском)`3.2 <https://docs.godotengine.org/ru/3.2>`_.

source: This documentation is translated from the `original English one <https://docs.godotengine.org/en/latest>`_ by community members on `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
de: Diese Dokumentation wurde von der `originalen englischen Version <https://docs.godotengine.org/en/latest>`_ von Community Mitgliedern auf `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_ übersetzt.
es: Esta documentación es traducida de la `original en inglés <https://docs.godotengine.org/en/latest>`_ por miembros de la comunidad en `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
fi: Tämä dokumentaatio on käännetty alkuperäisestä `englanninkielisestä versiosta <https://docs.godotengine.org/en/latest>`_. Käännöksistä vastaavat yhteisön jäsenet `Weblatessa <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
it: Questa documentazione è tradotta da `quella originale in inglese <https://docs.godotengine.org/en/latest>`_ dai membri della community su `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
ko: 이 문서는 `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_\ 에서 커뮤니티 회원들이 `원본 영어 문서 <https://docs.godotengine.org/en/latest>`_\ 를 번역한 것입니다.
pt_br: Esta documentação é traduzida do `original em inglês <https://docs.godotengine.org/en/latest>`_ por membros da comunidade no `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
ru: Эта документация переведена с оригинального `английского источника <https://docs.godotengine.org/en/latest>`_ членами сообщества на `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_.
zh_cn: 本文档由社区成员从\ `Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_\ 上的\ `原始英文版本 <https://docs.godotengine.org/en/latest>`_ \ 翻译而来。

source: Depending on the translation effort's completion level, you may find paragraphs or whole pages which are still in English. You can help the community by providing new translations or reviewing existing ones on Weblate.
de: Abhängig vom Fertigstellungsgrad der Übersetzung können Absätze oder ganze Seiten noch in englischer Sprache verfasst sein. Sie können der Community helfen, indem Sie neue Übersetzungen erstellen oder vorhandene in Weblate überprüfen.
es: Dependiendo del nivel de progreso de la traducción, es posible que encuentres párrafos o páginas enteras que aún están en inglés. Puedes ayudar a la comunidad proporcionando nuevas traducciones o revisando las existentes en Weblate.
fi: Käännöstyön tuloksista riippuen saatat löytää kappaleita tai kokonaisia sivuja, jotka ovat vielä englanniksi. Voit auttaa yhteisöä tarjoamalla uusia käännöksiä tai tarkastelemalla olemassa olevia Weblate sivustolla.
it: A seconda del livello di completezza raggiunta nella traduzione, potresti trovare alcuni paragrafi o intere pagine ancora in inglese. Puoi aiutare la comunità fornendo nuove traduzioni o controllando quelle esistenti su Weblate.
ko: 번역의 진행 정도에 따라 아직 영어로 된 페이지나 단락이 나올 수도 있습니다. 본인이 영어에 자신이 있다면 Weblate에서 문서를 새로 번역하거나 기존의 번역을 검토하여 커뮤니티에 기여해주세요.
pt_br: Dependendo do nível de esforço para a conclusão da tradução, você pode encontrar parágrafos ou páginas inteiras que ainda estão em inglês. Você pode ajudar a comunidade fornecendo novas traduções ou revisando as existentes no Weblate.
ru: В зависимости от степени завершённости перевода, вы можете наткнуться на абзацы или целые страницы, которые всё ещё на английском языке. Вы можете помочь сообществу добавить новые переводы или проверить уже существующие на Weblate.
zh_cn: 如果您发现仍有未翻译的部分，那是因为翻译工作的完成度不够。您可以在 Weblate 上更新翻译或者校对翻译过的内容，这样可以帮助社区发展。

source: For the time being, localized translations are only available for the "latest" (development) branch, but should be suitable to learn how to use stable Godot releases nevertheless.
de: Derzeit sind lokalisierte Übersetzungen nur für den "latest" (Entwicklungs-) Zweig verfügbar, sollten aber ebenfalls geeignet sein, um zu lernen, wie man stabile Godot-Releases verwendet.
es: Por el momento, las traducciones localizadas sólo están disponibles para la rama " última" (desarrollo), pero deberían ser adecuadas para aprender a utilizar las versiones estables de Godot.
fi: Toistaisesti käännökset ovat saatavilla vain "latest" (kehitys) -haarassa, mutta sen käyttö sopii viimeisimmän vakaan Godot-julkaisun opetteluun.
it: Al momento, le traduzioni localizzate sono disponibili solo per il ramo "latest" (development), ma dovrebbero essere adatte per imparare come usare le versioni stabili di Godot.
ko: 당분간 현지화된 번역은 "최신" (개발) 분기에서만 이용할 수 있습니다. 하지만 개발 브랜치의 내용으로도 안정 버전 Godot을 배우기에는 무리가 없을 것입니다.
pt_br: Por enquanto, as traduções localizadas estão disponíveis apenas para a versão mais "recente" (de desenvolvimento), mas também são adequadas para aprender como usar versões estáveis do Godot.
ru: На данный момент локализованные переводы доступны только для ветки "latest" (разработка), но тем не менее должны подходить для изучения и использования стабильных релизов Godot.
zh_cn: 目前，只有 "latest"开发分支支持汉化翻译，您也可以对照最新版来学习使用稳定版Godot 。

source: Welcome to the official documentation of `Godot Engine <https://godotengine.org>`__, the free and open source community-driven 2D and 3D game engine! If you are new to this documentation, we recommend that you read the :ref:`introduction page <doc_about_intro>` to get an overview of what this documentation has to offer.
de: Willkommen in der offiziellen Dokumentation der Godot Engine, der freien, quelloffenen und gemeinschaftlich entwickelten 2D- und 3D-Spiele-Engine! Falls Sie diese Dokumentation zum ersten Mal aufrufen, empfehlen wir als Erstes, die :ref:`Einführungsseite <doc_about_intro>` zu lesen, um eine Übersicht der verfügbaren Inhalte zu erhalten.
es: Bienvenido a la documentación oficial de `Godot Engine <https://godotengine.org>`__, el motor de juegos 2D y 3D gratuito y de código abierto impulsado por la comunidad! Si eres nuevo en esto, te recomendamos que leas la :ref:`página de introducción <doc_about_intro>` para obtener una visión general de lo que esta documentación tiene para ofrecer.
fi: Tervetuloa Godot Enginen viralliseen dokumentaatioon. Godot Engine on vapaa ja avoimen lähdekoodin yhteisön tekemä 2D ja 3D pelimoottori! Jos olet ensimmäistä kertaa täällä, kannattaa lukea :ref:`esittelysivu <doc_about_intro>`, joka antaa yleiskatsauksen tämän dokumentaation sisällöstä.
it: Benvenuto nella documentazione ufficiale di Godot Engine <https://godotengine.org>`, il motore di gioco 2D e 3D gratuito e open source gestito dalla community! Se è la prima volta che utilizzi questa documentazione, ti raccomandiamo di leggere la :ref:`pagina di introduzione <doc_about_intro>` per avere una panoramica di cosa questa documentazione ha da offrirti.
ko: 커뮤니티가 개발하는 자유 오픈소스 2D & 3D 게임 엔진인 'Godot 엔진 <https://godotengine.org>`_, 의 공식 문서에 오신 것을 환영합니다! 이 문서를 처음 보신다면 :ref:`소개 페이지<doc_about_intro>` 에서 공식 문서의 개요를 읽어보시길 추천합니다.
pt_br: Seja bem-vindo à documentação oficial do `Godot Engine <https://godotengine.org>`__, o motor de jogos gratuito e de código aberto impulsionado pela comunidade para jogos 2D e 3D! Se você não conhece a documentação, sugerimos que leia a :ref:`introdução <doc_about_intro>` para ter uma visão geral sobre o que a documentação tem para oferecer.
ru: Добро пожаловать в официальную документацию `Godot Engine <https://godotengine.org>`__, бесплатного и открытого игрового движка 2D и 3D, управляемого сообществом! Если вы впервые знакомитесь с этой документацией, мы рекомендуем вам прочитать :ref:`вводную страницу <doc_about_intro>`, чтобы получить общее представление о том, что эта документация может предложить.
zh_cn: 欢迎来到 `Godot 引擎 <https://godotengine.org>`_ 的官方文档，Godot 引擎是一款免费、由开源社区驱动的 2D 和 3D 游戏引擎！如果您是初次阅读本文档，我们建议您读一下\ :ref:`简介页面 <doc_about_intro>` ，以对本文档的内容有一个整体的了解。

source: The table of contents below and in the sidebar should let you easily access the documentation for your topic of interest. You can also use the search function in the top left corner.
de: Über das untenstehende Inhaltsverzeichnis und die Seitenleiste können Sie schnell auf die Themen zugreifen, die für Sie interessant sind. Außerdem steht eine Suchfunktion in der oberen linken Ecke zur Verfügung.
es: La tabla de contenidos que aparece a continuación y la barra lateral te permitirán acceder fácilmente a la documentación sobre el tema de tu interés. También puedes utilizar la función de búsqueda en la esquina superior izquierda.
fi: Pääset helposti selaamaan sinua kiinnostavia aiheita sivupalkista tai alla olevasta sisällysluettelosta. Voit myös käyttää vasemmassa yläkulmassa olevaa hakutoimintoa.
it: La tabella dei contenuti qui sotto e nella barra laterale ti dovrebbero consentire un accesso facile alla documentazione degli argomenti che ti interessano. Puoi usare anche la funzione di ricerca nell'angolo in alto a sinistra.
ko: 아래쪽에 있는 목차와 사이드바에서 원하시는 주제의 문서를 손쉽게 찾아보실 수 있습니다. 또한 왼쪽 아래에 있는 검색창에서 원하시는 내용을 검색하실 수도 있습니다.
pt_br: O sumário abaixo e a barra lateral permitem que você acesse facilmente a documentação do tópico de seu interesse. Se quiser, também pode utilizar a função de busca no canto superior esquerdo.
ru: Оглавление на боковой панели должно позволить вам легко получить доступ к документации по интересующей вас теме. Вы также можете использовать функцию поиска в верхнем левом углу.
zh_cn: 使用下方以及侧边栏中的目录可以方便地找到你感兴趣的主题的文档，搜索功能位于左上角。

source: You can also `download an HTML copy <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`__ for offline reading (updated every Monday). Extract the ZIP archive then open the top-level ``index.html`` in a web browser.
fi: Voit myös `ladata HTML kopion <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/3.3/godot-docs-html.zip>`lukeaksesi offline-tilassa (päivittyy joka maanantai). Pura ZIP arkisto ja avaa ylätason``index.html`` selaimessa.
pt_br: Você também pode `baixar uma cópia em HTML <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`__ para leitura offline (atualizada toda segunda-feira). Extraia o arquivo ZIP e abra o arquivo ``index.html`` em um navegador web.
ru: Также можно `загрузить HTML-копию документа <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/3.3/godot-docs-html.zip>` __ для чтения в офлайн-режиме (обновляется каждый понедельник). Распакуйте архив ZIP, затем откройте самый верхний файл ``index.html`` в браузере.
zh_cn: 您也可以\ `下载 HTML 副本 <https://nightly.link/godotengine/godot-docs/workflows/build_offline_docs/master/godot-docs-html-stable.zip>`__\ 进行离线阅读（每周一更新）。将该 ZIP 压缩包解压，用网页浏览器打开顶层的 ``index.html`` 即可。

source: Godot Engine is an open source project developed by a community of volunteers. The documentation team can always use your feedback and help to improve the tutorials and class reference. If you don't understand something, or cannot find what you are looking for in the docs, help us make the documentation better by letting us know!
de: Die Godot Engine ist ein Open Source-Projekt einer Community von Freiwilligen. Das für die Dokumentation zuständige Team ist für Rückmeldungen und Hilfe dankbar, um Anleitungen oder die Klassenreferenz zu verbessern. Wenn Sie etwas nicht verstehen oder in der Dokumentation nicht finden können, dann geben Sie uns Bescheid, um die Dokumentation zu verbessern!
es: Godot Engine es un proyecto de código abierto desarrollado por una comunidad de voluntarios. El equipo de documentación siempre puede utilizar tus comentarios y ayudar a mejorar los tutoriales y las referencias de clases. Si no entiendes algo, o no encuentras lo que buscas en los documentos, ¡ayúdanos a mejorar la documentación haciéndonos saber!
fi: Godot Engine avoimen lähdekoodin projekti, jota kehittää vapaaehtoisten yhteisö. Dokumentaatiosta vastaava ryhmä voi hyödyntää palautettasi apuna parantaakseen oppaita ja luokkakaaviota. Jos et ymmärrä jotakin, tai et löydä etsimääsi dokumentaatiosta, auta meitä parantamaan dokumentaatiota kertomalla siitä meille!
it: Godot Engine è un progetto open source sviluppato da una comunità di volontari. Il team della documentazione può utilizzare sempre i tuoi feedback ed il tuo aiuto per migliorare i tutorial ed i riferimenti alle classi. Se non comprendi qualcosa o non riesci a trovare quello che stai cercando in questi documenti, aiutaci a migliorare la documentazione facendocelo sapere!
ko: Godot 엔진은 사용자들에 의해 자발적으로 개발되는 오픈 소스 프로젝트입니다. 문서화 팀은 튜토리얼과 클래스 참조 등을 개선하기 위해 여러분의 의견을 받고 있습니다. 만약 튜토리얼 중 이해가 가지 않는 부분이나 설명이 애매하거나 부족한 부분이 있다면, 부디 저희에게 알려주셔서 더 나은 문서를 만들 수 있게 도와주세요!
pt_br: Godot Engine é um projeto de código aberto desenvolvido por uma comunidade de voluntários. A equipe de documentação sempre pode usar seu feedback e ajudar a aprimorar os tutoriais e a referência de classe. Se você não entender alguma coisa ou não encontrar o que está procurando nos documentos, ajude-nos a melhorar a documentação nos informando!
ru: Godot Engine — это проект с открытым исходным кодом, разрабатываемый сообществом добровольцев. Команда документации всегда открыта к вашим отзывам и помощи по улучшению уроков и справочнику классов. Если вы чего-то не понимаете или не можете найти что-то в документации, помогите нам сделать её лучше, рассказав нам об этом!
zh_cn: Godot 引擎是由志愿者社区驱动的开源项目。文档团队会听取您的反馈，以此来改进教程和类参考手册。如果您有看不懂的地方，或者在文档中找不到想要的内容，请告诉我们，我们一起把文档变得更好！

source: Submit an issue or pull request on the `GitHub repository <https://github.com/godotengine/godot-docs/issues>`_, help us `translate the documentation <https://hosted.weblate.org/engage/godot-engine/>`_ into your language, or talk to us on either the ``#documentation`` channel on `Discord <https://discord.gg/zH7NUgz>`_, or the ``#documentation`` channel on the `Godot Contributors Chat <https://chat.godotengine.org/>`_!
de: Reichen Sie einen Fehler oder einen Pull Request im `GitHub-Repository <https://github.com/godotengine/godot-docs/issues>`_ ein, helfen Sie uns, `die Dokumentation <https://hosted.weblate.org/engage/godot-engine/>`_ in Ihre Sprache zu übersetzen, oder diskutieren Sie mit uns entweder im ``#documentation``-Kanal auf `Discord <https://discord.gg/zH7NUgz>`_, oder dem ``#documentation``-Kanal auf `chat.godotengine.org <https://chat.godotengine.org/channel/documentation>`_!
fi: Luo ongelmaraportti tai pull request `GitHub repositoryyn <https://github.com/godotengine/godot-docs/issues>`_, auta meitä `kääntämällä dokumentaatio <https://hosted.weblate.org/engage/godot-engine/>`_ omalle kielellesi, tai keskustele kanssamme joko ``#documentation`` kanavalla `Discordissa <https://discord.gg/zH7NUgz>`_, tai ``#godotengine-doc`` IRC-kanavalla `irc.freenode.net <http://webchat.freenode.net/?channels=#godotengine-doc>`_ palvelimella!
ko: `GitHub 저장소 <https://github.com/godotengine/godot-docs/issues>`_\ 에 Issue를 제출하고 Pull Request를 하거나, `문서 현지화 <https://hosted.weblate.org/engage/godot-engine/>`_\ 를 돕거나, `Discord <https://discord.gg/zH7NUgz>`_\ 의 ``#documentation``\ 이나 `Godot Contributors Chat <http://chat.godotengine.org/>`_\ 의 ``#documentation``\ 에서 저희와 함께 논의를 할 수 있습니다!
pt_br: Envie um issue ou uma pull request no `repositório do GitHub <https://github.com/godotengine/godot-docs/issues>`_, ajude-nos a `traduzir a documentação <https://hosted.weblate.org/engage/godot-engine/>`_ para o seu idioma, ou fale conosco sobre qualquer coisa no canal ``#documentation`` do `Discord <https://discord.gg/zH7NUgz>`_, ou no canal ``#documentation`` do `Chat de Contribuidores do Godot <https://chat.godotengine.org/>`_!
ru: Откройте Issue (тикет) или pull request (запрос на слияние) в `GitHub репозитории <https://github.com/godotengine/godot-docs/issues>`_, помогите нам `перевести документацию <https://hosted.weblate.org/engage/godot-engine/>`_ на ваш язык, или обсудите с нами на канале ``#documentation`` в `Discord <https://discord.gg/zH7NUgz>`_, или на канале ``#documentation`` в `Godot Contributors Chat <https://chat.godotengine.org/>`_!
zh_cn: 您可以在 `GitHub 仓库 <https://github.com/godotengine/godot-docs/issues>`_ 上提交问题或拉取请求（Pull Request），可以帮助我们将\ `文档 <https://hosted.weblate.org/engage/godot-engine/>`_\ 翻译成您使用的语言，您也可以在 `Discord <https://discord.gg/zH7NUgz>`_ 的 ``#documentation`` 频道或 `Godot 贡献者聊天 <https://chat.godotengine.org/>`_ 的 ``#documentation`` 频道中和我们交流！

source: The main documentation for the site is organized into the following sections:
de: Die Hauptdokumentation von Godot ist in folgende Abschnitte gegliedert:
es: La documentación principal del sitio está organizada en las siguientes secciones:
fi: Päädokumentaatio tällä sivustolla on järjestelty seuraaviin lukuihin:
it: La documentazione principale per il sito è organizzato nelle seguenti sezioni:
ko: 이 사이트의 주요 문서는 다음과 같이 구성되어 있습니다:
pt_br: A documentação principal deste site está organizada nas seguintes seções:
ru: Основная документация для сайта разделена на следующие части:
zh_cn: 本站点的主要文档分为以下几个部分：

source: Godot Docs – *3.2* branch
es: Documentación de Godot – rama *3.2*
it: Documentazione di Godot - *3.2* branch

source: This is the documentation for the stable 3.2 branch. Looking for the documentation of the current **development** branch? `Have a look here <https://docs.godotengine.org/en/latest>`_. You can also browse the documentation for the previous stable `3.1 <https://docs.godotengine.org/en/3.1>`_ branch.
es: Esta es la documentación para la rama estable 3.2. ¿Buscas la documentación de la rama **en desarrollo** actual? `Echa un vistazo aquí <http://docs.godotengine.org/en/latest>`_. Tambien puedes buscar la documentacion para la version estable anterior `3.1`<https://docs.godotengine.org/en/3.1>`_ branch.
it: Questa è la documentazione per la versione stabile 3.2. Stai cercando la documentazione per la versione corrente **in sviluppo**? `Dai un'occhiata qui: <http://docs.godotengine.org/en/latest>`_. Puoi anche vedere la documentazione della precedente versione stabile `3.1 <https://docs.godotengine.org/en/3.1>`_.

source: Submit an issue or pull request on the `GitHub repository <https://github.com/godotengine/godot-docs/issues>`_, help us `translate the documentation <https://hosted.weblate.org/engage/godot-engine/>`_ into your language, or talk to us on either the ``#documentation`` channel on `Discord <https://discord.gg/zH7NUgz>`_, or the ``#godotengine-doc`` channel on `irc.freenode.net <http://webchat.freenode.net/?channels=#godotengine-doc>`_!
es: Envíe un problema o solicite una solicitud en el repositorio `GitHub <https://github.com/godotengine/godot-docs/issues>` _, ayúdenos a `traducir la documentacion <https://hosted.weblate.org/projects/godot-engine/godot-docs>`_. en su idioma, o hable con nosotros en el canal` `# documentación`` en` Discord <https://discord.gg/zH7NUgz> `_, o en el` `# godotengine-doc `` canal en `irc.freenode.net <http://webchat.freenode.net/?channels=#godotengine-doc>` _!doc>`_!
it: Invia segnalazioni di problemi o pull request del `repository di GitHub <https://github.com/godotengine/godot-docs/issues>`_, aiutaci a `tradurre la documentazione <https://hosted.weblate.org/engage/godot-engine/>`_ nella tua lingua, o rimani in contatto con noi sia sul canale della ``#documentazione`` su `Discord <https://discord.gg/zH7NUgz>`_, o sul canale ``#godotengine-doc`` su `irc.freenode.net <http://webchat.freenode.net/?channels=#godotengine-doc>`_!
