Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/pausing_games.po
Languages: de, fr, ja, pt_br

source: Pausing games
de: Spiele pausieren
fr: Mettre les jeux en pause
ja: ゲームの一時停止
pt_br: Pausando jogos

source: In most games it is desirable to, at some point, interrupt the game to do something else, such as taking a break or changing options. However, this is not as simple as it seems. The game might be stopped, but it might be desirable that some menus and animations continue working.
de: In den meisten Spielen ist es wünschenswert an einer bestimmten Stelle eine kurze Unterbrechung einzulegen, um etwas anderes zu tun wie z.B. eine Pause machen oder die Einstellungen ändern. Dies ist leider nicht so einfach wie es sich anhört. Das Spiel ist zwar gestoppt, aber vielleicht sollen dabei noch einige Menüs oder Animationen weiter laufen.
fr: Dans la plupart des jeux, il est souhaitable, à un moment donné, d'interrompre le jeu pour faire autre chose, par exemple faire une pause ou changer les options. Cependant, ce n'est pas aussi simple qu'il n'y paraît. Le jeu peut être interrompu, mais il peut être souhaitable que certains menus et animations continuent à fonctionner.
pt_br: Na maioria dos jogos, é desejável, em algum ponto, interromper o jogo para fazer outra coisa, como fazer uma pausa ou alterar opções. No entanto, isso não é tão simples quanto parece. O jogo pode ser interrompido, mas pode ser desejável que alguns menus e animações continuem funcionando.

source: Implementing a fine-grained control for what can be paused (and what can not) is a lot of work, so a simple framework for pausing is provided in Godot.
de: Eine fein abgestimmte Kontrolle einzubauen, was unterbrochen werden kann und was nicht, ist eine Menge arbeit. Daher bietet Godot hierfür eine einfache Rahmenstruktur zum pausieren.
fr: La mise en place d'un contrôle fin de ce qui peut être mis en pause (et de ce qui ne peut pas l'être) représente beaucoup de travail, c'est pourquoi Godot fournit un framework simple pour la mise en pause.
ja: 一時停止できるもの(およびできないもの)をきめ細かく制御することは多くの作業であるため、一時停止のためのシンプルなフレームワークがGodotで提供されています。
pt_br: Implementar um controle refinado para o que pode ser pausado (e o que não pode) é muito trabalhoso, portanto, uma estrutura simples para pausa é fornecida no Godot.

source: How pausing works
de: Wie pausieren funktioniert
fr: Comment fonctionne la pause
ja: 一時停止の仕組み
pt_br: Como a pausa funciona

source: To set pause mode, the pause state must be set. This is done by assigning ``true`` to the :ref:`SceneTree.paused <class_SceneTree_property_paused>` property:
de: Um in einen Pausenmodus zu gelangen, muss der Pausenstatus gesetzt werden. Dies erfolgt durch Zuweisen von ``true`` zur Eigenschaft :ref:`SceneTree.paused <class_SceneTree_property_paused>`:
fr: Pour activer le mode pause, l'état de pause doit être défini. Cela se fait en assignant ``true`` à la propriété :ref:`SceneTree.paused <class_SceneTree_property_paused>` :
ja: 一時停止モードにするには、一時停止状態を設定する必要があります。これは :ref:`SceneTree.paused <class_SceneTree_property_paused>` プロパティに ``true`` を割り当てることで行われます:
pt_br: Para definir o modo de pausa, o estado de pausa deve ser definido. isso é feito atribuindo ``true`` à propriedade :ref:`SceneTree.paused <class_SceneTree_property_paused>`:

source: Doing so will have the following behavior:
de: Dies hat folgendes Verhalten:
fr: Cela aura le comportement suivant :
ja: これを行うと、次の動作が発生します:
pt_br: Fazer isso terá o seguinte comportamento:

source: 2D and 3D physics will be stopped.
de: Die 2D und 3D Physik wird gestoppt.
fr: Les physiques 2D et 3D seront arrêtées.
ja: 2Dおよび3Dの物理演算が停止します。
pt_br: As físicas 2D e 3D serão interrompidas.

source: ``_process`` and ``_physics_process`` will not be called anymore in nodes.
de: ``_process`` und ``_physics_process`` wird in Nodes nicht mehr aufgerufen.
fr: ``_process`` et le ``_physics_process`` ne seront plus appelés dans les nœuds.
ja: ``_process`` と ``_physics_process`` はノードでもう呼び出されません。
pt_br: ``_process`` e ``_physics_process`` não serão mais chamados nos nós.

source: ``_input`` and ``_input_event`` will not be called anymore either.
de: ``_input`` und ``_input_event`` wird ebenfalls nicht mehr aufgerufen.
fr: ``_input`` et ``_input_event`` ne seront plus appelés non plus.
ja: ``_input`` と ``_input_event`` ももう呼び出されません。
pt_br: ``_input`` e ``_input_event`` também não serão mais chamados.

source: This effectively stops the whole game. Calling this function from a script, by default, will result in an unrecoverable state (nothing will work anymore!).
de: Dies stoppt effektiv das ganze Spiel. Das Aufrufen dieser Funktion über ein Skript führt standardmäßig zu einem nicht wiederherstellbaren Status (nichts funktioniert mehr!).
fr: Cela stop effectivement tout le jeu. L'appel de cette fonction à partir d'un script, par défaut, entraînera un état irrécupérable (plus rien ne fonctionnera !).
ja: これは効果的にゲーム全体を停止します。スクリプトからこの関数を呼び出すと、デフォルトでは、回復不能な状態になります(もう何も動作しません！)。
pt_br: Isso efetivamente interrompe todo o jogo. Chamar esta função a partir de um script, por padrão, resultará em um estado irrecuperável (nada funcionará mais!).

source: White-listing nodes
fr: Mettre des nœuds sur liste blanche
ja: ホワイトリストノード
pt_br: Adicionando nós à lista branca

source: Before enabling pause, make sure that nodes that must keep working during pause are white-listed. This is done by editing the "Pause Mode" property in a node:
de: Stellen Sie vor dem Aktivieren der Pause sicher, dass Nodes, die während der Pause weiterarbeiten müssen, auf der weißen Liste stehen. Dies erfolgt durch Bearbeiten der Eigenschaft "Pausenmodus" in einem Node:
fr: Avant d'activer la pause, assurez-vous que les nœuds qui doivent continuer à fonctionner pendant la pause sont sur liste blanche. Cela se fait en modifiant la propriété "Mode Pause" dans un nœud :
ja: 一時停止を有効にする前に、一時停止中も機能し続ける必要があるノードがホワイトリストに登録されていることを確認してください。これを行うには、ノードの "Pause Mode" プロパティを編集します:
pt_br: Antes de habilitar a pausa, certifique-se de que os nós que devem continuar trabalhando durante a pausa estejam na lista branca. Isso é feito editando a propriedade "Modo de Pausa" em um nó:

source: You can achieve the same result in code:
de: Sie können das gleiche Ergebnis im Code erzielen:
fr: Vous pouvez obtenir le même résultat dans le code :
ja: コードで同じ結果を得ることができます:
pt_br: Você pode alcançar o mesmo resultado em código:

source: By default, all nodes have this property in the "Inherit" state. This means, that they will only process (or not) depending on what this same property is set on the parent node. If the parent is set to "Inherit" , then the grandparent will be checked and so on. Ultimately, if a state can't be found in any of the grandparents, the pause state in SceneTree is used. This means that, by default, when the game is paused every node will be paused.
fr: Par défaut, tous les nœuds ont cette propriété avec l'état "Inherit". Cela signifie qu'ils ne s’exécuteront (ou non) qu'en fonction de cette même propriété définie dans le nœud parent. Si le parent est défini sur "Inherit", alors le grand-parent sera vérifié, et ainsi de suite. En fin de compte, si un état ne peut être trouvé dans aucun des grands-parents, l'état de pause dans SceneTree est utilisé. Cela signifie que, par défaut, lorsque le jeu est mis en pause, chaque nœud sera mis en pause.

source: So the three possible states for a node are:
de: Die drei möglichen Zustände für einen Node sind also:
fr: Ainsi, les trois états possibles pour un nœud sont :
ja: したがって、ノードの3つの可能な状態は次のとおりです:
pt_br: Assim, os três estados possíveis para um nó são:

source: **Inherit**: Process depending on the state of the parent, grandparent, etc. The first parent that has a non-Inherit state.
de: **Erben**: Prozess abhängig vom Status des Elternteils, Großelternteils usw. Der erste Elternteil, der einen Nicht-Vererbungsstatus hat.
fr: **Inherit** : L'exécution dépend de l'état du parent, du grand-parent, etc. Le premier parent qui a un état n'étant pas Inherit.
ja: **Inherit(継承)**: 親、祖父母などの状態に応じたプロセス。最初の親は非継承状態を持っている。
pt_br: **Herdar**: Processa dependendo do estado do pai, avô, etc. O primeiro pai que tem um estado não Inherit.

source: **Stop**: Stop the node no matter what (and children in Inherit mode). When paused this node will not process.
de: **Stop**: Stoppt den Node, egal was passiert (und Kinder im Vererbungsmodus). Wenn dieser Node angehalten wird, wird er nicht verarbeitet.
fr: **Stop** : Arrête le nœud quoi qu'il arrive (et ses enfants en mode Inherit). Lorsqu'il est en pause, ce nœud n'est pas exécuté.
ja: **Stop(停止)**: 無条件にノードを停止します(Inherit モードの子も)。一時停止すると、このノードはもう処理されません。
pt_br: **Stop**: Para o nó não importa o que aconteça (e filhos no modo Inherit). Quando pausado, este nó não será processado.

source: **Process**: Process the node no matter what (and children in Inherit mode). Paused or not this node will process.
de: **Verarbeiten**: Verarbeitet den Node, egal was passiert (und Kinder im Vererbungsmodus). Egal ob angehalten oder nicht, wird dieser Node verarbeitet.
fr: **Processus** : Exécute le nœud quoi qu'il arrive (et ses enfants en mode Inherit). En pause ou non, ce nœud sera exécuté.
ja: **Process(処理)**: 無条件にノードを処理します(Inherit モードのも)。このノードは一時停止中か否かを問わず処理されます。
pt_br: **Process**: Processa o nó independentemente do que aconteça (e os filhos no modo Inherit). Pausado ou não, este nó será processado.

source: Example
de: Beispiel
fr: Exemple
ja: 例
pt_br: Exemplo

source: An example of this is creating a popup or panel with controls inside, and set its pause mode to "Process" then hide it:
de: Ein Beispiel hierfür ist das Erstellen eines Popups oder Bedienfelds mit darin enthaltenen Steuerelementen. Stellen Sie den Pausenmodus auf "Verarbeiten" und blenden Sie es dann aus:
fr: Un exemple de cela est la création d'un popup ou d'un panneau avec des contrôles à l'intérieur, et de régler son mode de pause sur "Process" puis de le cacher :
ja: この例は、内部にコントロールを持つポップアップまたはパネルを作成し、一時停止モードを "Process" に設定してから非表示にします:
pt_br: Um exemplo disso é criar um pop-up ou painel com controles internos e definir seu modo de pausa para "Process" e ocultá-lo:

source: Just by setting the root of the pause popup to "Process", all children and grandchildren will inherit that state. This way, this branch of the scene tree will continue working when paused.
de: Wenn Sie die Wurzel des Pausen-Popups auf "Verarbeiten" setzen, erben alle Kinder und Enkelkinder diesen Status. Auf diese Weise funktioniert dieser Zweig des Szenenbaums nach einer Pause weiter.
fr: Il suffit de régler la racine du popup de pause sur "Process" pour que tous ses enfants et petits-enfants héritent de cet état. Ainsi, cette branche de l'arbre des scènes continuera à fonctionner lorsqu'elle sera en pause.
ja: 一時停止ポップアップのルートを "Process" に設定するだけで、すべての子と孫がその状態を継承します。この場合、シーンツリーのこのブランチは、一時停止しても機能し続けます。
pt_br: Apenas definindo a raiz do pop-up de pausa como "Process", todos os filhos e netos herdarão esse estado. Dessa forma, este ramo da árvore da cena continuará funcionando quando estiver em pausa.

source: Finally, make it so when a pause button is pressed (any button will do), enable the pause and show the pause screen.
de: Machen Sie es schließlich so, wenn eine Pause-Taste gedrückt wird (egal welche Taste), aktivieren Sie die Pause und zeigen Sie den Pause-Bildschirm an.
fr: Enfin, assurez-vous que lorsqu'un bouton de pause est pressé (n'importe quel bouton fera l'affaire), activez la pause et affichez l'écran de pause.
ja: 最後に、一時停止ボタンが押されたとき(どのボタンでも実行可能)、一時停止を有効にして一時停止画面を表示するようにします。
pt_br: Finalmente, faça isso quando um botão de pausa for pressionado (qualquer botão serve), habilite a pausa e mostre a tela de pausa.

source: To remove the pause, do the opposite when the pause screen is closed:
de: Gehen Sie beim Schließen des Pausenbildschirms wie folgt vor, um die Pause zu entfernen:
fr: Pour arrêter la pause, faites le contraire lorsque l'écran de pause est fermé :
ja: 一時停止を解除するには、一時停止画面が閉じているときに反対の操作を行います:
pt_br: Para remover a pausa, faça o oposto quando a tela de pausa for fechada:

source: And that should be all!
de: Und das sollte alles sein!
fr: Et ce devrait être tout !
ja: そして、これですべてです！
pt_br: E é isso!

source: Pause?
ja: 一時停止？
pt_br: Pausa?
