Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/optimization/cpu_optimization.po
Languages: fr

source: The solution to this problem is 'fixed timestep interpolation', which involves smoothing the rendered positions and rotations over multiple frames to match the physics. You can either implement this yourself or use a third-party addon. Interpolation is a very cheap operation, performance wise, compared to running a physics tick, orders of magnitude faster, so this can be a significant win, as well as reducing jitter.
fr: La solution à ce problème est la 'fixed timestep interpolation', qui consiste à lisser les positions et les rotations rendues sur plusieurs trames pour qu'elles correspondent à la physique. Vous pouvez soit l'implémenter vous-même, soit utiliser un addon tiers. L'interpolation est une opération très peu coûteuse, en termes de performances, par rapport au rafraîchissement de la physique, des ordres de grandeur plus rapides, donc cela peut être un gain important, ainsi que la réduction du jitter.
