Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/optimization/gpu_optimization.po
Languages: fr

source: The transparent items are also particularly bad for fill rate, because every item has to be drawn, even if later transparent items will be drawn on top.
fr: Les éléments transparents sont aussi particulièrement mauvais pour le taux de remplissage, car chaque élément doit être dessiné, même si plus tard des éléments transparents seront dessinés par-dessus.

source: Opaque items don't have to do this. They can usually take advantage of the Z-buffer by writing to the Z-buffer only first, then only performing the fragment shader on the 'winning' fragment, the item that is at the front at a particular pixel.
fr: Les objets opaques n'ont pas à faire cela. Ils peuvent généralement tirer parti du tampon Z en écrivant d'abord dans le tampon Z, puis en exécutant le shader de fragment sur le fragment 'gagnant', l'élément qui se trouve à l'avant d'un pixel particulier.

source: Transparency is particularly expensive where multiple transparent items overlap. It is usually better to use as small a transparent area as possible in order to minimize these fill rate requirements, especially on mobile, where fill rate is very expensive. Indeed, in many situations, rendering more complex opaque geometry can end up being faster than using transparency to "cheat".
fr: La transparence est particulièrement coûteuse lorsque plusieurs éléments transparents se chevauchent. Il est généralement préférable d'utiliser une zone transparente aussi petite que possible afin de minimiser ces exigences de taux de remplissage, en particulier sur les téléphones portables, où le taux de remplissage est très coûteux. En effet, dans de nombreuses situations, rendre une géométrie opaque plus complexe peut s'avérer plus rapide que d'utiliser la transparence pour "tricher".

source: Multi-Platform Advice
fr: Conseil multi-plateforme

source: If you are aiming to release on multiple platforms, test `early` and test `often` on all your platforms, especially mobile. Developing a game on desktop but attempting to port to mobile at the last minute is a recipe for disaster.
fr: Si vous avez l'intention de publier sur plusieurs plates-formes, testez `au début` et `souvent` sur toutes vos plates-formes, en particulier mobiles. Développer un jeu sur un ordinateur de bureau puis essayer de le porter sur le mobile à la dernière minute est une recette pour le désastre.

source: In general you should design your game for the lowest common denominator, then add optional enhancements for more powerful platforms. For example, you may want to use the GLES2 backend for both desktop and mobile platforms where you target both.
fr: En général, vous devez concevoir votre jeu pour le plus petit dénominateur commun, puis ajouter des améliorations optionnelles pour des plates-formes plus puissantes. Par exemple, vous pouvez vouloir utiliser le backend GLES2 pour les plateformes de bureau et les plateformes mobiles dans le cas où vous ciblez les deux.

source: Mobile / tile renderers
fr: Rendus mobile / tuile

source: GPUs on mobile devices work in dramatically different ways from GPUs on desktop. Most mobile devices use tile renderers. Tile renderers split up the screen into regular sized tiles that fit into super fast cache memory, and reduce the reads and writes to main memory.
fr: Les GPU des appareils mobiles fonctionnent de manière radicalement différente des GPU des ordinateurs de bureau. La plupart des appareils mobiles utilisent des rendus de tuiles. Ces derniers divisent l'écran en tuiles de taille normale qui s'intègrent dans une mémoire cache super rapide et réduisent les opérations de lecture et d'écriture dans la mémoire principale.

source: There are some downsides though, it can make certain techniques much more complicated and expensive to perform. Tiles that rely on the results of rendering in different tiles or on the results of earlier operations being preserved can be very slow. Be very careful to test the performance of shaders, viewport textures and post processing.
fr: Il y a cependant quelques inconvénients, car certaines techniques peuvent être beaucoup plus compliquées et coûteuses à mettre en œuvre. Les tuiles qui reposent sur les résultats du rendu de différentes tuiles ou sur la préservation des résultats d'opérations antérieures peuvent être très lentes. Soyez très attentifs à tester les performances des shaders, des textures de viewport et du post-traitement.
