Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/legal/complying_with_licenses.po
Languages: fr, ja

source: Complying with licenses
fr: Conformité aux licences

source: What are licenses?
fr: Qu'est-ce que les licences ?
ja: ライセンスとは何ですか？

source: Godot is created and distributed under the `MIT License <https://opensource.org/licenses/MIT>`_. It doesn't have a sole owner either, as every contributor that submits code to the project does it under this same license and keeps ownership of the contribution.
fr: Godot est créé et distribué sous `Licence MIT <https://opensource.org/licenses/MIT>`_. Il n'a pas non plus de propriétaire unique, car chaque contributeur qui soumet du code au projet le fait sous cette même licence et conserve la propriété de la contribution.
ja: Godotは、\ `MIT License <https://opensource.org/licenses/MIT>`_ の下で作成および配布されます。プロジェクトにコードを提供するすべての寄稿者がこの同じライセンスの下でそれを行い、寄稿の所有権を保持するため、単独の所有者もいません。

source: The license is the legal requirement for you (or your company) to use and distribute the software (and derivative projects, including games made with it). Your game or project can have a different license, but it still needs to comply with the original one.
fr: La licence est les obligations légales pour vous (ou votre entreprise) pour utiliser et de distribuer le logiciel (et les projets dérivés, y compris les jeux réalisés avec celui-ci). Votre jeu ou projet peut avoir une licence différente, mais il doit toujours être conforme à la licence originale.
ja: ライセンスは、あなた(またはあなたの会社)がソフトウェア(およびそれを使用したゲームを含む派生プロジェクト)を使用および配布するための法的要件です。ゲームまたはプロジェクトは異なるライセンスを持つことができますが、元のライセンスに準拠する必要があります。

source: Requirements
fr: Pré-requis
ja: 必要条件

source: In the case of the MIT license, the only requirement is to include the license text somewhere in your game or derivative project.
fr: Dans le cas de la licence du MIT, la seule exigence est d'inclure le texte de la licence quelque part dans votre jeu ou projet dérivé.
ja: MITライセンスの場合、唯一の要件は、ゲームまたは派生プロジェクトのどこかにライセンステキストを含めることです。

source: This text reads as follows:
fr: Ce texte se lit comme suit :
ja: このテキストは次のとおりです:

source: This game uses Godot Engine, available under the following license:
fr: Ce jeu utilise Godot Engine, disponible sous la licence suivante :
ja: このゲームは、次のライセンスの下で利用可能なGodotエンジンを使用しています:

source: Copyright (c) 2007-2021 Juan Linietsky, Ariel Manzur. Copyright (c) 2014-2021 Godot Engine contributors.
fr: Copyright (c) 2007-2021 Juan Linietsky, Ariel Manzur. Copyright (c) 2014-2021 Contributeurs du moteur Godot.

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
fr: L'autorisation est par les présentes accordée, à titre gratuit, à toute personne obtenant une copie de ce logiciel et des fichiers de documentation associés (le "Logiciel"), d'utiliser le Logiciel sans restriction, y compris, sans limitation, les droits d'utilisation, de copie, de modification, de fusion, de publication, de distribution, de sous-licence et/ou de vente de copies du Logiciel, et d'autoriser les personnes à qui le Logiciel est fourni à le faire, sous réserve des conditions suivantes :

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
fr: L'avis de droit d'auteur ci-dessus et cet avis d'autorisation doivent être inclus dans toutes les copies ou parties substantielles du logiciel.
ja: 上記の著作権表示およびこの許可通知は、ソフトウェアのすべてのコピーまたは大部分に含まれるものとします。

source: Your games do not need to be under the same license. You are free to release your Godot projects under any license and to create commercial games with the engine.
fr: Vos jeux n'ont pas besoin d'être sous la même licence. Vous êtes libres de publier vos projets Godot sous n'importe quelle licence et de créer des jeux commerciaux avec le moteur.
ja: あなたのゲームは同じライセンスの下にある必要はありません。任意のライセンスの下でGodotプロジェクトを自由にリリースし、エンジンで商用ゲームを作成できます。

source: The license does not specify how it has to be included, so anything is valid as long as it can be displayed under some condition. These are the most common approaches (only need to implement one of them, not all).
fr: La licence ne précise pas comment elle doit être incluse, donc tout est valable tant qu'elle peut être affichée sous certaines conditions. Ce sont les approches les plus courantes (il suffit de mettre en œuvre l'une d'entre elles, pas toutes).
ja: ライセンスには含める方法が指定されていないため、ある条件下で表示できるものであれば何でも有効です。これらは最も一般的なアプローチです(すべてではなく、そのうちの1つのみを実装する必要があります)。

source: Credits screen
fr: Écran des crédits
ja: クレジット画面

source: Include the above license text somewhere in the credits screen. It can be at the bottom after showing the rest of the credits. Most large studios use this approach with open source licenses.
fr: Incluez le texte de la licence ci-dessus quelque part dans l'écran des crédits. Il peut se trouver en bas après avoir montré le reste des crédits. La plupart des grands studios utilisent cette approche avec les licences open source.
ja: クレジット画面のどこかに上記のライセンステキストを含めます。残りのクレジットを表示した後、下部に表示される場合があります。ほとんどの大規模スタジオは、このアプローチをオープンソースライセンスで使用しています。

source: Licenses screen
fr: Écran des licences
ja: ライセンス画面

source: Some games have a special menu (often in the settings) to display licenses.
fr: Certains jeux ont un menu spécial (souvent dans les paramètres) pour afficher les licences.
ja: 一部のゲームには、ライセンスを表示するための特別なメニュー(多くの場合設定)があります。

source: Just printing the licensing text using the :ref:`print() <class_@GDScript_method_print>` function may be enough on platforms where a global output log is readable. This is the case on desktop platforms, Android and HTML5 (but not iOS and UWP).
fr: Le simple fait d'imprimer le texte de la licence en utilisant une fonction :ref:`print() <class_@GDScript_method_print>` peut suffire sur les plateformes où un output log global est lisible. C'est le cas sur les plateformes de bureau, Android et HTML5 (mais pas sur iOS et UWP).

source: Accompanying file
fr: Fichier d’accompagnement
ja: 添付ファイル

source: If the game is distributed on desktop platforms, a file containing the license can be added to the software that is installed to the user PC.
fr: Si le jeu est distribué sur des systèmes d'exploitation de bureau, un fichier contenant la licence peut être ajouté au logiciel qui est installé sur le PC de l'utilisateur.

source: Printed manual
fr: Manuel imprimé
ja: 印刷マニュアル

source: If the game includes printed manuals, license text can be included there.
fr: Si le jeu comprend des manuels imprimés, le texte de la licence peut y être inclus.
ja: ゲームに印刷マニュアルが含まれている場合、ライセンステキストをそこに含めることができます。

source: Link to the license
fr: Lien vers la licence

source: The Godot Engine developers consider that a link to godotengine.org/license in your game documentation or credits would be an acceptable way to satisfy the license terms.
fr: Les développeurs du moteur Godot considèrent qu'un lien vers godotengine.org/license dans la documentation ou les crédits de votre jeu serait un moyen acceptable de satisfaire aux conditions de la licence.

source: Third-party licenses
fr: Licences de tiers

source: Godot itself contains software written by `third parties <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_. Most of it does not require license inclusion, but some do. Make sure to do it if these are compiled in your Godot export template. If you're using the official export templates, all libraries are enabled. This means you need to provide attribution for all the libraries listed below.
fr: Godot lui-même contient des logiciels écrits par des `tiers <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_. La plupart d'entre eux ne nécessitent pas l'inclusion d'une licence, mais c'est nécessaire pour certains. Assurez-vous de le faire si ceux-ci sont compilés dans votre modèle d'exportation Godot. Si vous utilisez les modèles d'exportation officiels, toutes les bibliothèques sont activées. Cela signifie que vous devez fournir l'attribution pour toutes les bibliothèques listées ci-dessous.

source: Here's a list of libraries requiring attribution:
fr: Voici une liste de bibliothèques nécessitant une attribution :

source: Godot uses `FreeType <https://www.freetype.org/>`_ to render fonts. Its license requires attribution, so the following text must be included together with the Godot license:
fr: Godot utilise `FreeType <https://www.freetype.org/>`_ pour le rendu des polices. Sa licence exige l'attribution, donc le texte suivant doit être inclus avec la licence Godot :
ja: Godotは `FreeType <https://www.freetype.org/>`_ を使用してフォントをレンダリングします。そのライセンスには帰属が必要であるため、次のテキストをGodotライセンスと一緒に含める必要があります:

source: Godot includes the `ENet <http://enet.bespin.org/>`_ library to handle high-level multiplayer. ENet has similar licensing terms as Godot:
fr: Godot inclut la bibliothèque `ENet <http://enet.bespin.org/>`_ pour gérer le multijoueur de haut niveau. ENet a des conditions de licence similaires à celles de Godot :

source: If the project is done with Godot 3.1 or above and it utilizes SSL (usually through HTTP requests), the `MBedTLS <https://tls.mbed.org>`_ Apache license needs to be complied by including the following text:
fr: Si le projet est réalisé avec Godot 3.1 ou supérieur et qu'il utilise SSL (généralement par le biais de requêtes HTTP), la licence `MBedTLS <https://tls.mbed.org>`_ Apache doit être respectée en incluant le texte suivant :
ja: プロジェクトがGodot 3.1以降で行われ、SSLを利用する場合(通常はHTTPリクエストを使用)、次のテキストを含めることにより、\ `MBedTLS <https://tls.mbed.org>`_ Apacheライセンスを遵守する必要があります。

source: Keep in mind that Godot 2.x and 3.0 use `OpenSSL <https://www.openssl.org>`_ instead.
fr: Gardez à l’esprit que Godot 2.x et 3.0 utilisent `OpenSSL <https://www.openssl.org>`_ à la place.
ja: Godot 2.xおよび3.0は、代わりに `OpenSSL <https://www.openssl.org>`_を使用していることに注意してください。

source: Complying with Licenses
ja: ライセンスの遵守

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
ja: 本ソフトウェアは、市場性、特定の目的への適合性、および権利の非侵害の保証を含みますが、明示または黙示を問わず、これらに限定されていないいかなる保証もなしに「現状のまま」提供されます。いかなる場合においても、作者または著作権者は、契約、不法行為、またはその他の行為、本ソフトウェアまたは本ソフトウェアの使用または他の取引に起因もしくは関連するいかなる請求、損害またはその他の責任についても責任を負わないものとします。

source: Inclusion
ja: 含め方

source: Output log
ja: 出力ログ

source: Just printing the licensing text using a :ref:`print() <class_@GDScript_method_print>` function may be enough on platforms where a global output log is readable (as an example, mobile devices).
ja: グローバル出力ログが読み取り可能なプラットフォーム (例えば、モバイル デバイス) では、\ :ref:`print() <class_@GDScript_method_print>` 関数を使用してライセンステキストを印刷するだけで十分な場合があります。

source: If the game is distributed on desktop operating systems, a file containing the license can be added to the software that is installed to the user PC.
ja: ゲームがデスクトップオペレーティングシステムで配布されている場合、ライセンスを含むファイルをユーザーのPCにインストールされているソフトウェアに追加できます。

source: Third Party licenses
ja: サードパーティのライセンス

source: Godot itself contains software written by `third parties <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_. Most of it does not require license inclusion, but some do. Make sure to do it if you are using them. Here is a list of which ones require it:
ja: Godot自体には、\ `サードパーティ <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ によって作成されたソフトウェアが含まれています。ほとんどの場合、ライセンスを含める必要はありませんが、一部は必要です。それらを使用している場合は、必ず実行してください。必要なもののリストは次のとおりです:

source: If the project being created is a multiplayer game using the `ENet <http://enet.bespin.org/>`_ driver, ENet has similar licensing terms as Godot
ja: 作成されるプロジェクトが `ENet <http://enet.bespin.org/>`_ ドライバーを使用するマルチプレイヤーゲームである場合、ENetにはGodotと同様のライセンス条項があります
