Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/high_level_multiplayer.po
Languages: fr

source: Once enough players have gathered in the lobby, the server should probably start the game. This is nothing special in itself, but we'll explain a few nice tricks that can be done at this point to make your life much easier.
fr: Une fois que les joueurs sont rassemblés dans le salon, le serveur va probablement lancer la partie. Ça n’a rien de spécial en soi, mais nous allons expliquer quelques petites astuces qu’on peut faire à ce stade pour se simplifier la vie.

source: Player scenes
fr: Scènes joueur

source: In most games, each player will likely have its own scene. Remember that this is a multiplayer game, so in every peer you need to instance **one scene for each player connected to it**. For a 4 player game, each peer needs to instance 4 player nodes.
fr: Dans la plupart des jeux, chaque joueur a sans doute sa propre scène. Il faut se rappeler que c’est un jeu multi-joueurs, donc chez chaque pair il faut instancier **une scène pour chaque joueur connecté**. Pour un jeu à quatre joueurs, chaque pair doit instancier quatre nœuds de joueurs.

source: So, how to name such nodes? In Godot, nodes need to have a unique name. It must also be relatively easy for a player to tell which node represents each player ID.
fr: Alors comment appeler ces nœuds ? Dans Godot, les nœuds doivent avoir un nom unique. Il faut aussi que les joueurs puissent savoir assez facilement quel nœud représente chaque identifiant de joueur.

source: The solution is to simply name the *root nodes of the instanced player scenes as their network ID*. This way, they will be the same in every peer and RPC will work great! Here is an example:
fr: La solution est simplement de donner *l’identifiant réseau comme nom au nœud racine des scènes de joueur instanciées*. Ainsi, les noms seront les mêmes chez chaque pair et le RPC marchera au poil ! Voici un exemple :

source: Depending on when you execute pre_configure_game(), you may need to change any calls to ``add_child()`` to be deferred via ``call_deferred()``, as the SceneTree is locked while the scene is being created (e.g. when ``_ready()`` is being called).
fr: Selon le moment où on exécute pre_configure_game(), il peut falloir différer les appels à ``add_child()`` en utilisant ``call_deferred()``, parce que l’arbre des scènes est verrouillé pendant que la scène est crée (p. ex. quand ``_ready()`` est appelée).

source: Synchronizing game start
fr: Synchroniser le démarrage de la partie

source: Setting up players might take different amounts of time for every peer due to lag, different hardware, or other reasons. To make sure the game will actually start when everyone is ready, pausing the game until all players are ready can be useful:
fr: Chaque pair peut prendre un temps différent pour configurer les joueurs, à cause de latences, de matériel différent, ou d’autres raisons. Pour s’assurer que la partie commence quand tout le monde est prêt, il peut être utile de mettre le jeu en pause jusqu’à ce que tous les joueurs soient prêts :

source: When the server gets the OK from all the peers, it can tell them to start, as for example:
fr: Quand le serveur reçoit le signal de tous les pairs, il peut leur dire de commencer, par exemple :

source: Synchronizing the game
fr: Synchronisation du jeu

source: In most games, the goal of multiplayer networking is that the game runs synchronized on all the peers playing it. Besides supplying an RPC and remote member variable set implementation, Godot adds the concept of network masters.
fr: Dans la plupart des jeux, le but du réseau multi-joueurs et que le jeu soit synchronisé entre tous les pairs qui jouent. En plus de fournir un RPC et l’implémentation d’un groupe de variables membres distantes, Godot ajoute le concept de maîtres réseau.

source: Network master
fr: Maître réseau

source: The network master of a node is the peer that has the ultimate authority over it.
fr: Le maître réseau d’un nœud est le pair qui a l’autorité suprême sur lui.

source: When not explicitly set, the network master is inherited from the parent node, which if not changed, is always going to be the server (ID 1). Thus the server has authority over all nodes by default.
fr: Quand il n’est pas défini explicitement, le maître réseau est hérité du nœud parent, qui sera toujours le serveur (ID 1) s’il n’a pas changé. Le serveur a donc par défaut autorité sur tous les nœuds.

source: The network master can be set with the function :ref:`Node.set_network_master(id, recursive) <class_Node_method_set_network_master>` (recursive is ``true`` by default and means the network master is recursively set on all child nodes of the node as well).
fr: Le maître réseau peut être défini avec la fonction :ref:`Node.set_network_master(id, recursive) <class_Node_method_set_network_master>` (recursive est ``true`` par défaut et signifie que le maître réseau est aussi défini récursivement sur tous les nœuds enfants du nœud).

source: Checking that a specific node instance on a peer is the network master for this node for all connected peers is done by calling :ref:`Node.is_network_master() <class_Node_method_is_network_master>`. This will return ``true`` when executed on the server and ``false`` on all client peers.
fr: Pour vérifier qu’une instance donnée d’un nœud chez un pair est le maître réseau de ce nœud chez tous les pairs connectés, on appelle :ref:`Node.is_network_master() <class_Node_method_is_network_master>`. Ça retourne ``true`` quand on l’exécute sur le serveur et ``false`` sur tous les clients pairs.

source: If you have paid attention to the previous example, it's possible you noticed that each peer was set to have network master authority for their own player (Node) instead of the server:
fr: Si vous tendiez l’oreille à l’exemple précédent, vous avez peut-être remarqué que chaque pair était configuré pour avoir l’autorité de maître réseau pour son propre joueur (Nœud) au lieu du serveur :

source: Each time this piece of code is executed on each peer, the peer makes itself master on the node it controls, and all other nodes remain as puppets with the server being their network master.
fr: À chaque fois que ce bout de code est exécuté sur chaque pair, ce pair se rend maître sur le nœud qu’il contrôle, et tous les autres nœuds restent des pantins, le serveur étant leur maître réseau.

source: To clarify, here is an example of how this looks in the `bomber demo <https://github.com/godotengine/godot-demo-projects/tree/master/networking/multiplayer_bomber>`_:
fr: Pour clarifier par l’exemple, voici à quoi ça ressemble dans la `démo bomber. <https://github.com/godotengine/godot-demo-projects/tree/master/networking/multiplayer_bomber>`_ :

source: Master and puppet keywords
fr: Mots-clés Master et puppet

source: The real advantage of this model is when used with the ``master``/``puppet`` keywords in GDScript (or their equivalent in C# and Visual Script). Similarly to the ``remote`` keyword, functions can also be tagged with them:
fr: Le véritable intérêt de ce modèle est quand on l’utilise avec les mots-clés ``master``/``puppet`` en GDScript, (ou leur équivalent en C# et Visual Script). Tout comme le mot-clé ``remote``, les fonctions peuvent aussi être étiquetées avec ces mots-clés :

source: Example bomb code:
fr: Exemple de code pour une bombe :

source: Example player code:
fr: Exemple de code pour un joueur :

source: In the above example, a bomb explodes somewhere (likely managed by whoever is the master of this bomb-node, e.g. the host). The bomb knows the bodies (player nodes) in the area, so it checks that they contain an ``exploded`` method before calling it.
fr: Dans l’exemple ci-dessus, une bombe explose quelque part (sans doute gérée par le maître de ce nœud bombe, par exemple l’hôte). La bombe connaît les corps dans la zone (les nœuds player), donc elle les teste et vérifie qu’ils contiennent une fonction ``exploded`` avant de l'appeler.

source: Recall that each peer has a complete set of instances of player nodes, one instance for each peer (including itself and the host). Each peer has set itself as the master of the instance corresponding to itself, and it has set a different peer as the master for each of the other instances.
fr: Rappelez-vous que chaque pair possède un ensemble complet d'instances de nœuds player, une instance pour chaque pair (y compris lui-même et l'hôte). Chaque pair s'est réglé comme maître de l'instance qui lui correspond, et il a fixé un pair différent comme maître pour chacune des autres instances.

source: Now, going back to the call to the ``exploded`` method, the bomb on the host has called it remotely on all bodies in the area that have the method. However, this method is in a player node and has a ``master`` keyword.
fr: Maintenant, pour en revenir à l'appel de la méthode ``exploded``, la bombe sur l'hôte l'a appelée à distance sur tous les corps de la zone qui ont la méthode. Cependant, cette méthode se trouve dans un nœud player et a un mot-clé ``master``.

source: The ``master`` keyword on the ``exploded`` method in the player node means two things for how this call is made. Firstly, from the perspective of the calling peer (the host), the calling peer will only attempt to remotely call the method on the peer that it has set as the network master of the player node in question. Secondly, from the perspective of the peer the host is sending the call to, the peer will only accept the call if it set itself as the network master of the player node with the method being called (which has the ``master`` keyword). This works well as long as all peers agree on who is the master of what.
fr: Le mot-clé ``master`` de la méthode ``exploded`` dans le nœud player signifie deux choses pour la façon dont cet appel est effectué. Premièrement, du point de vue du pair appelant (l'hôte), le pair appelant ne tentera d'appeler à distance la méthode que sur le pair qu'il a défini comme maître réseau du nœud player en question. Deuxièmement, du point de vue du pair auquel l'hôte envoie l'appel, le pair n'acceptera l'appel que s'il s'est défini comme maître réseau du nœud player avec la méthode appelée (qui a le mot-clé ``master``). Cela fonctionne bien tant que tous les pairs s'accordent sur qui est le maître de quoi.

source: The above setup means that only the peer who owns the affected body will be responsible for telling all the other peers that its body was stunned, after being remotely instructed to do so by the host's bomb. The owning peer therefore (still in the ``exploded`` method) tells all the other peers that its player node was stunned. The peer does this by remotely calling the ``stun`` method on all instances of that player node (on the other peers). Because the ``stun`` method has the ``puppet`` keyword, only peers who did not set themselves as the network master of the node will call it (in other words, those peers are set as puppets for that node by virtue of not being the network master of it).
fr: La configuration ci-dessus signifie que seul le pair qui possède le corps affecté sera responsable de dire à tous les autres pairs que son corps a été assommé, après avoir reçu l'instruction à distance de le faire par la bombe de l'hôte. Le pair propriétaire (toujours dans la méthode ``exploded``) dit donc à tous les autres pairs que son nœud player a été assommé. Le pair fait cela en appelant à distance la méthode ``stun`` sur toutes les instances de ce nœud player (sur les autres pairs). Comme la méthode ``stun`` a le mot-clé ``puppet``, seuls les pairs qui ne se sont pas définis comme maître réseau du nœud l'appelleront (en d'autres termes, ces pairs sont définis comme marionnettes pour ce nœud parce qu'ils n'en sont pas le maître réseau).

source: The result of this call to ``stun`` is to make the player look stunned on the screen of all the peers, including the current network master peer (due to the local call to ``stun`` after ``rpc("stun")``).
fr: Le résultat de cet appel à ``stun`` est de donner au player l'air étourdi sur l'écran de tous les pairs, y compris le pair maître réseau (en raison de l'appel local à ``stun`` après ``rpc("stun")``).

source: The master of the bomb (the host) repeats the above steps for each of the bodies in the area, such that all the instances of any player in the bomb area get stunned on the screens of all the peers.
fr: Le maître de la bombe (l'hôte) répète les étapes ci-dessus pour chacun des corps dans la zone, de sorte que toutes les instances de n'importe quel player dans la zone de la bombe soient étourdis sur les écrans de tous les pairs.

source: Note that you could also send the ``stun()`` message only to a specific player by using ``rpc_id(<id>, "exploded", bomb_owner)``. This may not make much sense for an area-of-effect case like the bomb, but might in other cases, like single target damage.
fr: Veuillez noter qu’on peut aussi envoyer le message ``stun()`` uniquement à un joueur donné en utilisant ``rpc_id(<id>, "exploded", bomb_owner)``. Ça n’a pas forcément de sens pour le cas d’une zone d’effet comme cette bombe, mais plutôt dans d’autres cas, comme des dégâts à une seule cible.

source: Exporting for dedicated servers
fr: Exportation pour les serveurs dédiés

source: Once you've made a multiplayer game, you may want to export it to run it on a dedicated server with no GPU available. See :ref:`doc_exporting_for_dedicated_servers` for more information.
fr: Une fois que vous avez créé un jeu multijoueur, vous pouvez l'exporter pour le faire tourner sur un serveur dédié sans GPU. Voir :ref:`doc_exporting_for_dedicated_servers` pour plus d'informations.

source: The code samples on this page aren't designed to run on a dedicated server. You'll have to modify them so the server isn't considered to be a player. You'll also have to modify the game starting mechanism so that the first player who joins can start the game.
fr: Les exemples de code sur cette page ne sont pas conçus pour fonctionner sur un serveur dédié. Vous devrez les modifier pour que le serveur ne soit pas considéré comme un joueur. Vous devrez également modifier le mécanisme de démarrage du jeu afin que le premier joueur qui se joint à la partie puisse démarrer la partie.
