Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/high_level_multiplayer.po
Languages: fr

source: High-level multiplayer
fr: Multijoueur de haut niveau

source: High-level vs low-level API
fr: API de haut niveau contre API de bas niveau

source: The following explains the differences of high- and low-level networking in Godot as well as some fundamentals. If you want to jump in head-first and add networking to your first nodes, skip to `Initializing the network`_ below. But make sure to read the rest later on!
fr: Ce qui suit explique les différences entre les API réseaux de haut et bas niveau dans Godot ainsi que certains principes fondamentaux. Si vous voulez plonger dans le vif du sujet et ajouter une prise en charge réseau à vos premiers nœuds, passez directement à `Initialisation du réseau`. Mais assurez-vous de lire le reste plus tard !

source: Godot always supported standard low-level networking via UDP, TCP and some higher level protocols such as SSL and HTTP. These protocols are flexible and can be used for almost anything. However, using them to synchronize game state manually can be a large amount of work. Sometimes that work can't be avoided or is worth it, for example when working with a custom server implementation on the backend. But in most cases, it's worthwhile to consider Godot's high-level networking API, which sacrifices some of the fine-grained control of low-level networking for greater ease of use.
fr: Godot a toujours soutenu les réseaux standard de bas niveau via UDP, TCP et certains protocoles de niveau supérieur tels que SSL et HTTP. Ces protocoles sont flexibles et peuvent être utilisés pour presque tout. Cependant, leur utilisation pour synchroniser manuellement l'état du jeu peut représenter une grande quantité de travail. Parfois, ce travail ne peut pas être évité ou en vaut la peine, par exemple lorsqu'on travaille avec une implémentation de serveur personnalisé sur le backend. Mais dans la plupart des cas, il est intéressant de considérer l'API de réseau de haut niveau de Godot, qui sacrifie une partie du contrôle fin du réseau de bas niveau pour une plus grande facilité d'utilisation.

source: This is due to the inherent limitations of the low-level protocols:
fr: Cela est dû aux limites inhérentes aux protocoles de bas niveau :

source: TCP ensures packets will always arrive reliably and in order, but latency is generally higher due to error correction. It's also quite a complex protocol because it understands what a "connection" is, and optimizes for goals that often don't suit applications like multiplayer games. Packets are buffered to be sent in larger batches, trading less per-packet overhead for higher latency. This can be useful for things like HTTP, but generally not for games. Some of this can be configured and disabled (e.g. by disabling "Nagle's algorithm" for the TCP connection).
fr: Le TCP garantit que les paquets arriveront toujours de manière fiable et en ordre, mais la latence est généralement plus élevée en raison de la correction des erreurs. C'est aussi un protocole assez complexe parce qu'il comprend ce qu'est une "connexion" et optimise pour des objectifs qui souvent ne conviennent pas à des applications comme les jeux multijoueurs. Les paquets sont mis en mémoire tampon pour être envoyés par lots plus importants, ce qui permet de réduire les coûts par paquet en échange d'augmenter la latence. Cela peut être utile pour des choses comme le HTTP, mais généralement pas pour les jeux. Certains de ces éléments peuvent être configurés et désactivés (par exemple en désactivant "l'algorithme de Nagle" pour la connexion TCP).

source: UDP is a simpler protocol, which only sends packets (and has no concept of a "connection"). No error correction makes it pretty quick (low latency), but packets may be lost along the way or received in the wrong order. Added to that, the MTU (maximum packet size) for UDP is generally low (only a few hundred bytes), so transmitting larger packets means splitting them, reorganizing them and retrying if a part fails.
fr: L'UDP est un protocole plus simple, qui n'envoie que des paquets (et n'a aucune notion de "connexion"). Aucune correction d'erreur permet d'obtenir un résultat rapide (faible latence), mais les paquets peuvent être perdus en cours de route ou reçus dans le mauvais ordre. De plus, la MTU (taille maximale des paquets) pour l'UDP est généralement faible (quelques centaines d'octets seulement), de sorte que la transmission de paquets plus volumineux implique de les diviser, de les réorganiser et de réessayer si une partie échoue.

source: In general, TCP can be thought of as reliable, ordered, and slow; UDP as unreliable, unordered and fast. Because of the large difference in performance, it often makes sense to re-build the parts of TCP wanted for games (optional reliability and packet order), while avoiding the unwanted parts (congestion/traffic control features, Nagle's algorithm, etc). Due to this, most game engines come with such an implementation, and Godot is no exception.
fr: En général, le TCP peut être considéré comme fiable, ordonné et lent ; l'UDP comme peu fiable, non ordonné et rapide. En raison de la grande différence de performances, il est souvent judicieux de reconstruire les parties de TCP souhaitées pour les jeux (fiabilité en option et ordre des paquets), tout en évitant les parties non souhaitées (fonctions de contrôle de la congestion/du trafic, algorithme de Nagle, etc.) De ce fait, la plupart des moteurs de jeu sont livrés avec une telle implémentation, et Godot ne fait pas exception.

source: In summary, you can use the low-level networking API for maximum control and implement everything on top of bare network protocols or use the high-level API based on :ref:`SceneTree <class_SceneTree>` that does most of the heavy lifting behind the scenes in a generally optimized way.
fr: En résumé, vous pouvez utiliser l'API réseau de bas niveau pour un contrôle maximal et implémenter le tout au-dessus des protocoles réseau nus ou utiliser l'API de haut niveau basée sur :ref:`SceneTree <class_SceneTree>` qui fait la plupart du gros du travail derrière la scène d'une manière généralement optimisée.

source: Most of Godot's supported platforms offer all or most of the mentioned high- and low-level networking features. As networking is always largely hardware and operating system dependent, however, some features may change or not be available on some target platforms. Most notably, the HTML5 platform currently only offers WebSocket support and lacks some of the higher level features as well as raw access to low-level protocols like TCP and UDP.
fr: La plupart des plateformes prises en charge par Godot offrent toutes ou la plupart des fonctionnalités de réseau de haut et de bas niveau mentionnées. Cependant, comme la mise en réseau dépend toujours largement du matériel et du système d'exploitation, certaines fonctionnalités peuvent changer ou ne pas être disponibles sur certaines plateformes cibles. Plus particulièrement, la plate-forme HTML5 n'offre actuellement que la prise en charge de WebSocket et ne dispose pas de certaines des fonctionnalités de haut niveau, ni d'un accès brut aux protocoles de bas niveau comme TCP et UDP.

source: More about TCP/IP, UDP, and networking: https://gafferongames.com/post/udp_vs_tcp/
fr: Pour en savoir plus sur le TCP/IP, l'UDP et le réseau : https://gafferongames.com/post/udp_vs_tcp/

source: Gaffer On Games has a lot of useful articles about networking in Games (`here <https://gafferongames.com/categories/game-networking/>`__), including the comprehensive `introduction to networking models in games <https://gafferongames.com/post/what_every_programmer_needs_to_know_about_game_networking/>`__.
fr: Gaffer On Games propose de nombreux articles utiles sur le réseautage dans les Jeux (`ici <https://gafferongames.com/categories/game-networking/>`__), notamment le très complet `introduction aux modèles de réseautage dans les jeux <https://gafferongames.com/post/what_every_programmer_needs_to_know_about_game_networking/>`__.

source: If you want to use your low-level networking library of choice instead of Godot's built-in networking, see here for an example: https://github.com/PerduGames/gdnet3
fr: Si vous souhaitez utiliser une bibliothèque réseau de bas niveau de votre choix au lieu du réseau intégré de Godot, voir ici un exemple : https://github.com/PerduGames/gdnet3

source: Adding networking to your game comes with some responsibility. It can make your application vulnerable if done wrong and may lead to cheats or exploits. It may even allow an attacker to compromise the machines your application runs on and use your servers to send spam, attack others or steal your users data if they play your game.
fr: Ajouter l'utilisation du réseau dans votre jeu implique une certaine responsabilité. Elle peut rendre votre applicationvulnérable si elle est mal faite et peut conduire à de la triche) ou à des exploitation de faille. Cela peut même permettre à un attaquant de compromettre les machines sur lesquelles votre application tourne et d'utiliser vos serveurs pour envoyer du spam, d'attaquer d'autres personnes ou de voler les données de vos utilisateurs s'ils jouent à votre jeu.

source: This is always the case when networking is involved and has nothing to do with Godot. You can of course experiment, but when you release a networked application, always take care of any possible security concerns.
fr: C'est toujours le cas lorsqu'il s'agit de mise en réseau et que cela n'a rien à voir avec Godot. Vous pouvez bien sûr faire des expériences, mais lorsque vous lancez une application en réseau, prenez toujours en compte les éventuels problèmes de sécurité.

source: Mid level abstraction
fr: Abstraction de niveau moyen

source: Before going into how we would like to synchronize a game across the network, it can be helpful to understand how the base network API for synchronization works.
fr: Avant d'expliquer comment nous aimerions synchroniser un jeu sur le réseau, il peut être utile de comprendre comment fonctionne l'API de synchronisation du réseau de base.

source: Godot uses a mid-level object :ref:`NetworkedMultiplayerPeer <class_NetworkedMultiplayerPeer>`. This object is not meant to be created directly, but is designed so that several C++ implementations can provide it.
fr: Godot utilise un objet de niveau intermédiaire :ref:`NetworkedMultiplayerPeer <class_NetworkedMultiplayerPeer>`. Cet objet n'est pas destiné à être créé directement, mais est conçu de manière à ce que plusieurs implémentations puissent le fournir.

source: This object extends from :ref:`PacketPeer <class_PacketPeer>`, so it inherits all the useful methods for serializing, sending and receiving data. On top of that, it adds methods to set a peer, transfer mode, etc. It also includes signals that will let you know when peers connect or disconnect.
fr: Cet objet s'étend de :ref:`PacketPeer <class_PacketPeer>`, il hérite donc de toutes les méthodes utiles pour sérialiser, envoyer et recevoir des données. En plus de cela, il ajoute des méthodes pour définir un pair, un mode de transfert, etc. Il comprend également des signaux qui vous permettront de savoir quand vos pairs se connectent ou se déconnectent.

source: This class interface can abstract most types of network layers, topologies and libraries. By default, Godot provides an implementation based on ENet (:ref:`NetworkedMultiplayerEnet <class_NetworkedMultiplayerENet>`), one based on WebRTC (:ref:`WebRTCMultiplayer <class_WebRTCMultiplayer>`), and one based on WebSocket (:ref:`WebSocketMultiplayerPeer <class_WebSocketMultiplayerPeer>`), but this could be used to implement mobile APIs (for ad hoc WiFi, Bluetooth) or custom device/console-specific networking APIs.
fr: Cette interface de classe peut abstraire la plupart des types de couches de réseau, de topologies et de bibliothèques. Par défaut, Godot fournit une implémentation basée sur ENet (:ref:`NetworkedMultiplayerEnet <class_NetworkedMultiplayerENet>`), une basée sur WebRTC (:ref:`WebRTCMultiplayer <class_WebRTCMultiplayer>`), et une basée sur WebSocket (:ref:`WebSocketMultiplayerPeer <class_WebSocketMultiplayerPeer>`), mais ceci pourrait être utilisé pour implémenter des API mobiles (pour le WiFi adhoc, Bluetooth) ou des API réseau spécifiques à un appareil ou une console.

source: For most common cases, using this object directly is discouraged, as Godot provides even higher level networking facilities. Yet it is made available in case a game has specific needs for a lower level API.
fr: Dans la plupart des cas, il est déconseillé d'utiliser directement cet objet, car Godot fournit des possibilités de mise en réseau de niveau encore plus élevé. Il est cependant mis à disposition au cas où un jeu aurait des besoins spécifiques pour une API de niveau inférieur.

source: Initializing the network
fr: Initialisation du réseau

source: The object that controls networking in Godot is the same one that controls everything tree-related: :ref:`SceneTree <class_SceneTree>`.
fr: L'objet qui contrôle le réseau dans Godot est le même qui contrôle tout ce qui concerne l'arbre de scène : :ref:`SceneTree <class_SceneTree>`.

source: To initialize high-level networking, the SceneTree must be provided a NetworkedMultiplayerPeer object.
fr: Pour initialiser le réseau de haut niveau, il faut fournir au SceneTree un objet NetworkedMultiplayerPeer.

source: To create that object, it first has to be initialized as a server or client.
fr: Pour créer cet objet, il doit d'abord être initialisé en tant que serveur ou client.

source: Initializing as a server, listening on the given port, with a given maximum number of peers:
fr: Initialisation en tant que serveur, écoute sur le port donné, avec un nombre maximum donné de pairs :

source: Initializing as a client, connecting to a given IP and port:
fr: S'initialiser en tant que client, se connecter à une IP et un port donnés :

source: Get the previously set network peer:
fr: Obtenez le pair de réseau précédemment défini :

source: Checking whether the tree is initialized as a server or client:
fr: Vérifier si l'arbre est initialisé en tant que serveur ou client :

source: Terminating the networking feature:
fr: Mettre fin à la fonction réseau :

source: (Although it may make sense to send a message first to let the other peers know you're going away instead of letting the connection close or timeout, depending on your game.)
fr: (Bien qu'il puisse être judicieux d'envoyer d'abord un message pour faire savoir aux autres pairs que vous partez, au lieu de laisser la connexion se fermer ou s'interrompre, selon votre jeu.)

source: Managing connections
fr: Gestion des connexions

source: Some games accept connections at any time, others during the lobby phase. Godot can be requested to no longer accept connections at any point (see ``set_refuse_new_network_connections(bool)`` and related methods on :ref:`SceneTree <class_SceneTree>`). To manage who connects, Godot provides the following signals in SceneTree:
fr: Certains jeux acceptent les connexions à tout moment, d'autres pendant la phase de lobby. On peut demander à Godot de ne plus accepter de connexions à tout moment (voir `set_refuse_new_network_connections(bool)`` et les méthodes associées dans :ref:`SceneTree <class_SceneTree>`). Pour gérer qui se connecte, Godot fournit les signaux suivants dans SceneTree :

source: Server and Clients:
fr: Serveur et clients :

source: The above signals are called on every peer connected to the server (including on the server) when a new peer connects or disconnects. Clients will connect with a unique ID greater than 1, while network peer ID 1 is always the server. Anything below 1 should be handled as invalid. You can retrieve the ID for the local system via :ref:`SceneTree.get_network_unique_id() <class_SceneTree_method_get_network_unique_id>`. These IDs will be useful mostly for lobby management and should generally be stored, as they identify connected peers and thus players. You can also use IDs to send messages only to certain peers.
fr: Les signaux ci-dessus sont appelés pour chaque pair connecté au serveur (y compris sur le serveur), quand un nouveau pair se connecte ou se déconnecte. Les clients se connectent avec un identifiant unique (ID) supérieur à 1, et l’identifiant 1 est toujours le serveur. Tous les ID inférieurs à 1 doivent être traités comme invalides. On peut récupérer l’ID pour le système local avec :ref:`SceneTree.get_network_unique_id() <class_SceneTree_method_get_network_unique_id>`. Ces ID sont surtout utiles pour la gestion des salons et devraient généralement être stockés car ils identifient les pairs connectés et donc les joueurs. On peut aussi utiliser les identifiants pour n’envoyer des messages qu’à certains pairs.

source: Again, all these functions are mainly useful for lobby management or for adding/removing players on the fly. For these tasks, the server clearly has to work as a server and you have to perform tasks manually such as sending a newly connected player information about other already connected players (e.g. their names, stats, etc).
fr: Encore une fois, toutes ces fonctions sont surtout utiles pour la gestion des salons, ou pour ajouter ou retirer des joueurs à la volée. Dans ces cas-là, le serveur doit clairement marcher comme un serveur, et il faut faire des manipulations à la main, comme envoyer aux joueurs qui se connectent des informations sur les joueurs déjà connectés (par exemple leurs noms, statistiques, etc.).

source: Lobbies can be implemented any way you want, but the most common way is to use a node with the same name across scenes in all peers. Generally, an autoloaded node/singleton is a great fit for this, to always have access to, e.g. "/root/lobby".
fr: Les salons peuvent être implémentés comme on le veut, mais la manière la plus courante est d’utiliser un nœud avec le même nom dans les scènes chez tous les pairs. En général, un nœud ou singleton auto-chargés convient très bien pour ça, pour avoir toujours accès, par exemple, à "/root/salon".

source: To communicate between peers, the easiest way is to use RPCs (remote procedure calls). This is implemented as a set of functions in :ref:`Node <class_Node>`:
fr: Pour communiquer entre pairs, le plus simple est d’utiliser des RPC (**remote procedure calls**, appels de procédures distantes). Ils sont implémentés sous la forme d’un ensemble de fonctions dans :ref:`Node <class_Node>` :

source: Synchronizing member variables is also possible:
fr: Il est aussi possible de synchroniser des variables membres :

source: Functions can be called in two fashions:
fr: Il y a deux manières d’appeler les fonctions :

source: Reliable: the function call will arrive no matter what, but may take longer because it will be re-transmitted in case of failure.
fr: Fiable : l’appel de fonction arrivera quoi qu’il arrive, mais prendra plus longtemps car il devra être transmis à nouveau en cas d’échec.

source: Unreliable: if the function call does not arrive, it will not be re-transmitted; but if it arrives, it will do it quickly.
fr: Non-fiable : si l’appel de fonction n’arrive pas, il ne sera pas retransmis ; mais s’il arrive, ce sera rapidement.

source: In most cases, reliable is desired. Unreliable is mostly useful when synchronizing object positions (sync must happen constantly, and if a packet is lost, it's not that bad because a new one will eventually arrive and it would likely be outdated because the object moved further in the meantime, even if it was resent reliably).
fr: Dans la plupart des cas, il vaut mieux choisir fiable. Non-fiable est surtout utile pour synchroniser des positions d’objets : la synchronisation doit se faire constamment, et si un paquet est perdu, ce n’est pas très grave car un autre arrivera tôt ou tard. Le premier ne serait sans doute plus à jour même s’il était renvoyé de manière fiable, car l’objet aurait bougé pendant ce temps.

source: There is also the ``get_rpc_sender_id`` function in ``SceneTree``, which can be used to check which peer (or peer ID) sent an RPC.
fr: Il y a aussi la fonction ``get_rpc_sender_id`` dans ``SceneTree`` qui peut être utilisée pour vérifier quel pair (ou ID de pair) a envoyé un RPC.

source: Back to lobby
fr: Retour au lobby

source: Let's get back to the lobby. Imagine that each player that connects to the server will tell everyone about it.
fr: Revenons au salon. Imaginons que chaque joueur qui se connecte au serveur prévienne tout le monde.

source: You might have already noticed something different, which is the usage of the ``remote`` keyword on the ``register_player`` function:
fr: Vous aurez peut-être déjà remarqué autre chose, l’usage du mot-clé ``remote`` sur la fonction ``register_player`` :

source: This keyword has two main uses. The first is to let Godot know that this function can be called from RPC. If no keywords are added, Godot will block any attempts to call functions for security. This makes security work a lot easier (so a client can't call a function to delete a file on another client's system).
fr: Ce mot-clé a deux utilisations principales. La première est de faire savoir à Godot que la fonction peut être appelée depuis RPC. Si aucun mot-clé n’est ajouté, Godot bloque par sécurité toutes les tentatives d’appeler des fonctions. Cela facilite beaucoup la sécurité (pour qu’un client ne puisse pas appeler une fonction qui supprime un fichier sur le système d’un autre client).

source: The second use is to specify how the function will be called via RPC. There are four different keywords:
fr: La seconde utilisation est de spécifier comment la fonction sera appelée par RPC. Il y a quatre mots-clés différents :

source: The ``remote`` keyword means that the ``rpc()`` call will go via network and execute remotely.
fr: Le mot-clé ``remote`` signifie que l’appel ``rpc()`` traversera le réseau et sera exécuté à distance.

source: The ``remotesync`` keyword means that the ``rpc()`` call will go via network and execute remotely, but will also execute locally (do a normal function call).
fr: Le mot-clé ``remotesync`` signifie que l’appel ``rpc()`` traversera le réseau et sera exécuté à distance, mais qu’il sera aussi exécuté localement (et fera donc un appel de fonction normal).

source: The others will be explained further down. Note that you could also use the ``get_rpc_sender_id`` function on ``SceneTree`` to check which peer actually made the RPC call to ``register_player``.
fr: Les autres seront expliqués plus loin. Notez qu’on peut aussi utiliser la fonction ``get_rpc_sender_id`` sur ``SceneTree`` pour vérifier quel pair a fait l’appel RPC à ``register_player``.

source: With this, lobby management should be more or less explained. Once you have your game going, you will most likely want to add some extra security to make sure clients don't do anything funny (just validate the info they send from time to time, or before game start). For the sake of simplicity and because each game will share different information, this is not shown here.
fr: Avec tout ça, la gestion de salons est plus ou moins expliquée. Une fois que le jeu tournera, il faudra sûrement ajouter de la sécurité en plus pour s’assurer que les clients ne fassent rien de bizarre (simplement valider les infos qu’ils envoient de temps en temps, ou avant que la partie ne commence). Pour faire simple et parce que chaque jeu partagera des informations différentes, nous ne le montrerons pas ici.

source: Starting the game
fr: Démarrage du jeu
