Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/http_request_class.po
Languages: es, fr

source: Making HTTP requests
es: Haciendo solicitudes HTTP
fr: Faire des requêtes HTTP

source: The :ref:`HTTPRequest <class_HTTPRequest>` node is the easiest way to make HTTP requests in Godot. It is backed by the more low-level :ref:`HTTPClient <class_HTTPClient>`, for which a tutorial is available :ref:`here <doc_http_client_class>`.
es: El nodo :ref:`HTTPRequest <class_HTTPRequest>` es la forma más fácil de realizar solicitudes HTTP en Godot. Está respaldado por el :ref:`HTTPClient <class_HTTPClient>` de más bajo nivel, para el cual hay un tutorial disponible :ref:`aquí <doc_http_client_class>`.
fr: Le nœud :ref:`HTTPRequest <class_HTTPRequest>` est le moyen le plus simple de faire des requêtes HTTP dans Godot. Il est soutenu par le nœud de plus bas niveau :ref:`HTTPClient <class_HTTPClient>`, pour lequel un tutoriel est disponible :ref:`ici <doc_http_client_class>`.

source: For the sake of this example, we will create a simple UI with a button, that when pressed will start the HTTP request to the specified URL.
es: Por el bien de este ejemplo, crearemos una interfaz de usuario simple con un botón, que cuando se presione iniciará la solicitud HTTP a la URL especificada.
fr: Pour les besoins de cet exemple, nous allons créer une interface utilisateur simple avec un bouton qui, une fois pressé, lancera la requête HTTP vers l'URL spécifiée.

source: Preparing scene
es: Preparando la escena
fr: Préparer la scène

source: Create a new empty scene, add a CanvasLayer as the root node and add a script to it. Then add two child nodes to it: a Button and an HTTPRequest node. You will need to connect the following signals to the CanvasLayer script:
es: Crea una nueva escena vacía, añade un CanvasLayer como nodo raíz y añádele un script. Luego, añádele dos nodos hijos: un botón y un nodo HTTPRequest. Deberás conectar las siguientes señales al script de CanvasLayer:
fr: Créez une nouvelle scène vide, ajoutez un CanvasLayer comme nœud racine et ajoutez-y un script. Ajoutez ensuite deux nœuds enfants : un nœud Button et un nœud HTTPRequest. Vous devrez connecter les signaux suivants au script CanvasLayer :

source: Button.pressed: When the button is pressed, we will start the request.
es: Button.pressed: Cuando se presione el botón, comenzaremos la solicitud.
fr: Button.pressed : Lorsque le bouton est pressé, nous lançons la requête.

source: HTTPRequest.request_completed: When the request is completed, we will get the requested data as an argument.
es: HTTPRequest.request_completed: Cuando se complete la solicitud, obtendremos los datos solicitados como un argumento.
fr: HTTPRequest.request_completed : Lorsque la requête sera terminée, nous obtiendrons les données demandées comme argument.

source: Scripting
fr: Les scripts

source: Below is all the code we need to make it work. The URL points to an online API mocker; it returns a pre-defined JSON string, which we will then parse to get access to the data.
es: Abajo se muestra todo el código que necesitamos para que funcione. La URL apunta a una API mocker en línea; devuelve una cadena JSON predefinida, que luego analizaremos para obtener acceso a los datos.
fr: Vous trouverez ci-dessous tout le code dont nous avons besoin pour le faire fonctionner. L'URL pointe vers une simulation d' API en ligne ; elle renvoie une chaîne JSON prédéfinie, que nous allons ensuite analyser pour avoir accès aux données.

source: With this, you should see ``(hello:world)`` printed on the console; hello being a key, and world being a value, both of them strings.
es: Con esto, deberías ver ``(hello:world)`` impreso en la consola; hello es una clave, y world es un valor, ambas son cadenas.
fr: Avec cela, vous devriez voir ``(hello:world)`` imprimé sur la console ; hello étant une clé, et world étant une valeur, toutes deux des chaînes.

source: For more information on parsing JSON, see the class references for :ref:`JSON <class_JSON>` and :ref:`JSONParseResult <class_JSONParseResult>`.
es: Para obtener más información sobre el análisis de JSON, mira las referencias de clase para :ref:`JSON <class_JSON>` y :ref:`JSONParseResult <class_JSONParseResult>`.
fr: Pour plus d'informations sur l'analyse de JSON, voir les références des classes :ref:`JSON <class_JSON>` et :ref:`JSONParseResult <class_JSONParseResult>`.

source: Note that you may want to check whether the ``result`` equals ``RESULT_SUCCESS`` and whether a JSON parsing error occurred, see the JSON class reference and :ref:`HTTPRequest <class_HTTPRequest>` for more.
es: Nota que es posible que quieras comprobar si el ``resultado`` es igual a ``RESULT_SUCCESS`` y si se produjo un error de análisis JSON, mira la referencia de clase de JSON y :ref:`HTTPRequest <class_HTTPRequest>` para obtener más información.
fr: Notez que vous pouvez vérifier si le ``result`` est égal à ``RESULT_SUCCESS`` et si une erreur d'analyse JSON s'est produite, voir la référence de la classe JSON et :ref:`HTTPRequest <class_HTTPRequest>` pour en savoir plus.

source: Of course, you can also set custom HTTP headers. These are given as a string array, with each string containing a header in the format ``"header: value"``. For example, to set a custom user agent (the HTTP ``user-agent`` header) you could use the following:
es: Por supuesto, también puedes establecer encabezados HTTP personalizados. Estos se dan como un array de cadenas, con cada cadena conteniendo un encabezado en el formato ``"encabezado:valor"``. Por ejemplo, para establecer un agente de usuario personalizado (el encabezado de ``agente-usuario`` de HTTP) puedes usar lo siguiente:
fr: Bien entendu, vous pouvez également définir des en-têtes HTTP personnalisés. Elles sont données sous forme de tableau de chaînes, chaque chaîne contenant un en-tête au format ``"header : value"``. Par exemple, pour définir un agent utilisateur personnalisé (l'en-tête HTTP ``user-agent``), vous pouvez utiliser ce qui suit :

source: Please note that, for SSL/TLS encryption and thus HTTPS URLs to work, you may need to take some steps as described :ref:`here <doc_ssl_certificates>`.
es: Nota por favor, que para que el cifrado SSL/TLS y, por tanto, las URL HTTPS funcionen, es posible que necesites realizar algunos pasos, tal como se describe :ref:`aquí <doc_ssl_certificates>`.
fr: Veuillez noter que, pour que le cryptage SSL/TLS et donc pour que les URL HTTPS fonctionnent, vous devrez peut-être prendre certaines mesures comme décrit :ref:`ici <doc_ssl_certificates>`.

source: Also, when calling APIs using authorization, be aware that someone might analyse and decompile your released application and thus may gain access to any embedded authorization information like tokens, usernames or passwords. That means it is usually not a good idea to embed things such as database access credentials inside your game. Avoid providing information useful to an attacker whenever possible.
es: Además, cuando llames APIs usando autorización, sé consciente que alguien puede analizar y descompilar tu aplicación lanzada y, por tanto, puede obtener acceso a cualquier información de autorización incrustada como tokens, nombres de usuario o contraseñas. Eso significa que generalmente no es una buena idea incluir cosas como las credenciales de acceso a la base de datos dentro de tu juego. Evita proporcionar información útil para un atacante siempre que sea posible.
fr: De plus, lorsque vous appelez des API en utilisant une autorisation, sachez que quelqu'un pourrait analyser et décompiler votre application publiée et ainsi avoir accès à toute information d'autorisation intégrée comme des jetons, des noms d'utilisateur ou des mots de passe. Cela signifie que ce n'est généralement pas une bonne idée d'intégrer dans votre jeu des éléments tels que les identifiants d'accès aux bases de données. Évitez autant que possible de fournir des informations utiles à un agresseur.

source: Sending data to server
es: Enviando datos al servidor
fr: Envoi de données au serveur

source: Until now, we have limited ourselves to requesting data from a server. But what if you need to send data to the server? Here is a common way of doing it:
es: Hasta ahora nos hemos limitado a solicitar datos de un servidor. Pero, ¿Qué si necesitas enviar datos al servidor? Aquí hay una forma común de hacerlo:
fr: Jusqu'à maintenant, nous nous sommes limités à demander des données à un serveur. Mais comment faire si vous avez besoin d'envoyer des données au serveur ? Voici une manière courante de le faire :

source: Keep in mind that you have to wait for a request to finish before sending another one. Making multiple request at once requires you to have one node per request. A common strategy is to create and delete HTTPRequest nodes at runtime as necessary.
fr: Rappelez-vous qu’il faut attendre qu’une requête finisse avant d’en envoyer une autre. Pour faire plusieurs requête à la fois, il faut avoir un nœud par requête. Une stratégie courante est de créer et supprimer des nœuds HTTPRequest à l’exécution, selon les besoins.
