Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/webrtc.po
Languages: fr

source: One of Godot's great features is its ability to export to the HTML5/WebAssembly platform, allowing your game to run directly in the browser when a user visit your webpage.
fr: L'une des grandes caractéristiques de Godot est sa capacité d'exportation vers la plateforme HTML5/WebAssembly, permettant à votre jeu de s'exécuter directement dans le navigateur lorsqu'un utilisateur visite votre page web.

source: This is a great opportunity for both demos and full games, but used to come with some limitations. In the area of networking, browsers used to support only HTTPRequests until recently, when first WebSocket and then WebRTC were proposed as standards.
fr: Il s'agit d'une excellente opportunité pour les démos et les jeux complets, mais elle était auparavant assortie de certaines limitations. Dans le domaine de la mise en réseau, les navigateurs ne prenaient en charge que les requêtes HTTPR jusqu'à récemment, lorsque WebSocket puis WebRTC ont été proposés comme normes.

source: When the WebSocket protocol was standardized in December 2011, it allowed browsers to create stable and bidirectional connections to a WebSocket server. The protocol is quite simple, but a very powerful tool to send push notifications to browsers, and has been used to implement chats, turn-based games, etc.
fr: Lorsque le protocole WebSocket a été normalisé en décembre 2011, il a permis aux navigateurs de créer des connexions stables et bidirectionnelles à un serveur WebSocket. Le protocole est assez simple, mais c'est un outil très puissant pour envoyer des notifications "push" aux navigateurs, et il a été utilisé pour mettre en place des chats, des jeux au tour par tour, etc.

source: WebSockets, though, still use a TCP connection, which is good for reliability but not for latency, so not good for real-time applications like VoIP and fast-paced games.
fr: Les WebSockets, cependant, utilisent toujours une connexion TCP, ce qui est bon pour la fiabilité mais pas pour la latence, donc pas bon pour les applications en temps réel comme la VoIP et les jeux rapides.

source: For this reason, since 2010, Google started working on a new technology called WebRTC, which later on, in 2017, became a W3C candidate recommendation. WebRTC is a much more complex set of specifications, and relies on many other technologies behind the scenes (ICE, DTLS, SDP) to provide fast, real-time, and secure communication between two peers.
fr: C'est pourquoi, depuis 2010, Google a commencé à travailler sur une nouvelle technologie appelée WebRTC, qui plus tard, en 2017, est devenue une recommandation candidate du W3C. Le WebRTC est un ensemble de spécifications beaucoup plus complexe, et s'appuie sur de nombreuses autres technologies en coulisse (ICE, DTLS, SDP) pour assurer une communication rapide, en temps réel et sécurisée entre deux pairs.

source: The idea is to find the fastest route between the two peers and establish whenever possible a direct communication (i.e. try to avoid a relaying server).
fr: L'idée est de trouver le chemin le plus rapide entre les deux pairs et d'établir, dans la mesure du possible, une communication directe (c'est-à-dire essayer d'éviter un serveur relais).

source: However, this comes at a price, which is that some media information must be exchanged between the two peers before the communication can start (in the form of Session Description Protocol - SDP strings). This usually takes the form of a so-called WebRTC Signaling Server.
fr: Cependant, cela a un prix, c'est-à-dire que certaines informations sur les médias doivent être échangées entre les deux pairs avant que la communication puisse commencer (sous la forme du Session Description Protocol - SDP chaînes). Cela prend généralement la forme d'un Signaling Server WebRTC.

source: Peers connect to a signaling server (for example a WebSocket server) and send their media information. The server then relays this information to other peers, allowing them to establish the desired direct communication. Once this step is done, peers can disconnect from the signaling server and keep the direct Peer-to-Peer (P2P) connection open.
fr: Les pairs se connectent à un serveur de signalisation (par exemple un serveur WebSocket) et envoient leurs informations média. Le serveur relaie ensuite ces informations à d'autres pairs, leur permettant d'établir la communication directe souhaitée. Une fois cette étape franchie, les pairs peuvent se déconnecter du serveur de signalisation et garder la connexion directe de poste à poste (P2P) ouverte.

source: Using WebRTC in Godot
fr: Utilisation de WebRTC dans Godot

source: WebRTC is implemented in Godot via two main classes :ref:`WebRTCPeerConnection <class_WebRTCPeerConnection>` and :ref:`WebRTCDataChannel <class_WebRTCDataChannel>`, plus the multiplayer API implementation :ref:`WebRTCMultiplayer <class_WebRTCMultiplayer>`. See section on :ref:`high-level multiplayer <doc_high_level_multiplayer>` for more details.
fr: WebRTC est implémenté dans Godot via deux classes principales :ref:`WebRTCPeerConnection <class_WebRTCPeerConnection>` et :ref:`WebRTCDataChannel <class_WebRTCDataChannel>`, plus l'implémentation de l'API multijoueur :ref:`WebRTCMultiplayer <class_WebRTCMultiplayer>`. Voir la section :ref:`high-level multiplayer <doc_high_level_multiplayer>` pour plus de détails.

source: These classes are available automatically in HTML5, but **require an external GDNative plugin on native (non-HTML5) platforms**. Check out the `webrtc-native plugin repository <https://github.com/godotengine/webrtc-native>`__ for instructions and to get the latest `release <https://github.com/godotengine/webrtc-native/releases>`__.
fr: Ces classes sont disponibles automatiquement en HTML5, mais **nécessitent un plugin GDNative externe sur les plateformes natives (non-HTML5)**. Consultez le dépôt de plugins `webrtc-native plugin repository <https://github.com/godotengine/webrtc-native>`__ pour obtenir des instructions et la dernière `version <https://github.com/godotengine/webrtc-native/releases>`__.

source: Minimal connection example
fr: Exemple minimal de connexion

source: This example will show you how to create a WebRTC connection between two peers in the same application. This is not very useful in real life, but will give you a good overview of how a WebRTC connection is set up.
fr: Cet exemple vous montrera comment créer une connexion WebRTC entre deux pairs dans la même application. Ce n'est pas très utile dans la vie réelle, mais cela vous donnera un bon aperçu de la manière dont une connexion WebRTC est établie.

source: This will print:
fr: Ceci s'affichera :

source: Local signaling example
fr: Exemple de signalisation locale

source: This example expands on the previous one, separating the peers in two different scenes, and using a :ref:`singleton <doc_singletons_autoload>` as a signaling server.
fr: Cet exemple développe le précédent, en séparant les pairs dans deux scènes différentes, et en utilisant un :ref:`singleton <doc_singletons_autoload>` comme serveur de signalisation.

source: And now for the local signaling server:
fr: Et maintenant, le serveur de signalisation local :

source: This local signaling server is supposed to be used as a :ref:`singleton <doc_singletons_autoload>` to connect two peers in the same scene.
fr: Ce serveur de signalisation local est censé être utilisé comme un :ref:`singleton <doc_singletons_autoload>` pour connecter deux pairs dans la même scène.

source: Then you can use it like this:
fr: Alors vous pouvez l'utiliser comme ça :

source: This will print something similar to this:
fr: Cela va imprimer quelque chose de similaire à ceci :

source: Remote signaling with WebSocket
fr: Signalisation à distance avec WebSocket

source: A more advanced demo using WebSocket for signaling peers and :ref:`WebRTCMultiplayer <class_WebRTCMultiplayer>` is available in the `godot demo projects <https://github.com/godotengine/godot-demo-projects>`_ under `networking/webrtc_signaling`.
fr: Une démo plus avancée utilisant WebSocket pour la signalisation des pairs et :ref:`WebRTCMultiplayer <class_WebRTCMultiplayer>` est disponible dans les projets `godot demo projects <https://github.com/godotengine/godot-demo-projects>`_ sous `networing/webrtc_signaling`.
