Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/websocket.po
Languages: de, fr

source: HTML5 and WebSocket
de: HTML5 und WebSocket
fr: HTML5 et WebSocket

source: The WebSocket protocol was standardized in 2011 with the original goal of allowing browsers to create stable and bidirectional connections with a server. Before that, browsers used to only support HTTPRequests, which is not well-suited for bidirectional communication.
de: Das WebSocket-Protokoll wurde 2011 mit dem ursprünglichen Ziel standardisiert, dass Browser stabile und bidirektionale Verbindungen mit einem Server herstellen können. Zuvor unterstützten Browser nur HTTPRequests, was für die bidirektionale Kommunikation nicht gut geeignet ist.
fr: Le protocole WebSocket a été normalisé en 2011 dans le but initial de permettre aux navigateurs de créer des connexions stables et bidirectionnelles avec un serveur. Avant cela, les navigateurs ne prenaient en charge que HTTPRequests, ce qui n'est pas bien adapté à la communication bidirectionnelle.

source: The protocol is quite simple, message based, and a very powerful tool to send push notifications to browsers, and has been used to implement chats, turn-based games, etc. It still uses a TCP connection, which is good for reliability but not for latency, so not good for real-time applications like VoIP and fast-paced games (see :ref:`WebRTC <doc_webrtc>` for those use cases).
de: Das Protokoll ist recht einfach, nachrichtenbasiert und ein sehr leistungsfähiges Tool zum Senden von Push-Benachrichtigungen an Browser. Es wurde zum Implementieren von Chats, rundenbasierten Spielen usw. verwendet. Es verwendet weiterhin eine TCP-Verbindung, die für die Zuverlässigkeit gut ist, jedoch nicht Die Latenz ist also nicht gut für Echtzeitanwendungen wie VoIP und schnelle Spiele (siehe :ref:`WebRTC <doc_webrtc>` für diese Anwendungsfälle).
fr: Le protocole est assez simple, basé sur des messages, et constitue un outil très puissant pour envoyer des notifications "push" aux navigateurs. Il a été utilisé pour mettre en place des chats, des jeux au tour par tour, etc. Il utilise toujours une connexion TCP, ce qui est bon pour la fiabilité mais pas pour la latence, donc pas bon pour les applications en temps réel comme la VoIP et les jeux rapides (voir :ref:`WebRTC <doc_webrtc>` pour ces cas d'utilisation).

source: Due to its simplicity, its wide compatibility, and being easier to use than a raw TCP connection, WebSocket soon started to spread outside the browsers, in native applications as a mean to communicate with network servers.
de: Aufgrund seiner Einfachheit, seiner breiten Kompatibilität und seiner einfacheren Verwendung als eine rohe TCP-Verbindung verbreitete sich WebSocket bald außerhalb der Browser in nativen Anwendungen, um mit Netzwerkservern zu kommunizieren.
fr: En raison de sa simplicité, de sa grande compatibilité et de sa facilité d'utilisation par rapport à une connexion TCP brute, WebSocket a rapidement commencé à se répandre en dehors des navigateurs, dans les applications natives, comme moyen de communication avec les serveurs réseau.

source: Godot supports WebSocket in both native and HTML5 exports.
de: Godot unterstützt WebSocket sowohl beim nativen als auch beim HTML5-Export.
fr: Godot supporte WebSocket en natif et en exportation HTML5.

source: Using WebSocket in Godot
de: Verwenden von WebSocket in Godot
fr: Utilisation de WebSocket dans Godot

source: WebSocket is implemented in Godot via three main classes :ref:`WebSocketClient <class_WebSocketClient>`, :ref:`WebSocketServer <class_WebSocketServer>`, and :ref:`WebSocketPeer <class_WebSocketPeer>`. The WebSocket implementation is compatible with the High Level Multiplayer. See section on :ref:`high-level multiplayer <doc_high_level_multiplayer>` for more details.
de: WebSocket wird in Godot über drei Hauptklassen implementiert :ref:`WebSocketClient <class_WebSocketClient>` , :ref:`WebSocketServer <class_WebSocketServer>` und :ref:`WebSocketPeer <class_WebSocketPeer>`. Die WebSocket-Implementierung ist mit dem High Level Multiplayer kompatibel. Weitere Informationen finden Sie im Abschnitt über :ref:`High-Level-Multiplayer <doc_high_level_multiplayer>`.
fr: WebSocket est implémenté dans Godot via trois classes principales :ref:`WebSocketClient <classe_WebSocketClient>`, :ref:`WebSocketServer <classe_WebSocketServer>`, et :ref:`WebSocketPeer <classe_WebSocketPeer>`. La mise en œuvre de WebSocket est compatible avec le multijoueur de haut niveau. Voir la section :ref:`high-level multiplayer <doc_high_level_multiplayer>` pour plus de détails.

source: Minimal client example
de: minimales Client Beispiel
fr: Exemple de client minimal

source: This example will show you how to create a WebSocket connection to a remote server, and how to send and receive data.
de: In diesem Beispiel wird gezeigt, wie Sie eine WebSocket-Verbindung zu einem Remoteserver herstellen und Daten senden und empfangen.
fr: Cet exemple vous montrera comment créer une connexion WebSocket à un serveur distant, et comment envoyer et recevoir des données.

source: This will print:
de: Dies zeigt:
fr: Ceci s'affichera :

source: Minimal server example
de: kleines Server Beispiel
fr: Exemple de serveur minimal

source: This example will show you how to create a WebSocket server that listen for remote connections, and how to send and receive data.
de: In diesem Beispiel wird gezeigt, wie Sie einen WebSocket-Server erstellen, der auf Remoteverbindungen wartet, und wie Sie Daten senden und empfangen.
fr: Cet exemple vous montrera comment créer un serveur WebSocket qui écoute les connexions distante, et comment envoyer et recevoir des données.

source: This will print (when a client connects) something similar to this:
de: Dadurch wird (wenn ein Client eine Verbindung herstellt) etwas Ähnliches wie hier gedruckt:
fr: Cela imprimera (lorsqu'un client se connecte) quelque chose de similaire à ceci :

source: Advanced chat demo
de: fortgeschrittenes Chat Demo
fr: Démonstration de chat avancée

source: A more advanced chat demo which optionally uses the multiplayer mid-level abstraction and a high level multiplayer demo are available in the `godot demo projects <https://github.com/godotengine/godot-demo-projects>`_ under `networking/websocket_chat` and `networking/websocket_multiplayer`.
de: Eine erweiterte Chat-Demo, die optional die Multiplayer-Mid-Level-Abstraktion und eine High-Level-Multiplayer-Demo verwendet, ist in den `godot-Demo-Projekten <https://github.com/godotengine/godot-demo-projects>`_ unter `Networking/websocket_chat` und `networking/websocket_multiplayer` verfügbar.
fr: Une démo de chat plus avancée qui utilise optionnellement l'abstraction multijoueur de niveau moyen et une démo multijoueur de haut niveau sont disponibles dans les projets de démonstration `godot demo projects <https://github.com/godotengine/godot-demo-projects>`_ sous `networing/websocket_chat` et `networing/websocket_multiplayer`.
