Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/command_line_tutorial.po
Languages: cs, fr, ja, ko, pl, ru, uk, zh_cn, zh_tw

source: Command line tutorial
cs: Kurz příkazového řádku
fr: Tutoriel de ligne de commande
ja: コマンドラインチュートリアル
ko: 명령줄(Command line) 튜토리얼
pl: Samouczek wiersza poleceń
ru: Руководство по командной строке
uk: Використання командного рядка
zh_cn: 命令行教程
zh_tw: 命令行教學

source: Some developers like using the command line extensively. Godot is designed to be friendly to them, so here are the steps for working entirely from the command line. Given the engine relies on almost no external libraries, initialization times are pretty fast, making it suitable for this workflow.
cs: Někteří vývojáři rádi často používají příkazový řádek . Godot je navržen tak, aby jim vyhovoval, a proto zde uvádíme postup pro práci výhradně z příkazového řádku. Vzhledem k tomu, že engine nespoléhá téměř na žádné externí knihovny, jsou inicializační časy poměrně rychlé, takže je pro tento pracovní postup vhodný.
fr: Certains développeurs aiment beaucoup utiliser la ligne de commande. Godot est conçu pour leur être agréable, alors voici les étapes pour travailler entièrement à partir de la ligne de commande. Étant donné que le moteur ne nécessite que peu ou pas de bibliothèques externes, les temps d’initialisation sont assez rapides, ce qui le rend adapté à cette méthode de travail.
ja: 一部の開発者は、コマンドラインを広範囲に使用することを好みます。Godotは使いやすく設計されているので、ここでは完全にコマンドラインから作業するための手順を説明します。エンジンが外部ライブラリーにほとんど依存しないことを考えると、初期化時間は非常に速く、このワークフローに適しています。
ko: 일부 개발자들은 명령줄을 광범위하게 사용하는 것을 좋아합니다. Godot는 그들에게 친절하게 설계되었고, 명령줄에서 완전히 작업하는 순서가 있습니다. 엔진은 외부 라이브러리에 거의 의존하지 않아서, 초기화 시간이 매우 빠르고, 이 워크플로에 적합하게 만듭니다.
ru: Некоторым разработчикам нравится широко использовать командную строку. Godot разработан для того, чтобы быть дружелюбным к ним, поэтому здесь приведены шаги для работы полностью из командной строки. Поскольку механизм практически не опирается на внешние библиотеки, время инициализации довольно быстрое, что делает его подходящим для данного рабочего процесса.
uk: Деякі розробники люблять широко використовувати командний рядок. Godot розроблений так, щоб бути дружелюбним до них, тому ось кроки для роботи виключно з командного рядка. З огляду на те, що движок майже не має зовнішніх бібліотек, час ініціалізації досить швидкий, що робить його придатним для цього робочого процесу.
zh_cn: 一些开发人员喜欢广泛使用命令行。Godot被设计为对他们友好，所以这里是完全用命令行工作的步骤。由于引擎几乎不依赖外部库，因此初始化时间非常快，使其适合此工作流程。
zh_tw: 有一些開發者喜歡到處使用命令行。Godot 設計成對這些開發者友善，下面列舉了所有讓你完全在命令行中作業的步驟。由於引擎幾乎不以來外部函式庫，所以啟動時間非常快速，便讓 Godot 也很適合在這種工作流程中使用。

source: Command line reference
cs: Reference pro příkazový řádek
fr: Référence de ligne de commande
ja: コマンドライン リファレンス
ko: 명령줄 참조
uk: Команди командного рядка
zh_cn: 命令行参考
zh_tw: 命令列參照說明

source: **General options**
cs: **Obecné možnosti**
fr: **Options générales**
ja: **一般的なオプション**
ko: **일반적인 설정**
ru: **Основные настройки**
uk: **Загальні команди**
zh_cn: **常规选项**
zh_tw: **通用選項**

source: Command
cs: Příkaz
fr: Commande
ja: コマンド
ko: 명령
ru: Команда
uk: Команда
zh_cn: 命令
zh_tw: 指令

source: Description
cs: Popis
ja: 説明
ko: 설명
ru: Описание
uk: Опис
zh_cn: 描述
zh_tw: 說明

source: Display the list of command line options.
cs: Zobrazí seznam možností příkazového řádku.
fr: Affiche la liste des options de ligne de commande.
ja: コマンド ライン オプションの一覧を表示します。
ko: 명령줄 설정 목록을 표시합니다.
ru: Отобразить список опций командной строки.
uk: Виводить список команд командного рядка.
zh_cn: 显示命令行选项列表。
zh_tw: 顯示所有可用的命令列選項。

source: Display the version string.
cs: Zobrazí řetězec verze.
fr: Afficher la chaîne de caractère de version.
ja: バージョン文字列を表示します。
ko: 버전 문자열을 표시합니다.
ru: Показать версию строки.
uk: Виводить рядок версії.
zh_cn: 显示版本信息。
zh_tw: 顯示版本資訊。

source: Use verbose stdout mode.
cs: Použijte podrobný režim stdout.
fr: Utilise le mode verbeux pour la sortie standard (stdout).
ja: 詳細な標準出力モードを使用します。
ko: Verbose 표준 출력 모드를 사용합니다.
ru: Использовать подробный режим stdout.
uk: Використовує детальний режим stdout.
zh_cn: 使用哆嗦输出模式。
zh_tw: 使用詳細標準輸出 (Stdout) 模式。

source: Quiet mode, silences stdout messages. Errors are still displayed.
cs: Tichý režim, umlčí zprávy stdout. Chyby se stále zobrazují.
fr: Mode silencieux qui désactive les messages en console. Les erreurs sont tout de même affichées.
ja: 静かなモード、標準出力メッセージを出力しません。エラーは引き続き表示されます。
ko: 조용한 모드. 표준 출력 메시지를 내지 않습니다. 오류는 계속 표시됩니다.
ru: Тихий режим, заглушает сообщения stdout. Ошибки по-прежнему отображаются.
uk: Тихий режим, приховує повідомлення stdout. Помилки все ще відображаються.
zh_cn: 安静模式，静默输出的信息。但错误仍然会显示。
zh_tw: 靜默模式，不輸出任何標準輸出 (Stdout) 訊息。仍會顯示錯誤。

source: **Run options**
cs: **Možnosti spuštění**
fr: **Options d'exécution**
ja: **実行オプション**
ko: **실행 설정**
ru: **Параметры запуска**
uk: **Команди запуску**
zh_cn: **运行选项**
zh_tw: **執行選項**

source: Start the editor instead of running the scene (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
cs: Spustí editor místo spuštění scény (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` musí být povoleno).
fr: Démarre l'éditeur au lieu de lancer la scène (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` doit être activé).
ja: シーンを実行する代わりにエディタを起動します(:ref:`tools <doc_introduction_to_the_buildsystem_tools>` を有効にする必要があります)。
ko: 씬을 실행하는 대신 편집기를 시작합니다 (:ref:`tools <doc_introduction_to_the_buildsystem_tools>`\ 이 켜져있어야 합니다).
uk: Запускає редактор замість запуску сцени (:ref:`інструменти <doc_introduction_to_the_buildsystem_tools>` повинні бути включені).
zh_cn: 启动编辑器而不是运行场景 (:ref:`工具 <doc_introduction_to_the_buildsystem_tools>` 必须处于开启状态)。
zh_tw: 開啟編輯器而非執行場景（必須啟用 :ref:`工具 <doc_introduction_to_the_buildsystem_tools>` ）。

source: Start the project manager, even if a project is auto-detected (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
cs: Spustí správce projektů, i když je projekt automaticky detekován (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` musí být povoleno).
fr: Démarre le gestionnaire de projets, même si un projet est détecté automatiquement (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` doit être activé).
ja: プロジェクトが自動検出された場合でも、プロジェクトマネージャを起動します(:ref:`tools <doc_introduction_to_the_buildsystem_tools>` を有効にする必要があります)。
ko: 프로젝트가 자동으로 감지되어도, 프로젝트 매니저를 먼저 시작합니다. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>`\ 이 켜져 있어야 합니다).
ru: Запустит менеджер проектов, даже если проект определен автоматически (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` должнен быть включен).
uk: Запускає керівник проєктів, навіть якщо проєкт виявлено автоматично (:ref:`інструменти <doc_introduction_to_the_buildsystem_tools>` повинні бути включені).
zh_cn: 启动项目管理器，即使一个项目已经被自动检测到 (:ref:`工具<doc_introduction_to_the_buildsystem_tools>` 必须处于开启状态)。
zh_tw: 開啟專案管理員，即使已自動偵測到專案（必須啟用 :ref:`工具 <doc_introduction_to_the_buildsystem_tools>` ）。

source: Quit after the first iteration.
cs: Konec po první iteraci.
fr: Quitter après la première itération.
ja: 最初のイテレーションの後に終了します。
ko: 첫 반복 이후에 종료합니다.
ru: Выйти после первой итерации.
uk: Вийти після першої ітерації.
zh_cn: 第一次迭代后退出。
zh_tw: 首次迭代後退出。

source: Use a specific locale (<locale> being a two-letter code). See :ref:`doc_locales` for more details.
cs: Použijte konkrétní locale (<locale> je dvoupísmenný kód). Další podrobnosti viz :ref:`doc_locales`.
fr: Utiliser un paramètre régional spécifique (<locale> étant un code de deux lettres). Se référer à :ref:`doc_locales` pour plus d'informations.
ja: 特定のロケールを使用します(<locale>は2文字のコードです）。詳細については、 :ref:`doc_locales` を参照してください。
ko: 특정 로케일 (두 문장 코드로 된 <locale>)을 사용합니다. 더 자세한 정보는 :ref:`doc_locales`\ 을 참고하세요.
ru: Использовать конкретный язык ( где <locale> - двухбуквенный код языка ). Смотрите :ref:`doc_locales` для более подробной информации.
uk: Використати спеціальну локаль (<locale> - це двобуквенний код). Дивіться :ref:`doc_locales` для більш докладної інформації.
zh_cn: 使用一个具体指定的地区代码（<locale> 是一个两个字母的代码）。阅读 :ref:`doc_locales` 以获得更多信息。
zh_tw: 使用指定的區域代碼（<locale> 為兩個字母的代碼）。詳細請參考 :ref:`doc_locales` 。

source: ``--path <directory>``
fr: ``--path <répertoire>``
uk: ``--path <каталог>``
zh_cn: ``--path <目录>``

source: Path to a project (<directory> must contain a 'project.godot' file).
cs: Cesta k projektu (<adresář> musí obsahovat soubor 'project.godot').
fr: Chemin vers un projet (<répertoire> doit contenir un fichier 'project.godot').
ja: プロジェクトへのパス (<directory>には 'project.godot' ファイルが含まれている必要があります)。
ko: 프로젝트를 향하는 경로 (<directory>에는 'project.godot' 파일이 있어야 합니다).
ru: Путь к проекту (<directory> должен содержать файл 'project.godot').
uk: Шлях до проєкту (<directory> повинен містити файл 'project.godot').
zh_cn: 项目的路径（<目录>必须包含一个'project.godot'文件）。
zh_tw: 專案路徑（<directory> 內必須包含一個「project.godot」檔案）。

source: Scan folders upwards for 'project.godot' file.
cs: Prohledat složky nahoru pro soubor project.godot.
fr: Analyser les dossiers vers le haut pour trouver le fichier 'project.godot'.
ja: 'project.godot' ファイルのフォルダを上方向にスキャンします。
ko: 'project.godot' 파일을 찾기 위해 위로 폴더를 스캔합니다.
ru: Сканирование папок вверх при поиске файла «project.godot».
uk: Сканування вищих папок на наявність файлу ``project.godot``.
zh_cn: 向上扫描文件夹中的“ project.godot”文件。
zh_tw: 向上層資料夾搜尋「project.godot」檔案。

source: Path to a pack (.pck) file to load.
cs: Cesta k souboru balíčku (.pck), který se má načíst.
fr: Chemin vers le fichier pack (.pck) à charger.
ja: 読み込むパック (.pck) ファイルへのパス。
ko: 불러올 팩 (.pck) 파일을 향하는 경로.
ru: Путь к пакету (.pck) для загрузки.
uk: Шлях до файлу пакета (.pck) для завантаження.
zh_cn: 要加载的包文件(.pck)的路径。
zh_tw: 欲載入之 Pack (.pck) 檔。

source: ``--render-thread <mode>``
zh_cn: ``--render-thread <模式>``

source: Render thread mode ('unsafe', 'safe', 'separate'). See :ref:`Thread Model <class_ProjectSettings_property_rendering/threads/thread_model>` for more details.
cs: Režim vykreslovacího vlákna ("unsafe", "safe", "separate"). Další podrobnosti viz :ref:`Thread Model <class_ProjectSettings_property_rendering/threads/thread_model>` .
fr: Mode de rendu de thread ('unsafe', 'safe', 'separate'). Se référer à :ref:`Thread Model <class_ProjectSettings_property_rendering/threads/thread_model>` pour plus d'informations.
ja: レンダー スレッド モード ('unsafe', 'safe', 'separate')。詳細については、 :ref:`Thread Model <class_ProjectSettings_property_rendering/threads/thread_model>` を参照してください。
ko: 렌더 스레드 모드 ('unsafe', 'safe', 'separate'). 더 자세한 정보는 :ref:`Thread Model <class_ProjectSettings_property_rendering/threads/thread_model>`\ 를 참고하세요.
ru: Режим потока рендера ('unsafe', 'safe', 'separate'). Смотрите :ref:`Thread Model <class_ProjectSettings_property_rendering/threads/thread_model>` для более подробной информации.
uk: Режим рендерінгу ('unsafe' ("небезпечний"), 'safe' ("безпечний"), 'separate' ("окремий")). Докладнішу інформацію дивіться :ref:`Thread Model <class_ProjectSettings_property_rendering/threads/thread_model>`.
zh_cn: 渲染线程模式 ('unsafe', 'safe', 'separate')。阅读:ref:`线程模式<class_ProjectSettings_property_rendering/threads/thread_model>` 以获得更多细节。
zh_tw: 算繪器執行緒模式（「unsafe」、「safe」、「separate」）。詳細請參考 :ref:`執行緒模型 <class_ProjectSettings_property_rendering/threads/thread_model>` 。

source: ``--remote-fs <address>``
zh_cn: ``--remote-fs <地址>``

source: Remote filesystem (``<host/IP>[:<port>]`` address).
cs: Vzdálený souborový systém (adresa ``<host/IP>[:<port>]`` ).
fr: Système de fichiers distant (Adresse ``<hôte/IP>[:<port>]``).
ja: リモート ファイルシステム (``<host/IP>[:<port>]`` アドレス)。
ko: 원격 파일 시스템 (``<host/IP>[:<port>]`` 주소).
ru: Удаленная файловая система (адрес формата ``<host/IP>[:<port>]``).
uk: Віддалена файлова система (``<host/IP>[:<port>]`` адреса).
zh_cn: 远端文件系统 (``<主机名/IP>[:<端口号>]`` 地址).
zh_tw: 遠端檔案系統（ ``<host/IP>[:<port>]`` 位址）。

source: ``--audio-driver <driver>``
zh_cn: ``--audio-driver <驱动>``

source: Audio driver. Use ``--help`` first to display the list of available drivers.
cs: Ovladač zvuku. Pro zobrazení seznamu dostupných ovladačů použijte nejprve ``--help`` .
fr: Pilotes audio. Utilisez d'abord la commande ``--help`` pour afficher la liste des pilotes disponibles.
ja: オーディオ ドライバー。最初に ``--help`` を使用して、使用可能なドライバーの一覧を表示します。
ko: 오디오 드라이버. 사용할 수 있는 드라이버 목록을 표시하려면 ``--help``\ 를 먼저 사용하세요.
ru: Аудио драйвер. Сначала используйте ``--help`` для отображения списка доступных драйверов.
uk: Аудіо драйвер. Спершу використовуйте ``--help`` для відображення списку доступних драйверів.
zh_cn: 音频驱动。先使用 ``--help`` 来显示可用的驱动列表。
zh_tw: 音效驅動程式。先指定 ``--help`` 以顯示所有可用的驅動程式。

source: ``--video-driver <driver>``
zh_cn: ``--video-driver <驱动>``

source: Video driver. Use ``--help`` first to display the list of available drivers.
cs: Ovladač videa. Pro zobrazení seznamu dostupných ovladačů použijte nejprve ``--help``.
fr: Pilote vidéo. Utilisez d'abord la commande ``--help`` pour afficher la liste des pilotes disponibles.
ja: ビデオドライバー。最初に ``--help`` を使用して、使用可能なドライバーの一覧を表示します。
ko: 비디오 드라이버. 사용할 수 있는 드라이버 목록을 표시하려면 ``--help``\ 를 먼저 사용하세요.
ru: Видео драйвер. Сначала используйте ``--help`` для отображения списка доступных драйверов.
uk: Відео драйвер. Спершу використовуйте ``--help`` для відображення списку доступних драйверів.
zh_cn: 视频驱动。先使用 ``--help`` 来显示可用的驱动列表。
zh_tw: 視訊驅動程式。先指定 ``--help`` 以顯示所有可用的驅動程式。

source: **Display options**
cs: **Volby zobrazení**
fr: **Options d'affichage**
ja: **表示オプション**
ko: **디스플레이 설정**
ru: **Опции дисплея**
uk: **Команди відображення**
zh_cn: **显示选项**
zh_tw: **顯示選項**

source: Request fullscreen mode.
cs: Vyžádá si celoobrazovkový režim.
fr: Demander le mode plein écran.
ja: 全画面表示モードを指定します。
ko: 전체화면 모드를 요청합니다.
ru: Запросить полноэкранный режим.
uk: Запросити повноекранний режим.
zh_cn: 请求使用全屏模式。
zh_tw: 指定全螢幕模式。

source: Request a maximized window.
cs: Požadavek na maximalizované okno.
fr: Demander une fenêtre maximisée.
ja: ウィンドウの最大化を指定します。
ko: 최대화된 창을 요청합니다.
ru: Запросить полноэкранное окно.
uk: Запросити максимальне вікно.
zh_cn: 请求一个最大化了的窗口。
zh_tw: 指定視窗最大化。

source: Request windowed mode.
cs: Požadavek na okenní režim.
fr: Demander le mode fenêtré.
ja: ウィンドウ モードを指定します。
ko: 창모드를 요청합니다.
ru: Запросить оконный режим.
uk: Запросити віконний режим.
zh_cn: 要求窗口模式。
zh_tw: 指定視窗模式。

source: Request an always-on-top window.
cs: Vyžádá si okno vždy nahoře.
fr: Demander une fenêtre toujours au premier plan.
ja: 常時最前面 ウィンドウを指定します。
ko: 항상 위로 고정된(always-on-top) 창을 요청합니다.
ru: Запросить окно поверх других окон.
uk: Запросити вікно поверх інших вікон.
zh_cn: 请求一个总在最顶的窗口。
zh_tw: 指定永遠顯示於最上層之視窗。

source: Request window resolution.
cs: Vyžádá si rozlišení okna.
fr: Demander la résolution de la fenêtre.
ja: ウィンドウの解像度を指定します。
ko: 창 해상도를 요청합니다.
ru: Запросить разрешение окна.
uk: Запросити розширення вікна.
zh_cn: 请求窗口分辨率。
zh_tw: 指定視窗解析度。

source: Request window position.
cs: Požadavek na polohu okna.
fr: Demander la position de la fenêtre.
ja: ウィンドウの位置を指定します。
ko: 창 위치를 요청합니다.
ru: Запросить положение окна.
uk: Запросити позицію вікна.
zh_cn: 指定屏幕位置。
zh_tw: 指定視窗位置。

source: Force low-DPI mode (macOS and Windows only).
cs: Vynutit režim s nízkým rozlišením DPI (pouze pro macOS a Windows).
fr: Force le mode low-DPI (faible-ppp). Disponible uniquement sur macOS et Windows.
ja: 低DPIモードを強制します (macOS および Windows のみ)。
ko: 낮은 DPI 모드를 강제합니다 (macOS와 Windows만 가능).
ru: Принудительный режим низкого разрешения (только для MacOS и Windows).
uk: Примусовий режим низького розширення (лише для macOS та Windows).
zh_cn: 强制低解析度模式（仅在macOS 和 Windows 中可用）。
zh_tw: 強制低 DPI 模式（僅限 macOS 與 Windows）。

source: Disable window creation (Windows only). Useful together with ``--script``.
cs: Zakázat vytváření oken (pouze systém Windows). Použitelné společně s ``--script``.
fr: Désactive la création de fenêtre (seulement sur Windows). À utiliser conjointement avec ``--script``.
ja: ウィンドウの作成を無効にします (Windows のみ)。 ``-script`` と併用すると便利です。
ko: 창 만들기를 끕니다 (Windows만 가능). ``--script``\ 와 함께 쓰면 유용합니다.
ru: Отключить создание окон (только для Windows). Полезно вместе с ``--script``.
uk: Вимкнути створення вікон (лише для Windows). Корисно разом із ``--script``.
zh_cn: 关闭窗口创建（仅Windows）。和 ``--script``一起使用非常有用。

source: **Debug options**
cs: **Možnosti ladění**
fr: **Options de débogage**
ja: **デバッグオプション**
ko: **디버그 설정**
ru: **Опции отладки**
uk: **Команди налагодження**
zh_cn: **调试选项**
zh_tw: **偵錯選項**

source: Debug options are only available in the editor and debug export templates (they require ``debug`` or ``release_debug`` build targets, see :ref:`doc_introduction_to_the_buildsystem_target` for more details).
cs: Možnosti ladění jsou k dispozici pouze v editoru a šablonách exportu ladění (vyžadují cíle sestavení ``debug`` nebo ``release_debug``, více informací viz :ref:`doc_introduction_to_the_buildsystem_target`).
fr: Les options de débogage ne sont disponibles que dans l'éditeur et les modèles d'exportation de débogage (elles nécessitent des cibles de compilation ``debug`` ou ``release_debug``, voir :ref:`doc_introduction_to_the_buildsystem_target`pour plus de détails).
ja: デバッグ オプションは、エディタおよびデバッグ エクスポート テンプレートでのみ使用できます (これらには ``debug`` または ``release_debug`` ビルド ターゲットが必要です、詳細については、 :ref:`doc_introduction_to_the_buildsystem_target` を参照してください)。
ko: 디버그 설정은 편집기와 디버그 내보내기 템플릿에서만 사용할 수 있습니다 (``debug`` 또는 ``release_debug`` 빌드 대상이 필요합니다. 더 자세한 정보는 :ref:`doc_introduction_to_the_buildsystem_target`\ 을 참고하세요).
ru: Параметры отладки доступны только в редакторе и шаблонах экспорта отладки (для них требуются цели сборки ``debug`` или ``release_debug``, см. :ref:`doc_introduction_to_the_buildsystem_target` для более подробной информации).
uk: Команди налагодження доступні лише в редакторі та шаблонах експорту налагодження (вони вимагають ``debug``, або ``release_debug``, дивіться :ref:`doc_introduction_to_the_buildsystem_target` для більш детальної інформації).
zh_cn: 调试模式仅仅在编辑器和调试输出模板中起作用（这要求使用 ``debug`` 或 ``release_debug`` 构建目标，阅读 :ref:`doc_introduction_to_the_buildsystem_target` 以获得更多信息）。
zh_tw: 偵錯選項僅適用於編輯器與匯出樣板（但必須使用 ``debug`` 或 ``release_debug`` 來建置目標，詳細請參考 :ref:`doc_introduction_to_the_buildsystem_target` ）。

source: Debug (local stdout debugger).
cs: Ladění (místní ladicí program stdout).
fr: Débogage (débogueur stdout local).
ja: デバッグ (ローカル stdout デバッガー)。
ko: 디버그 (지역 표준 디버거).
ru: Отладка (локальный отладчик stdout).
uk: Налагодження (локальний налагоджувач stdout).
zh_cn: 调试（本地标准输出调试器）。
zh_tw: 除錯（本機標準輸出 (Stdout) 除錯工具）。

source: Breakpoint list as source::line comma-separated pairs, no spaces (use %%20 instead).
cs: Seznam bodů přerušení jako dvojice source::line oddělené čárkami, bez mezer (místo toho použijte %%20).
fr: Liste de points d'arrêt comme paires source::ligne séparées par des virgules, sans espace (utiliser %%20 à la place).
ja: ブレークポイントとしてソースの行番号をカンマで区切って列挙します。スペースは使えません(代わりに%%20を使用できます)。
ko: 중단점 목록. 소스::라인으로 쉼표로 구분되며, 공백이 없습니다 (대신 %%20을 사용합니다).
ru: Список точек останова в виде пар **источник::строка**, разделенные запятыми, без пробелов (используйте %%20 заместо пробела).
uk: Список точок розриву в вигляді пар джерело::рядок, розділених комами, без пробілів (використовуйте замість пробілів %% 20).
zh_cn: 断点列表作为 source::line 逗号分隔对时，没有空格（使用 %%20 代替）。
zh_tw: 以 source::line，逗號分隔配對，無空白（顯示 %%20）來列出中斷點。

source: Enable profiling in the script debugger.
cs: Povolení profilování v ladicím programu skriptu.
fr: Activer le profilage dans le débogueur de script.
ja: スクリプト デバッガーでプロファイリングを有効にします。
ko: 스크립트 디버거에서 프로파일링을 켭니다.
ru: Включить профилирование в отладчике скрипта.
uk: Увімкнути профілювання у наладчику скриптів.
zh_cn: 在脚本调试器中启用分析。
zh_tw: 在腳本除錯工具中啟用分析。

source: ``--remote-debug <address>``
zh_cn: ``--remote-debug <地址>``

source: Remote debug (``<host/IP>:<port>`` address).
cs: Vzdálené ladění (``<host/IP>:<port>`` adresa).
fr: Débogage à distance (adresse ``<host/IP>:<port>``).
ja: リモート・デバッグ (addressは\ ``<ホスト/IP>:<ポート>``\ ).
ko: 원격 디버그 (``<host/IP>:<port>`` 주소).
ru: Удаленная отладка (адрес формата ``<host/IP>:<port>``).
uk: Віддалене налагодження (``<host/IP>:<port>`` адреса).
zh_cn: 远程调试 (``<主机名/IP>:<端口号>`` 地址).
zh_tw: 遠端除錯（ ``<host/IP>:<port>`` 位址）。

source: Show collision shapes when running the scene.
cs: Zobrazení kolizních tvarů při spuštění scény.
fr: Afficher les formes de collision lors de l'exécution de la scène.
ja: シーンを実行する際にコリジョン形状を表示する。
ko: 씬을 실행할 때 충돌 모양을 보이기.
ru: Показать формы столкновения при запуске сцены.
uk: Показати форми зіткнення під час запуску сцени.
zh_cn: 运行场景时显示碰撞框的形状。
zh_tw: 執行場景時顯示碰撞區域。

source: Show navigation polygons when running the scene.
cs: Zobrazení navigačních polygonů při spuštění scény.
fr: Afficher les polygones de navigation lors de l'exécution de la scène.
ja: シーンを実行する際にナビゲーション・ポリゴンを表示する。
ko: 씬을 실행할 때 내비게이션 폴리곤을 보이기.
ru: Показывать полигоны навигации при запуске сцены.
uk: Показати навігаційні полігони під час запуску сцени.
zh_cn: 当运行场景时显示多边形导航。
zh_tw: 執行場景時顯示導航多邊形。

source: ``--frame-delay <ms>``
zh_cn: ``--frame-delay <毫秒ms>``

source: Simulate high CPU load (delay each frame by <ms> milliseconds).
cs: Simulujte vysoké zatížení procesoru (zpoždění každého snímku o <ms> milisekund).
fr: Simuler une charge CPU élevée (retarder chaque trame de <ms> millisecondes).
ja: 高CPU負荷の再現 (毎フレームごとに <ms> ミリ秒遅らせる)。
ko: 높은 CPU 점유율을 시험합니다 (각 프레임을 <ms> 밀리초만큼 지연합니다).
ru: Имитировать высокую нагрузку процессора (задерживать каждый кадр на <ms> миллисекунд).
uk: Імітувати високе завантаження процесора (затримувати кожен кадр на <ms> мілісекунд).
zh_cn: 模拟高CPU负载（每帧延迟<ms>毫秒）。
zh_tw: 模擬 CPU 高負載（每幀延遲 <ms> 毫秒）。

source: ``--time-scale <scale>``
zh_cn: ``--time-scale <缩放>``

source: Force time scale (higher values are faster, 1.0 is normal speed).
cs: Změna rychlosti času (vyšší hodnoty jsou rychlejší, 1,0 je normální rychlost).
fr: Forcer l'échelle de temps (plus rapide avec des valeurs plus élevées, 1.0 pour une vitesse normale).
ja: タイムスケールの強制 (値が大きいほど早く、1.0が標準)。
ko: 실행 시간 규모를 제한합니다 (1.0이 기본 속도이며, 높은 값일 수록 더 빠릅니다).
ru: Принудительная шкала времени (более высокие значения быстрее, 1,0 - нормальная скорость).
uk: Прискорити шкалу часу (більші значення швидші, 1,0 - нормальна швидкість).
zh_cn: 强制时间缩放（值越大，速度越快，1.0是正常速度）。
zh_tw: 強制時間縮放（值越早則越快，1.0 為正常速度）。

source: Disable render loop so rendering only occurs when called explicitly from script.
cs: Zakažte smyčku vykreslení, takže k vykreslování dochází pouze při výslovném volání ze skriptu.
fr: Désactive la boucle de rendu pour que le rendu ne se produise que lorsqu'il est appelé explicitement depuis le script.
ja: レンダリングのループの無効化。スクリプトにて明示的に呼び出した時にのみレンダーする。
ko: 렌더 루프를 끕니다. 따라서 스크립트에서 명시적으로 호출할 때만 렌더링을 합니다.
ru: Отключить цикл рендеринга, чтобы рендеринг происходил только при явном вызове из скрипта.
uk: Вимкнути цикл візуалізації (рендеру), візуалізація відбувається лише коли викликається із скрипту.
zh_cn: 禁用渲染循环，以便仅在从脚本显式调用时才进行渲染。
zh_tw: 禁用算繪循環，將只在腳本內明確呼叫時才進行算繪。

source: Disable crash handler when supported by the platform code.
cs: Zakázat obslužnou rutinu selhání, pokud to podporuje kód platformy.
fr: Désactiver le gestionnaire de crash lorsqu'il est pris en charge par le code de la plate-forme.
ja: プラットフォーム・コードが対応している場合もクラッシュ・ハンドラを無効にする。
ko: 플랫폼 코드가 지원하는 경우 충돌 핸들러를 끕니다.
ru: Отключить обработчик сбоя, если это поддерживается кодом платформы.
uk: Вимкнути обробник збоїв, якщо це підтримується кодом платформи.
zh_cn: 当平台代码支持时，禁用崩溃处理程序。
zh_tw: 若平台代碼支援，禁用 Crash Handler。

source: ``--fixed-fps <fps>``
zh_cn: ``--fixed-fps <帧率>``

source: Force a fixed number of frames per second. This setting disables real-time synchronization.
cs: Vynutit pevný počet snímků za sekundu. Toto nastavení zakáže synchronizaci v reálném čase.
fr: Force un nombre fixe d'images par seconde. Ce paramètre désactive la synchronisation temps-réel.
ja: フレーム毎秒の固定。この設定によりリアルタイム同期は無効化。
ko: FPS(초당 프레임)을 고정된 숫자로 제한합니다. 이 설정은 실시간 동기화를 끕니다.
ru: Принудительное фиксированное количество кадров в секунду. Этот параметр отключает синхронизацию в реальном времени.
uk: Форсувати фіксовану кількість кадрів в секунду. Цей параметр вимикає синхронізацію в режимі реального часу.
zh_cn: 每秒强制固定数量的帧。 此设置禁用实时同步。
zh_tw: 強制固定數 FPS。該設定將禁用即時同步。
