Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/command_line_tutorial.po
Languages: cs, fr, ja, ko, pl, ru, uk, zh_cn, zh_tw

source: When a specific scene needs to be tested, pass that scene to the command line.
cs: Pokud je třeba otestovat konkrétní scénu, předejte ji do příkazového řádku.
fr: Lorsqu'une scène spécifique doit être testée, passez cette scène à la ligne de commande.
ja: 特定のシーンをテストする必要がある場合は、そのシーンをコマンドラインに渡します。
ko: 특정 씬을 테스트 해야 하는 경우 씬을 명령줄로 전달하세요.
pl: Gdy zachodzi potrzeba przetestowania określonej sceny, należy przekazać ją do wiersza poleceń.
ru: Если необходимо протестировать определенную сцену, передайте ее в командную строку.
uk: Коли певну сцену потрібно протестувати, передайте її в командний рядок.
zh_cn: 当需要测试特定场景时，将该场景传递给命令行。
zh_tw: 若需要測試特定的場景，則可將該場景傳入命令行。

source: Debugging
cs: Ladění
fr: Débogage
ja: デバッグ
ko: 디버깅
pl: Debugowanie
ru: Отладка
uk: Налагодження
zh_cn: 调试
zh_tw: 偵錯

source: Catching errors in the command line can be a difficult task because they just fly by. For this, a command line debugger is provided by adding ``-d``. It works for running either the game or a simple scene.
cs: Zachycení chyb v příkazovém řádku může být obtížný úkol, protože prostě proletí kolem. K tomu slouží ladicí program příkazového řádku, který se iniciuje pomocí ``-d``. Funguje jak pro spouštění hry tak pro dílčí scény.
fr: Intercepter les erreurs dans la ligne de commande peut être une tâche difficile car elles ne font que défiler. Pour cela, un débogueur de ligne de commande est fourni en ajoutant ``-d``. Cela fonctionne à la fois pour exécuter le jeu ou une simple scène.
ja: コマンドラインでエラーを検出するのは非常に困難な作業です。 ``-d`` を追加することでコマンドラインデバッガが利用できます。これは、ゲームまたは単一のシーンを実行するために機能します。
ko: 명령줄에서 에러를 계산하는 것은 그냥 지나칠 수 있기 때문에 어려운 작업이 될 수 있습니다. 이를 위해 명령줄 디버거는 ``-d``\ 를 추가하여 제공합니다. 게임이나 간단한 씬을 실행하는 데 모두 사용됩니다.
ru: Отлов ошибок в командной строке может быть непростой задачей, потому что они просто пролетают мимо. Для этого в отладчике командной строки добавьте ``-d``. Он работает либо для запуска игры, либо для простой сцены.
uk: Виловлювання помилок у командному рядку можуть бути складним завданням, оскільки вони просто проходять мимо. Для цього надається відладчик командного, викликається додаванням ``-d``. Він працює для запуску, або гри, або простої сцени.
zh_cn: 捕捉命令行中的错误可能是一项艰巨的任务，因为它们一闪而过。为此，通过添加 ``-d`` 来提供命令行调试器。它适用于运行游戏或简单的场景。
zh_tw: 在命令列中找出錯誤可能很困難。為此，可以通過加上 ``-d`` 引數來使用命令列除錯工具。該工具可以用於執行遊戲或場景。

source: Exporting
cs: Exportování
fr: Exportation
ja: エクスポート
ko: 내보내기(Exporting)
pl: Eksportowanie
ru: Экспорт
uk: Експортування
zh_cn: 导出
zh_tw: 匯出

source: Exporting the project from the command line is also supported. This is especially useful for continuous integration setups. The version of Godot that is headless (server build, no video) is ideal for this.
cs: Podporován je také export projektu z příkazového řádku. To je užitečné zejména pro nastavení kontinuální integrace (CI). Verze Godotu, která je headless (sestavení na serveru, bez videa), je pro to ideální.
fr: L'exportation du projet à partir de la ligne de commande est également prise en charge. Ceci est particulièrement utile pour les configurations d'intégrations continues. La version simplifiée de Godot (pour les serveurs, pas d'interface graphique) est idéale pour cela.
ja: コマンドラインからプロジェクトをエクスポートすることもサポートされています。これは継続的インテグレーション設定に特に役立ちます。これには、ヘッドレスのGodotバージョン(サーバービルド、ビデオなし)が理想的です。
ko: 명령줄에서 프로젝트를 내보내는 것도 지원됩니다. 특히 연속적인 통합 설정에 유용합니다. Godot의 헤드리스 버전은 (서버 빌드, 비디오 없음) 이런 점에서 이상적입니다.
pl: Obsługiwane jest również eksportowanie projektu z wiersza poleceń. Jest to szczególnie przydatne w przypadku ciągłej integracji. Wersja Godota, która jest bez interfejsu jest idealna do tego celu.
uk: Також підтримується експорт проекту з командного рядка. Це особливо корисно для безперервних інтеграційних налаштувань. Версія Godot, яка без заголовка (побудова сервера, без відео) ідеально підходить для цього.
zh_cn: 从命令行导出项目也被支持。这对于连续集成设置特别有用。headless的Godot版本（服务器版本，无视频）是理想的选择。
zh_tw: Godot 亦支援自命令行匯出專案。對於 CI 環境（持續整合, Continuous Integration）設定特別有用。無周邊版本的 Godot （伺服器建置，無視訊功能）亦是最佳選擇。

source: The platform names recognized by the ``--export`` switch are the same as displayed in the export wizard of the editor. To get a list of supported platforms from the command line, try exporting to a non-recognized platform and the full listing of platforms your configuration supports will be shown.
fr: Les noms de plates-formes reconnus par le commutateur ``--export`` sont les mêmes que ceux affichés dans l'assistant d'exportation de l'éditeur. Pour obtenir une liste des plates-formes prises en charge à partir de la ligne de commande, essayez d'exporter vers une plate-forme non reconnue et la liste complète des plates-formes prises en charge par votre configuration sera affichée.
ja: ``--export`` スイッチによって認識されるプラットフォーム名は、エディタのエクスポートウィザードに表示されるものと同じです。サポートされているプラットフォームの一覧をコマンドラインから取得するには、認識されていないプラットフォームにエクスポートすると設定がサポートしているプラットフォームの一覧が表示されます。
ko: ``--export`` 스위치가 인식하는 플랫폼 이름은 편집기의 내보내기 마법사에 표시된 것과 동일합니다. 명령줄에서 지원하는 플랫폼 목록을 얻기 위해, 인지하지 않는 플랫폼으로 내보내기를 시도하고 그러면 구성이 지원되는 전체 플랫폼 목록이 나타날 것입니다.
pl: Nazwy platform rozpoznawane przez przełącznik ``--export``są takie same jak wyświetlane w kreatorze eksportu edytora. Aby uzyskać listę obsługiwanych platform z wiersza poleceń, spróbuj wyeksportować je na nierozpoznaną platformę, a zostanie wyświetlona pełna lista platform obsługiwanych przez konfigurację.
zh_cn: 由 ``--export`` 开关识别的平台名称与编辑器的导出向导中显示的平台名称相同。要从命令行获取支持的平台列表，请尝试导出到无法识别的平台，然后将显示您的配置支持的平台的完整列表。

source: To export a debug version of the game, use the ``--export-debug`` switch instead of ``--export``. Their parameters and usage are the same.
cs: Chcete-li exportovat odladěnou verzi hry, použijte místo přepínače ``--export-debug`` přepínač ``--export``. Parametry a použití jsou stejné v obou případech.
fr: Pour exporter une version de débogage du jeu, utilisez le commutateur ``--export-debug`` au lieu de ``--export``. Leurs paramètres et leur utilisation sont les mêmes.
ja: ゲームのデバッグバージョンをエクスポートするには、 ``--export`` の代わりに ``--export-debug`` スイッチを使用します。パラメータと使用方法は同じです。
ko: 게임의 디버그 버전을 내보내기 위해, ``--export`` 대신 ``--export-debug`` 스위치를 사용하세요. 매개 변수와 사용법은 동일합니다.
pl: Aby wyeksportować debugowaną wersję gry, użyj przełącznika ``-export-debug`` zamiast ``-export``. Ich parametry i zastosowanie są takie same.
ru: Для экспорта отладочной версии игры используйте переключатель ``--export-debug`` вместо ``--export``. Их параметры и использование одинаковы.
uk: Для експорту налагодженої версії гри використовуйте перемикач ``--export-debug`` замість ``--export``. Їх параметри та використання однакові.
zh_cn: 要导出游戏的调试版本，请使用 ``--export-debug`` 开关，而不是 ``--export``。它们的参数和用法是相同的。
zh_tw: 欲匯出除錯版本的遊戲，請使用 ``--export-debug`` 而非 ``--export`` 。其參數與用法皆相同。

source: Running a script
cs: Spuštění skriptu
fr: Exécuter un script
ja: スクリプトの実行
ko: 스크립트 실행하기
pl: Uruchomienie skryptu
ru: Запуск скрипта
uk: Запуск скрипта
zh_cn: 运行脚本
zh_tw: 執行腳本

source: Here is a simple example of how it works:
fr: Voici un simple exemple de son fonctionnement :
ja: 簡単な動作例を次に示します:
ko: 어떻게 작동하는 지의 예제입니다:
pl: Oto prosty przykład jak to działa:
ru: Вот простой пример того, как это работает:
zh_cn: 下面是一个简单的示例，说明它是如何工作的：

source: And how to run it:
cs: A jak jej spustit:
fr: Et comment l'exécuter :
ja: 実行方法:
ko: 그리고 어떻게 실행하는 지의 예제입니다:
pl: I jak go uruchomić:
ru: И как запустить его:
uk: І як це запустити:
zh_cn: 以及如何运行它：
zh_tw: 以及如何執行：

source: Like ``--export``, but only export the game pack for the given preset. The <path> extension determines whether it will be in PCK or ZIP format. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
cs: Stejně jako ``--export``, ale exportuje pouze herní balíček pro danou předvolbu. Přípona <cesta> určuje, zda bude ve formátu PCK nebo ZIP. (:ref:`nástroje <doc_introduction_to_the_buildsystem_tools>` musí být povoleno).
uk: Як ``--export``, але використовує шаблон налагодження ( :ref:`інструменти <doc_introduction_to_the_buildsystem_tools>` повинні бути включені).
zh_tw: 與 ``--export`` 相同，但會使用給定的預設設定來匯出遊戲打包。會依照 <path> 的副檔名來判斷匯出的格式是 PCK 還是 ZIP。(必須啟用 :ref:`工具 <doc_introduction_to_the_buildsystem_tools>` )。

source: The preset name must match the name of an export preset defined in the project's ``export_presets.cfg`` file. If the preset name contains spaces or special characters (such as "Windows Desktop"), it must be surrounded with quotes.
cs: Název předvolby musí odpovídat názvu předvolby exportu definované v souboru ``export_presets.cfg`` projektu. Pokud název předvolby obsahuje mezery nebo speciální znaky (například "Windows Desktop"), musí být obklopen uvozovkami.
uk: Назва попередньо встановлених налаштувань має відповідати назві попередньо встановлених параметрів експорту, визначених у файлі проекту ``export_presets.cfg``. Якщо попередньо встановлена назва містить пробіли, чи спеціальні символи (наприклад, "Windows Desktop"), то вона повинна бути загорнута в лапки.

source: To export only a PCK file, use the ``--export-pack`` option followed by the preset name and output path, with the file extension, instead of ``--export``. The output path extension determines the package's format, either PCK or ZIP.
cs: Chcete-li exportovat pouze soubor PCK, použijte místo příkazu ``--export-pack`` možnost ``--export-pack``, za kterou následuje název předvolby a výstupní cesta s příponou souboru. Přípona výstupní cesty určuje formát balíčku, buď PCK, nebo ZIP.
uk: Щоб експортувати лише файл PCK, використовуйте параметр ``--export-pack`` після попередньо встановленого імені та вихідного шляху із розширенням файлу, замість ``--export``. Розширення вихідного шляху визначає формат пакету, або PCK, або ZIP.
zh_tw: 如果只要匯出 PCK 檔案，可以將 ``--export`` 改成 ``--export-pack`` 選項，然後接上匯出預設設定的名稱與輸出路徑，並加上副檔名。輸出路徑的副檔名是依據套件格式判斷的，必須為 PCK 或 ZIP 其一。

source: When specifying a relative path as the path for `--export`, `--export-debug` or `--export-pack`, the path will be relative to the directory containing the ``project.godot`` file, **not** relative to the current working directory.
cs: Při zadání relativní cesty jako cesty pro `--export`, `--export-debug` nebo `--export-pack` bude cesta relativní k adresáři obsahujícímu soubor ``project.godot``, **ne** relativní k aktuálnímu pracovnímu adresáři.
uk: При вказівці відносного шляху, як шляху для `--export`, `--export-debug`, або `--export-pack`, шлях буде розрахований відносно каталогу, що містить файл ``project.godot``, **не** відносно поточного робочого каталогу.

source: It is possible to run a simple ``.gd`` script from the command line. This feature is especially useful in large projects, e.g. for batch conversion of assets or custom import/export.
cs: Z příkazového řádku je možné spustit jednoduchý skript ``.gd``. Tato vlastnost je užitečná zejména u velkých projektů, např. pro dávkový převod zdrojů nebo vlastní import/export.
uk: Можна запустити простий ``.gd`` скрипт з командного рядка. Ця особливість особливо корисна у великих проектах для пакетної конверсії ассетів, або спеціального імпорту/експорту.
zh_tw: 可欲命令列中執行簡單的 ``.gd`` 腳本。對於大型專案來說特別有用，如大量的素材轉換或自定匯入／匯出。

source: The script must inherit from ``SceneTree`` or ``MainLoop``.
cs: Skript musí dědit od ``SceneTree`` nebo ``MainLoop``.
uk: Скрипт повинен успадковуватись від ``SceneTree`` (Дерева сцен), або ``MainLoop`` (Головного циклу).
zh_tw: 該腳本必須繼承 ``SceneTree`` 或 ``MainLoop`` 。

source: Here is a simple ``sayhello.gd`` example of how it works:
cs: Zde je jednoduchý příklad ``sayhello.gd``, jak to funguje:
uk: Ось простий ``sayhello.gd``приклад того, як це працює:
zh_tw: 下列為一個簡單的 ``sayhello.gd`` 範例，用來說明如何運作：

source: If no ``project.godot`` exists at the path, current path is assumed to be the current working directory (unless ``--path`` is specified).
cs: Pokud v cestě neexistuje žádný ``project.godot``, předpokládá se, že aktuální cesta je aktuální pracovní adresář (pokud není zadána ``--path``).
uk: Якщо по шляху немає жодного ``project.godot``, поточний шлях вважається поточним робочим каталогом (якщо не вказано ``--path``).
zh_tw: 若路徑中無 ``project.godot`` ，則目前的路徑將被視為目前的工作目錄（除非指定 ``--path`` ）。

source: The first line of ``sayhello.gd`` above is commonly referred to as a *shebang*. If the Godot binary is in your ``PATH`` as ``godot``, it allows you to run the script as follows in modern Linux distributions, as well as macOS:
cs: První řádek souboru ``sayhello.gd`` se běžně označuje jako *shebang*. Pokud je spustitelný soubor Godot ve vaší ``PATH`` jako ``godot``, umožní vám to spustit skript následujícím způsobem v moderních distribucích Linuxu a také v systému MacOS:
uk: Перший рядок ``sayhello.gd`` вище зазвичай називають *шебангом*. Якщо бінарник Godot є у вашому ``PATH`` як ``godot``, це дозволяє вам запускати скрипт, в сучасних дистрибутивах Linux, а також macOS:
zh_tw: 在上方 ``sayhello.gd`` 範例中的第一行就是我們一般稱為 **Shebang** 的東西。若 Godot 的二進位執行檔有在 ``PATH`` 中，並且名稱為 ``godot`` 的話，則這行 Shebang 就能讓腳本在現代 Linux 發行版下執行，而 macOS 也可以：

source: If the above doesn't work in your current version of Linux or macOS, you can always have the shebang run Godot straight from where it is located as follows:
cs: Pokud výše uvedený postup nefunguje ve vaší aktuální verzi Linuxu nebo macOS, můžete vždy nechat spustit Godot přímo z místa, kde se nachází, následujícím způsobem:
uk: Якщо вищевказане не працює у вашій поточній версії Linux, або macOS, ви завжди можете запустити шебанг Godot прямо звідти, де він знаходиться наступним чином:
zh_tw: 若上方的這個範例無法在你使用的 Linux 或 macOS 版本中使用，也可以通過下列這個方法來直接讓 Shebang 從 Godot 儲存的地方執行：

source: It is possible to run a simple .gd script from the command line. This feature is especially useful in large projects, for batch conversion of assets or custom import/export.
fr: Il est possible d'exécuter un simple script .gd à partir de la ligne de commande. Cette fonctionnalité est particulièrement utile dans les grands projets, pour la conversion par lots de ressources, ou l’import/export personnalisé.
pl: Z wiersza poleceń można uruchomić prosty skrypt .gd. Funkcja ta jest szczególnie przydatna w przypadku dużych projektów do niestandardowego importu/eksportu.
ru: Есть возможность запуска простого .gd скрипта из командной строки. Эта функция особенно полезна в крупных проектах, для груповой конвертации ассетов или пользовательского импорта/экспорта.

source: The script must inherit from SceneTree or MainLoop.
fr: Le script doit hériter de SceneTree ou MainLoop.
pl: Skrypt musi dziedziczyć po SceneTree lub MainLoop.
ru: Скрипт должен наследоваться от SceneTree или MainLoop.

source: If no project.godot exists at the path, current path is assumed to be the current working directory (unless ``-path`` is specified).
fr: Si aucun fichier project.godot n'existe dans le chemin, le chemin courant est supposé être le répertoire de travail courant (sauf si ``-path`` est spécifié).
pl: Jeżeli w ścieżce nie istnieje project.godot, to zakłada się, że bieżąca ścieżka jest bieżącym katalogiem roboczym (chyba że podano ``-path``).
ru: Если файл project.godot не существует в пути, то текущий путь считается текущим рабочим каталогом (если не указано ``-path`).

source: Some developers like using the command line extensively. Godot is designed to be friendly to them, so here are the steps for working entirely from the command line. Given the engine relies on little to no external libraries, initialization times are pretty fast, making it suitable for this workflow.
pl: Niektórzy programiści lubią używać linii poleceń w szerokim zakresie. Godot jest zaprojektowany tak, aby był dla nich przyjazny, więc oto kroki do pracy w całości z wiersza poleceń. Ze względu na to, że silnik opiera się na niewielkich zewnętrznych bibliotekach więc czasy inicjalizacji są dość krótkie, co sprawia, że nadaje się on do tego rodzaju pracy.

source: It is recommended that your Godot binary is in your PATH environment variable, so it can be executed easily from any place by typing ``godot``. You can do so on Linux by placing the Godot binary in ``/usr/local/bin`` and making sure it is called ``godot``.
pl: Zaleca się, aby Twoje binarne Godot były w zmiennej środowiskowej PATH, by były łatwo wykonywane z dowolnego miejsca, wpisując ``godot``. Możesz to zrobić na Linuksie umieszczając binarne Godota w ``/usr/local/bin`` i upewniając się, że program nazywa się ``godot``.

source: Catching errors in the command line can be a difficult task because they just fly by. For this, a command line debugger is provided by adding ``-d``. It works for both running the game or a simple scene.
pl: Wyłapanie błędów w wierszu poleceń może być trudnym zadaniem, ponieważ po prostu je omijają. W tym celu dostarczany jest debugger wiersza poleceń poprzez dodanie ``-d``. Działa zarówno do uruchamiania gry, jak i prostej sceny.
