Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/command_line_tutorial.po
Languages: cs, fr, ja, ko, pl, ru, uk, zh_cn, zh_tw

source: Print the frames per second to the stdout.
cs: Vypíše snímky za sekundu na výstup stdout.
fr: Affiche les images par second à la sortie standard stdout.
ja: stdoutにフレーム毎秒を出力。
ko: 표준 출력에 FPS(초당 프레임)를 프린트합니다.
ru: Выводить количество кадров в секунду на стандартный вывод.
uk: Вивести кадри за секунду на екран.
zh_cn: 打印每秒的帧数到标准输出上。
zh_tw: 在標準輸出上印出 FPS。

source: **Standalone tools**
cs: **Samostatné nástroje**
fr: **Outils autonomes**
ja: **スタンドアロンツール**
ko: **독립형 도구**
ru: **Автономные инструменты**
uk: **Автономні інструменти**
zh_cn: **单独的工具**
zh_tw: **獨立工具**

source: Run a script.
cs: Spustit skript.
fr: Exécutez un script.
ja: スクリプトの実行。
ko: 스크립트를 실행합니다.
ru: Запуск скрипта.
uk: Запуск скрипту.
zh_cn: 运行脚本。
zh_tw: 執行腳本。

source: Only parse for errors and quit (use with ``--script``).
cs: Pouze analyzuje chyby a ukončí práci (použijte s ``--script``).
fr: Analyser uniquement les erreurs et quitter (utiliser avec ``--script``).
ja: エラー分析のみ行って終了(``--script``\ と同時に使用)。
ko: 오류만 구문 분석하고 종료합니다 (``--script``\ 와 함께 사용합니다).
ru: Только разбор ошибок и выход (использовать с ``--script``).
uk: Розібрати лише помилки та закрите (використовуйте ``--script``).
zh_cn: 仅解析错误并退出（与--script一起使用）。
zh_tw: 僅解析錯誤並退出（與 ``--script`` 一起使用）。

source: ``--export <target>``
zh_cn: ``--export <平台>``

source: Export the project using the given export target. Export only main pack if path ends with .pck or .zip (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
cs: Export projektu pomocí zadaného cíle exportu. Exportuje pouze hlavní balíček, pokud cesta končí příponou .pck nebo .zip (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` musí být povoleno).
fr: Exporter le projet en utilisant la cible d'exportation donnée. Exporter seulement le paquet principal si le chemin se termine par.pck ou.zip (:ref:`les outils <doc_introduction_to_the_buildsystem_tools>` doivent être activés).
ja: 指定されたエクスポート・ターゲットに向けてプロジェクトをエクスポートする。パスが .pck あるいは .zip で終わっている場合、メインのパックのみエクスポートする (\ :ref:`tools <doc_introduction_to_the_buildsystem_tools>`\ を有効にする必要あり)。
ko: 주어진 내보내기 대상을 사용해서 프로젝트를 내보냅니다. 경로가 .pck나 .zip으로 확장자 이름으로 끝나는 경우, 메인 팩만 내보냅니다 (:ref:`tools(도구) <doc_introduction_to_the_buildsystem_tools>`\ 가 켜져 있어야 합니다).
ru: Экспортирует проект, используя заданную цель экспорта. Экспортирует только основной пакет, если путь заканчивается на .pck или .zip (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` должен быть включен).
uk: Експортує проtкт використовуючи задану ціль експорту. Експортує лише основний пакет, якщо шлях закінчується .pck, або .zip (:ref:`інструменти <doc_introduction_to_the_buildsystem_tools>` повинні бути включені).
zh_cn: 使用给定的导出平台导出项目。 仅当路径以.pck或.zip结尾时才导出主包（必须启用 :ref:`tools <doc_introduction_to_the_buildsystem_tools>` ）。
zh_tw: 使用指定的匯出目標來匯出專案。若路徑以 .pck 或 .zip 結尾則只匯出 Main Pack（必須啟用 :ref:`工具 <doc_introduction_to_the_buildsystem_tools>` ）。

source: ``--export-debug <target>``
zh_cn: ``--export-debug <平台>``

source: Like ``--export``, but use debug template (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
cs: Stejně jako ``--export``, ale použije ladicí šablonu (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` musí být povoleno).
fr: Comme ``--export``, mais utilise le modèle de débogage (:ref:`les outils <doc_introduction_to_the_buildsystem_tools>` doivent être activés).
ja: \ ``--export``\ と同じだが、デバッグ・テンプレートを使用する。(\ :ref:`tools <doc_introduction_to_the_buildsystem_tools>`\ を有効にする必要あり)。
ko: ``--export``\ 와 비슷하지만 디버그 템플릿을 사용합니다 (:ref:`tools(도구) <doc_introduction_to_the_buildsystem_tools>`\ 가 켜져 있어야 합니다).
ru: Как ``--export``, но использует шаблон отладки (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` должна быть включена).
uk: Як ``--export``, але використовує шаблон налагодження ( :ref:`інструменти <doc_introduction_to_the_buildsystem_tools>` повинні бути включені).
zh_cn: 像 ``--export`` 一样，但是使用调试模板（必须启用 :ref:`工具 <doc_introduction_to_the_buildsystem_tools>` ）。
zh_tw: 與 ``--export`` 相同，但使用除錯樣板（必須啟用 :ref:`工具 <doc_introduction_to_the_buildsystem_tools>` ）。

source: ``--doctool <path>``
zh_cn: ``--doctool <路径>``

source: Dump the engine API reference to the given <path> in XML format, merging if existing files are found (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
cs: Vypíše odkaz na API enginu do zadané <cesty> ve formátu XML a sloučí, pokud jsou nalezeny existující soubory (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` musí být povoleno).
fr: Écrire la référence de l'API du moteur vers le chemin <path> au format XML, fusionnant les fichiers s'ils existent (:ref:`les outils <doc_introduction_to_the_buildsystem_tools>` doivent être activés).
ja: 指定した <path> にエンジンのAPIリファレンスをXML形式で出力する。すでにファイルが存在する場合は、それに結合する。(\ :ref:`tools <doc_introduction_to_the_buildsystem_tools>`\ を有効にする必要あり)。
ko: 엔진 API 참조를 주어진 <경로>에 XML 형식으로 덤프합니다. 이미 해당 파일이 있다면 병합합니다. (:ref:`tools(도구) <doc_introduction_to_the_buildsystem_tools>`\ 가 켜져 있어야 합니다).
ru: Сохранить справку по API движка на заданный <path> (путь) в формате XML, объединяя, если найдены существующие файлы (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` должна быть включена).
uk: Скинути посилання на API движка на вказаний <path> (шлях) у форматі XML, поглинання, якщо існуючі файли знайдені ((:ref:`інструменти<doc_introduction_to_the_buildsystem_tools>` повинні бути ввімкненими).
zh_cn: 将引擎API参考以XML格式转储到给定的<路径>中，如果发现现有文件则合并（必须启用 :ref:`工具 <doc_introduction_to_the_buildsystem_tools>` ）。
zh_tw: 將引擎的 API 參照文件以 XML 格式傾印至指定的 <path> 路徑，若檔案存在則合併（必須啟用 :ref:`工具 <doc_introduction_to_the_buildsystem_tools>` ）。

source: Disallow dumping the base types (used with ``--doctool``, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
cs: Zakáže výpis základních typů (používá se s ``--doctool``, musí být povoleno :ref:`tools <doc_introduction_to_the_buildsystem_tools>`).
fr: Ne pas écrire les références des types de base (utilisé avec``--doctool``, :ref:`les outils <doc_introduction_to_the_buildsystem_tools>` doivent être activés).
ja: 基本タイプのダンプをしない (``--doctool``\ と共に使用。\ :ref:`tools <doc_introduction_to_the_buildsystem_tools>`\ を有効にする必要あり)。
ko: 기본 유형을 덤프하는 것을 허가하지 않습니다 (``--doctool``\ 과 함께 쓰며, :ref:`tools(도구) <doc_introduction_to_the_buildsystem_tools>`\ 가 켜져 있어야 합니다).
ru: Запретить дамп базовых типов (используется с ``--doctool``, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` должна быть включена).
uk: Забороняє скидання базових типів (використовується з ``--doctool``, :ref:`інструменти<doc_introduction_to_the_buildsystem_tools>` повинні бути включені).
zh_cn: 禁止转储基本类型（和 ``--doctool`` 一起使用，:ref:`工具 <doc_introduction_to_the_buildsystem_tools>` 必须启用）。
zh_tw: 禁用傾印基礎型別（與 ``--doctool`` 一起使用，必須啟用 :ref:`工具 <doc_introduction_to_the_buildsystem_tools>` ）。

source: Build the scripting solutions (e.g. for C# projects, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
cs: Sestaví skriptovací řešení (např. pro projekty C# musí být povoleno :ref:`tools <doc_introduction_to_the_buildsystem_tools>`).
fr: Construire les solutions de script (par exemple pour les projets C#, :ref:`les outils <doc_introduction_to_the_buildsystem_tools>` doivent être activés).
ja: スクリプトのソリューションをビルドする (例えばC#プロジェクトのために。\ :ref:`tools <doc_introduction_to_the_buildsystem_tools>`\ を有効にする必要あり)。
ko: 스크립팅 솔루션을 빌드합니다 (예: C# 프로젝트 용. :ref:`tools(도구) <doc_introduction_to_the_buildsystem_tools>`\ 가 켜져 있어야 합니다).
ru: Построение скриптовых решений (например, для проектов на C# :ref:`tools <doc_introduction_to_the_buildsystem_tools>` должна быть включена).
uk: Будує скрипт рішень (наприклад, для проектів C#, :ref:`інструменти <doc_introduction_to_the_buildsystem_tools>` повинні бути включені).
zh_cn: 构建脚本解决方案（例如用于构建C#项目，必须启用 :ref:`tools <doc_introduction_to_the_buildsystem_tools>`）。
zh_tw: 建置腳本解決方案 (Solution)（如用於 C# 專案，必須啟用 :ref:`工具 <doc_introduction_to_the_buildsystem_tools>` ）。

source: Generate JSON dump of the Godot API for GDNative bindings (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
cs: Generování výpisu JSON rozhraní API Godot pro vazby GDNative (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` musí být povoleno).
ja: GDNativeバインディング用のGodot APIのJSONダンプを生成します (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` を有効にする必要があります)。
ko: GDNative 바인딩을 위해 Godot API의 JSON 덤프를 만듭니다 (:ref:`tools(도구) <doc_introduction_to_the_buildsystem_tools>`\ 가 켜져 있어야 합니다).
ru: Создайте дамп JSON API-интерфейса Godot для привязок GDNative (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` должен быть включен).
uk: Створює дамп JSON Godot API для прив'язок GDNative ( :ref:`інструменти <doc_introduction_to_the_buildsystem_tools>` повинні бути включені).
zh_cn: 为GDNative绑定生成Godot API的JSON输出（必须启用 :ref:`tools <doc_introduction_to_the_buildsystem_tools>`）。
zh_tw: 產生用於 GDNative 綁定的 Godot API JSON 傾印（必須啟用 :ref:`工具 <doc_introduction_to_the_buildsystem_tools>` ）。

source: Run a unit test. Use ``--help`` first to display the list of tests. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
cs: Spusťí unit test. Pro zobrazení seznamu testů nejprve použijte ``--help``. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` musí být povoleno).
fr: Effectuez un test unitaire. Utilisez d'abord ``--help`` pour afficher la liste des tests. (:ref:`les outils <doc_introduction_to_the_buildsystem_tools>` doivent être activés).
ja: 単体テストを実行します。最初に ``--help`` を使用して、テストの一覧を表示します。(:ref:`tools <doc_introduction_to_the_buildsystem_tools>` を有効にする必要があります)。
ko: 단위 테스트를 실행합니다. 테스트 목록을 표시하려면 ``--help``\ 를 먼저 사용합니다. (:ref:`tools(도구) <doc_introduction_to_the_buildsystem_tools>`\ 가 켜져 있어야 합니다).
ru: Запустить юнит-тест. Сначала используйте ``--help`` для отображения списка тестов. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` должен быть включен).
uk: Виконує тест одиниці. Спершу використовуйте ``--help`` для відображення списку тестів. ( :ref:`інструменти<doc_introduction_to_the_buildsystem_tools>` повинні бути включені).
zh_cn: 运行单元测试。可以先用 ``--help`` 显示测试列表。（必须启用 :ref:`tools <doc_introduction_to_the_buildsystem_tools>`）。
zh_tw: 指定單元測試。先使用 ``--help`` 以列出所有測試。（必須啟用 :ref:`工具 <doc_introduction_to_the_buildsystem_tools>` ）。

source: Path
cs: Cesta
fr: Chemin
ja: パス
ko: 경로
pl: Ścieżka
ru: Путь
uk: Шлях
zh_cn: 路径
zh_tw: 路徑

source: It is recommended that your Godot binary be in your PATH environment variable, so it can be executed easily from any place by typing ``godot``. You can do so on Linux by placing the Godot binary in ``/usr/local/bin`` and making sure it is called ``godot``.
cs: Doporučujeme, aby cesta ke spouštěcímu souboru Godota byla v proměnné prostředí PATH, tak jej bude možné snadno spustit z libovolného místa zadáním ``godot``. V Linuxu tak můžete učinit tak, že spuštěcí soubor Godot umístíte do adresáře ``/usr/local/bin`` a ujistíte se, že se jmenuje ``godot``.
fr: Il est recommandé que votre binaire Godot soit dans votre variable d'environnement PATH, de sorte qu'il puisse être exécuté facilement à partir de n'importe quel endroit en tapant ``godot``. Vous pouvez le faire sous Linux en plaçant le binaire Godot dans ``/usr/local/bin`` et en vous assurant qu'il s'appelle ``godot``.
ja: ``godot`` と入力すればどこからでも簡単に実行できるように、godotバイナリをPATH環境変数に含めることをお勧めします。Linuxでは、 ``/usr/local/bin`` にgodotバイナリを配置し、それが ``godot`` と呼ばれていることを確認することで、これを行うことができます。
ko: Godot 바이너리를 PATH 환경 변수에 넣어서, ``godot``\ 를 입력하면 어느 곳이든 쉽게 실행하도록 하는 것을 추천합니다. Linux에서 Godot 바이너리를 ``/usr/local/bin``\ 에 배치하여, ``godot``\ 라고 부르게 하세요.
ru: Рекомендуется, чтобы ваш бинарный файл Godot находился в переменной окружения PATH, чтобы его можно было легко выполнить из любого места, набрав ``godot``. Вы можете сделать это на Linux, поместив бинарный файл Godot в ``/usr/local/bin`` и убедившись, что он называется ``godot``.
uk: Рекомендується, щоб ваш бінарний код Godot був у вашій змінній PATH, щоб його можна було легко виконати з будь-якого місця, набравши текст ``godot``. Ви можете зробити так в Linux, помістивши в бінарний файл Godot ``/usr/local/bin`` і переконавшись, що він викликається з допомогою ``godot``.
zh_cn: 建议将Godot二进制文件放在 ``PATH`` 环境变量中，这样可以通过在任何地方键入 ``godot`` 来轻松地执行它。您可以在Linux上通过将Godot二进制文件放在 ``/usr/local/bin`` 中，并确保其名为 ``godot``。
zh_tw: 建議將 Godot 二進位執行檔放置於 PATH 環境變數內，這樣在任何地方就只需要輸入 ``godot`` 即可執行。在 Linux 中可以將 Godot 二進位執行檔放在 ``/usr/local/bin`` 並確保該檔案命名為 ``godot`` 。

source: Setting the project path
cs: Nastavení cesty k projektu
fr: Définir le chemin du projet
ja: プロジェクトパスの設定
ko: 프로젝트 경로 설정하기
pl: Ustawienie ścieżki projektu
ru: Настройка пути проекта
uk: Налаштування шляху проєкта
zh_cn: 设置项目路径
zh_tw: 設定專案路徑

source: Depending on where your Godot binary is located and what your current working directory is, you may need to set the path to your project for any of the following commands to work correctly.
cs: V závislosti na tom, kde se nachází spustitelný soubor Godot a jaký je váš aktuální pracovní adresář, může být pro správnou funkci následujících příkazu nezbytné nastavit cestu k vašemu projektu.
fr: Selon l'endroit où se trouve votre binaire Godot et votre répertoire de travail actuel, vous devrez peut-être définir le chemin d'accès à votre projet pour que les commandes suivantes fonctionnent correctement.
ja: Godotバイナリの場所と現在の作業ディレクトリによっては、次のコマンドを正しく機能させるためにプロジェクトへのパスを設定する必要があります。
ko: Godot 바이너리의 위치와 현재 작업 디렉토리의 위치에 따라, 다음 명령 중 하나가 제대로 작동하려면 프로젝트의 경로를 설정해야 합니다.
pl: W zależności od tego, gdzie znajdują się twoje binarne Godota i jaki jest twój aktualny katalog roboczy, być może będziesz musiał wstawić ścieżkę do projektu, aby jedno z poniższych poleceń działało poprawnie.
ru: В зависимости от того, где расположен ваш бинарный файл Godot и какая у вас рабочая директория, для корректной работы одной из следующих команд может понадобиться указать путь к вашему проекту.
uk: Залежно від того, де розміщений ваш бінарний файл Godot та який ваш поточний робочий каталог, вам може знадобитися встановити шлях до вашого проєкту, щоб будь-яка з наступних команд працювала правильно.
zh_cn: 根据Godot二进制文件的位置以及当前的工作目录，您可能需要设置项目的路径，以下任何命令才能正常工作。
zh_tw: 依據 Godot 的二進位執行檔放置位置以及目前工作目錄的不同，可能需要為下列指令設定專案路徑才可正確執行。

source: This can be done by giving the path to the ``project.godot`` file of your project as either the first argument, like this:
cs: To lze provést buď zadáním cesty k souboru ``project.godot`` vašeho projektu jako prvního argumentu, například takto:
fr: Cela peut être fait en donnant le chemin du fichier ``project.godot`` de votre projet en tant que premier argument, comme ceci :
ja: これは、プロジェクトの ``project.godot`` ファイルへのパスを最初の引数として指定することで実現できます:
ko: 프로젝트의``project.godot`` 파일에 대한 경로를 다음과 같이 첫 번째 인자로 주면 됩니다:
pl: Można to zrobić, podając ścieżkę do pliku ``project.godot``w swoim projekcie jako pierwszy argument, taki jak ten:
ru: Это можно сделать, указав путь к файлу вашего проекта ``project.godot`` в качестве первого аргумента, как показано ниже:
uk: Це можна зробити, вказавши шлях до файлу ``project.godot`` вашого проєкту як першого аргументу, наприклад:
zh_cn: 这可以通过将项目的 ``project.godot`` 文件的路径作为第一个参数给出来完成，如下所示：
zh_tw: 可以通過為第一個參數指定專案 ``project.godot`` 檔案所在的路徑來完成，如：

source: Or by using the ``--path`` argument:
cs: Nebo pomocí argumentu ``--path``:
fr: ou en utilisant l'argument ``--path`` :
ja: または ``--path`` 引数を使用して:
ko: 혹은 ``--path`` 인자를 사용합니다:
pl: Lub używając argumentu ``--path``:
ru: Или с помощью аргумента ``--path``:
uk: Або використовуючи ``--path`` аргумент:
zh_cn: 或者通过使用 ``--path`` 参数：
zh_tw: 或是使用 ``--path`` 引數：

source: For example, the full command for exporting your game (as explained below) might look like this:
cs: Úplný příkaz pro export hry (jak je vysvětleno níže) může vypadat například takto:
fr: Par exemple, la commande complète pour exporter votre jeu (comme expliqué ci-dessous) pourrait ressembler à ceci :
ja: たとえば、ゲームをエクスポートするための完全なコマンド(以下に説明する)は次のようになります:
ko: 예를 들어, (아래에서 설명할) 게임을 내보내는 전체 명령은 다음과 같을 것입니다:
pl: Na przykład, pełna komenda eksportowania gry (jak wyjaśniono poniżej) może wyglądać tak:
ru: Например, полная команда для экспорта вашей игры (описано ниже) может выглядеть следующим образом:
uk: Наприклад, повна команда експорту вашої гри (описано нижче) може виглядати так:
zh_cn: 例如，用于导出游戏的完整命令（如下所述）可能如下所示：
zh_tw: 舉例來說，用於匯出遊戲（下方會說明）的完整指令看起來會像這樣：

source: Creating a project
cs: Vytvoření projektu
fr: Créer un projet
ja: プロジェクトの作成
ko: 프로젝트 생성하기
pl: Tworzenie projektu
ru: Создание проекта
uk: Як створити проєкт
zh_cn: 创建一个项目
zh_tw: 建立專案

source: Creating a project from the command line can be done by navigating the shell to the desired place and making a project.godot file.
cs: Vytvoření projektu z příkazového řádku lze provést tak, že v shellu přejdete na požadované místo a vytvoříte soubor project.godot.
fr: La création d'un projet à partir de la ligne de commande peut se faire en naviguant dans le shell jusqu'à l'endroit désiré et en créant un fichier project.godot.
ja: コマンドラインからプロジェクトを作成するには、シェルを目的の場所に移動してproject.godotファイルを作成します。
ko: 명령줄에서 프로젝트를 생성하려면 셸을 원하는 위치로 이동하고 project.godot 파일을 작성하십시오.
pl: Utworzenie projektu z wiersza poleceń można wykonać poprzez nawigację po powłoce w żądane miejsce i utworzenie pliku project.godot.
ru: Создание проекта из командной строки можно выполнить, переместив командную оболочку (shell) в нужное место и создав файл project.godot.
uk: Створення проєкту з командного рядка можна здійснити, перемістивши оболонку до потрібного місця та створивши файл project.godot.
zh_cn: 通过将命令行导航到所需位置并创建 ``project.godot`` 文件，可以从命令行创建项目。
zh_tw: 可以通過將 Shell 導航至欲建立專案的位置並建立 project.godot 檔案來在命令列中建立專案。

source: The project can now be opened with Godot.
cs: Projekt lze nyní otevřít pomocí programu Godot.
fr: Le projet peut maintenant être ouvert avec Godot.
ja: これで、Godotでプロジェクトを開くことができます。
ko: 프로젝트는 이제 Godot로 열릴 수 있습니다.
pl: Projekt można teraz otworzyć w Godot.
ru: Теперь проект можно открыть с помощью Godot.
uk: Тепер проєкт можна відкрити в Godot.
zh_cn: 现在可以使用Godot打开该项目。
zh_tw: 該專案即可以 Godot 開啟。

source: Running the editor
cs: Spuštění editoru
fr: Exécution de l'éditeur
ja: エディタの実行
ko: 편집기 실행하기
pl: Uruchamianie edytora
ru: Запуск редактора
uk: Запуск редактора
zh_cn: 运行编辑器
zh_tw: 執行編輯器

source: Running the editor is done by executing Godot with the ``-e`` flag. This must be done from within the project directory or a subdirectory, otherwise the command is ignored and the project manager appears.
cs: Spouštění editoru se provádí spuštěním Godota s příznakem ``-e``. Toto musí být provedeno z adresáře nebo podadresáře projektu, jinak je příkaz ignorován a zobrazí se pouze správce projektu.
fr: L'exécution de l'éditeur se fait en exécutant Godot avec le paramètre ``-e``. Cela doit être fait depuis le répertoire du projet ou un sous-répertoire, sinon la commande est ignorée et le gestionnaire de projet apparaît.
ja: エディタを実行するには、Godotに ``-e`` フラグを付けて実行します。これは、プロジェクトディレクトリまたはサブディレクトリ内から実行する必要があります。それ以外の場合、コマンドは無視され、プロジェクトマネージャが表示されます。
ko: 편집기는 ``-e`` 플래그를 실행해서 실행됩니다. 작업은 프로젝트 디렉토리 또는 하위 디렉토리에서 수행해야 합니다, 그렇지 않으면 명령이 무시되고 프로젝트 관리자가 나타납니다.
ru: Запуск редактора осуществляется путем выполнения команды Godot с флагом ``-e``. Это должно быть сделано изнутри каталога проекта или подкаталога, в противном случае команда игнорируется и появляется менеджер проекта.
uk: Запуск редактора виконується шляхом введення команди Godot з позначкою ``-e``. Це потрібно робити з каталогу проєкту, або підкаталогу, інакше команда ігнорується і з'являється менеджер проектів.
zh_cn: 运行编辑器是通过用 ``-e`` 标志执行Godot来完成的。必须在项目目录或子目录内完成此操作，否则该命令将被忽略并显示项目管理器。
zh_tw: 可以使用 ``-e`` 旗標執行 Godot 來開啟編輯器。必須在專案目錄或其子目錄內完成，否則該指令會被忽略並開啟專案管理員。

source: If a scene has been created and saved, it can be edited later by running the same code with that scene as argument.
cs: Pokud byla scéna vytvořena a uložena, lze ji později upravit spuštěním stejného příkazu s touto scénou jako dalším argumentem.
fr: Si une scène a été créée et enregistrée, elle peut être modifiée ultérieurement en exécutant le même code avec la dite scène en argument.
ja: シーンが作成および保存されている場合は、そのシーンを引数として同じコードを実行することで、後で編集できます。
ko: 씬을 만들고 저장한다면, 나중에 해당 씬을 인수로 사용하여 동일한 코드를 실행하여 편집할 수 있습니다.
pl: Jeśli scena została utworzona i zapisana, można ją później edytować, używając tego samego kodu z sceną jako argument.
ru: Если сцена была создана и сохранена, ее можно отредактировать позже, запустив тот же код с этой сценой в качестве аргумента.
uk: Якщо сцена була створена та збережена, її можна буде відредагувати пізніше, запустивши той самий код із цією сценою в якості аргумента.
zh_cn: 如果已经创建并保存了场景，则可以稍后以该场景作为参数运行相同的代码来对其进行编辑。
zh_tw: 若已有建立並保存場景，則之後可使用相同的指令並以該場景作為參數來編輯。

source: Erasing a scene
cs: Vymazání scény
fr: Effacer une scène
ja: シーンの削除
ko: 씬 지우기
pl: Usuwanie sceny
ru: Удаление сцены
uk: Видаляння сцени
zh_cn: 删除一个场景
zh_tw: 清除場景

source: Godot is friends with your filesystem and will not create extra metadata files. Use ``rm`` to erase a scene file. Make sure nothing references that scene or else an error will be thrown upon opening.
cs: Godot se přátelí s vaším souborovým systémem a nevytváří další soubory metadat. Pro vymazání souboru scény použijte ``rm``. Ujistěte se, že na tuto scénu nic neodkazuje, jinak bude při otevření následovat chyba.
fr: Godot respecte votre système de fichiers et ne créera pas de fichiers de métadonnées supplémentaires. Utilisez ``rm`` pour effacer un fichier de scène. Assurez-vous que rien ne fait référence à cette scène, sinon cela provoquera une erreur à l’ouverture.
ja: Godotはあなたのファイルシステムと友達であり、追加のメタデータファイルを作成することはありません。シーンファイルを削除するには、 ``rm`` を使用します。 そのシーンを参照するものが何もないことを確認してください。
ko: Godot는 당신의 파일 시스템과 친하고 추가적인 메타데이터 파일을 만들기 않을 것입니다. ``rm`` 을 사용해 씬 파일을 지웁니다. 참조하는 씬이 없다면 오류가 발생할 것입니다.
pl: Godot jest przyjaźnie nastawiony do twojego systemu plików i nie będzie tworzył dodatkowych plików metadanych. Użyj ``rm`` aby skasować plik sceny. Upewnij się, że nic nie odnosi się do sceny albo błąd zostanie wyrzucony przy otwieraniu.
ru: Godot может работать с вашей файловой системой и не будет создавать дополнительные файлы метаданных. Используйте ``rm`` для удаления файла сцены. Убедитесь, что при открытии не будет никаких ссылок на эту сцену, иначе произойдет ошибка.
uk: Godot дружить з вашою файловою системою і не створюватиме зайві файли метаданих. Використовуйте ``rm`` для видалення файлу сцени. Переконайтеся, що ніщо не посилається на цю сцену, інакше виникне помилка.
zh_cn: Godot对您的文件系统非常友好，不会创建额外的元数据文件。只需使用 ``rm`` 来删除文件。确保没有对该场景的引用，否则在打开时会抛出错误。
zh_tw: Godot 對檔案系統友善，且不會建立額外的後設資料檔案。可使用 ``rm`` 來清除專案檔案。請確保沒有其他東西參照到該場景，否則開啟時會拋出錯誤。

source: Running the game
cs: Spuštění hry
fr: Éxécuter le jeu
ja: ゲームの実行
ko: 게임 실행하기
pl: Uruchamianie gry
ru: Запуск игры
uk: Запуск гри
zh_cn: 运行游戏
zh_tw: 執行遊戲

source: To run the game, simply execute Godot within the project directory or subdirectory.
cs: Chcete-li hru spustit, jednoduše spusťte Godot v adresáři nebo podadresáři projektu.
fr: Pour lancer le jeu, il suffit d'exécuter Godot dans le répertoire ou sous-répertoire du projet.
ja: ゲームを実行するには、プロジェクトディレクトリまたはサブディレクトリ内でGodotを実行します。
ko: 게임을 실행하려면, 간단히 프로젝트 디렉토리나 하위 디렉토리에서 Godot를 실행하면 됩니다.
pl: Aby uruchomić grę, wystarczy uruchomić Godota w katalogu lub podkatalogu projektu.
ru: Чтобы запустить игру, просто запустите Godot в каталоге проекта или подкаталоге.
uk: Щоб запустити гру, просто введіть Godot в каталозі, або підкаталозі, проєкту.
zh_cn: 要运行游戏，只需在项目目录或子目录中执行 Godot 即可。
zh_tw: 欲執行遊戲，僅需於專案目錄或子目錄內執行 Godot。
