Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/unity_to_godot.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: From Unity to Godot Engine
cs: Od Unity k Godot Enginu
de: Von Unity zur Godot Engine
es: De Unity a Godot Engine
fr: De Unity à Godot Engine
ja: UnityからGodot Engineへ
ko: 유니티(Unity)에서 Godot 엔진까지
pt_br: De Unity3D à Godot Engine
ru: Из Unity в Godot
uk: З Unity до Godot Engine
zh_cn: 从 Unity 迁移到 Godot 引擎
zh_tw: 從 Unity 到 Godot Engine

source: This guide provides an overview of Godot Engine from the viewpoint of a Unity user, and aims to help you migrate your existing Unity experience into the world of Godot.
cs: Tento průvodce poskytuje přehled Godot Enginu z pohledu uživatele Unity a jeho cílem je pomoci vám přenést vaše stávající zkušenosti s Unity do světa Godotu.
de: Dieses Handbuch bietet einen Überblick über die Godot Engine aus der Sicht eines Unity-Benutzers und soll Ihnen helfen, Ihre vorhandene Unity-Erfahrung in die Welt von Godot zu migrieren.
es: Esta guía proporciona una visión general del motor Godot desde el punto de vista de un usuario Unity y apunta a ayudarte a migrar tu experiencia actual en Unity al mundo de Godot.
fr: Ce guide fournit un aperçu de Godot Engine du point de vue d’un utilisateur de Unity, et vise à faciliter la migration de votre expérience dans Unity vers le monde de Godot.
ja: このガイドでは、Unityユーザーの観点からGodotエンジンの概要を説明し、既存のUnityエクスペリエンスをGodotの世界に移行する手助けをすることを目的としています。
ko: 이 가이드는 유니티 사용자의 관점에서 Godot 엔진의 개요를 제공합니다, 그리고 존재하는 유니티 경험을 Godot라는 세상에 옮기도록 돕는 것에 중점을 둡니다.
pt_br: Este guia provê uma visão geral do motor Godot do ponto de vista de um usuário Unity, e procura te ajudar a migrar sua experiência em Unity para o mundo do Godot.
ru: Данное руководство содержит обзор движка Godot Engine с точки зрения пользователя Unity и направлено на то, чтобы помочь вам перенести ваш существующий опыт Unity в мир Godot.
uk: Цей посібник пропонує подивитися на Godot Engine з точки зору користувача Unity, і має допомогти вам перенести наявний досвід Unity у світ Godot.
zh_cn: 本指南从Unity用户的角度概述了Godot引擎, 旨在帮助你将现有的Unity体验迁移到Godot的世界中.
zh_tw: 本指南以 Unity 使用者的角度來介紹 Godot Engine，旨在幫助你把現有的 Unity 體驗遷移至 Godot 的世界中。

source: Differences
cs: Rozdíly
de: Unterschiede
es: Diferencias
fr: Différences
ja: 違い
ko: 차이점
pt_br: Diferenças
ru: Различия
uk: Відмінності
zh_cn: 差异
zh_tw: 差異

source: Unity
ko: 유니티(Unity)

source: Godot
ko: Godot(Godot)

source: License
cs: Licence
de: Lizenz
es: Licencia
fr: Licence
ja: ライセンス
ko: 라이선스
pt_br: Licença
ru: Лицензия
uk: Ліцензія
zh_cn: 许可证
zh_tw: 授權條款

source: Proprietary, closed, free license with revenue caps and usage restrictions
cs: Proprietární, uzavřená, bezplatná licence s omezením příjmů a použití
de: Proprietäre, geschlossene, kostenlose Lizenz mit Umsatzobergrenzen und Nutzungsbeschränkungen
es: Licencia propietaria, cerrada y libre con límites de ingresos y restricciones de uso
fr: Propriétaire, fermé, licence gratuite avec une limite de revenus et des restrictions d’usage
ja: 収益上限と使用制限を備えた、独自のクローズドライセンス、無料ライセンス
ko: 수익 상한과 사용 제한이 있는 독점적이고 폐쇄적인 무료 라이선스
pt_br: Proprietário, código fechado, licença grátis com teto de rendimento e restrições de uso
ru: Собственная, закрытая, бесплатная лицензия с лимитом доходов и ограничениями на использование
uk: Власна, закрита, безкоштовна ліцензія з обмеженням доходу та обмеженнями використання
zh_cn: 专有, 封闭, 有收入上限和使用限制的免费许可证
zh_tw: 專屬軟體、封閉原始碼、有限制收入上限與使用限制的免費授權條款

source: MIT license, free and fully open source without any restriction
cs: Licence MIT, svobodný a plně otevřený zdrojový kód bez jakýchkoli omezení
de: MIT-Lizenz, kostenlos und gänzlich Open-Source ohne jegliche Beschränkungen
es: Licencia MIT, libre y completamente open source sin ninguna restricción
fr: Licence MIT, libre et open source sans aucune restriction
ja: MITライセンス、自由で完全にオープンなソースを制限なし
ko: MIT 라이선스로, 어떤 제한 없이 무료이고 완전한 오픈 소스
pt_br: Licença MIT, grátis e código totalmente aberto sem nenhuma restrição
ru: Лицензия MIT, свободная и с полным открытым исходным кодом без каких-либо ограничений
uk: Ліцензія MIT, безкоштовна та повністю відкрита версія без будь-яких обмежень
zh_cn: MIT许可证, 免费, 完全开源, 没有任何限制
zh_tw: MIT 授權條款，免費自由且完全開放原始碼而不帶任何限制

source: OS (editor)
de: Betriebsystem (Editor)
fr: OS (éditeur)
ja: OS(エディタ)
ko: OS (에디터)
ru: ОС (редактор)
uk: ОС (редактор)
zh_cn: 操作系统(编辑器)
zh_tw: 作業系統（編輯器）

source: Windows, macOS, Linux (unofficial and unsupported)
es: Windows, macOS, Linux (no oficial y sin soporte)
ko: 윈도우, macOS, 리눅스 (비공식이고 지원되지 않음)
pt_br: Windows, macOS, Linux (não oficial e sem suporte)
ru: Windows, MacOS, Linux (неофициальные и неподдерживаемые)

source: Windows, macOS, X11 (Linux, \*BSD)
ko: 윈도우, macOS, X11 (리눅스, \*BSD)

source: OS (export)
es: OS (exportar)
ja: OS(エクスポート)
ko: OS (내보내기)
pt_br: OS (exportar)
ru: ОС (экспорт)
uk: ОС (експорт)
zh_cn: 操作系统 (导出)
zh_tw: 作業系統（匯出）

source: **Desktop:** Windows, macOS, Linux
es: **Escritorio:** Windows, macOS, Linux
fr: **Bureau :** Windows, macOS, Linux
ja: **デスクトップ:** Windows、macOS、Linux
ko: **데스크톱:** 윈도우, macOS, 리눅스
ru: **ПК:** Windows, MacOS, Linux
uk: **Настільні:** Windows, macOS, Linux
zh_cn: **桌面端:** Windows, macOS, Linux
zh_tw: **桌面平台：** Windows、macOS、Linux

source: **Mobile:** Android, iOS, Windows Phone, Tizen
cs: **Mobilní zařízení:** Android, iOS, Windows Phone, Tizen
es: **Móvil:** Android, iOS, Windows Phone, Tizen
ja: **モバイル:** Android、iOS、Windows Phone、Tizen
ko: **모바일:** 안드로이드, iOS, 윈도우 폰, 타이젠(Tizen)
pt_br: **Dispositivos móveis:** Android, iOS, Windows Phone, Tizen
ru: **Мобильный:** Android, iOS, Windows Phone, Tizen
uk: **Мобільні:** Android, iOS, Windows Phone, Tizen
zh_cn: **移动端:** Android, iOS, Windows Phone, Tizen
zh_tw: **行動裝置：** Android、iOS、Windows Phone、Tizen

source: **Web:** WebAssembly or asm.js
cs: ** Web: ** WebAssembly nebo asm.js
de: **Web:** WebAssembly oder asm.js
es: **Web:** WebAssembly o asm.js
ja: **Web:** WebAssemblyまたはasm.js
ko: **웹:** WebAssembly이나 asm.js
pt_br: **Web:** WebAssembly ou asm.js
ru: **Веб:** WebAssembly или asm.js
uk: **Веб:** WebAssembly чи asm.js
zh_cn: **网页:** WebAssembly 或 asm.js
zh_tw: **網頁：** WebAssembly 或 asm.js

source: **Consoles:** PS4, PS Vita, Xbox One, Xbox 360, Wii U, Nintendo 3DS
cs: **Konzole:** PS4, PS Vita, Xbox One, Xbox 360, Wii U, Nintendo 3DS
de: **Konsolen:** PS4, PS Vita, Xbox One, Xbox 360, Wii U, Nintendo 3DS
es: **Consolas:** PS4, PS Vita, Xbox One, Xbox 360, Wii U, Nintendo 3DS
ja: **コンソール:** PS4、PS Vita、Xbox One、Xbox 360、Wii U、ニンテンドー3DS
ko: **콘솔:** PS4, PS Vita, Xbox One, Xbox 360, Wii U, Nintendo 3DS
ru: *Консоли:** PS4, PS Vita, Xbox One, Xbox 360, Wii U, Nintendo 3DS
uk: **Консолі:** PS4, PS Vita, Xbox One, Xbox 360, Wii U, Nintendo 3DS
zh_cn: **游戏主机:** PS4, PS Vita, Xbox One, Xbox 360, Wii U, Nintendo 3DS
zh_tw: **遊戲主機：** PS4、PS Vita、Xbox One、Xbox 360、Wii U、Nintendo 3DS

source: **VR:** Oculus Rift, SteamVR, Google Cardboard, Playstation VR, Gear VR, HoloLens
ko: **VR:** 오큘러스 리프트, SteamVR, 구글 카드보드, 플레이스테이션 VR, Gear VR, HoloLens

source: **TV:** Android TV, Samsung SMART TV, tvOS
ko: **TV:** 안드로이드 TV, 삼성 스마트 TV, tvOS
ru: **ТВ:** Android TV, Samsung SMART TV, tvOS
uk: **ТВ:** Android TV, Samsung SMART TV, tvOS
zh_cn: **电视端:** Android TV, Samsung SMART TV, tvOS

source: **Desktop:** Windows, macOS, X11
es: **Escritorio:** Windows, macOS, X11
ja: **デスクトップ:** Windows、macOS、X11
ko: **데스크톱:** 윈도우, macOS, X11
ru: **ПК:** Windows, MacOS, X11
uk: **ОС:** Windows, macOS, X11
zh_cn: **桌面端:** Windows, macOS, X11
zh_tw: **桌面平台：** Windows、macOS、X11

source: **Mobile:** Android, iOS
cs: **Mobilní zařízení:** Android, iOS
de: **Mobil:** Android, iOS
es: **Móvil:** Android, iOS
ja: **モバイル:** Android、iOS
ko: **모바일:** 안드로이드, iOS
pt_br: **Dispositivos móveis:** Android, iOS
ru: **Мобильный:** Android, iOS
uk: **Мобільні:** Android, iOS
zh_cn: **移动端:** Android, iOS
zh_tw: **行動裝置：** Android、iOS

source: **Web:** WebAssembly
ko: **웹:** WebAssembly
ru: **Веб:** WebAssembly
uk: **Веб:** WebAssembly
zh_cn: **网页:** WebAssembly
zh_tw: **網頁：** WebAssembly

source: **Console:** See :ref:`doc_consoles`
cs: **Konzole:** Viz :ref:`doc_consoles`
de: **Konsolen:** Siehe :ref:`doc_consoles`
es: **Consolas:** Ver :ref:`doc_consoles`
fr: **Console :** Voir :ref:`doc_consoles`
ja: **コンソール:** :ref:`doc_consoles`\ を参照
ko: **콘솔:** :ref:`doc_consoles` 을 확인하세요
pt_br: **Console:** Ver :ref:`doc_consoles`
ru: *Консоли* См. :ref:`doc_consoles`
uk: **Консолі:** Дивіться :ref:`doc_consoles`
zh_cn: **游戏主机:** 见 :ref:`doc_consoles`
zh_tw: **遊戲主機：** 請參閱 :ref:`doc_consoles`

source: **VR:** Oculus Rift, SteamVR
ko: **VR:** 오큘러스 리프트, SteamVR
zh_cn: **虚拟现实端:** Oculus Rift, SteamVR

source: Scene system
cs: Systém scény
de: Szenensystem
es: Sistema de escenas
fr: Système de scène
ja: シーンシステム
ko: 씬 시스템
pt_br: Sistema de cenas
ru: Система сцен
uk: Система сцен
zh_cn: 场景系统
zh_tw: 場景系統

source: Component/Scene (GameObject > Component)
cs: Komponenta/scéna (GameObject > Komponenta)
de: Komponente/Szene (SpielObjekt > Komponente)
es: Componente/Escena (GameObject > Componente)
fr: Composant/Scène (GameObject > Composant)
ja: コンポーネント/シーン(ゲームオブジェクト>コンポーネント)
ko: 컴포넌트/씬(GameObject > Component)
pt_br: Componente/Cena (GameObject > Component)
uk: Компонент/Сцена (Об'єкт гри (GameObject) > Компонент)
zh_cn: 组件/场景 (游戏物体(GameObject) > 组件(Component))
zh_tw: 元件／場景 （遊戲物件 > 元件）

source: Prefabs
cs: Prefabrikáty
de: Vorgefertigtes
ja: プレハブ
ko: 프리펩
ru: Префабы
uk: Префаби
zh_cn: 预制体

source: :ref:`Scene tree and nodes <doc_scenes_and_nodes>`, allowing scenes to be nested and/or inherit other scenes
cs: :ref:`Strom scén a uzly <doc_scenes_and_nodes>`, umožňující vnořovat scény a/nebo dědit jiné scény
de: Mittels:ref:`Szenenbaum und Nodes <doc_scenes_and_nodes>`können Szenen in andere Szenen eingebettet und/oder vererbt werden
es: :ref:`Árbol de escenas y nodos <doc_scenes_and_nodes>`, permitiendo que las escenas se aniden y/o hereden otras escenas
fr: :ref:`Un arbre de scènes et des nœuds <doc_scenes_and_nodes>`, permettant aux scènes d’être imbriquées ou d’hériter d’autres scènes
ja: \ :ref:`Scene tree and nodes <doc_scenes_and_nodes>` 、シーンをネストしたり、他のシーンを継承したりできます
ko: :ref:`Scene tree and nodes <doc_scenes_and_nodes>`, 씬을 중첩하거나 다른 씬을 상속할 수 있습니다
pt_br: :ref:`Árvore de cenas e nós <doc_scenes_and_nodes>`, permitindo que cenas sejam aninhadas e/ou herdem outras cenas
ru: :ref:`Древо сцен и узлы <doc_scenes_and_nodes>`, позволяющие сценам быть вложенными и/или наследовать другие сцены
uk: :ref:`Scene tree and nodes <doc_scenes_and_nodes>`, дозволяє вкладати сцени та/або успадковувати інші сцени
zh_cn: :ref:`场景树和节点 <doc_scenes_and_nodes>`, 允许场景被嵌套和/或继承其他场景
zh_tw: :ref:`場景樹與節點 <doc_scenes_and_nodes>` ，可允許場景互相嵌套與／或繼承其他場景

source: Third-party tools
cs: Nástroje třetích stran
de: Third-Party Werkzeuge
es: Herramientas de terceros
fr: Outils de tierce partie
ja: サードパーティ製ツール
ko: 타사 도구
pt_br: Ferramentas de terceiros
ru: Сторонние инструменты
uk: Сторонні інструменти
zh_cn: 第三方工具
zh_tw: 第三方工具

source: Visual Studio or VS Code
cs: Visual Studio nebo VS Code
de: Visual Studio oder VS Code
es: Visual Studio o VS Code
fr: Visual Studio ou VS Code
ja: Visual StudioまたはVisual Studio Code
ko: 비주얼 스튜디오 혹은 VS Code
pt_br: Visual Studio ou VS Code
ru: Visual Studio или VS Code
uk: Visual Studio або VS Code
zh_cn: Visual Studio 或 VS Code
zh_tw: Visual Studio 或 VS Code

source: Killer features
es: Funciones destacadas
ko: 킬러 기능
pt_br: Recursos decisivos

source: Huge community
cs: Obrovská komunita
de: Gigantische Gemeinschaft
es: Gran comunidad
fr: Immense communauté
ja: 巨大なコミュニティ
ko: 거대한 커뮤니티
pt_br: Comunidade enorme
ru: Огромное сообщество
uk: Величезна громада
zh_cn: 庞大的社区
zh_tw: 龐大的社群

source: Large assets store
cs: Velký obchod se zdroji
de: Großer Assets-Laden
es: Gran almacén de recursos
fr: Grande boutique en ligne de ressources
ja: 大規模なアセットストア
ko: 넓은 에셋 스토어
pt_br: Grande armazém de recursos
ru: Большой магазин ассетов
uk: Великий магазин ассетів
zh_cn: 丰富的素材商店
zh_tw: 豐富的素材商店

source: Scene System
cs: Systém scény
de: Szenen-System
es: Sistema de Escenas
fr: Système de Scène
ja: シーンシステム
ko: 씬 시스템
pt_br: Sistema de cenas
ru: Система Сцен
uk: Система сцен
zh_cn: 场景系统
zh_tw: 場景系統

source: Debug on Device
cs: Ladění na zařízení
de: Auf Gerät debuggen
es: Depuración en el dispositivo
fr: Débogage sur appareil
ja: デバイスでのデバッグ
ko: 기기에서 디버그
pt_br: Depuração no dispositivo
ru: Отладка на устройстве
uk: Налагодження на пристрої
zh_cn: 在设备上排错
zh_tw: 可在裝置上除錯

source: The editor
cs: Editor
de: Der Editor
es: El editor
fr: L’éditeur
ja: エディタ
ko: 에디터
pt_br: O editor
ru: Редактор
uk: Редактор
zh_cn: 编辑器
zh_tw: 編輯器

source: Godot Engine provides a rich-featured editor that allows you to build your games. The pictures below display both editors with colored blocks to indicate common functionalities.
es: El motor de Godot proporciona un editor rico en características que te permite construir tus juegos. Las imágenes de abajo muestran ambos editores con bloques de color para indicar funcionalidades comunes.
ko: Godot 엔진은 당신이 게임을 만들기 위한 풍부한 기능을 가진 에디터를 제공합니다. 아래의 그림은 두 에디터 간 공통 기능을 표시하는 색칠된 사각형을 보여줍니다.
pt_br: A Godot Engine fornece um editor rico em recursos que lhe permitem construir seus jogos. As imagens abaixo exibem os dois editores com blocos coloridos para indicar funcionalidades comuns.
ru: Godot Engine предоставляет многофункциональный редактор, который позволяет вам создавать игры. На рисунках ниже показаны оба редактора с цветными блоками для обозначения общих функций.

source: Note that Godot editor allows you to dock each panel at the side of the scene editor you wish.
es: Ten en cuenta que el editor Godot te permite acoplar cada panel al lado del editor de escenas que desees.
ko: Godot 에디터는 당신이 원하는 씬 에디터 옆에 각 패널을 고정할 수 있습니다.
pt_br: Note que o editor Godot permite você encaixar cada painel ao lado do editor de cena da maneira que preferir.
ru: Обратите внимание, что редактор Godot позволяет вам закрепить любую панель к нужной стороне редактора.

source: While both editors may seem similar, there are many differences below the surface. Both let you organize the project using the filesystem, but Godot's approach is simpler with a single configuration file, minimalist text format, and no metadata. All this contributes to Godot being much friendlier to VCS systems, such as Git, Subversion, or Mercurial.
es: Aunque ambos editores puedan parecer similares, hay muchas diferencias bajo la superficie. Ambos permiten organizar el proyecto utilizando el sistema de archivos, pero el enfoque Godot es más simple, con un único archivo de configuración, un formato de texto minimalista y sin metadatos. Todo esto contribuye a que Godot sea mucho más amigable con sistemas VCS como Git, Subversion o Mercurial.
ko: 두 에디터가 비슷해 보이지만, 외양 아래에 많은 차이가 있습니다. 둘 다 파일 시스템을 사용해서 프로젝트를 조직할 수 있지만, Godot의 접근은 하나의 구성 파일, 미니멀리스트 텍스트 형식, 그리고 메타데이터가 없는 것으로 더 간단합니다. 이 모든 것이 Godot가 Git, Subversion, Mercurial와 같은 버전 관리 시스템에 훨씬 더 친숙한 데 기여합니다.
ru: Хотя оба редактора могут показаться похожими на первый взгляд, но существует много различий. Оба варианта позволяют организовать проект с использованием файловой системы, но подход Godot проще: один конфигурационный файл, минималистский текстовый формат и отсутствие метаданных. Все это способствует тому, что Godot гораздо дружелюбнее относится к системам VCS, таким как Git, Subversion или Mercurial.

source: Godot's Scene panel is similar to Unity's Hierarchy panel but, as each node has a specific function, the approach used by Godot is more visually descriptive. In other words, it's easier to understand what a specific scene does at a glance.
es: El panel de Escenas de Godot es similar al panel de Jerarquía de Unity, pero como cada nodo tiene una función específica, el enfoque utilizado por Godot es más descriptivo visualmente. En otras palabras, es más fácil entender lo que hace una escena específica a primera vista.
ko: Godot의 씬 패널은 유니티의 계층 패널과 비슷하지만,각 노드는 특정 기능을 갖고 있기 때문에, Godot에서 사용하는 접근은 더 시작적으로 묘사됩니다. 즉, 특정 씬이 한눈에 무엇을 하는지 더 쉽게 이해할 수 있습니다.
pt_br: O painel Scene da Godot é semelhante ao painel Hierarquia da Unity, mas, como cada nó tem uma função específica, a abordagem usada pela Godot é mais visualmente descritiva. Em outras palavras, é mais fácil entender o que uma cena específica faz de relance.
ru: Панель "Сцена" Godot аналогична панели "Иерархия" в Unity, но, поскольку каждый узел имеет свою специфическую функцию, подход, используемый Godot , более наглядно описывает его. Другими словами, легче понять, что делает та или иная сцена с первого взгляда.

source: The Inspector in Godot is more minimalist and designed to only show properties. Thanks to this, objects can export a much larger amount of useful parameters to the user without having to hide functionality in language APIs. As a plus, Godot allows animating any of those properties visually, so changing colors, textures, enumerations, or even links to resources in real-time is possible without involving code.
es: El Inspector en Godot es más minimalista y está diseñado para mostrar sólo propiedades. Gracias a esto, los objetos pueden exportar una cantidad mucho mayor de parámetros útiles para el usuario, sin tener que ocultar la funcionalidad en las APIs de lenguaje. Como ventaja, Godot permite animar visualmente cualquiera de esas propiedades, por lo que es posible cambiar colores, texturas, enumeraciones o incluso enlaces a recursos en tiempo real sin necesidad de utilizar código.
ko: Godot의 인스펙터는 더 미니멀리스트하고 속성 만을 보여주기 위해 설계되었습니다. 덕분에, 객체는 언어 API에서 기능성을 숨길 필요 없이 훨씬 더 넓은 유용한 매개 변수를 사용자에게 내보낼 수 있습니다. 거기에, Godot는 어떤 시각적 속성도 애니메이트 할 수 있기 때문에, 색상이나 텍스쳐, 열거, 혹은 심지어 리소스 링크를 실시간으로 변경하는 것이 코드 없이 가능합니다.
pt_br: O inspetor na Godot é mais minimalista e projetado para mostrar apenas propriedades. Graças a isso, os objetos podem exportar uma quantidade muito maior de parâmetros úteis para o usuário sem precisar ocultar a funcionalidade nas APIs de idioma. Como um acréscimo, Godot permite a animação visualmente de qualquer uma dessas propriedades, portanto é possível alterar cores, texturas, enumerações ou mesmo links para recursos em tempo real sem envolver código.
ru: Инспектор в Godot более минималистский и спроектирован так, чтобы показывать только свойства. Благодаря этому объекты могут экспортировать пользователю гораздо большее количество полезных параметров без необходимости скрывать функциональность в языковых API. К тому же, Godot позволяет визуально анимировать любое из этих свойств, поэтому изменение цвета, текстур, перечислений и даже ссылок на ресурсы в режиме реального времени возможно без использования кода.

source: Finally, the Toolbar at the top of the screen is similar in the sense that it allows controlling the project playback, but projects in Godot run in a separate window, as they don't execute inside the editor (but the tree and objects can still be explored in the debugger window).
es: Finalmente, la Barra de herramientas en la parte superior de la pantalla es similar en el sentido de que permite controlar la reproducción del proyecto, pero los proyectos en Godot se ejecutan en una ventana separada, ya que no se ejecutan dentro del editor (pero el árbol y los objetos todavía se pueden explorar en la ventana del depurador).
ko: 마지막으로, 화면 위의 툴바는 프로젝트 재생을 다루는 의미 상 비슷해 보입니다. 하지만 Godot의 프로젝트는 편집기 내부에서 실행되지 않고, 분리된 창에서 실행됩니다 (하지만 디버거 창에서 트리와 객체를 계속 탐구할 수 있습니다).
pt_br: Finalmente, a barra de ferramentas na parte superior da tela é semelhante no sentido de permitir o controle da reprodução do projeto, mas os projetos na Godot são executados em uma janela separada, pois não são executados no editor (mas a árvore e os objetos ainda podem ser explorados na janela do depurador).
ru: Наконец, панель инструментов в верхней части экрана похожа лишь тем, что позволяет управлять запуском проекта, но проекты в Godot запускаются в отдельном окне, они не выполняются внутри редактора (но дерево и объекты все еще могут быть исследованы в окне отладчика).

source: This approach has the disadvantage that the running game can't be explored from different angles (though this may be supported in the future and displaying collision gizmos in the running game is already possible), but in exchange has several advantages:
es: Este método tiene la desventaja no poder explorar el juego actual desde otros ángulos (aunque esto podría ser soportado en el futuro y actualmente ya es posible mostrar gizmos de colisión en el juego actual), pero a cambio tiene varias ventajas:
ko: 이 접근은 실행 중인 게임을 다른 각도롤 볼 수 없다는 단점이 있습니다 (이 기능을 향후 지원할지도 모르고 실행 중인 게임에 충돌 기즈모를 보여주는 것이 이미 가능합니다), 하지만 그 대가로 몇 가지 이점을 갖습니다:
pt_br: Esta abordagem tem a desvantagem de que o jogo em execução não pode ser explorado de diferentes ângulos (embora isso possa ser suportado no futuro e exibir dispositivos de colisão no jogo em execução já seja possível), mas em troca tem várias vantagens:

source: Running the project and closing it is fast (Unity has to save, run the project, close the project, and then reload the previous state).
cs: Spuštění projektu a jeho uzavření je rychlé (Unity musí projekt uložit, spustit, zavřít a poté znovu načíst předchozí stav).
de: Das Projekt abzuspielen und es zu schließen geht schnell (Unity muss dagegen z.B. das Projekt abspeichern, abspielen, schließen, und dann den vorherigen Stand neuladen).
es: Ejecutar el proyecto y cerrarlo es rápido (Unity tiene que guardar, ejecutar el proyecto, cerrar el proyecto, y luego recargar el estado anterior).
fr: Lancer le projet et le fermer est rapide (Unity doit sauvegarder, exécuter le projet, fermer le projet, puis recharger l'état précédent).
ja: プロジェクトの実行と終了は高速です (Unity は、プロジェクトを保存して実行し、プロジェクトを閉じてから、前の状態を再度読み込む必要があります)。
ko: 프로젝트를 실행하고 종료하는 것이 빠릅니다 (유니티는 저장하고, 프로젝트를 실행하고, 프로젝트를 종료하고, 그리고 이전 상태를 다시 불러와야 합니다).
pt_br: Executar o projeto e fechá-lo é rápido (A Unity precisa salvar, executar o projeto, fechar o projeto e, em seguida, recarregar o estado anterior).
ru: Запуск и закрытие проекта происходит быстро (Unity же сохраняет, запускает проект, закрывает его, а затем перезагружает предыдущее состояние проекта).
uk: Швидкий запуск проекту та його закриття (Unity мусить зберегти, запустити проект, закрити проект, а потім перезавантажити попередній стан).
zh_cn: 运行项目以及关闭它的速度很快(Unity必须保存, 运行项目, 关闭项目, 然后重新加载先前的状态).
zh_tw: 可快速執行專案與關閉專案（Unity 上必須先保存、執行專案、關閉專案、然後恢復前一個狀態）。
