Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/unity_to_godot.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: As you can see, every scene is organized as a tree. The same goes for nodes' properties: you don't *add* a collision component to a node to make it collidable like Unity does. Instead, you make this node a *child* of a new specific node that has collision properties. Godot features various collision types nodes, depending on the usage (see the :ref:`Physics introduction <doc_physics_introduction>`).
cs: Jak vidíte, každá scéna je uspořádána jako strom. Totéž platí pro vlastnosti uzlů: k uzlu nepřidáváte kolizní komponentu, aby byl kolizní, jako to dělá Unity. Místo toho z tohoto uzlu uděláte *potomka* nového specifického uzlu, který má kolizní vlastnosti. Godot obsahuje různé typy kolizních uzlů v závislosti na použití (viz :ref:`Physics introduction <doc_physics_introduction>`).
de: Wie Sie bereits sehen können ist jede Szene wie ein Baum organisiert. Dasselbe gilt für Node-Eigenschaften: Sie fügen *nicht* eine Kollisionskomponente zu einem Node hinzu, wie Sie es bei Unity tun würden. Anstelle dessen machen Sie jenen Node zum Unterobjekt. Godot stellt diverse Kollisionstypen bereit, abhängig von der Verwendung (siehe :ref:`Einleitung Physik<doc_physics_introduction>`).
es: Como puedes ver, cada escena está organizada como un árbol. Lo mismo ocurre con las propiedades de los nodos: no se *añade* un componente de colisión a un nodo para hacerlo colisionable como lo hace Unity. En su lugar, este nodo se convierte en *hijo* de un nuevo nodo específico que tiene propiedades de colisión. Godot dispone de varios tipos de nodos de colisión, dependiendo del uso (ver :ref:`Physics introduction <doc_physics_introduction>`).
fr: Comme vous pouvez le voir, chaque scène est organisée en arborescence. Il en va de même pour les propriétés des nœuds : vous n’ajoutez pas un composant de collision à un nœud pour le rendre réactif aux collisions, contrairement à Unity. Au lieu de cela, vous faites de ce nœud un *enfant* d'un nouveau nœud spécifique possédant des propriétés de collision. Godot propose différents types de nœuds de collision, en fonction de l'utilisation (voir :ref:`Introduction à la physique <doc_physics_introduction>`).
ja: ご覧のとおり、すべてのシーンはツリーとして整理されています。ノードのプロパティについても同じことが言えます。コリジョンコンポーネントをノードに *追加* して、Unityのように衝突可能にしないでください。代わりに、このノードを衝突プロパティを持つ新しい特定のノードの *子* にします。 Godotには、使用法に応じてさまざまな衝突タイプのノードがあります( :ref:`Physics introduction <doc_physics_introduction>` を参照)。
ko: 보시다시피, 모든 씬이 트리로 조직됩니다. 노드의 속성도 동일합니다: 유니티처럼 노드가 충돌 가능하도록 충돌 구성 요소를 *추가* 할 수는 없습니다. 대신 충돌 속성을 가진 새로운 특정 노드를 *자식* 으로 만들 수 있습니다. Godot는 사용법에 따른 다양한 충돌 타입 노드가 있습니다 (:ref:`물리 소개 <doc_physics_introduction>`\ 를 참고하세요).
ru: Как видите, каждая сцена организована в виде дерева. То же самое можно сказать и о свойствах самих узлов: вы не добавляете к узлу *коллизию*, чтобы дать ему возможность сталкиваться, как это делает Unity. Вместо этого, вы делаете этот узел *ребенком* нового узла, который имеет свойство столкновения. Godot имеет различные типы узлов столкновений, в зависимости от использования (см. :ref:`Введение в физику <doc_physics_introduction>`).
uk: Як бачите, кожна сцена організована в вигляді дерева. Те саме стосується властивостей вузлів: ви не *додаєте* компонент зіткнення до вузла, щоб зробити його збірним, як це робиться в Unity. Натомість ви робите цей вузол *нащадком* нового певного вузла, який має властивості зіткнення. У Godot є різні вузли зіткнення типів, залежно від використання (дивіться :ref:`Physics introduction <doc_physics_introduction>`).
zh_cn: 如您所见, 每个场景都被组织成一棵树. 节点的属性也是如此: 您不会像Unity那样向节点 *添加* 一个碰撞组件以使其可碰撞. 相反, 您可以使该节点创建一个 *子级* 节点, 即具有碰撞属性的新特定节点 .Godot根据用途使用各种碰撞类型节点(请参阅 :ref:`物理介绍 <doc_physics_introduction>`).
zh_tw: 就像這樣，所有場景都以樹狀結構來組織。節點的屬性也一樣：我們不像 Unity 那樣給節點 **加上** 碰撞元件來讓元件可碰撞，而是將節點設為有碰撞屬性節點的 **子節點** 。Godot 根據用途的不同，提供了多種碰撞型別節點（請參考 :ref:`物理系統介紹 <doc_physics_introduction>` ）。

source: Question: What are the advantages of this system? Wouldn't this system potentially increase the depth of the scene tree? Besides, Unity allows organizing GameObjects by putting them in empty GameObjects.
es: Pregunta: ¿Cuáles son las ventajas de este sistema? ¿No aumentaría potencialmente este sistema la profundidad del árbol de la escena? Además, Unity permite organizar GameObjects poniéndolos en GameObjects vacíos.
ko: 문제: 이 시스템의 장점은 무엇일까요? 이 시스템이 잠재적으로 씬 트리의 깊이를 증가시키지 않을까요? 게다가, 유니티는 비어있는 GameObjects에 그들을 넣어서 GameObjects를 조직할 수 있습니다.
pt_br: Pergunta: Quais são as vantagens deste sistema? Esse sistema não aumentaria potencialmente a profundidade da árvore de cena? Além disso, a Unity permite organizar GameObjects colocando-os em GameObjects vazios.
ru: Вопрос: Каковы преимущества этой системы? Разве эта система не увеличит сложность древа сцены? Кроме того, Unity позволяет организовывать GameObjects, помещая их в пустые GameObjects.

source: First, this system is closer to the well-known object-oriented paradigm: Godot provides a number of nodes which are not clearly "Game Objects", but they provide their children with their own capabilities: this is inheritance.
es: En primer lugar, este sistema se acerca más al conocido paradigma orientado a objetos: Godot proporciona una serie de nodos que no son claramente "Objetos de Juego", pero que proporcionan a sus hijos sus propias capacidades: esto es herencia.
ko: 먼저, 이 시스템은 잘 알려진 객체 기반 어형 변화표와 근접합니다: Godot는 분명하지 않은 "Game Objects"인 여러 노드들을 제공합니다, 하지만 그들은 자식에게 자신의 능력을 제공합니다: 이것이 상속입니다.
pt_br: Em primeiro lugar, este sistema está mais próximo do paradigma bem conhecido orientado a objetos: Godot fornece um número de nós que não são claramente "Objetos de Jogo", mas eles fornecem seus filhos com suas próprias capacidades: isto é herança.
ru: Во-первых, эта система ближе к известной объектно-ориентированной парадигме: Godot предоставляет ряд узлов, которые не являются однозначно "игровыми объектами", но они предоставляют своим детям собственные возможности: это наследование.

source: Second, it allows the extraction of a subtree of the scene to make it a scene of its own, which answers the second and third questions: even if a scene tree gets too deep, it can be split into smaller subtrees. This also allows a better solution for reusability, as you can include any subtree as a child of any node. Putting multiple nodes in an empty GameObject in Unity does not provide the same possibility, apart from a visual organization.
es: En segundo lugar, permite extraer un subárbol de escena para convertirlo en una escena propia, lo que responde a las preguntas segunda y tercera: incluso si un árbol de escena se profundiza demasiado, puede dividirse en subárboles más pequeños. Esto también permite una mejor solución para la reutilización, ya que puede incluir cualquier subárbol como hijo de cualquier nodo. Poner múltiples nodos en un GameObject vacío en Unity no proporciona la misma posibilidad, aparte de una organización visual.
ko: 두 번째로, 씬의 하위 트리를 추출하여 고유의 씬을 만들 수 있습니다, 이걸로 두 번째와 세 번째 문제에 답할 수 있습니다: 비록 씬 트리가 너무 깊어지더라도, 더 작은 하위 트리로 나눌 수 있습니다. 또한 하위 트리가 어떤 노드의 자식이든지 추가될 수 있다는 점에서 재 사용 가능성에 더 좋은 해결책이 됩니다. 유니티에서 빈 GameObject에 많은 노드를 넣는 것으로는 시각적인 조직과는 별개로, 이와 같은 가능성을 제공하진 못합니다.
ru: Во-вторых, выделение поддерева сцены позволяет сделать из него собственную сцену, что отвечает на второй и третий вопросы: даже если древо сцены становится слишком глубоким, его можно разделить на более мелкие. Это также позволяет найти лучшее решение для многократного использования, поскольку вы можете включить любое поддерево в качестве дочернего узла любого другого узла. Размещение нескольких узлов в пустом GameObject в Unity не дает одинаковых возможностей, за исключением визуальной организации.

source: These are the most important concepts you need to remember: "node", "parent node", and "child node".
es: Estos son los conceptos más importantes que necesitas recordar: "nodo", "nodo padre" y "nodo hijo".
ko: 기억해야 할 가장 중요한 개념들 입니다: "노드", "부모 노드" 그리고 "자식 노드".
pt_br: Estes são os conceitos mais importantes que você precisa lembrar: "nó", "nó pai" e "nó filho".
ru: Это наиболее важные понятия, которые вы должны запомнить: "узел", "родительский узел" и "дочерний узел".

source: Project organization
cs: Organizace projektu
de: Projekt Organisation
es: Organización del proyecto
fr: Organisation du projet
ja: プロジェクトの構成
ko: 프로젝트 조직
pt_br: Organização do projeto
ru: Организация проекта
uk: Організація проекта
zh_cn: 项目组织
zh_tw: 組織專案

source: We previously observed that there is no perfect solution to set a project architecture. Any solution will work for Unity and Godot, so this point has a lesser importance.
es: Anteriormente observamos que no existe una solución perfecta para establecer una arquitectura de proyecto. Cualquier solución funcionará para Unity y Godot, así que este punto tiene una importancia menor.
ko: 우리는 이전에 프로젝트 구조를 설정하는 완벽한 해결책이 없다는 것을 인지하였습니다. 어떤 해결책이든 유니티와 Godot를 위해 작동할 것이기에, 이 점은 덜 중요합니다.
pt_br: Observamos anteriormente que não há solução perfeita para definir uma arquitetura de projeto. Qualquer solução funcionará para a Unity e Godot, então este ponto tem uma importância menor.
ru: Ранее мы уже отмечали, что не существует идеального решения для создания структуры проекта. Любое решение будет работать на Unity и Godot, поэтому этот момент не имеет большого значения.

source: However, we often observe a common architecture for Unity projects, which consists of having one Assets folder in the root directory that contains various folders, one per type of asset: Audio, Graphics, Models, Materials, Scripts, Scenes, etc.
es: Sin embargo, a menudo observamos una arquitectura común para los proyectos de Unity, que consiste en tener una carpeta Assets en el directorio raíz que contiene varias carpetas, una por tipo de recurso: Audio, Graphics, Models, Materials, Scripts, Scenes, etc.
ko: 하지만, 우리는 종종 유니티 프로젝트를 위한 공통 구조를 발견합니다, 하나의 Assets 폴더가 루트 디렉토리로 하여 타입에 맞는 다양한 폴더를 가지고 있습니다: Audio, Graphics, Models, Materials, Scripts, Scenes 등.
pt_br: Observamos anteriormente que não há solução perfeita para definir uma arquitetura de projeto. Qualquer solução funcionará para a Unity e a Godot, então este ponto tem uma importância menor.
ru: Однако мы часто наблюдаем общую архитектуру для проектов Unity, состоящая из одной папки Assets в корневом каталоге, которая содержит различные папки, по одной на каждый тип ресурса: аудио, графика, модели, материалы, скрипты, сцены и т. д.

source: As described before, the Godot scene system allows splitting scenes into smaller scenes. Since each scene and subscene is actually one scene file in the project, we recommend organizing your project a bit differently. This wiki provides a page for this: :ref:`doc_project_organization`.
es: Como se ha descrito anteriormente, el sistema de escenas Godot permite dividir escenas en escenas más pequeñas. Dado que cada escena y subescena es en realidad un archivo de escena en el proyecto, recomendamos organizar el proyecto de forma un poco diferente. Este wiki proporciona información al respecto: :ref:`doc_project_organization`.
ko: 앞에서 설명한 것처럼, Godot 씬 시스템은 씬을 더 작은 씬으로 분리합니다. 각 씬과 하위 씬은 사실 프로젝트에서 하나의 씬 파일이기 때문에, 우리는 프로젝트를 약간 다르게 구성하기를 추천합니다. 이 위키는 이것을 위한 페이지를 제공합니다: :ref:`doc_project_organization`.
pt_br: Como descrito anteriormente, o sistema de cenas da Godot permite dividir as cenas em cenas menores. Como cada cena é uma sub-cena, na verdade, um arquivo de cena no projeto, recomendamos que você organize seu projeto de maneira um pouco diferente. Este wiki fornece uma página para isto:: ref: `doc_project_organization`.
ru: Как было сказано ранее, система сцен Godot позволяет разбивать сцены на сцены поменьше. Поскольку каждая сцена и под-сцена в действительности представляют собой один файл сцены в проекте, мы рекомендуем организовать ваш проект немного по-другому. Вот страница вики: :ref:`doc_project_organization`.

source: Where are my prefabs?
cs: Kde jsou mé prefabrikáty?
de: Wo sind meine Vorlagen?
es: ¿Dónde están mis prefabs?
fr: Où sont mes prefabs (préfabriqués) ?
ja: プレハブはどこですか?
ko: 프리펩은 어디갔나요?
pt_br: Onde estão meus prefabs?
ru: Где мои префабы?
uk: Де мої префаби?
zh_cn: 我的预制体在哪里？
zh_tw: Prefabs 跑去哪了？

source: The concept of prefabs as provided by Unity is a 'template' element of the scene. It is reusable, and each instance of the prefab that exists in the scene has an existence of its own, but all of them have the same properties as defined by the prefab.
es: El concepto de prefabs que proporciona Unity es un elemento 'plantilla' de la escena. Es reutilizable, y cada instancia del prefab que existe en la escena es único, pero todos tienen las mismas propiedades definidas por el prefab.
ko: 유니티가 제공하는 프리펩의 개념은 씬의 '템플릿' 요소입니다. 그것은 씬에 존재하는 재 사용이 가능하며 씬에 존재하는 프리펩의 각 인스턴스는 주체성이 있지만, 이 모두는 프리펩에 의해 정의된 같은 속성을 지닙니다.
pt_br: O conceito de prefabs fornecido pela Unity é um elemento "modelo" da cena. É reutilizável, e cada instância do prefab que existe na cena tem uma existência própria, mas todas elas têm as mesmas propriedades definidas pelo prefab.
ru: Концепция префабов, предложенная Unity, является "шаблонным" элементом сцены. Он многоразовый, и каждый экземпляр префаба, который существует в сцене, имеет свои особенности, но все они имеют те же самые свойства, что определены префабом.

source: Godot does not provide prefabs as such, but this functionality is here, again, filled thanks to its scene system: As we saw, the scene system is organized as a tree. Godot allows you to save a subtree of a scene as its own scene, thus saved into its own file. This new scene can then be instanced as many times as you want. Any change you make to this new, separate scene will be applied to its instances. However, any change you make to the instance will not have any impact on the 'template' scene.
es: Godot no proporciona prefabs como tales, pero esta funcionalidad se encuentra disponible gracias al sistema de escenas: como vimos el sistema de escenas está organizado como un árbol. Godot permite guardar un subárbol de una escena como una escena propia, guardada en su propio archivo. Esta nueva escena puede ser instanciada tantas veces como se desee. Cualquier cambio que se realice en esta nueva escena separada se aplicará a sus instancias. Sin embargo, cualquier cambio que se realice en la instancia no tendrá ningún impacto en la escena `plantilla'.
ko: Godot는 그러한 프리펩을 제공하진 않지만, 씬 시스템 덕분에 그 기능이 있습니다: 우리가 씬 시스템이 트리처럼 조직된 것을 보셨습니다. Godot는 씬의 하위 트리를 자체 씬으로 저장하여 자체 파일로 저장합니다. 이 새로운 씬은 그 뒤 원하는 만큼 인스턴스 될 수 있습니다. 이 새로운 씬에 준 변화는 모든 인스턴스에 적용될 것입니다. 하지만 그 변화가 '템플릿' 씬에 영향을 주지는 않을 것입니다.
ru: Godot не предоставляет префабов как таковых, но их функциональность может быть заменена благодаря системе сцен: Как мы видели, система сцен организована как дерево. Godot позволяет сохранить поддерево сцены в качестве собственной сцены и сохранить его в отдельный файл. Эта новая сцена может повторяться столько раз, сколько вы захотите. Любые изменения, внесенные в эту новую, отдельную сцену, будут применены к ее экземплярам. Однако любые изменения, которые вы внесете в экземпляр, не будут иметь никакого влияния на шаблон этой сцены.

source: To be precise, you can modify the parameters of the instance in the Inspector panel. However, the nodes that compose this instance are locked although you can unlock them if you need to by right-clicking the instance in the Scene tree and selecting "Editable children" in the menu. You don't need to do this to add new children nodes to this node, but it is possible. Remember that these new children will belong to the instance, not the 'template' scene. If you want to add new children to all the instances of your 'template' scene, then you need to add them in the 'template' scene.
es: Para ser precisos, se pueden modificar los parámetros de la instancia en el panel Inspector. Sin embargo, los nodos que componen esta instancia están bloqueados y pueden desbloquearse si fuera necesario haciendo clic con el botón derecho del ratón en la instancia en el Árbol de escenas y seleccionando "Hijos Editables" en el menú. No es necesario hacer esto para añadir nuevos nodos hijos a este nodo, pero recuerda que estos nuevos hijos pertenecerán a la instancia, no a la escena 'plantilla'. Si quieres añadir nuevos hijos a todas las instancias de tu escena `plantilla', entonces necesitas añadirlo una vez en la escena `plantilla'.
ko: 정확하게 말하면, 당신은 인스펙터 패널에서 인스턴스의 매개 변수를 수정할 수 있습니다. 하지만, 비록 당신이 씬 트리에서 인스턴스를 우클릭하고 "자식노드 편집 가능"를 선택하여 인스턴스를 잠금 해제할 수 있지만 이 인스턴스를 만드는 노드는 잠겨있습니다. 새 자식 노드를 추가하려고 이 작업을 할 필요는 없지만 가능은 합니다. 새 자식 은 인스턴스에 속해 있습니다, '템플릿' 씬이 아닙니다. '템플릿' 씬의 모든 인스턴스에 새 자식을 추가하려면, '템플릿' 씬에 새 자식을 추가해야 합니다.
pt_br: Para ser preciso, você pode modificar os parâmetros da instância no painel Inspetor. No entanto, os nós que compõem essa instância são bloqueados, embora você possa desbloqueá-los se precisar clicando com o botão direito do mouse na árvore Scene e selecionando "Editable children" no menu. Você não precisa fazer isso para adicionar novos nós filhos a esse nó, mas é possível. Lembre-se de que esses novos filhos pertencerão à instância, não à cena "modelo". Se você quiser adicionar novos filhos a todas as instâncias da sua cena de 'modelo', você precisa adicioná-los na cena 'modelo'.
ru: Если быть точным, вы можете изменить параметры экземпляра в Инспекторе. Однако узлы, составляющие этот экземпляр, заблокированы, хотя вы можете разблокировать их, если вам нужно, щелкнув правой кнопкой мыши на экземпляре в дереве сцены и выбрав "Editable children" в меню. Вам не нужно делать этого, чтобы добавлять новые дочерние узлы в этот узел, но это возможно. Помните, что эти новые дети будут принадлежать экземпляру, а не "шаблонной" сцене. Если вы хотите добавить новых детей во все экземпляры вашей сцены 'шаблона', то вам нужно добавить их в сцену 'шаблона'.

source: Glossary correspondence
cs: Glosář shod
de: Glossar Korrespondenz
es: Correspondencia del glosario
fr: Correspondance de glossaire
ja: 用語集の対応
ko: 어휘 일치
pt_br: Correspondência do glossário
uk: Відповідність слів
zh_cn: 术语对应
zh_tw: 對應的術語

source: GameObject -> Node
cs: GameObject -> Uzel
de: SpielObject (GameObject) -> Node
es: GameObject -> Nodo
ja: GameObject(ゲームオブジェクト) -> Node(ノード)
ko: GameObject -> 노드
uk: GameObject (Об'єкт гри) -> Node (Вузол)
zh_cn: 游戏对象(GameObject) -> 节点(Node)
zh_tw: GameObject -> Node（節點）

source: Add a component -> Inheriting
cs: Přidání komponenty -> Dědičnost
de: Füge eine Komponente hinzu -> Vererbung
es: Add a component -> Heredar
fr: Ajouter un composant -> Hériter
ja: Add a component(コンポーネントの追加) -> Inheriting(インスタンス化)
ko: 컴포넌트 추가 -> 상속
ru: Добавление компонента -> Наследование
uk: Додавання компонента -> Спадковість
zh_cn: 添加组件(Add a component) -> 继承(Inheriting)
zh_tw: 新增元件 -> 繼承

source: Prefab -> Externalized branch
es: Prefab ->Rama externalizada
ko: 프리펩 -> 외부화된 분기
ru: Prefab -> Внешняя ветвь

source: Scripting: GDScript, C# and Visual Script
cs: Skriptování: GDScript, C# a Visual Script
de: Skripting: GDScript, C# und VisualScript
es: Scripting: GDScript, C# y Visual Script
fr: Scripting : GDScript, C# et Visual Script
ja: スクリプト: GDScript、C#、ビジュアルスクリプト
ko: 스크립팅: GDScript, C# and Visual Script
pt_br: Scripting: GDScript, C # e Visual Script
ru: Скриптинг: GDScript, C# и Visual Script
uk: Написання скриптів: GDScript, C# і Visual Script
zh_cn: 编写脚本：GDScript、C# 和 Visual Script
zh_tw: 撰寫腳本：GDScript、C#、與視覺腳本 (VisualScript)

source: Design
de: Gestaltung
es: Diseño
fr: Conception
ja: デザイン
ko: 디자인
ru: Разработка
uk: Дизайн
zh_cn: 设计
zh_tw: 設計

source: As you may know already, Unity supports C#. C# benefits from its integration with Visual Studio and other features, such as static typing.
es: Como ya sabrás, Unity soporta C#. C# se beneficia de su integración con Visual Studio y otras características, como el tipado estático.
ko: 이미 알고 계시겠지만, Unity는 C#을 지원합니다. C#은 Visual Studio 및 정적 타입과 같은 다른 기능과의 통합을 통해 이익을 얻습니다.
pt_br: Como você já deve saber, a Unity suporta o C #. O C # se beneficia da integração com o Visual Studio e de outros recursos, como a digitação estática.
ru: Как вы уже знаете, Unity поддерживает C#. C# выгодный из-за интеграции с Visual Studio и других возможностей, таких как статическая типизация.

source: Godot provides its own scripting language, :ref:`GDScript <doc_scripting>` as well as support for :ref:`Visual Script <toc-learn-scripting-visual_script>` and :ref:`C# <doc_c_sharp>`. GDScript borrows its syntax from Python, but is not related to it. If you wonder about the reasoning for a custom scripting language, please read the :ref:`doc_gdscript` and :ref:`doc_faq` pages. GDScript is strongly attached to the Godot API and is really easy to learn: Between one evening for an experienced programmer and a week for a complete beginner.
es: Godot proporciona su propio lenguaje de scripting, :ref:`GDScript <doc_scripting>` así como soporte para :ref:`Visual Script <toc-learn-scripting-visual_script>` y :ref:`C# doc_c_sharp`. GDScript toma prestada su sintaxis de Python, pero no está relacionada con este. Si te preguntas sobre el razonamiento de un lenguaje de scripting personalizado, por favor lee las páginas :ref:`doc_gdscript` y :ref:`doc_faq`. GDScript está fuertemente unido a la API de Godot y es muy fácil de aprender: Entre una noche para un programador experimentado y una semana para un principiante.
ko: Godot는 독자적인 스크립트 언어를 제공합니다, :ref:`GDScript <doc_scripting>`\ 와 :ref:`Visual Script <toc-learn-scripting-visual_script>`, 그리고 :ref:`doc_c_sharp`\ 을 지원합니다. GDScript는 Python의 문법을 빌려오지만, 관련은 없습니다. 커스텀 스크립트 언어를 쓰는 이유가 궁금하시다면, :ref:`doc_gdscript`\ 와 :ref:`doc_faq`\ 페이지를 읽어주시기 바랍니다. GDScript는 Godot API와 밀접하고 배우기 쉽습니다: 숙련된 프로그래머든지 막 개발을 시작한 사람이든지 말입니다.
ru: Godot предоставляет собственный скриптовый язык, :ref:`GDScript <doc_scripting>`, а также поддержку :ref:`Visual Script <toc-learn-scripting- Visual_script>` и :ref:`C# <doc_c_sharp>`. GDScript берет свой синтаксис из Python, но не связан с ним. Если вы задаетесь вопросом о причинах создания своего скриптового языка, прочитайте, пожалуйста, страницы :ref:`doc_gdscript` и :ref:`doc_faq`. GDScript тесно связан с API Godot и его очень легко освоить: Один вечер для опытного программиста и неделя для новичка.

source: Unity allows you to attach as many scripts as you want to a GameObject. Each script adds a behaviour to the GameObject: For example, you can attach a script so that it reacts to the player's controls, and another that controls its specific game logic.
es: Unity te permite adjuntar tantos scripts como quieras a un GameObject. Cada script añade un comportamiento al GameObject: por ejemplo, se puede adjuntar un script para que reaccione a los controles del jugador y otro para que controle su lógica de juego específica.
ko: 유니티는 GameObject에 원하는 만큼의 스크립트를 붙일 수 있습니다. 각 스크립트는 GameObject에 행동을 추가합니다: 예를 들어 스크립트를 붙여서 플레이어의 조작이나 특정 게임을 조작하는 다른 것을 넣을 수 있습니다.
pt_br: Unity permite que você anexe quantos scripts quiser a um GameObject. Cada script adiciona um comportamento ao GameObject: Por exemplo, você pode anexar um script para que ele reaja aos controles do player e outro que controle sua lógica de jogo específica.
ru: Unity позволяет вам прикреплять к GameObject столько скриптов, сколько вы хотите. Каждый скрипт добавляет что-то в GameObject: Например, вы можете прикрепить скрипт так, чтобы он реагировал на действия игрока, а другой скрипт управлял его игровой логикой.
