Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/unity_to_godot.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: In Godot, you can only attach one script per node. You can use either an external GDScript file or include the script directly in the node. If you need to attach more scripts to one node, then you may consider two solutions, depending on your scene and on what you want to achieve:
cs: V systému Godot můžete k jednomu uzlu připojit pouze jeden skript. Můžete použít buď externí soubor GDScript, nebo skript vložit přímo do uzlu. Pokud potřebujete k jednomu uzlu připojit více skriptů, můžete zvážit dvě řešení v závislosti na vaší scéně a na tom, čeho chcete dosáhnout:
de: In Godot kann nur ein Skript pro Node angehängt werden. Es kann entweder ein externes GDSkript genutzt werden, oder dies wird direkt im entsprechendem Node eingefügt. Falls es nötig sein sollte mehrere Skripte an einen einzigen Node zu hängen, hat man zwei Möglichkeiten, abhängig von der Szene und was man erreichen möchte:
es: En Godot, sólo puedes adjuntar un script por nodo. Se puede utilizar un archivo GDScript externo o incluirlo directamente en el nodo. Si necesitas adjuntar más scripts a un nodo, entonces puedes considerar dos soluciones, dependiendo de tu escena y de lo que quieras lograr:
fr: Dans Godot, vous ne pouvez joindre qu'un seul script par nœud. Vous pouvez utiliser un fichier GDScript externe ou inclure le script directement dans le nœud. Si vous avez besoin d'attacher plus de scripts à un nœud, vous pouvez envisager deux solutions en fonction de votre scène et de ce que vous souhaitez réaliser :
ja: Godotでは、ノードごとに1つのスクリプトのみを添付できます。外部GDScriptファイルを使用するか、スクリプトをノードに直接含めることができます。 1つのノードにさらにスクリプトをアタッチする必要がある場合、シーンと目的に応じて、2つの解決策を検討できます。
ko: Godot에서, 우리는 각 노드에 하나의 스크립트만 붙일 수 있습니다. 외부 GDScript 파일이나 노드에 스크립트를 직접 넣어서 사용할 수 있습니다. 한 노드에 더 많은 스크립트를 붙이고 싶다면, 씬이랑 원하는 것을 얻기 위해, 두 가지 방안을 고려하셔야 합니다:
pt_br: Em Godot, você só pode anexar um script por nó. Você pode usar um arquivo GDScript externo ou incluir o script diretamente no nó. Se você precisar anexar mais scripts a um nó, considere duas soluções, dependendo da cena e do que deseja alcançar:
ru: В Godot, вы можете прикрепить только один скрипт на каждый узел. Вы можете использовать либо внешний файл GDScript, либо встроить скрипт непосредственно в узел. Если вам нужно прикрепить несколько скриптов к одному узлу, то вы можете рассмотреть два решения, в зависимости от вашей сцены и от того, чего вы хотите достичь:
uk: У Godot ви можете приєднати лише один скрипт на вузол. Ви можете використовувати, або зовнішній файл GDScript, або включати скрипт безпосередньо у вузол. Якщо вам потрібно приєднати більше скриптів до одного вузла, ви можете розглянути два рішення, залежно від сцени та того, чого ви хочете досягти:
zh_cn: 在Godot中, 每个节点只能附加一个脚本. 您可以使用外部GDScript文件, 也可以将脚本直接包含在节点中. 如果需要将更多脚本附加到一个节点, 则可以根据场景和要实现的目标考虑两种解决方案:
zh_tw: 在 Godot 中，每個節點都只能附加一個腳本，可以使用外部 GDScript 檔案或是直接在節點中包含腳本。若需要對一個節點附加超過一個的腳本，則可以依據場景與目的考慮兩種解決方法：

source: either add a new node between your target node and its current parent, then add a script to this new node.
cs: buď přidejte nový uzel mezi cílový uzel a jeho současného rodiče, a pak do tohoto nového uzlu přidejte skript.
de: füge ein neues Node zwischen Zielnode und aktuellem Parent-Node hinzu, dann hefte ein Skript an dieses neue Node an.
es: puedes añadir un nuevo nodo entre tu nodo de destino y su padre actual, y luego añadir un script a este nuevo nodo.
fr: soit ajouter un nouveau nœud entre votre nœud cible et son parent actuel, puis ajouter un script à ce nouveau nœud.
ja: ターゲットノードと現在の親ノードの間に新しいノードを追加し、この新しいノードにスクリプトを追加します。
ko: 대상 노드와 현재 부모 노드 사이에 새 노드를 추가 한 다음, 이 노드에 스크립트를 추가합니다.
pt_br: adicione um novo nó entre o nó de destino e seu pai atual e adicione um script a esse novo nó.
ru: либо добавить новый узел между вашим выбранным узлом и его текущим родителем, а затем добавить скрипт к этому новому узлу.
uk: або додати новий вузол між вашим цільовим вузлом та його поточним предком, а потім додати скрипт до цього нового вузла.
zh_cn: 在目标节点与其当前父节点之间添加一个新节点, 然后向该新节点添加脚本.
zh_tw: 在目標節點與目前的母節點間再新增一個節點，然後將腳本附加到新建立的節點上。

source: or, you can split your target node into multiple children and attach one script to each of them.
cs: nebo můžete cílový uzel rozdělit na více podřízených uzlů a ke každému z nich připojit jeden skript.
de: oder Sie teilen Ihr Ziel-Node in mehrere Unterobjekte und heften dann ein Skript an jedes davon an.
es: o bien, puedes dividir tu nodo objetivo en varios hijos y adjuntar un script a cada uno de ellos.
fr: ou, vous pouvez diviser votre nœud cible en plusieurs enfants et joindre un script à chacun d'eux.
ja: または、ターゲットノードを複数の子に分割し、それぞれに1つのスクリプトをアタッチできます。
ko: 또는, 대상 노드를 여러 자식 노드로 분할하고 각각마다 하나의 스크립트를 붙일 수 있습니다.
ru: или, вы можете разделить ваш узел на несколько дочерних узлов и прикрепить по одному скрипту на каждый из них.
uk: або, ви можете розділити свій цільовий вузол на кілька нащадків і приєднати по одному скрипту до кожного з них.
zh_cn: 或者, 您可以将目标节点拆分为多个子节点, 并在每个子节点上附加一个脚本.
zh_tw: 將目標節點拆分成多個子節點，然後為每個節點都附加一個腳本。

source: As you can see, it can be easy to turn a scene tree to a mess. This is why it is important to have a real reflection and consider splitting a complicated scene into multiple, smaller branches.
es: Como puedes ver, es muy sencillo convertir un árbol de escenas en un desastre. Por eso es importante tener una auténtica reflexión, y considerar dividir una escena compleja en múltiples ramas más pequeñas.
ko: 보시다시피 씬 트리를 뒤죽박죽으로 만드는 것은 쉽습니다. 그렇기 때문에 실제 상황을 반영하고 복잡한 씬을 여러 개의 작은 분기로 나누는 것이 중요합니다.
pt_br: Como você pode ver, pode ser fácil transformar uma cena em uma bagunça. É por isso que é importante ter uma reflexão real e considerar a divisão de uma cena complicada em vários ramos menores.
ru: Как видите, древо сцены легко захламить. Вот почему важно обдумать возможность разделения сложной сцены на несколько, более мелких ветвей.

source: Connections: groups and signals
cs: Spojení: skupiny a signály
de: Verbindungen: Gruppen und Signale
es: Conexiones: grupos y señales
fr: Connexions : groupes et signaux
ja: 接続:グループとシグナル
ko: 연결: 그룹과 시그널
pt_br: Conexões: grupos e sinais
ru: Связи: группы и сигналы
uk: Зв'язки: групи і сигнали
zh_cn: 连接: 编组和信号
zh_tw: 連接：群組與訊號

source: You can control nodes by accessing them via script and calling built-in or user-defined functions on them. You can also place nodes in a group and call functions on all nodes in this group. See more in the :ref:`scripting documentation <doc_scripting_continued>`.
cs: Uzly můžete ovládat tak, že k nim přistupujete pomocí skriptu a voláte na nich vestavěné nebo uživatelem definované funkce. Uzly můžete také umístit do skupiny a volat funkce na všechny uzly v této skupině. Více informací najdete v :ref:`dokumentaci skriptování <doc_scripting_continued>`.
de: Sie können Nodes handhaben durch den Zugriff auf sie durch ein angehängtes Skript, oder rufe die eingebauten benutzerdefinierten Funktionen in ihnen auf. Sie können also Nodes in eine Gruppe platzieren und dann Funktionen in allen Nodes dieser Gruppe aufrufen. Mehr dazu unter: :ref:`scripting documentation <doc_scripting_continued>`.
fr: Vous pouvez contrôler les nœuds en y accédant à l'aide de scripts et de fonctions d'appel (intégrées ou définies par l'utilisateur). Vous pouvez également les placer dans un groupe et appeler une fonction sur tous les nœuds contenus dans ce groupe ! Ceci est expliqué dans :ref:`cette page <doc_scripting_continued>`.
ja: ノードを制御するには、スクリプトを使用してノードにアクセスし、ノードの組み込み関数またはユーザー定義関数を呼び出します。また、グループ内にノードを配置し、このグループ内のすべてのノードで関数を呼び出すこともできます。詳細については、 :ref:`scripting documentation <doc_scripting_continued>` を参照してください。
ko: 스크립트를 통해 노드에 액세스하고 노드에서 내장 함수나 사용자가 정의한 함수를 호출하여 노드를 제어할 수 있습니다. 그리고 노드를 그룹에 배치하거나 이 그룹에 있는 모든 노드에서 함수를 호출할 수도 있습니다. 자세한 것은 :ref:`스크립팅 문서 <doc_scripting_continued>`\ 를 참고하세요.
uk: Ви можете керувати вузлами, отримуючи доступ до них за допомогою скрипту та викликаючи вбудовані, або визначені користувачем, функції в них. Ви також можете розміщувати вузли в групі та виконувати функції виклику для всіх вузлів цієї групи. Детальніше дивіться в :ref:`scripting documentation <doc_scripting_continued>`.
zh_cn: 您可以通过脚本访问节点以及在其上调用内置或用户定义的函数来控制节点. 您还可以将节点放在一个编组中, 并在该编组中的所有节点上调用函数. 有关更多信息, 请参见 :ref:`脚本文档 <doc_scripting_continued>`.
zh_tw: 可以通過腳本或是直接呼叫節點上的內建或使用者定義的函式來控制節點。也可以將節點放在群組中，然後呼叫這個群組中所有節點的函式。更多資訊請參考 :ref:`腳本文件 <doc_scripting_continued>` 。

source: Nodes can send a signal when a specified action occurs. A signal can be set to call any function. You can define custom signals and specify when they are triggered. See more in the :ref:`signals documentation <doc_gdscript_signals>`.
cs: Uzly mohou odeslat signál, když dojde k určité akci. Signál lze nastavit tak, aby volal libovolnou funkci. Můžete definovat vlastní signály a určit, kdy se spustí. Více informací najdete v :ref:`dokumentaci k signálům <doc_gdscript_signals>`.
de: Nodes können ein Signal senden falls bestimmte Aktionen ausgelöst werden. Ein Signal kann eingerichtet werden jede Funktion aufzurufen. Sie können auch eigene Signale definieren und spezifizieren wann diese ausgelöst werden sollen. Siehe mehr unter :ref:`Signal-Dokumentation <doc_gdscript_signals>`.
fr: Certains nœuds peuvent émettre des signaux lorsque certaines actions se produisent. Vous pouvez connecter ces signaux pour appeler une fonction spécifique lorsqu'ils se produisent. Notez que vous pouvez définir vos propres signaux et les envoyer quand vous le souhaitez. Cette fonctionnalité est documentée :ref:`ici <doc_gdscript_signals>`.
ja: ノードは、指定されたアクションが発生したときにシグナルを送信できます。シグナルは、任意の関数を呼び出すように設定できます。カスタムシグナルを定義して、トリガーされるタイミングを指定できます。詳細は、 :ref:`signals documentation <doc_gdscript_signals>` を参照してください。
ko: 노드는 특정 동작이 발생할 때 시그널을 보냅니다. 시그널은 함수를 호출하도록 설정될 수 있습니다. 커스텀 시그널을 정의하고 언제 시그널을 보낼 지를 지정할 수 있습니다. 자세한 설명은 :ref:`시그널 문서 <doc_gdscript_signals>`\ 를 참고하세요.
uk: Вузли можуть надсилати сигнал, коли відбувається визначена дія. Сигнал може бути встановлений для виклику будь-якої функції. Ви можете визначити власні сигнали та вказати, коли вони спрацьовують. Детальніше дивіться в :ref:`signals documentation <doc_gdscript_signals>`.
zh_cn: 发生指定的操作时, 节点可以发送信号. 可以设置信号来调用任何函数. 您可以定义自定义信号并指定触发它们的时间. 请参阅 :ref:`信号文档 <doc_gdscript_signals>` 中的更多内容.
zh_tw: 節點可以在特定行為發生的時候送出訊號。訊號可以設定來呼叫任何函式。也可以自己定義自定訊號並指定觸發的時機。詳細請參考 :ref:`訊號文件 <doc_gdscript_signals>` 。

source: Script serialization
cs: Serializace skriptů
de: Skript-Serialisierung
es: Serialización de scripts
fr: Sérialisation de scripts
ja: スクリプトのシリアル化
ko: 스크립트 직렬화
uk: Серіалізація скриптів
zh_cn: 脚本序列化
zh_tw: 腳本串聯化

source: Unity can handle script serialization in two ways:
cs: Unity může serializaci skriptů zpracovávat dvěma způsoby:
de: Unity kann die Skript-Serialisierung auf zwei Wege leisten:
es: Unity puede manejar la serialización de scripts de dos maneras:
fr: Unity peut gérer la sérialisation de scripts de deux manières :
ja: Unityは、次の2つの方法でスクリプトのシリアル化を処理できます。
ko: 유니티는 두 가지 방법으로 스크립트 직렬화를 다룰 수 있습니다:
ru: Unity может работать с сериализацией скриптов двумя способами:
uk: Unity може обробляти серіалізацію скриптів двома способами:
zh_cn: Unity可以通过两种方式处理脚本序列化:
zh_tw: Unity 可通過兩種方法來處理腳本的串聯化 (Serialization)：

source: Implicit: All public fields in a class are automatically serialized if the type is a serializable type (``Dictionary`` is not serializable).
cs: Implicitní: Všechna veřejná pole ve třídě jsou automaticky serializována, pokud je typ serializovatelný typ (``Slovník`` není serializovatelný).
de: Implizit: Alle öffentlichen Felder einer Klasse werden automatisch serialisiert falls der Typ auch wirklich serialisierbar ist. (``Ein Dictionary`` ist z.B. nicht serialisierbar).
es: Implícita: todos los campos públicos en una clase se serializan automáticamente si el tipo es un tipo serializable (``Dictionary`` no es serializable).
fr: Implicite : Tous les champs publics de la classe sont automatiquement sérialisés si le type est sérialisable (``Dictionary`` n'est pas sérialisable).
ja: 暗黙的:型がシリアル化可能な型である場合、クラス内のすべてのパブリックフィールドは自動的にシリアル化されます(``Dictionary`` はシリアル化できません)。
ko: Implicit(암시적): 한 클래스의 모든 퍼블릭 필드가 직렬화 할 수 있는 타입이면 (``Dictionary``\ 는 직렬화 할 수 없음) 자동으로 직렬화 됩니다.
ru: Неявно: Все публичные поля в классе автоматически сериализуются, если тип является сериализуемым (``Dictionary``не сериализуемый).
uk: Неявний: Усі загальнодоступні поля в класі автоматично серіалізуються, якщо тип є серіалізаційним типом ( ``Dictionary`` не серіалізаційний).
zh_cn: 隐式: 如果类型是可序列化的类型(``Dictionary`` 不可序列化), 则类中的所有公共字段都会自动进行序列化.
zh_tw: 隱含：若型別為可串聯化的型別，則類別中所有 Public 欄位都會自動串聯化（ ``Dictionary`` 不可串聯化）。

source: Explicit: Non-public fields can be serialized using the ``[SerializeField]`` attribute.
cs: Explicitní: Neveřejná pole lze serializovat pomocí atributu ``[SerializeField]``.
de: Explizit: Nicht-öffentliche Felder können serialisiert werden durch der Benützung des ``[SerializeField]`` Attribute.
es: Explícita: los campos no públicos se pueden serializar usando el atributo ``[SerializeField]``.
fr: Explicite : Les champs non-publics peuvent être sérialisés en utilisant l'attribut ``[SerializeField]``.
ja: 明示的:非パブリックフィールドは ``[SerializeField]`` 属性を使用してシリアル化できます。
ko: Explicit(명시적): 비 퍼블릭 필드를 ``[SerializeField]`` 속성을 사용하여 직렬화 되도록 할 수 있습니다.
ru: Явно: Непубличные поля могут быть сериализованы с помощью атрибута ``[SerializeField]``.
uk: Явний: Непублічні поля можна серіалізувати за допомогою атрибута ``[SerializeField]``.
zh_cn: 显式: 可以使用 ``[SerializeField]`` 属性来序列化非公共字段.
zh_tw: 明確：非 Public 欄位可使用 ``[SerializeField]`` 屬性來串聯化。

source: Godot also has a built-in script serialization system, but it works only explicitly. You can serialize any serializable type (:ref:`built-in and various engine types <doc_binary_serialization_api>`, including :ref:`class_Array` and :ref:`class_Dictionary`) using the ``export`` keyword. See the :ref:`exports documentation <doc_gdscript_exports>` for details.
cs: Godot má také zabudovaný systém serializace skriptů, ale funguje pouze explicitně. Pomocí klíčového slova ``exportovat`` můžete serializovat libovolný serializovatelný typ (:ref:` vestavěný a různé typy enginu <doc_binary_serialization_api>`, včetně :ref:`class_Array` a :ref:`class_Dictionary``). Podrobnosti naleznete v dokumentaci :ref:`exports <doc_gdscript_exports>`.
de: Godot liefert ebenfalls ein eingebautes Skript-Serialisations-System, aber das funktioniert nur explizit. Jeder serialisierbare Typ (:ref:`built-in and various engine types <doc_binary_serialization_api>`, unter anderem :ref:`class_Array` und :ref:`class_Dictionary`) kann uter Benutzung des Keywords ``export`` serialisiert werden. Mehr Details stehen in der :ref:`exports documentation <doc_gdscript_exports>`.
es: Godot también tiene un sistema integrado de serialización de scripts, pero funciona solo explícitamente. Puede serializar cualquier tipo serializable (:ref:`incorporado y varios tipos de motores <doc_binary_serialization_api>`, incluyendo ref:`class_Array` y:ref:`class_Dictionary`) usando la palabra clave ``export``. Consulte la:ref:`documentación de exportaciones <doc_gdscript_exports>` para obtener más información.
fr: Godot a également un système intégré de sérialisation de scripts, mais il ne fonctionne qu'explicitement. Vous pouvez sérialiser n'importe quel type sérialisable (:ref:`intégrés et de nombreux types du moteur <doc_binary_serialization_api>`, y compris :ref:`class_Array` et :ref:`class_Dictionary`) en utilisant le mot-clé ``export``. Ce fonctionnement est expliqué :ref:`ici <doc_gdscript_exports>`.
ja: Godot にはスクリプトシリアル化システムも組み込まれていますが、明示的にしか動作しません。 ``export`` キーワードを使用して、シリアル化可能な型 (:ref:`class_Array` と :ref:`class_Dictionary` を含む :ref:`built-in and various engine types <doc_binary_serialization_api>`)をシリアル化できます。詳細については、 :ref:`exports documentation <doc_gdscript_exports>` を参照してください。
ko: Godot 또한 내장 스크립트 직렬화 시스템을 갖추고 있지만, 오직 명시적으로만 작동합니다. 어떤 직렬화 가능한 타입이라도 (:ref:`class_Array`\ 와 :ref:`class_Dictionary`\ 를 포함한, :ref:`내장 그리고 다양한 엔진 타입 <doc_binary_serialization_api>`) ``export`` 키워드를 사용해 직렬화 할 수 있습니다. 자세한 설명은 :ref:`내보내기 문서 <doc_gdscript_exports>`\ 를 참고하세요.
uk: У Godot також є вбудована система серіалізації скриптів, але вона працює лише явно. Ви можете серіалізувати будь-який серіалізовуваний тип (:ref:`built-in and various engine types <doc_binary_serialization_api>`, включаючи :ref:`class_Array` та :ref:`class_Dictionary`), використовуючи ключове слово ``export``. Для детальної інформації дивіться :ref:`exports documentation <doc_gdscript_exports>`.
zh_cn: Godot也具有内置脚本序列化系统,, 但它仅显式工作. 您可以使用 ``export`` 关键字序列化任何可序列化的类型( :ref:`内置和各种引擎类型 <doc_binary_serialization_api>`, 包括 :ref:`class_Array` 和 :ref:`class_Dictionary`). 有关详细信息, 请参见 :ref:`导出器文档 <doc_gdscript_exports>`.
zh_tw: Godot 有內建的腳本串聯化系統，但只會在明確聲明下運作。任何可串聯化的型別都可使用 ``export`` 關鍵字來串聯化（ :ref:`內建與各種引擎型別 <doc_binary_serialization_api>` ，包含 :ref:`class_Array` 與 :ref:`class_Dictionary`）。詳細請參考 :ref:`Export 文件 <doc_gdscript_exports>` 。

source: Unity also has a data type called ``ScriptableObject`` used to serialize custom asset objects. Its equivalent in Godot is the base class for all resources: :ref:`class_Resource`. Creating a script that inherits :ref:`class_Resource` will allow you to create custom serializable objects. More information about resources can be found :ref:`here <doc_resources>`.
cs: Unity má také datový typ ``ScriptableObject``, který slouží k serializaci vlastních objektů zdrojů. Jeho ekvivalent v Godotu je základní třídou pro všechny prostředky: :ref:`class_Resource`. Vytvoření skriptu, který dědí :ref:`class_Resource`, vám umožní vytvářet vlastní serializovatelné objekty. Více informací o zdrojích naleznete :ref:`zde <doc_resources>`.
de: Unity besitzt ebenfalls einen Datentyp namens ``ScriptableObject``, welcher zur Serialisierung von benutzerdefinierten Asset-Objekten dient. Das Äquivalent in Godot ist die Basisklasse für alle Ressourcen: :ref:`class_Resource`. Das Erzeugen eines Skripts, dass von :ref:`class_Resource` erbt, erlaubt das Erstellen von benutzerdefinierten, serialisierbaren Objekte. Weitere Informationen über Ressourcen können :ref:`hier <doc_resources>` gefunden werden.
es: Unity también tiene un tipo de datos llamado ``ScriptableObject`` que se utiliza para serializar objetos de recursos personalizados. Su equivalente en Godot es la clase base para todos los recursos: ref:`class_Resource`. Crear un script que herede :ref:`class_Resource` te permitirá crear objetos personalizados serializables. Se puede encontrar más información sobre los recursos :ref:`aquí <doc_resources>`.
fr: Unity possède également un type de données appelé ``ScriptableObject`` utilisé pour sérialiser les objets assets personnalisés. Son équivalent dans Godot est la classe de base pour toutes les ressources :ref:`class_Resource`. Créer un script qui hérite de :ref:`class_Resource` vous permettra de créer des objets sérialisables personnalisés en série. Plus d'informations sur les ressources peuvent être trouvées :ref:`ici <doc_resources>`.
ja: Unityには、カスタムアセットオブジェクトのシリアル化に使用される ``ScriptableObject`` と呼ばれるデータ型もあります。Godotでの同等のものは、すべてのリソースの基本クラスです :ref:`class_Resource`\ 。 :ref:`class_Resource` を継承するスクリプトを作成すると、カスタムのシリアライズ可能なオブジェクトを作成できます。リソースの詳細については、 :ref:`こちら<doc_resources>` をご覧ください。
ko: 유니티 또한 커스텀 에셋 객체를 직렬화 하기 위해 사용되는 ``ScriptableObject`` 라는 데이터 타입을 갖고 있습니다. Godot에서 이것은 모든 리소스의 기본 클래스에 해당합니다: :ref:`class_Resource`. :ref:`class_Resource`\ 를 상속하는 스크립트를 만드는 것으로 커스텀 직렬화 가능한 객체를 만들 수 있게 됩니다. 리소스에 관한 더 많은 정보는 :ref:`여기서 <doc_resources>` 볼 수 있습니다.
ru: Unity также имеет тип данных под названием ``ScriptableObject``, используемый для сериализации пользовательских ресурсных объектов. Его эквивалент в Godot является базовым классом для всех ресурсов: :ref:`class_Resource`. Создание скрипта, который наследует :ref:`class_Resource`, позволит вам создавать собственные сериализуемые объекты. Более подробную информацию о ресурсах можно найти :ref:`здесь <doc_resources>`.
uk: Unity також має тип даних, який називається, що ``ScriptableObject`` і використовується для серіалізації користувацьких ресурсних об'єктів. Його еквівалент у Godot є базовим класом для всіх ресурсів: :ref:`class_Resource`. Створення скрипту, який успадковує :ref:`class_Resource`, дозволить вам створити власні об'єкти, які серіалізуються. Більше інформації про ресурси можна знайти тут :ref:`here <doc_resources>`.
zh_cn: Unity还具有一个名为 ``ScriptableObject`` 的数据类型, 用于序列化自定义素材对象. 它在Godot中的等效项是所有资源的基类: :ref:`class_Resource`. 创建一个继承了 :ref:`class_Resource` 的脚本, 将允许您创建自定义的可序列化对象. 有关资源的更多信息, 请参见 :ref:`这里 <doc_resources>`.
zh_tw: Unity 還有一個用來序列化素材物件的 ``ScriptableObject`` 資料型別。這個型別同等於 Godot 中所有資源的基礎型別 :ref:`class_Resource` 。建立一個繼承 :ref:`class_Resource` 的腳本即可建立可串聯化的自定物件。更多關於資源的資訊可參考 :ref:`這裡 <doc_resources>` 。

source: Using Godot in C++
cs: Použití Godota v jazyce C++
de: Verwenden von Godot mit C++
es: Usando Godot en C++
fr: Utiliser Godot en C ++
ja: C++でGodotを使用する
ko: C++로 Godot 사용하기
pt_br: Usando Godot com C ++
ru: Использование C++ в Godot
uk: Використання C++ в Godot
zh_cn: 在 Godot 中使用 C++
zh_tw: 在 Godot 中使用 C++

source: Godot allows you to develop your project directly in C++ by using its API, which is not possible with Unity at the moment. As an example, you can consider Godot Engine's editor as a "game" written in C++ using the Godot API.
cs: Godot umožňuje vyvíjet projekt přímo v jazyce C++ pomocí svého rozhraní API, což Unity v současné době nedovoluje. Například můžete považovat editor Godot Engine za "hru" napsanou v C++ pomocí Godot API.
de: Godot ermöglicht es Ihnen, Ihre Projekte direkt in C++ durch API zu entwickeln, was in Unity z.B. nicht möglich ist. Z.B. könnte man den Editor der Godot-Engine als ein "Spiel", geschrieben in C++ mithilfe der Nutzung der Godot API betrachten.
fr: Godot vous permet également de développer votre projet directement en C ++ en utilisant son API, ce qui n'est pas possible avec Unity pour le moment. Par exemple, vous pouvez considérer l'éditeur de Godot Engine comme un "jeu" écrit en C ++ à l'aide de l'API Godot.
ja: Godotでは、APIを使用してC ++でプロジェクトを直接開発できますが、現時点のUnityでは不可能です。例として、Godot エンジンのエディタは、Godot APIを使用してC++で記述された「ゲーム」と見なすことができます。
ko: Godot는 API를 사용하여 C++로 프로젝트를 직접 개발할 수 있게 해줍니다, 이는 현재 유니티에서는 불가능합니다. 예를 들어 Godot 엔진의 에디터를 Godot API를 사용하는 C++로 작성된 "게임"으로 간주할 수 있습니다.
uk: Godot дозволяє розробляти свій проект безпосередньо в C++, використовуючи його API, що наразі неможливо з Unity. Як приклад, ви можете розглядати редактор Godot Engine як "гру", написану на C++ за допомогою API Godot.
zh_cn: Godot允许您使用其API直接使用C++开发项目, 而这在Unity中目前是不可能的. 例如, 您可以将Godot引擎的编辑器视为使用Godot API用C++编写的 ``游戏``.
zh_tw: Godot 可以讓你直接使用 Godot API 來以 C++ 開發專案，而 Unity 目前則沒辦法用 C++。這裡有個例子，可以把 Godot Engine 的編輯器想像成一個用 C++ 與 Godot API 寫出來的「遊戲」。
