Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/unity_to_godot.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: If you are interested in using Godot in C++, you may want to start reading the :ref:`Developing in C++ <doc_introduction_to_godot_development>` page.
cs: Pokud máte zájem o používání Godotu v C++, můžete začít čtením :ref:`Vývoj v C++ <doc_introduction_to_godot_development>`.
de: Falls Sie interessiert daran sind, C++ mit Godot zusammen zu verwenden, schauen Sie hier vorbei: :ref:`Entwickeln in C++ <doc_introduction_to_godot_development>`.
es: Si estás interesado en usar Godot en C++, puedes empezar a leer la página :ref:`Desarrollando en C++ <doc_introduction_to_godot_development>`.
fr: Si vous êtes intéressé par l'utilisation de Godot en C++, vous pouvez commencer à lire la page :ref:`Développer en C++ <doc_introduction_to_godot_development>`.
ja: C++でGodotを使うことに興味があるなら、\ :ref:`C++での開発 <doc_introduction_to_godot_development>`\ のページを読んでみるとよいでしょう。
ko: C++로 Godot를 사용하는 것에 관심이 있으시다면, :ref:`C++로 개발하기 <doc_introduction_to_godot_development>` 페이지를 읽고 시작하시면 됩니다.
pt_br: Se você estiver interessado em usar Godot com C ++, você pode querer começar a ler a página: ref: `Desenvolvendo em C ++ <doc_introduction_to_godot_development>`.
ru: Если вы заинтересованы в использовании языка C++ в Godot, вы можете прочитать страницу :ref:`Разработка на С++ <doc_introduction_to_godot_ Development>`.
uk: Якщо ви зацікавлені у використанні C++ в Godot, ви можете прочитати сторінку :ref:`Розробка в C++ <doc_introduction_to_godot_development>`.
zh_cn: 如果你对使用Godot时使用C++感兴趣, 你可能想要开始阅读 :ref:`用C++开发 <doc_introduction_to_godot_development>` 页面.
zh_tw: 如果你想在 Godot 中使用 C++，你可能會想讀一下 :ref:`以 C++ 開發 <doc_introduction_to_godot_development>` 這頁。

source: This article talks about older versions of Unity. Nestable prefabs ('Nested prefabs') were added to Unity 2018.3. Nestable prefabs are analogous to Godot's scenes, and allow a more Godot-like approach to scene organization.
cs: Tento článek pojednává o starších verzích Unity. Vnořitelné prefabrikáty ("Nested prefabs") byly přidány do Unity 2018.3. Vnořitelné prefabs jsou obdobou Godot scén a umožňují podobný přístup k organizaci scény jako v Godot enginu.
de: Dieser Artikel geht auf ältere Versionen von Unity ein. Verschachtelte Vorlagen ('Nested Prefabs') wurden in Unity 2018.3 hinzugefügt und sind vergleichbar mit Szenen in Godot, sie erlauben somit eine Godot-ähnliche Herangehensweise der Szenen-Organisation.
fr: Cet article traite d'une ancienne version de Unity. Les Prefabs imbriqués ('Nested prefabs') sont utilisables depuis la version Unity 2018.3. Les Prefabs imbriqués sont analogues aux scènes de Godot. Cela permet d'ailleurs d'avoir une approche de la gestion des scenes similaire à Godot dans Unity.
zh_cn: 本文讨论了旧版本的Unity. 可嵌套的预制件( ``嵌套的预制件(Nested prefabs)`` )已添加到Unity 2018.3中. 可嵌套的预制件类似于Godot的场景, 允许采用更像Godot的方式进行场景组织.
zh_tw: 這篇文章討論的是舊版的 Unity。可嵌套的 Prefabs（「Nested prefabs」）在 Unity 2018.3 中新增。Nestable prefbas 類似於 Godot 的場景，並允許使用類似 Godot 的方式來組織場景。

source: **VR:** Oculus Rift, SteamVR, Google Cardboard, PlayStation VR, Gear VR, HoloLens
zh_cn: **虚拟现实(VR):** Oculus Rift, SteamVR, Google Cardboard, Playstation VR, Gear VR, HoloLens

source: :ref:`External editors are possible <doc_external_editor>`
cs: :ref:`Externí editory jsou možné <doc_external_editor>`
de: :ref:`Externe Editoren sind möglich <doc_external_editor>`
es: :ref:`Los editores externos son posibles <doc_external_editor>`
fr: :ref:`Les éditeurs externes sont possibles <doc_external_editor>`
ja: \ :ref:`外部エディタが使用可能 <doc_external_editor>`
pt_br: :ref:`Editores externos são possíveis <doc_external_editor>`
ru: :ref:`Можно использовать внешние редакторы <doc_external_editor>`
zh_cn: :ref:`可使用外部编辑器 <doc_external_editor>`
zh_tw: :ref:`可使用外部編輯器 <doc_external_editor>`

source: :ref:`Android SDK for Android export <doc_exporting_for_android>`
cs: :ref:`Android SDK pro Android export <doc_exporting_for_android>`
de: :ref:`Android SDK für den Android export <doc_exporting_for_android>`
es: :ref:`Android SDK para exportación a Android <doc_exporting_for_android>`
fr: :ref:`La SDK Android pour l’export Android <doc_exporting_for_android>`
ja: :ref:`Android SDK for Androidエクスポート <doc_exporting_for_android>`
pt_br: :ref:`Android SDK para exportação a Android <doc_exporting_for_android>`
ru: :ref:`Android SDK для экспорта под Android <doc_exporting_for_android>`
zh_cn: :ref:`用于导出安卓平台的 Android SDK <doc_exporting_for_android>`
zh_tw: :ref:`用於匯出 Android 的 Android SDK <doc_exporting_for_android>`

source: Notable advantages
cs: Významné výhody
de: Bemerkenswerte Vorteile
fr: Avantages notables
ja: 注目すべき利点
uk: Помітні переваги
zh_cn: 显著优势
zh_tw: 特色優點

source: :ref:`Animation Pipeline <doc_animations>`
de: :ref:`Animations-Pipeline <doc_animations>`
es: :ref:`Canalización de Animaciones<doc_animations>`
fr: :ref:`Pipeline d’animation <doc_animations>`
ja: \ :ref:`アニメーションパイプライン<doc_animations>`
pt_br: :ref:`Canalização de Animações <doc_animations>`
zh_cn: :ref:`动画管线 <doc_animations>`
zh_tw: :ref:`動畫 Pipeline <doc_animations>`

source: :ref:`Easy to write Shaders <doc_shading_language>`
cs: :ref:`Snadné psaní shaderů <doc_shading_language>`
de: :ref:`Einfach zu schreibende Shader <doc_shading_language>`
es: :ref:`Shaders fáciles de escribir <doc_shading_language>`
fr: :ref:`Facilité d’écriture de Shaders <doc_shading_language>`
ja: \ :ref:`シェーダーを書きやすい<doc_shading_language>`
pt_br: :ref:`Facilidade para escrever Shaders <doc_shading_language>`
ru: :ref:`Легко написать Шейдеры <doc_shading_language>`
zh_cn: :ref:`易于编写着色器 <doc_shading_language>`
zh_tw: :ref:`簡單易寫的著色器 <doc_shading_language>`

source: Godot Engine provides a rich-featured editor that allows you to build your games. The pictures below display the default layouts of both editors with colored blocks to indicate common functionalities.
cs: Godot Engine nabízí bohatě vybavený editor, který vám umožní vytvářet hry. Níže uvedené obrázky zobrazují výchozí rozložení obou editorů s barevnými bloky označujícími společné funkce.
de: Die Godot-Engine stellt Ihnen einen funktionsreichen Editor zur Verfügung um die Spiele von morgen zu schaffen. Die Bilder unten zeigen das Standard-Layout beider Editoren mit farbigen Blöcken um die verbreiteten Funktionalitäten anzuzeigen.
fr: Godot Engine vient avec un environnement de développement incluant un éditeur complet pour faire vos jeux. Les images ci-dessous affichent les deux éditeurs avec des blocs de couleur pour indiquer les fonctionnalités communes.
ja: Godoエンジンは、ゲームの構築を可能にする豊富な機能を備えたエディタを提供します。以下の図は、両方のエディタのデフォルトのレイアウトを色付きのブロックで表示して、共通する機能を示しています。
uk: Godot Engine пропонує редактор з широкими можливостями, що дозволяє створювати свої ігри. На малюнках нижче відображаються типові схеми обох редакторів з кольоровими блоками, що вказують на загальні функції.
zh_cn: Godot引擎提供了功能丰富的编辑器, 可让您构建游戏. 下图显示了两个编辑器的默认布局, 并带有彩色块, 以指示常用功能.
zh_tw: Godot Engine 提供了用來製作遊戲的功能豐富的編輯器。下圖顯示了兩種編輯器預設的畫面配置，使用色塊來區分共通的功能。

source: While both editors may seem similar, there are many differences below the surface. Both let you organize the project using the filesystem, but Godot's approach is simpler with a single configuration file, minimalist text format, and no metadata. This makes Godot more friendly to VCS systems, such as Git, Subversion, or Mercurial.
cs: Ačkoli se oba editory mohou zdát podobné, pod povrchem se skrývá mnoho rozdílů. Oba umožňují organizovat projekt pomocí souborového systému, ale Godotův přístup je jednodušší, má jediný konfigurační soubor, minimalistický textový formát a žádná metadata. Díky tomu je Godot přátelštější k systémům VCS, jako je Git, Subversion nebo Mercurial.
de: Während beide Editoren sich ziemlich ähneln, stecken unter der Oberfläche viele Unterschiedlichkeiten. Beide ermöglichen es Ihnen, Ihr Projekt geschickt durch das Dateisystem geordnet und aufgeräumt halten zu können. Doch Godot's Ansatz ist wesentlich einfacher gestaltet mit einer einzigen Konfigurationsdatei, minimalem Textformat, keine Metadaten. Dadurch ist Godot handlicher zu VCS Systemen, wie zum Beispiel Git, Subversion, oder Mercurial.
fr: Bien que les deux éditeurs puissent sembler similaires, il existe de nombreuses différences sous la surface. Les deux vous permettent d'organiser le projet en utilisant le système de fichiers, mais l'approche de Godot est plus simple avec un seul fichier de configuration, avec un format minimaliste, et sans métadonnées. Tout cela contribue à rendre Godot plus compatible avec les logiciels de gestion de versions tels que Git, Subversion ou encore Mercurial.
ja: 両方のエディタは似ているように見えるかもしれませんが、表面の下には多くの違いがあります。どちらもファイルシステムを使用してプロジェクトを整理できますが、Godotのアプローチは、単一の構成ファイル、最小限のテキスト形式、メタデータなしでより簡単です。これにより、Git、Subversion、MercurialなどのVCSシステムでGodotがより使いやすくなります。
uk: Хоча обидва редактори можуть здатися схожими, під поверхнею є багато відмінностей. Обидва дозволяють організувати проект за допомогою файлової системи, але підхід Godot простіший з одним файлом конфігурації, мінімалістичним текстовим форматом та відсутністю метаданих. Це робить Godot більш дружелюбним до систем VCS, таких як Git, Subversion або Mercurial.
zh_cn: 尽管两个编辑器看起来很相似, 但外表下有许多差异. 两者都允许您使用文件系统来组织项目, 但是Godot的方法更简单, 只需一个配置文件, 简约的文本格式且没有元数据. 这使Godot对VCS系统(如Git,Subversion或Mercurial)更加友好.
zh_tw: 雖然兩個編輯器看起來有點像，但實際上卻有許多的不同。兩者都可以使用檔案系統來管理專案，但 Godot 的做法比較簡單而且只使用了單一組態設定檔、極簡的純文字格式、且不使用後設資料。這麼做使得 Godot 對如 Git、Subversion、或 Mercurial 等的 VCS 系統更加友善。

source: Godot's Scene panel is similar to Unity's Hierarchy panel but, as each node has a specific function, the approach used by Godot is more visually descriptive. It's easier to understand what a scene does at a glance.
cs: Panel Scéna v Godotu je podobný panelu Hierarchie v Unity, ale vzhledem k tomu, že každý uzel má specifickou funkci, je přístup použitý v Godotu vizuálně popisnější. Je snazší na první pohled pochopit, co scéna dělá.
de: Godot's Szenenpanel ist ähnlich zu dem Hierarchie-System Unitys. Doch jedes Node verfügt über eine ganz bestimmte Funktion, dieser Ansatz seitens Godot ist visuell mehr darstellend. Es ist einfacher gestaltet, den Überblick über alles behalten zu können.
fr: Le panneau Scène de Godot est similaire au panneau Hiérarchie d'Unity, mais comme chaque nœud a une fonction spécifique, l'approche utilisée par Godot est plus parlante visuellement. En d'autres termes, il est plus facile de comprendre ce que fait une scène spécifique d'un simple coup d'œil.
ja: GodotのSceneパネルはUnityのHierarchyパネルに似ていますが、各ノードには特定の機能があるため、Godotで使用されるアプローチは視覚的にわかりやすくなっています。シーンが何をしているのかが一目でわかります。
uk: Панель сцени Godot схожа на панель ієрархії Unity, але, оскільки кожен вузол має певну функцію, підхід, що використовується у Godot, є більш візуально описовим. Можна зрозуміти, що робить сцена з першого погляду.
zh_cn: Godot的场景面板与Unity的层次结构面板类似, 但是由于每个节点都有特定的功能, 因此Godot所使用的方法更具视觉描述性. 一目了然地了解场景干什么.
zh_tw: Godot 的場景面板與 Unity 的 Hierarchy 面板類似，但由於每個節點都有特定的功能，Godot 使用的方法在視覺上比較直覺。對於場景是用來做什麼的總可以一目瞭然。

source: The Inspector in Godot is more minimal, it shows only properties. Thanks to this, objects can expose more useful parameters to the user without having to hide functionality in language APIs. As a plus, Godot allows animating any of those properties visually. Changing colors, textures, enumerations, or even links to resources in real-time is possible without needing to write code.
cs: Inspektor v Godotovi je více minimalistický, zobrazuje pouze vlastnosti. Díky tomu mohou objekty uživateli odhalit více užitečných parametrů, aniž by bylo nutné skrývat funkčnost v API jazyka. Jako plus Godot umožňuje vizuálně animovat libovolnou z těchto vlastností. Měnit barvy, textury, výčty nebo dokonce odkazy na zdroje v reálném čase je možné bez nutnosti psaní kódu.
de: Der Inspektor Godots ist minimalistisch aufgebaut, er zeigt lediglich Eigenschaften an. Dank dieser Funktionsweise können Objekte dem Endbenutzer mehr nützliche Parameter preisgeben, ohne Funktionalitäten in Sprach-APIs zu verbergen. Zusätzlich erlaubt Godot es einem, jegliche jener Eigenschaften visuell zu animieren. Sei es das Ändern der Farben, Texturen, Enumerationen, oder selbst Links zu Ressourcen in Echtzeit sind möglich, ohne den Zwang Code dafür schreiben zu müssen.
fr: L'inspecteur dans Godot est minimaliste et conçu pour afficher uniquement les propriétés des noeuds. Grâce à ça, les objets peuvent exporter un plus grand nombre de paramètres utiles sans pour autant devoir cacher des fonctionnalités. De plus, Godot permet d’animer visuellement toutes ces propriétés. Il est donc possible de changer les couleurs, les textures, les énumérations ou même les liens vers les ressources en temps réel sans écrire de code.
ja: Godotのインスペクタは最小限であり、プロパティのみを表示します。これにより、オブジェクトは、言語APIの機能を隠すことなく、より有用なパラメーターをユーザーに公開できます。さらに、Godotではこれらのプロパティを視覚的にアニメーション化できます。コードを記述する必要なく、色、テクスチャ、列挙、またはリソースへのリンクをリアルタイムで変更できます。
uk: Інспектор у Godot є мінімальним, він демонструє лише властивості. Завдяки цьому об'єкти можуть відкривати користувачеві більш корисні параметри без необхідності приховувати функціональність у мовних API. Як плюс, Godot дозволяє візуально анімувати будь-яку з цих властивостей. Зміна кольорів, текстур, рахунків, або навіть посилань на ресурси в режимі реального часу можлива без необхідності писати код.
zh_cn: Godot 的属性检查器更为简单, 它仅显示属性. 得益于此, 对象可以向用户暴露大量有用的参数, 而无需把功能隐藏在语言 API 中. 另外,Godot允许可视化地动画化这些属性. 无需编写代码就可以实时更改颜色, 纹理, 枚举, 甚至是资源链接.
zh_tw: Godot 的屬性面板則比較簡單，只顯示了屬性。但多虧於此，物件可以將更實用的參數暴露給使用者而毋須以語言 API 來隱藏功能。另外，Godot 也允許視覺動畫化任何一個屬性。更改色彩、紋理貼圖、或甚至可以即時動態串聯資源而毋須撰寫程式碼。

source: The Toolbar at the top of the screen is similar in both editors, offering control over project playback. Projects in Godot run in a separate window, rather than inside the editor (but the tree and objects can still be explored in the debugger window).
cs: Panel nástrojů v horní části obrazovky je v obou editorech podobný a nabízí ovládání přehrávání projektu. Projekty v Godotu se spouštějí v samostatném okně, nikoli uvnitř editoru (strom a objekty však lze stále zkoumat v okně ladicího programu).
de: Die Toolbar oberhalb des Bildschirms ist ähnlich in beiden Editoren vertreten, bieten die volle Kontrolle über die Projekt-Wiedergabe. Projekte in Godot dagegen laufen in seperaten Fenstern, anstelle innerhalb des Editors (der Tree und die Objekte können jedoch immer noch erkundigt werden im Debugger-Fenster).
fr: La barre d’outils, située en haut de l’écran, est similaire dans le sens où elle permet d'avoir une bonne vue d'ensemble du projet. L'exécution d'un projet dans Godot Engine se fait dans une fenêtre séparée, car dans Godot Engine les projets ne sont pas exécutés dans l'éditeur (toutefois l'arborescence et les objets sont toujours visibles dans la fenêtre du débogueur).
ja: 画面上部のツールバーは両方のエディタで似ており、プロジェクトの再生を制御できます。 Godotのプロジェクトは、エディター内ではなく、別のウィンドウで実行されます(ただし、ツリーとオブジェクトは、デバッガウィンドウで引き続きGodot内で探索できます)。
uk: Панель інструментів у верхній частині екрана схожа в обох редакторах, що забезпечує контроль над відтворенням проекту. Проекти в Godot запускаються в окремому вікні, а не всередині редактора (але з деревом та об'єктами все ще можна ознайомитись у вікні налагодження).
zh_cn: 屏幕顶部的工具栏在两个编辑器中都相似, 提供对项目运行的控制.Godot中的项目在单独的窗口中运行, 而不是在编辑器中运行(但是仍然可以在调试器窗口中浏览树和对象).
zh_tw: 上方的工具列在兩個編輯器上也很類似，都提供了控制專案執行的功能。在 Godot 中的專案是以分開的視窗執行的，而不是在編輯器中執行（但場景樹與物件仍然可以在偵錯視窗中瀏覽）。

source: This approach has several advantages:
cs: Tento přístup má několik výhod:
de: Dieser Ansatz hat diverse Vorteile:
fr: Cette approche présente plusieurs avantages :
uk: Кожен має різні переваги:
zh_cn: 这一方法有着如下优点:
zh_tw: 這樣的做法有許多優點：

source: The running game can be explored from different angles by toggling the "Camera Override" button in the editor viewport, which will switch between using the editor view and the game camera view.
cs: Probíhající hru lze prozkoumat z různých úhlů přepnutím tlačítka "Camera Override" v okně editoru, které přepíná mezi pohledem editoru a pohledem herní kamery.
de: Das Rennspiel kann von verschiedenen Blickwinkeln aus beobachtet werden durch das Umschalten des "Camera Override"-Knopfes im Editor-Viewport, welcher zwischen der Ansicht der Editoransicht und der Spielkamera umschaltet.
fr: Le jeu en cours peut être exploré sous différents angles en basculant le bouton "Camera Override" dans la fenêtre de l'éditeur, qui basculera entre la vue de l'éditeur et la vue de la caméra du jeu.
zh_cn: 通过在编辑器视窗中切换 "摄影机替代" 按钮, 可以从不同角度浏览正在运行的游戏, 该按钮将在使用编辑器视图和游戏摄影机视图之间进行切换.
zh_tw: 可以通過打開編輯器檢視區中的「相機覆蓋」按鈕來以不同的角度瀏覽正在執行的遊戲，這個按鈕能在編輯器視圖與遊戲相機視圖間切換。

source: Finally, Godot's top toolbar includes a menu for remote debugging. These options allow deployment to a device (connected phone, tablet, or browser via HTML5), and debugging/live editing on it after the game is exported.
cs: A konečně, horní panel nástrojů Godotu obsahuje nabídku pro vzdálené ladění. Tyto možnosti umožňují nasazení na zařízení (připojený telefon, tablet nebo prohlížeč prostřednictvím HTML5) a ladění/živé úpravy přímo v něm po tom co je hra exportována.
de: Godot's oberste Toolbar enthält ein Menü für fernes Debugging. Diese Optionen erlauben die Ausführung auf einem anderen Gerät (ein verbundenes Handy, ein Tablet, aber auch via Browser - HTML5), wie auch das Live-Debugging nachdem das Spiel exportiert wurde.
fr: Pour conclure, la barre d’outils située en haut de l'éditeur, comprend un menu pour le débogage à distance. Ces options facilitent le déploiement sur un périphérique (téléphone connecté, tablette ou navigateur via HTML5) ainsi que le débogage / modification en direct après l'exportation du jeu.
ja: 最後に、Godotの上部のツールバーには、リモートデバッグ用のメニューが含まれています。これらのオプションを使用すると、デバイス(HTML5を介して接続されたスマホ、タブレット、またはブラウザー)への展開、およびゲームのエクスポート後のデバッグ/ライブ編集が可能になります。
uk: Нарешті, у верхній панелі інструментів Godot є меню для віддаленого налагодження. Ці параметри дозволяють розгортати на пристрої (підключений телефон, планшет, чи браузер через HTML5) та налагоджувати/редагувати на ньому в режимі реального часу після експорту гри.
zh_cn: 最后,Godot的顶部工具栏包括一个用于远程调试的菜单. 这些选项允许将设备部署到设备(通过HTML5连接的手机, 平板电脑, 或浏览器), 并在导出游戏后对其进行调试/实时编辑.
zh_tw: 最後，Godot 的頂部工具列包含了用於遠端除錯的選單。選單中的選項包含可部署至裝置（如通過 HTML5 連接的手機、平板、或瀏覽器），並在遊戲匯出後進行除錯與即時編輯。

source: This is the most important difference between Unity and Godot and the favorite feature of most Godot users.
cs: To je nejdůležitější rozdíl mezi Unity a Godotem a oblíbená funkce většiny uživatelů Godotu.
de: Hierbei handelt es sich um den wichtigsten Unterschied zwischen der Unity- und Godotengine als auch um die meistgemochtesten Features der meisten Godot-Benutzer.
fr: Il s'agit de la différence la plus importante entre Godot Engine et Unity. Et c'est la fonctionnalité la plus appréciée des utilisateurs de Godot.
zh_cn: 这是Unity和Godot之间的最重要区别, 也是大多数Godot用户最喜欢的功能.
zh_tw: 場景系統是 Unity 與 Godot 間最大的不同，也是許多 Godot 使用者最喜歡的功能。

source: Working on a 'level' in Unity usually means embedding all the required assets in a scene and linking them together with components and scripts.
cs: Práce na "úrovni" v Unity obvykle znamená vložení všech potřebných zdrojů do scény a jejich propojení pomocí komponent a skriptů.
de: An einem 'Level' in Unity zu arbeiten bedeutet normalerweise all die benötigten Assets in eine Szene einzubinden und sie mit Komponenten und Skripten zu verbinden.
fr: Le système de scène d'Unity consiste à intégrer toutes les dépendances requises dans une scène et à les relier ensemble en leur attachant des composants et des scripts.
ja: Unityの「レベル」で作業することは、通常、シーンにすべての必要なアセットを埋め込み、コンポーネントおよびスクリプトとリンクすることを意味します。
uk: Робота з "рівнем" в Unity зазвичай означає вбудовування всіх необхідних ассетів в сцену та пов'язування їх із компонентами та скриптами.
zh_cn: 在Unity中一个 ``关卡`` 上工作通常意味着将所有必需的素材嵌入场景中, 并将它们与组件和脚本链接在一起.
zh_tw: 在 Unity 中製作「關卡」通常表示必須要將所有需要的素材都嵌入至場景內，並將這些素材與元件、腳本關聯在一起。

source: Godot's scene system is superficially similar to Unity. A 'level' consists of a collection of nodes, each with its own purpose: Sprite, Mesh, Light, etc. However, in Godot the nodes are arranged in a tree. Each node can have multiple children, which makes each a subscene of the main scene. This means you can compose a whole scene with different scenes stored in different files.
cs: Systém scén Godot je na první pohled podobný systému Unity. Úroveň se skládá ze skupin uzlů, z nichž každý má svůj vlastní účel: Sprite, Mesh, Light atd. V Godotu jsou však uzly uspořádány do stromu. Každý uzel může mít více potomků, což z každého z nich dělá dílčí scénu hlavní scény. To znamená, že celou scénu můžete složit z různých scén uložených v různých souborech.
de: Godot's Szenensystem ist von der Oberfläche her Unity sehr ähnlich. Ein 'Level' besteht aus einer Sammlung von Nodes, jedes mit seinem eigenen Nutzen: Sprites, Meshes, Lights, usw. Wie dem auch sei, in Godot sind Nodes in einer Baumstruktur aufgebaut. Jedes Node kann mehrere Unter-Nodes haben, die dann eine Subszene aus der Hauptszene heraus bilden. Dies hat zur Folge dass es durchaus möglich ist, eine ganze Szene mit verschiedenen Szenen zusammenzusetzen, dabei können nämlich Szenen auch in einzelne Dateien gespeichert werden.
fr: Le système de scène de Godot est superficiellement similaire à Unity. Un 'niveau' se compose d'un ensemble de nœuds, chacun avec son propre but : Sprite, Mesh, Light, etc. Cependant, dans Godot, les nœuds sont disposés en arbre. Chaque nœud peut avoir plusieurs enfants, ce qui fait de chacun un sous-ensemble de la scène principale. Cela signifie que vous pouvez composer une scène entière avec différentes scènes stockées dans différents fichiers.
ja: Godotのシーンシステムは、表面的にUnityに似ています。 「レベル」は、それぞれ独自の目的(スプライト、メッシュ、ライトなど)を持つノードのコレクションで構成されます。ただし、Godotでは、ノードはツリーに配置されます。各ノードは複数の子を持つことができ、それぞれがメインシーンのサブシーンになります。これは、異なるファイルに保存された異なるシーンでシーン全体を構成できることを意味します。
uk: Система сцен Godot схожа на Unity. "Рівень" складається з набору вузлів, кожен з яких має своє призначення: спрайт, сітка (меш), світло тощо. Однак у Godot вузли розташовані в дереві. Кожен вузол може мати декілька нащадків, що робить кожного під-сценою головної сцени. Це означає, що ви можете створити цілу сцену з різними сценами, що зберігаються в різних файлах.
zh_cn: Godot的场景系统表面上类似于Unity. 一个 ``关卡`` 由一组节点组成, 每个节点都有其自己的用途:Sprite, Mesh, Light等. 但是, 在Godot中, 节点排列在一棵树中. 每个节点可以有多个子代, 这使得每个子代都是主场景的一个子场景. 这意味着您可以用存储在不同文件中的不同场景组合成整个场景.
zh_tw: Godot 的場景系統表面上看起來與 Unity 類似。「關卡」是由具有不同目的的節點組成的，如 Sprite、Mesh、Light…等。而且，在 Godot 中節點是由樹狀結構組織的，每個節點都可有多個子節點，所以每個節點都是主要場景的子場景。這代表可用保存在不同檔案中的不同場景來組織成整個場景。

source: In Godot, you would split your whole scene into three separate, smaller scenes, and instance them in the main scene.
cs: V Godotu byste celou scénu rozdělili na tři samostatné, menší scény a v hlavní scéně vytvořili jejich instance.
de: In Godot würden Sie Ihre gesamte Szene in drei kleineren, separaten Szenen unterbringen, und sie in der Hauptszene instanziieren.
fr: Dans Godot, vous diviseriez toute votre scène en 3 scènes plus petites et distinctes, que vous placeriez ensuite dans la scène principale.
ja: Godotでは、シーン全体を3つの独立した小さなシーンに分割し、メインシーンでインスタンス化します。
uk: У Godot ви розділили б всю свою сцену на три окремі менші сцени та вставили їх у головну сцену.
zh_cn: 在Godot中, 您将整个场景分为三个单独的较小的场景, 并在主场景中对其进行实例化.
zh_tw: Godot 裡會將這整個場景拆分為三個獨立的小場景，接在再於主場景中實體化。

source: **A scene for the Player alone.**
cs: **Scéna pouze pro hráče.**
de: **Nur schon für den Spieler an sich eine eigene Szene**
fr: **Une scène pour le joueur seul.**
ja: **プレイヤーだけのシーン**
uk: **Сцена тільки для гравця**
zh_cn: **仅用于游戏角色(Player)的场景.**
zh_tw: **只有玩家的場景。**
