Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/unity_to_godot.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Consider the player as an element we'd like to use in different parent scenes (for instance 'level' scenes). In our case, the player element needs at least an AnimatedSprite node. This node contains the sprite textures necessary for various animations (for example, a walking animation).
cs: Uvažujte o hráči jako o prvku, který bychom chtěli používat v různých nadřazených scénách (například ve scénách "úrovní"). V našem případě potřebuje prvek hráč alespoň uzel AnimatedSprite. Tento uzel obsahuje sprite textury potřebné pro různé animace (například animaci chůze).
de: Verstehe den Spieler als ein Element dieses wir gerne in verschiedenen Eltern-Szenen (eigentlich 'Level'-Szenen) verwenden wollen. In unserem Fall benötigt das Spielerelement wenigstens ein 'AnimatedSprite'-Node. Dieser Node-Typ enthält die Sprite-Texturen die benötigt werden für diverse selbst erstelle Animationen (wie zum Beispiel eine "Stand-, "Renn-", "Attacken-" Animation).
fr: Considérez le joueur comme un élément que nous aimerions utiliser dans différentes scènes mères (par exemple des scènes de 'niveau'). Dans notre cas, l'élément joueur nécessite au moins un nœud AnimatedSprite. Ce nœud contient les textures de sprite nécessaires à diverses animations (par exemple, une animation de marche).
ja: プレイヤーを、異なる親シーン(たとえば、「レベル」シーン)で使用する要素として考えます。この場合、プレイヤー要素には少なくともAnimatedSpriteノードが必要です。このノードには、さまざまなアニメーション(歩行アニメーションなど)に必要なスプライトテクスチャが含まれています。
uk: Розглянемо гравця як елемент, який ми хотіли б використовувати в різних сценах предків (наприклад, сценах "рівнів"). У нашому випадку для елемента гравця потрібен щонайменше вузол AnimatedSprite. Цей вузол містить текстури спрайту, необхідні для різних анімацій (наприклад, анімація ходьби).
zh_cn: 将游戏角色视为我们要在不同父场景(例如 ``关卡`` 场景)中使用的元素. 在我们的例子中, 游戏角色元素至少需要一个 ``AnimatedSprite`` 节点. 该节点包含各种动画(例如, 行走动画)所需的精灵纹理.
zh_tw: 我們可以把玩家想像成一個要放在不同母場景（如「關卡」場景）中的元素。在這個例子中，要製作一個玩家元素至少需要使用到 AnimatedSprite 節點。這個節點包含了用於數種動畫的 Sprite 紋理（如走路的動畫）。

source: **A scene for the Enemy.**
cs: ** Scéna pro nepřítele. **
de: **Eine Szene für den Gegner.**
fr: **Une scène pour l'ennemi.**
ja: **敵のシーン**
uk: **Сцена для ворога**
zh_cn: **一个用于敌人的场景.**
zh_tw: **敵人場景。**

source: An enemy is also an element we'd like to use in several scenes. It's almost the same as the Player node. The only differences are the script (it needs 'AI' routines to generate the enemy's behavior) and the sprite textures used by the AnimatedSprite node.
cs: Nepřítel je také prvek, který bychom rádi použili v několika scénách. Je téměř stejný jako uzel Hráč. Jediné rozdíly jsou ve skriptu (potřebuje rutiny "AI" pro generování chování nepřítele) a sprite texturách, které používá uzel AnimatedSprite.
de: Ein Gegner ist ebenso ein Element welches wir gerne in verschiedenen Szenen verwenden wollen. Es ist fast exakt das selbe wie beim 'Spieler-Node'. Die einzig markanten Unterschiede sind Skripte und Sprite Texturen. Ein Gegner-Element benötigt nämlich Pfade (KI-Vorgabenbasiert) um das Feindverhalten abzubilden.
fr: Un ennemi est aussi un élément que nous aimerions utiliser dans plusieurs scènes. C'est presque la même chose que le nœud Joueur(Player). Les seules différences sont le script (il a besoin de routines 'AI' pour générer le comportement de l'ennemi) et les textures de sprite utilisées par le nœud AnimatedSprite.
zh_cn: 敌人也是我们想在多个场景中使用的元素. 它与 ``Player`` 节点几乎相同. 唯一的区别是脚本(需要 ``AI`` 程序来生成敌人的行为)和 ``AnimatedSprite`` 节点使用的精灵纹理不同.
zh_tw: 敵人也會需要用在多個場景內，大部分都跟玩家節點一樣。不同的地方只有腳本（敵人需要有一點「AI」來產生行為）以及 AnimatedSprite 節點用到的 Sprite 紋理。

source: **A Level scene.**
cs: **Scéna úrovně.**
de: **Eine Level-Szene.**
fr: **Une scène niveau.**
ja: **レベルシーン**
uk: **Сцена рівня**
zh_cn: **一个关卡场景.**
zh_tw: **關卡場景。**

source: A Level scene is composed of Bricks (for platforms), Coins (for the player to collect) and a number of instances of the Enemy scene. Each instance is a node in the Level scene tree. These instances are separate enemies, which initially have shared behavior and appearance as defined in the Enemy scene. You can set different properties for each Enemy node (to change its color, for example).
cs: Scéna úrovně se skládá z cihel (pro plošinky), mincí (které hráč sbírá) a několika instancí scény nepřítele. Každá instance je uzlem ve stromu scény Úroveň. Tyto instance jsou samostatní nepřátelé, kteří mají zpočátku společné chování a vzhled definovaný ve scéně Nepřítel. Každému uzlu scény Nepřítel můžete nastavit různé vlastnosti (například změnit jeho barvu).
de: Eine Level-Szene kann etwa mithilfe von Bauklötzen (für z.B. Plattformen), Münzen (für den Spieler zum Einsammeln), und einer Anzahl von Instanzen einer Gegner-Szene zusammengestellt werden. Jede Instanz ist ein Node in dem Level-Szenenbaum. Diese Instanzen sind separate Gegner, welche ursprünglich ein selbes Verhaltensmuster als auch Aussehen teilen (Gegner-Szene). Sie können verschiedene Eigenschaften für jedes Feind-Node einstellen (um zum Beispiel die Farbe zu ändern).
fr: Une scène de niveau(Level) est composée de briques(Bricks) (pour les plates-formes), de pièces(Coins) (à collecter par le joueur) et d'un certain nombre d'instances de la scène ennemie(Enemy). Chaque instance est un nœud dans l'arborescence de la scène niveau(Level). Ces instances sont des ennemis distincts, qui ont initialement un comportement et une apparence communs tels que définis dans la scène ennemie(Enemy). Vous pouvez définir différentes propriétés pour chaque nœud ennemi(Enemy) (pour changer sa couleur, par exemple).
zh_cn: 关卡场景由砖块(用于平台), 硬币(供玩家收集)和敌人场景的多个实例组成. 每个实例都是关卡场景树中的一个节点. 这些实例是单独的敌人, 最初具有在敌人场景中定义的共同行为和外观. 您可以为每个敌人节点设置不同的属性(例如, 更改其颜色).
zh_tw: 關卡場景是由磚塊（製作平台用）、硬幣（給玩家蒐集用）、以及數個敵人場景的實體所組成的。各個實體都是關卡場景樹內的一個節點。這些實體就是獨立的敵人，這些敵人的初始行為與外觀都是一樣的，由敵人場景所定義。我們可以為每個敵人節點設定不同的屬性（如更改顏色）。

source: 4. **A Main scene.** The Main scene would be composed of one root node with 2 children: a Player instance node, and a Level instance node. The root node can be anything, generally a "root" type such as "Node" which is the most global type, or "Node2D" (root type of all 2D-related nodes), "Spatial" (root type of all 3D-related nodes) or "Control" (root type of all GUI-related nodes).
cs: 4. **Hlavní scéna.** Hlavní scéna by se skládala z jednoho kořenového uzlu se dvěma potomky: uzlem instance Hráč a uzlem instance Úroveň. Kořenovým uzlem může být cokoli, obecně "kořenový" typ, například "Node", což je nejglobálnější typ, nebo "Node2D" (kořenový typ všech uzlů souvisejících s 2D), "Spatial" (kořenový typ všech uzlů souvisejících s 3D) nebo "Control" (kořenový typ všech uzlů souvisejících s grafickým uživatelským rozhraním).
de: 4. **Eine Hauptszene** Die Hauptszene würde zusammengestellt werden mit einem 'Root' (Wurzel-) Node mit zwei Kindern: Einem Spieler-Instanz Node, und einem Level-Instanz Node. Das Root-Node kann alles mögliche sein, normalerweile stellen "Node", der globalste Typ, oder "Node2D" (Root aller 2D-bezogenen Nodes), "Spatial" (Root aller 3D-bezogenen Nodes), oder "Control" (Root Typ für alle GUI-verwandten Nodes) den Root dar.
fr: 4. **Une scène principale ** La scène principale serait composée d'un nœud racine avec 2 enfants : une instance du nœud Joueur et une instance du nœud Niveau. Le nœud racine peut être n'importe quoi, généralement un type "racine" tel que "Node" qui est le type le plus global, ou "Node2D" (type racine de tous les nœuds en 2D), "Spatial" (type racine de tous les nœuds en 3D) ou "Control" (type racine de tous les nœuds en GUI).
ja: 4. **メインシーン。** メインシーンは、2つの子を持つ1つのルートノードで構成されます:プレイヤーインスタンスノードとレベルインスタンスノード。ルートノードは何でもかまいません。通常、最もグローバルなタイプである "Node" などの「ルート」タイプ、または "Node2D" (すべての2D関連ノードのルートタイプ)、"Spatial" (すべての3D-関連ノード)または "Control" (すべてのGUI関連ノードのルートタイプ)です。
uk: 4. **Головна сцена.** Головна сцена буде складатися з одного кореневого вузла з двома нащадками: вузлом екземпляра сцени Гравця та вузлом екземпляра сцени Рівня. Кореневим вузлом може бути будь-що, як правило, тип "кореня", глобальний "Node" ("Вузол"), або «Node2D» (тип кореня всіх 2D вузлів), "Spatial" ("Просторовий") (тип кореня для всіх 3D вузлів), або "Control" (тип кореня для всіх вузлів, пов'язаних із графічним інтерфейсом).
zh_cn: 4. **一个主场景** 主场景将由一个根节点以及2个子节点的组成: 一个 ``Player`` 实例节点和一个 ``Level`` 实例节点. 根节点可以是任何东西, 通常是 ``根(root)`` 类型, 例如最全局的 ``节点(Node)``, 或 ``Node2D`` (所有与2D相关的节点的根类型), ``Spatial`` (所有3D相关的节点), 或 ``Control`` (所有与GUI相关的节点的根类型).
zh_tw: 4. **主場景。** 主場將由一個根節點與兩個子節點組成：玩家實體節點與關卡實體節點。可以使用任何節點來當根節點，通常會使用如「Node」這種最全域的型別之類的「根」型別，或是用「Node2D」（所有 2D 相關節點的根型別）、「Spatial」（所有 3D 相關節點的根型別）、或「Control」（所有 GUI 相關節點的根型別）。

source: What are the advantages of this system? Wouldn't this system potentially increase the depth of the scene tree? And doesn't Unity already allow you to organize GameObjects by putting them inside empty GameObjects?
cs: Jaké jsou výhody tohoto systému? Nezvýšil by tento systém potenciálně složitost stromu scény? A neumožňuje už Unity organizovat GameObjects tím, že je umístí dovnitř prázdných GameObjects?
de: Welche Vorteile ergeben sich bei solch einem System? Würde dieses System nicht möglicherweise die Tiefe des Szenenbaumes negativ beeinflussen durch Erhöhung der Anzahl? Und erlaubt es Unity ohnehin nicht schon, SpielObjekte zu organisieren und zwar dadurch, diese in leere SpielObjekte zu packen?
fr: Quels sont les avantages de ce système ? Ce système n'augmenterait-il pas potentiellement la profondeur de l'arbre de scène ? Et Unity ne vous permet-il pas déjà d'organiser des GameObjects en les plaçant dans des GameObjects vides ?
ja: このシステムの利点は何ですか？このシステムはシーンツリーの深さを潜在的に増加させませんか？また、Unityではすでに、空のGameObjects内にGameObjectsを配置して、それを整理することを許可していませんか？
uk: Які переваги цієї системи? Чи не може ця система потенційно збільшити глибину дерева сцен? І чи Unity вже не дозволяє вам організувати GameObjects, помістивши їх всередину порожніх GameObjects?
zh_cn: 该系统的优点是什么？这个系统不会增加场景树的深度吗？而且Unity是否还是不允许您通过将游戏对象放到空的游戏对象中来组织游戏对象？
zh_tw: 這個系統有什麼優點？這套系統用到最後不會一直增加場景樹的深度嗎？而且 Unity 不是可以在空的 GameObject 裡放 GameObject 來組織嗎？

source: Godot's system is closer to the well-known object-oriented paradigm: Godot provides a number of nodes which are not clearly "Game Objects", but they provide their children with their own capabilities: this is inheritance.
cs: Godotův systém se blíží známému objektově orientovanému paradigmatu: Godot poskytuje řadu uzlů, které nejsou jednoznačně "herními objekty", ale poskytují svým potomkům vlastní unikátní schopnosti: jedná se o dědičnost.
de: 1) Das System ist stärker ausgerichtet am Paradigma der objektorientierten Programmierung: Godot bringt eine Reihe an Nodes mit, die in dem Sinne zwar keine "Game Objects" darstellen, allerdings erhalten davon abgeleitete Unterobjekte die Eigenschaften und Methoden des Eltern-Nodes: Das ist das Prinzip der Vererbung.
fr: Le système de Godot est plus proche du célèbre paradigme orienté objet : Godot fournit un certain nombre de nœuds qui ne sont pas clairement des "Game Objects", mais ils fournissent à leurs enfants leurs propres capacités : c'est l'héritage.
ja: Godotのシステムは、よく知られているオブジェクト指向のパラダイムにより近いものです。Godotは、明らかに「ゲームオブジェクト」ではない多くのノードを提供しますが、子には独自の機能を提供します:これは継承です。
uk: Система Godot ближче до відомої об'єктно-орієнтованої парадигми: Godot пропонує ряд вузлів, які не є чітко «ігровими об'єктами», але вони надають своїм нащадкам власні можливості: це спадковість.
zh_cn: Godot的系统更接近众所周知的面向对象的范例:Godot提供了许多不明确的 "游戏对象" 节点, 但它们为子节点提供了自己的功能: 这就是继承.
zh_tw: Godot 的系統與大名鼎鼎的物件導向類似：Godot 提供了數種節點明顯就不是「遊戲物件 (Game Object)」，但這些節點能將自己的功能提供給子節點：這就是繼承。

source: Godot allows the extraction of a subtree of a scene to make it a scene of its own. So if a scene tree gets too deep, it can be split into smaller subtrees. This is better for reusability, as you can include any subtree as a child of any node. Putting multiple GameObjects in an empty GameObject in Unity does not provide the same functionality.
cs: Godot umožňuje extrahovat podstrom scény a vytvořit z něj vlastní scénu. Pokud je tedy strom scény příliš hluboký, lze jej rozdělit na menší podstromy. To je lepší pro opakované využití, protože můžete zahrnout libovolný podstrom jako potomka libovolného uzlu. Vložení více herních objektů do prázdného herního objektu v Unity stejnou funkci neposkytuje.
de: Godot gestattet die Extrahierung eines Subbaumes einer Szene um das Ganze zu einer eigenen Szene zu machen. Falls ein Szenenbaum zu tief gehen würde könnte er also in kleinere Subbäume geteilt werden. Das ist eindeutig besser und trägt zur Lesbarkeit bei, so kann man jeden Subbaum in ein Node einbinden. Mehrere SpielObjekte in ein SpielObjekt zu stecken wäre so in der Form in Unity nicht möglich.
fr: Godot permet d'extraire un sous-arbre d'une scène pour en faire une scène à part entière. Ainsi, si un arbre de scène devient trop profond, il peut être divisé en sous-arbres plus petits. C'est mieux pour la ré-utilisabilité, car vous pouvez inclure n'importe quel sous-arbre comme un enfant de n'importe quel nœud. Mettre plusieurs GameObjects dans un GameObject vide dans Unity n'offre pas les mêmes fonctionnalités.
ja: Godotでは、シーンのサブツリーを抽出して、それを独自のシーンにすることができます。そのため、シーンツリーが深くなりすぎると、より小さなサブツリーに分割できます。任意のサブツリーを任意のノードの子として含めることができるため、これは再利用性がより優れています。 Unityの空のGameObjectに複数のGameObjectを配置しても、同じ機能は提供されません。
uk: Godot дозволяє видобувати гілку дерева сцени, щоб зробити її незалежною сценою. Отже, якщо дерево сцени стає занадто глибоким, воно може бути розділене на більш дрібні під-сцени. Вони кращі для повторного використання, оскільки ви можете включити будь-який під-сцену в якості нащадка будь-якого вузла. Вкладка декількох GameObjects в порожній GameObject в Unity не забезпечує таку саму функціональність.
zh_cn: Godot允许抽取一个场景的子树以使其成为它自己的场景. 因此, 如果场景树变得过深, 则可以将其拆分为较小的子树. 这对于可重用性来说也很好, 因为您可以将任何子树作为子级包含在其他任何节点中. 在Unity中, 将多个 ``GameObject`` 放入空 ``GameObject`` 中不会提供相同的功能.
zh_tw: 在 Godot 中可以將場景的某個子樹獨立變成一個場景。所以當場景樹變得太深的時候可以將其切割為幾個小子樹。這樣一來可重複性也變得更好，因為任何節點都可以新增任何子樹為子節點。在 Unity 中將多個 GameObject 放到一個空的 GameObject 中並不會有相同的效果。

source: There is no perfect project architecture. Any architecture can be made to work in either Unity and Godot.
cs: Neexistuje dokonalá architektura projektu. Jakákoli architektura může fungovat jak v Unity, tak v Godotu.
de: Es gibt keine perfekte Projekt-Architektur. Jede Architektur kann zum laufen gebracht werden, sowohl in Unity als auch in Godot.
fr: Il n'y a pas d'architecture de projet parfaite. N'importe quelle architecture peut fonctionner avec Unity comme avec Godot.
ja: 完璧なプロジェクトアーキテクチャはありません。 UnityおよびGodotで動作するように、任意のアーキテクチャを作成できます。
uk: Немає ідеальної архітектури проектів. Будь-яку архітектуру можна спроектувати так, щоб вона працювала як в Unity, так і в Godot.
zh_cn: 没有完美的项目架构. 任何架构都可以在Unity和Godot中使用.
zh_tw: 沒有一種專案架構是最完美的。各種不同的架構都可以在 Unity 與 Godot 內使用。

source: However, a common architecture for Unity projects is to have one Assets folder in the root directory that contains various folders, one per type of asset: Audio, Graphics, Models, Materials, Scripts, Scenes, and so on.
cs: Běžná architektura projektů Unity však spočívá v tom, že v kořenovém adresáři je jedna složka Assets, která obsahuje různé složky, jednu pro každý typ zdroje: Audio, Grafika, Modely, Materiály, Skripty, Scény atd.
de: Wie auch immer, die gebräuchlichste Architektur für Unity Projekte ist es, ein Assets Verzeichnis im Hauptverzeichnis zu haben, in dem alle weiteren Verzeichnisse enthalten sind, jeweils getrennt nach Audio, Grafik, Modelle, Materialen, Scripte, Szenen, usw.
fr: Cependant, une architecture commune pour les projets Unity est d'avoir un dossier Assets dans le répertoire racine qui contient plusieurs dossiers, un par type de asset : Audio, Graphiques, Modèles, Matériaux, Scripts, Scènes, etc.
ja: ただし、Unityプロジェクトの一般的なアーキテクチャでは、ルートディレクトリにAssetsフォルダが1つあり、このフォルダ内に、オーディオ、グラフィック、モデル、マテリアル、スクリプト、シーンなど、アセットの種類ごとにさまざまなフォルダが含まれます。
uk: Однак загальна архітектура проектів Unity полягає в тому, щоб у кореневому каталозі містилася одна папка активів, яка містить різні папки, по одній на кожен тип об'єкта: Аудіо, Графіку, Моделі, Матеріали, Скрипти, Сцени тощо.
zh_cn: 但是,Unity项目的通用架构是在根目录中有一个 ``Assets`` 文件夹, 其中包含各种文件夹, 每种素材类型有一个文件夹: 音频(Audio), 图形(Graphics), 模型(Models), 材质(Materials), 脚本(Scripts), 场景(Scenes)等.
zh_tw: 然而，Unity 專案常見的架構為在根目錄放一個 Assets 資料夾，裡面包含給不同素材的各個資料夾：Audio、Graphics、Models、Materials、Scripts、Scenes…等。

source: Since Godot allows splitting scenes into smaller scenes, each scene and subscene existing as a file in the project, we recommend organizing your project a bit differently. This wiki provides a page for this: :ref:`doc_project_organization`.
cs: Vzhledem k tomu, že Godot umožňuje rozdělit scény na menší scény, přičemž každá scéna a dílčí scéna existuje v projektu jako samostatný soubor, doporučujeme uspořádat projekt trochu jinak. Tato wiki k tomu poskytuje stránku: :ref:`doc_project_organization`.
de: Da Godot das Aufteilen von Szenen in kleinere Szenen erlaubt, und jede Szene und Unterszene als eigene Datei innerhalb des Projektes existiert, empfehlen wir das Projekt etwas anders zu organisieren. Dieser Eintrag führt zu einer entsprechende Seite: :ref:`doc_project_organization`.
fr: Comme Godot permet de diviser les scènes en scènes plus petites, chaque scène et sous-scène existant sous forme de fichier dans le projet, nous vous recommandons d'organiser votre projet un peu différemment. Ce wiki fournit une page pour cela : :ref:`doc_project_organization`.
ja: Godotではシーンを小さなシーンに分割することができるため、各シーンとサブシーンはプロジェクト内のファイルとして存在します。そのため、プロジェクトを少し異なる方法で整理することをお勧めします。このwikiはこのためのページを提供します: :ref:`doc_project_organization`\ 。
uk: Оскільки Godot дозволяє розділити сцени на менші сцени, кожна сцена та під-сцена існують, як файл у проекті, радимо організувати ваш проект дещо інакше. Ця вікі надає сторінку для цього: :ref:`doc_project_organization`.
zh_cn: 由于Godot允许将场景拆分为较小的场景, 在项目中, 每个场景和子场景都作为文件存在, 因此我们建议对项目进行一些不同的组织. 该手册为此提供了一个页面: :ref:`doc_project_organization`.
zh_tw: 由於 Godot 內可以將場景切分為許多小場景，各個場景與子場景在專案裡都作為檔案存在，所以我們建議你用稍微不同的方式來組織專案。這篇 Wiki 為此提供了一頁： :ref:`doc_project_organization` 。

source: A prefab as provided by Unity is a 'template' element of the scene. It is reusable, and each instance of the prefab that exists in the scene has an existence of its own, but all of them have the same properties as defined by the prefab.
cs: Prefabrikát poskytovaný Unity je "šablonový" prvek scény. Je opakovaně použitelný a každá instance prefabu, která existuje ve scéně, existuje samostatně, ale všechny mají stejné vlastnosti definované prefabem.
de: Als 'Prefrab' bezeichnet man, genau wie in Unity, eine Art 'Vorlage' der Szene. Es ist wiederverwendbar und jedes dieser Templates, dass sich in der Szene befindet, steht alleine, jedoch haben alle dieselben Eigenschaften wie das Original.
fr: Une préfab tel que fourni par Unity est un 'modèle' d'élément de la scène. Il est réutilisable, et chaque instance du préfab qui existe dans la scène a sa propre existence, mais toutes ont les mêmes propriétés que celles définies par le préfab.
ja: Unityによって提供されるプレハブは、シーンの「テンプレート」要素です。これは再利用可能で、シーン内に存在するプレハブの各インスタンスはそれ自体の存在を持ちますが、それらのすべてがプレハブで定義されているものと同じプロパティを持ちます。
uk: Префаби, передбачені в Unity, є елементом "шаблону" сцени. Вони багаторазового використання, і кожен екземпляр префабу, який існує на сцені, має своє особисте існування, але всі вони мають ті самі властивості, що визначені в префабі.
zh_cn: Unity提供的预制件是场景的 ``模板`` 元素. 它是可重复使用的, 并且场景中存在的预制体的每个实例都有其自己的存在, 但所有它们都具有与预制体所定义的相同的属性.
zh_tw: Unity 中的 Prefabs 是場景中的一個「樣板」元素。可以重複使用，且存在於場景中的各個 Prefab 實體都有自己的存在，但這些所有的實體都共用 Prefab 裡定義的屬性。

source: Godot does not provide prefabs as such, but the same functionality is provided by its scene system: The scene system is organized as a tree. Godot allows you to save any subtree of a scene as a scene file. This new scene can then be instanced as many times as you want, as a child of any node. Any change you make to this new, separate scene will be applied to its instances. However, any change you make to the instance will not have any impact on the 'template' scene.
cs: Godot neposkytuje prefabrikáty jako takové, ale stejnou funkci poskytuje jeho systém scén: Systém scén je uspořádán jako strom. Godot umožňuje uložit libovolný podstrom scény jako soubor scény. Tuto novou scénu pak můžete libovolně mnohokrát instancovat jako potomka libovolného uzlu. Jakákoli změna, kterou v této nové samostatné scéně provedete, se použije na její instance. Jakákoli změna, kterou provedete v instanci, však nebude mít žádný dopad na "šablonovou" scénu.
de: Godot bietet keine Vorlagen als solche, aber das Szenensystem bietet die gleiche funktionalität und ist in einer Baumstruktur aufgebaut. Godot erlaubt das speichern von einem Teil dieses Baums als Szenen-Datei. Diese neue Szene kann dann als neues Unterobjekt eines Nodes so oft man möchte eingefügt werden. Jede Änderung an dieser neuen, separaten Szenenvorlage wird an allen genutzten Objekten vorgenommen. Im Gegensatz dazu hat eine Änderung an solch einem Unterobjekt keine Auswirkung auf die VorlagenSzene.
fr: Godot ne fournit pas de préfabs en tant que tels, mais la même fonctionnalité est fournie par son système de scène : Le système de scène est organisé sous forme d'arbre. Godot vous permet d'enregistrer n'importe quel sous-arbre d'une scène dans un fichier de scène. Cette nouvelle scène peut alors être instanciée autant de fois que vous le souhaitez, comme un enfant de n'importe quel nœud. Toute modification que vous apportez à cette nouvelle scène séparée sera appliquée à ses instances. Cependant, tout changement que vous apporterez à l'instance n'aura aucun impact sur la scène 'modèle'.
ja: Godotはプレハブ自体を提供しませんが、同じ機能がシーンシステムによって提供されます。シーンシステムはツリーとして編成されます。 Godotでは、シーンのサブツリーをシーンファイルとして保存できます。この新しいシーンは、任意のノードの子として、何度でもインスタンス化できます。この新しい個別のシーンに加えた変更は、そのインスタンスに適用されます。ただし、インスタンスに加えた変更は、「テンプレート」シーンには影響しません。
uk: Godot не надає префаби, але таку ж функціональність забезпечує його система сцен: Система сцен організована як дерево. Godot дозволяє зберегти будь-яку гілку дерева сцени, як файл окремої сцени. Цю нову сцену можна потім вставляти стільки разів, скільки ви хочете, в якості нащадка будь-якого вузла. Будь-яка зміна, внесена в цю нову окрему сцену, буде застосована до її вже вставлених екземплярів. Однак будь-які зміни, внесені до екземпляра, не матимуть ніякого впливу на сцену 'шаблону'.
zh_cn: Godot本身不提供预制件, 但其场景系统提供了相同的功能: 场景系统组织为一棵树.Godot允许您将场景的任何子树保存为一个场景文件. 然后, 可以将这个新场景作为任意节点的子节点实例化任意多次. 您对此新的独立场景所做的任何更改都将应用于其实例. 但是, 您对实例所做的任何更改都不会对 ``模板`` 场景产生任何影响.
zh_tw: Godot 沒有這樣的 Prefab，但場景系統提供了相同的功能：場景系統以樹狀結構組織。Godot 內可以將場景的任何子樹保存為場景檔案，新的場景可以被任意實體化作為任何節點的子節點。對新場景的改動會套用到所有的實體上，但對實體做的改動不會影響到「樣板」場景。
