Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/unity_to_godot.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: To be precise, you can modify the parameters of an instance in the Inspector panel. The nodes that compose this instance are initially locked. You can unlock them if you need to by right-clicking the instance in the Scene tree and selecting "Editable children" in the menu. You don't need to do this to add *new* child nodes to this node. Remember that any new children will belong to the instance, not to the 'template' scene on disk. If you want to add new children to every instance of your 'template' scene, then you should add them in the 'template' scene.
cs: Přesněji řečeno, parametry instance můžete upravit v panelu Inspector. Uzly, které tuto instanci tvoří, jsou zpočátku uzamčeny. V případě potřeby je můžete odemknout kliknutím pravým tlačítkem myši na instanci ve stromu scény a výběrem možnosti "Editovatelné děti" v nabídce. Pro přidání *nových* podřízených uzlů k tomuto uzlu to nemusíte dělat. Nezapomeňte, že všechny nové děti budou patřit k instanci, nikoli k "šabloně" scény na disku. Pokud chcete přidat nové děti do každé instance scény "šablony", pak byste je měli přidat do scény "šablony".
de: Um genau zu sein, können Sie die Parameter einer Instanz in der Inspektorleiste ändern. Die Nodes, aus denen diese Instanz besteht, sind zunächst gesperrt. Sie können sie bei Bedarf entsperren, indem Sie mit der rechten Maustaste auf die Instanz im Szenenbaum klicken und im Menü "Bearbeitbare untergeordnete Elemente" auswählen. Sie müssen dies nicht tun, um diesem Node *neue* untergeordnete Nodes hinzuzufügen. Denken Sie daran, dass alle neuen untergeordneten Elemente zur Instanz gehören und nicht zur "Vorlagenszene" auf der Festplatte. Wenn Sie jeder Instanz Ihrer "Vorlagenszene" neue untergeordnete Elemente hinzufügen möchten, sollten Sie diese in der "Vorlagenszene" hinzufügen.
fr: Pour être précis, vous pouvez modifier les paramètres de l'instance dans le panneau Inspecteur. Toutefois, les nœuds qui composent cette instance sont verrouillés.Vous pouvez les déverrouiller en cliquant avec le bouton droit de la souris sur l'instance dans l'arborescence de la scène et en sélectionnant "Enfants modifiables" dans le menu. Vous n'avez pas besoin de faire cela pour ajouter de *nouveaux* nœuds enfants à ce nœud.. Rappelez-vous que ces nouveaux enfants appartiendront à l'instance, pas à la scène 'template'. Si vous souhaitez ajouter de nouveaux enfants à toutes les instances de votre scène 'template', vous devez les ajouter dans la scène 'template'.
ja: 正確には、インスペクタパネルでインスタンスのパラメーターを変更できます。このインスタンスを構成するノードは、最初はロックされています。必要に応じて、シーンツリーでインスタンスを右クリックし、メニューで[編集可能な子]を選択してロックを解除できます。このノードに *新しい* 子ノードを追加するためにこれを行う必要はありません。新しい子は、ディスク上の「テンプレート」シーンではなく、インスタンスに属することに注意してください。 「テンプレート」シーンのすべてのインスタンスに新しい子を追加する場合は、「テンプレート」シーン自体に追加する必要があります。
uk: Якщо бути точним, ви можете змінити параметри екземпляра на панелі Інспектор. Вузли, які складають цей екземпляр, спочатку заблоковані. Ви можете розблокувати їх при потребі, клацнувши правою кнопкою миші екземпляр у дереві сцени та вибравши в меню "Редагувати дочірній елемент". Вам не потрібно цього робити, щоб додати до цього вузла *нових* нащадків. Пам'ятайте, що будь-які нові нащадки будуть належати екземпляру, а не 'шаблонній' сцени на диску. Якщо ви хочете додати нових нащадків до кожного екземпляра 'шаблонної' сцени, тоді вам слід додати їх до самої 'шаблонної' сцени.
zh_cn: 确切地说, 您可以在属性检查器面板中修改实例的参数. 组成此实例的节点最初被锁定. 如果需要, 可以通过右键点击场景树中的实例并在菜单中选择 ``可编辑子代`` 来解锁它们. 您无需执行此操作即可向该节点添加 *新的* 子节点. 请记住, 任何新的子项都将属于该实例, 而不是磁盘上的 ``模板`` 场景. 如果要将新的子项添加到 ``模板`` 场景的每个实例, 则应将在 ``模板`` 场景中添加.
zh_tw: 講得更精確一點，我們可以在屬性面板中修改一個實體的參數。構成這個實體的節點預設是鎖定的，若有需要則可以在場景樹中右鍵點擊實體並在選單中選擇「可編輯子節點」來解鎖。若要往該節點 **新增** 子節點則不需要解鎖，但要記得新的子節點是屬於實體的而不是保存在硬碟上的「樣板」場景。如果「樣板」場景的每個實體都需要新增子節點的話，那應該把子節點加在「樣板」場景內。

source: Prefab -> Reusable Scene file
cs: Prefabrikát -> Soubor opakovaně použitelné scény
de: Prefab -> Wiederverwendbare Szenendatei
fr: Prefab -> Fichier de Scène réutilisable
ja: Prefab(プレハブ) -> Reusable Scene file(再利用可能なシーンファイル)
uk: Префаб -> Багаторазовий файл сцени
zh_cn: 预制件(Prefab) -> 可重用的场景文件(Reusable Scene file)
zh_tw: Prefab -> 可重複使用的場景檔

source: Unity supports C#. C# benefits from its integration with Visual Studio and has desirable features such as static typing.
cs: Unity podporuje jazyk C#. C# těží z integrace s Visual Studiem a má žádoucí vlastnosti, jako je statické typování.
de: Unity unterstützt C#. C# profitiert von der Integration seitens Visual Studios und bietet begehrenswerte Features wie Static Typing.
fr: Unity supporte C#. C# bénéficie de son intégration avec Visual Studio et possède des fonctionnalités intéressantes telles que la saisie statique.
ja: Unity は C# をサポートしています。C# には Visual Studio と統合されているという利点があり、静的な型指定などの望ましい機能があります。
uk: Unity підтримує C#. C# виграє від інтеграції з Visual Studio і має такі бажані функції, як статична типізація.
zh_cn: Unity支持C#.C#受益于它与Visual Studio的集成, 并具有理想的功能, 例如静态类型.
zh_tw: Unity 支援 C#，C# 收益於與 Visual Studio 的整合，且擁有如靜態型別等理想的功能。

source: Godot provides its own scripting language, :ref:`GDScript <doc_scripting>` as well as support for :ref:`Visual Script <toc-learn-scripting-visual_script>` and :ref:`C# <doc_c_sharp>`. GDScript borrows its syntax from Python, but is not related to it. If you wonder about the reasoning for a custom scripting language, please read the :ref:`doc_gdscript` and :ref:`doc_faq` pages. GDScript is strongly attached to the Godot API and doesn't take long to learn: Between one evening for an experienced programmer and a week for a complete beginner.
cs: Godot poskytuje vlastní skriptovací jazyk :ref:`GDScript <doc_scripting>` a také podporu pro :ref:`Visual Script <toc-learn-scripting-visual_script>` a :ref:`C# <doc_c_sharp>`. GDScript si vypůjčuje syntaxi z jazyka Python, ale není s ním nijak spřízněn. Pokud vás zajímají důvody pro vlastní skriptovací jazyk, přečtěte si stránky :ref:`doc_gdscript` a :ref:`doc_faq`. GDScript je pevně spjat s rozhraním API Godot a jeho naučení nezabere mnoho času: Pro zkušeného programátora je to jeden večer, pro úplného začátečníka týden.
de: Godot bietet eine eigene Skriptsprache, :ref:`GDScript <doc_scripting>` sowie auch Support für :ref:`VisualScript <toc-learn-scripting-visual_script>` und :ref:`C# <doc_c_sharp>`. GDScript hat einen ähnlichen Aufbau wie Python, beide sind aber nicht miteinander verwand.Falls Sie sich wundern wieso eine eigene Skriptsprache verwendet wird, siehe hier :ref:`doc_gdscript` and :ref:`doc_faq`. GDScript ist stark mit der Godot API verknüpft und ist einfach zu erlernen: etwa einen Abend für einen erfahrenen Programmierer und eine Woche für einen Anfänger.
fr: Godot fournit son propre langage de script, :ref:`GDScript <doc_scripting>` ainsi que le support pour :ref:`Visual Script <toc-learn-scripting-visual_script>` et :ref:`C# <doc_c_sharp>`. GDScript emprunte sa syntaxe à Python, mais n'y est pas lié. Si vous vous interrogez sur la raison d'un langage de script personnalisé, lisez les pages :ref:`doc_gdscript` et :ref:`doc_faq`. GDScript est fortement attaché à l'API Godot et est très facile à apprendre : entre une soirée pour un programmeur expérimenté et une semaine pour un pure débutant.
ja: Godot は独自のスクリプト言語 :ref:`GDScript <doc_scripting>` と、 :ref:`Visual Script <toc-learn-scripting-visual_script>` および :ref:`C# <doc_c_sharp>` のサポートを提供します。GDScript は Python から構文を借用しましたが直接的な関連はありません。カスタム スクリプト言語について不明な点があれば、 :ref:`doc_gdscript` と :ref:`doc_faq` ページをお読みください。GDScript は Godot API に強く結び付けられており、学習に時間はかかりません: 経験豊富なプログラマなら 1 晩から 1 週間で習得出来ます。
uk: Godot пропонує власну мову для написання скриптів, :ref:`GDScript <doc_scripting>`, а також підтримку :ref:`Visual Script <toc-learn-scripting-visual_script>` та :ref:`C# <doc_c_sharp>`. GDScript запозичив свій синтаксис у Python, але не має до нього ніякого відношення. Якщо ви сформувати свою думку щодо власної мови написання скриптів, будь ласка, прочитайте :ref:`doc_gdscript` та :ref:`doc_faq`. GDScript сильно прив'язаний до API Godot і його освоєння не потребує багато часу: від одного вечора для досвідченого програміста до тижня для початківця.
zh_cn: Godot提供了自己的脚本语言, :ref:`GDScript <doc_scripting>`, 以及对 :ref:`Visual Script <toc-learn-scripting-visual_script>` 和 :ref:`C # <doc_c_sharp>` 的支持.GDScript虽然从 Python 中借用了它的语法, 但与它无关. 如果您想了解自定义脚本语言的原因, 请阅读 :ref:`doc_gdscript` 和 :ref:`doc_faq` 页面.GDScript与Godot API紧密相连, 无需花太多时间即可学习: 一个经验丰富的程序员的一个晚上, 一个完全的初学者的一周时间, 即可学会.
zh_tw: Godot 提供了自己的腳本語言 :ref:`GDScript <doc_scripting>` ，同時也支援 :ref:`視覺腳本 (VisualScript) <toc-learn-scripting-visual_script>` 以及 :ref:`C# <doc_c_sharp>` 。GDDScript 雖然從 Python 借來了語法結構，但與 Python 並無關聯。若你想瞭解為什麼我們使用了自己的腳本語言，請參考 :ref:`doc_gdscript` 與 :ref:`doc_faq` 頁面。GDScript 與 Godot API 的緊密整合，且不需花費太多時間來學習，對於有經驗的程式設計師只需要花一個晚上，完全的新手花一個星期的時間即可上手。

source: Unity allows you to attach as many scripts as you want to a GameObject. Each script adds a behavior to the GameObject: For example, you can attach a script so that it reacts to the player's controls, and another that controls its specific game logic.
cs: Unity umožňuje připojit k hernímu objektu libovolný počet skriptů. Každý skript přidává k objektu GameObject určité chování: Můžete například připojit skript, který bude reagovat na ovládání hráče, a další, který bude ovládat jeho specifickou herní logiku.
de: Unity erlaubt es mehrere Skripte an ein GameObject anzufügen. Jedes Skript ist für ein bestimmtes Verhalten des GameObjects zuständig: Zum Beispiel kann ein Skript auf die Spielereingabe reagieren und ein anderes Skript steuert die spezielle Spiellogik.
fr: Unity vous permet d'attacher autant de scripts que vous voulez à un GameObject. Chaque script ajoute un comportement au GameObject : Par exemple, vous pouvez attacher un script pour qu'il réagisse aux commandes du joueur, et un autre qui contrôle sa logique de jeu spécifique.
zh_cn: Unity允许您将任意数量的脚本附加到 GameObject 上. 每个脚本都会向 GameObject 添加一个行为: 例如, 您可以附加一个脚本, 使其对玩家的控制做出反应, 而另一个脚本则控制其特定的游戏逻辑.
zh_tw: Unity 允許在 GameObject 上附加任意數量的腳本，每個腳本都會為 GameObject 增加行為。舉例來說，可以新增一個用來對應玩家控制的腳本，而另一個用來控制特定的遊戲邏輯。

source: As you can see, it can be easy to turn a scene tree to a mess. Consider splitting any complicated scene into multiple, smaller branches.
cs: Jak vidíte, může se snadno stát, že se strom na scéně změní v nepořádek. Zvažte rozdělení každé složité scény na více menších větví.
de: Wie Sie sehen können, kann es einfach sein, einen Szenenbaum in ein Chaos zu verwandeln. Teilen Sie eine komplizierte Szene in mehrere kleinere Zweige auf.
fr: Comme vous pouvez le voir, il peut être facile de transformer un arbre de scène en désordre. Envisagez de diviser toute scène compliquée en plusieurs branches plus petites.
ja: ご覧のとおり、シーンツリーを混乱させるのは簡単です。複雑なシーンを複数の小さなブランチに分割することを検討してください。
uk: Як бачите, впорядкувати дерево сцен доволі легко. Просто розгляньте розділення будь-якої складної сцени на кілька, менших гілок.
zh_cn: 如您所见, 将场景树变成一团糟很容易. 考虑将任何复杂的场景分为多个较小的分支.
zh_tw: 就像這樣，場景樹可能很容易變得很亂。可以考慮將複雜的場景拆分成多個較小的分支。

source: You can control nodes by accessing them using a script and calling functions (built-in or user-defined) on them. But there's more: You can also place them in a group and call a function on all nodes contained in this group! This is explained in the :ref:`scripting documentation <doc_scripting_continued>`.
es: Se puede controlar los nodos accediendo a ellos mediante un script, y llamar sus funciones (integradas o definidas por el usuario). Pero hay más: ¡también puedes colocarlos en un grupo y llamar a una función en todos los nodos que contiene este grupo! Esto se explica en esta página :ref:`scripting documentation <doc_scripting_continued>`.

source: But there's more! Certain nodes throw signals when certain actions happen. You can connect these signals to call a specific function when they happen. Note that you can define your own signals and send them whenever you want. See the :ref:`signals documentation <doc_gdscript_signals>` for details.
es: ¡Pero hay más! Algunos nodos emiten señales cuando ocurren ciertas acciones. Se pueden conectar estas señales para llamar a una función específica en el momento en que se produce. Hay que tener en cuenta que puedes definir tus propias señales y enviarlas cuando quieras. Esta característica está documentada aquí :ref:`signals documentation <doc_gdscript_signals>` .

source: For your information, Godot also allows you to develop your project directly in C++ by using its API, which is not possible with Unity at the moment. As an example, you can consider Godot Engine's editor as a "game" written in C++ using Godot API.
es: Para tu información, Godot también permite desarrollar un proyecto directamente en C++ utilizando su API, lo que no es posible con Unity en este momento. Por ejemplo, puedes considerar el editor de Godot Engine como un "juego" escrito en C++ usando la API de Godot.
pt_br: Para sua informação, Godot também permite que você desenvolva seu projeto diretamente em C ++ usando sua API, o que não é possível com a Unity no momento. Como exemplo, você pode considerar o editor do Godot Engine como um "jogo" escrito em C ++ usando a Godot API.
ru: К вашему сведению, Godot также позволяет вам разрабатывать ваш проект непосредственно на языке C++, используя API, что в данный момент невозможно в Unity. В качестве примера можно рассматривать редактор Godot Engine как "игру", написанную на языке C++ с использованием API Godot.

source: While both editors may seem similar, there are many differences below the surface. Both let you organize the project using the filesystem, but Godot's approach is simpler with a single configuration file, minimalist text format, and no metadata. All this contributes to Godot being much friendlier to VCS systems such as Git, Subversion, or Mercurial.
pt_br: Embora ambos os editores possam parecer semelhantes, há muitas diferenças por trás. Ambos permitem organizar o projeto usando o sistema de arquivos, mas a abordagem da Godot é mais simples, com um único arquivo de configuração, formato de texto minimalista e nenhum metadado. Tudo isso contribui para a Godot ser muito mais amigável para sistemas VCS, como Git, Subversion ou Mercurial.

source: Godot does not provide prefabs as such, but this functionality is here, again, filled thanks to its scene system: As we saw the scene system is organized as a tree. Godot allows you to save a subtree of a scene as its own scene, thus saved into its own file. This new scene can then be instanced as many times as you want. Any change you make to this new, separate scene will be applied to its instances. However, any change you make to the instance will not have any impact on the 'template' scene.
pt_br: Godot não fornece prefabs como tal, mas esta funcionalidade está aqui, novamente, preenchida graças ao seu sistema de cena: Como vimos, o sistema de cena é organizado como uma árvore. Godot permite que você salve uma sub-árvore de uma cena como sua própria cena, assim salva em seu próprio arquivo. Essa nova cena pode ser instanciada quantas vezes você quiser. Qualquer alteração que você fizer nessa cena nova e separada será aplicada a suas instâncias. No entanto, qualquer alteração feita na instância não terá impacto na cena "modelo".

source: GameObject -> Node Add a component -> Inheriting Prefab -> Externalized branch
pt_br: Objeto de Jogo -> Nó Adicionar um componente -> Herdar Prefab -> ramificação Externalizada

source: You can control nodes by accessing them using a script and calling functions (built-in or user-defined) on them. But there's more: You can also place them in a group and call a function on all nodes contained in this group! This is explained in :ref:`this page <doc_scripting_continued>`.
pt_br: Você pode controlar os nós, acessando-os usando um script e chamando funções (built-in ou definidos pelo usuário) sobre eles. Mas há mais: você também pode colocá-los em um grupo e chamar uma função em todos os nós contidos neste grupo! Isto é explicado em: ref: `this page <doc_scripting_continued>`.
