Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/unity_to_godot.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Live editing is a lot more useful because changes done to the editor take effect immediately in the game and are not lost (nor have to be synced) when the game is closed. This allows fantastic workflows, like creating levels while you play them.
cs: Živá editace je mnohem užitečnější, protože změny provedené v editoru se ve hře projeví okamžitě a po zavření hry se neztratí (ani se nemusí synchronizovat). To umožňuje fantastické pracovní postupy, například vytváření úrovní během hraní.
de: Live-Bearbeitung ist um einiges nützlicher da Modifizierungen, getätigt im Editor, im Spiel sofort Wirkung zeigen, und gehen dann nicht verloren (und müssen nicht synchronisiert werden) sobald das Spiel geschlossen wird. Dies erlaubt effiziente Arbeitsweisen, so in etwa wie Levels zu erstellen während Sie sie spielen.
es: La edición en vivo es mucho más útil porque los cambios hechos al editor tienen efecto inmediatamente en el juego y no se pierden (ni tienen que ser sincronizados) cuando el juego está cerrado. Esto permite flujos de trabajo fantásticos, como crear niveles mientras los reproduces.
fr: Le montage en direct est beaucoup plus pratique car les modifications apportées par l'éditeur prennent effet immédiatement dans le jeu et ne sont pas perdues (ni n'ont besoin d'être synchronisées) lorsque le jeu est fermé. Cela permet des flux de travail fantastiques, comme la création de niveaux pendant que vous les jouez.
ja: ライブ編集は、エディタに加えた変更がゲーム内で直ちに有効になり、ゲームが閉じられても失われない(同期する必要がない)ため、はるかに便利です。これにより、プレイ中にレベルを作成するなどの素晴らしいワークフローが可能になります。
ko: 실시간 편집은 에디터에서 변경한 사항이 게임에 즉시 적용되고 게임을 끌 때 (동기화 할 필요도 없이) 사라지지 않으니 훨씬 더 유용합니다. 이것으로 플레이 도중 레벨을 만드는 등의 환상적인 워크플로가 가능합니다.
pt_br: A edição ao vivo é muito mais útil porque as alterações feitas ao editor entram em vigor imediatamente no jogo e não são perdidas (nem precisam ser sincronizadas) quando o jogo é fechado. Isso permite fluxos de trabalho fantásticos, como criar níveis enquanto você os reproduz.
ru: Редактирование в реальном времени гораздо более полезно, поскольку изменения, внесенные в редактор, вступают в силу немедленно в самой игре и не сбрасываются (и не требуют синхронизации), после закрытия. Это позволяет создавать невероятные вещи, такие как создание уровней во время игры.
uk: Редагування в реальному часі більш корисне, оскільки зміни, внесені до редактора, набувають чинності негайно, прямо в грі і не втрачаються (не синхронізуються), при закритті гри. Це дозволяє фантастичні робочі процеси, наприклад, створення рівнів під час відтворення гри.
zh_cn: 实时编辑更为有用, 因为对编辑器所做的更改会在游戏中立即生效, 并且在游戏关闭时不会丢失(也不必同步). 这样允许出色的工作流程, 例如在运行游戏时创建关卡.
zh_tw: 更實用的是即時編輯功能，因為在編輯器上做的改動會直接立即影響遊戲，且遊戲關閉時也不會遺失改動（也不需同步）。這樣一來便能有出色的工作流程，如在執行遊戲時同時編輯關卡。

source: The editor is more stable because the game runs in a separate process.
cs: Editor je stabilnější, protože hra běží v samostatném procesu.
de: Der Editor ist stabiler da das Spiel als separater Prozess ausgeführt wird.
es: El editor es más estable porque el juego se ejecuta en un proceso separado.
fr: L'éditeur est plus stable car le jeu s'exécute dans un processus distinct.
ja: ゲームは別のプロセスで実行されるため、エディタはより安定しています。
ko: 게임이 별도의 프로세스에서 실행되기 때문에 에디터는 더 안정적입니다.
pt_br: O editor é mais estável porque o jogo é executado em um processo separado.
ru: Редактор более стабилен, потому что игра запущена в отдельном процессе.
uk: Редактор більш стабільний, оскільки гра працює в окремому процесі.
zh_cn: 编辑器更稳定, 因为游戏在单独的进程中运行.
zh_tw: 更穩定的編輯器，因遊戲執行於獨立的處理程序。

source: Finally, the top toolbar includes a menu for remote debugging. These options make it simple to deploy to a device (connected phone, tablet, or browser via HTML5), and debug/live edit on it after the game was exported.
es: Finalmente, la barra de herramientas superior incluye un menú para depuración remota. Estas opciones facilitan la implementación en un dispositivo (teléfono, tableta o navegador conectado a través de HTML5) y la depuración/edición en vivo en él después de exportar el juego.
ko: 마지막으로, 상단 툴바는 원격 디버깅을 위한 메뉴가 있습니다. 이 설정은 기기에 배포하기 쉽도록 만듭니다 (핸드폰, 태블릿, 혹은 HTML5를 통한 브라우저를 연결), 그리고 게임을 내보낸 후 디버그/실시간 편집을 거기서 하도록 만듭니다.
pt_br: Finalmente, a barra de ferramentas superior inclui um menu para depuração remota. Essas opções simplificam a implantação em um dispositivo (telefone conectado, tablet ou navegador via HTML5) e a edição de depuração / edição ao vivo após a exportação do jogo.
ru: Наконец, верхняя панель инструментов содержит меню для удаленной отладки. Эти опции упрощают развертывание на устройстве (подключенном телефоне, планшете или браузере через HTML5), а также отладку/редактирование в реальном времени после экспорта игры.

source: The scene system
cs: Systém scén
de: Das Szenensystem
es: El sistema de escenas
fr: Le système de scène
ja: シーンシステム
ko: 씬 시스템
pt_br: O sistema de cena
ru: Система сцен
uk: Система сцен
zh_cn: 场景系统
zh_tw: 場景系統

source: This is the most important difference between Unity and Godot and, actually, the favourite feature of most Godot users.
es: Esta es la diferencia más importante entre Unity y Godot y, de hecho, la característica favorita de la mayoría de los usuarios de Godot.
ko: 유니티와 Godot와의 가장 중요한 차이점이자, Godot 사용자들이 가장 좋아하는 기능입니다.
pt_br: Esta é a diferença mais importante entre a Unity e a Godot, na verdade, a característica favorita da maioria dos usuários da Godot.
ru: Это самое важное различие между Unity и Godot и, на пожалуй самая любимая особенность для большинства пользователей Godot.

source: Unity's scene system consists of embedding all the required assets in a scene and linking them together by setting components and scripts to them.
es: El sistema de escenas de Unity consiste en integrar todos los recursos necesarios en una escena y enlazarlos entre sí mediante la configuración de componentes y scripts.
ko: 유니티의 씬 시스템은 필요한 씬에 모든 에셋을 포함하고 구성 요소와 스크립트를 설정함으로써 그들을 연결하도록 구성되어 있습니다.
pt_br: O sistema de cena da Unity consiste em incorporar todos os recursos necessários em uma cena e vinculá-los, definindo componentes e scripts para eles.
ru: Система сцен Unity состоит из встраивания всех необходимых ресурсов в сцену и связывания их вместе путем установки компонентов и скриптов.

source: Godot's scene system is different: it actually consists of a tree made of nodes. Each node serves a purpose: Sprite, Mesh, Light, etc. Basically, this is similar to the Unity scene system. However, each node can have multiple children, which makes each a subscene of the main scene. This means you can compose a whole scene with different scenes stored in different files.
es: El sistema de escenas de Godot es diferente: en realidad consiste en un árbol hecho de nodos. Cada nodo tiene un propósito: Sprite, Mesh, Light, etc... Básicamente, esto es similar al sistema de escena Unity. Sin embargo, cada nodo puede tener varios hijos, lo que hace de cada uno una subescena de la escena principal. Esto significa que se puede componer una escena completa con escenas diferentes, almacenadas en diferentes archivos.
ko: Godot의 씬 시스템은 다릅니다: 사실 노드로 이루어진 트리를 구성하고 있습니다. 각 노드는 용도를 지니고 있습니다: 스프라이트, 메시, 빛 등. 기본적으로 유니티의 씬 시스템과 유사합니다. 하지만, 각 노드는 여러 개의 자식을 가질 수 있습니다, 그리고 그 자식들을 각기 다른 하위 씬으로 만들 수 있습니다. 즉, 서로 다른 파일에 저장된 여러 씬으로 전체 씬을 작업할 수 있습니다.
ru: Система сцен Godot отличается тем, что на самом деле состоит из древа сцен, состоящего из узлов. Каждый узел имеет свое назначение: Спрайт, Сетка, Свет и т.д. По сути, это похоже на сценическую систему Unity. Однако каждый узел может иметь несколько дочерних узлов, что делает каждый из них наследником главной сцены. Это означает, что вы можете составить целую сцену с разными сценами, сохраненными в разных файлах.

source: For example, think of a platformer level. You would compose it with multiple elements:
cs: Představte si například úroveň plošinovky. Sestavíte ji z několika prvků:
de: Stellen Sie sich zum Beispiel ein Plattformer-Level vor. Sie würden es mithilfe diverser Elemente zusammenstellen:
es: Por ejemplo, piensa en un nivel de un juego de plataformas. Verías que está compuesto de múltiples elementos:
fr: Par exemple, pensez à un niveau de plateforme. Vous le composeriez avec plusieurs éléments :
ja: たとえば、プラットフォーマーレベルを考えてみましょう。複数の要素で構成します:
ko: 예를 들어, 플랫포머 레벨을 생각해보자. 당신은 여러 요소들을 가지고 작업할 것입니다:
pt_br: Por exemplo, pense em um nível de plataforma. Você poderia compor com vários elementos:
ru: Например, подумайте об уровне в каком-нибудь платформере. Вы бы составили его такими элементами:
uk: Наприклад, подумайте про рівень платформера. Ви можете скласти його з декількох елементів:
zh_cn: 例如, 一个平台游戏的关卡. 你可以用多个元素来组合它:
zh_tw: 以平台遊戲的關卡為例，可以用多個元素來組成：

source: Bricks
cs: Cihly
de: Bauklötze
es: Bloques
fr: Les briques
ja: レンガ
ko: 벽돌
pt_br: Tijolos
ru: Кирпичи
uk: Цегла
zh_cn: 砖块
zh_tw: 磚塊

source: Coins
cs: Mince
de: Münzen
es: Mondedas
fr: Les pièces
ja: コイン
ko: 동전
pt_br: Moedas
ru: Монеты
uk: Монети
zh_cn: 金币
zh_tw: 金幣

source: The player
cs: Hráč
de: Der Spieler
es: El jugador
fr: Le joueur
ja: プレイヤー
ko: 플레이어
pt_br: O jogador
ru: Игрок
uk: Гравець
zh_cn: 游戏角色
zh_tw: 玩家

source: The enemies
cs: Nepřátelé
de: Die Gegner
es: Los enemigos
fr: Les ennemis
ja: 敵
ko: 적
pt_br: Os inimigos
ru: Враги
uk: Вороги
zh_cn: 敌人
zh_tw: 敵人

source: In Unity, you would put all the GameObjects in the scene: the player, multiple instances of enemies, bricks everywhere to form the ground of the level and then multiple instances of coins all over the level. You would then add various components to each element to link them and add logic in the level: For example, you'd add a BoxCollider2D to all the elements of the scene so that they can collide. This principle is different in Godot.
cs: V Unity byste do scény umístili všechny herní objekty: hráče, několik instancí nepřátel, všude cihly, které tvoří základ úrovně, a pak několik instancí mincí po celé úrovni. Ke každému prvku byste pak přidali různé komponenty, abyste je propojili a přidali logiku do úrovně: Například byste ke všem prvkům scény přidali BoxCollider2D, aby se mohly srážet. V Godotu je tento princip odlišný.
de: In Unity würden Sie alle SpielObjekte in eine Szene packen: Den Spieler, mehrere Instanzen der Feinde, Bauklötze überfall um den Boden zu definieren, und schlussendlich mehrere Instanzen der Münzen, verteilt auf das gesamte Level. Danach würde man diverse Komponenten zu jedem Element verlinken und Logik in das Level einbauen: Zum Beispiel könnten Sie eine 'BoxCollider2D' zu allen Elementen der Szene hinzufügen, damit diese miteinander kollidieren könnten. Dieses Prinzip ist so in dieser Form nicht in Godot vertreten.
es: En Unity, pondrías todos los GameObjects en la escena: el jugador, múltiples instancias de enemigos, bloques por todas partes para formar la base del nivel, y múltiples instancias de monedas por todo el nivel. A continuación, se añadirían varios componentes a cada elemento para enlazarlos y añadir lógica en el nivel: por ejemplo, se añadiría un BoxCollider2D a todos los elementos de la escena para que puedan colisionar. Este principio es diferente en Godot.
fr: Dans Unity, vous placeriez tous les GameObjects dans la scène : le joueur, plusieurs instances d'ennemis, des briques partout pour former le sol, puis plusieurs instances de pièces sur tout le niveau. Vous ajouteriez alors différents composants à chaque élément pour les lier et ajouter de la logique au niveau : Par exemple, vous ajouteriez un BoxCollider2D à tous les éléments de la scène pour qu'ils puissent entrer en collision. Ce principe est différent dans Godot.
ja: Unityでは、すべてのGameObjectをシーンに配置します:プレイヤー、敵の複数のインスタンス、レンガを至る所に配置してレベルの地面を形成し、次にレベル全体にコインの複数のインスタンスを配置します。次に、さまざまなコンポーネントを各要素に追加してそれらをリンクし、レベルにロジックを追加します。たとえば、BoxCollider2Dをシーンのすべての要素に追加して、それらが衝突できるようにします。この原則はGodotでは異なります。
ko: 유니티에서, 모든 GameObjects를 씬에 넣을 것입니다: 플레이어, 여러 인스턴스 된 적, 레벨을 만드는 벽돌, 그리고 모든 레벨에 있는 여러 인스턴스 된 동전입니다. 그런 다음 각 요소들을 연결하고 레벨의 타당성을 주기 위한 다양한 구성 요소를 추가할 것입니다: 예를 들어 모든 요소에 BoxCollider2D를 추가해서 씬의 모든 요소가 충돌할 수 있도록 합니다. 이 원리가 Godot에서는 다릅니다.
pt_br: Na Unity, você colocaria todos os GameObjects na cena: o jogador, várias instâncias de inimigos, tijolos em todos os lugares para formar o chão do nível e, em seguida, várias instâncias de moedas em todo o nível. Você adicionaria vários componentes a cada elemento para vinculá-los e adicionar lógica ao nível: por exemplo, você adicionaria um BoxCollider2D a todos os elementos da cena para que eles pudessem colidir. Este princípio é diferente na Godot.
ru: В Unity вы бы поставили на сцену все GameObjects (Игровые Объекты): игрока, несколько экземпляров врагов, кирпичи повсюду, чтобы сформировать основу уровня, а затем несколько экземпляров монет по всему уровню. Затем вы добавляете различные компоненты к каждому элементу, чтобы связать их и логику на уровне: Например, вы бы добавили BoxCollider2D ко всем элементам сцены, для столкновений. Этот принцип отличается в Godot.
uk: В Unity ви б поставили на сцену всі GameObjects: гравця, кілька екземплярів ворогів, цеглу для ґрунту рівня, кілька екземплярів монет по всьому рівню. Потім ви додасте різні компоненти до кожного елемента, щоб зв'язати їх і додати логіку на рівні: Наприклад, ви додали BoxCollider2D до всіх елементів сцени, щоб вони могли зіткнутися. Цей принцип інакший у Godot.
zh_cn: 在Unity中, 您将所有游戏对象(GameObjects)放置在场景中: 游戏角色, 敌人的多个实例, 到处都是用砖块构成关卡的地面, 然后在关卡中放置的硬币的多个实例. 然后, 您将向每个元素添加各种组件以链接它们并在关卡中添加逻辑: 例如, 您将 ``BoxCollider2D`` 添加到场景的所有元素, 以便它们可以碰撞. 这一理念在Godot中不同.
zh_tw: 在 Unity 中我們會在場景中放置所有的 GameObjects：放置玩家、多個敵人的實體，到處放置磚塊來組成關卡的地面，在關卡各處放置多個金幣的實體。接著將不同的元件關聯到各個元素上並為關卡加入邏輯，舉例來說，為場景中所有的元素都加上 BoxCollider2D 來製作碰撞。在 Godot 中則會用不同的概念。

source: In Godot, you would split your whole scene into 3 separate, smaller scenes, which you would then instance in the main scene.
es: En Godot, dividirías toda tu escena en 3 escenas separadas, más pequeñas, que luego colocarías en la escena principal.
ko: Godot에서, 전체 씬을 3개의, 더 작은 씬으로 나누고, 그들을 메인 씬에 인스턴스 합니다.
pt_br: Na Godot, você dividiria toda a sua cena em três cenas menores e menores, que você veria na cena principal.
ru: В Godot вы бы разделили всю сцену на 3 отдельные, небольшие сцены, которые затем были бы приведены в качестве экземпляра в основной сцене.

source: **First, a scene for the Player alone.**
es: **Primero, una escena para el jugador únicamente.**
ko: **먼저, 플레이어만 있는 씬입니다.**
pt_br: **Primeiro, uma cena para o Jogador sozinho.**
ru: **Сначала сцена для Игрока.**

source: Consider the player as a reusable element in other levels. It is composed of one node in particular: an AnimatedSprite node, which contains the sprite textures to form various animations (for example, walking animation)
es: Considera que el jugador es un elemento reutilizable en otros niveles. Está compuesto de un nodo en particular: un nodo AnimatedSprite, el cual contiene las texturas o imágenes que forman las varias animaciones (por ejemplo, la animación de andar)
ko: 플레이어를 다른 레벨에도 재 사용 가능한 요소라고 생각해보세요. 특히 하나의 노드로 구성됩니다: 다양한 애니메이션을 구성하기 위한 스프라이트 텍스쳐를 가진 AnimatedSprite 노드 (예를 들면, 걷는 애니메이션)
pt_br: Considere o jogador como um elemento reutilizável em outros níveis. É composto de um nó em particular: um nó AnimatedSprite, que contém as texturas do sprite para formar várias animações (por exemplo, animação andando)
ru: Рассматривайте игрока как многоразовый элемент на других уровнях. Он состоит, в частности, из одного узла: узла AnimatedSprite, который содержит текстуры спрайта для формирования различных анимаций (например, анимация ходьбы)

source: **Second, a scene for the Enemy.**
es: **Segundo, una escena para el Enemigo.**
ko: **두 번째, 적을 위한 씬입니다.**
pt_br: **Segundo, uma cena para o Inimigo.**
ru: *Вторая сцена для Врага.*

source: There again, an enemy is a reusable element in other levels. It is almost the same as the Player node - the only differences are the script (that manages AI, mostly) and sprite textures used by the AnimatedSprite.
es: Una vez más, un enemigo es un elemento reutilizable en otros niveles. Es casi igual que el nodo Player - las únicas diferencias son el script (que gestiona la IA, principalmente) y las texturas de sprite usadas por el AnimatedSprite.
ko: 역시, 적은 다른 레벨에서 재 사용 가능합니다. Player 노드와 거의 똑같습니다 - 유일한 차이는 스크립트 입니다 (주로 AI를 다룹니다) 그리고 AnimatedSprite가 사용되는 스프라이트 텍스쳐입니다.
pt_br: Novamente, um inimigo é um elemento reutilizável em outros níveis. É quase o mesmo que o nó do Player - as únicas diferenças são o script (que gerencia AI, principalmente) e as texturas de sprites usadas pelo AnimatedSprite.
ru: Опять же, враг является многоразовым элементом на других уровнях. Это почти то же самое, что и с узлом Player - единственное отличие заключается в скрипте (который, в основном, управляет ИИ) и текстурах, используемых AnimatedSprite.

source: **Lastly, the Level scene.**
es: **Por último, la escena del nivel.**
ko: **마지막으로, 레벨 씬입니다.**
pt_br: **Por último, a cena do Nível.**
ru: **Последняя это сцена самого уровня.**

source: It is composed of Bricks (for platforms), Coins (for the player to grab) and a certain number of instances of the previous Enemy scene. These will be different, separate enemies, whose behaviour and appearance will be the same as defined in the Enemy scene. Each instance is then considered as a node in the Level scene tree. Of course, you can set different properties for each Enemy node (to change its color, for example).
es: Se compone de Bricks (bloques, para plataformas), Coins (monedas, para que el jugador las tome) y un cierto número de instancias de la escena Enemy (enemigo) anterior. Serán enemigos diferentes, separados, cuyo comportamiento y apariencia serán los mismos que los definidos en la escena Enemiga. Cada instancia se considera entonces como un nodo en el árbol de escenas de nivel. Por supuesto, puedes establecer diferentes propiedades para cada nodo Enemy (por ejemplo, para cambiar su color).
ko: 이것은 (플랫폼을 위한)블럭, (플레이어가 집을)동전 그리고 이전의 Enemy 씬의 일정한 수의 인스턴스로 구성되어 있습니다. 이들은 다른, 분리된 적으로, 행동과 양상은 같은 Enemy 씬에서 정의된 것과 같을 것입니다. 각 인스턴스는 이제 레벨 씬 트리의 노드로 취급됩니다. 물론, 각 Enemy 노드 마다 다른 속성을 설정할 수 있습니다 (예를 들어, 색상을 바꾸는 것).
pt_br: Ele é composto de Bricks (para plataformas), Coins (para o jogador pegar) e um certo número de instâncias da cena anterior do Inimigo. Estes serão inimigos distintos, separados, cujo comportamento e aparência serão os mesmos definidos na cena Inimigo. Cada instância é então considerada como um nó na árvore de cena de Level. Naturalmente, você pode definir propriedades diferentes para cada nó do Inimigo (para alterar sua cor, por exemplo).
ru: Она состоит из кирпичей (для платформ), монет (которые должен ловить игрок) и определенного количества экземпляров сцены врага. Это будут разные, отдельные враги, чье поведение и внешний вид будут такими же, как определено на сцене врага. Каждый экземпляр затем рассматривается как узел в дереве сцены уровня. Конечно, вы можете установить различные свойства для каждого узла с Врагом (например, изменить его цвет).

source: Finally, the main scene would then be composed of one root node with 2 children: a Player instance node, and a Level instance node. The root node can be anything, generally a "root" type such as "Node" which is the most global type, or "Node2D" (root type of all 2D-related nodes), "Spatial" (root type of all 3D-related nodes) or "Control" (root type of all GUI-related nodes).
es: Por último, la escena principal estaría compuesta por un nodo raíz con 2 hijos: un nodo de instancia del Player y un nodo de instancia del Level. El nodo raíz puede ser cualquier cosa, generalmente un tipo "raíz" como "Node" que es el tipo más global, o "Node2D" (tipo raíz de todos los nodos relacionados con 2D), "Spatial" (tipo raíz de todos los nodos relacionados con 3D) o "Control" (tipo raíz de todos los nodos relacionados con GUI).
ko: 마지막으로, 메인 씬은 이제 한 루트 노드와 2개의 자식으로 구성될 것입니다: Player 인스턴스 노드, 그리고 레벨 인스턴스 노드입니다. 루트 노드는 어떤 것도 될 수 있지만, 일반적으로 "루트" 타입은 가장 전역 타입인 "Node"나, (모든 2D 관련 노드의 루트 타입인) "Node2D", (모든 3D 관련 노드의 루트 타입인) "Spatial", (모든 GUI 관련 노드의 루트 타입인) "Control"이 됩니다.
pt_br: Finalmente, a cena principal seria composta de um nó raiz com 2 filhos: um nó de instância do Player e um nó de instância do Nível. O nó raiz pode ser qualquer coisa, geralmente um tipo "raiz" como "Nó", que é o tipo mais global, ou "Node2D" (tipo raiz de todos os nós relacionados a 2D), "Espacial" (tipo raiz de todos os 3D- nós relacionados) ou "Control" (tipo de raiz de todos os nós relacionados à GUI).
ru: Наконец, основная сцена будет состоять из одного корневого узла с 2 дочерними: экземпляр узла Игрок и узла Уровень. Корневым узлом может быть что угодно, обычно "корневой" тип, например, "самый глобальный тип узла" или "Node2D" (корневой тип всех 2D-узлов), "Spatial" (корневой тип всех 3D-узлов) или "Control" (корневой тип всех GUI-узлов).
