Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/using_the_web_editor.po
Languages: cs, es, ja, pt_br

source: Using the Web editor
cs: Použití webového editoru
es: Usando el editor web
ja: Webエディタの実行
pt_br: Utilizando o editor Web

source: Since Godot 3.3, there is a `Web editor <https://editor.godotengine.org/>`__ you can use to work on new or existing projects.
cs: Od verze Godot 3.3 je k dispozici `Webový editor <https://editor.godotengine.org/>`__, který můžete použít pro práci na nových nebo stávajících projektech.
es: Desde Godot 3.3, hay un `Editor web <https://editor.godotengine.org/>`__ que puedes usar para trabajar en proyectos nuevos o existentes.
ja: Godot 3.3以降では\ `Webエディタ <https://editor.godotengine.org/>`__\ があり、新しいプロジェクトや既存のプロジェクトで使えます。
pt_br: Desde o Godot 3.3, existe um `Web editor <https://editor.godotengine.org/>`__ que você pode utilizar para trabalhar em projetos novos ou já existentes.

source: The web editor is in a preliminary stage. While its feature set may be sufficient for educational purposes, it is currently **not recommended for production work**. See :ref:`doc_using_the_web_editor_limitations` below.
cs: Webový editor je v přípravné fázi. Ačkoli jeho sada funkcí může být dostatečná pro vzdělávací účely, v současné době se **nedoporučuje pro produkční práci**. Viz :ref:`doc_using_the_web_editor_limitations` níže.
ja: このウェブ・エディターは、まだ初期段階のものです。その機能一式は学習目的には十分かもしれませんが、現在のところ、\ **制作にはお勧めできません**\ 。以下の\ :ref:`doc_using_the_web_editor_limitations`\ を参照してください。
pt_br: O editor web está em uma fase preliminar. Embora seu conjunto de recursos possa ser suficiente para fins educacionais, atualmente **não é recomendado para trabalho de produção**. Veja :ref:`doc_using_the_web_editor_limitations` abaixo.

source: Browser support
cs: Podpora prohlížeče
es: Soporte del navegador
ja: ブラウザの対応
pt_br: Suporte de navegador

source: The Web editor requires support for WebAssembly's SharedArrayBuffer. This is in turn required to support threading in the browser. The following desktop browsers support WebAssembly threading and can therefore run the web editor:
cs: Webový editor vyžaduje podporu funkce WebAssembly SharedArrayBuffer. Ten je zase nutný pro podporu vláken v prohlížeči. Následující desktopové prohlížeče podporují vláknové zpracování WebAssembly, a proto mohou spustit webový editor:
es: El editor web requiere soporte para SharedArrayBuffer de WebAssembly. Esto, a su vez, es necesario para admitir subprocesos en el navegador. Los siguientes navegadores de escritorio admiten subprocesos de WebAssembly y, por lo tanto, pueden ejecutar el editor web:
ja: Webエディタでは、WebAssemblyのSharedArrayBufferのサポートが必要です。これは、ブラウザでスレッドをサポートするために必要になります。以下のデスクトップブラウザはWebAssemblyのスレッディングをサポートしているので、Webエディタを実行することができます。
pt_br: O editor Web requer suporte para o SharedArrayBuffer do WebAssembly. Isto, por sua vez, é necessário para suportar threading no navegador. Os seguintes navegadores de desktop suportam o threading do WebAssembly e podem, portanto, executar o editor Web:

source: Chrome 68 or later
cs: Chrome 68 nebo novější
es: Chrome 68 o versión posterior
ja: Chrome 68以降
pt_br: Chrome 68 ou posterior

source: Firefox 79 or later
cs: Firefox 79 nebo novější
es: Firefox 79 o posterior
ja: Firefox 79以降
pt_br: Firefox 79 ou posterior

source: Edge 79 or later
cs: Edge 79 nebo novější
es: Edge 79 o posterior
ja: Edge 79以降
pt_br: Edge 79 ou posterior

source: Opera and Safari are not supported yet. Safari may work in the future once proper threading support is added.
cs: Opera a Safari zatím nejsou podporovány. Safari bude možná fungovat v budoucnu, jakmile bude přidána správná podpora vláken.
es: Opera y Safari todavía no son compatibles. Puede que Safari será compatible en el futuro cuando admita ejecución en multiples hilos.
ja: OperaとSafariはまだサポートされていません。将来的に、Safariにも適切なスレッドサポートが追加されれば、動作するかもしれません。
pt_br: Opera e Safari ainda não são suportados. O Safari pode funcionar no futuro assim que o suporte adequado para threading for adicionado.

source: **Mobile browsers are currently not supported.**
cs: **Mobilní prohlížeče nejsou v současné době podporovány.**
es: **Los navigadores de móvil no son compatibles.**
ja: **モバイルブラウザは、現在はまだサポートされていません。**
pt_br: **Navegadores móveis não são compatíveis no momento.**

source: The web editor supports both the GLES3 and GLES2 renderers, although GLES2 is recommended for better performance and compatibility with old/low-end hardware.
cs: Webový editor podporuje vykreslovače GLES3 i GLES2, ačkoli GLES2 je doporučován kvůli lepšímu výkonu a kompatibilitě se starým nebo méně výkonným hardwarem.
es: El editor web es compatible con los presentadores GLES3 y GLES2, sin embargo GLES2 es recomendado for para mejor rendimiento y compatabilidad con hardware viejo o de baja calidad.
ja: ウェブエディタは、GLES3とGLES2の両方のレンダラーをサポートしていますが、より良いパフォーマンスと、古い/ローエンドのハードウェアとの互換性のために、GLES2を推奨します。
pt_br: O editor web suporta ambos os renderizadores GLES3 e GLES2, embora o GLES2 seja recomendado para melhor desempenho e compatibilidade com hardware antigo/fraco.

source: If you use Linux, due to `poor Firefox WebGL performance <https://bugzilla.mozilla.org/show_bug.cgi?id=1010527>`__, it's recommended to use a Chromium-based browser instead of Firefox.
cs: Pokud používáte systém Linux, doporučujeme vzhledem ke `špatnému výkonu WebGL ve Firefoxu <https://bugzilla.mozilla.org/show_bug.cgi?id=1010527>`__ používat místo Firefoxu prohlížeč založený na Chromiu.
es: Si usas Linuz, se recomienda usar un navegador basado en Chromium, a causa de `rendimiento pobre de Firefox WebGL <https://bugzilla.mozilla.org/show_bug.cgi?id=1010527>`__.
ja: Linuxをお使いの場合は、\ `FirefoxのWebGLのパフォーマンスが低い <https://bugzilla.mozilla.org/show_bug.cgi?id=1010527>`__\ ため、FirefoxではなくChromiumベースのブラウザを使用することをお勧めします。
pt_br: Se você utiliza Linux, devido ao `fraco desempenho do Firefox WebGL <https://bugzilla.mozilla.org/show_bug.cgi?id=1010527>`__, é recomendado usar um navegador baseado em Chromium em vez do Firefox.

source: Limitations
cs: Omezení
es: Limitaciones
ja: 制限事項
pt_br: Limitações

source: Due to limitations on the Godot or Web platform side, the following features are currently missing:
cs: Z důvodu omezení na straně Godotu nebo webové platformy v současné době chybí následující funkce:
es: Debido a las limitaciones en el lado de la plataforma Godot o Web, actualmente faltan las siguientes características:
ja: 現在、GodotやWebプラットフォーム側の制約により、以下の機能がありません。
pt_br: Devido a limitações no lado do Godot ou da plataforma Web, os seguintes recursos estão faltando no momento:

source: No C#/Mono support.
cs: Žádná podpora C#/Mono.
es: No hay soporte para C#/Mono.
ja: C#/Mono に対応していません。
pt_br: Sem suporte a C#/Mono.

source: No GDNative support.
cs: Žádná podpora GDNative.
es: No compatible con GDNative.
ja: GDNative に対応していません。
pt_br: Sem suporte a GDNative.

source: No project exporting. As a workaround, you can download the project source using **Project > Tools > Download Project Source** and export it using a `native version of the Godot editor <https://godotengine.org/download>`__.
cs: Žádný export projektu. Jako řešení můžete stáhnout zdrojový kód projektu pomocí **Project > Tools > Download Project Source** a exportovat jej pomocí `nativní verze editoru Godot <https://godotengine.org/download>`__.
es: No puede exportar proyectos. Como método alternativo, puedes descargar el fuente del proyecto con **Proyecto > Herramientas > Descargar Fuente de Proyecto** y exportarlo usando `una versión nativa del editor Godot <https://godotengine.org/download>`__.
ja: プロジェクトのエクスポートができません。回避策としては、 **プロジェクト > ツール > プロジェクトソースをダウンロード** でプロジェクトのソースをダウンロードしてから、\ `ネイティブ版Godotエディタ <https://godotengine.org/download>`__\ を使ってエクスポートすることができます。
pt_br: Sem exportação de projetos. Como alternativa, você pode baixar a fonte do projeto utilizando **Projeto > Ferramentas > Baixar Fonte do Projeto** e exportá-lo utilizando uma `versão nativa do editor do Godot <https://godotengine.org/download>`__.

source: The editor won't warn you when closing the tab with unsaved changes.
cs: Editor vás nebude varovat při zavírání karty s neuloženými změnami.
es: El editor no te avisa cuando cierres una pestaña con modificaciones no guardadas.
ja: 保存されていない変更がある状態でタブを閉じるときでも、エディタは警告を出しません。
pt_br: O editor não vai avisá-lo ao fechar a aba com alterações não salvas.

source: No lightmap baking support. You can still use existing lightmaps if they were baked with a native version of the Godot editor (e.g. by importing an existing project).
cs: Žádná podpora zapékání světelných map. Stávající lightmapy můžete používat, pokud byly vytvořeny v nativní verzi editoru Godot (např. importem existujícího projektu).
es: No permite creación de 'lightmaps'. Aún puedes usar lightmaps existentes si fueron creados por una versión nativa, (o sea, puedes importar un proyecto existente).
ja: ライトマップのベイクをサポートしていません。既存のライトマップは、Godotエディタのネイティブバージョンでベイクされたものであれば、使用することができます (既存のプロジェクトをインポートした場合など)。
pt_br: Sem suporte para gerar e gravar lightmap. Você ainda pode usar lightmaps se eles foram gerados e gravados com uma versão nativa do editor do Godot (por exemplo, importando um projeto existente).

source: The following features are unlikely to be supported due to inherent limitations of the Web platform:
cs: Následující funkce pravděpodobně nebudou podporovány z důvodu přirozených omezení samotné webové platformy:
es: No es probable que se permitan las herramientas siguentes por las limitaciones inherentes del plataforma Web:
ja: 以下の機能は、Webプラットフォームの固有の制限により、サポートされる可能性は低いでしょう。
pt_br: Os seguintes recursos são improváveis de serem suportados devido a limitações inerentes da plataforma Web:

source: No support for external script editors.
cs: Žádná podpora externích editorů skriptů.
ja: 外部のスクリプトエディタには対応していません。
pt_br: Sem suporte para editores de script externos.

source: No support for Android one-click deploy.
cs: Žádná podpora nasazení jedním kliknutím systému Android.
es: Pasos para el despliegue con un solo clic.
ja: Androidでは、ワンクリック・デプロイはサポートされていません。
pt_br: Sem suporte para implantação de um clique do Android.

source: See the `list of open issues on GitHub related to the web editor <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Aplatform%3Ahtml5+label%3Atopic%3Aeditor>`__ for a list of known bugs.
cs: Seznam známých chyb najdete v `seznamu otevřených problémů na GitHubu týkajících se webového editoru <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Aplatform%3Ahtml5+label%3Atopic%3Aeditor>`__.
es: Revisa la `lista de problemas abiertos sobre el editor web en Github <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Aplatform%3Ahtml5+label%3Atopic%3Aeditor>`__ por la lista de bugs conocidos.
ja: 既知の不具合は、`GithubのWebエディタに関する問題リスト<https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Aplatform%3Ahtml5+label%3Atopic%3Aeditor>`__ を参照してください。
pt_br: Veja a `lista de issues abertos no GitHub relacionados ao editor web <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Aplatform%3Ahtml5+label%3Atopic%3Aeditor>`__ para uma lista de bugs conhecidos.

source: Importing a project
cs: Import projektu
ja: プロジェクトのインポート
pt_br: Importando um projeto

source: To import an existing project, the current process is as follows:
cs: Import stávajícího projektu probíhá následovně:
es: Para importar un proyecto existente:
ja: 既存のプロジェクトのインポート方法：
pt_br: Para importar um projeto existente, o processo atual é o seguinte:

source: Specify a ZIP file to preload on the HTML5 filesystem using the **Preload project ZIP** input.
cs: Zadejte soubor ZIP, který se má předem načíst do souborového systému HTML5, pomocí vstupního pole **Preload project ZIP**.
es: Especifica un archivo ZIP para precargar en el sistema de archivos HTML5 con el input **Precargar ZIP de proyecto**.
ja: **Preload project ZIP**を選択してZIPファイルを指定して、HTML5ファイルシステムにプリロードする。
pt_br: Especifique um arquivo ZIP para pré-carregar no sistema de arquivos do HTML5 usando a entrada **Pré-carregar ZIP do projeto**.

source: Run the editor by clicking **Start Godot editor**. The Godot project manager should appear after 10-20 seconds. On slower machines or connections, loading may take up to a minute.
cs: Editor spustíte kliknutím na tlačítko **Spustit editor Godot**. Správce projektu Godot by se měl objevit po 10-20 sekundách. Na pomalejších počítačích nebo při pomalejším připojení může načítání trvat až minutu.
es: Ejecute el editor haciendo clic en **Start Godot editor**. El gestor de proyectos Godot debería aparecer después de 10-20 segundos. En máquinas o conexiones más lentas, la carga puede tardar hasta un minuto.
ja: **Start Godot editor**をクリックしエディタ開始します。Godotのプロジェクトマネージャーが10~20秒後に表示されます。マシンのスペックや接続が遅いと起動に数分かかることがあります。
pt_br: Execute o editor clicando em **Iniciar editor do Godot**. O gerenciador de projetos do Godot deve aparecer após 10-20 segundos. Em máquinas ou conexões mais lentas, o carregamento pode levar até um minuto.

source: In the dialog that appears at the middle of the window, specify a name for the folder to create then click the **Create Folder** button (it doesn't have to match the ZIP archive's name).
cs: V dialogu, který se zobrazí uprostřed okna, zadejte název vytvářené složky a klikněte na tlačítko **Vytvořit složku** (nemusí se shodovat s názvem archivu ZIP).
es: En el cuadro de diálogo que aparece en el medio de la ventana, especifique un nombre para la carpeta a crear y luego haga clic en el botón ** Crear carpeta ** (no tiene que coincidir con el nombre del archivo ZIP).
pt_br: Na caixa de diálogo que aparece no meio da janela, especifique um nome para a pasta a ser criada e clique no botão **Criar Pasta** (não precisa corresponder ao nome do arquivo ZIP).

source: Click **Install & Edit** and the project will open in the editor.
cs: Klikněte na tlačítko **Instalace a úpravy** a projekt se otevře v editoru.
es: Haga clic en **Crear y editar ** y el proyecto se abrirá en el editor.
pt_br: Clique em **Instalar e Editar** e o projeto será aberto no editor.

source: It's important to place the project folder somewhere in ``/home/web_user/``. If your project folder is placed outside ``/home/web_user/``, you will lose your project when closing the editor!
cs: Je důležité umístit složku projektu někam do složky ``/home/web_user/``. Pokud je složka projektu umístěna mimo ``/home/web_user/``, při zavření editoru o projekt přijdete!
es: Es importante colocar la carpeta del proyecto en algún lugar de ``/home/web_user/``. ¡Si la carpeta de su proyecto se coloca fuera de ``/home/web_user/``, perderá su proyecto al cerrar el editor!
pt_br: É importante colocar a pasta do projeto em algum lugar em ``/home/usuario_web/``. Se a pasta do seu projeto for colocada fora de ``/home/usuario_web/``, você perderá seu projeto ao fechar o editor!

source: When you follow the steps described above, the project folder will always be located in ``/home/web_user/projects``, keeping it safe.
cs: Pokud budete postupovat podle výše popsaných kroků, bude složka projektu vždy bezpečně umístěna v adresáři ``/home/web_user/projects`` .
es: Cuando siga los pasos descritos anteriormente, la carpeta del proyecto siempre estará ubicada en ``/home/web_user/projects``, manteniéndola segura.
pt_br: Ao seguir os passos descritos acima, a pasta do projeto estará sempre localizada em ``/home/usuario_web/projetos``, mantendo-a segura.

source: Editing and running a project
cs: Úprava a spuštění projektu
es: Editar y ejecutar un proyecto
pt_br: Editando e executando um projeto

source: Unlike the native version of Godot, the web editor is constrained to a single window. Therefore, it cannot open a new window when running the project. Instead, when you run the project by clicking the Run button or pressing :kbd:`F5`, it will appear to "replace" the editor window.
cs: Na rozdíl od nativní verze Godotu je webový editor omezen pouze na jedno okno. Proto se nemůže při spouštění projektu otevřít okno nové . Místo toho se při spuštění projektu klepnutím na tlačítko Spustit nebo stisknutím :kbd:`F5` objeví okno, které "nahradí" okno editoru.
es: A diferencia de la versión nativa de Godot, el editor web está limitado usar una ventana única. Por lo tanto, no puede abrir una ventana nueva para ejectuar el proyecto. Cuando ejecutas el proyecto con el botón Run or la tecla :kbd:`F5`, aparecerá en lugar de la ventana del editor.
pt_br: Ao contrário da versão nativa do Godot, o editor web é restrito a uma única janela. Portanto, não é possível abrir uma nova janela ao executar o projeto. Em vez disso, quando você executar o projeto clicando no botão Executar ou pressionando :kbd:`F5`, ele aparecerá para "substituir" a janela do editor.

source: The web editor offers an alternative way to deal with the editor and game windows (which are now "tabs"). You can switch between the **Editor** and **Game** tabs using the buttons on the top. You can also close the running game or editor by clicking the **×** button next to those tabs.
cs: Webový editor nabízí alternativní způsob práce s okny editoru a hry (které jsou nyní "panely"). Mezi panely **Editor** a **Hra** můžete přepínat pomocí tlačítek v horní části. Spuštěnou hru nebo editor můžete také zavřít klepnutím na tlačítko **×** vedle těchto panelů.
es: El editor web dispone una manera alternativa de gestionar las ventanas del editor y del juego con pestañas. Puedes navegar entre las ventanas **Editor** y **Juego** con los botones superiores. Además puedes cerrar un juego en marcha or el editor con pulsar el botón **x** al lado de las pestañas.
pt_br: O editor web oferece uma forma alternativa de lidar com as janelas do editor e do jogo (que agora são "abas"). Você pode alternar entre as abas **Editor** e **Jogo** usando os botões no topo. Você também pode fechar o jogo em execução ou o editor clicando no botão **×** ao lado dessas abas.

source: Where are my project files?
cs: Kde jsou moje projektové soubory?
pt_br: Onde estão meus arquivos de projeto?

source: Due to browser security limitations, the editor will save the project files to the browser's IndexedDB storage. This storage isn't accessible as a regular folder on your machine, but is abstracted away in a database.
cs: Vzhledem k bezpečnostním omezením prohlížeče uloží editor soubory projektu do úložiště IndexedDB prohlížeče. Toto úložiště není přístupné jako běžná složka v počítači, ale je abstrahováno v databázi.
es: Debido a las limitaciones de seguridad del navegador, el editor guardará los archivos del proyecto en el almacenamiento de la base de datos indexada del navegador. No se puede acceder a este almacenamiento como una carpeta normal en su máquina, pero se extrae en una base de datos.
pt_br: Devido às limitações de segurança do navegador, o editor salvará os arquivos do projeto no armazenamento IndexedDB do navegador. Este armazenamento não é acessível como uma pasta normal em sua máquina, mas é abstraido em um banco de dados.

source: You can download the project files as a ZIP archive by using **Project > Tools > Download Project Source**. This can be used to export the project using a `native Godot editor <https://godotengine.org/download>`__, since exporting from the web editor isn't supported yet.
cs: Soubory projektu si můžete stáhnout jako archiv ZIP pomocí příkazu **Project > Tools > Download Project Source**. To lze použít k exportu projektu pomocí `nativního editoru Godot <https://godotengine.org/download>`__, protože export z webového editoru zatím není podporován.
es: Puede descargar los archivos del proyecto como un archivo ZIP utilizando **Proyecto> Herramientas> Descargar fuente del proyecto**. Esto se puede usar para exportar el proyecto usando un `editor nativo de Godot <https://godotengine.org/download>` __, ya que aún no tiene soporte la exportación desde el editor web.
pt_br: Você pode baixar os arquivos do projeto como um arquivo ZIP usando **Projeto > Ferramentas > Baixar Fonte do Projeto**. Isto pode ser utilizado para exportar o projeto usando um `editor do Godot nativo <https://godotengine.org/download>`__, já que a exportação do editor web ainda não é suportada.

source: In the future, it may be possible to use the `HTML5 FileSystem API <https://developer.mozilla.org/en-US/docs/Web/API/FileSystem>`__ to store the project files on the user's filesystem as the native editor would do. However, this isn't implemented yet.
cs: V budoucnu bude možné použít rozhraní `HTML5 FileSystem API <https://developer.mozilla.org/en-US/docs/Web/API/FileSystem>`__ k ukládání souborů projektu do souborového systému uživatele, stejně jako by to dělal nativní editor. To však zatím není implementováno.
es: En el futuro, puede ser posible utilizar la `HTML5 FileSystem API <https://developer.mozilla.org/en-US/docs/Web/API/FileSystem>` __ para almacenar los archivos del proyecto en el sistema de archivos del usuario como el editor nativo haría. Sin embargo, esto aún no se ha implementado.
pt_br: No futuro, pode ser possível utilizar a `API FileSystem do HTML5 <https://developer.mozilla.org/en-US/docs/Web/API/FileSystem>`__ para armazenar os arquivos do projeto no sistema de arquivos do usuário como o editor nativo faria. No entanto, isto ainda não foi implementado.
