Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/development/editor/editor_style_guide.po
Languages: de, zh_cn

source: Editor style guide
de: Editor Stil-Richtlinien
zh_cn: 编辑器风格指南

source: Introduction
de: Einführung
zh_cn: 简介

source: Thanks for your interest in contributing to the Godot editor!
de: Vielen Dank für Ihr Interesse, einen Beitrag zum Godot-Editor zu leisten!
zh_cn: 感谢您有兴趣为Godot编辑器投稿！

source: This page describes the grammar and writing style used throughout the Godot editor. Following this style guide will help your contribution get merged faster since there will be fewer review steps required.
de: Diese Seite beschreibt die Grammatik und den Schreibstil, die im gesamten Godot-Editor verwendet werden. Wenn Sie diese Stil-Richtlinien befolgen, wird Ihr Beitrag schneller zusammengeführt, da weniger Überprüfungsschritte erforderlich sind.
zh_cn: 本页介绍了Godot编辑器中使用的语法和写作风格.遵循这一风格指南将有助于您的贡献更快地被合并,因为所需的审核步骤更少.

source: Writing style
de: Schreibstil
zh_cn: 写作风格

source: **Write messages (errors, warnings, ...) as full sentences.** They should start with an uppercase letter and end with a period.
de: **Schreiben Sie Meldungen (Fehler, Warnungen, ...) in ganzen Sätzen.** Sie sollten mit einem Großbuchstaben beginnen und mit einem Punkt enden.
zh_cn: **将信息(错误、警告......)写成完整的句子** ,应以大写字母开头,以句号结束.

source: **Try to keep sentences short.** This makes it more likely that their translations will be short as well, which is a good thing to avoid UI bugs.
de: **Versuchen Sie, die Sätze kurz zu halten.** Das macht es wahrscheinlicher, dass ihre Übersetzungen ebenfalls kurz sind, was eine gute Sache ist, um UI-Bugs zu vermeiden.
zh_cn: **尽量保持句子简短.** 这使得他们的翻译也可能很短,这对于避免UI错误有好处.

source: **Use contractions.** For example, use "isn't" instead of "is not". An exception to this rule can be made when you specifically want to emphasize one of the contraction's words.
de: **Verwenden Sie Kontraktionen.** Verwenden Sie z. B. "isn't" statt "is not". Eine Ausnahme von dieser Regel kann gemacht werden, wenn Sie eines der Wörter der Kontraktion besonders betonen wollen.
zh_cn: **使用缩略语.** 例如,用 "isn't"代替 "is not".当你特别想强调缩略词之一,则例外.

source: Try to follow the :ref:`doc_docs_writing_guidelines` in addition to the guidelines outlined above.
de: Versuchen Sie, zusätzlich zu den oben genannten Richtlinien die :ref:`doc_docs_writing_guidelines` zu befolgen.
zh_cn: 除了上述准则外,尽量遵循 :ref:`doc_docs_writing_guidelines` .

source: Button and menu texts
de: Schaltflächen und Menü Texte
zh_cn: 按钮和菜单文本

source: Capitalize text in buttons and menu actions:
de: Großschreibung von Texten in Schaltflächen und Menüs:
zh_cn: 将按钮和菜单操作中的文本大写:

source: **Good:** *Open Editor Data Folder*
de: **gut:** *Editor Datenverzeichnis öffnen*
zh_cn: **Good:** *打开编辑器数据文件夹*

source: **Bad:** *Open editor data folder*
de: **schlecht:** *Editor Datenverzeichnis öffnen*
zh_cn: **Bad:** *打开编辑器数据文件夹*

source: If a menu action opens a modal dialog, suffix it with an ellipsis (``...``).
de: Wenn eine Menüaktion einen modalen Dialog öffnet, fügen Sie ihm ein Auslassungszeichen (``...``) hinzu.
zh_cn: 如果菜单操作打开了模式对话框,用省略号( ``...`` )作为后缀.

source: **Good:** *Editor Settings...*
de: **Gut:** *Editoreigenschaften...*
zh_cn: **Good:** *编辑器设置...*

source: **Bad:** *Editor Settings*
de: **schlecht:** *Editoreigenschaften*
zh_cn: **Bad:** *编辑器设置*

source: Inspector sections
de: Inspector Sektion
zh_cn: 检查器插件

source: In general, don't create sections that contain less than 3 items. Sections that contain few items make it difficult to navigate the inspector, while missing the benefits of using sections such as folding.
de: Generell sollten Sie keine Abschnitte erstellen, die weniger als 3 Elemente enthalten. Abschnitte, die nur wenige Elemente enthalten, erschweren die Navigation im Inspektor und lassen die Vorteile der Verwendung von Abschnitten wie z. B. das Falten vermissen.
zh_cn: 一般来说,不要创建包含少于3个项目的部分.包含项目少的章节会使浏览检查器变得困难,同时丢失了使用章节的好处,如折叠.

source: There are some valid exceptions for this, such as material features in :ref:`class_SpatialMaterial`.
de: Es gibt einige gültige Ausnahmen hierfür, z.B. Materialeigenschaften in :ref:`class_SpatialMaterial`.
zh_cn: 有一些有效的例外情况,例如 :ref:`class_SpatialMaterial` 中的材质特征.

source: This advice also applies to the Project Settings and Editor Settings.
de: Dieser Ratschlag gilt ebenso für die Projekteinstellungen und die Editoreinstellungen.
zh_cn: 这个建议也适用于项目设置和编辑器设置.

source: Inspector performance hints
de: Inspector Leistungs Tipps
zh_cn: 检查器性能提示

source: Enum properties that noticeably impact performance should have a performance hint associated. The hint should refer to the *absolute* performance impact, rather than being relative to the other options provided in the enum. Here are some examples taken from the Godot editor:
de: Enum-Eigenschaften, die sich merklich auf die Leistung auswirken, sollten mit einem Leistungshinweis versehen werden. Der Hinweis sollte sich auf die *absolute* Auswirkung auf die Leistung beziehen und nicht relativ zu den anderen in der Aufzählung angegebenen Optionen sein. Hier sind einige Beispiele aus dem Godot-Editor:
zh_cn: 显著影响性能的枚举属性应该具有相关的提示,该提示应该是指 *绝对* 的性能影响,而不是相对于枚举中提供的其他选项.下面是Godot编辑器中的一些例子:

source: **Screen-space antialiasing:** *Disabled (Fastest), FXAA (Fast)*
de: **Screen-Space-Antialiasing:** *Deaktiviert (am schnellsten), FXAA (schnell)*
zh_cn: **屏幕空间抗锯齿:*禁用(最快),快速近似抗锯齿(快速)*

source: **MSAA quality:** *Disabled (Fastest), 2x (Fast), 4x (Average), 8x (Slow), 16x (Slower)*
de: **MSAA-Qualität:** *Deaktiviert (am schnellsten), 2x (schnell), 4x (durchschnittlich), 8x (langsam), 16x (noch langsamer)*
zh_cn: **MSAA质量:** *禁用(最快)、2倍(快)、4倍(一般)、8倍(慢)、16倍(慢)*

source: **DirectionalLight mode:** *Orthogonal (Fast), PSSM 2 Splits (Average), PSSM 4 Splits (Slow)*
de: **Richtungslichtmodus:** *Orthogonal (schnell), PSSM 2 Splits (durchschnittlich), PSSM 4 Splits (langsam)*
zh_cn: **方向光模式:** *正交(快),PSSM 2分割(平均),PSSM 4分割(慢)*

source: For consistency, try to stick to the terms below (from fastest to slowest):
de: Versuchen Sie aus Gründen der Konsistenz, die folgenden Begriffe einzuhalten (vom schnellsten zum langsamsten):
zh_cn: 为了保持一致,尽量按照下面的术语(从最快到最慢):

source: *Fastest, Faster, Fast, Average, Slow, Slower, Slowest*
de: *schnellster, schneller, schnell, durchschnittlich, langsam, langsamer, langsamste*
zh_cn: *Fastest[最快], Faster[较快], Fast[快], Average[平均], Slow[慢], Slower[较慢], Slowest[慢]*

source: Their usage doesn't have to be contiguous. For example, you can use only "Fast" and "Slow" from the list above.
de: Ihre Verwendung muss nicht zusammenhängend sein. Sie können zum Beispiel nur "Schnell" und "Langsam" aus der obigen Liste verwenden.
zh_cn: 它们的用法不一定要连续.例如,你可以只使用上面列表中的 "快"和 "慢".

source: If you're adding a new enum, its values should be ordered from the fastest option to the slowest option.
de: Wenn Sie eine neue Enumeration hinzufügen, sollten deren Werte von der schnellsten Option zur langsamsten Option geordnet werden.
zh_cn: 如果你要添加一个新的枚举,它的值应该从最快的选项到最慢的选项排序.

source: Tooltips
zh_cn: 工具提示

source: Consider adding tooltips whenever the action performed by a button or menu action isn't obvious. You can also provide additional context or highlight caveats in the tooltip.
de: Ziehen Sie in Erwägung, Tooltips hinzuzufügen, wenn die von einer Schaltfläche oder Menüaktion ausgeführte Aktion nicht offensichtlich ist. Sie können im Tooltip auch zusätzlichen Kontext bereitstellen oder Vorbehalte hervorheben.
zh_cn: 每当按钮或菜单操作所执行的操作不明显时,可以考虑添加工具提示.你也可以在工具提示中提供额外的上下文或强调注意事项.

source: You can do this by calling ``set_tooltip(TTR("Text here."))`` on the Control-based node in question. If the tooltip is particularly long (more than ~80 characters), wrap it over several lines by adding line breaks using ``\n``.
de: Sie können dies tun, indem Sie ``set_tooltip(TTR("Text hier."))`` auf dem betreffenden Control-basierten Node aufrufen. Wenn der Tooltip besonders lang ist (mehr als ~80 Zeichen), umbrechen Sie ihn über mehrere Zeilen, indem Sie Zeilenumbrüche mit ``\n`` hinzufügen.
zh_cn: 你可以通过调用 ``set_tooltip(TTR("Text here."))`` 来实现。如果tooltip特别长(超过80个字符)，可以通过使用 ``\n`` 添加换行符将其包裹在几行上。

source: Tooltips should follow the writing style described above. In addition to this, use indicative mood instead of imperative mood:
de: Tooltips sollten dem oben beschriebenen Schreibstil folgen. Verwenden Sie außerdem die indikative Stimmung anstelle der imperativen Stimmung:
zh_cn: 工具提示应遵循上述的书写风格.除此之外,要使用指示性而不是命令性:

source: **Good:** *Computes global illumination for the selected GIProbe.*
de: **Gut:** *berechnet globale Beleuchtung für die ausgewählte GIProbe.*
zh_cn: **好:** *计算所选的GLProbe全局光照.*

source: **Bad:** *Compute global illumination for the selected GIProbe.*
de: **Bad:** *Berechnet die globale Beleuchtung für die ausgewählte GIProbe.*
zh_cn: **差:** *计算所选的GLProbe全局光照.*
