Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/vr/developing_for_oculus_quest.po
Languages: de, es, zh_cn

source: Developing for Oculus Quest
de: Entwickeln für Oculus Quest
es: Desarrollando para Oculus Quest
zh_cn: 为Oculus Quest开发

source: Introduction
de: Einführung
es: Introducción
zh_cn: 简介

source: This tutorial goes over how to get started developing for the *Oculus Quest* with an official Godot plugin.
de: In dieser Anleitung erfahren Sie, wie Sie mit einem offiziellen Godot-Plugin mit der Entwicklung für *Oculus Quest* beginnen.
es: Este tutorial explica cómo empezar a desarrollar para *Oculus Quest* con un plugin oficial de Godot.
zh_cn: 本教程将介绍如何使用官方Godot插件为 *Oculus Quest* 开发.

source: Before starting, there are two things you need to do:
de: Bevor Sie beginnen, gibt es zwei Dinge, die Sie tun müssen:
es: Antes de empezar, hay dos cosas que debes hacer:
zh_cn: 在开始之前,你有2件事情需要做:

source: First you need to go through the steps on the :ref:`doc_exporting_for_android` page. This leads you through installing the toolset that Godot needs to export to Android devices.
es: Primero tienes que seguir los pasos de la página :ref:`doc_exporting_for_android`. Esto te lleva a la instalación del conjunto de herramientas que Godot necesita para exportar a dispositivos Android.
zh_cn: 首先你需要完成 :ref:`doc_exporting_for_android` 页面上的步骤.这将引导你安装Godot导出到Android设备所需的工具集.

source: Next you need the Quest plugin. You can get it from the Asset Library or manually download it from `here <https://github.com/GodotVR/godot-oculus-mobile-asset>`__.
es: A continuación necesitas el plugin de Quest. Puedes obtenerlo de la Biblioteca de Activos o descargarlo manualmente de `aquí <https://github.com/GodotVR/godot-oculus-mobile-asset>`__.
zh_cn: 接下来你需要Quest插件.你可以从资产库中获得它,或者从 `这里<https://github.com/GodotVR/godot-oculus-mobile-asset>`__ 手动下载.

source: Setting Up Godot
de: Godot einrichten
es: Configurando Godot
zh_cn: 设置Godot

source: To get started open Godot and create a new project.
de: Zum Start öffnen Sie Godot und erstellen Sie ein neues Projekt.
es: Para empezar, abre a Godot y crea un nuevo proyecto.
zh_cn: 要开始,请打开Godot并创建一个新的项目.

source: Make sure to choose the ``GLES2`` renderer. Due to the Quest's GPU this backend is far better suited for the Quest.
es: Asegúrate de elegir el renderizador de ``GLES2``. Debido a la GPU de la Quest, este backend es mucho más adecuado para la Quest.
zh_cn: 确保选择 ``GLES2`` 渲染器,由于Quest的GPU,这个后端更适合Quest.

source: Copy the addons folder from the Oculus Mobile asset into your Godot project. Your project tree should look similar to this:
es: Copia la carpeta addons del activo de Oculus Mobile en tu proyecto Godot. El árbol de tu proyecto debería tener un aspecto similar a este:
zh_cn: 将Oculus Mobile资产中的addons文件夹复制到你的Godot项目中,你的项目树应该类似于这样:

source: Now you can start building the main scene:
de: Jetzt können Sie mit dem Aufbau der Hauptszene beginnen:
es: Ahora puedes empezar a construir la escena principal:
zh_cn: 现在你可以开始构建主场景:

source: Add an :ref:`ARVROrigin <class_ARVROrigin>` node first.
de: Fügen Sie zuerst einen :ref:`ARVROrigin <class_ARVROrigin>`-Node hinzu.
es: Añade un nodo :ref:`ARVROrigin <clase_ARVROrigin>` primero.
zh_cn: 首先添加一个 :ref:`ARVROrigin <class_ARVROrigin>` 节点.

source: Then add three child nodes to the origin node, one :ref:`ARVRCamera <class_ARVRCamera>` and two :ref:`ARVRController <class_ARVRController>` nodes.
es: Luego agrega tres nodos hijos al nodo de origen, uno :ref:`ARVRCamera <class_ARVRCamera>` y dos nodos :ref:`ARVRController <class_ARVRController>`.
zh_cn: 然后在原节点上添加三个子节点,一个 :ref:`ARVRCamera <class_ARVRCamera>` 和两个 :ref:`ARVRController <class_ARVRController>` 节点.

source: Assign controller ID 1 to the first :ref:`ARVRController <class_ARVRController>` and rename that to ``LeftHand``.
de: Weisen Sie dem ersten :ref:`ARVRController <class_ARVRController>` die Controller-ID 1 zu und benennen Sie diese in ``LeftHand`` um.
es: Asigna el ID del controlador 1 al primero :ref:`ARVRController <class_ARVRController>` y renombra eso a ``LeftHand``.
zh_cn: 将控制器ID 1分配给第一个 :ref:`ARVRController <class_ARVRController>` 并将其重命名为 ``LeftHand`` .

source: Assign controller ID 2 to the second :ref:`ARVRController <class_ARVRController>` and rename that to ``RightHand``.
de: Weisen Sie dem zweiten :ref:`ARVRController <class_ARVRController>` die Controller-ID 2 zu und benennen Sie diese in ``RightHand`` um.
es: Asigna el ID del controlador 2 al segundo :ref:`ARVRController <class_ARVRController>` y renombra eso a ``RightHand``.
zh_cn: 将控制器ID 2分配给第二个 :ref:`ARVRController <class_ARVRController>` 并将其重命名为 ``RightHand`` .

source: Finally add a :ref:`MeshInstance <class_MeshInstance>` as a child node to our first :ref:`ARVRController <class_ARVRController>` and create a box shape, resize the box so each side is set to 0.1. Now duplicate the :ref:`MeshInstance <class_MeshInstance>` and move it to the second :ref:`ARVRController <class_ARVRController>` node. These will stand in for our controllers.
es: Finalmente agrega un :ref:`MeshInstance <class_MeshInstance>` como nodo hijo a nuestro primer :ref:`ARVRController <class_ARVRController>` y crea una forma de caja, cambia el tamaño de la caja para que cada lado se ponga a 0.1. Ahora duplica el nodo :ref:`MeshInstance <class_MeshInstance>` y muévelo al segundo :ref:`ARVRController <class_ARVRController>`. Estos serán nuestros controladores.
zh_cn: 最后添加一个 :ref:`MeshInstance <class_MeshInstance>` 作为我们第一个 :ref:`ARVRController <class_ARVRController>` 的子节点,并创建一个盒子形状,调整盒子的大小,使每个边都设置为 0.1.现在复制 :ref:`MeshInstance <class_MeshInstance>` 并将其移动到第二个 :ref:`ARVRController <class_ARVRController>` 节点.这些节点将代表我们的控制器.

source: Now add a script to the main node and add the following code:
de: Fügen Sie nun dem Haupt-Node ein Skript mit folgendem Code hinzu:
es: Ahora añade un script al nodo principal y agrega el siguiente código:
zh_cn: 现在给主节点添加一个脚本,并添加以下代码:

source: Before you can export this project to the Quest you need to do three more things.
de: Bevor Sie dieses Projekt in die Quest exportieren können, müssen Sie drei weitere Schritte ausführen.
es: Antes de poder exportar tu proyecto al Quest, deberás hacer tres cosas más.
zh_cn: 将项目导出到Quest之前,您需要做三件事.

source: First go into the project settings and make sure that the main scene is the scene we run. Godot does not ask you to set this on export.
de: Gehen Sie zuerst in die Projekteinstellungen und stellen Sie sicher, dass die Hauptszene die Szene ist, die wir ausführen. Godot fordert Sie beim Export nicht auf dies festzulegen.
es: Primero ve a la configuración del proyecto y asegúrate de que la escena principal es la que nosotros dirigimos. Godot no te pide que configures esto en la exportación.
zh_cn: 首先进入项目设置,确保主场景是运行的场景,Godot不要求你在导出时设置这个.

source: Then go into the export menu and configure a new Android export. if you still haven't gone through the :ref:`doc_exporting_for_android` page do it now. If you didn't you'll have some red messages on this screen.
zh_cn: 然后进入导出菜单,配置一个新的Android导出.如果你还没有通过 :ref:`doc_exporting_for_android` 页面配置,现在就去做.如果没做,会在这个屏幕上看到一些红色信息.

source: If you did you can forge ahead and make a few small changes to the export settings. First change the XR Mode to ``Oculus Mobile VR``. Then change the Degrees of Freedom mode to ``6DOF``.
es: Si lo hizo, puede seguir adelante y hacer algunos pequeños cambios en la configuración de la exportación. Primero cambia el modo XR a ``Oculus Mobile VR``. Luego cambia el modo Grados de Libertad a ``6DOF``.
zh_cn: 如果你这样做了,可以继续前进,并对导出设置进行一些小的修改,首先将XR模式改为 ``Oculus Mobile VR`` .然后将自由度模式改为 ``6DOF`` .

source: Now save and close the export window.
de: Speichern und schließen Sie nun das Exportfenster.
es: Ahora guarda y cierra la ventana de exportación.
zh_cn: 现在保存并关闭导出窗口.

source: Setting Up Your Quest
de: Den Quest einrichten
es: Configurando Tu Quest
zh_cn: 设置您的任务

source: Finally take out your phone, when you got your Quest you needed to install an Oculus app on it and link it up to your Quest. Start the Oculus app. Press the settings cogwheel on the bottom right hand side. Select your Quest:
de: Sie benötigen zum Schluss Ihr Telefon. Wenn Sie Ihren Quest erhalten haben, müssen Sie eine Oculus App darauf installieren und mit Ihrem Quest verknüpfen. Starten Sie die Oculus App und drücken Sie auf das Einstellrad unten rechts. Wählen Sie Ihren Quest aus:
es: Finalmente saca tu teléfono, cuando recibiste tu Quest necesitabas instalar una aplicación de Oculus en él y enlazarlo a tu Quest. Inicia la aplicación de Oculus. Presiona la rueda dentada de configuración en la parte inferior derecha. Selecciona tu misión:
zh_cn: 最后拿出手机,当你拿到Quest时,需要在手机上安装一个Oculus应用,并将其与Quest链接,启动Oculus应用,按右下角的设置齿轮,选择你的Quest:

source: Select "More Settings", and select "Developer Mode":
de: Wählen Sie "Weitere Einstellungen" und dann "Entwicklermodus":
es: Selecciona "Más ajustes", y selecciona "Modo de desarrollo":
zh_cn: 选择"More Settings"[更多设置],选择"Developer Mode"[开发者模式]:

source: Now turn developer mode on:
de: Schalten Sie nun den Entwicklermodus ein:
es: Ahora enciende el modo de desarrollo:
zh_cn: 现在开启开发者模式:

source: This allows you to deploy your games to the Quest.
de: Auf diese Weise können Sie Ihre Spiele für den Quest bereitstellen.
es: Esto te permite desplegar tus juegos en la Quest.
zh_cn: 这让你可以将游戏部署到Quest中.

source: Connect the Quest to your PC with the provided USB cable. Put the Quest on, it may give a few dialogs to give the PC permission to deploy apps. Now hit the little Android button that should be visible in the top right hand side of your Godot window. It should build your game and export it to the Quest.
de: Verbinden Sie den Quest mit dem mitgelieferten USB-Kabel mit Ihrem PC. Wenn Sie den Quest aktivieren, werden möglicherweise einige Dialogfelder angezeigt um dem PC die Berechtigung zum Bereitstellen von Apps zu erteilen. Klicken Sie nun auf die kleine Android-Schaltfläche, die oben rechts in Ihrem Godot-Fenster sichtbar sein sollte. Es sollte Ihr Spiel erstellen und in den Quest exportieren.
es: Conecta el Quest a tu PC con el cable USB suministrado. Encienda la Quest, pueden aparecer algunas ventanas para dar al PC permiso para desplegar aplicaciones. Ahora presiona el botón pequeño de Android que debería ser visible en la parte superior derecha de tu ventana de Godot. Debería construir tu juego y exportarlo a la Quest.
zh_cn: 用提供的USB线将Quest连接到电脑上.把Quest打开,它可能会给出一些对话框,让PC允许部署应用程序.现在点击Godot窗口右上方的Android小按钮,应该是可见的.它应该会构建你的游戏并将其导出到Quest.

source: The above does the bare minimum to get your project running on the Quest, it's not very exciting. Holger Dammertz has made a great toolkit for the quest that contains a lot of scenes to get help you on your way including really nice controller meshes.
de: Das oben Genannte ist das Mindeste um Ihr Projekt auf dem Quest zum Laufen zu bringen. Es ist nicht sehr aufregend. Holger Dammertz hat ein großartiges Toolkit für den Quest erstellt, das viele Szenen enthält, um Ihnen auf Ihrem Weg zu helfen, einschließlich wirklich netter Controller-Meshes.
es: Lo anterior hace lo mínimo para que tu proyecto funcione en la Quest, no es muy emocionante. Holger Dammertz ha creado un gran kit de herramientas para la Quest que contiene un montón de escenas para ayudarte en tu camino, incluyendo muy buenas mallas de control.
zh_cn: 上面的内容只是让你的项目在Quest上运行的最低限度,并不会很令人兴奋.Holger Dammertz为Quest制作了一个很棒的工具包,其中包含了很多场景,可以帮助你走上成功之路,包括非常漂亮的控制器网格.

source: You can find the toolkit `here <https://github.com/NeoSpark314/godot_oculus_quest_toolkit>`__.
de: Sie finden das Toolkit `hier <https://github.com/NeoSpark314/godot_oculus_quest_toolkit>`__.
es: Puedes encontrar el kit de herramientas `aquí <https://github.com/NeoSpark314/godot_oculus_quest_toolkit>`__.
zh_cn: 你可以在这里找到工具包 `here <https://github.com/NeoSpark314/godot_oculus_quest_toolkit>`__ .

source: If you want to help out with improving the plugin please join us `here <https://github.com/GodotVR/godot_oculus_mobile>`__.
de: Wenn Sie bei der Verbesserung des Plugins helfen möchten, treten Sie uns bitte `hier <https://github.com/GodotVR/godot_oculus_mobile>`__ bei.
es: Si quieres ayudar mejorando este plugin, por favor únete a nosotros `aquí <https://github.com/GodotVR/godot_oculus_mobile>`__.
zh_cn: 如果你想帮助改进这个插件,请加入我们的行列 `here <https://github.com/GodotVR/godot_oculus_mobile>`__ .
