Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/creating_script_templates.po
Languages: fr, pt_br

source: Creating script templates
fr: Création de modèles de script
pt_br: Criando modelos de script

source: Godot provides a way to use script templates as seen in the ``Script Create Dialog`` while creating a new script:
fr: Godot fournit un moyen d'utiliser des modèles de script comme on le voit dans le ``Script Create Dialog`` lors de la création d'un nouveau script :
pt_br: O Godot fornece uma maneira de usar modelos de scripts, como visto em ``Script Create Dialog`` enquanto se cria um novo script:

source: A set of default script templates is provided by default, but it's also possible to modify existing and create new ones, both per project and the editor.
fr: Un ensemble de modèles de script est fourni par défaut, mais il est également possible de modifier les modèles existants et d'en créer de nouveaux, tant par projet que par éditeur.
pt_br: Um conjunto de modelos de script já é fornecido por padrão, mas também é possível modificar os já existentes ou criar novos, tanto para o projeto quanto para o editor.

source: Locating the templates
fr: Localisation des modèles
pt_br: Localizando os modelos

source: There are two places where templates can be managed.
fr: Il existe deux endroits où les modèles peuvent être gérés.
pt_br: Existem dois lugares onde os modelos pode ser manipulados.

source: Editor-defined templates
fr: Modèles définis par l'éditeur
pt_br: Modelos definidos pelo editor

source: These are available globally throughout any project. The location of these templates are determined per each OS:
fr: Ils sont disponibles à travers tout les projets. L'emplacement de ces modèles est déterminé pour chaque OS :
pt_br: Estes estão disponíveis para todos os projetos. A localização destes modelos é determinada por cada SO em particular:

source: If no ``script_templates`` is detected, Godot will create a default set of built-in templates automatically, so this logic can be used to reset the default templates in case you've accidentally overwritten them.
fr: Si aucun de ces modèles n'est trouvé, Godot recréera l'ensemble de modèles par défaut automatiquement, on peut utiliser ça pour réinitialiser l'état des modèles si vous les avez perdu par accident.
pt_br: Se nenhum "script_templates" for detectado, o Godot irá criar um conjunto de modelos automaticamente, essa mesma lógica pode ser usada para reverter os modelos ao estado original, caso você acidentalmente tenha cometido algum erro.

source: Project-defined templates
fr: Modèles définis par le projet (templates)
pt_br: Modelos definidos pelo projeto

source: The default path to search for templates is the ``res://script_templates/`` directory. The path can be changed by configuring the ``editor/script_templates_search_path`` setting in the :ref:`ProjectSettings <class_ProjectSettings>`, both via code and the editor.
fr: Le chemin par défaut pour rechercher des modèles est le répertoire ``res://script_templates/``. Le chemin peut être modifié en configurant le paramètre ``editor/script_templates_search_path`` dans le :ref:`ProjectSettings <class_ProjectSettings>`, à la fois par code et par l'éditeur.
pt_br: O caminho padrão para buscar modelos é o diretório ``res://script_templates/``. O caminho pode ser mudado configurando a opção ``editor/script_templates_search_path`` em :ref:`ProjectSettings <class_ProjectSettings>`, tanto via código quanto pelo editor.

source: If no ``script_templates`` directory is found within a project, it is simply ignored.
fr: Si aucun répertoire ``script_templates`` n'est trouvé dans un projet, il est simplement ignoré.
pt_br: Se nenhum diretório``script_templates`` for encontrado no projeto, então é simplesmente ignorado.

source: Language support and overriding behavior
fr: Prise en charge de langage et comportement de réécriture
pt_br: Suporte para idiomas e comportamento de sobreposição

source: Depending on whether a particular language implements a way to generate scripts out of templates, it's possible to create a template which can be recognized by that language according to template's file extension. For GDScript and C#, the extensions must be ``gd`` and ``cs`` respectively.
fr: Selon qu'un langage particulier met en œuvre une manière de générer des scripts à partir de modèles ou non, il est possible de créer un modèle qui puisse être reconnu par ce langage en fonction de l'extension de fichier du modèle. Pour le GDScript et le C#, les extensions doivent être respectivement ``gd`` et ``cs``.
pt_br: Dependendo de como uma linguagem em particular implementa a geração de scripts a partir de modelos, é possível criar um modelo que possa ser reconhecido por essa linguagem de acordo com a extensão do arquivo do modelo. Para o GDScript e o C#, as extensões devem ser ``gd`` e ``cs`` respectivamente.

source: The script templates have the same extension as the regular script files. This may lead to an issue of a script parser treating those templates as actual scripts within a project. To avoid this, make sure to ignore the directory containing them by creating a ``.gdignore`` file. The directory won't be visible throughout the project's filesystem anymore, yet the templates can be modified by an external text editor anytime.
fr: Les modèles de script ont la même extension que les fichiers de script ordinaires. Cela peut conduire à un problème d'analyseur de script traitant ces modèles comme de véritables scripts au sein d'un projet. Pour éviter cela, veillez à ignorer le répertoire qui les contient en créant un fichier ``.gdignore``. Le répertoire ne sera plus visible dans le système de fichiers du projet, mais les modèles peuvent être modifiés à tout moment par un éditeur de texte externe.

source: The built-in editor templates are automatically shadowed by the project-specific templates given both scripts have the same filename.
fr: Les modèles d'éditeur intégrés sont automatiquement remplacés par les modèles spécifiques au projet, étant donné que les deux scripts ont le même nom de fichier.
pt_br: Os modelos de editor integrados são automaticamente ocultados pelos modelos específicos do projeto, dado que ambos os scripts têm o mesmo nome de arquivo.

source: Default template
fr: Modèle par défaut
pt_br: Modelo padrão

source: The ``Default`` template is always generated dynamically per language and cannot be configured nor overridden, but you can use these as the base for creating other templates.
fr: Le modèle ``Default`` est toujours généré dynamiquement par langage et ne peut être ni configuré ni remplacé, mais vous pouvez les utiliser comme base pour créer d'autres modèles.
pt_br: O modelo ``Padrão`` sempre é gerado dinamicamente por linguagem e não pode ser configurado ou sobreposto, mas você pode usá-lo como base para criar outros modelos.

source: List of template placeholders
fr: Liste des modèles d'espaces réservés
pt_br: Lista de placeholders de modelo

source: The following describes the complete list of built-in template placeholders which are currently implemented.
fr: Voici la liste complète des modèles d'espaces réservés intégrés qui sont actuellement implémenté.
pt_br: O seguinte descreve a lista completa de placeholders de modelo integrados que estão embutidos atualmente.

source: Base placeholders
fr: Espaces réservés de base
pt_br: Placeholders base

source: Placeholder
fr: Chaîne substituable

source: The name of the new class (used in C# only).
fr: Le nom de la nouvelle classe (uniquement utilisé en C#).
pt_br: O nome da nova classe (usado apenas em C#).

source: The base type a new script inherits from.
fr: Le type de base dont hérite un nouveau script.
pt_br: O tipo básico de onde um novo script herda.

source: Indentation placeholder. The exact type and number of whitespace characters used for indentation is determined by the ``text_editor/indent/type`` and ``text_editor/indent/size`` settings in the :ref:`EditorSettings <class_EditorSettings>` respectively.
fr: Emplacement réservé d'indentation. Le type et le nombre exact de caractères d'espacement utilisés pour l'indentation sont déterminés respectivement par les paramètres ``text_editor/indent/type`` et ``text_editor/indent/size`` dans les paramètres :ref:`EditorSettings <class_EditorSettings>`.
pt_br: Placeholder de indentação. O tipo exato e quantidade de espaços em branco usados para a indentação é determinado pelas propriedades ``text_editor/indent/type`` e ``text_editor/indent/size`` respectivamente, veja :ref:`EditorSettings <class_EditorSettings>`.

source: Type placeholders
fr: Type d'espaces réservés
pt_br: Placeholders de tipo

source: These are only relevant for GDScript with static typing. Whether these placeholders are actually replaced is determined by the ``text_editor/completion/add_type_hints`` setting in the :ref:`EditorSettings <class_EditorSettings>`.
fr: Elles ne sont pertinentes que pour le GDScript avec typage statique. Le fait que ces espaces réservés soient effectivement remplacés est déterminé par le paramètre ``text_editor/completion/add_type_hints`` dans :ref:`EditorSettings <class_EditorSettings>`.
pt_br: Estes só são relevantes para o GDScript com tipo estático. Se os placeholders são realmente substituidos é determinado pela propriedade ``text_editor/completion/add_type_hints`` em :ref:`EditorSettings <class_EditorSettings>`.

source: Value
fr: Valeur
pt_br: Valor

source: Description
pt_br: Descrição
