Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/cross_language_scripting.po
Languages: fr, ru, uk

source: Cross-language scripting
fr: Scripting multi-langage
uk: Багатомовні скрипти

source: Godot allows you to mix and match scripting languages to suit your needs. This means a single project can define nodes in both C# and GDScript. This page will go through the possible interactions between two nodes writen in different languages.
fr: Godot vous permet de mixer et relier des langages de scripts pour s'adapter à vos besoins. ça signifie qu'un unique projet peut utiliser des nœuds ayant des scripts C# et Gdscript sans problèmes. Cette page regarde de près les différentes interactions possibles entre deux nœuds écrits dans des langages différents.
ru: Godot позволяет вам смешивать и сопоставлять языки сценариев в соответствии с вашими потребностями. Это означает, что один проект может определять узлы как в C#, так и в GDScript. На этой странице будут рассмотрены возможные взаимодействия между двумя узлами, написанными на разных языках.

source: The following two scripts will be used as references throughout this page.
fr: Les deux scripts suivants serviront de référence tout le long de cette page.
ru: Следующие два скрипта будут использоваться в качестве примера на этой странице.
uk: Наступні два скрипти використовуватимуться як приклад на цій сторінці.

source: Instantiating nodes
fr: Installer des nœuds
uk: Вставка екземплярів (Instantiating) вузлів

source: If you're not using nodes from the scene tree, you'll probably want to instantiate nodes directly from the code.
fr: Si vous n'utilisez pas de nœuds venant de l'arbre des scène, vous voudrez probablement instancier les nœuds directement depuis le code.
ru: Если вы не используете узлы из дерева сцены, вы, вероятно, захотите создать экземпляры узлов непосредственно из кода.
uk: Якщо ви не використовуєте вузли з дерева сцени, ви, ймовірно, захочете вставляти їх екземляри (instantiate) безпосередньо з коду.

source: Instantiating C# nodes from GDScript
fr: Instanciation des nœuds C# à partir de GDScript
uk: Вставка екземплярів (Instantiating) вузлів C# на GDScript

source: Using C# from GDScript doesn't need much work. Once loaded (see :ref:`doc_gdscript_classes_as_resources`) the script can be instantiated with :ref:`new() <class_CSharpScript_method_new>`.
fr: Utiliser un script en C# depuis un script en GDscript ne demande pas énormément de travail. Une fois fois chargé (voir :ref:`doc_gdscript_classes_as_resources`) le script peut être instancié avec :ref:`new() <class_CSharpScript_method_new>`.
ru: Использование C# из GDScript не требует особых усилий. После загрузки (см . :ref:`doc_gdscript_classes_as_resources`) сценарий может быть создан с помощью :ref:`new() <class_CSharpScript_method_new>`.

source: When creating .cs scripts you should always keep in mind that the class Godot will use is the one named like the .cs file itself. If that class does not exist in the file, you'll see the following error: ``Invalid call. Nonexistent function `new` in base``.
fr: Lors de la création de script .cs, vous devriez toujours garder à l'esprit que la classe que Godot va utiliser est celle qui possède le même nom que le fichier .cs . Si cette classe n'existe pas dans le fichier, vous verrez l'erreur suivante : ``Invalid call. Nonexistent function `new` in base``.
ru: При создании сценариев .cs вы всегда должны помнить, что класс, который будет использовать Godot, называется так же, как и сам файл .cs. Если этот класс не существует в файле, вы увидите следующую ошибку: ``Invalid call. Nonexistent function `new` in base``.

source: For example, MyCoolNode.cs should contain a class named MyCoolNode.
fr: Par exemple, MonSuperNoeud.cs devrait contenir une classe nommée MonSuperNoeud.
ru: Например, MyCoolNode.cs должен содержать класс с именем MyCoolNode.
uk: Наприклад, MyCoolNode.cs повинен містити клас під назвою MyCoolNode.

source: You also need to check your .cs file is referenced in the project's .csproj file. Otherwise, the same error will occur.
fr: Vous devez aussi vérifier que votre fichier .cs est référencé dans le fichier projet .csproj. Sinon la même erreur se produira.
ru: Вам также необходимо проверить, что ваш файл .cs указан в файле проекта .csproj. В противном случае произойдет та же ошибка.

source: Instantiating GDScript nodes from C#
fr: Instanciation des nœuds GDScript à partir de C#
ru: Создание узлов GDScript из C#
uk: Вставка екземплярів (Instantiating) вузлів GDScript на C#

source: From the C# side, everything work the same way. Once loaded, the GDScript can be instantiated with :ref:`GDScript.New() <class_GDScript_method_new>`.
fr: Du côté d'un script C#, tout marche de la même manière. Une fois le script écrit en GDscript chargé depuis le script en C#, il peut être instancié avec :ref:`GDScript.New() <class_GDScript_method_new>`.
ru: Со стороны C# все работает точно также. После загрузки GDScript может быть создан с помощью :ref:`GDScript.New() <class_GDScript_method_new>`.
uk: З боку C# все працює так само. Після завантаження, GDScript може бути вставлений (instantiated) з :ref:`GDScript.New ()<class_GDScript_method_new>`.

source: Here we are using an :ref:`class_Object` but you can use type convertion like explained in :ref:`doc_c_sharp_features_type_conversion_and_casting`.
fr: Ici, on utilise un :ref:`class_Object` mais vous pouvez utiliser la conversion de type tel qu'expliqué ici :ref:`doc_c_sharp_features_type_conversion_and_casting`.
ru: Здесь мы используем :ref:`class_Object`, но вы можете использовать преобразование типов, как объяснено в :ref:`doc_c_sharp_features_type_conversion_and_casting`.

source: Accessing fields
fr: Accès aux champs
ru: Доступ к полям
uk: Доступ до полів

source: Accessing C# fields from GDScript
fr: Accès aux champs C# depuis GDScript
ru: Доступ к полям C# из GDScript
uk: Доступ до полів C# з GDScript

source: Accessing C# fields from GDScript is straightforward, you shouldn't have anything to worry about.
fr: Accéder au champ de C# depuis le GDscript est intuitif, vous ne devriez pas rencontrer de problème.
ru: Доступ к полям C# из GDScript прост, вам не о чем беспокоиться.
uk: Доступ до полів C# з GDScript нескладний, вам нема про що хвилюватися.

source: Note that it doesn't matter if the field is defined as a property or an attribute, but trying to set a value on a property that does not define a setter will result in a crash.
fr: Remarquez que cela n'a pas d'importance si un champ est définit comme propriété ou attribut, mais essayer de changer la valeur d'une propriété qui ne définit pas un setter (une fonction qui change la valeur d'une propriété) résultera en un crash.
ru: Обратите внимание, что не имеет значения, определено ли поле как свойство или атрибут, но попытка установить значение для свойства, которое не определяет сеттер, приведет к ошибке.

source: Accessing GDScript fields from C#
fr: Accéder au champ de GDscript depuis du C#
ru: Доступ к полям GDScript из C#
uk: Доступ до полів GDScript з C#

source: As C# is statically typed, accessing GDScript from C# is a bit more convoluted, you will have to use :ref:`Object.Get() <class_Object_method_get>` and :ref:`Object.Set() <class_Object_method_set>`. The first argument is the name of the field you want to access.
fr: Le C# est typé statiquement, accéder au GDscript depuis C# est plus convoluté.. Il va falloir utiliser :ref:`Object.Get() <class_Object_method_get>` et :ref:`Object.Set() <class_Object_method_set>`. Le premier argument est le nom du champ que vous souhaitez accéder.
ru: Поскольку C# статически типизирован, доступ к GDScript из C# немного более сложен, вам придется использовать :ref:`Object.Get() <class_Object_method_get>` и :ref:`Object.Set() <class_Object_method_set>`. Первый аргумент - это имя поля, к которому вы хотите получить доступ.
uk: Оскільки C# статично типізований, доступ до GDScript з C# трохи складніший, вам доведеться використовувати :ref:`Object.Get() <class_Object_method_get>` та :ref:`Object.Set() <class_Object_method_set>`. Перший аргумент - це ім'я поля, до якого ви хочете отримати доступ.

source: Keep in mind that when setting a field value you should only use types the GDScript side knows about. Essentially, you want to work with built-in types as described in :ref:`doc_gdscript` or classes extending :ref:`class_Object`.
fr: Gardez à l'esprit que lorsque vous définissez la valeur d'un champ, vous ne devez utiliser que les types connus du côté GDScript. Essentiellement, vous voulez travailler avec des types intégrés comme décrit dans :ref:`doc_gdscript` ou des classes héritant de :ref:`class_Object`.
ru: Имейте в виду, что при установке значения поля вы должны использовать только те типы, о которых знает сторона GDScript. По сути, вы хотите работать со встроенными типами, как описано в :ref:`doc_gdscript`, или с классами, расширяющими :ref:`class_Object`.
uk: Майте на увазі, що при встановленні значення поля слід використовувати лише типи, про які знає сторона GDScript. По суті, ви хочете працювати з вбудованими типами, як описано :ref:`doc_gdscript`, або класах, що розширюють :ref:`class_Object`.

source: Calling methods
fr: Méthodes d'appel
uk: Методи виклику

source: Calling C# methods from GDScript
fr: Appel de méthodes C# depuis GDScript
uk: Виклик методів C# з GDScript

source: Again, calling C# methods from GDScript should be straightforward. The marshalling process will do its best to cast your the arguments to match function signatures. If that's impossible you'll see the following error: ``Invalid call. Nonexistent function `FunctionName```.
fr: Encore une fois, appeler des méthodes C# depuis GDScript devrait être simple. Le processus de sérialisation fera de son mieux pour vous fournir les arguments qui correspondent aux signatures de fonction. Si c'est impossible, vous verrez l'erreur suivante : ``Invalid call. Nonexistent function `FunctionName```.
ru: Опять же, вызов методов C# из GDScript должен быть простым. Процесс маршаллинга приложит все усилия, чтобы привести ваши аргументы к сигнатурам функций. Если это невозможно, вы увидите следующую ошибку: ``Invalid call. Nonexistent function `FunctionName```.

source: Calling GDScript methods from C#
fr: Appel de méthodes GDScript depuis C#
ru: Вызов методов GDScript из C#
uk: Виклик методів GDScript з C#

source: To call GDScript methods from C# you'll need to use :ref:`Object.Call() <class_Object_method_call>`. The first arguments is the name of the method you want to call. The following arguments will be passed to said method.
fr: Pour appeler des méthodes GDscript depuis de C# vous aurez besoin d'utiliser :ref:`Object.Call() <class_Object_method_call>`. Le premier argument est le nom de la méthode que vous voulez appeler. Les arguments suivants sont passés à la méthode en question.
ru: Для вызова методов GDScript из C# нужно использовать :ref:`Object.Call() <class_Object_method_call>`. Первый аргумент - имя метода, который вы хотите вызвать. Следующие аргументы будут переданы указанному методу.

source: As you can see, if the first argument of the called method is an array, you'll need to cast it as ``object``. Otherwise each element of your array will be treated as a single argument and the function signature won't match.
fr: Comme vous pouvez voir, le premier argument de la méthode appelé est une liste, vous aurez besoin de l'annoncer comme un ``object``. Sinon chaque élément de votre liste sera traité comme un argument unique et la signature de la fonction ne correspondra pas.
ru: Как вы можете видеть, если первый аргумент вызываемого метода является массивом, вам нужно привести его как ``object``. В противном случае каждый элемент вашего массива будет рассматриваться как один аргумент, и сигнатура функции не будет совпадать.

source: Inheritance
uk: Успадкування
