Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/community/channels.po
Languages: es, ja, pl, ru, zh_cn

source: So, where is the Godot community and where can you ask questions and get help?
es: Entonces, ¿dónde está la comunidad de Godot y dónde puedo hacer preguntas para obtener ayuda?
ja: では、Godotコミュニティはどこにあるのでしょうか、質問をして助けを得ることができるのはどこですか?
pl: Gdzie szukać członków społeczności Godot i gdzie można zadawać pytania oraz prosić o pomoc?
ru: Итак, где обитает сообщество Godot и где вы можете получить ответы на свои вопросы и получить помощь?
zh_cn: 那么，Godot社区在哪里？在哪里可以提出问题并获得帮助？

source: Note that some of these channels are run and moderated by members of the Godot community or third parties.
es: Hay que tener en cuenta que algunos de estos canales son administrados y moderados por miembros de la comunidad Godot o terceros.
ja: これらのチャネルの一部は、Godot コミュニティまたはサードパーティのメンバーによって実行および管理されています。
pl: Pamiętaj, że niektóre z kanałów są prowadzone i moderowane przez członków społeczności Godot i inne osoby.
ru: Обратите внимание, что некоторые из этих каналов управляются и модерируются членами сообщества Godot или третьими лицами.
zh_cn: 请注意，其中一些渠道由Godot社区的或第三方的成员运营和审核。

source: A brief overview over these and other channels is also available on the `Godot website <https://godotengine.org/community>`_.
es: Una breve reseña sobre esos y otros canales también está disponible en el `sitio web <https://godotengine.org/community>`_.
ja: これらのチャネルやその他のチャネルの概要は、`Godotウェブサイト <https://godotengine.org/community>`_\ でもご覧いただけます。
pl: Krótkie omówienie dotyczące tych i innych kanałów komunikacyjnych dostępne jest także na stronie Godot '<https://godotengine.org/community>`_.
ru: Краткий обзор этих и других каналов также доступен на `веб-сайте Godot <https://godotengine.org/community>`_.
zh_cn: 有关这些渠道的简要概述也可在 `Godot网站 <https://godotengine.org/community>`_ 上找到。

source: Q&A
es: Preguntas y respuestas
pl: Pytania i odpowiedzi
ru: Вопросы и ответы
zh_cn: 问答

source: `Official Godot Questions & Answers <https://godotengine.org/qa/>`_
es: `Preguntas y Respuestas de Godot Oficial <https://godotengine.org/qa/>`_
ja: `オフィシャル Godot Q&A <https://godotengine.org/qa/>`_
pl: `Oficjalna strona pytań i odpowiedzi <https://godotengine.org/qa/>`_
zh_cn: `Godot官方问题与解答 <https://godotengine.org/qa/>`_

source: IRC on Freenode
es: IRC en Freenode
ja: フリーノード上のIRC
pl: IRC na Freenode
ru: IRC-каналы в сети Freenode
zh_cn: Freenode上的IRC

source: `General: #godotengine <http://webchat.freenode.net/?channels=#godotengine>`_
pl: `Ogólne: #godotengine <http://webchat.freenode.net/?channels=#godotengine>`_
zh_cn: `通用： #godotengine <http://webchat.freenode.net/?channels=#godotengine>`_

source: `Engine development: #godotengine-devel <http://webchat.freenode.net/?channels=#godotengine-devel>`_
es: `Desarrollo del motor: #godotengine-devel <http://webchat.freenode.net/?channels=#godotengine-devel>`_
pl: `Rozwój silnika: #godotengine-devel <http://webchat.freenode.net/?channels=#godotengine-devel>`_
zh_cn: `引擎开发： #godotengine-devel <http://webchat.freenode.net/?channels=#godotengine-devel>`_

source: `Documentation: #godotengine-doc <http://webchat.freenode.net/?channels=#godotengine-doc>`_
es: `Documentación: #godotengine-doc <http://webchat.freenode.net/?channels=#godotengine-doc>`_
pl: `Dokumentacja: #godotengine-doc <http://webchat.freenode.net/?channels=#godotengine-doc>`_
zh_cn: `文档： #godotengine-doc <http://webchat.freenode.net/?channels=#godotengine-doc>`_

source: `Website and public relations: #godotengine-atelier <http://webchat.freenode.net/?channels=#godotengine-atelier>`_
es: `Sitio web y relaciones públicas: #godotengine-atelier <http://webchat.freenode.net/?channels=#godotengine-atelier>`_
pl: 'Strony internetowe i public relations: #godotengine-atelier <http://webchat.freenode.net/?channels=#godotengine-atelier>`_
zh_cn: `网站和公共关系：#godotengine-atelier <http://webchat.freenode.net/?channels=#godotengine-atelier>`_

source: `IRC logs <https://godot.eska.me/irc-logs/>`_
pl: `IRC logi <https://godot.eska.me/irc-logs/>`_
ru: `Журналы IRC <https://godot.eska.me/irc-logs/>`_
zh_cn: `IRC日志 <https://godot.eska.me/irc-logs/>`_

source: Other chats
es: Otros chats
ja: その他のチャット
pl: Inne czaty
ru: Другие чаты
zh_cn: 其他聊天

source: `Matrix (IRC compatible) <https://matrix.to/#/#godotengine:matrix.org>`_
pl: `Matrix (kompatybilny z IRC) <https://matrix.to/#/#godotengine:matrix.org>`_
ru: `Matrix (совместим с IRC) <https://matrix.to/#/#godotengine:matrix.org>`_
zh_cn: `Matrix (IRC兼容) <https://matrix.to/#/#godotengine:matrix.org>`_

source: Language-based communities
ja: 言語ベースのコミュニティ
pl: Społeczności nieanglojęzyczne
ru: Языковые сообщества

source: Brazilian Portuguese: `Godot Brasil (Discord) <https://discord.gg/gWmQKBv>`_
pl: Portugalska (w odmianie brazylijskiej): `Godot Brasil (Discord) <https://discord.gg/gWmQKBv>`_

source: French: `Godot Francophone Officiel (Discord) <https://discord.gg/3jvf3XN>`_
pl: Francuska: `Godot Francophone Officiel (Discord) <https://discord.gg/3jvf3XN>`_

source: French: `SoloCode Godot (Discord) <https://discord.gg/gZ3QJ5T>`_
pl: Francuska: `SoloCode Godot (Discord) <https://discord.gg/gZ3QJ5T>`_

source: German: `Deutsche Godot Community (Discord) <https://discord.gg/Tr7Ma6E>`_
pl: Niemiecka: `Deutsche Godot Community (Discord) <https://discord.gg/Tr7Ma6E>`_

source: Swedish: `Swedish Godot Community (Discord) <https://discord.gg/6ZsgWmH>`_
pl: Szwedzka: `Swedish Godot Community (Discord) <https://discord.gg/6ZsgWmH>`_
zh_cn: 德语:`德国 Godot 社区(Discord) <https://discord.gg/6ZsgWmH>`_

source: Social networks
es: Redes sociales
ja: ソーシャルネットワーク
pl: Media społecznościowe
ru: Социальные сети
zh_cn: 社交网络

source: `Facebook group <https://www.facebook.com/groups/godotengine/>`_
es: `Grupo de Facebook <https://www.facebook.com/groups/godotengine/>`_
pl: `Grupa na Facebooku <https://www.facebook.com/groups/godotengine/>`_
ru: `Группа в Facebook <https://www.facebook.com/groups/godotengine/>`_
zh_cn: `Facebook组 <https://www.facebook.com/groups/godotengine/>`_

source: `Twitter (also, #godotengine) <https://twitter.com/godotengine>`_
es: `Twitter (también, #godotengine) <https://twitter.com/godotengine>`_
pl: `Twitter (również, #godotengine) <https://twitter.com/godotengine>`_
zh_cn: `Twitter (同样在 #godotengine) <https://twitter.com/godotengine>`_

source: Community channels
es: Canales de la comunidad
ja: コミュニティチャンネル
ru: Каналы сообщества
zh_cn: 社区渠道

source: `General: #godotengine <https://webchat.freenode.net/?channels=#godotengine>`_
ja: `一般: #godotengine <http://webchat.freenode.net/?channels=#godotengine>`_
ru: `Общий: #godotengine <https://webchat.freenode.net/?channels=#godotengine>`_

source: `Engine development: #godotengine-devel <https://webchat.freenode.net/?channels=#godotengine-devel>`_
ja: `エンジン開発: #godotengine-devel <http://webchat.freenode.net/?channels=#godotengine-devel>`_
ru: `Разработка движка: #godotengine-devel <https://webchat.freenode.net/?channels=#godotengine-devel>`_

source: `Documentation: #godotengine-doc <https://webchat.freenode.net/?channels=#godotengine-doc>`_
ja: `ドキュメント: #godotengine-doc <http://webchat.freenode.net/?channels=#godotengine-doc>`_
ru: `Документация: #godotengine-doc <https://webchat.freenode.net/?channels=#godotengine-doc>`_

source: `Pull request meetings: #godotengine-meeting <https://webchat.freenode.net/?channels=#godotengine-meeting>`_
ja: `プルリクエストミーティング: #godotengine-meeting <http://webchat.freenode.net/?channels=#godotengine-meeting>`_
ru: `Обсуждения Pull request'ов: #godotengine-meeting <https://webchat.freenode.net/?channels=#godotengine-meeting>`_

source: `Website and public relations: #godotengine-atelier <https://webchat.freenode.net/?channels=#godotengine-atelier>`_
ja: `ウェブサイトと広報: #godotengine-atelier <http://webchat.freenode.net/?channels=#godotengine-atelier>`_
ru: `Веб-сайт и связи с общественностью: #godotengine-atelier <https://webchat.freenode.net/?channels=#godotengine-atelier>`_

source: See the `User groups <https://godotengine.org/community/user-groups>`_ page of the website for a list of local communities.
ru: Смотрите раздел "Группы пользователей<https://godotengine.org/community/user-groups>`_ страница сайта со списком местных сообществ.

source: `Twitter <https://twitter.com/godotengine>`_ (see also the `#GodotEngine <https://twitter.com/hashtag/GodotEngine>`_ hashtag)
ja: `Twitter <https://twitter.com/godotengine>`_ ( または`#GodotEngine <https://twitter.com/hashtag/GodotEngine>`_ のハッシュタグ)
ru: `Twitter <https://twitter.com/godotengine>`_ (см. также хештег `#GodotEngine <https://twitter.com/hashtag/GodotEngine>`_)

source: Forum
es: Foro
ja: フォーラム
ru: Форум
zh_cn: 论坛

source: `Godot Forums <https://godotforums.org/>`_
ru: `Форумы Godot <https://godotforums.org/>`_

source: `Pull request meetings: #godotengine-meeting <http://webchat.freenode.net/?channels=#godotengine-meeting>`_
es: `Reuniones de pull requests: #godotengine-meeting <http://webchat.freenode.net/?channels=#godotengine-meeting>`_
zh_cn: `拉取请求会议：#godotengine-meeting <http://webchat.freenode.net/?channels=#godotengine-meeting>`_

source: `Forum (godotforums.org) <https://godotforums.org/>`_
zh_cn: `论坛(godotforums.org) <https://godotforums.org/>`_

source: `GDNative: #godotengine-gdnative <https://webchat.freenode.net/?channels=#godotengine-gdnative>`_
ja: `GDNative: #godotengine-gdnative <http://webchat.freenode.net/?channels=#godotengine-gdnative>`_
