Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/community/tutorials.po
Languages: es

source: Tutorials and resources
es: Tutoriales y recursos

source: This is a list of third-party tutorials and resources created by the Godot community. For resources, remember that there is the official `Godot Asset Library <https://godotengine.org/asset-library/asset>`_ full of official and community resources too! Also, have a look at this `huge list over at Reddit <https://www.reddit.com/r/godot/comments/an0iq5/godot_tutorials_list_of_video_and_written/>`_.
es: Esta es una lista de tutoriales y recursos de terceros creados por la comunidad de Godot. Para recursos, recuerda que existe la `Godot Asset Library <https://godotengine.org/asset-library/asset>` _ ¡llena de recursos oficiales y comunitarios también! Además echa un vistazo a esta `gran lista en Reddit <https://www.reddit.com/r/godot/comments/an0iq5/godot_tutorials_list_of_video_and_written/>`_.

source: Think there is something missing here? Feel free to submit a `Pull Request <https://github.com/godotengine/godot-docs/blob/master/community/tutorials.rst>`_ as always.
es: ¿Crees que falta algo aquí? No dude en enviar una `Pull Request <https://github.com/godotengine/godot-docs/blob/master/community/tutorials.rst>`_ como siempre.

source: Where to start
es: Donde empezar

source: The Godot video tutorials by `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_, `Game from Scratch <https://www.youtube.com/watch?v=iDEcP8Mc-7s&list=PLS9MbmO_ssyDk79j9ewONxV88fD5e_o5d>`_ and `KidsCanCode <https://www.youtube.com/channel/UCNaPQ5uLX5iIEHUCLmfAgKg/playlists>`_ are well-regarded in the community and often recommended as a gentle introduction to beginners.
es: Los tutoriales en video de Godot de `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_, `Game from Scratch <https://www.youtube.com/watch?v=iDEcP8Mc-7s&list=PLS9MbmO_ssyDk79j9ewONxV88fD5e_o5d>`_ y` KidsCanCode <https://www.youtube.com/channel/UCNaPQ5uLX5iIEHUCLmfAgKg/playlists>`_ son bien considerados en la comunidad y a menudo se recomiendan como una introducción suave para los principiantes.

source: If you're interested in Visual Scripting, `Emilio's tutorials <https://www.youtube.com/channel/UC9DR22-qohBDtZ74R3FxOZg>`_ may be worth a look.
es: Si está interesado en Visual Scripting, los `tutoriales de Emilio <https://www.youtube.com/channel/UC9DR22-qohBDtZ74R3FxOZg>`_ pueden valer la pena.

source: Some tutorials mentioned below provide more advanced tutorials, e.g. on 3D or shaders.
es: Algunos de los mencionados a continuación proporcionan tutoriales más avanzados, pj.: en 3D o shaders.

source: Video tutorials
es: Vídeo tutoriales

source: `Emilio <https://www.youtube.com/channel/UC9DR22-qohBDtZ74R3FxOZg>`_ (2D, GDScript and VisualScript).
es: `Emilio <https://www.youtube.com/channel/UC9DR22-qohBDtZ74R3FxOZg>`_ (2D, GDScript y VisualScript).

source: `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_ (2D and 3D, GDScript, VisualScript and C#).
es: `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_ (2D y 3D, GDScript, VisualScript y C#).

source: `Game from Scratch <https://www.youtube.com/watch?v=iDEcP8Mc-7s&list=PLS9MbmO_ssyDk79j9ewONxV88fD5e_o5d>`_ (2D and 3D, GDScript and C#).
es: `Game from Scratch <https://www.youtube.com/watch?v=iDEcP8Mc-7s&list=PLS9MbmO_ssyDk79j9ewONxV88fD5e_o5d>`_ (2D y 3D, GDScript y C#).

source: `Jeremy Bullock <https://www.youtube.com/channel/UCwJw2-V5S1TkBjLQ3_Ws54g>`_ (2D and 3D, GDScript, VisualScript and C#).
es: `Jeremy Bullock <https://www.youtube.com/channel/UCwJw2-V5S1TkBjLQ3_Ws54g>`_ (2D y 3D, GDScript, VisualScript y C#).

source: `KidsCanCode <https://www.youtube.com/channel/UCNaPQ5uLX5iIEHUCLmfAgKg/playlists>`__ (2D and 3D, GDScript and VisualScript).
es: `KidsCanCode <https://www.youtube.com/channel/UCNaPQ5uLX5iIEHUCLmfAgKg/playlists>`__ (2D y 3D, GDScript y VisualScript).

source: `Steincodes <https://www.youtube.com/c/steincodes/playlists>`__ (2D, GDScript and VisualScript).
es: `Steincodes <https://www.youtube.com/c/steincodes/playlists>`__ (2D, GDScript y VisualScript).

source: `Code with Tom <https://www.youtube.com/playlist?list=PLiUQR4U_J9ec0k91iHPme_qtfS1nrWF3W>`_ (2D and 3D, GDScript).
es: `Code with Tom <https://www.youtube.com/playlist?list=PLiUQR4U_J9ec0k91iHPme_qtfS1nrWF3W>`_(2D y 3D, GDScript).

source: Text tutorials
es: Tutoriales en texto

source: `Godot Recipes by KidsCanCode <http://godotrecipes.com/>`__
es: `Recetas de Godot por KidsCanCode <http://godotrecipes.com/>`__

source: `Andrea Catania (Physics & AI) <https://www.youtube.com/channel/UCm4RuvYtgpgFDTCgaEUT5uQ/videos>`_
es: `Andrea Catania (Física & IA) <https://www.youtube.com/channel/UCm4RuvYtgpgFDTCgaEUT5uQ/videos>`_

source: `Bastiaan Olij (AR & VR) <https://www.youtube.com/channel/UCrbLJYzJjDf2p-vJC011lYw/videos>`_
es: `Bastiaan Olij (RA & RV) <https://www.youtube.com/channel/UCrbLJYzJjDf2p-vJC011lYw/videos>`_

source: Resources
es: Recursos

source: `awesome-godot: A curated list of resources by Calinou <https://github.com/Calinou/awesome-godot>`_
es: `awesome-godot: Una lista curada de recursos por Calinou <https://github.com/Calinou/awesome-godot>`_

source: `Zeef Godot Engine: A curated directory of resources by Andre Schmitz <https://godot-engine.zeef.com/andre.antonio.schmitz>`_
es: `Zeef Godot Engine: Un directorio de recursos supervisado por Andre Schmitz <https://godot-engine.zeef.com/andre.antonio.schmitz>`_
