Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/internationalizing_games.po
Languages: es, zh_cn

source: Internationalizing games
es: Internacionalizando los juegos
zh_cn: 使游戏国际化

source: Introduction
es: Introducción
zh_cn: 前言

source: Sería excelente que el mundo hablara solo un idioma (It would be great if the world spoke only one language). Unfortunately for us developers, that is not the case. While indie or niche games usually do not need localization, games targeting a more massive market often require localization. Godot offers many tools to make this process more straightforward, so this tutorial is more like a collection of tips and tricks.
zh_cn: 如果全世界只讲一种语言, 那将是很好的(这将是世界上唯一的一种语言). 不幸的是, 对于我们的开发人员来说, 情况并非如此. 虽然独立或利基游戏通常不需要本地化, 但瞄准更大市场的游戏通常需要本地化.Godot提供了许多工具来使这个过程更加简单, 因此本教程更像一个技巧和技巧的集合.

source: Localization is usually done by specific studios hired for the job and, despite the huge amount of software and file formats available for this, the most common way to do localization to this day is still with spreadsheets. The process of creating the spreadsheets and importing them is already covered in the :ref:`doc_importing_translations` tutorial, so this one could be seen more like a follow-up to that one.
zh_cn: 本地化通常是通过雇佣特定的工作室来完成的, 尽管有大量的软件和文件格式可供使用, 但迄今为止进行本地化最常见的方式仍然是使用电子表格. 创建电子表格并导入电子表格的过程已经在 :ref:`doc_importing_translations` 教程中介绍了, 所以这个教程更像是对那个教程的后续.

source: We will be using the official demo as an example; you can `download it from the Asset Library <https://godotengine.org/asset-library/asset/134>`_.
zh_cn: 我们将使用官方演示作为一个示例, 您可以在 `Asset Library <https://godotengine.org/asset-library/asset/134>`_ 下载它们.

source: Configuring the imported translation
es: Configuración de la traducción importada
zh_cn: 配置导入的译文

source: Translations can get updated and re-imported when they change, but they still have to be added to the project. This is done in **Project → Project Settings → Localization**:
zh_cn: 翻译可以在更改时得到更新和重新导入, 但仍必须添加到项目中. 可通过 **Project → Project Settings → Localization** 来完成:

source: The above dialog is used to add or remove translations project-wide.
zh_cn: 上述对话框用于添加或删除项目范围内的翻译.

source: Localizing resources
es: Localización de recursos
zh_cn: 资源文件的本地化处理

source: It is also possible to instruct Godot to use alternate versions of assets (resources) depending on the current language. The **Remaps** tab can be used for this:
zh_cn: 根据当前语言, 还可以指示Godot使用资源(资源)的替代版本. **映射** 选项卡可用于此:

source: Select the resource to be remapped, then add some alternatives for each locale.
zh_cn: 选择需要重映射的资源, 并指定它在其他语言地区的替代方案.

source: Converting keys to text
es: Conversión de claves a texto
zh_cn: 将键转换为文本

source: Some controls, such as :ref:`Button <class_Button>` and :ref:`Label <class_Label>`, will automatically fetch a translation if their text matches a translation key. For example, if a label's text is "MAIN_SCREEN_GREETING1" and that key exists in the current translation, then the text will automatically be translated.
zh_cn: 一些控件, 例如 :ref:`Button <class_Button>` 和 :ref:`Label <class_Label>`, 如果它们的文本与一个翻译键值相匹配, 将自动获取翻译内容. 例如, 如果一个标签的文本是 "MAIN_SCREEN_GREETING1" 并且该键值存在于当前的翻译中, 那么该文本将被自动翻译.

source: This automatic translation behavior may be undesirable in certain cases. For instance, when using a Label to display a player's name, you most likely don't want the player's name to be translated if it matches a translation key. To disable automatic translation on a specific node, use :ref:`Object.set_message_translation<class_Object_method_set_message_translation>` and send a :ref:`Object.notification<class_Object_method_notification>` to update the translation::
zh_cn: 这种自动翻译行为在某些情况下可能是不可取的。例如，当使用Label来显示玩家的名字时，如果玩家的名字与翻译键相匹配，你很可能不希望它被翻译。要禁用特定节点的自动翻译，请使用 :ref:`Object.set_message_translation<class_Object_method_set_message_translation>` 并发送 :ref:`Object.notification<class_Object_method_notification>` 来更新翻译::

source: For more complex UI nodes such as OptionButtons, you may have to use this instead::
zh_cn: 对于更复杂的UI节点，如OptionButtons，你可能要用这个代替::

source: In code, the :ref:`Object.tr() <class_Object_method_tr>` function can be used. This will just look up the text in the translations and convert it if found:
zh_cn: 在代码中, 可以使用 :ref:`Object.tr() <class_Object_method_tr>` 函数. 这将只是在翻译中查找文本, 如果找到的话就进行转换:

source: Making controls resizable
es: Redimensionar los controles
zh_cn: 使控件可调整大小

source: The same text in different languages can vary greatly in length. For this, make sure to read the tutorial on :ref:`doc_size_and_anchors`, as dynamically adjusting control sizes may help. :ref:`Container <class_Container>` can be useful, as well as the text wrapping options available in :ref:`Label <class_Label>`.
zh_cn: 不同语言的相同文本的长度差异很大. 为此, 请务必阅读以下教程 :ref:`doc_size_and_anchors` , 因为动态调整控件大小可能有所帮助. :ref:`Container <class_Container>` 可能很有用, 以及 :ref:`Label <class_Label>` 的文本包选项.

source: TranslationServer
zh_cn: TranslationServer类

source: Godot has a server handling low-level translation management called the :ref:`TranslationServer <class_TranslationServer>`. Translations can be added or removed during run-time; the current language can also be changed at run-time.
zh_cn: Godot有一个处理低级翻译管理的服务器, 名为 :ref:`TranslationServer <class_TranslationServer>` . 可以在运行时添加或删除翻译; 当前语言也可以在运行时更改.

source: Command line
es: Línea de comandos
zh_cn: 命令行

source: Language can be tested when running Godot from the command line. For example, to test a game in French, the following argument can be supplied:
zh_cn: 从命令行运行Godot时可以测试语言. 例如, 要使用法语测试游戏, 可以提供以下参数:

source: Translating the project name
es: Traducir el nombre del proyecto
zh_cn: 翻译项目名称

source: The project name becomes the app name when exporting to different operating systems and platforms. To specify the project name in more than one language, create a new setting ``application/name`` in the **Project Settings** and append the locale identifier to it. For instance, for Spanish, this would be ``application/name_es``:
zh_cn: 导出到不同的操作系统和平台时, 项目名称将成为应用程序名称. 要以多种语言指定项目名称, 请在 **项目设置** 中创建一个新设置 ``application / name`` , 并将语言环境标识符附加到其中. 例如, 对于西班牙语, 这将是 ``application / name_es`` :

source: If you are unsure about the language code to use, refer to the :ref:`list of locale codes <doc_locales>`.
zh_cn: 如果您不确定要使用的语言代码, 请参阅 :ref:`list of locale codes <doc_locales>` .

source: Sería excelente que el mundo hablara solo un idioma. Unfortunately for us developers, that is not the case. While not generally a big requirement when developing indie or niche games, it is also common that games going into a more massive market require localization.
es: Sería excelente que el mundo hablara solo un idioma. Desafortunadamente para nosotros los desarrolladores, ese no es el caso. Aunque generalmente no es un gran requisito a la hora de desarrollar juegos independientes o de nicho, también es común que los juegos que entran en un mercado más masivo requieran localización.

source: Godot offers many tools to make this process more straightforward, so this tutorial is more like a collection of tips and tricks.
es: Godot ofrece muchas herramientas para hacer este proceso más sencillo, por lo que este tutorial es más como una colección de consejos y trucos.

source: Localization is usually done by specific studios hired for the job and, despite the huge amount of software and file formats available for this, the most common way to do localization to this day is still with spreadsheets. The process of creating the spreadsheets and importing them is already covered in the :ref:`doc_importing_translations` tutorial, so this one could be seen more like a follow up to that one.
es: La localización suele ser realizada por estudios específicos contratados para el trabajo y, a pesar de la gran cantidad de software y formatos de archivo disponibles para ello, la forma más común de realizar la localización hasta el día de hoy sigue siendo con hojas de cálculo. El proceso de crear las hojas de cálculo e importarlas ya está cubierto en el tutorial :ref:`doc_importing_translations`, por lo que éste podría verse más como un seguimiento del mismo.

source: We would be using the offical demo as an example, you can download it in the AssetLib: https://godotengine.org/asset-library/asset/134 or find it in the demo_projects/gui/translation
es: Estaríamos usando la demo oficial como ejemplo, puedes descargarla en el AssetLib: https://godotengine.org/asset-library/asset/134 or find it in the demo_projects/gui/translation

source: The translations can get updated and re-imported when they change, but they still have to be added to the project. This is done in Project > Project Settings > Localization:
es: Las traducciones pueden ser actualizadas y reimportadas cuando cambian, pero todavía tienen que ser añadidas al proyecto. Esto se hace en Proyecto > Ajustes del proyecto > Traducciones:

source: This dialog allows to add or remove translations project-wide.
es: Este cuadro de diálogo permite añadir o eliminar traducciones en todo el proyecto.

source: It is also possible to instruct Godot to open alternative versions of assets (resources) depending on the current language. For this the "Remaps" tab exists:
es: También es posible instruir a Godot para que abra versiones alternativas de assets (recursos) dependiendo del idioma actual. Para ello existe la pestaña "Remapeos":

source: Select the resource to be remapped, and the alternatives for each locale.
es: Selecciona el recurso a ser remapeado, y las alternativas para cada localización.

source: Some controls such as :ref:`Button <class_Button>`, :ref:`Label <class_Label>`, etc. will automatically fetch a translation each time they are set a key instead of a text. For example, if a label is assigned "MAIN_SCREEN_GREETING1" and a key to different languages exists in the translations, this will be automatically converted.
es: Algunos controles como :ref:`Button <class_Button>`, :ref:`Label <class_Label>`, etc. obtendrán automáticamente una traducción cada vez que se establezca una clave en lugar de un texto. Por ejemplo, si se asigna una etiqueta "MAIN_SCREEN_GREETING1" y existe una clave para diferentes idiomas en las traducciones, ésta se convertirá automáticamente.

source: For code, the :ref:`Object.tr() <class_Object_tr>` function can be used. This will just look-up the text into the translations and convert it if found:
es: Para código, se puede utilizar la función :ref:`Object.tr() <class_Object_tr>`. Esto simplemente buscará el texto en las traducciones y lo convertirá si lo encuentra:

source: The same text in different languages can vary greatly in length. For this, make sure to read the tutorial on :ref:`doc_size_and_anchors`, as having dynamically adjusted control sizes may help. :ref:`Container <class_Container>` can be useful, as well as the multiple options in :ref:`Label <class_Label>` for text wrapping.
es: El mismo texto en diferentes idiomas puede variar mucho en longitud. Por este motivo, asegúrate de leer el tutorial sobre :ref:`doc_size_and_anchors`, ya que puede ser útil tener tamaños de control ajustados dinámicamente. `Ref:`Container <class_Container>`, así como las múltiples opciones en :ref:`Label <class_Label>` para el ajuste del texto.

source: Godot has a server for handling the low level translation management called the :ref:`TranslationServer <class_TranslationServer>`. Translations can be added or removed during run-time, and the current language be changed too.
es: Godot dispone de un servidor para la gestión de traducciones de bajo nivel llamado :ref:`TranslationServer <class_TranslationServer>`. Las traducciones pueden agregarse o eliminarse durante el tiempo de ejecución, y también se puede cambiar el idioma actual.

source: Language can be tested when running Godot from command line. For example, to test a game in french, the following arguments can be supplied:
es: El lenguaje puede ser probado cuando se ejecuta Godot desde la línea de comandos. Por ejemplo, para probar un juego en francés, se pueden proporcionar los siguientes argumentos:

source: The project name becomes the app name when exporting to different operating systems and platforms. To specify the project name in more than one language, create a new setting application/name in the project settings dialog and append the locale identifier to it. For example:
es: El nombre del proyecto se convierte en el nombre de la aplicación cuando se exporta a diferentes sistemas operativos y plataformas. Para especificar el nombre del proyecto en más de un idioma, crea un nuevo ajuste application/name en el diálogo de ajustes del proyecto y añádele el identificador de localización. Por ejemplo:

source: As always, If you don't know the code of a language or zone, :ref:`check the list <doc_locales>`.
es: Como siempre, si no conoces el código de un idioma o zona, :ref:`verifica la lista <doc_locales>`.
