Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/localization_using_gettext.po
Languages: pt_br, zh_cn

source: Localization using gettext
zh_cn: 使用gettext进行本地化

source: In addition to :ref:`doc_importing_translations` in CSV format, Godot also supports loading translation files written in the GNU gettext (``.po``) format.
pt_br: Em adição a :ref:`doc_importing_translations` em formato CSV, Godot também suporta carregar arquivos de tradução escritos no formato GNU gettext (``.po``).
zh_cn: 除了csv格式的 :ref:`Doc_Importing_Translations` 外,Godot还支持加载GNU gettext(``.po``)格式的翻译文件.

source: For an introduction to gettext, check out `A Quick Gettext Tutorial <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_. It's written with C projects in mind, but much of the advice also applies to Godot (with the exception of ``xgettext``).
pt_br: Para obter uma introdução ao gettext, consulte `A Quick Gettext Tutorial <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_. Ele foi escrito com projetos em C em mente, mas muitos dos conselhos também se aplicam ao Godot (com exceção de ``xgettext``).
zh_cn: 有关GetText的介绍, 请查看 `A Quick GetText Tutorial<https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_ . 它是在考虑C项目的情况下编写的, 但是很多建议也适用于Godot(除了 ``xgettext`` ).

source: Advantages
pt_br: Vantagens
zh_cn: 优势

source: gettext is a standard format, which can be edited using any text editor or GUI editors such as `Poedit <https://poedit.net/>`_.
pt_br: gettext é um formato padrão, que pode ser editado usando qualquer editor de texto ou editores de GUI como `Poedit <https://poedit.net/>`_.
zh_cn: GetText是一种标准格式, 可以使用任何文本编辑器或图形用户界面编辑器(如 `Poedit<https://poedit.net/>`_ .)进行编辑.

source: gettext is supported by translation platforms such as `Transifex <https://www.transifex.com/>`_ and `Weblate <https://weblate.org/>`_, which makes it easier for people to collaborate to localization.
pt_br: gettext é suportado por plataformas de tradução como `Transifex <https://www.transifex.com/>`_ e `Weblate <https://weblate.org/>`_, o que torna mais fácil para as pessoas colaborarem na localização.
zh_cn: 翻译平台支持GetText, 如 `Tranapfex<https://www.transifex.com/>`_ 和 `Weblate<https://weblate.org/>`_ , 使得人们协作本地化变得更容易.

source: Compared to CSV, gettext works better with version control systems like Git, as each locale has its own messages file.
pt_br: Comparado ao CSV, gettext funciona melhor com sistemas de controle de versão como Git, já que cada locale tem seu próprio arquivo de mensagens.
zh_cn: 与CSV相比,gettext更适合Git这样的版本控制系统, 因为每个语言环境都有自己的消息文件.

source: Multiline strings are more convenient to edit in gettext files compared to CSV files.
pt_br: Strings multilinhas são mais convenientes para editar em arquivos gettext em comparação com arquivos CSV.
zh_cn: 与CSV文件相比, 在gettext文件中编辑多行字符串更方便.

source: Disadvantages
pt_br: Desvantagens
zh_cn: 缺点

source: gettext is a more complex format than CSV and can be harder to grasp for people new to software localization.
pt_br: gettext é um formato mais complexo do que o CSV e pode ser mais difícil de entender para quem não conhece localização de software.
zh_cn: Gettext是一种比CSV更复杂的格式, 对于刚接触软件本地化的人来说可能更难理解.

source: People who maintain localization files will have to install gettext tools on their system. However, as Godot doesn't use compiled message object files (``.mo``), translators can test their work without having to install gettext tools.
pt_br: Pessoas que mantêm arquivos de localização terão que instalar ferramentas gettext em seus sistemas. No entanto, como o Godot não usa arquivos de objeto de mensagem compilados (``.mo``), os tradutores podem testar seu trabalho sem ter que instalar ferramentas gettext.
zh_cn: 维护本地化文件的人员必须在其系统上安装gettext工具. 但是, 由于Godot不使用编译的消息对象文件(``.mo``), 因此翻译人员无需安装gettext工具即可测试他们的工作.

source: Caveats
pt_br: Ressalvas
zh_cn: 注意事项

source: As Godot uses its own PO file parser behind the scenes (which is more limited than the reference GNU gettext implementation), some features such as pluralization aren't supported.
pt_br: Como o Godot usa seu próprio analisador de arquivo PO nos bastidores (que é mais limitado do que a implementação GNU gettext de referência), alguns recursos como pluralização não são suportados.
zh_cn: 由于Godot在幕后使用自己的PO文件解析器(这比参考GNU gettext实现有更多限制), 因此不支持诸如多元化之类的一些特性.

source: Installing gettext tools
pt_br: Instalando ferramentas gettext
zh_cn: 安装gettext工具

source: The command line gettext tools are required to perform maintenance operations, such as updating message files. Therefore, it's strongly recommended to install them.
pt_br: As ferramentas gettext de linha de comando são necessárias para executar operações de manutenção, como atualizar arquivos de mensagens. Portanto, é altamente recomendável instalá-las.
zh_cn: 需要命令行gettext工具来执行维护操作, 如更新消息文件. 因此, 强烈建议您安装它们.

source: **Windows:** Download an installer from `this page <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_. Any architecture and binary type (shared or static) works; if in doubt, choose the 64-bit static installer.
pt_br: **Windows:** Baixe um instalador a partir `desta página <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_. Qualquer arquitetura e tipo binário (compartilhado ou estático) funciona; em caso de dúvida, escolha o instalador estático de 64 bits.
zh_cn: **windows:** 从 `本页 <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_ . 下载安装程序任何体系结构和二进制类型(共享或静态)都可以工作；如果有疑问, 请选择64位静态安装程序.

source: **macOS:** Install gettext either using `Homebrew <https://brew.sh/>`_ with the ``brew install gettext`` command, or using `MacPorts <https://www.macports.org/>`_ with the ``sudo port install gettext`` command.
zh_cn: **macOS:** 使用 `Homebrew <https://brew.sh/>`_ 和 ``brew install gettext`` 命令来安装gettext，或使用 `MacPorts <https://www.macports.org/>`_ 和 ``sudo port install gettext`` 命令来安装。

source: **Linux:** On most distributions, install the ``gettext`` package from your distribution's package manager.
pt_br: **Linux:** Na maioria das distribuições, instale o pacote ``gettext`` do gerenciador de pacotes de sua distribuição.
zh_cn: **Linux:** 在大多数发行版上, 请从发行版的包管理器安装 ``gettext`` 包.

source: Creating the PO template (POT) manually
pt_br: Criando o modelo PO (POT) manualmente
zh_cn: 手动创建(POT)模板

source: Godot currently doesn't support extracting source strings using ``xgettext``, so the ``.pot`` file must be created manually. This file can be placed anywhere in the project directory, but it's recommended to keep it in a subdirectory, as each locale will be defined in its own file.
pt_br: O Godot atualmente não suporta a extração de strings de origem usando ``xgettext``, então o arquivo ``.pot`` deve ser criado manualmente. Este arquivo pode ser colocado em qualquer lugar do diretório do projeto, mas recomenda-se mantê-lo em um subdiretório, pois cada local será definido em seu próprio arquivo.
zh_cn: Godot目前不支持使用 ``xgettext`` 提取源字符串, 因此必须手动创建 ``.pot`` 文件. 该文件可以放在项目目录中的任何位置, 但建议将其放在子目录中, 因为每个语言环境都将在其自己的文件中定义.

source: Create a directory named `locale` in the project directory. In this directory, save a file named ``messages.pot`` with the following contents:
pt_br: Crie um diretório chamado `locale` no diretório do projeto. Neste diretório, salve um arquivo denominado ``messages.pot`` com o seguinte conteúdo:
zh_cn: 在工程目录下创建名为 `locale` 的目录. 在该目录下, 保存一个名为 ``messages.pot`` 的文件, 内容如下:

source: Messages in gettext are made of ``msgid`` and ``msgstr`` pairs. ``msgid`` is the source string (usually in English), ``msgstr`` will be the translated string.
pt_br: Mensagens em gettext são feitas de pares ``msgid`` e ``msgstr``. ``msgid`` é a string fonte (geralmente em inglês), ``msgstr`` será a string traduzida.
zh_cn: Gettext中的消息由 ``msgid`` 和 ``msgstr`` 对组成.``msgid`` 为源字符串(一般为英文),``msgstr`` 为翻译后的字符串.

source: The ``msgstr`` value in PO template files (``.pot``) should **always** be empty. Localization will be done in the generated ``.po`` files instead.
pt_br: O valor ``msgstr`` em arquivos de modelo PO (``.pot``) deve **sempre** estar vazio. A localização será feita nos arquivos ``.po`` gerados.
zh_cn: PO模板文件( ``.pot`` )中的 ``msgstr`` 值应 **始终** 为空. 而是在生成的 ``.po`` 文件中进行本地化.

source: Creating the PO template (POT) using pybabel
pt_br: Criando o modelo PO (POT) usando pybabel
zh_cn: 使用pybabel创建PO模板 (POT)

source: The Python tool pybabel has support for Godot and can be used to automatically create and update the POT file from your scene files and scripts.
pt_br: A ferramenta Python pybabel tem suporte para Godot e pode ser usada para criar e atualizar automaticamente o arquivo POT de seus arquivos de cena e scripts.
zh_cn: Python工具pybabel支持Godot, 可用于从场景文件和脚本自动创建和更新POT文件.

source: After installing ``babel`` and ``babel-godot``, for example using pip:
pt_br: Depois de instalar ``babel`` e ``babel-godot``, por exemplo, usando pip:
zh_cn: 安装 ``Babel`` 和 ``babel-godot`` 后, 例如使用pip:

source: Write a mapping file (for example ``babelrc``) which will indicate which files pybabel needs to process (note that we process GDScript as Python, which is generally sufficient):
pt_br: Escreva um arquivo de mapeamento (por exemplo ``babelrc``) que indicará quais arquivos pybabel precisa processar (observe que processamos GDScript como Python, o que geralmente é suficiente):
zh_cn: 编写一个映射文件(例如 ``Babelrc``), 指明pybabel需要处理哪些文件(请注意, 我们将GDScript作为Python处理, 这通常就足够了):

source: You can then run pybabel like so:
pt_br: Você pode então executar o pybabel assim:
zh_cn: 然后, 您可以运行pybabel, 如下所示:

source: Use the ``-k`` option to specify what needs to be extracted. In this case, arguments to :ref:`tr() <class_Object_method_tr>` will be translated, as well as properties named "text" (commonly used by Control nodes) and LineEdit's "placeholder_text" property.
pt_br: Use a opção ``-k`` para especificar o que precisa ser extraído. Neste caso, os argumentos para :ref:`tr() <class_Object_method_tr>` serão traduzidos, assim como as propriedades chamadas "text" (comumente usadas pelos nós de Controle) e a propriedade "placeholder_text" do LineEdit.
zh_cn: 使用 ``-k`` 选项指定需要提取的内容. 在这种情况下, 将翻译 :ref:`tr()<class_object_method_tr>` 的参数, 以及名为 "text"(控制节点常用)的属性和LineEdit的 ``placeholder_text`` 属性.

source: Creating a messages file from a PO template
pt_br: Criando um arquivo de mensagens a partir de um modelo PO
zh_cn: 从PO模板创建消息文件

source: The ``msginit`` command is used to turn a PO template into a messages file. For instance, to create a French localization file, use the following command while in the ``locale`` directory:
pt_br: O comando ``msginit`` é usado para transformar um modelo PO em um arquivo de mensagens. Por exemplo, para criar um arquivo de localização em francês, use o seguinte comando enquanto estiver no diretório ``locale``:
zh_cn: ``msginit`` 命令用于将采购订单模板转换为消息文件. 例如, 要创建法语本地化文件, 请在 ``locale`` 目录中使用以下命令:

source: The command above will create a file named ``fr.po`` in the same directory as the PO template.
pt_br: O comando acima criará um arquivo chamado ``fr.po`` no mesmo diretório do modelo PO.
zh_cn: 上面的命令会在采购订单模板所在的目录下创建一个名为 ``fr.po`` 的文件.

source: Alternatively, you can do that graphically using Poedit, or by uploading the POT file to your web platform of choice.
pt_br: Alternativamente, você pode fazer isso graficamente usando o Poedit ou enviando o arquivo POT para a plataforma web de sua escolha.
zh_cn: 或者, 您可以使用Poedit以图形方式完成此操作, 或者通过将POT文件上传到您选择的Web平台.

source: Loading a messages file in Godot
pt_br: Carregando um arquivo de mensagens no Godot
zh_cn: 在Godot中加载信息文件

source: To register a messages file as a translation in a project, open the **Project Settings**, then go to the **Localization** tab. In **Translations**, click **Add…** then choose the ``.po`` file in the file dialog. The locale will be inferred from the ``"Language: <code>\n"`` property in the messages file.
pt_br: Para registrar um arquivo de mensagens como uma tradução em um projeto, abra as **Configurações do Projeto** e vá para a aba **Localização**. Em **Traduções**, clique em **Adicionar…** e escolha o arquivo ``.po`` na caixa de diálogo do arquivo. O locale será inferido da propriedade ``"Language: <code>\n"`` no arquivo de mensagens.
zh_cn: 若要在工程中将消息文件注册为翻转, 请打开 **Project Settings工程设置** , 然后进入 **Localization本地化** 选项. 在 **Translations翻转** , 单击**Add…* 添加* 然后在文件对话框中选择 ``.po`` 文件 区域设置将从消息文件中的``"Language: <code>\n"`` 属性中推算出来.

source: See :ref:`doc_internationalizing_games` for more information on importing and testing translations in Godot.
pt_br: Veja :ref:`doc_internationalizing_games` para mais informações sobre como importar e testar traduções no Godot.
zh_cn: 关于在Godot中导入和测试翻译的更多信息, 请参见 :ref:`doc_internationalizing_games` .

source: Updating message files to follow the PO template
pt_br: Atualizando arquivos de mensagem para seguir o modelo PO
zh_cn: 消息更新文件遵循PO模板

source: If you want to keep a backup of the original message file (which would be saved as ``fr.po~`` in this example), remove the ``--backup=none`` argument.
pt_br: Se você deseja manter um backup do arquivo da mensagem original (que seria salvo como ``fr.po~`` neste exemplo), remova o argumento ``--backup=none``.
zh_cn: 如果你想保留原始消息文件的备份，在本例中会保存为 ``fr.po~`` ，请删除 ``--backup=none`` 参数。

source: Checking the validity of a PO file or template
pt_br: Verificando a validade de um arquivo ou modelo PO
zh_cn: 检查PO文件或模板的有效性

source: It is possible to check whether a gettext file's syntax is valid by running the command below:
pt_br: É possível verificar se a sintaxe de um arquivo gettext é válida executando o comando abaixo:
zh_cn: 可以通过运行以下命令来检查gettext文件的语法是否有效:

source: If there are syntax errors or warnings, they will be displayed in the console. Otherwise, ``msgfmt`` won't output anything.
pt_br: Se houver erros de sintaxe ou avisos, eles serão exibidos no console. Caso contrário, ``msgfmt`` não exibirá nada.
zh_cn: 如果有语法错误或警告, 他们将显示在控制台, 否则,"msgfmt" 不会输出任何东西.
