Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/docs_changelog.po
Languages: fr, ko, pl, ru, zh_cn

source: Documentation changelog
fr: Changelog de la documentation
ko: 문서 변경 내역
pl: Dziennik zmian w dokumentacji
ru: История изменений документации
zh_cn: 文档的更改记录

source: The documentation is continually being improved. The release of version 3.1 includes many new tutorials, many fixes and updates for old tutorials, and many updates to the class reference. Below is a list of new tutorials added since version 3.0.
fr: La documentation est continuellement en cours d'amélioration. La sortie de la version 3.1 comprend de nombreux nouveaux tutoriels, de nombreuses corrections et mises à jour pour les anciens tutoriels, ainsi que de nombreuses mises à jour de class reference. Ci-dessous, une liste des nouveaux tutoriels ajoutés depuis la version 3.0.
ko: 문서는 지속적으로 개선되고 있습니다. 3.1 버전 출시에는 많은 새로운 튜토리얼, 과거 튜토리얼에서 개선된 사항들, 그리고 많은 클래스 참조에 대한 업데이트가 있습니다. 다음은 3.0 버전에서 추가된 새 튜토리얼 목록입니다.
pl: Dokumentacja jest wciąż ulepszana. Wydanie wersji 3.1 zawiera wiele nowych poradników a stare poradniki oraz odnośniki klas zostały odświeżone i poprawione. Poniżej możesz zobaczyć listę nowych poradników dodanych od wersji 3.0.
ru: Документация постоянно совершенствуется. Релиз версии 3.1 включает в себя множество новых обучающих разделов, множество исправлений и обновлений для старых обучающих разделов, а также множество обновлений справочника классов. Ниже приведен список новых учебных разделов, добавленных в версии 3.0.
zh_cn: 文档持续更新。自从3.1版本发布以来，包含许多新版教程，旧版教程的修改与更新，以及对类引用的许多更新。以下是自3.0版本以来添加的新教程列表。

source: This document only contains new tutorials so not all changes are reflected, many tutorials have been substantially updated but are not reflected in this document.
fr: Ce document ne contient que les nouveaux tutoriels, il ne reflète pas l'étendue des changements; de nombreux tutoriels ont été mis à jour de façon substantielle mais ne sont pas listés dans ce document.
ko: 이 문서에는 새로운 튜토리얼만 포함되어 있기 때문에 변경사항이 반영되지 않습니다, 많은 튜토리얼이 업데이트되지만 이 문서에는 반영되지 않습니다.
pl: Poniższy dokument zawiera tylko nowe poradniki, więc nie wszystkie zmiany są odzwierciedlone, wiele poradników jest intensywnie aktualizowana jednak nie zostały one wspomniane w tym dokumencie.
ru: Этот документ содержит только новые руководства, многие руководства были существенно обновлены, но не вошли в этот документ.
zh_cn: 本文档仅包含新教程，因此并未反映所有更改，许多教程已经大幅更新，但没有在本文档中体现出来。

source: New tutorials since version 3.0
fr: Nouveaux tutoriels depuis la version 3.0
ko: 3.0 버전 이후의 새로운 튜토리얼
pl: Nowe poradniki wprowadzone po wersji 3.0
ru: Новые руководства, начиная с версии 3.0
zh_cn: 自3.0版本以来的新教程

source: Step-by-step
fr: Pas à pas
ko: 단계별
pl: Krok po kroku
ru: Пошаговое обучение
zh_cn: 逐步教程

source: :ref:`Signals <doc_signals>`
fr: :ref:`Signaux <doc_signals>`
ko: :ref:`시그널 <doc_signals>`
pl: :ref:`Sygnały <class_sygnały>`
ru: :ref:`Сигналы <doc_signals>`
zh_cn: :参考:‘信号<文档_信号>’

source: :ref:`Exporting <doc_exporting>`
fr: :ref:`Exporter <doc_exporting>`
ko: :ref:`내보내기 <doc_exporting>`
pl: :ref:`Eksportowanie <class_exportowanie>`
ru: :ref:`Экспорт <doc_exporting>`
zh_cn: :参考:`导出<文档_导出>’

source: Project workflow
fr: Gestion de projet
ko: 프로젝트 워크플로
pl: Workflow projektu
ru: Рабочий процесс проекта
zh_cn: 项目工作流程

source: Best Practices:
fr: Les Meilleures Pratiques :
ko: 모범 사례:
pl: Dobre praktyki:
ru: Лучшие практики:
zh_cn: 最佳实践：

source: :ref:`Introduction <doc_introduction_best_practices>`
ko: :ref:`소개 <doc_introduction_best_practices>`
pl: :ref:`Wprowadzenie <doc_introduction_best_practices>`
ru: :ref:`Введение <doc_introduction_best_practices>`
zh_cn: :参考:`简介<文档_简介_最佳实践>’

source: :ref:`What are Godot classes <doc_what_are_godot_classes>`
fr: :ref:`Que sont les Classes Godot <doc_what_are_godot_classes>`
ko: :ref:`Godot 클래스란 무엇입니까 <doc_what_are_godot_classes>`
pl: :ref:`Czym są klasy Godot <doc_what_are_godot_classes>`
ru: :ref:`Что такое Godot классы <doc_what_are_godot_classes>`
zh_cn: :参考:`什么是Godot类<文档_什么是Godot类>’

source: :ref:`Scene organization <doc_scene_organization>`
fr: :ref:`Organisation des Scènes <doc_scene_organization>`
ko: :ref:`씬 조직 <doc_scene_organization>`
pl: :ref:`Organizacja sceny <doc_scene_organization>`
zh_cn: :参考:`场景结构 <文档_场景结构>’

source: :ref:`Scenes versus scripts <doc_scenes_versus_scripts>`
fr: :ref:`Scènes VS scripts <doc_scenes_versus_scripts>`
ko: :ref:`씬 vs 스크립트 <doc_scenes_versus_scripts>`
pl: :ref:`Sceny kontra skrypty <doc_scenes_versus_scripts>`
ru: :ref:`Зависимость сцен от скриптов <doc_scenes_versus_scripts>`
zh_cn: :参考:`场景与脚本<文档_场景与脚本>’

source: :ref:`Autoloads versus internal nodes <doc_autoloads_versus_internal_nodes>`
fr: :ref:`Chargements automatiques VS nœuds internes <doc_autoloads_versus_internal_nodes>`
ko: :ref:`오토로드 vs 내장 노드 <doc_autoloads_versus_internal_nodes>`
pl: :ref:`Automatyczne ładowanie kontra węzły wewnętrzne <doc_autoloads_versus_internal_nodes>`
ru: :ref:`Автозагрузка против внутренних узлов <doc_autoloads_versus_internal_nodes>`
zh_cn: :参考:`自动加载与内部节点<文档_自动加载与内部节点>’

source: :ref:`Node alternatives <doc_node_alternatives>`
ko: :ref:`노드 대안 <doc_node_alternatives>`
pl: :ref:`Alternatywy węzłów <doc_node_alternatives>`
ru: :ref:`Альтернативы узлам <doc_node_alternatives>`
zh_cn: :参考:`节点备选方案<文档_节点备选方案>`

source: :ref:`Godot interfaces <doc_godot_interfaces>`
fr: :ref:`Interfaces de Godot <doc_godot_interfaces>`
ko: :ref:`Godot 인터페이스 <doc_godot_interfaces>`
pl: :ref:`Interfejs Godota <doc_godot_interfaces>`
ru: Интерфейсы Godot
zh_cn: :参考:`Godot接口<文档_godot接口>’

source: :ref:`Godot notifications <doc_godot_notifications>`
fr: :ref:`Notifications de Godot <doc_godot_notifications>`
ko: :ref:`Godot 알림 <doc_godot_notifications>`
pl: :ref:`Powiadomienia Godota <doc_godot_notifications>`
ru: :ref:`Godot оповещения <doc_animations>`
zh_cn: :参考:`Godot通知<文档_godot通知>’

source: :ref:`Data preferences <doc_data_preferences>`
fr: :ref:`Préférences des données <doc_data_preferences>`
ko: :ref:`데이터 환경 설정 <doc_data_preferences>`
pl: :ref:`Preferencje danych <doc_data_preferences>`
ru: :ref:`Настройки данных <doc_data_preferences>`
zh_cn: :参考:`数据首选项<文档_数据首选项>’

source: :ref:`Logic preferences <doc_logic_preferences>`
fr: :ref:`Préférences des logiques <doc_logic_preferences>`
ko: :ref:`논리 환경 설정 <doc_logic_preferences>`
pl: :ref:`Preferencje logiki <doc_logic_preferences>`
ru: :ref:`Настройки логики <doc_logic_preferences>`
zh_cn: :参考:`逻辑首选项<文档_逻辑首选项>’

source: Scripting
fr: Les scripts
ko: 스크립팅(Scripting)
pl: Skrypty
ru: Написание скриптов
zh_cn: 编写脚本

source: :ref:`Typed GDscript <doc_gdscript_static_typing>`
fr: :ref:`GDscript Dactylographié <doc_gdscript_static_typing>`
ko: :ref:`타입 GDscript <doc_gdscript_builtin_types>`
pl: :ref:`Typowanie silne w GDscript <doc_gdscript_static_typing>`
ru: :ref:`Типизированный GDscript <doc_gdscript_static_typing>`
zh_cn: :参考:`GDscript类型<文档_GDScript中静态类型>’

source: 2D
zh_cn: 二维

source: :ref:`2D lights and shadows <doc_2d_lights_and_shadows>`
fr: :ref:`Lumières 2D et ombres <doc_2d_lights_and_shadows>`
ko: :ref:`2D 빛과 그림자 <doc_2d_lights_and_shadows>`
pl: :ref:`Oświetlenie i cienie 2D <doc_2d_lights_and_shadows>`
ru: :ref:`2D освещение и тени <doc_2d_lights_and_shadows>`
zh_cn: :参考:`2D灯光与阴影<文档_2D灯光与阴影>’

source: :ref:`2D meshes <doc_2d_meshes>`
fr: :ref:`Mailles 2D <doc_2d_meshes>`
pl: :ref:`Kształty 2D <doc_2d_meshes>`
ru: :ref:`2D сетки <doc_2d_meshes>`
zh_cn: :参考:`2D网格<文档_2d网格>’

source: 3D
zh_cn: 三维

source: :ref:`CSG <doc_csg_tools>`
zh_cn: :参考:`CSG<文档_csg工具>’

source: :ref:`Animating thousands of fish with MultiMesh <doc_animating_thousands_of_fish>`
fr: :ref: `Animer des milliers de poissons avec MultiMesh <doc_animating_thousands_of_fish>`
ko: :ref:`MultiMesh로 수천개의 물고기를 움직이게 하기 <doc_animating_thousands_of_fish>`
pl: :ref:`Animowanie tysięcy ryb za pomocą MultiMesh <doc_animating_thousands_of_fish>`
ru: :ref:`Анимация тысячи рыб при помощи MultiMesh <doc_animating_thousands_of_fish>`
zh_cn: ：参考：`使用复合网格<文档_制作数千条鱼>制作数千条鱼的动画

source: :ref:`Controlling thousands of fish with Particles <doc_controlling_thousands_of_fish>`
fr: :ref:`Contrôler des milliers de poissons avec des Particules <doc_controlling_thousands_of_fish>`
ko: :ref:`Particle로 수천개의 물고기를 움직이게 하기 <doc_controlling_thousands_of_fish>`
pl: :ref:`Kontrolowanie tysięcy ryb za pomocą cząsteczek <doc_controlling_thousands_of_fish>`
ru: :ref:`Управление тысячами рыб с помощью Particles <doc_controlling_thousands_of_fish>`
zh_cn: :参考:`使用粒子系统控制数千条鱼<文档_控制数千条鱼>`

source: Physics
fr: Physique
ko: 물리
pl: Fizyka
ru: Физика
zh_cn: 物理学

source: :ref:`Ragdoll system <doc_ragdoll_system>`
fr: :ref:`Système de ragdoll <doc_ragdoll_system>`
ko: :ref:`래그돌 시스템 <doc_ragdoll_system>`
pl: :ref:`System Ragdolli <doc_ragdoll_system>`
ru: :ref:`Система Ragdoll <doc_ragdoll_system>`
zh_cn: :参考:`布娃娃系统<文档_布娃娃系统>`

source: :ref:`Softbody <doc_soft_body>`
ko: :ref:`소프트바디 <doc_soft_body>`
pl: :ref:`Ciało miękkie <doc_soft_body>`
ru: :ref:`Мягкое тело <doc_soft_body>`
zh_cn: :参考:`软体<文档_软体>’

source: Animation
ko: 애니메이션
pl: Animacje
ru: Анимация
zh_cn: 动画

source: :ref:`2D skeletons <doc_2d_skeletons>`
fr: :ref:`Squelettes 2D <doc_2d_skeletons>`
ko: :ref:`2D 스켈레톤 <doc_2d_skeletons>`
pl: :ref:`Szkielety 2D <doc_2d_skeletons>`
ru: :ref:`2D скелеты <doc_2d_skeletons>`
zh_cn: :参考:`2D骨骼<文档_2d骨骼>’

source: :ref:`AnimationTree <doc_animation_tree>`
fr: :ref:`Arbre d'Animations <doc_animations_tree>`
ko: :ref:`애니메이션 트리(AnimationTree) <doc_animation_tree>`
zh_cn: :参考:`动画树<文档_动画树>’

source: Viewports
fr: Vue d'écran
ko: 뷰포트
pl: Okno podglądu
ru: Окна просмотра
zh_cn: 视区

source: :ref:`Using a Viewport as a texture <doc_viewport_as_texture>`
fr: :ref:`Utiliser une Vue comme une texture <doc_viewport_as_texture>`
ko: :ref:`뷰포트를 텍스쳐로 사용하기 <doc_viewport_as_texture>`
pl: :ref:`Używanie Viewport jako tekstury <doc_viewport_as_texture>`
ru: :ref:`Использование Viewport в качестве текстуры <doc_viewport_as_texture>`
zh_cn: :参考:`使用视区作为纹理<文档_使用视区作为纹理>`

source: :ref:`Custom post-processing <doc_custom_postprocessing>`
fr: ref:`Post-traitement personnalisé <doc_custom_postprocessing>`
ko: :ref:`커스텀 포스트 프로세싱 <doc_custom_postprocessing>`
pl: :ref:`Dostosowany post-processing <doc_custom_postprocessing>`
ru: :ref:`Пользовательская пост-обработка <doc_custom_postprocessing>`
zh_cn: :参考:`自定义后期处理 <文档_自定义后期处理>’

source: Shading
fr: Ombres
ko: 셰이딩
pl: Shadery
ru: Затенение
zh_cn: 着色器

source: :ref:`Intro to shaders: 2D and 3D water (7 video tutorials) <doc_intro_to_shaders_water_workshop>`
fr: :ref:`Introduction aux shaders: Eau 2D et 3D (7 tutoriels vidéo) <doc_intro_to_shaders_water_workshop>`
ko: :ref:`셰이더 소개: 2D와 3D 물 (7개 비디오 튜토리얼) <doc_intro_to_shaders_water_workshop>`
pl: :ref:`Wprowadzenie do shaderów: Woda 2D i 3D (7 poradników filmowych) <doc_intro_to_shaders_water_workshop>`
ru: :ref:`Введение в шейдеры: 2D и 3D вода (7 видео уроков) <doc_intro_to_shaders_water_workshop>`
zh_cn: :参考:`着色器简介:2D和3D水(7节视频教程)<文档_着色器简介：水效果的研究>’

source: :ref:`Migrating to Godot’s shading language <doc_migrating_to_godot_shader_language>`
fr: :ref:`Migration vers le langage de Shader de Godot (Godot’s shading language) <doc_migrating_to_godot_shader_language>`
ko: :ref:`Godot의 셰이딩 언어로 이동하기 <doc_migrating_to_godot_shader_language>`
pl: :ref:`Migracja do języka cieniowania Godota <doc_migrating_to_godot_shader_language>`
ru: :ref:`Переход к языку шейдинга Godot <doc_migrating_to_godot_shader_language>`
zh_cn: :参考:`迁移到Godot的着色语言<文档_迁移到Godot的着色语言>’

source: :ref:`Advanced post-processing <doc_advanced_postprocessing>`
fr: :ref:`Post-traitement avancé <doc_advanced_postprocessing>`
ko: :ref:`고급 포스트 프로세싱 <doc_advanced_postprocessing>`
pl: :ref:`Zaawansowany post-processing <doc_advanced_postprocessing>`
ru: :ref:`Продвинутая пост-обработка <doc_advanced_postprocessing>`
zh_cn: :参考:`高级后期处理<文档_高级后期处理>`

source: Shading Reference:
fr: Référence de shading :
ko: 셰이딩 참조:
ru: Справка по шейдингу:
zh_cn: 着色参考：

source: :ref:`Shaders <doc_shaders>`
ko: :ref:`셰이더 <doc_shaders>`
pl: :ref:`Shadery <doc_shaders>`
ru: :ref:`Шейдеры <doc_shading_language>`
zh_cn: :参考:`着色器<文档_着色器>`

source: :ref:`Shading language <doc_shading_language>`
fr: :ref:`langage de shading <doc_shading_language>`
ko: :ref:`셰이딩 언어 <doc_shading_language>`
pl: :ref:`Język cieniowania <doc_shading_language>`
ru: :ref:`Язык шейдинга <doc_shading_language>`
zh_cn: :参考:`着色器语言<文档_着色器语言>`

source: :ref:`Spatial shaders <doc_spatial_shader>`
fr: :ref:`Shaders spatiaux <doc_spatial_shader>`
ko: :ref:`Spatial 셰이더 <doc_spatial_shader>`
pl: :ref:`Shadery przestrzenne <doc_spatial_shader>`
ru: :ref:`Пространственные шейдеры <doc_spatial_shader>`
zh_cn: :参考:`空间着色器<文档_空间着色器>`

source: :ref:`CanvasItem shaders <doc_canvas_item_shader>`
ko: :ref:`CanvasItem 셰이더 <doc_canvas_item_shader>`
zh_cn: :参考:`画布组件着色器<文档_画布组件着色器>`

source: :ref:`Particles shaders <doc_particle_shader>`
fr: :ref:`Shaders de particule <doc_particle_shader>`
ko: :ref:`Particle 셰이더 <doc_particle_shader>`
pl: :ref:`Shadery cząstek<doc_particle_shader>`
ru: :ref:`Точечные шейдеры <doc_particle_shader>`
zh_cn: :参考:`粒子着色器<文档_粒子着色器>`

source: VR
fr: Réalité virtuelle
zh_cn: 虚拟现实

source: :ref:`VR starter tutorial <doc_vr_starter_tutorial>`
fr: ref:`Tutoriel de démarrage VR <doc_vr_starter_tutorial>`
ko: :ref:`VR 초심자 튜토리얼 <doc_vr_starter_tutorial>`
pl: :ref:`Poradnik początków z VR <doc_vr_starter_tutorial>`
ru: :ref:`Первоначальное обучение VR <doc_vr_starter_tutorial>`
zh_cn: :参考:`虚拟现实入门教程<文档_虚拟现实入门教程>`

source: Platform-specific
fr: Spécifique à la plateforme
ko: 플랫폼 특화
pl: Specyficzny dla platformy
ru: Особенности разных платформ
zh_cn: 特定平台

source: :ref:`Customizing the Web export HTML page <doc_customizing_html5_shell>`
fr: :ref:`Personnaliser l'exportation Web de la page HTML <doc_customizing_html5_shell>`
ko: :ref:`웹 내보내기 HTML 페이지를 커스터마이징하기 <doc_customizing_html5_shell>`
pl: :ref:`Dostosowanie eksportu do strony sieciowej HTML <doc_customizing_html5_shell>`
ru: :ref:`Пользовательская настройка веб экспорта HTML страницы <doc_customizing_html5_shell>`
zh_cn: :参考:`自定义Web导出HTML页面<文档_自定义html5壳层>`

source: Multi-threading
fr: Le Multi-threading
ko: 멀티 스레딩(Multi-threading)
pl: Wielowątkowość
ru: Много-поточность
zh_cn: 多线程

source: :ref:`Thread safe APIs <doc_thread_safe_apis>`
ko: :ref:`스레드 안전 API <doc_thread_safe_apis>`
pl: :ref:`Wątkowo-bezpieczne API <doc_thread_safe_apis>`
zh_cn: :参考:`线程安全API<文档_线程安全API>`

source: Miscellaneous
fr: Divers
ko: 기타
pl: Różności
ru: Разное
zh_cn: 杂项

source: :ref:`Fixing jitter and stutter <doc_jitter_stutter>`
fr: :ref:`Réparer jitter et stutter <doc_jitter_stutter>`
ko: :ref:`불안정함과 끊김 현상 고치기 <doc_jitter_stutter>`
pl: :ref:`Naprawa drgań i migania <doc_jitter_stutter>`
ru: :ref:`Исправление джиттеров и задержек <doc_jitter_stutter>`
zh_cn: :参考:`修复抖动和时断时续<文档_抖动和时断时续>`

source: :ref:`Running code in the editor <doc_running_code_in_the_editor>`
fr: :ref:`Lancer le code dans l'éditeur <doc_running_code_in_the_editor>`
ko: :ref:`에디터에서 코드 실행하기 <doc_running_code_in_the_editor>`
pl: :ref:`Uruchamianie kodu w edytorze <doc_running_code_in_the_editor>`
ru: :ref:`Запуск кода в редакторе <doc_running_code_in_the_editor>`
zh_cn: :参考:`在编辑器中运行代码<文档_在编辑器中运行代码>`

source: :ref:`Change scenes manually <doc_change_scenes_manually>`
fr: :ref:`Changer les scènes manuellement <doc_change_scenes_manually>`
ko: :ref:`수동으로 씬 바꾸기 <doc_change_scenes_manually>`
pl: :ref:`Ręczna zmiana scen <doc_change_scenes_manually>`
ru: :ref:`Изменение сцен вручную <doc_change_scenes_manually>`
zh_cn: :参考:`手动更改场景<文档_手动更改场景>`

source: :ref:`Differences between GLES2 and GLES3 <doc_gles2_gles3_differences>`
fr: :ref:`Différences entre GLES2 et GLES3 <doc_gles2_gles3_differences>`
ko: :ref:`GLES2와 GLES3 간의 차이 <doc_gles2_gles3_differences>`
pl: :ref:`Różnice pomiędzy GLES2 i GLES3 <doc_gles2_gles3_differences>`
ru: :ref:`Отличия между GLES3 и GLES3 <doc_gles2_gles3_differences>`
zh_cn: :参考:`GLES2和GLES3之间的差异<文档_GLES2和GLES3之间的差异>`

source: Compiling
fr: Compilation
ko: 컴파일링(Compiling)
pl: Kompilowanie
ru: Компиляция
zh_cn: 开始编译

source: :ref:`Optimizing a build for size <doc_optimizing_for_size>`
fr: :ref:`Optimisation d'un build pour la taille <doc_optimizing_for_size>`
ko: :ref:`크기에 맞게 빌드 최적화하기 <doc_optimizing_for_size>`
pl: :ref:`Optymalizacja rozmiaru projektu <doc_optimizing_for_size>`
zh_cn: :参考:`优化大小的构建<文档_优化大小>`

source: :ref:`Compiling with script encryption key <doc_compiling_with_script_encryption_key>`
fr: :ref:`Compiler avec un script de clé de cryptage <doc_compiling_with_script_encryption_key>`
ko: :ref:`스크립트 암호화 키로 컴파일하기 <doc_compiling_with_script_encryption_key>`
pl: :ref:`Kompilowanie z użyciem klucza szyfrowania skryptu<doc_compiling_with_script_encryption_key>`
ru: :ref:`Компиляция с ключом шифрования скрипта <doc_compiling_with_script_encryption_key>`
zh_cn: :参考:`使用脚本加密密钥编译<文档_使用脚本加密密钥编译>`

source: Engine development
fr: Développement du moteur
ko: 엔진 개발
pl: Rozwój silnika
ru: Разработка движка
zh_cn: 引擎开发

source: :ref:`Binding to external libraries <doc_binding_to_external_libraries>`
fr: :ref:`Lier aux librairies externes <doc_binding_to_external_libraries>`
ko: :ref:`외부 라이브러리에 봉제하기 <doc_binding_to_external_libraries>`
pl: :ref:`Dowiązania do zewnętrznych bibliotek <doc_binding_to_external_libraries>`
ru: :ref:`Привязка к внешним библиотекам <doc_external_editor>`
zh_cn: :参考:`绑定到外部库<文档_绑定到外部库>`

source: Creating content
fr: Création de contenu
ko: 콘텐츠 만들기
pl: Tworzenie zawartości
zh_cn: 创造内容

source: :ref:`Making trees <doc_making_trees>`
fr: ref:`Faire des arbres <doc_making_trees>`
ko: :ref:`나무 만들기 <doc_making_trees>`
pl: :ref:`Tworzenie drzew <doc_making_trees>`
ru: :ref:`Создание деревьев <doc_animations>`
zh_cn: :参考:`制作树<文档_制作树>`

source: Plugins
fr: Extensions
ko: 플러그인
pl: Wtyczki
ru: Плагины
zh_cn: 插件

source: :ref:`Making main screen plugins <doc_making_main_screen_plugins>`
fr: :ref:`Faire des plugins pour l'écran principal <doc_making_main_screen_plugins>`
ko: :ref:`메인 화면 플러그인 만들기<doc_making_main_screen_plugins>`
pl: :ref:`Tworzenie wtyczek ekranu głównego <doc_making_main_screen_plugins>`
ru: :ref:`Создание плагинов главного экрана <doc_making_main_screen_plugins>`
zh_cn: :参考:`制作主屏幕插件<文档_制作主屏幕插件>`

source: :ref:`Spatial gizmo plugins <doc_spatial_gizmo_plugins>`
ko: :ref:`Spatial 기즈모 플러그인 <doc_spatial_gizmo_plugins>`
ru: :ref:`Плагины для 3D-гизмо <doc_spatial_gizmo_plugins>`
zh_cn: :参考:`空间变换轴插件<文档_空间变换轴插件>`

source: :ref:`Vertex displacement with shaders <doc_vertex_displacement_with_shaders>`
ru: :ref:`Смещение вершин при помощи шейдеров <doc_vertex_displacement_with_shaders>`

source: GUI
fr: Interface graphique
