Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: el, ja, ko, pt_br, th, zh_cn

source: For user interfaces, use the :ref:`anchoring <doc_size_and_anchors>` to determine where controls should stay and move. If UIs are more complex, consider learning about Containers.
el: Για διεπαφές χρήστη, χρησιμοποιήστε το: ref: 'anchoring <doc_size_and_anchors>' για να προσδιορίσετε πού θα πρέπει να παραμένουν και πού να μετακινούνται τα στοιχεία ελέγχου. Αν οι διεπαφές χρήστη είναι πιο περίπλοκες, ενημερωθείτε σχετικά με τα Containers.
ja: ユーザインタフェースでは、\ :ref:`anchoring <doc_size_and_anchors>`\ を使用して、コントロールの位置と移動先を指定します。UIがより複雑な場合は、コンテナについて学ぶことを検討してください。
ko: 사용자 인터페이스에 대해서는 :ref:`앵커 <doc_size_and_anchors>`\ 를 사용해서 Control이 이동하거나 정지해야 할 위치를 결정하세요. UI가 더 복잡하다면 Container 사용을 고려해보세요.
pt_br: Para interfaces de usuário, utilize a :ref:`ancoragem <doc_size_and_anchors>` para determinar onde os controles devem estar e se mover. Se as interfaces são mais complexas, considere aprender sobre Containers.
th: สำหรับส่วนต่อประสานกับผู้ใช้ (UI) ให้ดูส่วนของ :ref:`การตรึง <doc_size_and_anchors>` เพื่อกำหนดว่าจะตรึงหรือเคลื่อนที่ส่วนต่าง ๆ อย่างไร ถ้า UI มีความซับซ้อน ให้ศึกษาเกี่ยวกับการใช้งาน Containers
zh_cn: 对于用户界面，请使用 :ref:`锚定 <doc_size_and_anchors>` 来确定控件应停留和移动的位置。 如果UI更复杂，请考虑学习容器。

source: And that's it! Your game should work in multiple resolutions.
el: Και αυτό είναι! Το παιχνίδι σας θα πρέπει να λειτουργεί σε πολλαπλές αναλύσεις.
ja: これで終わりです！あなたのゲームは複数の解像度で動くことでしょう。
ko: 다 됐습니다! 여러분의 게임은 다양한 해상도에서 작동 할 것입니다.
pt_br: E é isso! Seu jogo deve funcionar em múltiplas resoluções.
th: เสร็จแล้ว! ตอนนี้เกมของท่านจะรองรับหลายความละเอียดหน้าจอ
zh_cn: 就是这样！您的游戏应该能够以多种分辨率运行。

source: If there is a desire to make your game also work on ancient devices with tiny screens (fewer than 300 pixels in width), you can use the export option to shrink images, and set that build to be used for certain screen sizes in the App Store or Google Play.
ja: 小さな画面(幅が300ピクセル未満)の古いデバイスでもゲームを動作させたい場合は、エクスポートオプションを使用して画像を縮小し、そのビルドをAppStoreまたはGooglePlayの特定の画面サイズで使用するように設定できます。
ko: (가로 300화소도 안되는) 오래된 기기의 작은 화면에서도 게임이 작동하기를 정말 원한다면, 내보내기 설정으로 이미지를 압축해서 앱 스토어나 구글 플레이에 적합한 화면으로 만들 수 있습니다.
pt_br: Se você deseja que seu jogo também funcione em dispositivos antigos com telas minúsculas (menos de 300 pixels de largura), você pode usar a opção de exportação para diminuir imagens, e definir para que essa compilação seja usada para determinados tamanhos de tela na App Store ou Google Play.
zh_cn: 如果希望让您的游戏也适用于具有小屏幕(宽度小于300像素)的古老设备，可以在导出选项中缩小图像，并且在App Store或Google Play中将它设为用于特定的屏幕大小。

source: How can I extend Godot?
ja: Godotを拡張するにはどうすればよいですか?
ko: Godot의 기능확장을 어떻게 합니까?
pt_br: Como posso estender Godot?
zh_cn: 如何扩展Godot？

source: For extending Godot, like creating Godot Editor plugins or adding support for additional languages, take a look at :ref:`EditorPlugins <doc_making_plugins>` and tool scripts.
ja: Godotエディタプラグインの作成や追加言語のサポートの追加など、Godotを拡張するには、\ :ref:`エディタプラグイン <doc_making_plugins>`\ およびツールスクリプトを参照してください。
ko: Godot 편집기 플러그인 제작이나 추가적인 언어 지원을 하고 싶다면 :ref:`편집기 플러그인 <doc_making_plugins>`\ 과 tool 스크립트를 참고하세요.
pt_br: Para estender o Godot, como criar plugins para o Editor ou adicionar suporte a novas linguagens, dê uma olhada em:ref:`EditorPlugins <doc_making_plugins>` e ferramentas.
zh_cn: 要扩展Godot，比如创建Godot编辑器插件或添加对其他语言的支持，请参阅 :ref:`编辑器插件 <doc_making_plugins>` 和工具脚本。

source: Also, see the official blog posts on these topics:
ja: また、これらのトピックに関する公式ブログの投稿を参照してください:
ko: 또한 이 주제에 관한 공식 블로그 게시물도 참고하세요:
pt_br: Veja também os posts oficiais no blog (em inglês) sobre os seguintes tópicos:
zh_cn: 另外，请参阅有关这些主题的官方博客：

source: `A look at the GDNative architecture <https://godotengine.org/article/look-gdnative-architecture>`_
el: `Μια ματιά στην αρχιτεκτονική της GDNative <https://godotengine.org/article/look-gdnative-architecture>`_
ja: `GDNativeアーキテクチャの概要(英語) <https://godotengine.org/article/look-gdnative-architecture>`_
ko: `GDNative 건축의 모습 <https://godotengine.org/article/look-gdnative-architecture>`_
pt_br: `Uma olhada na arquitetura da GDNative <https://godotengine.org/article/look-gdnative-architecture>`_
zh_cn: `GDNative架构概览 <https://godotengine.org/article/look-gdnative-architecture>`_

source: `GDNative is here! <https://godotengine.org/article/dlscript-here>`_
el: `Η GDNative είναι εδώ! <https://godotengine.org/article/dlscript-here>`_
ja: `GDNativeが来た！(英語) <https://godotengine.org/article/dlscript-here>`_
ko: `GDNative이 왔어요! <https://godotengine.org/article/dlscript-here>`_
pt_br: `GDNative está aqui! <https://godotengine.org/article/dlscript-here>`_
zh_cn: `GDNative来了! <https://godotengine.org/article/dlscript-here>`_

source: You can also take a look at the GDScript implementation, the Godot modules, as well as the `unofficial Python support <https://github.com/touilleMan/godot-python>`_ for Godot. This would be a good starting point to see how another third-party library integrates with Godot.
ja: GDScriptの実装、Godotモジュール、およびGodotの\ `非公式Pythonサポート<https://github.com/touilleMan/godot-python>`_\ もご覧ください。これは、別のサードパーティライブラリがどのようにGodotに統合されるかを知る良い出発点です。
ko: GDScript 구현, Godot 모듈, Godot을 위한 `비공식 Python 지원 <https://github.com/touilleMan/godot-python>`_ 을 살펴볼 수도 있습니다. 이것이 Godot과 어떻게 제 3자 라이브러리와 통합하는 지를 보여주는 좋은 출발점이 될 것입니다.
pt_br: Você também pode dar uma olhada na implementação da GDScript, nos módulos em Godot e também no `suporte não-oficial a Python <https://github.com/touilleMan/godot-python>`_ para Godot. Isto seria um bom ponto de partida para ver como uma ferramenta externa integra-se com Godot.
zh_cn: 您还可以查看GDScript的实现、Godot模块以及Godot的 `非官方Python支持 <https://github.com/touilleMan/godot-python>`_ 。这个将是您了解如何将第三方库整合到Godot中的第一步。

source: When is the next release of Godot out?
ko: Godot의 다음 릴리스는 언제입니까?

source: When it's ready! See :ref:`doc_release_policy_when_is_next_release_out` for more information.
ko: 준비가 되었다면, 자세한 설명을 위해 :ref:`doc_running_code_in_the_editor` 를 참고하세요.

source: I would like to contribute! How can I get started?
ja: Godotに貢献したいのですが、どうすればよいですか？
ko: 저도 기여하고 싶어요! 어떻게 시작해야 하나요?
pt_br: Eu gostaria de contribuir! Como eu posso começar?
zh_cn: 想要贡献！ 如何开始？

source: Awesome! As an open-source project, Godot thrives off of the innovation and ambition of developers like you.
ja: 素晴らしい！オープンソースプロジェクトとして、Godotは、あなたのような開発者の技術革新と野心によって支えられています。
ko: 좋습니다! 오픈 소스 프로젝트인 만큼 Godot은 당신같이 혁신적이고 야심 찬 개발자들에 의해 번창합니다.
pt_br: Impressionante! Como um projeto de código aberto, Godot prospera da inovação e ambição de desenvolvedores como você.
zh_cn: 太棒了！作为一个开源项目，Godot的发展得益于像您这样的开发者的创新和雄心。

source: The first place to get started is in the `issues <https://github.com/godotengine/godot/issues>`_. Find an issue that resonates with you, then proceed to the `How to Contribute <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#contributing-pull-requests>`_ guide to learn how to fork, modify, and submit a Pull Request (PR) with your changes.
ja: まずはじめに見るべきは\ `issues <https://github.com/godotengine/godot/issues>`_\ です。あなたの共感を呼ぶIssueを見つけ、\ `How to Contribute <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#contributing-pull-requests>`_\ でforkや編集の方法を学び、そしてプルリクエストを提出してください。
ko: 처음으로 시작해야 할 부분은 `Issues <https://github.com/godotengine/godot/issues>`_\ 입니다. 당신이 공감하는 문제를 찾은 다음, `기여하는 방법 <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#contributing-pull-requests>`_ 가이드를 따라가세요. 변경 사항과 함께 Pull Request (PR)를 포크 요청, 수정 및 제출하는 법을 배울 수 있습니다.
pt_br: O primeiro lugar para começar é em `issues <https://github.com/godotengine/godot/issues>`_. Procure um problema que você se identifica, então proceda para `How to Contribute <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#contributing-pull-requests>`_ guia para aprender como fazer um fork, modificar e enviar uma solicitação de envio (Pull request = PR) com suas alterações.
zh_cn: 开始的第一个地方是在 `问题列表 <https://github.com/godotengine/godot/issues>`_。找到一个与您产生共鸣的问题，然后继续阅读 `如何贡献 <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#contributing-pull-requests>`_ 指南，学习如何使用更改派生、修改和提交Pull Request (PR)。

source: I have a great idea for Godot. How can I share it?
ja: Godotについていいアイデアがあるのですが、どこで共有すればいいですか？
ko: Godot에 대한 좋은 아이디어가 있습니다. 어떻게 이것을 공유할 수 있나요?
pt_br: Eu tenho uma grande ideia para Godot. Como posso compartilhar essa ideia?
zh_cn: 有关于Godot的好主意。如何分享它？

source: It might be tempting to want to bring ideas to Godot, like ones that result in massive core changes, some sort of mimicry of what another game engine does, or alternative workflows that you'd like built into the editor. These are great, and we are thankful to have such motivated people want to contribute, but Godot's focus is and always will be the core functionality as outlined in the `Roadmap <https://github.com/godotengine/godot-roadmap/blob/master/ROADMAP.md>`_, `squashing bugs and addressing issues <https://github.com/godotengine/godot/issues>`_, and conversations between Godot community members.
ko: Godot으로 아이디어를 가져오는 것이, 마치 거대한 핵심 변화를 가져오거나, 다른 종류의 게임 엔진을 흉내 내거나, 편집기에 내장하길 원하는 대체 워크플로가 생기는 것 같아서 매력적일 것입니다. 아이디어는 멋집니다. 그래서 이런 사람들이 Godot에 기여하는 것을 원한다는 사실에 감사하고 있습니다. 하지만 Godot의 초점은 `로드맵 <https://github.com/godotengine/godot-roadmap/blob/master/ROADMAP.md>`_\ 에 요약한 대로 핵심 기능과 `버그를 없애고 이슈를 다루는 것 <https://github.com/godotengine/godot/issues>`_, 그리고 Godot 커뮤니티 회원과의 대화입니다.
pt_br: Pode ser tentador querer trazer ideias ao Godot, como aquelas que resultam e mudanças massivas no núcleo, um tipo de mímica que outro motor de jogos faz, ou modos de trabalho alternativo que você iria querer dentro do editor. Tudo isso é ótimo e nós agradecemos por ter tantas pessoas motivadas querendo contribuir, porém, o foco do Godot é e sempre será, a funcionalidade central como descrita no `Roadmap <https://github.com/godotengine/godot-roadmap/blob/master/ROADMAP.md>`_, `consertando bugs e discutindo problemas <https://github.com/godotengine/godot/issues>`_, e discussão entre membros da comunidade do Godot.
zh_cn: 想要把一些想法带给Godot会很诱人，比如导致大量核心变化的想法，某种模仿其他游戏引擎所做的事情，或者您想要在编辑器中构建另一种工作流程。这些都是伟大的，我们感谢有这些想要积极贡献的人，但Godot的焦点是而且始终将是在 `路线图 <https://github.com/godotengine/godot-roadmap/blob/master/ROADMAP.md>`_ 中概述的核心功能。`排查bug和解决问题 <https://github.com/godotengine/godot/issues>`_，以及与Godot社区成员之间的讨论。

source: Most developers in the Godot community will be more interested to learn about things like:
ja: それよりも、Godotコミュニティのほとんどの開発者は、以下のようなことを知りたいと思っているでしょう:
ko: Godot 커뮤니티의 개발자 대부분은 이런 것을 배우는 데 더 흥미를 가질 것입니다:
pt_br: A maior parte dos desenvolvedores na comunidade do Godot ficarão mais interessados em aprender coisas como:
zh_cn: Godot社区中的大多数开发人员都会更有兴趣了解以下内容：

source: Your experience using the software and the problems you have (we care about this much more than ideas on how to improve it).
el: Η εμπειρία σας χρησιμοποιώντας το λογισμικό και τα προβλήματα που έχετε (μας νοιάζει πολύ περισσότερο από τις ιδέες για τον τρόπο βελτίωσής του).
ja: あなたがソフトウェアを使って得た体験と問題(我々は改善のアイデアよりも、これに重きをおいています)。
ko: 소프트웨어를 사용한 경험과 문제 (우리는 아이디어보다 이것을 개선하는 일을 더 중요하게 여깁니다).
pt_br: Sua experiência utilizando o software e os problemas que você tem (nos preocupamos bem mais com isso do que ideias sobre como melhorá-lo).
th: สิ่งที่พบขณะที่ใช้โปรแกรม ปัญหาที่พบ (เราสนใจตรงปัญหานี้มากกว่าไอเดียที่จะนำมาแก้ไขปัญหา)
zh_cn: 您使用该软件的经验和您遇到的问题(我们关心的不仅仅是关于如何改进它的想法)。

source: The features you would like to see implemented because you need them for your project.
el: Τα χαρακτηριστικά που θα θέλατε να εφαρμοστούν επειδή τα χρειάζεστε για το έργο σας.
ja: あなたのプロジェクトで必要なので、新たに実装してほしい機能。
ko: 프로젝트에 필요해서 구현하고자 하는 기능.
pt_br: As funcionalidades que você gostaria de ver implementadas porque precisa delas para seu projeto.
th: ฟีเจอร์ที่ท่านต้องการเพราะต้องใช้ในการทำเกม
zh_cn: 您希望实现的功能，因为您需要它们用于您的项目。

source: The concepts that were difficult to understand while learning the software.
ja: 使い方を学ぶにあたって理解しにくかった概念。
ko: 소프트웨어를 배우면서 이해하기 어려운 개념.
pt_br: Os conceitos que foram difíceis de entender enquanto aprendia o software.
zh_cn: 学习软件时难以理解的概念。

source: The parts of your workflow you would like to see optimized.
ja: あなたの作業フローにおいて、最適化したい部分。
ko: 최적화하고 싶은 워크플로 부분.
pt_br: As partes do seu fluxo de trabalho que você gostaria que fossem otimizadas.
th: ส่วนของวิถีการทำงานที่ท่านอยากจะให้มีประสิทธิภาพมากขึ้น
zh_cn: 您的工作流程中希望优化的部分。

source: Parts where you missed clear tutorials or where the documentation wasn't clear.
ja: 明確なチュートリアルを見逃した部分、またはドキュメントが明確ではなかった部分。
ko: 깔끔한 튜토리얼이 없거나 깔끔하지 않은 문서 부분.
pt_br: Partes onde você sentiu falta de tutoriais concisos ou onde a documentação não estava à altura.
zh_cn: 教程不全的部分或者文档不清晰的部分。

source: Please don't feel like your ideas for Godot are unwelcome. Instead, try to reformulate them as a problem first, so developers and the community have a functional foundation to ground your ideas on.
ja: Godotに対するあなたのアイデアが歓迎されないとは思わないでください。それよりも、それらを最初に問題としてまとめ上げてみてください。そうすれば、それは開発者とコミュニティがあなたのアイデアを土台にした機能を実現する為の基礎になります。
ko: 그러니 Godot이 여러분의 생각을 달갑게 여기지 않는다고 생각하진 마세요. 다만 개발자와 커뮤니티가 생각을 바탕으로 기술적 토대를 마련하기 위해, 먼저 문제점 순으로 재구성해주세요.
pt_br: Portanto, por favor, não sinta que suas ideias para o Godot não são bem-vindas. Em vez disso, tente reformulá-las em um problema primeiro, para que os desenvolvedores e a comunidade tenham uma base comum para discussão.
zh_cn: 因此，请不要觉得您对Godot的想法是不受欢迎的。相反，首先尝试将它们作为问题重新表述出来，这样开发人员和社区会有一个功能依据，可以为您的想法奠定基础。

source: A good way to approach sharing your ideas and problems with the community is as a set of user stories. Explain what you are trying to do, what behavior you expect to happen, and then what behavior actually happened. Framing problems and ideas this way will help the whole community stay focused on improving developer experiences as a whole.
ja: コミュニティでアイデアや問題を共有するための良い方法は、ユーザーのストーリーとして共有することです。あなたが 何をしようとしているのか、どのような行動が起こると予想されるのか、そして実際にどのような行動が起こったのかを説明してください。 この方法で問題やアイデアを立案すると、コミュニティ全体が開発者エクスペリエンス全体の改善に集中できるようになります。
ko: 커뮤니티와 생각과 문제를 공유하는 좋은 방법은 이야기로 서술하는 것입니다. 당신이 무엇을 하려 했고, 어떤 일을 예상했는데, 그 뒤 실제로는 어떤 일이 일어났는 지를 설명하세요. 이 방법으로 문제와 생각을 정리하면 전체 커뮤니티가 개발자 경험을 개선하는데 집중할 수 있습니다.
pt_br: Uma ótima abordagem ao compartilhar suas ideias e problemas com a comunidade é a partir de histórias de usuários. Explique o que você está tentando fazer, o comportamento que você espera que aconteça, e então, o que realmente houve. Ao colocar problemas e ideias dessa forma, podemos ajudar a comunidade inteira a ficar focada em melhorar a experiência do desenvolvedor como um todo.
zh_cn: 与社区分享您的想法和问题的一个好方法是用案例来说明。解释您想做什么，您期望发生什么行为，然后实际发生了什么行为。以这种方式体现问题和想法，将有助于整个社区始终专注于作为一个整体改善开发者的体验。

source: Bonus points for bringing screenshots, concrete numbers, test cases, or example projects (if applicable).
ja: スクリーンショット、具体的な数字、テストケース、またはサンプルプロジェクト(該当する場合)はボーナスポイントをもたらします。
ko: 스크린샷이나, 구체적인 값, 실험 사례, (가능하다면) 예제 프로젝트를 가져오면 추가 점수가 될 것입니다.
pt_br: Pontuação bônus se trouxer capturas de tela, números concretos, casos de teste ou projetos de exemplo (se aplicável).
zh_cn: 最好可以附上截图、具体数值、测试用例或示例项目(如果有的话)。

source: Is it possible to use Godot to create non-game applications?
ko: Godot을 게임이 아닌 응용프로그램 제작에 사용할 수 있을까요?

source: Yes! Godot features an extensive built-in UI system, and its small distribution size can make it a suitable alternative to frameworks like Electron or Qt.
ko: 예! Godot는 광범위한 내장 UI 시스템을 특징으로하며 작은 배포 크기로 인해 Electron 또는 Qt와 같은 프레임 워크에 적합한 대안이 될 수 있습니다.

source: When creating a non-game application, make sure to enable :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>` in the Project Settings to decrease CPU and GPU usage.
ko: 게임이 아닌 응용 프로그램을 제작할 때는 CPU와 GPU 사용율을 줄이기 위해 반드시 프로젝트 설정에서 :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>`를 활성화해주세요.

source: That said, we wouldn't recommend using Godot to create a *mobile* application since low-processor mode isn't supported on mobile platforms yet.
ko: 그렇긴 하지만 *모바일* 응용 프로그램 제작에는 Godot을 사용하지 말아 주세요. 아직 저사양모드가 모바일 플랫폼에서는 지원되지 않습니다.

source: Check out `Material Maker <https://github.com/RodZill4/material-maker>`__ and `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__ for examples of open source applications made with Godot.
ko: Godot으로 만든 오픈소스 예제 어플리케이션으로 `Material Maker <https://github.com/RodZill4/material-maker>`__ 와 `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__ 를 참고하세요.

source: Is it possible to use Godot as a library?
ko: Godot는 라이브러리로서 사용될 수 있을까요?
pt_br: É possível utilizar a Godot como uma biblioteca?
zh_cn: 是否能将Godot作为库使用？

source: Godot is meant to be used with its editor. We recommend you give it a try, as it will most likely save you time in the long term. There are no plans to make Godot usable as a library, as it would make the rest of the engine more convoluted and difficult to use for casual users.
ko: Godot는 편집기와 함께 사용하도록되어 있습니다. 긴 안목으로 보면 시간을 절약 할 수 있으므로 편집기를 사용해 보는 것이 좋습니다. Godot를 라이브러리로 사용할 수 있도록 만들 계획은 없습니다. 그러면 엔진의 다른 부분이 더 복잡해지고 일반 사용자가 사용기 어려워지기 때문입니다.
pt_br: Godot é desenvolvida para ser usada com sua interface de edição. Recomendamos que você experimente, pois provavelmente economizará tempo a longo prazo. Não há planos de tornar Godot utilizável como uma biblioteca, pois isso tornaria o restante do mecanismo mais complicado e difícil de usar para usuários casuais.
zh_cn: Godot旨在与其编辑器一起使用。我们建议您尝试一下编辑器，因为从长远来看，它很可能会节省您的时间。目前尚无计划把Godot作为库(library)使用，因为这会使引擎的其余部分更加混乱，难以为普通用户使用。

source: If you want to use a rendering library, look into using an established rendering engine instead. Keep in mind rendering engines usually have smaller communities compared to Godot. This will make it more difficult to find answers to your questions.
ko: 만약 렌더링 라이브러리를 원하신다면, 기존 렌더링 엔진을 대신 사용하는 것을 고려하십시오. 대부분의 렌더링 엔진은 Godot에 비해 커뮤니티가 작다는 점을 명심하십시오. 그곳에서 질문에 대한 답을 찾기는 더 어려워 질 것입니다.
pt_br: Se você deseja usar uma biblioteca de renderização, procure usar um mecanismo de renderização estabelecido. Lembre-se de que os mecanismos de renderização geralmente têm comunidades menores em comparação com Godot. Isso tornará mais difícil encontrar respostas para suas perguntas.
zh_cn: 如果你想使用一个渲染库，那就使用一个已经建立的渲染引擎来代替。需要注意的是，与Godot相比，渲染引擎通常拥有更小的社区，这将会使你解决问题的难度加大。

source: What user interface toolkit does Godot use?
ko: Godot는 어떤 사용자 인터페이스 툴킷을 사용합니까?

source: Godot does not use a standard :abbr:`GUI (Graphical User Interface)` toolkit like GTK, Qt or wxWidgets. Instead, Godot uses its own user interface toolkit, rendered using OpenGL ES or Vulkan. This toolkit is exposed in the form of Control nodes, which are used to render the editor (which is written in C++). These Control nodes can also be used in projects from any scripting language supported by Godot.
ko: Godot은 GTK나 Qt, wxWidgets와 같은 표준 :abbr:`GUI (Graphical User Interface)` 툴킷을 사용하지 않는 대신 OpenGL ES나 Vulcan으로 렌더링하는 자체 유저 인터페이스 툴킷을 사용합니다. 이 툴킷은 (C++로 작성된) 에디터를 렌더링할 때 사용되는 컨트롤 노드의 형태로 노출되어 있습니다. 물론 이 컨트롤 노드들은 Godot이 지원하는 어느 스크립트 언어로든지 사용할 수 있습니다.

source: This custom toolkit makes it possible to benefit from hardware acceleration and have a consistent appearance across all platforms. On top of that, it doesn't have to deal with the LGPL licensing caveats that come with GTK or Qt. Lastly, this means Godot is "eating its own dog food" since the editor itself is one of the most complex users of Godot's UI system.
ko: 이 자체 툴킷 덕분에 하드웨어 가속으로부터 혜택을 받고 모든 플랫폼을 아울러 일정한 외관을 가질 수 있습니다. 그에 더해 GTK나 Qt에 붙어있는 LGPL 라이센스과 고투를 벌일 필요도 없읍니다. 마지막으로 편집기 자체가 Godot UI 시스템의 가장 복잡한 구현 중 하나이기 때문에 Godot은 "개밥 먹이기(eating its own dog food)"를 하는 것이기도 합니다.

source: This custom UI toolkit :ref:`can't be used as a library <doc_faq_use_godot_as_library>`, but you can still :ref:`use Godot to create non-game applications by using the editor <doc_faq_non_game_applications>`.
ko: 이 자체 UI 툴킷은 :ref:`라이브러리로 사용할 수 없지만 <doc_faq_use_godot_as_library>`, 여전히 :ref:`편집기를 이용하여 Godot으로 비게임 어플리케이션을 만들 수는 있습니다 <doc_faq_non_game_applications>`.

source: Like many other libraries (Qt as an example), Godot does not make use of STL. We believe STL is a great general purpose library, but we had special requirements for Godot.
ja: 他のライブラリのように(例えばQt)、GodotはSTLを使いません。私たちはSTLが素晴らしい標準的な目的のためのライブラリだと信じています、しかし、私たちはGodotのために特に必要とはしていません。
ko: (Qt와 같은) 많은 다른 라이브러리처럼 Godot는 STL을 사용하지 않습니다. 우리는 STL이 훌륭한 범용 라이브러리라고 생각하지만, Godot에게는 특별한 요구 사항이 있었습니다.
pt_br: Como muitas outras bibliotecas (Qt como exemplo), Godot não utiliza STL. Acreditamos que o STL é uma excelente biblioteca de uso geral, mas tínhamos requisitos especiais para Godot.
zh_cn: 像许多其他库一样(Qt就是一个例子)，Godot没有使用STL。我们相信STL是一个伟大的通用库，但我们对Godot有特殊的要求。

source: STL templates create very large symbols, which results in huge debug binaries. We use few templates with very short names instead.
ja: STLテンプレートは非常に大きなシンボルを作ります、そして巨大のデバッグバイナリーを結果として生じます。私たちは、代わりにいくつかのテンプレートをとても短い名前と共に使います。
ko: STL 템플릿은 매우 큰 심볼들을 만들어서, 결과적으로 거대한 디버그 바이너리를 만듭니다. 대신 우리는 매우 짧은 이름의 템플릿을 조금만 사용합니다.
pt_br: Os modelos STL criam símbolos muito grandes, o que resulta em enormes binários de depuração. Em vez disso, usamos alguns modelos com nomes bem curtos.
zh_cn: STL模板会创建大量符号，这会产生大量的调试二进制文件。 我们使用名称很短的少量模板来代替。

source: Most of our containers cater to special needs, like Vector, which uses copy on write and we use to pass data around, or the RID system, which requires O(1) access time for performance. Likewise, our hash map implementations are designed to integrate seamlessly with internal engine types.
ja: 私たちのコンテナのほとんどは、コピーオンライトを使用していてデータの受け渡しに使うベクターや、必要とするアクセス時間が O(1) のみであるパフォーマンス重視なRIDシステムなど、特別なニーズに対応しています。同様に、ハッシュマップの実装は、内部エンジンタイプとシームレスに統合するように設計されています。
ko: 우리의 컨테이너 대부분은 이런 특수 목적에 맞춰졌습니다. 벡터의 경우는, Copy-On-Write를 사용하고, 데이터를 전달하는데 사용합니다. RID 시스템의 경우, 성능을 위해 O(1) 접근 시간이 필요해서 벡터를 사용합니다. 마찬가지로 해시 맵 구현은 내부 엔진 유형과 부드럽게 통합하도록 설계되었습니다.
pt_br: A maioria de nossos contêineres atende a necessidades especiais, como Vector, que usa cópia na gravação e usamos para transmitir dados, ou o sistema RID, que requer tempo de acesso O(1) para desempenho. Da mesma forma, nossas implementações de hash map foram projetadas para integrar-se perfeitamente aos tipos de mecanismo interno.
zh_cn: 我们的大多数容器都满足特殊需求，例如 `Vector`，它使用写时复制，我们用它来传递数据，或RID系统，这需要O(1)访问时间来提高性能。同样，我们的哈希映射实现旨在与内部引擎类型无缝集成。

source: Our containers have memory tracking built-in, which helps better track memory usage.
ja: コンテナにはメモリトラッキングが組み込まれているため、メモリ使用量を追跡できます。
ko: 컨테이너는 메모리 추적 기능이 내장되어 있어서, 메모리 사용량을 추적하는데 더 도움이 됩니다.
pt_br: Nossos contêineres possuem rastreamento de memória embutido, o que ajuda a rastrear melhor o uso da memória.
zh_cn: 我们的容器内置了内存跟踪，这有助于更好地跟踪内存使用情况。

source: For large arrays, we use pooled memory, which can be mapped to either a preallocated buffer or virtual memory.
ja: 大規模な配列の場合、プールメモリを使用します。これは、事前に割り当てられたバッファまたは仮想メモリのいずれかにマップできます。
ko: 큰 배열의 경우, 풀(Pool)로 된 메모리를 사용합니다, 사전에 지정된 버퍼 메모리 혹은 가상 메모리에 매핑될 수 있습니다.
pt_br: Para matrizes (arrays) grandes, usamos memória em pool, que pode ser mapeada para um buffer pré-alocado ou para uma memória virtual.
zh_cn: 对于大型数组，我们使用内存池，可以映射到预先分配的缓冲区或虚拟内存。

source: We use our custom String type, as the one provided by STL is too basic and lacks proper internationalization support.
ja: 私たちはカスタムString型を使用しています。STLが提供するものは基本的すぎて、適切な国際化サポートが不足しているためです。
ko: STL에서 제공하는 문자열 유형은 너무 단순하고 현지화 지원 기능이 부족해서 맞춤 문자열 유형을 사용합니다.
pt_br: Usamos nosso tipo de String personalizado, pois o fornecido pela STL é muito básico e carece de suporte adequado à internacionalização.
zh_cn: 我们使用自定义字符串类型，由于STL提供的版本过于基础，并且缺乏适当的国际化支持。

source: Why does Godot not use exceptions?
ja: なぜGodotは例外処理を使わないのですか？
ko: 왜 Godot는 예외(Exception)를 사용하지 않나요?
pt_br: Por que Godot não usa exceções?
zh_cn: 为什么Godot不使用异常？
