Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: el, ja, ko, pt_br, th, zh_cn

source: We believe games should not crash, no matter what. If an unexpected situation happens, Godot will print an error (which can be traced even to script), but then it will try to recover as gracefully as possible and keep going.
ja: 私たちは、ゲームが何であれ、クラッシュすべきではないと考えています。予期しない状況が発生した場合、Godotはエラーを出力します(スクリプトまでトレース可能)が、その後、可能な限り正常に回復し、動き続けます。
ko: 우리는 게임이 무엇이든 간에 충돌하지 않아야 한다고 생각합니다. 예기치 못한 사태가 벌어지면, Godot은 오류를 작성합니다 (스크립트에서도 추적할 수 있습니다), 그런 다음 가능한 한 정상적으로 복구한 후 계속 진행합니다.
pt_br: Acreditamos que os jogos não devem falhar, não importa o quê. Se ocorrer uma situação inesperada, o Godot imprimirá um erro (que pode ser rastreado até o script), mas tentará se recuperar o mais graciosamente possível e continuar.
zh_cn: 我们相信无论如何游戏都不应该崩溃。如果发生意外情况，Godot将打印一个错误(甚至可以追溯到脚本)，但之后它会尽可能优雅地恢复，并继续前进。

source: Additionally, exceptions significantly increase binary size for the executable.
ja: さらに、例外を処理する機能の分、実行ファイルのバイナリサイズが大幅に増加します。
ko: 또한 예외는 실행 파일에서 이진 크기를 상당히 늘립니다.
pt_br: Além disso, as exceções aumentam significativamente o tamanho do binário do executável.
zh_cn: 此外，异常会显著增加可执行文件的二进制大小。

source: Why does Godot not enforce RTTI?
ja: GodotがRTTI(実行時型情報)を強制しないのはなぜですか？
ko: 왜 Godot는 런타임 유형 정보(RTTI)를 시행하지 않나요?
pt_br: Por que Godot não aplica o RTTI?
zh_cn: 为什么Godot不执行运行时类型识别(RTTI)？

source: Godot provides its own type-casting system, which can optionally use RTTI internally. Disabling RTTI in Godot means considerably smaller binary sizes can be achieved, at a little performance cost.
ja: Godotには独自の型キャストシステムがあり、オプションで内部でRTTIを使用できます。 GodotでRTTIを無効にすると、わずかなパフォーマンスコストで、かなり小さいバイナリサイズを実現できます。
ko: Godot은 선택적으로 런타임 유형 정보를 사용하는 자체 유형 캐스팅 시스템을 제공합니다. Godot에서 런타임 유형 정보를 끄게 되면 약간의 성능을 더 소모하지만 상당히 작은 바이너리 크기를 얻을 수 있습니다.
pt_br: Godot fornece seu próprio sistema de conversão de tipo, que pode opcionalmente usar o RTTI internamente. Desativar o RTTI em Godot significa que tamanhos de binários consideravelmente menores podem ser alcançados, com um pequeno custo de desempenho.
zh_cn: Godot提供了自己的类型转换系统，可以可选地在内部使用运行时类型识别(RTTI)。在Godot中禁用运行时类型识别，意味着可以以较小的性能代价实现相当小的二进制大小。

source: Why does Godot not force users to implement DoD (Data oriented Design)?
ja: GodotがユーザーにDoD(データ指向設計)の実装を強制しないのはなぜですか？
ko: Godot은 왜 DoD(데이터 지향 디자인) 구현을 강제하지 않습니까?
pt_br: Por que Godot não força os usuários a implementar o DoD (Data oriented Design, ou Design orientado a Dados)?
zh_cn: 为什么Godot不强迫用户实践DoD(面向数据设计)？

source: While Godot internally for a lot of the heavy performance tasks attempts to use cache coherency as well as possible, we believe most users don't really need to be forced to use DoD practices.
ko: 더 높은 성능 처리를 위해 Godot은 내부적으로 가능한 한 최선의 캐시 일관성을 사용하려 하지만, 우리는 대부분의 사용자가 DoD 관행을 따라야 할 필요가 없다고 생각합니다.
pt_br: Enquanto Godot internamente, para muitas das tarefas de alto desempenho, tente usar a coerência do cache da melhor maneira possível, acreditamos que a maioria dos usuários não precisa realmente ser forçado a usar práticas de DoD.
zh_cn: 虽然Godot内部针对许多繁重的性能任务，尝试尽可能地使用缓存一致性，但我们相信大多数用户并不真正需要被迫使用DoD实践。

source: DoD is mostly a cache coherency optimization that can only gain you significant performance improvements when dealing with dozens of thousands of objects (which are processed every frame with little modification). As in, if you are moving a few hundred sprites or enemies per frame, DoD won't help you, and you should consider a different approach to optimization.
ja: DoDは主にキャッシュコヒーレンシ最適化であり、何十万ものオブジェクト(ほとんど変更なしでフレームごとに処理される)を処理する場合にのみ、大幅なパフォーマンスの向上が得られます。たとえば、フレームごとに数百のスプライトまたは敵を移動する場合、DoDは役に立ちません。最適化の別のアプローチを検討する必要があります。
ko: DoD는 대개 캐시 일관성 최적화를 뜻하며, 이는 즉 수 만 개의 객체가 있는 경우에만 (그리고 객체가 모든 프레임에서 수정이 거의 없이 처리되는 경우에만) 상당한 성능 향상을 볼 수 있습니다. 만약 프레임마다 수 백 개의 스프라이트나 적을 이동한다 하면, DoD는 도움이 되지 않습니다, 당신은 최적화에 있어서 다른 접근법을 생각해 봐야 하는 것이죠.
pt_br: O DoD é principalmente uma otimização da coerência do cache que só pode obter melhorias significativas de desempenho ao lidar com dezenas de milhares de objetos (que são processados a cada quadro com poucas modificações). Por exemplo, se você estiver movendo algumas centenas de sprites ou inimigos por quadro, o DoD não o ajudará e você deverá considerar uma abordagem diferente para a otimização.
zh_cn: 面向数据设计主要是缓存一致性优化，它只能在处理成千上万个对象时获得显著的性能提升(每帧都经过少量修改)。比如，如果你每帧移动几百个精灵或敌人，面向数据设计不会帮您的，您应该考虑一种不同的优化方法。

source: The vast majority of games do not need this and Godot provides handy helpers to do the job for most cases when you do.
ja: ゲームの大部分はこれを必要としません。そして、あなたがそのような仕事を必要とする時には、殆どの場合Godotは便利なヘルパーを提供します。
ko: 대부분의 게임에는 필요하지 않을 테지만, Godot은 이런 작업의 대부분의 경우에 도움을 줄 편리한 도우미를 제공합니다.
pt_br: A grande maioria dos jogos não precisa disso e Godot fornece ajudantes úteis para fazer o trabalho na maioria dos casos.
zh_cn: 绝大多数游戏都不需要这个，并且Godot提供了方便的辅助工具来完成大多数情况下的工作。

source: If a game that really needs to process such large amount of objects is needed, our recommendation is to use C++ and GDNative for the high performance parts and GDScript (or C#) for the rest of the game.
ja: このような大量のオブジェクトを本当に処理する必要があるゲームが必要な場合、推奨されるのは、高性能部分にはC++とGDNativeを、残りのゲームにはGDScript(またはC#)を使用することです。
ko: 게임이 정말로 많은 양의 객체를 처리해야 한다면, 우리의 추천은 높은 성능이 필요한 부분은 C++과 GDNative 사용하고, 그 외 나머지 부분은 GDScript (혹은 C#)을 사용하는 것입니다.
pt_br: Se for necessário um jogo que realmente precise processar uma quantidade tão grande de objetos, nossa recomendação é usar C++ e GDNative para as partes de alto desempenho e GDScript (ou C#) para o restante do jogo.
zh_cn: 如果一个游戏确实需要处理如此庞大的对象，我们建议在游戏的高性能部分使用C++和GDNative，而其余部分使用GDScript(或C#)。

source: How can I support Godot development or contribute?
ja: Godotの開発をサポートしたり、貢献したりするにはどうすればいいですか?
ko: 어떻게 Godot 개발을 돕거나 후원할 수 있나요?
pt_br: Como eu posso ajudar o desenvolvimento do Godot ou contribuir?
th: จะช่วยสนับสนุนการพัฒนา Godot ได้อย่างไร?
zh_cn: 怎样支持或参与Godot的发展呢？

source: See :ref:`doc_ways_to_contribute`.
ja: :ref:`doc_ways_to_contribute`\ をご覧ください。
ko: :ref:`doc_ways_to_contribute`\ 를 참고하세요.
pt_br: Veja :ref:`doc_ways_to_contribute`.
th: ดูได้ที่ :ref:`doc_ways_to_contribute`
zh_cn: 参阅 :ref:`doc_ways_to_contribute`。

source: Who is working on Godot? How can I contact you?
ja: Godotには誰が関わっているのですか？どうしたら連絡が取れますか？
ko: Godot은 누가 만드나요? 제가 연락할 수 있을까요?
pt_br: Quem está trabalhando no Godot? Como entro em contato com vocês?
th: ใครเป็นผู้พัฒนา Godot? จะติดต่อได้อย่างไร?
zh_cn: 谁在为Godot工作？如何联系？

source: See the corresponding page on the `Godot website <https://godotengine.org/contact>`_.
ja: `Godot webサイト <https://godotengine.org/contact>`_\ の対応するページをご覧ください。
ko: `Godot 웹사이트 <https://godotengine.org/contact>`_\ 에서 해당 페이지를 참고하세요.
pt_br: Veja a página correspondente na `página do Godot <https://godotengine.org/contact>`_.
th: ดูหน้าเว็บที่เกี่ยวข้องได้บน `เว็บไซต์ Godot <https://godotengine.org/contact>`_
zh_cn: 请参照 `Godot官网 <https://godotengine.org/contact>`_ 上的相应页面。

source: macOS
zh_cn: macOS系统

source: There are several reasons to use GDScript--especially when you are prototyping, in alpha/beta stages of your project, or are not creating the next AAA title--but the most salient reason is the overall **reduction of complexity.**
ja: GDScriptを使用する理由は幾つもありますが、特に、試作やアルファ/ベータ版の段階にある場合や、大作を作るのでない場合などが挙げられます。しかし一番の理由は、全体的に\ **複雑さを減らせることです。**
pt_br: Há várias razões para usar o GDScript - especialmente quando você está criando protótipos, em estágios alfa/beta do seu projeto, ou não está criando o próximo título AAA --, mas a razão mais importante é a **redução geral da complexidade. **
zh_cn: 使用GDScript有几个原因——特别是在进行原型设计时，在项目的alpha/beta阶段，或者没有创建下一个3A大作——但最突出的原因是整体 **复杂度降低。**

source: Why does Godot not use STL (Standard Template Library)
ja: なぜGodotはSTL (Standard Template Library)を使わないのですか
pt_br: Por que Godot não usa STL (Standard Template Library, ou Biblioteca de Modelos Padrão)
zh_cn: 为什么Godot不使用STL(标准模板库)？

source: Godot is Free/Libre Open Source Software available under the `OSI-approved <https://opensource.org/licenses/MIT>`_ MIT license.
el: Η Godot είναι ελεύθερο λογισμικό ανοικτού κώδικα διαθέσιμο υπό την `εγκεκριμένη από τον OSI <https://opensource.org/licenses/MIT>`_ άδεια MIT.
th: Godot เป็นซอฟต์แวร์ที่สามารถใช้ได้อย่างเสรี เปิดเผยโค้ด สามารถใช้ได้ภายใต้สัญญาอนุญาต MIT ซึ่ง`ได้รับการรับรองจาก OSI <https://opensource.org/licenses/MIT>`_

source: This means it is free as in "free speech" as well as in "free beer".
el: Αυτό σημαίνει ότι είναι ελεύθερο με την έννοια του "ελεύθερου λόγου" αλλά και της "δωρεάν μπύρας".
th: หมายความว่าสามารถใช้งานได้อย่างอิสระ และไม่มีค่าใช้จ่าย

source: There are no usage restrictions on Godot
el: Δεν υπάρχουν περιορισμοί χρήσης στην Godot
th: ไม่มีข้อจำกัดการใช้งาน Godot

source: This means you can use it for any game or application, commercially or non-commercially, in any industry
el: Αυτό σημαίνει ότι μπορείς να την χρησιμοποιήσεις για οποιοδήποτε παιχνίδι η εφαρμογή, εμπορική η μη-εμπορική, σε οποιαδήποτε βιομηχανία
th: แปลว่า ท่านสามารถใช้พัฒนาเกมหรือโปรแกรมในเชิงพาณิชย์ หรือไม่ใช่เชิงพาณิชย์ ในอุตสาหกรรมใด ๆ ก็ได้

source: You can modify, (re)distribute and remix Godot to your heart's content
el: Μπορείς να τροποποιήσεις, να επαναδιανέμεις και να ανασκευάσεις την Godot όπως θελήσεις
th: ท่านสามารถแก้ไข จัดจำหน่าย ผสมผสาน Godot ได้ตามใจชอบ

source: For more, see `here <https://tldrlegal.com/license/mit-license>`_ or ask your lawyer of choice.
el: Για περισσότερα, δες `εδώ <https://tldrlegal.com/license/mit-license>`_ ή ρώτα τον δικηγόρο της επιλογής σου.
th: อ่านรายละเอียดเพิ่มเติมได้ `ที่นี่ <https://tldrlegal.com/license/mit-license>`_ หรือสอบถามจากนักกฎหมาย

source: All the contents of the documentation are under the permissive Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) license, with attribution to "Juan Linietsky, Ariel Manzur and the Godot Engine community".
el: Η τεκμηρίωση αυτή υπόκεινται της ελεύθερης άδειας Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), με απόδοση "Juan Linietsky, Ariel Manzur και η κοινότητα της Godot".
th: เนื้อหาทั้งหมดในคู่มืออยู่ภายใต้สัญญาอนุญาตครีเอทีฟคอมมอนส์แบบแสดงที่มา 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) โดยระบุชื่อผู้สร้างสรรค์ "Juan Linietsky, Ariel Manzur and the Godot Engine community"

source: Also see `the license page on the Godot website <https://godotengine.org/license>`_.
el: Επίσης δες `την σελίδα άδειας στην ιστοσελίδα της Godot <https://godotengine.org/license>`_.
th: และจาก `หน้าสัญญาอนุญาตบนเว็บไซต์ Godot <https://godotengine.org/license>`_.

source: Windows
th: วินโดวส์

source: Mac OS X
th: แมค โอเอส X

source: X11 (Linux, \*BSD)
th: X11 (ลินุกซ์, \*บีเอสดี)

source: Android
th: แอนดรอยด์

source: iOS
th: ไอโอเอส

source: Both 32 and 64 bit binaries are supported where it makes sense, with 64 being the default.
el: 32 και 64 bit όπου βγάζει νόημα, με τα 64 να είναι η προεπιλογή.
th: สนับสนุนไบนารีทั้ง 32 และ 64 บิตตามความเหมาะสม โดยค่าปริยายคือ 64 บิต

source: Some users also report building and using Godot successfully on ARM-based system with Linux, like the Raspberry Pi. There is also some unofficial thirdparty work being done on building for some consoles. None of this is included in the default build scripts or export templates, however.
el: Κάποιοι χρήστης αναφέρουν το επιτυχές χτίσιμο και την χρήση της Godot σε συστήματα ARM με Linux, όπως το Raspberry Pi. Υπάρχει επίσης κάποια ανεπίσημη δουλειά από τρίτους η οποία στοχεύει κάποιες κονσόλες. Ωστόσο, καμία από αυτές δεν συμπεριλαμβάνεται στα προκαθορισμένα build scripts ή πρότυπα εξαγωγής.
th: ผู้ใช้บางส่วนรายงานว่าสามารถพอร์ตลงลินุกซ์ในระบบ ARM-based เช่น Raspberry Pi ได้ และมีบุคคลที่สามให้บริการพอร์ตลงเครื่องเล่นเกม แต่ที่กล่าวมานั้นไม่อยู่ในแม่แบบส่งออกที่มีให้

source: Which languages are supported in Godot?
el: Ποιες γλώσσες υποστηρίζονται από την Godot?
th: Godot สนับสนุนการเขียนโปรแกรมภาษาใดบ้าง?

source: The officially supported languages for Godot are GDScript, Visual Scripting, C# and C++. See the subcategories for each language in the :ref:`scripting <toc-learn-scripting>` section.
el: Οι επίσημα υποστηριζόμενες γλώσσες για την Godot είναι οι GDScript, Visual Scripting, C# και C++. Δες τις υποκατηγορίες για κάθε γλώσσα στην ενότητα :ref:`Προγραμματσμός <toc-learn-scripting>`.
th: ภาษาที่สนับสนุนใน Godot ได้แก่ GDScript, Visual Scripting, C# และ C++ ดูรายละเอียดของแต่ละภาษาได้จากหัวข้อย่อยในส่วน :ref:`การเขียนสคริปต์ <toc-learn-scripting>`

source: Note that C# and Visual Scripting support is comparatively young and GDScript still has some advantages as outlined below.
el: Σημείωσε ότι η υποστήριξη για C# και Visual Scripting είναι σχετικά νέα και η GDScript εξακολουθεί να έχει κάποια πλεονεκτήματα όπως παρουσιάζεται παρακάτω.
th: โปรดทราบว่าการสนับสนุนของ C# และ Visual Scripting นั้นยังใหม่และด้อยกว่า GDScript ตามที่แจกแจงในหัวข้อถัดไป

source: Support for new languages can be added by third parties using the GDNative / NativeScript / PluginScript facilities. (See question about plugins below.)
el: Η υποστήριξη για καινούριες γλώσσες μπορεί να προστεθεί μόνο από τρίτους χρησιμοποιώντας τις δυνατότητες των GDNative / NativeScript / PluginScript. (Δες ερώτηση για επεκτάσεις παρακάτω.)
th: การสนับสนุนภาษาใหม่สามารถทำได้ด้วย GDNative / NativeScript / PluginScript (ดูคำถามเกี่ยวกับปลั๊กอินด้านล่าง)

source: Work is currently underway, for example, on unofficial bindings for Godot to `Python <https://github.com/touilleMan/godot-python>`_ and `Nim <https://github.com/pragmagic/godot-nim>`_.
el: Η δουλειά εξελίσσεται, για παράδειγμα, σε ανεπίσημα bindings της Godot στην `Python <https://github.com/touilleMan/godot-python>`_ και `Nim <https://github.com/pragmagic/godot-nim>`_.
th: การสนับสนุนภาษาใหม่อยู่ระหว่างการพัฒนา เช่น `Python <https://github.com/touilleMan/godot-python>`_ และ `Nim <https://github.com/pragmagic/godot-nim>`_

source: GDScript? Why use a custom scripting language instead of my language of choice?
el: GDScript? Γιατί να χρησιμοποιήσω μια προσαρμοσμένη γλώσσα scripting και όχι μια γλώσσα της επιλογής μου?
th: GDScript? ทำไมต้องใช้ภาษาใหม่ แทนที่ภาษาเดิม?

source: The short answer is that we think the additional complexity both on your side (when first learning Godot and GDScript) as well as our side (maintenance) is worth the more integrated and seamless experience over attracting additional users with more familiar programming languages that result in a worse experience. We understand if you would rather use another language in Godot (see list of supported options above), but we strongly encourage you to try it and see the benefits for yourself.
el: Η σύντομη απάντηση είναι ότι θεωρούμε ότι η επιπρόσθετη πολυπλοκότητα και από την μεριά σας (όταν στην αρχή μαθαίνετε την Godot και την GDScript) καθώς και από την πλευρά μας (συντήρηση) αξίζει την πιο ενσωματωμένη και ανώδυνη εμπειρία έναντι της έλξης περισσοτέρων χρηστών που κατέχουν ήδη γνωστές γλώσσες προγραμματισμού, γεγονός που θα οδηγούσε σε χειρότερη εμπειρία. Καταλαβαίνουμε ότι μπορεί να προτιμάτε να χρησιμοποιήσετε μια άλλη γλώσσα στην Godot (δείτε την παραπάνω λίστα για διαφορετικές επιλογές), αλλά σας ενθαρρύνουμε έντονα να τη δοκιμάσετε και να δειτε μόνοι σας τα πλεονεκτήματα.
th: ตอบสั้น ๆ คือ เราคิดว่าการเพิ่มความยากในฝั่งของผู้ใช้ (ขณะเริ่มใช้ Godot และ GDScript) และฝั่งของผู้พัฒนา (การบำรุงรักษา) มีความจำเป็นสำหรับการใช้งานที่ง่ายขึ้นในระยะยาว ซึ่งดีกว่าการดึงดูดผู้ใช้ด้วยภาษาโปรแกรมที่ถนัดแต่ใช้งานกับเอ็นจิ้นได้ไม่ดี เราเข้าใจว่าท่านอาจอยากใช้ภาษาอื่น (ดูรายชื่อภาษาที่สนับสนุนด้านบน) แต่เราอยากให้ท่านได้ลองใช้เพื่อให้เห็นข้อดีด้วยตนเอง

source: GDScript is designed to integrate from the ground to the way Godot works, more than any other language, and is very simple and easy to learn. Takes at most a day or two to get comfortable and it's very easy to see the benefits once you do. Please do the effort to learn GDScript, you will not regret it.
th: GDScript ได้ออกแบบให้ใช้งานได้สอดคล้องกับ Godot มากยิ่งกว่าภาษาใด ๆ และสามารถเรียนรู้ได้รวดเร็ว ใช้เวลาเพียงแค่ 1-2 วันก็สามารถใช้งานได้อย่างสะดวก และเมื่อใช้เป็นแล้วท่านจะเห็นถึงข้อดี ขอให้ท่านเรียนรู้ GDScript แล้วท่านจะไม่เสียใจ

source: Godot C++ API is also efficient and easy to use (the entire Godot editor is made with this API), and an excellent tool to optimize parts of a project, but trying to use it instead of GDScript for an entire game is, in most cases, a waste of time.
el: Το C++ API της Godot είναι επίσης αποτελεσματικό και εύκολο στη χρήση (ολόκληρος ο επεξεργαστής της Godot δημιουργήθηκε με αυτό) και είναι ένα εξαιρετικό εργαλείο για τη βελτιστοποίηση των τμημάτων ενός έργου, αλλά η χρήση του αντί της GDScript για ένα ολόκληρο παιχνίδι είναι, συχνά, χάσιμο χρόνου.
th: API ภาษา C++ ของ Godot ก็สามารถใช้งานได้ง่าย (ตัวโปรแกรมก็ใช้ API นี้เช่นเดียวกัน) และเป็นเครื่องมือใช้เพิ่มประสิทธิภาพส่วนหนึ่งของโปรเจกต์ได้เป็นอย่างดี แต่อย่างไรก็ตามไม่ควรใช้แทน GDScript ในการเขียนเกมทั้งเกม เพราะจะเสียเวลามาก

source: Yes, for more than a decade we tried in the past integrating several VMs (and even shipped games using them), such as Python, Squirrel and Lua (in fact we authored tolua++ in the past, one of the most popular C++ binders). None of them worked as well as GDScript does now.
el: Ναι, για περισσότερο από μια δεκαετία προσπαθήσαμε να ενσωματώσουμε αρκετά VM (και δημοσιεύσαμε παιχνίδια με αυτά), όπως είναι η Python, Squirrel και Lua (στην πραγματικότητα δημιουργήσαμε το tolua+, ένα από τα δημοφέστερα συνδετικά C++). Κανένα από αυτά δεν δούλεψε όπως η GDScript σήμερα.
th: สิบกว่าปีที่เราลองเพิ่มภาษาที่มีอยู่แล้วเข้ามาใน Godot เช่น Python, Squirrel และ Lua แต่ไม่มีภาษาใดเลยที่ใช้ได้ดีเท่ากับ GDScript

source: For the more technically versed, proceed to the next item.
el: Για τους πιο τεχνικά καταρτισμένους, προχωρήστε στο επόμενο αντικείμενο.
th: สำหรับข้อมูลทางเทคนิค กรุณาอ่านข้อถัดไป

source: The main reasons are:
el: Οι κύριοι λόγοι είναι:
th: เหตุผลมีดังต่อไปนี้:

source: No good thread support in most script VMs, and Godot uses threads (Lua, Python, Squirrel, JS, AS, etc.).
el: Δεν υπάρχει καλή υποστήριξη για νήματα στα περισσότερα VM, και η Godot χρησιμοποιεί νήματα (Lua, Python, Squirrel, JS, AS, κλπ.).
th: ภาษาส่วนใหญ่ไม่รองรับเทร็ด ซึ่ง Godot ใช้เทร็ด (Lua, Python, Squirrel, JS, AS ฯลฯ)

source: No good class extending support in most script VMs, and adapting to the way Godot works is highly inefficient (Lua, Python, JS).
el: Δεν υπάρχει καλή υποστήριξη επέκτασης κλασεων στα περισσότερα VM, και η προσαρμογή στον τρόπο που δουλεύει η Godot δεν είναι αποδοτική (Lua, Python, JS)
th: ภาษาส่วนใหญ่ไม่รองรับการสืบทอดคลาส และการปรับให้เข้ากับ Godot นั้นส่งผลเสียต่อประสิทธิภาพ (Lua, Python, JS)

source: Horrible interface for binding to C++, results in large amount of code, bugs, bottlenecks and general inefficiency (Lua, Python, Squirrel, JS, etc.)
el: Η κακή διεπαφή σύνδεσης με την C++ έχει ως αποτέλεσμα την παραγωγή μεγάλου όγκου κώδικα, σφαλμάτων, σημείων συμφόρησης και γενικής μη αποδοτικότητας (Lua, Python, Squirrel, JS, κλπ)
th: เชื่อมภาษากับ C++ ได้ไม่ดี ทำให้ต้องใช้โค้ดจำนวนมาก บัคเยอะ เกิดคอขวด และขาดประสิทธิภาพ (Lua, Python, Squirrel, JS ฯลฯ)

source: No native vector types (vector3, matrix4, etc.), resulting in highly reduced performance when using custom types (Lua, Python, Squirrel, JS, AS, etc.).
el: Δεν υπάρχουν φυσικοί τύποι διανυσμάτων (vector3, matrix4, κλπ), με αποτέλεσμα τη μειωμένη απόδοση όταν χρησιμοποιούνται ειδικοί τύποι (Lua, Python, Squirrel, JS, AS, κλπ).
th: ไม่มีเวคเตอร์ให้ใช้ (vector3, matrix4 ฯลฯ) ส่งผลเสียต่อประสิทธิภาพเมื่อต้องใช้ตัวแปรชนิดอื่นแทน (Lua, Python, Squirrel, JS, AS ฯลฯ)

source: Garbage collector results in stalls or unnecessarily large memory usage (Lua, Python, JS, AS, etc.).
el: Η αποκομιδή απορριμμάτων προκαλεί καθυστερήσεις ή άσκοπα μεγάλη χρήση μνήμης (Lua, Python, JS, AS, κλπ).
th: Garbage collector ทำให้โปรแกรมค้าง และใช้หน่วยความจำมากเกินจำเป็น (Lua, Python, JS, AS ฯลฯ)

source: Difficulty to integrate with the code editor for providing code completion, live editing, etc. (all of them). This is very well supported by GDScript.
th: ยากต่อการผสานตัวแก้ไขสคริปต์เพื่อให้ใช้ตัวช่วยพิมพ์ การแก้ไขสด ฯลฯ ได้ โดย GDScript สนับสนุนฟีเจอร์เหล่านี้

source: GDScript was designed to solve the issues above, and performs very well in all the above scenarios. Please learn GDScript and enjoy a very smooth integration of scripting with the game engine (yes, it's a rare but very enjoyable situation when things just work). It's worth it, give it a try!
th: GDScript ออกแบบมาให้แก้ไขปัญหาดังที่กล่าวมา และทำงานได้ดีในสถานการณ์ข้างต้น ขอให้เรียนรู้ GDScript และใช้งานเอ็นจิ้นได้อย่างราบรื่น (ความรู้สึกเวลาที่ทุกอย่างลงตัวนั้นสุดยอดมาก) มันคุ้มค่ามาก ลองใช้ดู!

source: I want to extend Godot. What are my options for creating plugins?
el: Θέλω να επεκτείνω την Godot. Τι επιλογές έχω για την δημιουργία επεκτάσεων;
th: ถ้าอยากจะต่อเติม Godot จะสร้างปลั๊กอินได้อย่างไรบ้าง?

source: For creating Godot Editor plugins look at :ref:`EditorPlugins <doc_making_plugins>` and tool scripts.
el: Για τη δημιουργία επεκτάσεων του επεξεργαστή της Godot, δείτε το :ref:`EditorPlugins <doc_making_plugins>` και τις δεσμές ενεργειών tool.
th: สำหรับการสร้างปลั๊กอินของตัวโปรแกรม Godot Editor กรุณาอ่าน :ref:`EditorPlugins <doc_making_plugins>` และสคริปต์แบบ tool

source: Additional languages could be added via PluginScript or the more low-level NativeScript.
el: Πρόσθετες γλώσσες θα μπορούσαν να προστεθούν μέσω του PluginScript ή του πληρέστερου, χαμηλού επιπέδου NativeScript.
th: สามารถเพิ่มภาษาโปรแกรมได้ด้วย PluginScript หรือ NativeScript

source: If you want to add a certain native library, your best bet is GDNative and custom C++ modules.
el: Αν θέλετε να προσθέσετε μια συγκεκριμένη εγγενή βιβλιοθήκη, η καλύτερη επιλογή σας είναι το GDNative και οι προσαρμοσμένες μονάδες C++.
th: ถ้าต้องการจะเพิ่มไลบรารี อาจต้องใช้ GDNative และโมดูล C++

source: Also see the official blog posts on these topics:
el: Δείτε επίσης τις επίσημες αναρτήσεις ιστολογίου σε αυτά τα θέματα:
th: อ่านบทความที่เกี่ยวข้องได้จาก:

source: You can also take a look at the GDScript implementation, the Godot modules as well as the `unofficial Python support <https://github.com/touilleMan/godot-python>`_ for Godot.
el: Μπορείτε επίσης να δείτε και την υλοποίηση της GDScript, στις μονάδες Godot καθώς και στην `ανεπίσημη υποστήριξη Python <https://github.com/touilleMan/godot-python>`_ για την Godot.
th: ท่านสามารถดูตัวอย่างการเขียน GDScript, โมดูลและ `การสนับสนุน Python <https://github.com/touilleMan/godot-python>`_ สำหรับ Godot

source: Why is FBX not supported for import?
el: Γιατί δεν υποστηρίζεται το πρότυπο FBX για εισαγωγή;
th: ทำไมไม่สนับสนุนการนำเข้าไฟล์ FBX?

source: FBX SDK has a very `restrictive license <http://www.blender.org/bf/Autodesk_FBX_License.rtf>`_, that is incompatible with the `open license <http://opensource.org/licenses/MIT>`_ provided by Godot.
th: FBX SDK มีข้อจำกัดจำนวนมากใน `สัญญาอนุญาต <http://www.blender.org/bf/Autodesk_FBX_License.rtf>`_ ซึ่งเข้ากันไม่ได้กับ `สัญญาอนุญาต <http://opensource.org/licenses/MIT>`_ ของ Godot

source: That said, Godot's Collada support is really good, please use the `OpenCollada <https://github.com/KhronosGroup/OpenCOLLADA/wiki/OpenCOLLADA-Tools>`_ exporter for maximum compatibility if you are using Maya or 3DS Max. If you are using Blender, take a look at our own `Better Collada Exporter <https://godotengine.org/download>`_.
th: อย่างไรก็ตาม Godot สนับสนุน Collada เป็นอย่างดี กรุณาใช้ `OpenCollada <https://github.com/KhronosGroup/OpenCOLLADA/wiki/OpenCOLLADA-Tools>`_ ส่งออกเพื่อให้เข้ากันได้อย่างเต็มที่ ถ้าท่านใช้ Blender ขอให้ใช้ `Better Collada Exporter <https://godotengine.org/download>`_ ที่เราพัฒนา

source: Also, glTF support was added in Godot 3.0.
el: Επίσης, στην Godot 3.0 προστέθηκε και η υποστήριξη glTF.
th: นอกจากนี้ Godot 3.0 สนับสนุน glTF
