Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: el, ja, ko, pt_br, th, zh_cn

source: FBX support could still be provided by third parties as a plugin. (See Plugins question above.)
el: Η υποστήριξη του προτύπου FBX μπορεί ακόμα να προσφερθεί από τρίτους σαν επέκταση. (Δείτε την παραπάνω ερώτηση για επεκτάσεις.)
th: การสนับสนุน FBX สามารถทำได้โดยใช้ปลั๊กอิน (ดูคำถามเกี่ยวกับปลั๊กอินด้านบน)

source: Will [Insert closed SDK such as PhysX, GameWorks, etc.] be supported in Godot?
el: Θα υποστηριχθεί [Κάποιο κλειστό SDK όπως PhysX, GameWorks, κλπ] στην Godot;
th: Godot จะสนับสนุน [SDK ที่มีข้อจำกัดการใช้งาน เช่น PhysX, GameWorks ฯลฯ] หรือไม่?

source: No, the aim of Godot is to create a complete open source engine licensed under MIT, so you have complete control over every single piece of it. Open versions of functionality or features from such SDKs may be eventually added though.
el: Όχι, ο στόχος της Godot είναι να δημιουργηθεί μία πλήρης μηχανή ανοιχτού κώδικα με άδεια MIT, ώστε να έχετε πλήρη έλεγχο σε κάθε κομμάτι της. Μπορεί ωστόσο, να προστεθούν ανοιχτές εκδοχές της λειτουργικότητας ή των δυνατοτήτων τέτοιων SDK στο μέλλον.
th: ไม่ เป้าหมายของ Godot คือเป็นเกมเอ็นจิ้นโอเพนซอร์ซภายใต้สัญญาอนุญาต MIT เพื่อที่ท่านจะใช้งานได้อย่างอิสระ ถ้า SDK นั้นมีรุ่นโอเพนซอร์ซ เราอาจสนับสนุน

source: That said, because it is open source, and modular, nothing prevents you or anyone else interested into adding those libraries as a module and ship your game using them, as either open or closed source. Everything is allowed.
el: Λέγοντας αυτά, επειδή είναι ανοιχτού κώδικα και με μοναδιαίες, τίποτα δεν εμποδίζει εσάς ή οποιονδήποτε άλλο να προσθέσει αυτές τις βιβλιοθήκες ως μονάδα και να δημοσιεύσει ένα παιχνίδι, ανοικτού ή κλειστού κώδικα, χρησιμοποιώντας τις. Όλα επιτρέπονται.
th: อย่างไรก็ตาม เนื่องจากเอ็นจิ้นนี้โอเพนซอร์ซและแยกโมดูล ถ้าใครต้องการสร้างไลบรารีดังกล่าวก็สามารถทำได้ และส่งออกเกมโดยที่มีโมดูลนั้นแบบโอเพนซอร์ซหรือไม่ก็ได้ เราให้ท่านทำได้ทุกอย่าง

source: To see how support for your SDK of choice could still be provided, look at the Plugins question above.
el: Για να δείτε πώς θα μπορούσε να υποστηριχθεί το SDK της επιλογής σας, δείτε την παραπάνω ερώτηση για τις επεκτάσεις.
th: กรุณาอ่านคำถามเกี่ยวกับปลั๊กอินด้านบนเพื่อดูว่าจะสามารถสนับสนุน SDK ที่ท่านต้องการได้อย่างไร

source: The most common and proper way to achieve this is to, instead, use a single base resolution for the game and only handle different screen aspects. This is mostly needed for 2D, as in 3D it's just a matter of Camera XFov or YFov.
el: Ο πιο συνηθισμένος και κατάλληλος τρόπος για να επιτευχθεί αυτό είναι να χρησιμοποιήσετε μια απλή βάση ανάλυσης για το παιχνίδι και να χειριστείτε μόνο διαφορετικές όψεις οθονών. Αυτό είναι απαραίτητο κυρίως για 2D, καθώς στο 3D είναι απλά θέμα Camera XFov ή YFov.
th: วิธีที่เหมาะสมและใช้บ่อยที่สุด คือให้ตัวเกมรองรับความละเอียดหน้าจอหลักแค่แบบเดียว แต่รองรับสัดส่วนหน้าจอหลายแบบ ทั้งนี้จำเป็นสำหรับเกม 2 มิติเท่านั้น ส่วน 3 มิติขึ้นอยู่กับขอบเขตการมองเห็นของกล้อง

source: Use the stretch options in Godot, 2D stretching with keeping aspect works best. Check the :ref:`doc_multiple_resolutions` tutorial on how to achieve this.
el: Χρησιμοποιήστε τις επιλογές τεντώματος οθόνης στο Godot, το 2D stretching με τη διατήρηση ανάλυσης λειτουργεί καλύτερα. Ελέγξτε το εγχειρίδιο ref: 'doc_multiple_resolutions' σχετικά με τον τρόπο επίτευξης.
th: ใช้ตัวเลือกการยืดขยายภาพที่ Godot มีให้ การยืดขยายภาพแบบ 2D และคงสัดส่วนภาพมักให้ผลดีที่สุด ดูวิธีทำได้จากคู่มือในส่วน :ref:`doc_multiple_resolutions`

source: Determine a minimum resolution and then decide if you want your game to stretch vertically or horizontally for different aspect ratios, or whether there is a minimum one and you want black bars to appear instead. This is also explained in the previous step.
el: Ορίστε μια ελάχιστη ανάλυση και, στη συνέχεια, αποφασίστε εάν θέλετε το παιχνίδι σας να τεντωθεί κάθετα ή οριζόντια για διαφορετικές αναλύσεις οθόνης, ή εάν θα υπάρχει μία ελάχιστη ανάλυση και θέλετε να εμφανίζονται μαύρες γραμμές. Αυτό εξηγείται επίσης στο προηγούμενο βήμα.
th: กำหนดความละเอียดต่ำสุด แล้วเลือกว่าต้องการให้ยืดภาพตามแนวตั้ง แนวนอน หรือไม่ยืดภาพแล้วแสดงแถบดำแทน ซึ่งได้อธิบายไว้ในขั้นตอนก่อนหน้านี้

source: If there really is a desire to make your game also work on ancient devices with tiny screens (less than 300 pixels in width), you can use the export option to shrink images, and set that build to be used for certain screen sizes in the App Store or Google Play.
th: ถ้ามีความจำเป็นต้องส่งออกเกมลงอุปกรณ์โบราณ (ความกว้างจอน้อยกว่า 300 พิกเซล) ขณะส่งออกเกมให้ใช้ตัวเลือกย่อขนาดภาพ แล้วกำหนดใน App Store หรือ Google Play ว่าให้ใช้เกมรูปแบบนี้สำหรับความละเอียดหน้าจอดังกล่าว

source: I have a great idea that will make Godot better. What do you think?
el: Έχω μια καταπληκτική ιδέα που θα κάνει το Godot καλύτερο. Τι πιστεύετε;
th: ฉันมีไอเดียที่จะทำให้ Godot ดีขึ้น คิดว่าไง?

source: Your idea will most certainly be ignored. Examples of stuff that is ignored by the developers:
el: Η ιδέα σας σίγουρα θα αγνοηθεί. Παραδείγματα που αγνοούνται από τους προγραμματιστές:
th: ผู้พัฒนาอาจไม่สนใจไอเดียดังกล่าว ตัวอย่างของไอเดียที่ผู้พัฒนาไม่สนใจ:

source: Let's do this because it will make Godot better
el: Ας κάνουμε αυτό γιατί θα κάνει το Godot καλύτερο
th: ทำสิ่งนี้เถอะ เพื่อให้ Godot ดียิ่งขึ้น

source: Let's do this in Godot because another game engine does it
el: Ας κάνουμε αυτό στο Godot γιατί μια άλλη μηχανή παιχνιδιών το κάνει
th: ทำสิ่งนี้ใน Godot เถอะ เพราะว่าเกมเอ็นจิ้นอื่นทำ

source: Let's remove this because I think it's not needed
el: Ας αφαιρέσουμε αυτό γιατί νομίζω ότι δεν είναι απαραίτητο
th: ลบสิ่งนี้ทิ้งเถอะ ฉันว่ามันไม่จำเป็น

source: Let's remove clutter and bloat and make Godot look nicer
el: Ας αφαιρέσουμε τη σύγχυση και τις φούσκες και να κάνουμε τον Godot να φανεί καλύτερο
th: ลบส่วนที่เกะกะทิ้งให้หมดและทำให้ Godot ดูดีขึ้นกันเถอะ

source: Let's add an alternative workflow for people who prefer it
el: Ας προσθέσουμε μια εναλλακτική ροή εργασίας για τους ανθρώπους που την προτιμούν
th: เพิ่มวิถีการทำงานใหม่ที่ผู้ใช้บางคนชอบกันเถอะ

source: Godot developers are always willing to talk to you and listen to your feedback very openly, to an extent rarely seen in open source projects, but they will care mostly about real issues you have while using Godot, not ideas solely based on personal belief. Developers are interested in (for example):
el: Οι προγραμματιστές του Godot είναι πάντοτε πρόθυμοι να σας μιλήσουν και να ακούσουν τα σχόλιά σας πολύ ανοιχτά, σε βαθμό που σπάνια παρατηρούνται σε έργα ανοιχτού κώδικα, αλλά θα φροντίζουν κυρίως για πραγματικά θέματα που έχετε ενώ χρησιμοποιείτε το Godot, όχι ιδέες που βασίζονται αποκλειστικά στην προσωπική αντίληψη. Οι προγραμματιστές ενδιαφέρονται για (για παράδειγμα):
th: ผู้พัฒนา Godot ยินดีรับฟังข้อคิดเห็นของผู้ใช้ มากกว่าโปรเจกต์โอเพนซอร์ซบางโปรเจกต์เสียอีก แต่ผู้พัฒนาจะสนใจเฉพาะปัญหาที่ท่านพบระหว่างการใช้งาน Godot ไม่ใช่ความคิดเห็นส่วนตัวของผู้ใช้ล้วน ๆ สิ่งที่ผู้พัฒนาสนใจ ยกตัวอย่างเช่น:

source: The concepts that were difficult to understand in order to learn the software.
th: แนวคิดที่ยากต่อการทำความเข้าใจ เพื่อที่จะเรียนรู้การใช้งานโปรแกรม

source: Parts where you missed clear tutorials or where the documentation wasn't up to par.
th: ส่วนที่คู่มืออธิบายไม่ละเอียดพอ

source: Once one of the above points is stated, we can work together on a solution and this is where your ideas and suggestions are most valuable and welcome, they need to be in context of a real issue.
th: เมื่อทราบปัญหาแล้ว เราสามารถร่วมมือกันเพื่อหาวิธีการแก้ไขปัญหาได้ นี่เป็นตอนที่ไอเดียของผู้ใช้จะมีประโยชน์และเราจะยินดีรับฟัง ไอเดียนั้นจะต้องอยู่ในบริบทของการใช้งานจริง

source: As such, please don't feel that your ideas for Godot are unwelcome. Instead, try to reformulate them as a problem first, so developers and the community have a base ground to discuss first.
th: เพราะฉะนั้น โปรดอย่ารู้สึกว่าเราไม่ยินดีรับฟังไอเดียของท่าน แต่ให้ท่านลองปรับรูปแบบให้เป็นปัญหาก่อน เพื่อเปิดโอกาสให้ผู้พัฒนาและผู้ใช้อื่น ๆ ได้พิจารณากัน

source: Examples of how NOT to state problems generally and vaguely are:
th: ตัวอย่างที่ไม่ดี เช่น:

source: Certain feature is ugly
th: ฟีเจอร์นี้แย่มาก

source: Certain workflow is slow
th: ขั้นตอนการทำสิ่งนี้ช้ามาก

source: Certain feature needs optimization
th: ฟีเจอร์นี้ต้องได้รับการเพิ่มประสิทธิภาพ

source: Certain aspect of the UI looks cluttered
th: หน้าต่างตรงส่วนนี้รกมาก

source: Associating something with an adjective will not get you much attention and developers will most likely not understand you. Instead, try to reformulate your problem as a story such as:
th: การเอาคำวิเศษณ์มาขยายบางอย่างไม่ทำให้ได้รับความสนใจมากขึ้น และผู้พัฒนาจะไม่เข้าใจปัญหาที่แท้จริง ลองตั้งปัญหาในรูปแบบของเรื่องราว เช่น:

source: I try to move objects around but always end up picking the wrong one
th: ฉันพยายามจะย้ายวัตถุแต่หยิบผิดอันตลอด

source: I tried to make a game like Battlefield but I'm not managing to understand how to get lighting to look the same.
th: ฉันอยากสร้างเกมแบบ Battlefield แต่ไม่รู้ว่าจะทำแสงให้เหมือนกันได้อย่างไร

source: I always forget which script I was editing, and it takes me too many steps to go back to it.
th: ฉันลืมว่าสคริปต์ล่าสุดที่แก้ไขคืออันไหน แล้วต้องเสียเวลาหานานมาก

source: This will allow you to convey what you are thinking much better and set a common ground for discussion. Please try your best to state your problems as stories to the developers and the community, before discussing any idea. Be specific and concrete.
th: การทำอย่างนี้จะสื่อสารสิ่งที่ท่านคิดไว้ได้ดีมากกว่า และเป็นการเปิดโอกาสให้พูดคุยหาคำตอบ กรุณาตั้งปัญหาในรูปแบบของเรื่องราวก่อนที่จะพูดคุยถึงไอเดีย มีความจำเพาะเจาะจงและเป็นรูปธรรม

source: Bonus points for bringing screenshots, concrete numbers, test cases or example projects (if applicable).
th: ถ้าสามารถแทรกภาพหน้าจอ ข้อมูลจริง กรณีตัวอย่าง หรือโปรเจ็กต์ตัวอย่างได้จะเป็นประโยชน์มาก

source: I don't believe you. What are the technical reasons for the item above?
el: Δεν σας πιστεύω. Ποιοι είναι οι τεχνικοί λόγοι για το παραπάνω;
