Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: el, ja, ko, pt_br, th, zh_cn

source: FAQ
ko: 자주 묻는 질문(FAQ)
pt_br: Perguntas Frequentes
zh_cn: 常见问题

source: Frequently asked questions
el: Συνηθισμένες Ερωτήσεις
ja: よくある質問
ko: 자주 묻는 질문들(FAQ)
pt_br: Perguntas Frequentes
th: คำถามที่พบบ่อย
zh_cn: 常见问题

source: What can I do with Godot? How much does it cost? What are the license terms?
el: Τι μπορώ να κάνω με την Godot? Τι κοστίζει? Ποίοι είναι οι όροι της άδειας?
ja: Godotで何ができますか？費用はいくらかかりますか？ライセンス条項は何ですか？
ko: Godot로 무엇을 할 수 있나요? 가격은 얼마인가요? 라이선스 조항은 어떻게 되나요?
pt_br: O que eu posso fazer com o Godot? Quanto custa? Quais são os termos de licença?
th: Godot ทำอะไรได้บ้าง? ราคาเท่าไหร่? สัญญาอนุญาตเป็นอย่างไร?
zh_cn: 可以用Godot做什么？需要花多少钱？有哪些许可条款？

source: Godot is `Free and Open-Source Software <https://en.wikipedia.org/wiki/Free_and_open-source_software>`_ available under the `OSI-approved <https://opensource.org/licenses/MIT>`_ MIT license. This means it is free as in "free speech" as well as in "free beer."
ja: Godotは\ `フリーソフトウェアでオープンソース <https://ja.wikipedia.org/wiki/FLOSS>`_\ で、OSI承認済みのMITライセンスの元で利用できます。これは「飲み放題」と同様に「言論の自由」のように自由であることを意味します。
ko: Godot는 `OSI가 인정한 <https://opensource.org/licenses/MIT>`_ MIT 라이선스로 사용할 수 있는 `무료이자 오픈 소스 소프트웨어 <https://ko.wikipedia.org/wiki/자유-오픈_소스_소프트웨어>`_\ 입니다. 이 말인 즉, Godot는 "언론의 자유(Free)"라는 뜻과 "무료(Free) 맥주"라는 뜻을 모두 지니고 있다는 것이죠.
pt_br: Godot é um `Software Livre e de Código Aberto <https://pt.wikipedia.org/wiki/Software_livre_e_de_código_aberto>`_ disponível sob a Licença MIT `aprovada pela OSI <https://opensource.org/licenses/MIT>`_. Isso significa que é livre como em "liberdade de expressão", bem como em "cerveja grátis."
zh_cn: Godot是 `Free和开源的软件 <https://en.wikipedia.org/wiki/Free_and_open-source_software>`_ 可在 `OSI认可的 <https://opensource.org/licenses/MIT>`_ MIT许可证下使用。这里的 `free` 就像“言论自由(free speech)”和“免费啤酒(free beer)”里的 `free` 一样，它是自由且免费的。

source: In short:
el: Σε συντομία:
ja: 要約すれば:
ko: 간단히 말해서:
pt_br: Resumindo:
th: สรุปคือ:
zh_cn: 简而言之：

source: You are free to download and use Godot for any purpose, personal, non-profit, commercial, or otherwise.
ja: Godotをダウンロードして、個人的、非営利、商業、またはその他の目的で自由に使用できます。
ko: 개인적으로, 비영리로, 사업 목적으로, 그 외 어떤 이유든지 자유롭게 Godot를 다운로드하고 사용할 수 있습니다.
pt_br: Você está livre para baixar e usar Godot para qualquer propósito, pessoal, sem lucro, comercial, ou qualquer outro.
zh_cn: 您可以出于任何目的，个人、非营利、商业或其他目的，下载和使用Godot。

source: You are free to modify, distribute, redistribute, and remix Godot to your heart's content, for any reason, both non-commercially and commercially.
ja: 商用と非商用を問わず、どのような用途であれ、心おきなく自由にGodotを改変、配布、再配布およびリミックスできます。
ko: Godot를 마음대로 자유롭게 수정하고, 배포하고, 재배포하고 수정할 수 있습니다. 그 이유가 비상업적이든지 상업적이든지 말이죠.
pt_br: Você pode modificar, (re)distribuir e remixar o Godot o quanto você quiser, por qualquer motivo, seja ele comercial ou não-comercial.
zh_cn: 您可以出于任何原因，非商业和商业原因，自由地修改、分发、再分发、重新组织Godot的代码。

source: All the contents of this accompanying documentation are published under the permissive Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) license, with attribution to "Juan Linietsky, Ariel Manzur and the Godot Engine community."
ja: このコンテンツは、「Juan Linietsky」、「Ariel Manzur」そして 「Godot Engineコミュニティ」によって、クリエイティブ・コモンズ-表示 3.0(\ `CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_\ )ライセンスの下、管理されております。
ko: 이 문서의 모든 내용은 크리에이티브 커먼스 저작자 표시 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/deed.ko>`_) 라이선스 하에, "Juan Linietsky, Ariel Manzur, Godot Engine community"에 속합니다.
pt_br: Todo o conteúdo desta documentação anexa está publicado sob a licença permissiva Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), com atribuição a "Juan Linietsky, Ariel Manzur e a comunidade Godot Engine."
zh_cn: 该附带文档的所有内容均在宽松的知识共享署名3.0 ( `CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_ ) 许可下发布，署名为“Juan Linietsky、Ariel Manzur和Godot引擎社区”。

source: Logos and icons are generally under the same Creative Commons license. Note that some third-party libraries included with Godot's source code may have different licenses.
el: Τα λογότυπα και τα εικονίδια είναι συνήθως κάτω από την ίδια άδεια Creative Commons. Σημείωσε ότι μερικές βιβλιοθήκες τρίτων που συμπεριλαμβάνονται στον πηγαίο κώδικα της Godot, μπορεί να έχουν διαφορετικές άδειες χρήσης.
ja: ロゴ、アイコンはクリエイティブ・コモンズ・ライセンス下で管理しています。補足としてサードパーティライブラリには、Godotのソースコードとは違うライセンスを含んでいる可能性があります。
ko: 로고와 아이콘은 일반적으로 동일한 크리에이티브 커먼스 라이선스 하에 속합니다. Godot의 소스 코드에 포함된 일부 제 3자 라이브러리는 다른 라이선스가 적용될 수 있으므로 유의하세요.
pt_br: Logomarcas e ícones geralmente estão sob a mesma licença Creative Commons. Note que algumas bibliotecas de terceiros incluídas no código-fonte do Godot podem ter licenças diferentes.
th: โลโก้และไอคอนส่วนใหญ่อยู่ภายใต้สัญญาอนุญาตครีเอทีฟคอมมอนส์แบบเดียวกัน โปรดทราบว่าบางไลบรารีที่มากับโค้ดของ Godot อาจใช้สัญญาอนุญาตอื่น
zh_cn: Logo徽标和图标均在相同的CC共享许可下。注意，Godot的源代码中包含的某些第三方库可能具有不同的许可。

source: For full details, look at the `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ as well as the `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ and `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_ files in the Godot repository.
el: Για πλήρεις λεπτομέρειες, κοίταξτε το `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ , `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ και `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_ στο αποθετήριο κώδικα της Godot.
ja: 詳細はGodotリポジトリの、\ `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_\ または `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_\ と\ `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_\ ファイルをご覧ください。
ko: 전체 세부 사항은 Godot 저장소에 있는 `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_\ 와 `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_, `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_ 파일을 참고하세요.
pt_br: Para mais detalhes, dê uma olhada nos arquivos `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_,`LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ e `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_ no repositório de Godot.
th: อ่านรายละเอียดทั้งหมดได้ใน `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ รวมทั้ง `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ และ `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_ ใน repository ของ Godot
zh_cn: 有关详细信息，请查看Godot存储库中的 `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ 以及 `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ 和 `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_ 文件。

source: Also, see `the license page on the Godot website <https://godotengine.org/license>`_.
ja: また、\ `Godotウェブサイトのライセンス情報ページ <https://godotengine.org/license>`_\ も見てみて下さい。
ko: `Godot 웹 사이트의 라이선스 페이지 <https://godotengine.org/license>`_\ 도 참고하세요.
pt_br: Veja também a página da Licença no site de Godot <https://godotengine.org/license>`_.
zh_cn: 还可以查阅 `Godot网站上的许可页面 <https://godotengine.org/license>`_。

source: Which platforms are supported by Godot?
el: Ποιες πλατφόρμες υποστηρίζονται από την Godot;
ja: Godotが対応するプラットフォームは？
ko: Godot는 어떤 플랫폼을 지원하나요?
pt_br: Quais plataformas são suportadas por Godot?
th: Godot สนับสนุนแพล็ตฟอร์มใดบ้าง?
zh_cn: Godot支持哪些平台？

source: **For the editor:**
el: **Για τον συντάκτη:**
ja: **エディタ:**
ko: **편집기의 경우:**
pt_br: **Para o editor:**
th: **สำหรับตัวโปรแกรม:**
zh_cn: **编辑器：**

source: **For exporting your games:**
el: **Για εξαγωγή των παιχνιδιών σας:**
ja: **ゲームの書き出し:**
ko: **내보내는 게임의 경우:**
pt_br: **Para exportar seus jogos:**
th: **สำหรับส่งออกเกม:**
zh_cn: **导出游戏：**

source: Windows (and UWP)
el: Windows (και UWP)
ja: Windows (およびUWP)
ko: Windows (그리고 UWP)
pt_br: Windows (e UWP)
th: วินโดวส์ (และ UWP)
zh_cn: Windows(包括 UWP)

source: Web
el: Ιστός
ja: ウェブ
ko: 웹
th: เว็บ

source: Both 32- and 64-bit binaries are supported where it makes sense, with 64 being the default.
ja: デフォルトは64ビットですが、場合に応じて32ビットと64ビット両方に対応しています。
ko: 64비트가 기본이지만 32비트와 64비트 모두 지원합니다.
pt_br: Ambos os binários de 32 e 64 bits são suportados onde fizerem sentido, sendo 64 o padrão.
zh_cn: 同时支持32位和64位的二进制文件，默认为64位。

source: Some users also report building and using Godot successfully on ARM-based systems with Linux, like the Raspberry Pi.
ja: Raspberry Piのような、ARMベースのLinuxマシンでGodotが動作したという報告もいくつかあります。
ko: 일부 사용자들은 Linux로 Raspberry Pi와 같은 ARM 기반 시스템에 Godot를 성공적으로 빌드하고 사용했다고 말합니다.
pt_br: Alguns usuários também relatam terem compilado e utilizado o Godot com êxito em sistemas baseados em ARM com Linux, como Raspberry Pi.
zh_cn: 一些用户还报告在使用Linux的基于ARM的系统上成功构建和使用Godot，如树莓派 。

source: Additionally, there is some unofficial third-party work being done on building for some consoles. However, none of this is included in the default build scripts or export templates at this time.
ja: それに加えて、コンソール機向けに第三者による非公式のビルドがいくつかあります。しかし、現時点では標準のビルドスクリプトや書き出しテンプレートには含まれていません。
ko: 추가적으로 콘솔로 빌드하기 위한 비공식적인 제 3자의 작업이 있습니다. 하지만 아직 그 중 기본 빌드 스크립트나 내보내기 템플릿을 포함한 것은 없습니다.
pt_br: Existe também um esforço não-oficial sendo feito para compilar para alguns consoles. Porém, nada disso está incluído nos scripts padrão de compilação ou nos modelos de exportação.
zh_cn: 此外，还有一些非官方的第三方工作正在为一些游戏机构建。 但是，目前默认构建脚本或导出模板中都不包含这些内容。

source: For more on this, see the sections on :ref:`exporting <toc-learn-workflow-export>` and :ref:`compiling Godot yourself <toc-devel-compiling>`.
el: Για περισσότερα πάνω σε αυτό, δείτε τις ενότητες :ref:`Εξαγωγή <toc-learn-workflow-export>` και :ref:`Μεταγλώτηση της Godot <toc-devel-compiling>`.
ja: 詳しくは、\ :ref:`書き出しについて <toc-learn-workflow-export>`\ の節や\ :ref:`Godotをコンパイルする <toc-devel-compiling>`\ をご参照ください。
ko: 자세한 정보는 :ref:`내보내기 <toc-learn-workflow-export>`\ 와 :ref:`Godot를 직접 컴파일하기 <toc-devel-compiling>`\ 를 다루는 섹션을 참고하세요.
pt_br: Para mais informações, veja as seções :ref:`Exportando <toc-learn-workflow-export>` e :ref:`Compilando Godot você mesmo <toc-devel-compiling>`.
th: ศึกษารายละเอียดเพิ่มเติมได้ที่ :ref:`การส่งออก <toc-learn-workflow-export>` และ :ref:`คอมไพล์ Godot ด้วยตนเอง <toc-devel-compiling>`
zh_cn: 有关这方面的更多信息，请参阅 :ref:`导出 <toc-learn-workflow-export>` 和 :ref:`编译Godot <toc-devel-compiling>` 章节。

source: Which programming languages are supported in Godot?
ja: Godotが対応するプログラミング言語は？
ko: Godot는 어떤 프로그래밍 언어를 지원하나요?
pt_br: Quais linguagens de programação são suportadas pelo Godot?
zh_cn: Godot支持哪些编程语言？

source: The officially supported languages for Godot are GDScript, Visual Scripting, C#, and C++. See the subcategories for each language in the :ref:`scripting <toc-learn-scripting>` section.
ja: Godotが公式対応している言語は、GDScript、ビジュアルスクリプト、C#、およびC++です。それぞれの言語についてのサブカテゴリーは\ :ref:`スクリプト <toc-learn-scripting>`\ セクションにあります。
ko: Godot가 공식으로 지원하는 언어는 GDScript, Visual Scripting, C#, 그리고 C++입니다. :ref:`스크립팅 <toc-learn-scripting>` 섹션에서 각 언어 별 하위 카테고리를 참고하세요.
pt_br: As linguagens suportadas oficialmente em Godot são GDScript, Visual Scripting, C# e C++. Veja as subcategorias para cada linguagem na seção de :ref:`scripting <toc-learn-scripting>`.
zh_cn: Godot官方支持的语言是GDScript、Visual Scripting、C＃和C ++。 请参阅 :ref:`编写脚本 <toc-learn-scripting>` 章节中的每种语言的子类别。

source: If you are just starting out with either Godot or game development in general, GDScript is the recommended language to learn and use since it is native to Godot. While scripting languages tend to be less performant than lower-level languages in the long run, for prototyping, developing Minimum Viable Products (MVPs), and focusing on Time-To-Market (TTM), GDScript will provide a fast, friendly, and capable way of developing your games.
ja: 初めてGodotを使う人や、これからゲーム開発を始める人には、Godot内蔵のGDScriptがおすすめです。スクリプト言語はより低水準な言語に比べて、必ずしも長期的には最適ではありません。しかし試作や、実用最小限の製品(MVP)の開発、製品化への時間(TTM)を重視する場合、GDScriptはゲーム開発のためのスピーディで親しみやすい、有用な手段になります。
ko: 대개 Godot 개발이나 게임 개발을 목적으로 엔진을 켜게 된다면, Godot에 네이티브로 동작하는 GDScript를 배우고 사용하는데 추천하는 언어입니다. 스크립트 언어는 장기적인 면에서 다른 로우 레벨 언어보다 퍼포먼스가 떨어지는 경향이 있습니다. 하지만 시제품 제작이나 최소 기능 제품(MVP)을 개발하기 위해서, 그리고 판매할 때까지 걸리는 시간(TTM)에 중점을 둔다면, GDScript는 게임을 개발하는데 빠르고, 친절하고, 유능한 방법을 제공할 것입니다.
pt_br: Se você está apenas começando com o Godot ou desenvolvimento de jogos em geral, GDScript é a linguagem recomendada para aprender e usa, uma vez que é nativa ao Godot. Enquanto linguagens de script tendem a ter menos performance que liguagens de menor nível, para prototipagem, desenvolvimento de Minimum Viable Products (MVPs), e focar em Time-To-Market (TTM), GDScript vai fornecer um modo rápido, amigável e capaz de desenvolver seus jogos.
zh_cn: 如果您刚刚开始使用Godot或游戏开发，GDScript是学习和使用的推荐语言，因为它是Godot的本地语言。 虽然从长远来看，脚本语言的性能往往低于低级语言，但对于原型设计、开发最小可行产品(MVP)以及专注于上市时间(TTM)，GDScript将提供快速、友好和胜任的方式用于开发游戏。

source: Note that C# support is still relatively new, and as such, you may encounter some issues along the way. Our friendly and hard-working development community is always ready to tackle new problems as they arise, but since this is an open-source project, we recommend that you first do some due diligence yourself. Searching through discussions on `open issues <https://github.com/godotengine/godot/issues>`_ is a great way to start your troubleshooting.
ja: C#への対応はまだ比較的新しいため、何らかの問題が生じる可能性があります。当方のフレンドリーで仕事熱心な開発コミュニティーは、新たに浮かんできた問題に挑む準備は万端です。しかし、これはオープンソース・プロジェクトなので、まずはご自身で解決法を探ることを推奨します。トラブルシューティングには最初に、\ `open issues(英語) <https://github.com/godotengine/godot/issues>`_\ 内にて交わされているやりとりを調べてみて下さい。
ko: C# 지원은 비교적 최근에 시작했기 때문에 오류를 발견할 수 있습니다. 우리의 친절하고 부지런한 개발 커뮤니티는 언제나 새 문제를 해결할 준비가 되어있습니다. 하지만 이것은 오픈 소스 프로젝트이므로 스스로 해결해 보는 것을 추천합니다. `Open Issues <https://github.com/godotengine/godot/issues>`_\ 에서 토론을 찾아보는 것도 문제를 해결하는데 좋은 출발점이 될 것입니다.
pt_br: Observe que o suporte ao C# ainda é relativamente novo e, como tal, você pode encontrar alguns problemas ao longo do caminho. Nossa comunidade de desenvolvimento amistosa e trabalhadora está sempre pronta para enfrentar novos problemas à medida que eles surgem, mas como esse é um projeto de código aberto, recomendamos que você faça primeiro uma diligência prévia. Pesquisando através de discussões em `open issues <https://github.com/godotengine/godot/issues>`_ para verificar se há problemas descobertos. Esta é uma ótima maneira de começar sua solução de problemas.
zh_cn: 请注意，C＃的支持仍然相对较初级，因此，使用该语言可能会遇到一些问题。 我们友好且勤奋的开发社区随时准备解决出现的新问题，但由于这是一个开源项目，我们建议您先自己做一些排查。 通过在 `公开问题 <https://github.com/godotengine/godot/issues>`_ 的讨论里进行搜索是开始故障排除的好方法。

source: As for new languages, support is possible via third parties using the GDNative / NativeScript / PluginScript facilities. (See the question about plugins below.) Work is currently underway, for example, on unofficial bindings for Godot to `Python <https://github.com/touilleMan/godot-python>`_ and `Nim <https://github.com/pragmagic/godot-nim>`_.
ja: 新しい言語については、GDNative/NativeScript/PluginScript機能を通じてサードパーティによる対応が可能です。例えば現在、\ `Python <https://github.com/touilleMan/godot-python>`_\ や\ `Nim <https://github.com/pragmagic/godot-nim>`_\ のGodot向け非公式バインディングが開発進行中です。
ko: GDNative / NativeScript / PluginScript 기능을 사용한 제 3자를 통해 새로운 언어를 지원할 수 있습니다. (아래에 플러그인에 관한 질문을 참고하세요.) 예를 들어 Godot에 `Python <https://github.com/touilleMan/godot-python>`_\ 과 `Nim <https://github.com/pragmagic/godot-nim>`_\ 의 비공식 바인딩 개발이 진행 중입니다.
pt_br: Quanto a novas linguagens, é possível oferecer suporte através de terceiros utilizando os recursos GDNative / NativeScript / PluginScript. (Veja abaixo sobre como os plugins funcionam.) Existe trabalho em andamento, por exemplo, para vinculações não oficiais do Godot para `Python <https://github.com/touilleMan/godot-python>`_ e para `Nim <https://github.com/pragmagic/godot-nim>`_.
zh_cn: 对于新语言，可以通过使用GDNative / NativeScript / PluginScript第三方工具获得支持。(请参阅下面关于插件的问题。)目前正在进行工作，例如，关于Godot与 `Python <https://github.com/touilleMan/godot-python>`_ 和 `Nim <https://github.com/pragmagic/godot-nim>`_ 的非官方绑定。

source: What is GDScript and why should I use it?
ja: GDScriptとは何で、それを使う必要性は？
ko: GDScript는 무엇이고 왜 이것을 써야 하나요?
pt_br: O que é GDScript e porque eu devo usá-lo?
zh_cn: GDScript是什么？为什么要用它？

source: GDScript is Godot's integrated scripting language. It was built from the ground up to maximize Godot's potential in the least amount of code, affording both novice and expert developers alike to capitalize on Godot's strengths as fast as possible. If you've ever written anything in a language like Python before then you'll feel right at home. For examples, history, and a complete overview of the power GDScript offers you, check out the :ref:`GDScript scripting guide <doc_gdscript>`.
ja: GDScriptはGodot内蔵のスクリプト言語です。最小のコード行数でGodotの能力を最大限に発揮できるよう、一から設計されています。初心者からエキスパートまで、すばやくGodotの性能を引き出せるようになります。もしPythonのような言語で書いた経験があれば、すぐに馴染めることでしょう。GDScriptのサンプルや歴史、その力の概要を知りたい方は、\ :ref:`GDScriptスクリプティング・ガイド <doc_gdscript>`\ をお読み下さい。
ko: GDScript는 Godot에 통합된 스크립트 언어입니다. 이것은 초심자와 전문 개발자가 동등하게 Godot의 강점을 가능한 빨리 활용할 수 있도록, 짧은 코드로도 Godot의 잠재력을 극대화할 수 있도록 바닥부터 지어졌습니다. 이전에 Python 비슷한 언어를 사용해 보신 적이 있다면 익숙할 것입니다. 예제, 역사, 그리고 GDScript가 가진 힘의 전체 개요는 :ref:`GDScript 스크립팅 가이드 <doc_gdscript>`\ 를 참고하세요.
pt_br: O GDScript é a linguagem de script integrada do Godot. Foi construído a partir do zero para maximizar o potencial do Godot com a menor quantidade de código, ajudando aos desenvolvedores novatos e experientes a usufruir dos pontos fortes do Godot o mais rápido possível. Se você já escreveu alguma coisa em uma linguagem como o Python antes disso, você se sentirá em casa. Para exemplos, histórico e uma visão geral completa do poder que o GDScript oferece, confira nosso guia `GDScript: <gdscript_basics>`_.
zh_cn: GDScript是Godot的集成脚本语言。它是从头开始构建的，为了以最少的代码最大化Godot的潜力，使新手和专家开发人员都能尽可能快地利用Godot的优势。如果你曾经用过像Python这样的语言写过任何东西，那么你会感到宾至如归。如果您想要了解关于GDScript的示例、历史、完整介绍和功能，查看 :ref:`GDScript脚本指南 <doc_gdscript>`。

source: The original intent of creating a tightly integrated, custom scripting language for Godot was two-fold: first, it reduces the amount of time necessary to get up and running with Godot, giving developers a rapid way of exposing themselves to the engine with a focus on productivity; second, it reduces the overall burden of maintenance, attenuates the dimensionality of issues, and allows the developers of the engine to focus on squashing bugs and improving features related to the engine core--rather than spending a lot of time trying to get a small set of incremental features working across a large set of languages.
ja: Godotのために緊密に統合されたカスタムスクリプト言語を作る当初の目的は2つありました:第一に、それはGodotを立ち上げて走らせるのに必要な時間を減らし、開発者が生産性に焦点を当ててエンジンに自分自身をさらす迅速な方法を提供します。第二に、メンテナンスの全体的な負担を軽減し、問題の次元性を低減し、エンジンの開発者が、大きな言語セット全体で動作する小さな追加機能セットを得るために多くの時間を費やすのではなく、バグを取り除き、エンジンコアに関連する機能を改善することに集中できるようにします。
ko: Godot를 위한 맞춤 스크립트 언어를 만들게 된 원래 의도는 두 가지 입니다: 먼저 Godot를 켜고 실행하는 많은 시간을 줄입니다. 개발자는 생산성에 중점을 두고 엔진에 빠르게 접근할 수 있습니다; 두 번째로 전반적인 유지 보수의 부담을 줄여줍니다. 문제의 어려움을 줄이고 엔진 개발자는 엔진 핵심 버그를 없애고 기능을 개선하는데 집중할 수 있습니다--많은 언어에서 작동하는 자잘한 기능들을 얻으려고 많은 시간을 소모하는 일이 없게 됩니다.
pt_br: A intenção original de criar uma linguagem de script personalizada e altamente integrada para Godot era dupla: primeiro, reduz a quantidade de tempo necessária para começar a usar o Godot, oferecendo aos desenvolvedores uma maneira rápida de se expor ao motor com foco na produtividade; segundo, reduz a carga geral de manutenção, atenua a dimensionalidade dos problemas e permite que os desenvolvedores do motor se concentrem em esmagar bugs e melhorar os recursos relacionados ao núcleo do motor--em vez de gastar muito tempo tentando obter um pequeno conjunto de recursos incrementais que funcionam em um grande conjunto de linguagens.
zh_cn: 为Godot创建一个紧密集成的自定义脚本语言的初衷是双重的：首先，关于生产力，它减少了启动和运行Godot所需的时间，使开发人员能够快速接触引擎；其次，它减少了维护的总体负担，减少了问题的维度，并允许引擎的开发人员专注于排除错误并改进与引擎核心相关的功能——而不是花费大量时间来尝试在一大堆语言中获得一小组增量功能。

source: Since Godot is an open-source project, it was imperative from the start to prioritize a more integrated and seamless experience over attracting additional users by supporting more familiar programming languages--especially when supporting those more familiar languages would result in a worse experience. We understand if you would rather use another language in Godot (see the list of supported options above). That being said, if you haven't given GDScript a try, try it for **three days**. Just like Godot, once you see how powerful it is and rapid your development becomes, we think GDScript will grow on you.
ja: Godot はオープンソースプロジェクトなので、よく知られたプログラミング言語をサポートすることでユーザー数を増やそうとするより、より統合されたシームレスな体験を必須要件として優先してきました。あなたがGodotで別の言語(上記のサポートされるオプションのリストを参照してください) を使用したいということは理解します。とはいえ、GDScriptをまだ試していない人は、\ **3日間**\ だけ試してみてください。Godotと同じように、GDScriptがいかに強力であり、開発がいかに迅速になるかを見れば、気に入ってもらえるはずです。
ko: Godot가 오픈 소스 프로젝트가 되면서 부터, 처음부터 더 통합되고 완벽한 경험까지 우선 순위를 정했을 때, 추가 사용자 유치를 위한 더 친근한 프로그래밍 언어를 지원하는 것이 최우선이었습니다--특히 더 친근한 언어를 지원하는 것이 더 나쁜 결과로 이어질 때 그랬습니다. Godot에서 다른 언어를 사용하는 것을 이해합니다 (아래에 지원하는 옵션을 참고하세요). GDScript를 사용하지 않아봤다면, **3 일** 동안 한번 사용해보세요. Godot처럼 GDScript가 강력하고 개발하는 것을 빠르게 하는 것을 보게 된다면, 우리는 GDScript가 성장할 것이라고 생각합니다.
pt_br: Já que Godot é um projeto de código aberto, foi imperativo desde o começo priorizar uma experiência mais integrada ao invés de atrair usuários adicionais suportando linguagens de programação mais familiares--especialmente quando suportar essas linguagens mais familiares resultaria em uma experiência pior. Nós entendemos se você prefere usar alguma outra linguagem no Godot (Veja a lista de opções suportadas acima). Com isso dito, se você não tentou usar o GDScript, experimente por **três dias**. Assim como Godot, uma vez que você vê o quão poderoso e rápido seu desenvolvimento se torna, nos achamos que o GDScript irá crescer em você.
zh_cn: 由于Godot是一个开源项目，因此从一开始就必须优先考虑更加集成和无缝的体验，而不是通过支持更熟悉的编程语言来吸引更多用户——特别是在支持那些更熟悉的语言会导致更糟糕的体验时。 我们理解您更愿意在Godot中使用其他语言(请参阅上面支持的选项列表)。话虽如此，如果你还没试过GDScript，先试 **三天**。就像Godot一样，一旦你看到它有多强大并且开发多迅速，我们认为GDScript将在你的身上得到成长。

source: More information about getting comfortable with GDScript or dynamically typed languages can be found in the :ref:`doc_gdscript_more_efficiently` tutorial.
el: Μπορείτε να βρείτε περισσότερες πληροφορίες σχετικά με την GDScript και γενικά τις γλώσσες δυναμικού τύπου στον οδηγό :ref: `doc_gdscript_more_efficiently`.
ja: GDScriptや他の動的言語を使いこなすための情報は、こちらのチュートリアル\ :ref:`doc_gdscript_more_efficiently`\ にあります。
ko: GDScript 또는 동적 타입 언어에 익숙해지는 더 자세한 정보는 :ref:`doc_gdscript_more_efficiently` 튜토리얼을 참고하세요.
pt_br: Mais informações sobre como ficar mais confortável usando GDScript ou outras linguagens de tipagem dinâmica podem ser encontradas no tutorial :ref:`doc_gdscript_more_efficiently`.
th: ข้อมูลเพิ่มเติมสำหรับการเขียนโปรแกรม GDScript หรือภาษาแบบ dynamically typed ดูได้จาก :ref:`doc_gdscript_more_efficiently`
zh_cn: 有关熟悉GDScript或动态类型语言的更多信息，请参阅 :ref:`doc_gdscript_more_efficiently` 教程。

source: What were the motivations behind creating GDScript?
ja: GDScriptを作った動機はどのようなものですか？
ko: GDScript를 제작하게 된 동기가 무엇입니까?
pt_br: Quais foram as motivações por trás da criação do GDScript?
zh_cn: 创建GDScript背后的动机是什么？
