Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: el, ja, ko, pt_br, th, zh_cn

source: In the early days, the engine used the `Lua <https://www.lua.org>`__ scripting language. Lua is fast, but creating bindings to an object oriented system (by using fallbacks) was complex and slow and took an enormous amount of code. After some experiments with `Python <https://www.python.org>`__, it also proved difficult to embed.
ja: 初期には、このエンジンは `Lua <http://www.lua.org>`_ スクリプト言語を使用していました。Luaは高速ですが、オブジェクト指向システム(フォールバックを使用して)へのバインディングの作成は複雑で時間がかかり、膨大なコードを必要としました。 `Python <https://www.python.org>`_ でいくつかの実験を行った結果、それを埋め込むのは難しいことがわかりました。
ko: 처음에는 `Lua <https://www.lua.org>`__ 스크립팅 언어를 사용했습니다. Lua는 빠르지만, (Fallback을 사용해서) 객체 지향 시스템에 묶는 일은 복잡하고 느리면서도 엄청난 양의 코드가 필요했습니다. `Python <https://www.python.org>`__\ 을 몇 번 사용해봤지만, 포함하기는 어려웠습니다.
pt_br: Em seus primórdios, o motor utilizava a linguagem de script `Lua <http://www.lua.org>`__. Lua é rápida, mas criar ligações com um sistema orientado a objetos (usando fallbacks) era complexo, lento e necessitava de uma quantidade enorme de código. Após alguns experimentos com `Python <http://www.python.org>`__, ela também demonstrou ser difícil de embutir.
zh_cn: 在早期，引擎使用 `Lua <https://www.lua.org>`__ 脚本语言。Lua速度很快，但是创建到面向对象的系统的绑定（通过使用回退）是非常复杂且缓慢的，并且需要大量代码。在用 `Python <https://www.python.org>`__ 进行了一些实验后, 它也被证明是难以嵌入的。

source: The main reasons for creating a custom scripting language for Godot were:
ja: Godot専用のスクリプト言語を作った主な理由は以下の通りです:
ko: Godot를 위한 맞춤 스크립트 언어를 개발하게 된 주요 이유는 이러합니다:
pt_br: As principais razões para criação de uma linguagem personalizada para Godot foram:
zh_cn: 为Godot创建自定义脚本语言的主要原因是：

source: Poor threading support in most script VMs, and Godot uses threads (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
ko: 대부분의 스크립트 가상 머신에서 스레드 지원이 좋지 않습니다. 하지만 Godot은 스레드를 사용합니다 (Lua, Python, Squirrel, JS, AS 등).
pt_br: Não há um bom suporte a threads na maioria das VMs de scripting, e o Godot utiliza threads (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
zh_cn: 大多数脚本语言(Lua、Python、Squirrel、JS、AS等)的虚拟机(VM)对线程的没有很好的支持，但Godot需要使用线程。

source: Poor class-extending support in most script VMs, and adapting to the way Godot works is highly inefficient (Lua, Python, JavaScript).
ko: 대부분의 스크립트 가상 머신은 클래스 확장 지원이 부족하고 Godot의 작동 방식에 맞춰 변형하자면 너무 비효율적입니다 (Lua, Python, JS).
pt_br: Não há um bom suporte a extensão de classes na maioria das VMs de scripting, e adaptá-las para a forma como o Godot funciona é altamente ineficiente (Lua, Python, JavaScript).
zh_cn: 大多数脚本语言(Lua、Python、JS)的虚拟机没有很好地支持类扩展，适配Godot工作方式的效率极低。

source: Many existing languages have horrible interfaces for binding to C++, resulting in large amount of code, bugs, bottlenecks, and general inefficiency (Lua, Python, Squirrel, JavaScript, etc.) We wanted to focus on a great engine, not a great amount of integrations.
ko: 많은 존재하는 언어들은 C++ 바인딩을 위한 끔찍한 인터페이스를 갖고 있습니다. 코드 양이 많아지고 버그, 병목, 그리고 전반적으로 비효율적입니다 (Lua, Python, Squirrel, JS 등.) 우리는 많은 통합이 아닌 좋은 엔진에 중점을 두고 싶었습니다.
pt_br: Muitas linguagens existentes têm interfaces terríveis entre si e o C++, resultando em uma grande quantidade de código, bugs, gargalos e ineficiência em geral (Lua, Python, Squirrel, JavaScript e etc). Nós queríamos focar em uma engine incrível, e não em uma incrível quantidade de integrações.
zh_cn: 许多现有语言具有绑定到C ++的糟糕接口，会导致产生大量代码、错误、瓶颈和普遍的效率低下(Lua、Python、Squirrel、JS等)。我们希望专注于一个更好的引擎，而不是大量的整合。

source: No native vector types (vector3, matrix4, etc.), resulting in highly reduced performance when using custom types (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
ko: 자체적인 벡터 유형이 없어서 (vector3, matrix4 등) 맞춤 유형을 사용하게 되고 성능이 크게 감소합니다 (Lua, Python, Squirrel, JS, AS 등).
pt_br: Não existem tipos de vetor nativos (vector3, matrix4, etc.), resultando em uma performance muito reduzida ao usar tipos personalizados (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
zh_cn: 没有原生向量类型(vector3、matrix4等)，导致使用自定义类型实现时性能大大降低(Lua、Python、Squirrel、JS、AS等)。

source: Garbage collector results in stalls or unnecessarily large memory usage (Lua, Python, JavaScript, ActionScript, etc.).
ko: (Lua, Python, JavaScript, ActionScript 등의) 가비지 컬렉터는 속도저하와 불필요한 많은 메모리 사용을 초래합니다.
pt_br: Coletor de lixo resulta em atrasos e um grande uso desnecessário de memória (Lua, Python, JavaScript, ActionScript, etc.).
zh_cn: 垃圾收集器导致停顿或不必要的大内存使用(Lua、Python、JS、AS等)。

source: Difficulty to integrate with the code editor for providing code completion, live editing, etc. (all of them). This is well-supported by GDScript.
ko: 코드 완성, 실시간 편집 등 (이 전부를) 지원하기 위한 코드 편집기 통합이 까다롭습니다. GDScript는 이 부분을 잘 지원합니다.
pt_br: Dificuldade de integração com o editor de código para fornecer complementação de código, edição em tempo real, e etc. (todas elas). Isso é muito bem suportado por GDScript.
zh_cn: 难以与Godot代码编辑器集成从而支持代码补全、动态编辑等。(所有这些语言)。但这方面GDScript支持得很好。

source: GDScript was designed to curtail the issues above, and more.
ko: GDScript는 위의 문제 등을 줄이기 위해 설계되었습니다.
pt_br: O GDScript foi projetado para reduzir os problemas acima, e mais.
zh_cn: GDScript为减少上述问题以及更多问题而设计。

source: What type of 3D model formats does Godot support?
ja: Godotはどんな3Dモデルフォーマットをサポートしていますか？
ko: Godot는 어떤 유형의 3D 모델 형식을 지원합니까?
pt_br: Quais tipos de formatos de modelos 3D são suportados por Godot?
zh_cn: Godot支持哪些3D模型格式?

source: Godot supports Collada via the `OpenCollada <https://github.com/KhronosGroup/OpenCOLLADA/wiki/OpenCOLLADA-Tools>`_ exporter (Maya, 3DSMax). If you are using Blender, take a look at our own `Better Collada Exporter <https://godotengine.org/download>`_.
ja: Godotは、\ `OpenCollada <https://github.com/KhronosGroup/OpenCOLLADA/wiki/OpenCOLLADA-Tools>`_ エクスポーターを介してColladaをサポートしています(Maya、3DSMax)。 Blenderを使用している場合は、我々の `Better Collada Exporter <https://godotengine.org/download>`_ をご確認ください。
ko: Godot는 Collada를 지원하기 때문에 Maya나 3DS Max를 사용한다면 가장 호환성이 좋은 `OpenCollada <https://github.com/KhronosGroup/OpenCOLLADA/wiki/OpenCOLLADA-Tools>`_ 내보내기 도구를 살펴보세요. Blender를 사용한다면 우리가 만든 `Better Collada Exporter <https://godotengine.org/download>`_ 를 살펴보세요.
pt_br: Dito isso, o suporte a Collada por Godot é bom. Por favor, use o exportador `OpenCollada <https://github.com/KhronosGroup/OpenCOLLADA/wiki/OpenCOLLADA-Tools>`_ para maior compatibilidade se você estiver usando Maya ou 3DS Max. Se você estiver usando Blender, dê uma olhada no nosso próprio `Exportador Better Collada <https://godotengine.org/download>`_.
zh_cn: 即便如此，Godot对Collada的支持非常好，如果您在用Maya或3DS Max，请使用 `OpenCollada <https://github.com/KhronosGroup/OpenCOLLADA/wiki/OpenCOLLADA-Tools>`_ 导出，以便得到最大程度地兼容。如果您使用的是Blender，可以用我们的 `Better Collada Exporter <https://godotengine.org/download>`_。

source: As of Godot 3.0, glTF is supported.
ja: Godot 3.0の時点で、glTFをサポートしています。
ko: Godot 3.0부터 glTF를 지원합니다.
pt_br: A partir de Godot 3.0, glTF é suportado.
zh_cn: Godot从3.0版本开始支持gITF。

source: FBX is supported via the Open Asset Import library. However, FBX is proprietary so we recommend using other formats listed above, if suitable for your workflow.
ja: FBXは、Open Asset Importライブラリを介してサポートされています。ただし、FBXはプロプライエタリですので、ワークフローに適している場合は、上記の他の形式を使用することをお勧めします。
ko: FBX는 Open Asset Import 라이브러리를 통해 지원됩니다. 하지만 FBX는 독점이므로 워크플로우에 적합한 경우, 위에 나열된 다른 형식을 사용하는 것을 권장합니다.
pt_br: FBX é suportado através da biblioteca Open Asset Import. No entanto, fbx é proprietário, por isso recomendamos o uso de outros formatos listados acima, se adequado para o seu fluxo de trabalho.
zh_cn: FBX可以通过开源的插件来支持。因此，我们建议您在适合您的工作流程的情况下使用上面列出的其他格式。

source: Will [insert closed SDK such as FMOD, GameWorks, etc.] be supported in Godot?
ja: Godotでは(FMODやGameWorksなどの)クローズドSDKの組み込みがサポートされますか?
ko: Godot에서 [FMOD, GameWorks 등 클로즈 SDK]가 지원될까요?
pt_br: A [insira aqui uma SDK fechada como PhysX, GameWorks, etc.] será suportada no Godot?
zh_cn: 能否在Godot中加入闭源SDK，比如FMOD、GameWorks等？

source: The aim of Godot is to create a free and open-source MIT-licensed engine that is modular and extendable. There are no plans for the core engine development community to support any third-party, closed-source/proprietary SDKs, as integrating with these would go against Godot's ethos.
ja: Godotの目的は、モジュール式で拡張可能な自由でオープンソースのMITライセンスエンジンを作成することです。コアエンジン開発コミュニティは、サードパーティのクローズドソース/プロプライエタリSDKについては、これらとの統合がGodotの精神に反するとして、サポートする計画はありません。
ko: Godot의 목표는 모듈 방식이고 확장 가능한 무료이자 오픈 소스 MIT 라이선스 엔진을 만드는 것입니다. 핵심 엔진 개발 커뮤니티가 클로즈 소스/독점 SDK를 지원하도록 하는 계획은 없습니다. 이것들을 통합하는 것은 Godot의 정신에 반대되는 것입니다.
pt_br: O objetivo do Godot é criar um motor gratuito com licença MIT de código aberto que seja modular e extensível. Não há planos para que a comunidade de desenvolvimento do motor dê suporte a qualquer SDK de terceiros, de código fechado/proprietário, já que a integração com estes seriam contra a filosofia do Godot.
zh_cn: Godot的目的是创建一个遵循免费开源MIT许可的引擎，而且是模块化和可扩展的。核心引擎开发社区没有计划支持任何第三方、闭源或专有SDK，因为这些SDK的集成会违背Godot的精神。

source: That said, because Godot is open-source and modular, nothing prevents you or anyone else interested in adding those libraries as a module and shipping your game with them--as either open- or closed-source.
ja: とはいえ、Godot はオープンソースかつモジュラーであるため、ライブラリがオープンソースかクローズドソースであるかに関わりなく、それらをモジュールとして追加して、ゲームを出荷することを妨げるものは何もありません。
ko: 즉, Godot는 오픈 소스이고 모듈화 되어있으므로, 어느 누구라도 클로즈 SDK를 모듈로 추가해서 여러분의 게임에 사용해 출시해도 무방합니다--오픈 소스든지 클로즈 소스든지 말이죠.
pt_br: Assim, sendo de código aberto e modular, nada impede que você ou qualquer outra pessoa interessada adicione essas bibliotecas como um módulo e publique seu jogo com elas, seja em código aberto ou fechado. Tudo é permitido.
zh_cn: 也就是说，正因为Godot是开源和模块化的，所以没有什么能阻止你或其他任何感兴趣的人将这些库添加为模块并使用它们——无论是开源还是闭源——发布游戏。

source: To see how support for your SDK of choice could still be provided, look at the Plugins question below.
ja: 選択したSDKのサポートがどのように提供されるのかを確認するには、以下のプラグインの質問を参照してください。
ko: 선택한 SDK에 대한 지원이 어떻게 제공되는지 알아보려면 아래 플러그인 질문을 참고하세요.
pt_br: Para ver como prover suporte a seu SDK de preferência, veja a pergunta sobre Plugins acima.
zh_cn: 如欲了解如何支持您使用的SDK，请查看下面的插件问题。

source: If you know of a third-party SDK that is not supported by Godot but that offers free and open-source integration, consider starting the integration work yourself. Godot is not owned by one person; it belongs to the community, and it grows along with ambitious community contributors like you.
ja: Godotではサポートされていないが、自由でオープン ソースの統合を提供するサードパーティ製のSDKがわかっている場合は、統合作業を自分で開始することを検討してください。Godotは一人の人間が所有しているわけではありません。それはコミュニティに属し、あなたのような野心的なコミュニティへの貢献者と一緒に成長します。
ko: 혹시 Godot이 지원하진 않지만 무료이고 오픈 소스로 제공하는 다른 SDK를 안다면 직접 통합 작업을 시작해보세요. Godot은 한 사람의 것이 아닙니다; 커뮤니티에 속해 있고 당신과 같은 야심 찬 커뮤니티 기여자들과 함께 자랍니다.
pt_br: Se você conhece uma SDK de terceiros que não é suportada por Godot mas que oferece uma integração livre e de código aberto, considere a começar a trabalhar na integração por si mesmo. Godot não é propriedade de uma pessoa; ela pertence à comunidade e cresce junto com contribuidores ambiciosos da comunidade como você.
zh_cn: 如果您知道Godot不支持但是想提供免费和开源集成的第三方SDK，请考虑自己开始集成工作。Godot不属于一个人；它属于社区，它与像您一样雄心勃勃的社区贡献者一起成长。

source: Why does Godot use Vulkan or OpenGL instead of Direct3D?
ko: Godot가 Direct3D 대신 Vulkan 또는 OpenGL을 사용하는 이유는 무엇인가요?

source: Godot aims for cross-platform compatibility and open standards first and foremost. OpenGL and Vulkan are the technologies that are both open and available (nearly) on all platforms. Thanks to this design decision, a project developed with Godot on Windows will run out of the box on Linux, macOS, and more.
ko: Godot는 무엇보다도 플랫폼 간 호환성과 개방형 표준을 목표로합니다. OpenGL과 Vulkan은 개방적이고 (거의) 모든 플랫폼에서 사용할 수있는 기술입니다. 이 디자인 결정 덕분에 Windows에서 Godot로 개발 된 프로젝트는 Linux, macOS 등에서 즉시 실행됩니다.

source: Since Godot only has a few people working on its renderer, we would prefer having fewer rendering backends to maintain. On top of that, using a single API on all platforms allows for greater consistency with fewer platform-specific issues.
ko: Godot는 렌더러 작업하는 사람이 적기 때문에, 유지 관리 할 렌더링 백엔드가 더 적은 것을 선호합니다. 또한 모든 플랫폼에서 단일 API를 사용하면서 플랫폼 별 문제를 줄이고 일관성을 높입니다.

source: In the long term, we may develop a Direct3D 12 renderer for Godot (mainly for the Xbox's purposes), but Vulkan and OpenGL will remain the default rendering backends on all platforms, including Windows.
ko: 장기적으로, 우리가 Direct3D 12 렌더러를 (주로 Xbox 용) 개발할 가능성은 있지만, Vulkan 및 OpenGL은 Windows를 포함한 모든 플랫폼에서 기본 렌더링 백엔드로 남을 것입니다.

source: Why does Godot aim to keep its core feature set small?
ko: 왜 Godot은 주요 특징을 작게 유지하려고 하나요?

source: Godot intentionally does not include features that can be implemented by add-ons unless they are used very often. One example of this would be advanced artificial intelligence functionality.
ko: Godot은 매우 자주 쓰이지 않는 이상 의도적으로 add-on으로 구현할 수 있는 기능들은 포함하지 않습니다. 고급 인공 지능 같은 것이 좋은 예입니다.

source: There are several reasons for this:
ko: 이렇게 하려는 이유가 몇 가지 있습니다:

source: **Code maintenance and surface for bugs.** Every time we accept new code in the Godot repository, existing contributors often take the reponsibility of maintaining it. Some contributors don't always stick around after getting their code merged, which can make it difficult for us to maintain the code in question. This can lead to poorly maintained features with bugs that are never fixed. On top of that, the "API surface" that needs to be tested and checked for regressions keeps increasing over time.
ko: ** 코드 유지 보수 와 버그 관리** 매번 우리가 Godot 리포지터리(repository)에 새로운 코드를 받을 때마다, 그 코드의 contributors(기여자/참여자)는 종종 이것을 유지하는 책임을 집니다. 어떤 contributors은 그들이 제출한 코드가 merge된 뒤에는 계속 관심을 두지 않습니다. 그래서 이러한 경우 문제 있는 코드를 유지하는 것이 어려워 집니다. 이러한 상황은 기능들이 제대로 보수되지 않고 버그투성이인 상태로 남게 됩니다. 결국, 회귀를 위해 테스트하고 검사해야 하는 "API surface"는 시간이 흐름에 따라 계속 증가합니다.

source: **Ease of contribution.** By keeping the codebase small and tidy, it can remain fast and easy to compile from source. This makes it easier for new contributors to get started with Godot, without requiring them to purchase high-end hardware.
ko: **쉬운 기여하기.** 코드베이스를 작고 깨끗하게 유지함으로써, 전체 소스를 컴파일하는 것이 빠르고 쉽게 유지될 것입니다. 이것은 새로운 기여자들이 비싼 하드웨어없이도 Godot을 시작하기 쉽게 만들 것입니다.

source: **Keeping the binary size small for the editor.** Not everyone has a fast Internet connection. Ensuring that everyone can download the Godot editor, extract it and run it in less than 5 minutes makes Godot more accessible to developers in all countries.
ko: **편집기의 바이너리 크기를 작게 하기.** 모두가 빠른 인터넷 회선을 가지고 있지 않습니다. 아무라도 Godot 편집기를 5분안에 내려받고, 압축을 풀고, 실행할 수 있게 한다면, 전 세계의 개발자들이 Godot에 더 쉽게 접근할 것입니다.

source: **Keeping the binary size small for export templates.** This directly impacts the size of projects exported with Godot. On mobile and web platforms, keeping file sizes low is primordial to ensure fast installation and loading on underpowered devices. Again, there are many countries where high-speed Internet is not readily available. To add to this, strict data usage caps are often in effect in those countries.
ko: **템플릿 내보내기를 위한 바이너리 크기를 작게하기.** 이것은 Godot에서 내보낸 프로젝트 크기에 영향을 끼칩니다. 모바일이나 웹 환경에서는, 파일 크기를 최소화하는 것이 성능이 낮은 기계에서 빠른 설치와 로딩에 도움을 줍니다. 다시 말하자면, 지구 상에는 고속 인터넷이 불가능한 나라가 아직 많습니다. 추가로, 이런 나라들에서는 데이터 사용량을 제한하는 것도 효과가 있습니다.

source: For all the reasons above, we have to be selective of what we can accept as core functionality in Godot. This is why we are aiming to move some core functionality to officially supported add-ons in future versions of Godot. In terms of binary size, this also has the advance of making you pay only for what you actually use in your project. (In the meantime, you can :ref:`compile custom export templates with unused features disabled <doc_optimizing_for_size>` to optimize the distribution size of your project.)
ko: 위의 모든 이유에 의해, 우리는 어떤 것을 Godot의 핵심 기능으로 넣을 지 선택해야만 합니다. 이것이 우리가 일부 핵심 기능들을 미래의 Godot버전에서 공식 지원 add-on으로 만들려는 이유입니다. 바이너리 크기면에서, 프로젝트에 실제 사용하는 것만을 포함하게 하는 장점이 있습니다. (그 동안, 프로젝트의 배포 크기를 최적화하기 위해 :ref:`사용하지 않는 기능을 비활성화하는 사용자 지정 내보내기 템플릿을 컴파일 <doc_optimizing_for_size>` 할 수 있습니다.)

source: How should assets be created to handle multiple resolutions and aspect ratios?
el: Πώς θα μπορούσαν να δημιουργηθούν πόροι (assets) που να χειρίζονται πολλαπλές αναλύσεις και αναλογίες οθόνης;
ja: 複数の解像度やアスペクト比に対応するアセットを作成するにはどうすればよいですか？
ko: 다양한 해상도와 화면 비율에 맞는 에셋을 어떻게 만듭니까?
pt_br: Como devem ser criados os ativos para lidar com múltiplas resoluções ou razões de aspecto?
th: จะสร้างไฟล์ภาพอย่างไรให้รองรับความละเอียดและสัดส่วนหน้าจอที่หลากหลาย?
zh_cn: 如果要适配多种分辨率和纵横比，素材应做哪些处理？

source: This question pops up often and it's probably thanks to the misunderstanding created by Apple when they originally doubled the resolution of their devices. It made people think that having the same assets in different resolutions was a good idea, so many continued towards that path. That originally worked to a point and only for Apple devices, but then several Android and Apple devices with different resolutions and aspect ratios were created, with a very wide range of sizes and DPIs.
el: Αυτή η ερώτηση εμφανίζεται συχνά και οφείλεται πιθανότατα στην παρεξήγηση που δημιούργησε η Apple όταν αρχικά διπλασίασε την ανάλυση των συσκευών της. Έκανε τους ανθρώπους να πιστεύουν ότι η κατοχή ιδίων στοιχείων σε διαφορετικές αναλύσεις οθόνης ήταν μια καλή ιδέα, έτσι πολλοί συνέχισαν αυτή την κατεύθυνση. Αυτό αρχικά λειτούργησε ως ένα σημείο και μόνο για τις συσκευές της Apple, αλλά στη συνέχεια δημιουργήθηκαν αρκετές συσκευές Android και Apple με διαφορετικές αναλύσεις και αναλογίες διαστάσεων, με ένα πολύ ευρύ φάσμα μεγεθών και DPIs.
ja: この質問は頻繁に出てきますが、これはおそらくAppleが当初デバイスの解像度を2倍にしたときに起こした誤解のせいでしょう。同じアセットを異なる解像度で持つことは良い考えだと人々に思わせ、多くの人がその道に向かって進み続けました。当初はAppleのデバイスのみであり、ある程度はうまくいっていましたが、その後、解像度とアスペクト比の異なる複数のAndroidとAppleのデバイスが作られたことで、サイズとDPIの幅が非常に広くなりました。
ko: 이런 고민은 아마도 Apple사가 언젠가 자사 제품의 해상도를 두 배로 늘렸을 때 생긴 오해 때문인 것으로 보입니다. 이 때문에 사람들은 다양한 해상도의 같은 에셋을 갖는 것이 좋은 아이디어라 생각하게 되었습니다. 그런데 이런 통념은 짧은 기간 Apple 제품에 한에서는 적용이 되었지만, 얼마 지나지 않아 다양한 해상도와 화면 비율, DPI 를 갖는 Android 기기들과 Apple 기기들이 시장에 나오면서 이제는 불필요한 일이 되었습니다.
pt_br: Essa pergunta aparece com frequência e provavelmente por conta do desentendimento criado pela Apple quando eles dobraram a resolução de seus dispositivos. Isso fez as pessoas pensarem que ter os mesmos conteúdos em diferentes resoluções era uma boa ideia, então muitos continuaram nesse caminho. Aquilo funcionou até certo ponto e só em dispositivos Apple, mas então vários dispositivos Apple e Android com diferentes resoluções e aspectos foram criados, e com uma variedade enorme de tamanhos e DPIs.
th: คำถามนี้พบได้บ่อยและความเข้าใจผิดนี้น่าจะมีต้นเหตุมาจากการที่ Apple เพิ่มความละเอียดของหน้าจอขึ้นสองเท่า ทำให้ผู้ใช้คิดว่าจะต้องสร้างรูปเดียวกันหลายขนาด ซึ่งวิธีนี้ได้ผลดีเฉพาะกับอุปกรณ์ของ Apple เท่านั้น ต่อมาทั้งทาง Android และ Apple ก็ผลิตอุปกรณ์ที่มีความละเอียดและสัดส่วนหน้าจอหลากหลาย ซึ่งมีขนาดและความหนาแน่นของพิกเซลที่แตกต่างกันไป
zh_cn: 这个问题很常见，可能要归功于苹果公司。苹果一开始将它们的设备分辨率加倍，让人觉得不同分辨率使用相同的素材是个好主意，所以很多人就这么做下去了。起初只有苹果设备这么做，但安卓和后来的苹果设备又有了不同的分辨率和宽高比，它们的大小和DPI变得多种多样。

source: The most common and proper way to achieve this is to, instead, use a single base resolution for the game and only handle different screen aspect ratios. This is mostly needed for 2D, as in 3D it's just a matter of Camera XFov or YFov.
ja: これを実現する最も一般的で適切な方法は、代わりに、ゲームでは単一の基本解像度を使用して、異なる画面アスペクト比のみに対処することです。これが必要になるのは主に2Dにおいてであり、3DではカメラXFov (X視野角) またはYFovの問題になります。
ko: 이제 다양한 기기에 대응할 수 있는 가장 일반적이고 적절한 방법은 2D 게임의 경우 한 해상도에 다양한 화면 비율을 지원해주는 것입니다. 3D 게임에서는 단순히 카메라의 XFov나 YFov를 조절하는 것으로 해결할 수 있습니다.
pt_br: A forma mais comum e apropriada de fazer isso é, na verdade, usar uma resolução base única para o jogo e apenas lidar com as diferentes razões de aspecto. Isso é mais necessário para 2D, pois em 3D é só uma questão de ajuste do campo de visão (XFov e YFov) da câmera.
zh_cn: 最常见和最恰当的处理方法是，为游戏使用单一基本分辨率，并仅处理不同的屏幕宽高比。 这主要是2D游戏所需要做的，因为在3D游戏中它只是相机 XFov或YFov的问题。

source: Choose a single base resolution for your game. Even if there are devices that go up to 2K and devices that go down to 400p, regular hardware scaling in your device will take care of this at little or no performance cost. Most common choices are either near 1080p (1920x1080) or 720p (1280x720). Keep in mind the higher the resolution, the larger your assets, the more memory they will take and the longer the time it will take for loading.
el: Επιλέξτε μια απλή βάση ανάλυσης για το παιχνίδι σας. Ακόμα κι αν υπάρχουν συσκευές που φτάνουν έως τα 2K και συσκευές που πέφτουν σε 400p, η τακτική scaling στη συσκευή σας θα το φροντίσει με ελάχιστο ή καθόλου κόστος απόδοσης. Οι πιο κοινές επιλογές είναι είτε σε 1080p (1920x1080) ή 720p (1280x720). Λάβετε υπόψη σας ότι όσο υψηλότερη είναι η ανάλυση, όσο μεγαλύτερα είναι τα στοιχεία σας, τόσο περισσότερη μνήμη θα καταληφθεί και περισσότερος χρόνος θα χρειαστεί για τη φόρτωση.
ja: ゲームの基本解像度を1つ選択します。2Kあるデバイスであれ、400pだけのデバイスであれ、デバイスの通常のハードウェアスケーリングは、パフォーマンスコストをほとんど又はまったくかけずに対応できます。最も一般的な選択肢は、1080p(1920x1080)または720p(1280x720)です。この解像度が高いほどアセットが大きくなり、メモリの使用量が多くなり、ロードに時間がかかることに注意してください。
ko: 게임을 위한 기본 해상도를 고르세요. 해상도가 2K까지 올라가는 기기나 400p까지 내려가는 기기가 있더라도, 기기 안에 있는 균형 하드웨어 스케일링은 이 점을 성능 비용으로 다루진 않을 것입니다. 대부분의 선택은 1080p (1920x1080)이나 720p (1280x720) 근처입니다. 해상도가 높으면 애셋은 더 커지고 더 많은 메모리를 먹고 더 긴 로딩이 걸릴 것이니 명심하세요.
pt_br: Escolha uma resolução base para seu jogo. Mesmo que existam dispositivos que vão até 2k e outros que desçam até os 400p, o redimensionamento por hardware normal no seu dispositivo vai tomar conta disso a pouco ou nenhum custo de desempenho. As escolhas mais comuns são próximas a 1080p (1920x1080) ou 720p (1280x720). Tenha em mente que, quanto maior a resolução, maiores são os conteúdos, e mais memória eles vão ocupar e mais tempo levará para carregar.
th: เลือกความละเอียดที่เกมของท่านจะรองรับ แม้ว่าอุปกรณ์นั้นจะมีความละเอียดหน้าจอถึง 2K หรือแค่ 400p ฮาร์ดแวร์จะทำการปรับขนาดให้โดยที่เสียประสิทธิภาพเพียงเล็กน้อย ที่นิยมใช้กันจะอยู่ที่ 1080p (1920x1080) หรือ 720p (1280x720) โดยยิ่งความละเอียดสูงจะต้องใช้ภาพขนาดใหญ่ ใช้หน่วยความจำมากขึ้น และทำให้เกมโหลดนานขึ้น
zh_cn: 为游戏选择一个基本分辨率。即使有高达2K的设备和低至400p的设备，设备中的常规硬件缩放也会在很少或没有性能成本的情况下解决这个问题。 最常见的选择是接近1080p（1920x1080）或720p（1280x720）。 请记住，分辨率越高，素材越大，占用的内存就越多，加载所需的时间也就越长。

source: Use the stretch options in Godot; 2D stretching while keeping aspect ratios works best. Check the :ref:`doc_multiple_resolutions` tutorial on how to achieve this.
ja: Godotのストレッチオプションを使用します。アスペクト比を維持したまま2Dストレッチを行うと、最適な結果が得られます。この方法については、チュートリアル\ :ref:`doc_multiple_resolutions`\ を参照してください。
ko: Godot에서 Stretch 설정을 사용해보세요; 화면 비율을 유지하는 2D Stretch가 좋습니다. 사용하는 방법은 :ref:`doc_multiple_resolutions` 튜토리얼에서 확인해보세요.
pt_br: Use as opções de esticamento no Godot, esticando em 2D enquanto mantém o aspecto (proporção) funciona melhor. Veja o tutorial :ref:`doc_multiple_resolutions` sobre como fazer isso.
zh_cn: 使用Godot中的拉伸(Stretch)选项；2D保持宽高比时拉伸效果最好。参阅教程 :ref:`doc_multiple_resolutions` 来学习如何实现它。

source: Determine a minimum resolution and then decide if you want your game to stretch vertically or horizontally for different aspect ratios, or if there is one aspect ratio and you want black bars to appear instead. This is also explained in :ref:`doc_multiple_resolutions`.
ja: 最小解像度を決定し、ゲームを縦横比ごとに垂直または水平に伸ばすかどうか、または縦横比を固定して余白に黒いバーを表示するかどうかを決定します。これについては、\ :ref:`doc_multiple_resolutions`\ でも説明されています。
ko: 최소 해상도를 선택한 다음, 게임의 화면을 다른 화면 비율에 맞게 수직이나 수평으로 펼칠 수 있습니다. 아니면 화면 비율을 유지하는 대신 검은 여백이 나타나게 할 수 있습니다. 이 또한 :ref:`doc_multiple_resolutions`\ 에서 설명합니다.
pt_br: Determine uma resolução mínima e aí decida se você quer que seu jogo estique verticalmente ou horizontalmente para diferentes razões de aspecto, ou se tem uma mínima e você quer que apareçam barras pretas em vez de esticar. Isso também é explicado no passo anterior.
zh_cn: 确定最小分辨率，然后决定是否希望游戏垂直或水平拉伸以获得不同的宽高比，或者如果有一个宽高比并且您希望显示黑条。 这也在 :ref:`doc_multiple_resolutions` 有所解释。
