Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/introduction.po
Languages: ar, ca, da, de, el, es_mx, fi, id, ko, pl, ru, sl, sr_latn, th, uk, vi, zh_cn, zh_tw

source: You can contribute to Godot's documentation by opening issue tickets or sending patches via pull requests on its GitHub `source repository <https://github.com/godotengine/godot-docs>`_, or translating it into your language on `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_.
ar: يمكنك المساهمة في وثائق Godot من خلال فتح تذاكر الإصدار أو إرسال التصحيحات عبر طلبات السحب على GitHub `source repository <https://github.com/godotengine/godot-docs>`_, أو ترجمتها إلى لغتك على `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_.
de: Jeder kann zu Godots Dokumentation beitragen, entweder durch das Erstellen von Issue-Tickets oder durch das Senden von Patches über Pull-Requests an das `Quellverzeichnis <https://github.com/godotengine/godot-docs>` auf Github, oder auch durchs Übersetzen in deine Sprache auf `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_.
el: Μπορείτε να συμβάλλετε στην τεκμηρίωση της Godot, ανοίγοντας ένα issue ticket ή pull request στο `GitHub <https://github.com/godotengine/godot-docs>`_, ή μεταφράζοντας τον στην γλώσσα σας στο `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_.
es_mx: Puedes contribuir a la documentación de Godot abriendo tickets de problemas o enviando parches mediante solicitudes pull en su GitHub `source repository <https://github.com/godotengine/godot-docs>`_, o traduciéndola a tu idioma en `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_.
ko: Godot 문서에 기여하려면 GitHub `소스 저장소 <https://github.com/godotengine/godot-docs>`_\ 에서 이슈를 열거나 Pull Requests로 패치를 보내거나, `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_\ 에서 자국의 언어로 번역할 수 있습니다.
pl: Możesz wspomóc dokumentację Godota poprzez stworzenie informacji o błędach lub tworzenie kodu edytora poprzez pull requesty w naszym repozytorium źródłowym na GitHubie <https://github.com/godotengine/godot-docs>`_, lub poprzez tłumaczenie go do twojego języka za pomocą `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_.
ru: Вы можете внести свой вклад в развитие документации Godot, открывая карточки с вопросами (Оформление билетов), отправляя исправления (Втянуть запрос) в `репозиторий на GitHub <https://github.com/godotengine/godot-docs>`_ или занимаясь переводами на Ваш язык на `Хостинге Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_.
sl: H dokumentaciji Godot lahko prispevate z odpiranjem težavnih kart ali pošiljanjem popravkov preko GitHub `vir repozitorija <https://github.com/godotengine/godot-docs>`_, ali s prevajanjem v svoj jezik na `Domeni Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_.
sr_latn: Možete doprineti Godot-ovoj dokumentaciji otvarajući sporove ili slanjem zakrpa koristeći 'pull' zahteve na Github `source repository <https://github.com/godotengine/godot-docs>`_, ili prevodeći na svoj jezik koristeći `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_.
uk: Ви можете зробити свій внесок у документацію Godot, відкривши "issue tickets", або надсилаючи патчі через "pull requests" у `репозиторії GitHub <https://github.com/godotengine/godot-docs>`_, або перекладаючи її на свою мову на `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_.
zh_cn: 您可以为Godot文档作出贡献，通过在GitHub `源码仓库 <https://github.com/godotengine/godot-docs>`_ 中提出问题，或提交推送请求发送补丁。或者在 `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_ 上把它翻译成您的语言。
zh_tw: 要貢獻到 Godot 的說明文件，你可以在 GitHub `源碼倉庫 <https://github.com/godotengine/godot-docs>`_ 上開 issue 或 pull request，或者是在 `Hosted Weblate <https://hosted.weblate.org/projects/godot-engine/godot-docs/>`_ 上將它翻譯成你的語言。

source: All the contents are under the permissive Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) license, with attribution to "Juan Linietsky, Ariel Manzur and the Godot Engine community".
ar: جميع المحتويات تحت رخصة المشاع الإبداعي 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) license, مع ذكر والنسب ل "Juan Linietsky, Ariel Manzur and the Godot Engine community".
ca: Tot el contigut es troba sota la permisiva llicència Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) amb l'atribució a "Juan Linietsky, Ariel Manzur i la comunitat del motor Godot Engine".
da: Alt indhold er under den tolerante Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) licens, med tilskrivelse til "Juan Linietsky, Ariel Manzur og Godot Engine fællesskabet".
de: Alle Beiträge werden unter der freizügigen Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`) Lizenz unter dem Namen „Juan Linietsky, Ariel Manzur and the Godot Engine community“ veröffentlicht.
el: Όλο το περιεχόμενο βρίσκεται υπό την άδεια Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), με απόδοση "Juan Linietsky, Ariel Manzur και η κοινότητα της Godot".
es_mx: Todo el contenido está bajo la licencia permisiva Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), atribuida a "Juan Linietsky, Ariel Manzur y la comunidad de Godot Engine".
fi: Kaikki sisältö on sallivan Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) lisenssin alaista, liitteellä "Juan Linietsky, Ariel Manzur and the Godot Engine community".
id: Semua konten dibawah lisensi permisif Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), dengan atribusi ke "Juan Linietsky, Ariel Manzur dan komunitas Godot Engine".
ko: 문서의 모든 내용은 크리에이티브 커먼스 저작자 표시 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) 라이선스로 사용할 수 있고, 저작자 표시는 "Juan Linietsky, Ariel Manzur, Godot Engine community"로 하면 됩니다.
pl: Zawartość jest chroniona licencją Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), z dopiskiem "Juan Linietsky, Ariel Manzur and the Godot Engine community".
ru: Всё содержание этой документации находится под разрешающей лицензией Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), за авторством "Juan Linietsky, Ariel Manzur and the Godot Engine community".
sl: Vsebina je licencirana pod odprto Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) licenco, z avtorstvom "Juan Linietsky, Ariel Manzur in skupnosti Godot Engine".
sr_latn: Sav sadržaj je pod popustljivom Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) licencom, sa atribucijom "Juan Linietsky, Ariel Manzur and the Godot Engine community".
th: เนื้อหาทั้งหมดอยู่ภายใต้สัญญาอนุญาตครีเอทีฟคอมมอนส์แบบแสดงที่มา 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) โดยระบุชื่อผู้สร้างสรรค์ "Juan Linietsky, Ariel Manzur and the Godot Engine community"
uk: Весь вміст знаходиться під дозвільною ліцензією Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), із зазначенням авторства "Juan Linietsky, Ariel Manzur та Godot Engine спільноти ".
vi: Tất cả các nội dung đều thuộc giấy phép Creative Commons Attribution 3.0 (CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/> _ _), với sự cho phép của "Juan Linietsky, Ariel Manzur và cộng đồng Godot Engine ".
zh_cn: 所有内容均在宽松的知识共享署名3.0(`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_)许可下，并归属于“Juan Linietsky, Ariel Manzur 和Godot引擎社区”。

source: Organization of the documentation
de: Aufbau der Dokumentation
ko: 문서의 구조
pl: Organizacja dokumentacji
ru: Создание документации
uk: Організація документації
zh_cn: 文档结构

source: This documentation is organised in five sections with an impressively unbalanced distribution of contents – but the way it is split up should be relatively intuitive:
ar: يتم تنظيم هذه الوثائق في خمسة أقسام مع توزيع غير متوازن للمحتويات - ولكن الطريقة التي يتم بها التقسيم يجب أن تكون بديهية نسبيًا:
ca: Aquesta documentació s'organitza en cinc apartats que tot i la distribució força desequilibrada de continguts, es divideixen de forma relativament intuïtiva :
da: Dette dokument er tilrettelagt i fem sektioner med en imponerende ubalanceret uddeling af indhold - men måden den er opdelt bør være relativ intuitiv:
de: Diese Dokumentation ist in fünf Abschnitte unterteilt, wobei deren Inhalt beeindruckend unausgeglichen verteilt ist – jedoch sollte die Art der Aufteilung ziemlich intuitiv sein:
el: Αυτή η τεκμηρίωση είναι οργανωμένη σε πέντε ενότητες με μια εντυπωσιακά ανισόρροπη διανομή περιεχομένου - όμως ο τρόπος που χωρίζεται είναι σχετικά ενστικτώδης:
es_mx: Esta documentación está organizada en cinco secciones con una distribución de contenido impresionantemente desbalanceada - pero la forma en que está dividida debería ser relativamente intuitiva:
fi: Tämä dokumentaatio on järjestetty viiteen alueeseen vaikuttavan epätasapainoisella sisällön jakaumalla – mutta tapa, jolla se on jaoteltu pitäisi olla suhteellisen intuitiivista:
id: Dokumentasi ini terorganisir menjadi lima sesi dengan distribusi konten yang tidak seimbang - tetapi cara pemisahannya relatif intuitif:
ko: 이 문서는 크게 다섯 개 섹션으로 구성되어 있고 섹션마다 분량이 크게 다르지만 구분 자체는 꽤 직관적으로 되어 있습니다:
pl: Dokumentacja ta podzielona jest na pięć części o imponująco niezrównoważonej dystrybucji treści, ale sposób jej podziału powinien być stosunkowo intuicyjny:
sl: Dokumentacija je organizirana v pet odstavkov z impresivno neuravnovešeno porazdelitevijo vsebine - vendar na način kako je razdeljena bi moralo biti intuitivno:
sr_latn: Ovaj dokument je organizovan u pet sekcija sa impresivno uneravnoteženom raspodjelom sadržaja, ali bi način na koji je raspodjeljena trebao biti relativno intuitivan:
vi: Bộ tài liệu này được tổ chức thành năm phần với sự phân bố không đồng đều các nội dung - tuy nhiên cách phân chia này lại tương đối trực quan:
zh_tw: 這份文件有五個章節，其中內容不平均的令人驚歎——但章節分開的方法應該是符合直覺的:

source: The :ref:`sec-general` section contains this introduction as well as information about the engine, its history, its licensing, authors, etc. It also contains the :ref:`doc_faq`.
ar: :ref:`sec-general` القسم يحتوي على هذه المقدمة و معلومات عن المحرك, تاريخه, ترخيصه, مطوروه,إلخ. و يحتوي أيضا :ref:`doc_faq`.
ca: La secció :ref:`sec-general` conté aquesta introducció així com informació sobre el motor, la seva història, llicència, autors, etc. Hi trobareu també les :ref:`doc_faq`.
da: :ref:`sec-general` sektionen indeholder denne introduktion såvel som informationen om spilmotoren, dens historie, dens licensering, forfattere, osv. Det indeholder også :ref:`doc_faq`.
de: Der Abschnitt :ref:`sec-general` enthält diese Einführung sowie Informationen über die Engine, ihre Geschichte, Lizenzierung, Autoren usw. Er enthält ebenfalls die :ref:`doc_faq`.
el: Το τμήμα :ref:`sec-general` περιέχει αυτή την εισαγωγή καθώς και πληροφορίες σχετικά με τη μηχανή, το ιστορικό της, την αδειοδότηση, τους συγγραφείς κλπ. Περιέχει επίσης το :ref:`doc_faq`.
es_mx: La sección :ref:`sec-general` contiene esta introducción así como también información acerca del motor, su historia, sus licencias, autores, etc. También contiene las preguntas frequentes :ref:`doc_faq`.
fi: :ref:`sec-general` osuus sisältää tämän johdannon ja tietoa moottorista, sen historiasta, lisensoinnista, tekijöistä, jne. Se myös sisältää :ref:`doc_faq`.
id: Sesi :ref:`sec-general`berisi pengenalan sama seperti informasi tentang mesin, lisensi, author, dan lainnnya. Dan juga berisi :ref:`doc_faq`.
ko: :ref:`sec-general` 섹션은 이 소개문과 엔진의 역사, 라이선스, 제작자 등 기본적인 정보를 담고 있습니다. :ref:`doc_faq`\ 도 여기 속합니다.
pl: Rozdział :ref:`sec-general` zawiera wprowadzenie, jak również informacje na temat silnika, jego historii, licencjonowania, autorów, itp. Zawiera również :ref:`doc_faq`.
ru: Секция :ref:`sec-general` содержит введение, информацию о движке, его историю, информацию о лицензиях, авторах, и прочее. Она также содержит :ref:`doc_faq`.
sl: :ref:`sec-general` odstavek vsebuje to predstavitev kot tudi informacije o pogonu, njegovo zgodovino in licenčnino, avtorje itd. Vsebuje tudi :ref:`doc_faq`.
sr_latn: :ref:`sec-general` sekcija sadrži ovaj uvod kao i informacije o pokretaču igre, istoriji, licenci, autorima itd. Takođe sadrži :ref:`doc_faq`.
th: ส่วน :ref:`sec-general` ประกอบด้วยบทนำนี้และข้อมูลเกี่ยวกับเอ็นจิ้น ความเป็นมา สัญญาอนุญาต ผู้พัฒนา ฯลฯ รวมทั้ง :ref:`doc_faq`
uk: Розділ :ref:`sec-general` містить цей вступ, а також інформацію про рушій, його історію, ліцензування, авторів тощо. Він також містить :ref:`doc_faq`.
vi: Phần :ref:`sec-general` chứa thông tin giới thiệu này cũng như thông tin về phần mềm, lịch sử, giấy phép, tác giả, vv. Nó cũng chứa :ref:`doc_faq`.
zh_cn: :ref:`sec-general` 部分包括简介，以及关于引擎的信息，即历史、许可证和作者等。这部分也包含 :ref:`doc_faq` 。
zh_tw: :ref:`sec-general` 章節中包含了這份序言與關於這個引擎、它的歷史、授權條款、作者等等的資訊。這裡面也含有 :ref:`doc_faq`。

source: The :ref:`sec-learn` section is the *raison d'être* of this documentation, as it contains all the necessary information on using the engine to make games. It starts with the :ref:`Step by step <toc-learn-step_by_step>` tutorial which should be the entry point for all new users.
ko: :ref:`sec-learn` 섹션은 이 문서의 주된 *존재 이유*\ 로, 이 엔진을 사용해 게임을 만드는 데 필요한 모든 정보를 담고 있습니다. :ref:`단계별 <toc-learn-step_by_step>` 튜토리얼로 시작합니다. 이 부분은 새로운 사용자 모두에게 입문 지점이 될 것입니다.
ru: Раздел :ref:`sec-learn` является главной причиной для существования данной документации, поскольку он содержит всю необходимую информацию об использовании движка для создания игр. Он начинается с :ref:`пошагового обучения <toc-learn-step_by_step>`, которое должно стать отправной точкой для всех новых пользователей.
uk: Розділ :ref:`sec-learn` є головною *raison d'être* (причиною існування) цієї документації, оскільки містить всю необхідну інформацію про використання рушія для створення ігор. Він починається з посібника :ref:`Крок за кроком <toc-learn-step_by_step>`, який повинен бути точкою входу для всіх нових користувачів.
zh_cn: :ref:`sec-learn` 部分是本文档的主要 *存在理由*，因为它包含所有使用该引擎制作游戏所必需的信息。这一部分从 :ref:`渐进式 <toc-learn-step_by_step>` 教程开始。这个教程应该作为所有新用户学习的起点。

source: The :ref:`sec-tutorials` section can be read as needed, in any order. It contains feature-specific tutorials and documentation.
ko: 반면 :ref:`sec-tutorials` 섹션은 순서에 상관없이 필요에 맞춰 읽을 수 있습니다. 이 섹션에는 특정 기능 관련 튜토리얼과 문서가 있습니다.
pl: Sekcję :ref:`sec-tutorials` można czytać według potrzeb i w dowolnej kolejności. Znajduje się tu wiele samouczków i materiałów dotyczących poszczególnych funkcji.
ru: Секцию :ref:`sec-tutorials` можно читать по мере необходимости, в любом порядке. Она содержит руководства и документацию по конкретным возможностям движка.
uk: З іншого боку, розділ :ref:`sec-tutorials` може бути прочитаний у міру необхідності в будь-якому порядку. Він містить багато навчальних посібників та документацію щодо конкретних функцій.
zh_cn: 另外， :ref:`sec-tutorials` 部分则可以根据您的需要以任意顺序去查阅。它包含特定于功能的教程和文档。

source: The :ref:`sec-devel` section is intended for advanced users and contributors to the engine development, with information on compiling the engine, developing C++ modules or editor plugins.
ca: La secció :ref:`sec-devel` es dirigeix a usuaris avançats i col·laboradors amb el desenvolupament de motor, amb informació sobre la compilació del motor i el desenvolupament de mòduls C++ o connectors per l'editor.
da: :ref:`sec-devel` sektionen er påtænkt avancerede brugere og medvirkende til spilmotorens udvikling, med information omkring compiling af spilmotoren, udvikling af C++ moduler eller plugins.
de: Der Abschnitt :ref:`sec-devel` richtet sich an Fortgeschrittene und Mitwirkende an der Entwicklung der Engine, mit Informationen zum Kompilieren der Engine und zur Entwicklung von C++-Modulen oder Editor Plugins.
el: Το τμήμα :ref:`sec-devel` προορίζεται για προχωρημένους χρήστες και συμβάλλωντες στην ανάπτυξη της μηχανής, με πληροφορίες σχετικά με τη μεταγλώτηση της μηχανής, την ανάπτυξη μονάδων C++ ή επεκτάσεις του επεξεργαστή.
es_mx: La sección :ref:`sec-devel` está dirigida hacia usuarios avanzados y contribuyentes del desarrollo del motor, contiene información acerca de cómo compilar el motor y desarrollar módulos o plugins para el editor en C++.
fi: :ref:`sec-devel` osuus on tarkoitettu kokeneemmille käyttäjille ja moottorin kehittäjille. Siellä on tietoa moottorin rakentamisesta, C++ moduulien tai editorin liitännäisten kehittämisestä.
ko: :ref:`sec-devel` 섹션은 고급 사용자와 엔진 개발 기여자들을 위한 섹션으로 엔진 컴파일, C++ 모듈 혹은 편집기 플러그인 개발에 대한 정보를 담고 있습니다.
pl: Sekcja :ref:`sec-devel` jest przeznaczona dla zaawansowanych użytkowników i współuczestników rozwoju silnika, zawierające informacje na temat kompilacji silnika, tworznenia modułów C++ lub wtyczek edytora.
ru: Секция :ref:`sec-devel` предназначена для продвинутых пользователей и участников разработки движка, и включает в себя информацию о том, как компилировать движок, разрабатывать модули на C++ или плагины для редактора.
sl: :ref:`sec-devel` odstavek je namenjen za napredne uporabnike in tiste, ki želijo prispevati pri razvijanju Godot-a, z informacijami kako prevajati pogon, razvijati C++ module ali vtičnike za urejevalnik.
th: ส่วน :ref:`sec-devel` สำหรับผู้ใช้ขั้นสูงและผู้ที่สนใจช่วยพัฒนาเอ็นจิ้น โดยมีข้อมูลเกี่ยวกับการคอมไพล์เอ็นจิ้น การสร้างโมดูลหรือปลั๊กอินด้วยภาษา C++
uk: Розділ :ref:`sec-devel` призначений для досвідчених користувачів і учасників розробки рушія, з інформацією про компіляцію рушія, розробці модулів мовою C++ або плаґінів редактора.
zh_cn: :ref:`sec-devel` 部分是为高级用户以及引擎开发人员提供的，它包含了如何编译引擎、开发C++模块和编辑器插件等信息。
zh_tw: :ref:`sec-devel` 章節是為進階使用者與引擎開發貢獻者而寫，包含編譯引擎本身、C++ 模組的開發、或編輯器插件等等的資訊。

source: The :ref:`sec-community` section gives information related to contributing to engine development and the life of its community, e.g. how to report bugs, help with the documentation, etc. It also points to various community channels like IRC and Discord and contains a list of recommended third-party tutorials outside of this documentation.
ko: :ref:`sec-community`\ 는 엔진 개발과 커뮤니티 기여에 관련된 정보를 제공합니다, 예를 들어 버그 제보하는 방법, 문서에 기여하는 방법 등이 있습니다. 또 IRC와 Discord 등 여러 커뮤니티 채널이나 이 문서 밖에 있는 제 3자의 튜토리얼 추천 목록도 있습니다.
pl: W sekcji :ref:`sec-community` dowiesz się, jak możesz wesprzeć rozwój silnika. Pokazuje m.in. w jaki sposób możesz zgłaszać błędy i pomagać tworzyć dokumentację. Podano tu również kilka dróg komunikacji ze społecznością, takich jak IRC i Discord, a także listę polecanych poradników niebędących częścią tej dokumentacji.
ru: Секция :ref:`sec-community` даёт информацию относительно участия в разработке движка и жизни его сообщества, к примеру как сообщать об ошибках, помогать писать документацию, и прочее. Она также направляет на различные каналы сообщества такие как IRC и Discord и содержит список рекомендованных руководств от третьих лиц вне основной документации.
uk: Розділ :ref:`sec-community` надає інформацію, що стосується сприяння розвитку двіжка та життя його спільноти, наприклад, як повідомити про помилки, допомогти з документацією, тощо. Він також вказує на різні канали спільноти, такі як IRC та Discord, і містить список рекомендованих сторонніх навчальних посібників за межами цієї документації.
zh_cn: :ref:`sec-community` 部分提供了引擎开发和社区生态的相关信息，例如，如何反馈错误、帮助改善文档等等。它还列出了各种社区频道，如 IRC、Discord，并推荐了一些本文档之外的第三方教程。
