Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/introduction.po
Languages: ar, ca, da, de, el, es_mx, fi, id, ko, pl, ru, sl, sr_latn, th, uk, vi, zh_cn, zh_tw

source: Finally, the :ref:`sec-class-ref` is the documentation of the Godot API, which is also available directly within the engine's script editor. It is generated automatically from a file in the main source repository, therefore the generated files of the documentation are not meant to be modified. See :ref:`doc_updating_the_class_reference` for details.
ca: Finalment, la secció :ref:`sec-class-ref` és la documentació de la API de Godot, que també és accessible directament des de l'editor d' scripts. La documentació es genera automàticament a partir del repositori principal del codi font i per tant, els arxius generats no estan pensat per a ser modificats directament. Vegeu :ref: "doc_updating_the_class_reference" per a més detalls.
da: Til sidst, :ref:`sec-class-ref`er dokumentationen af Godot API'en som også er tilrådighed direkte fra spilmotorens redigeringsværktøj til scripts. Den er genereret automatisk fra en fil i hoved-kildearkivet, derfor er de generede dokumentationsfiler ikke beregnet til ændringer. Se :ref:`doc_updating_the_class_reference` for detaljer.
de: Der Abschnitt :ref:`sec-class-ref` schließlich ist die Dokumentation zur Godot API, welche auch direkt aus dem Skript-Editor der Engine heraus verfügbar ist. Sie wird automatisch aus einer Datei im Hauptrepository generiert, daher sind Änderungen der generierten Dateien nicht vorgesehen. Für Details, siehe :ref:`doc_updating_the_class_reference`.
el: Τέλος, το :ref:`sec-class-ref` είναι η τεκμηρίωση του API της Godot, το οποίο είναι επίσης διαθέσιμο απευθείας από τον επεξεργαστή δεσμών ενεργειών. Δημιουργείται αυτόματα από ένα αρχείο στο βασικό αποθετήριο κώδικα, επομένως τα παραγόμενα αρχεία του οδηγού δεν προορίζονται να τροποποιηθούν. Δείτε :ref:`doc_updating_the_class_reference` για λεπτομέρειες.
fi: Viimeiseksi, :ref:`sec-class-ref` sisältää Godotin API-referenssin, joka on myös suoraan saatavilla moottorin skriptieditorissa. Se luodaan lähdetiedostosta automaattisesti, joten luotuja dokumentaatiotiedostoja ei ole tarkoitus muokata. Katso yksityiskohdat :ref:`doc_updating_the_class_reference`.
ko: 마지막으로 :ref:`sec-class-ref`\ 는 Godot API 문서로 엔진의 스크립트 편집기에서도 바로 읽어볼 수 있습니다. 이 섹션은 엔진 소스 저장소에 있는 파일에서 자동으로 생성되기 때문에 생성된 문서 파일은 직접 수정하지 않습니다. 자세한 내용은 :ref:`doc_updating_the_class_reference`\ 을 확인하세요.
pl: W końcu, klasa :ref:`secass-ref` opisuje Godot API, która jest również dostępna bezpośrednio w edytorze skryptów silnika. Jest ona generowana automatycznie z pliku w głównym repozytorium źródłowym, dlatego generowane pliki dokumentacji nie są przeznaczone do modyfikowania. Patrz :ref:`doc_updating_the_class_reference`.
ru: Наконец, :ref:`sec-class-ref` это документация по Godot API, которая также доступна напрямую из редактора скриптов в движке. Она генерируется автоматически из файла в основном кодовом репозитория, сгенерированные файлы документации не должны быть изменены. Смотрите :ref:`doc_updating_the_class_reference` для уточнения.
sl: Na koncu, :ref:`sec-class-ref` je dokumentacija Godot API, katera je dostopna neposredno v urejevalniku skript pogona. Ustvarjena je samodejno iz datoteke v glavnem viru repozitorija, zato ustvarjene datoteke dokumentacije niso mišljene za spreminjanje. Glejte :ref:`doc_updating_the_class_reference` za podrobnosti.
sr_latn: Konačno, :ref:`sec-class-ref` je dokumentacija Godot API-a, koju je takođe dostupna direktno iz uređivača koda samo pokretača igre. Automatski se stvara iz fajla u glavnom repozitoriju koda, tako da se generisani fajlovi dokumentacije ne mogu mjenjati. Pogledajte :ref:`doc_updating_the_class_reference` za detalje.
th: ส่วนสุดท้าย ส่วน :ref:`sec-class-ref` เป็นคู่มือการเขียนโปรแกรมใน Godot ซึ่งมีอยู่ภายในตัวแก้ไขสคริปต์ของเอ็นจิ้น ส่วนนี้ถูกสร้างอัตโนมัติจากไฟล์ใน repository หลักของเอ็นจิ้น ดังนั้นจึงไม่ควรแก้ไขไฟล์เหล่านี้โดยตรง ดูรายละเอียดเพิ่มเติมได้ที่ :ref:`doc_updating_the_class_reference`
uk: Наприкінці, :ref:`sec-class-ref` - це документація Godot API, яка також доступна безпосередньо в редакторі скриптів рушія. Вона автоматично генерується з файлу в головному репозиторії коду, тому згенеровані файли документації не повинні бути змінені. Див. :ref:`doc_updating_the_class_reference` для подробиць.
zh_cn: 最后， :ref:`sec-class-ref` 部分是Godot API文档，也可以直接在引擎的脚本编辑器中找到。它是从主源代码存储库中的文件自动生成的，因此文档的生成文件不打算修改。更多信息请查看 :ref:`doc_updating_the_class_reference`。
zh_tw: 最後，:ref:`sec-class-ref` 是 Godot API 的說明文件，在引擎內的腳本編輯器中也可以直接查閱。它是從主要源碼倉庫中的一個檔案產生出來的，因此這些自動產生的檔案不應該直接被修改。細節請參閱 :ref:`doc_updating_the_class_reference`。

source: In addition to this documentation you may also want to take a look at the various `Godot demo projects <https://github.com/godotengine/godot-demo-projects>`_.
ca: A més, també pots fer fer una ullada als diferents `projectes de demostració <https://github.com/godotengine/godot-demo-projects>`_.
da: Foruden denne dokumentation kan du evt. tage et kig på de forskellige `Godot demo projects <https://github.com/godotengine/godot-demo-projects>`_.
de: Zusätzlich zu dieser Dokumentation möchtest du vielleicht auch einen Blick auf die verschieden `Godot Demoprojekte <https://github.com/godotengine/godot-demo-projects>`_ werfen.
el: Πέραν από την τεκμηρίωση μπορεί να θέλετε να ρίξετε μια ματιά στα διάφορα `Έργα επίδειξης της Godot <https://github.com/godotengine/godot-demo-projects>`_.
fi: Tämän dokumentaation lisäksi voit myös katsoa erilaisia Godot demoprojekteja <https://github.com/godotengine/godot-demo-projects>`_.
ko: 이 문서 외에 여러가지 `Godot 데모 프로젝트들 <https://github.com/godotengine/godot-demo-projects>`_\ 도 살펴보면 좋습니다.
pl: Oprócz dokumentacji mogą zainteresować cię `projekty demo dla Godota <https://github.com/godotengine/godot-demo-projects>`_.
ru: В дополнение к этой документации Вы также можете посмотреть на различные `демонстрационные проекты Godot <https://github.com/godotengine/godot-demo-projects>`_.
sl: Poleg te dokumentacije si boste morda tudi želeli pogledati različne `Godot demo projekti <https://github.com/godotengine/godot-demo-projects>`_.
th: นอกจากนี้ท่านอาจสนใจเกี่ยวกับ `ตัวอย่างโปรเจกต์ <https://github.com/godotengine/godot-demo-projects>`_
uk: Окрім цієї документації, ви також можете поглянути на різні `демонстраційні проекти "Godot" <https://github.com/godotengine/godot-demo-projects>`_.
vi: Ngoài bộ tài liệu này, bạn cũng có thể xem thử các dự án demo có sẵn của Godot `Godot demo projects <https://github.com/godotengine/godot-demo-projects>`_.
zh_cn: 除本文档外，您还可以学习各种 `Godot 示例项目 <https://github.com/godotengine/godot-demo-projects>`_ 。
zh_tw: 在這份文件之外，你可能也會想看看 `Godot 的 demo 專案 <https://github.com/godotengine/godot-demo-projects>`_。

source: Have fun reading and making games with Godot Engine!
ca: Divertiu-vos aprenent i creant jocs amb Godot !
de: Viel Spaß beim Lesen und bei der Spieleentwicklung mit der Godot Engine!
el: Καλή διασκέδαση με την ανάγνωση και την δημιουργία παιχνιδιών με την Godot!
fi: Pidä hauskaa lukien ja pelejä tehden Godot Enginellä!
ko: 재미있게 읽고 Godot 엔진으로 즐겁게 게임 개발하세요!
pl: Miłej zabawy podczas czytania i tworzenia gier w silniku Godot!
ru: Весёлого чтения и создания игр на движке Godot Engine!
sl: Uživajte ob branju in izdelovanju iger z Godot Engine!
sr_latn: Uživajte čitajući i praveći igre u Godot pokretaču igre!
th: ขอให้สนุกกับการอ่านคู่มือและสร้างเกมด้วย Godot Engine!
uk: Веселого читання і створення ігор з Godot Engine!
vi: Đọc và làm game với Godot Engine vui nhé!
zh_cn: 祝您愉快的学习Godot引擎并用它制作游戏！
zh_tw: 接下來請繼續享受閱讀和使用 Godot 引擎創作遊戲的樂趣吧！

source: This documentation is organized in five sections with an impressively unbalanced distribution of contents – but the way it is split up should be relatively intuitive:
ru: Документация разбита на пять разделов разного объёма по достаточно понятным принципам:
uk: Ця документація складається з п'яти розділів з суттєво незбалансованим розподілом змісту, але спосіб його розбиття має бути відносно інтуїтивним:

source: This page aims at giving a broad presentation of the engine and of the contents of this documentation, so that you know where to start if you are a beginner or where to look if you need info on a specific feature.
ar: تهدف هذه الصفحة إلى تقديم عرض واسع عن المحرك ومحتويات هذه الوثائق ، حتى تعرف من أين تبدأ إذا كنت مبتدئًا، أو أين تبحث عن معلومات حول ميزة محددة.
ca: Aquesta pàgina vol donar una àmplia presentació del motor i dels continguts d'aquesta documentació, com a punt de partida per a principiants i de referència per a la recerca d'informació sobre alguna característica específica.
da: Denne side har til hensigt at tilbyde en bred præsentation af spilmotoren og indholdet af denne dokumentation, således du ved hvor at starte, hvis du er en begynder, eller hvor du kan finde information om en specifik funktion.
de: Diese Seite dient als grober Überblick über die Engine und die Inhalte der Dokumentation. Anfängern wird gezeigt wie sie mit Godot starten können, Fortgeschrittenen werden Verweise zu spezifischeren Themen aufgelistet.
el: Αυτή η σελίδα στοχεύει να προσφέρει μια ευρεία παρουσίαση της μηχανής και των περιεχομένων αυτού του οδηγού, έτσι ώστε να γνωρίζετε από πού να ξεκινήσετε εάν είστε πρωτάρης ή που να κοιτάξετε εάν χρειάζεστε πληροφορίες για μία συγκεκριμένη λειτουργία.
es_mx: El objetivo de esta página es el de dar una breve presentación del motor y del contenido de esta documentación, para que así puedas saber en dónde comenzar si eres un principiante o dónde buscar si necesitas información de una característica específica.
fi: Tämän sivun tarkoitus on antaa laaja kuva moottorista ja dokumentaation sisällöstä, jotta tietäsit mistä aloittaa jos olet aloittelija tai haluat tietää mistä tietty ominaisuus löytyy.
id: Halaman ini bertujuan untuk memberikan presentasi yang luas tentang mesin dan isi dokumentasi, sehingga Anda tahu di mana untuk memulai jika Anda seorang pemula atau di mana harus mencari jika Anda memerlukan info tentang fitur tertentu.
sl: Tale stran ima namen dati osnovno predstavitev igralnega pogona in vsebine te dokumentacije, tako da boste kot začetnik vedeli kje začeti ali kje pogledati, če boste potrebovali informacije o specifičnih značilnostih.
sr_latn: Ova stranica ima za cilj da naširoko predstavi pokretač igre i sadržaj ove dokumentacije, tako da znate odakle da krenete ako ste početnik ili gdje da tražite ako su vam potrebne informacije o posebnim funkcijama.
th: หน้านี้จะนำเสนอเกี่ยวกับเอ็นจิ้นอย่างกว้าง ๆ และเนื้อหาภายในคู่มือ เพื่อให้ผู้ที่เริ่มต้นใช้งานทราบว่าควรจะเริ่มอย่างไร และจะสามารถหาข้อมูลเกี่ยวกับฟีเจอร์ที่สนใจได้จากที่ใด
vi: Trang này nhắm tới mục đích đưa ra một bài trình bày rõ ràng về phần mềm và nội dung của bộ tài liệu này, để người mới dùng biết nên bắt đầu từ đâu hoặc là nơi để tham khảo nếu đang cần tìm kiếm về một tính năng cụ thể nào.

source: A game engine is a complex tool, and it is therefore difficult to present Godot in a few words. Here's however our PR presentation, which you are free to reuse if you need a quick writeup about Godot Engine.
ar: محرك الألعاب أداة معقدة، و لهذا السبب من الصعب شرح Godot Engine ببضع كلمات.لكن إليكم التقديم العام و الرسمي، الذي هو متاح بدون قيد لإعادة الاستخدام، في حال أردتم تلخيصا سريعا عن محرك Godot Engine.
ca: Un motor de videojocs és una eina complexa, i és per això difícil de presentar Godot en poques paraules. Heus aquí tanmateix la nostra presentació oficial, la qual sou lliures per a reutilitzar si necessiteu un resum ràpid sobre el motor Godot Engine.
da: En spilmotor er et komplekst værktøj, og det er derfor svært at fremvise Godot gennem nogle få ord. Her er dog vores PR præsentation, hvilken du frit kan genanvende hvis du mangler en hurtig fremvisning af Godot Engine.
de: Spiele-Engines sind komplexe Werkzeuge. Das macht es schwierig, Godot in wenigen Worten zu beschreiben. Nichtsdestotrotz finden Sie hier unseren PR-Text, die Sie gern benutzen können, wenn Sie eine kurze Beschreibung der Godot Engine benötigen.
el: Μία μηχανή ανάπτυξης παιχνιδιών είναι ένα πολύπλοκο εργαλείο, συνεπώς είναι δύσκολο να παρουσιαστεί η Godot με λίγες λέξεις. Εντούτοις, εδώ υπάρχει η παρουσίασή μας, την οποία μπορείτε να χρησιμοποιήσετε εάν χρειάζεστε μια σύντομη περιγραφή σχετικά με την Godot.
es_mx: Un juego es una herramienta compleja y es por eso que es difícil presentar a Godot en pocas palabras. Sin embargo aquí está nuestra presentación pública, la cuál eres libre de reutilizar si necesitas un resumen rápido de Godot Engine.
fi: Pelimoottori on monimutkainen työkalu, joten on vaikeaa esittää Godot muutamalla sanalla. Tässä on kuitenkin meidän tiedotus- ja suhdetoiminta (PR) esitys, jota voit vapaasti käyttää jos haluat kirjoittaa Godot Enginestä.
id: Game engine merupakan alat yang cukup rumit, dan oleh karena sulit untuk memberikan presentasi tentang Godot hanya dengan beberapa kata. Namun inilah presentasi PR kami, yang dapat Anda gunakan secara bebas jika Anda membutuhkan keterangan singkat tentang Godot Engine.
sl: Igralni pogon je zahtevno orodje in ga je težko predstaviti v nekaj besedah, zato je tukaj naša PR predstavitev, ki jo lahko večkrat uporabite, če potrebujete hitro osvežitev o Godot Engine.
sr_latn: Pokretač igre je složen alat i zbog toga je teško predstaviti Godot u par riječi. Ipak, prilažemo našu PR prezentaciju, koju slobodno možete koristiti ako vam je potreban kratak članak o Godot pokretaču igre.
th: เกมเอ็นจิ้นเป็นเครื่องมือที่ซับซ้อน และเป็นการยากที่จะอธิบายถึง Godot Engine ด้วยคำไม่กี่คำ นี่คือข้อความที่เราใช้นำเสนอเกี่ยวกับเอ็นจิ้นซึ่งท่านสามารถนำไปใช้อ้างอิงต่อได้

source: Godot Engine is a feature-packed, cross-platform game engine to create 2D and 3D games from a unified interface. It provides a comprehensive set of common tools, so that users can focus on making games without having to reinvent the wheel. Games can be exported in one click to a number of platforms, including the major desktop platforms (Linux, macOS, Windows) as well as mobile (Android, iOS) and web-based (HTML5) platforms.
ar: إن Godot Engine هو محرك ألعاب متعدد المنصات معبأ بمزايا لإنشاء ألعاب ثنائية وثلاثية الأبعاد من واجهة موحدة. يوفر مجموعة شاملة من الأدوات الشائعة ، بحيث يمكن للمستخدمين التركيز على صنع الألعاب دون الحاجة إلى إعادة اختراع العجلة. يمكن تصدير الألعاب بنقرة واحدة إلى عدد من المنصات ، بما في ذلك المنصات الرئيسية لسطح المكتب (Linux و MacOS و Windows) بالإضافة إلى الأنظمة المحمولة الأساسية (Android و iOS) والأنظمة الأساسية المستندة إلى تقنيات الويب (HTML5).
ca: Godot és motor de videojocs multi-plataforma i d'ampla funcionalitat, per a la creació jocs 2D i 3D, a través d'interfície unificada.Proporciona un ampli conjunt d'eines per a poder centrar-se en el procés creatiu sense haver d'anar reinventant la roda a cada pas. En un simple clic, es poden exportar els jocs vers diverese plataformes incloent-hi els principals plataformes d'escriptori (Linux, macOS, Windows) així com per a mòbils (Android, iOS) i web (HTML5).
da: Godot Engine er en funktionsspækket platformsuafhængig spilmotor til skabelse af 2D- og 3D-spil gennem en solid grænseflade. Den tilrådestiller et omfattende sæt af ordinære værktøjer, så brugere kan fokusere på at kreere spil uden at skulle genopfinde hjulet. Spil kan eksporteres i ét klik til diverse platforme, inklusiv større skrivebordsplatforme (Linux, macOS, Windows) så vel som mobile (Android iOS) og web-baserede (HTML5) platforme.
de: Die Godot-Engine ist eine funktionsreiche, plattformunabhängige Spieleengine, mit der Spiele in 2D und 3D unter einer einheitlichen Schnittstelle erstellt werden können. Sie beinhaltetet ein umfassendes Set an Werkzeugen, damit der Anwender sich auf die Spieleentwicklung konzentrieren kann, ohne ständig das Rad neu erfinden zu müssen. Spiele können mit nur einem Klick zu vielen Plattformen exportiert werden, einschließlich den am meisten verbreiteten Desktop-Plattformen (Linux, MacOS, Windows), sowie mobilen Plattformen (Android, IOS) und dem Web (HTML5).
el: Η Godot είναι μία λειτουργική, μηχανή ανάπτυξης παιχνιδιών 2 και 3 διαστάσεων για πολλαπλές πλατφόρμες μέσω μοναδικής διεπαφής. Παρέχει ένα εκτενές φάσμα κοινών εργαλείων, έτσι ώστε οι χρήστες να εστιάζουν στη δημιουργία παιχνιδιών χωρίς να χρειάζεται να ξανά ανακαλύπτουν τον τροχό. Τα παιχνίδια δύνανται να εξαχθούν με ένα κλικ σε πολλές πλατφόρμες, συμπεριλαμβάνοντας τις βασικές πλατφόρμες desktop (Linux, MacOs, Windows), καθώς και τις φορητές (Android, IOS) και τις διαδικτυακές (HTML5).
es_mx: Godot Engine es un motor de videojuegos multiplataforma lleno de funciones para crear videojuegos 2D y 3D desde una interfaz unificada. Proveé un juego comprensivo de herramientas comunes, para que los usuarios puedan concentrarse en hacer juegos sin tener que reinventar la rueda. Los juegos pueden ser exportados en un solo click a varias plataformas, incluyendo los sistemas operativos principales (Linux, MacOS y Windows) así como para móviles (Android y iOS) y plataformas web (HTML5).
fi: Godot Engine on ominaisuuksia täynnä oleva, monialustainen pelimoottori 2D ja 3D-pelien tekemiseen yhdistetyllä käyttöliittymällä. Se sisältää kattavan määrän yleisimpiä työkaluja, jotta käyttäjä voi keskittyä pelien tekemiseen keksimättä pyörää uudelleen. Pelit voidaan jakaa napin painalluksella useille alustoille, sisältäen niin isot työpöytäkäyttöliittymät (Linux, macOS, Windows) kuin mobiililaitteet (Android, iOS) ja web-pohjaiset (HTML5) alustat.
id: Godot Engine merupakan fitur pemaketan, cross-platform game engine yang digunakan untuk membuat permainan 2D dan 3D dengan antar-muka terpadu. Godot Engine menyediakan seperangkat alat umum, sehingga pengguna dapat fokus dalam pembuatan game tanpa harus "membuat roda dari awal". Permainan dapat diterbitkan ke beberapa platform menggunakan satu click, termasuk platform desktop (Linux, macOS, Windows), mobile (Android, iOS) dan basis-web (HTML5) platform.
sl: Godot Engine je funkcijsko-zapakiran, več-okoljski igralni pogon za izdelavo 2D in 3D iger z enotnega vmesnika. Zagotavlja obširen nabor osnovnih orodij, da se uporabnik lahko osredotoči na izdelovanje iger brez odkrivanja Amerike. Igre so lahko izvožene v enem kliku v številna okolja, vključno z glavnimi platformami (Linux, macOS, Windows) kot tudi mobilne (Android, iOS) in spletne (HTML5).
sr_latn: Godot je pokretač igre koji je ispunjen funkcijama, sa mogućnostima rada na više platformi, koji se koristi za pravljenje 2D i 3D igara iz jednog sučelja. Godot pruža obiman skup često korištenih alata, tako da se svaki korisnik može fokusirati na pravljenje igara bez potrebe za "izmišljanjem točka". Igre se mogu izvesti jednim klikom na više platformi, uključujući najpoznatije desktop platforme (Linux, macOS, Windows) kao i mobilne (Android, iOS) te platforme bazirane na web-u (HTML5).
th: Godot Engine คือเกมเอ็นจิ้น 2 มิติและ 3 มิติที่มีฟีเจอร์หลากหลายและพัฒนาลงแพล็ตฟอร์มต่าง ๆ ได้ มาพร้อมกับเครื่องมือที่จำเป็นเพื่อให้ผู้ใช้สามารถพัฒนาเกมได้โดยไม่ต้องเสียเวลาเขียนโปรแกรมซ้ำซ้อน สามารถส่งออกเกมได้ในคลิกเดียวไปยังแพล็ตฟอร์มเดสก์ท็อปหลัก ๆ (ลินุกซ์ แมคโอเอส และวินโดวส์) รวมถึงสมาร์ทโฟน (แอนดรอยด์ ไอโอเอส) และเว็บ (HTML5)
vi: Godot Engine là một phần mềm phát triển game đa nền tảng với đầy đủ tính năng, nhằm tạo ra các trò chơi 2D và 3D từ một giao diện thống nhất. Nó cung cấp một bộ công cụ chung để người dùng có thể tập trung làm game mà không cần phải phát minh lại bánh xe. Trò chơi có thể được xuất ra chỉ bằng một cú nhấn chuột cho một số nền tảng, bao gồm các nền tảng máy tính để bàn (Linux, macOS, Windows) cũng như cho điện thoại di động (Android, iOS) và nền tảng web (HTML5).
