Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/introduction.po
Languages: ar, ca, da, de, el, es_mx, fi, id, ko, pl, ru, sl, sr_latn, th, uk, vi, zh_cn, zh_tw

source: Introduction
ar: المقدمة
ca: Introducció
da: Introduktion
de: Einführung
el: Εισαγωγή
es_mx: Introducción
fi: Johdanto
id: Pengantar
ko: 소개
pl: Wprowadzenie
ru: Введение
sl: Predstavitev
sr_latn: Uvod
th: บทนำ
uk: Вступ
vi: Giới Thiệu
zh_cn: 简介
zh_tw: 序言

source: Welcome to the official documentation of Godot Engine, the free and open source community-driven 2D and 3D game engine! Behind this mouthful, you will find a powerful yet user-friendly tool that you can use to develop any kind of game, for any platform and with no usage restriction whatsoever.
ar: مرحبًا بكم في التوثيق الرسمي لمحرك "غودو"، محرك الألعاب ثنائي و ثلاثي الأبعاد المجاني و المفتوح المصدر من قبل مجتمع المطورين! وراء هذه الجرعة ، ستجد أداة قوية وسهلة الاستخدام لتطوير أي نوع من الألعاب ، لأي جهاز و منصة وبدون أي قيود على الاستخدام على الإطلاق.
ca: Benvinguts a la documentació oficial de Godot Engine, el motor de desenvolupament de videojocs en 2D i 3D de codi obert i lliure impulsat i conduït per la seva comunitat! Si us hi endinseu, trobareu una eina tant potent com fàcil d'usar per a desenvolupar qualsevol tipus de joc, per a qualsevol plataforma i sense cap mena de restriccions en el seu ús.
da: Velkommen til den officielle dokumentation af Godot Engine, den frie og open source fællesskabsdrevne 2D og 3D spilmotor! Under kølerhjelmen vil du finde et kraftfuldt og brugervenligt værktøj, du kan bruge til at udvikle spil af en hver art til en vilkårlig platform og uden brugsrestriktion overhovedet.
de: Willkommen zur offiziellen Dokumentation der Godot Engine, der freien, von einer Open-Source-Gemeinschaft gesteuerten 2D- und 3D-Spiele-Engine! Dahinter verbirgt sich eine leistungsstarke, und dennoch benutzerfreundliche Anwendung, mit der jede Art von Spiel programmiert werden kann, für jede Plattform und ohne jegliche Nutzungseinschränkung.
el: Καλωσορίσατε στον επίσημο οδηγό της Godot, της δωρεάν και ανοικτού κώδικα καθοδηγούμενης απο την κοινότητα μηχανής παιχνιδιών 2D και 3D! Πίσω από αυτό το γλωσσοδέτη, θα βρείτε ένα πανίσχυρο, ωστόσο φιλικό προς τον χρήστη εργαλείο, με το οποίο μπορείτε να αναπτύξετε κάθε είδους παιχνίδι, για οποιαδήποτε πλατφόρμα και χωρίς κανέναν περιορισμό χρήσης.
es_mx: Bienvenido a la documentación oficial de Godot Engine, ¡el motor de videojuegos 2D y 3D libre, de código abierto y guiado por la comunidad!. Detrás de todo esto, encontrarás una herramienta fácil de usar, y poderosa, que puedes usar para desarrollar cualquier clase de juego, para cualquier plataforma y sin ninguna restricción.
fi: Tervetuloa Godot Enginen viralliseen dokumentaatioon. Godot Engine on yhteisön ohjaama, ilmainen avoimen lähdekoodin 2D ja 3D pelimoottori! Tämän puheen takaa löydät tehokkaan ja käyttäjäystävällisen työkalun, jolla voit kehittää minkälaisen pelin tahansa, mille tahansa alustalle, ilman minkäänlaisia käyttörajoituksia.
id: Selamat datang di dokumentasi resmi Godot Engine, game engine 2D dan 3D yang gratis dan open source yang digerakkan oleh komunitas! Anda akan menemukan alat yang kuat namun mudah digunakan yang dapat Anda gunakan untuk mengembangkan game apa pun, untuk platform apa pun dan tanpa pembatasan penggunaan.
ko: 무료이자 오픈 소스로 커뮤니티가 만들어가는 2D 및 3D 게임 엔진 Godot 엔진의 공식 문서에 어서 오세요! 다시 말해 Godot 엔진은 아무런 사용 제한 없이 모든 플랫폼으로 어떤 종류의 게임이든 개발할 수 있는 강력하면서도 사용자 친화적인 도구입니다.
pl: Witaj w oficjalnej dokumentacji Godota, darmowego, otwartoźródłowego i rozwijanego przez społeczność silnika do tworzenie gier 2D oraz 3D. Jest to potężne, lecz przyjazne dla użytkownika narzędzie. Za jego pomocą możesz stworzyć dowolny rodzaj gry, na różne platformę i bez żadnych ograniczeń.
ru: Добро пожаловать в официальную документацию Godot Engine - свободного и открытого 2D и 3D игрового движка, создаваемого сообществом! Godot - это весьма развитый и дружелюбный к пользователю инструмент, который вы сможете использовать для создания игры любого жанра, для любой платформы, без каких-либо ограничений.
sl: Pozdravljeni v uradni dokumentaciji Godot Engine, brezplačni in odprtokodni 2D in 3D igralni pogon! za tem grižljajem boste našli zmogljivo in še uporabniku prijazno orodje, ki ga lahko uporabljate za izdelavo katerekoli igre, za vsako okolje in brez omejitve uporabe.
sr_latn: Dobrodošli u zvaničnu dokumentaciju Godot Engine-a, besplatnog 2D i 3D pokretača igre otvorenog koda. Iza tog dugog objašnjenja, krije se moćna alatka, ali prilagođena korisniku, koju možete koristiti da razvijete bilo kakvu igru, za bilo koju platformu, uz nepostojeća ograničenja.
th: ยินดีต้อนรับสู่คู่มือใช้งาน Godot Engine เกมเอ็นจิ้น 2 มิติและ 3 มิติที่ให้ใช้งานได้อย่างเสรี! ท่านจะได้พบกับเครื่องมือพัฒนาเกมที่ทรงพลังและใช้งานสะดวก สามารถพัฒนาเกมประเภทใดก็ได้ บนแพล็ตฟอร์มใดก็ได้ และไม่มีการจำกัดการใช้งานใด ๆ ทั้งสิ้น
uk: Ласкаво просимо в офіційну документацію Godot Engine, безплатного та керованого спільнотою з відкритим сирцевим кодом 2D та 3D-ігровим рушієм! За цим описом, ви знайдете потужний, але дружній до користувача інструмент, який ви можете використовувати для розробки будь-якої гри на будь-якій платформі і без будь-яких обмежень використання.
vi: Chào mừng bạn đến với bộ tài liệu chính thức của Godot Engine, phần mềm phát triển game 2D và 3D miễn phí của cộng đồng mã nguồn mở! Đằng sau lời ngọt ngào này, bạn sẽ thấy một bộ công cụ mạnh mẽ nhưng thân thiện với người sử dụng mà bạn có thể sử dụng để phát triển bất kỳ loại trò chơi nào, cho bất kỳ nền tảng nào mà không hề bị hạn chế khi sử dụng.
zh_cn: 欢迎使用Godot引擎的官方文档，这是一款由免费开源社区驱动的2D和3D游戏引擎！在此之后，您将发现一个功能强大但十分友好的工具，您可以使用它为任何平台，没有任何使用限制地开发任何类型的游戏。
zh_tw: 歡迎來到 Godot Engine 的官方說明文件。Godot 是一個自由、開源、社群導向的 2D 與 3D 遊戲引擎！在這段話背後，你會發現到一個既強大又對使用者友善的遊戲開發工具，讓你能夠開發任何種類的遊戲、發佈到任何平臺，並且毫無使用上的限制。

source: This page gives a broad presentation of the engine and of the contents of this documentation, so that you know where to start if you are a beginner or where to look if you need info on a specific feature.
ko: 이 페이지에서는 엔진과 이 문서 내용에 관해 소개하는 것으로, 초보자가 시작하는 곳이자, 특정 기능을 찾을 수 있는 곳입니다.
pl: Na tej stronie znajduje się opis możliwości silnika oraz zawartości dokumentacji. Dzięki temu dowiesz się, od czego zacząć, jeśli jesteś na początku drogi, lub gdzie szukać informacji, jeśli potrzebujesz wiedzy na dany temat.
ru: Далее мы рассмотрим основные возможности движка и содержимое данной документации, таким образом чтобы Вы узнали с чего начать, если Вы - новичок, или же где искать подробную информацию о какой-то конкретной возможности.
uk: Ця сторінка призначена для широкого представлення двіжка та вмісту цієї документації, щоб ви знали, з чого почати, якщо ви є новачком або де шукати, якщо вам потрібна інформація про певну функцію.
zh_cn: 本页旨在对引擎和本文档的内容进行宽泛的介绍，以便初学者知道从什么地方开始学习和查找有关特定功能的信息。

source: Before you start
ko: 시작하기에 앞서
ru: Прежде чем вы начнете
uk: Перед початком
zh_cn: 在开始之前

source: The :ref:`Tutorials and resources <doc_community_tutorials>` page lists video tutorials contributed by the community. If you prefer video to text, those may be worth a look.
ko: :ref:`튜토리얼과 리소스 <doc_community_tutorials>` 페이지에는 커뮤니티가 기여한 영상 튜토리얼이 있습니다. 문자보다 영상이 더 끌린다면, 아마 이것도 좋을 것입니다.
ru: На странице :ref:`Учебники и ресурсы <doc_community_tutorials>` перечислены видеоучебники, предоставленные сообществом. Если вы больше предпочитаете видео, а не текст, то, возможно, стоит взглянуть на них.
uk: Сторінка :ref:`Посібники та ресурси <doc_community_tutorials>` перечислює відеоуроки, надані спільнотою. Якщо ви надаєте перевагу відео, а не тексту, то, можливо, варто на неї глянути.
zh_cn: :ref:`教程与资源 <doc_community_tutorials>` 页列出了社区贡献的视频教程。如果你更喜欢视频而非文本，这些可能值得一看。

source: In case you have trouble with one of the tutorials or your project, you can find help on the various :ref:`Community channels <doc_community_channels>`, especially the Godot Discord community, Q&A, and IRC.
ko: 튜토리얼을 따라가거나 프로젝트를 하는 도중 문제가 발생했다면, 다양한 :ref:`커뮤니티 채널 <doc_community_channels>`, 특히 Godot Discord 커뮤니티, Q&A와 IRC에서 도움을 받을 수 있습니다.
ru: Если у вас возникнут проблемы с одним из уроков или с вашим проектом, вы можете найти помощь на различных :ref:`Социальных каналах <doc_community_channels>`, особенно в сообществе Godot Disord, вопросах и ответах (Q&A) и IRC.
uk: Якщо у вас виникнуть проблеми з одним з уроків або з вашим проектом, то ви зможете знайти допомогу на різних :ref:`Каналах спільноти <doc_community_channels>`, особливо у спільноті Godot Discord, запитаннях та відповідях (Q&A) і IRC.
zh_cn: 如果在某个教程或你的项目中遇到了问题，可以在下列途径找到各种各样的帮助： :ref:`社区频道 <doc_community_channels>`，特别是Godot的Discord社区、问答(Q&A)和网络实时聊天室(IRC)。

source: About Godot Engine
ar: حول محرك Godot
ca: Quant a Godot Engine
da: Om Godot Engine
de: Über die Godot Engine
el: Σχετικά με τη Godot
es_mx: Acerca de Godot Engine
fi: Tietoa Godot Enginestä
id: Tentang Godot Engine
ko: Godot 엔진에 대하여
pl: O silniku Godot
ru: О Godot Engine
sl: O Godot Engine
sr_latn: O Godot pokretaču igre
th: เกี่ยวกับ Godot Engine
uk: Про Godot Engine
vi: Về Godot Engine
zh_cn: 关于Godot引擎

source: A game engine is a complex tool, and it is therefore difficult to present Godot in a few words. Here's a quick synopsis, which you are free to reuse if you need a quick writeup about Godot Engine.
ko: 게임 엔진은 복잡한 도구입니다, 고로 Godot를 단 몇 마디로 표현하기는 어렵습니다. 간단한 소개문을 적어보았습니다, Godot 엔진에 대한 간단한 기삿거리를 적고 싶다면 이걸 사용해 보세요.
pl: Silnik gry to skomplikowane narzędzie, więc trudno je zaprezentować używając zaledwie kilku słów. Poniżej podajemy opis, którego możesz swobodnie użyć, jeśli chcesz szybko przedstawić czym jest Godot Engine.
ru: Игровой движок - это сложный инструмент, и поэтому довольно сложно описать его несколькими словами. Это небольшой конспект, который Вы вольны использовать как краткое описание Godot Engine.
uk: Ігровий двіжок є складним інструментом, і тому важко представити Godot кількома словами. Проте тут наша PR-презентація, яку ви можете вільно використовувати, якщо вам потрібний швидкий опис про Godot Engine.
zh_cn: 游戏引擎是一个复杂的工具，因此很难用三言两语来概括Godot。这是一个快速概要，如果需要快速撰写关于Godot引擎的文章，可以自由复用该概要。

source: Godot Engine is a feature-packed, cross-platform game engine to create 2D and 3D games from a unified interface. It provides a comprehensive set of common tools, so users can focus on making games without having to reinvent the wheel. Games can be exported in one click to a number of platforms, including the major desktop platforms (Linux, macOS, Windows) as well as mobile (Android, iOS) and web-based (HTML5) platforms.
ko: Godot 엔진은 통일된 하나의 인터페이스 안에서 2D 및 3D 게임을 만들 수 있는, 기능이 포장된 크로스 플랫폼 게임 엔진입니다. 이 엔진은 사용자가 바퀴를 재 발명할 필요 없이 게임을 만드는 데 집중할 수 있도록 종합적인 도구들을 제공합니다. 만든 게임은 클릭 한 번으로 주요 데스크톱 플랫폼(Linux, macOS, Windows)은 물론 모바일(Android, iOS) 및 웹 기반(HTML 5) 플랫폼으로 내보낼 수 있습니다.
pl: Godot Engine to rozbudowany, wieloplatformowy silnik do tworzenia gier 2D i 3D z poziomu ujednoliconego interfejsu. Dzięki kompleksowemu zestawowi narzędzi, użytkownicy mogą skupić się na tworzeniu, bez konieczności wynajdowania koła na nowo. Ponadto, za pomocą jednego kliknięcia możesz wyeksportować projekt na wiele platform, w tym na najpopularnejsze systemy na komputery stacjonarne (Linux, macOS, Windows) i mobilne (Android i iOS), jak również platformę webową (HTML5).
ru: Godot Engine - многофункциональный, кросс-платформенный игровой движок, для создания 2D и 3D игр. Он предоставляет обширный набор распространенных инструментов, таким образом, что пользователи могут сосредоточиться на создании игр без необходимости изобретать колесо. Игры могут быть экспортированы в один клик на ряд платформ, включая главные настольные платформы (Linux, macOS, Windows), а так же мобильные (Android, IOS) и веб-ориентированные платформы (HTML5).
uk: Godot Engine - це багатофункціональний, багатоплатформовий ігровий двіжок для створення 2D та 3D-ігор з уніфікованим інтерфейсом. Він надає повний набір загальних інструментів, завдяки чому користувачі можуть зосередити увагу на створенні ігор без необхідності винаходити колесо. Ігри можна експортувати одним клацанням на декілька платформ, включаючи основні настільні платформи (Linux, macOS, Windows), а також мобільні пристрої (Android, iOS) та веб-платформи (HTML5).
zh_cn: Godot引擎是一款功能丰富的跨平台游戏引擎，可通过统一界面创建2D和3D游戏。 它提供了一套全面的通用工具，因此用户可以专注于制作游戏，而无需重新发明轮子。 游戏可以一键导出到多个平台，包括主要的桌面平台(Linux、macOS、Windows)以及移动平台(Android、iOS)和基于Web的(HTML5)平台。

source: Godot is completely free and open source under the permissive MIT license. No strings attached, no royalties, nothing. Users' games are theirs, down to the last line of engine code. Godot's development is fully independent and community-driven, empowering users to help shape their engine to match their expectations. It is supported by the `Software Freedom Conservancy <https://sfconservancy.org>`_ not-for-profit.
de: Godot ist vollständig frei und quelloffen und steht unter der äußerst freizügigen MIT-Lizenz. Ohne jeglichen Haken, keine versteckten Gebühren, nichts. Das Spiel gehört ganz allein dem Nutzer, bis zur letzten Zeile Engine-Code. Die Godot-Weiterentwicklung ist vollständig unabhängig, gemeinschaftsgesteuert und gibt somit den Nutzern die Möglichkeit mitzuhelfen, die Engine nach ihren Vorstellungen zu gestalten. Godot wird unterstützt durch die gemeinnützige `Software Freedom Conservancy <https://sfconservancy.org>`.
ko: Godot는 완전히 무료이고 아주 관대한 MIT 라이선스로 배포되는 오픈 소스입니다. 다른 조건도 없고 로열티 요구도 없습니다. 엔진 사용자가 만든 게임은 엔진 코드의 마지막 줄까지 사용자의 것입니다. Godot의 개발은 독립적이고 커뮤니티가 주도하기 때문에 사용자들 스스로 원하는 대로 엔진의 발전을 도울 수 있습니다. Godot는 `소프트웨어 자유 단체 <https://sfconservancy.org>`_\ 으로부터 비영리 운영 지원을 받습니다.
pl: Godot jest całkowicie darmowym i otwartym oprogramowaniem na bardzo liberalnej licencji MIT. Bez zobowiązań, opłat i niczego podobnego. Gry stworzone przez użytkowników są ich własnością, aż do ostatniej linii kodu napisanej w silniku. Rozwój Godota jest w pełni niezależny i napędzany przez społeczność, dając użytkownikom możliwość kształtowania silnika tak, aby spełniał ich oczekiwania. Jest on wspierany przez organizację `Software Freedom Conservancy <https://sfconservancy.org>`_.
ru: Godot абсолютно бесплатный, с открытым исходным кодом в соответствии с лицензией MIT. Никаких лицензионных платежей, и т. д. и т.п. Разработка Godot полностью независима и управляется сообществом, давая возможность пользователям создать свой инструмент, чтобы он соответствовал их ожиданиям. Это поддерживается некоммерческой `Software Freedom Conservancy <https://sfconservancy.org>`_ not-for-profit.
uk: Godot є повністю безплатним та відкритим сирцевим кодом під дуже дозвільною ліцензією MIT. Без будь-яких умов, без відрахувань, нічого. Ігри користувачів є їхніми, до останнього рядка коду рушія. Розвиток Godot є цілком незалежним і керованим спільнотою, що дозволяє користувачам формувати свій рушій відповідно до їхніх очікувань. Це підтримується некомерційною організацією `Software Freedom Conservancy <https://sfconservancy.org>`_.
zh_cn: Godot在宽松的MIT许可证下完全自由且开源。没有附加条文，没有特许权使用费，没有任何要求。用户的游戏乃至引擎的每一行代码，都是他们的。Godot的开发完全独立且由社区驱动，允许用户以帮助塑造他们的引擎来满足他们的期望。它受到 `软件自由保护 <https://sfconservancy.org>`_ 非营利组织的支持。

source: For a more in-depth view of the engine, you are encouraged to read this documentation further, especially the :ref:`Step by step <toc-learn-step_by_step>` tutorial.
ar: للحصول على نظرة أكثر تفصيلاً للمحرك ، نشجعك على قراءة هذه الوثائق بشكل أكبر ، خاصة المرجع: :ref:`Step by step <toc-learn-step_by_step>` tutorial.
ca: Per a saber-ne més, us encoratgem a endinsar-vos en aquesta documentació, especialment en la secció :ref:`Pas a pas <toc-learn-step_by_step>`.
da: For et mere dybdegående eftersyn af spilmotoren, er du opfordret til at læse dokumentationen yderligere, specielt :ref:`Step by step <toc-learn-step_by_step>` guiden.
de: Für einen tieferen Einblick in die Engine empfiehlt es sich, diese Dokumentation weiter zu lesen, besonders das :ref:`Schritt-für-Schritt <toc-learn-step_by_step>`–Tutorial.
el: Για μια πιο εμπεριστατωμένη μελέτη της μηχανής, σας ενθαρρύνουμε να διαβάσετε περαιτέρω την τεκμηρίωση, ειδικά το μάθημα :ref:`Βήμα προς βήμα <toc-learn-step_by_step>`.
es_mx: Para una vista mas profunda del motor, se te invita a seguir leyendo esta documentación, especialmente el tutorial :ref:`Paso a Paso <toc-learn-step_by_step>`.
fi: Syvällisempää katselmusta varten kannattaa lukea lisää, erityisesti :ref:`Askelittain <toc-learn-step_by_step>` tutoriaali.
id: Untuk lebih dalam lagi mengenai Godot Engine, kamu dapat membaca dokumentasi ini lebih lanjut, terutama :ref:`Langkah demi langkah <toc-learn-step_by_step>` tutorial.
ko: 이 엔진을 더 깊이 알고 싶다면 이 문서의 다른 부분을, 특히 :ref:`단계별 <toc-learn-step_by_step>` 튜토리얼을 읽어보길 바랍니다.
pl: Po więcej szczegółowych informacji zachęcamy do zapoznania się z dalszą dokumentacją, zwłaszcza z samouczkiem :ref:`Krok po kroku <toc-learn-step_by_step>`.
ru: Для дальнейшего изучения возможностей мы рекомендуем более подробное изучение документации, особенно обучающего раздела :ref:`Пошаговое обучение <toc-learn-step_by_step>`.
sl: Za poglobljen vpogled v pogon, vam priporočamo, da berete to dokumentacijo naprej, še posebno :ref:`Step by step <toc-learn-step_by_step>` vajo.
sr_latn: Za detaljan pregled pokretača igre, podstičemo vas da pročitate ovu dokumentaciju dalje, posebno :ref:`Step by step <toc-learn-step_by_step>` uputstvo.
uk: Для більш глибокого огляду рушія рекомендується прочитати цю документацію, зокрема посібник :ref:`Крок за кроком <toc-learn-step_by_step>`.
vi: Để có cái nhìn chi tiết hơn về Godot Engine, chúng tôi khuyến khích bạn đọc thêm bộ tài liệu này, đặc biệt là bài hướng dẫn từng bước một: `Step by step <toc-learn-step_by_step>` .
zh_cn: 为了更深入地了解该引擎，建议您进一步阅读本文档，特别是 :ref:`渐进式 <toc-learn-step_by_step>` 教程。
zh_tw: 要更加深入的介紹，建議繼續閱讀這份文件，尤其是 :ref:`Step by step <toc-learn-step_by_step>` 的教學文件。

source: About the documentation
ar: حول الوثائق
ca: Quant a la documentació
da: Om dokumentationen
de: Über die Dokumentation
el: Σχετικά με την τεκμηρίωση
es_mx: Acerca de la documentación
fi: Dokumentaatiosta
id: Tentang dokumentasi
ko: 문서에 대하여
pl: O dokumentacji
ru: О документации
sl: O dokumentaciji
sr_latn: O dokumentaciji
th: เกี่ยวกับคู่มือ
uk: Про документацію
vi: Về bộ tài liệu
zh_cn: 关于文档
zh_tw: 關於這份文件

source: This documentation is continuously written, corrected, edited, and revamped by members of the Godot Engine community. It is edited via text files in the `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ markup language and then compiled into a static website/offline document using the open source `Sphinx <http://www.sphinx-doc.org>`_ and `ReadTheDocs <https://readthedocs.org/>`_ tools.
ko: 이 문서는 Godot 엔진 커뮤니티 구성원들이 지속적으로 쓰고, 교정하고, 편집하고, 개정하고 있습니다. 문서는 `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ 마크업 언어로 된 텍스트 파일로 편집한 뒤 오픈 소스인 `Sphinx <http://www.sphinx-doc.org>`_\ 와 `ReadTheDocs <https://readthedocs.org/>`_\ 를 사용해 정적 웹사이트/오프라인 문서로 컴파일됩니다.
pl: Poniższa dokumentacja jest cały czas uzupełniana, poprawiana, edytowana i reorganizowana przez członków społeczności z użyciem plików tekstowych w języku `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_, a następnie kompilowana do statycznej strony internetowej lub dokumentu offline przy pomocy otwartoźródłowych narzędzi `Sphinx <http://www.sphinx-doc.org>`_ oraz `ReadTheDocs <https://readthedocs.org/>`_ .
ru: Сообщество постоянно дорабатывает, исправляет, редактирует и переделывает эту документацию. Процесс выглядит так: текстовые файлы на языке разметки`Настройки <http://www.sphinx-doc.org/en/stable/rest.html>`_ редактируются, а потом, с помощью инструментов `Сфинкс <http://www.sphinx-doc.org>`_ и `Читать Документы <https://readthedocs.org/>`_ преобразуются в статический веб-сайт или отдельный документ.
uk: Ця документація постійно пишеться, коректується, редагується та перекроюється членами спільноти Godot Engine. Вона редагується за допомогою текстових файлів на мові розмітки `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_markup language, а потім складається у статичний веб-сайт/автономний документ за допомогою інструментів з відкритим вихідним кодом `Sphinx <http://www.sphinx-doc.org>`_ та `ReadTheDocs <https://readthedocs.org/>`_інструменти.
zh_cn: 本文档由Godot引擎社区的成员持续地编写、修正、编辑和改进。它的文本文件使用 `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ 标记语言进行编辑，然后使用开源工具 `Sphinx <http://www.sphinx-doc.org>`_ 与 `ReadTheDocs <https://readthedocs.org/>`_ 编译成一个静态网站/离线文档。
