Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/introduction.po
Languages: ar, ca, da, de, el, es_mx, fi, id, ko, pl, ru, sl, sr_latn, th, uk, vi, zh_cn, zh_tw

source: This documentation is continuously written, corrected, edited and revamped by members of the Godot Engine community. It is edited via text files in the `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ markup language and then compiled into a static website/offline document using the open source `Sphinx <http://www.sphinx-doc.org>`_ and `ReadTheDocs <https://readthedocs.org/>`_ tools.
ar: يتم كتابة هذه الوثائق بشكل مستمر وتصحيحها وتحريرها وتجديدها من قبل أعضاء مجتمع Godot Engine. يتم تحريرها عبر ملفات نصية في وثائق`reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`عبر لغة ترميزية ثم تجميعها في موقع ثابت / دون اتصال باستخدام` Sphinx <http://www.sphinx-doc.org> `_ و` ReadTheDocs <https://readthedocs.org/> `_ tools.
ca: La documentació s'edita i es millora contínuament amb l'impuls de la pròpia comunitat. S'edita via arxius de text en el llenguatge de marcatge `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ per a tot seguit compilar-se en un document web estàtic gràcies a les eines de codi obert `Sphinx <http://www.sphinx-doc.org>`_ i `ReadTheDocs <https://readthedocs.org/>`_ .
da: Denne dokumentation er kontinuerligt skrevet, rettet, ændret og forbedret af medlemmer af Godot Engine fællesskabet. Det er redigeret via tekstfiler i `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ markup sprog og så kompileret til en statisk hjemmeside/et offline dokumentved brug af open source `Sphinx <http://www.sphinx-doc.org>`_ og `ReadTheDocs <https://readthedocs.org/>`_ værktøjer.
de: Diese Dokumentation wird ständig weiter geschrieben, korrigiert, bearbeitet und umgestaltet von den Mitgliedern der Godot-Engine-Gemeinschaft. Bearbeitet wird sie mit Textdateien, geschrieben in der `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ markup language und dann kompiliert zu einer statischen Webseite oder einem Offline-Dokument mit den quell-offenen Werkzeugen `Sphinx <http://www.sphinx-doc.org>`_ und `ReadTheDocs <https://readthedocs.org/>`.
el: Αυτή η τεκμηρίωση γράφεται συνεχώς, διορθώνεται, τροποποιείται και ανανεώνεται από μέλη της κοινότητας της Godot. Τροποποιείται μέσω της γλώσσας σήμανσης `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ και στη συνέχεια μεταγλωττίζεται σε ένα στατικό ιστότοπο / έγγραφο χωρίς σύνδεση χρησιμοποιώντας τα ανοικτού κώδικα εργαλεία `Sphinx <http://www.sphinx-doc.org>`_ και `ReadTheDocs <https://readthedocs.org/>`.
es_mx: Esta documentación es escrita, corregida, editada y actualizada por miembros de la comunidad de Godot Engine. Es editada por medio de archivos de texto en el lenguaje `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>` y luego compilado a un sitio estático/documentación fuera de línea usando las herramientas de código abierto `Sphinx <http://www.sphinx-doc.org>`_ y `ReadTheDocs <https://readthedocs.org/>`_ tools.
fi: Tätä dokumentaatiota kirjoitetaan, korjataan, muokataan ja parannellaan jatkuvasti Godot Enginen yhteisön toimesta. Sitä muokataan tekstitiedostoina `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ merkintäkielellä, joka sittemmin käännetään staattiseksi website/offline dokumentiksi käyttäen avoimen lähdekoodin `Sphinx <http://www.sphinx-doc.org>`_ ja `ReadTheDocs <https://readthedocs.org/>`_ työkaluja.
id: Dokumentasi ini terus menerus ditulis, dikoreksi, diubah dan ditingkatkan oleh anggota dari komunitas Godot Engine. Dokumentasi ini diubah menggunakan file teks `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ bahasa 'markup' dan kemudian disusun kedalam bentuk website statis / offline dokumen menggunakan alat kode sumber terbuka `Sphinx <http://www.sphinx-doc.org>`_ dan `ReadTheDocs <https://readthedocs.org/>`_ .
sl: Ta dokumentacija je nenehno pisana, popravljena, urejena in prenovljena s strani članov Godot Engine skupnosti. Urejeno je s tekstnimi datoteki v `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ označevalni jezik in potem prevedeno v statično stran/dokument z uporabo odprtokodnega `Sphinx <http://www.sphinx-doc.org>`_ in `ReadTheDocs <https://readthedocs.org/>`_ orodij.
th: สมาชิกของชุมชนผู้ใช้งาน Godot Engine เป็นผู้เขียนและปรับปรุงแก้ไขคู่มือนี้อย่างต่อเนื่อง โดยแก้ไขข้อความในรูปแบบ `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ และคอมไพล์เป็นเว็บไซต์ด้วยเครื่องมือ `Sphinx <http://www.sphinx-doc.org>`_ และ `ReadTheDocs <https://readthedocs.org/>`_
vi: Bộ tài liệu này được liên tục viết, sửa lỗi, chỉnh sửa và viết lại bởi các thành viên của cộng đồng Godot Engine. Nó được biên tập qua các tập tin văn bản trong ngôn ngữ đánh dấu `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ và sau đó được biên soạn lại thành một trang web tĩnh/tài liệu ngoại tuyến sử dụng công cụ mã nguồn mở `Sphinx <http://www.sphinx-doc.org>`_ và `ReadTheDocs <https://readthedocs.org/>`_ .
zh_tw: 這份文件是不斷的由 Godot 引擎社群所撰寫、改正、編輯、改進的。它是使用 `reStructuredText <http://www.sphinx-doc.org/en/stable/rest.html>`_ 標記語言的純文字檔所編輯後，利用開源的 `Sphinx <http://www.sphinx-doc.org>`_ 與 `ReadTheDocs <https://readthedocs.org/>`_ 工具所編譯成的靜態網站 / 線下文件。

source: The :ref:`sec-learn` section is the main *raison d'être* of this documentation, as it contains all the necessary information on using the engine to make games. It starts with the :ref:`Step by step <toc-learn-step_by_step>` tutorial which should be the entry point for all new users.
de: Der Abschnitt :ref:`sec-learn` ist der hauptsächliche Daseinszweck dieser Dokumentation, da er alle nötigen Informationen zur Verwendung der Engine zum Entwickeln von Spielen enthält. Er beginnt mit dem :ref:`Step by step <toc-learn-step_by_step>` Tutorial, welches der Einstiegspunkt für alle Neueinsteiger ist.
el: Το τμήμα :ref:`sec-learn` είναι ο κύριος λόγος ύπαρξης αυτής της τεκμηρίωσης, καθώς περιέχει όλες τις απαραίτητες πληροφορίες για τη χρήση της μηχανής για παραγωγή παιχνιδιών. Αρχίζει με το μάθημα :ref:`Βήμα προς βήμα <toc-learn-step_by_step>`, το οποίο θα πρέπει να είναι το σημείο εισαγωγής για όλους τους νέους χρήστες.
es_mx: La sección :ref:`sec-learn` es la principal razón de esta documentación, pues contiene toda la información necesaria sobre cómo usar el motor para crear juegos. Inicia con el tutorial :ref:`Paso a paso <toc-learn-step_by_step>` que debería ser el punto de entrada para todos los usuarios nuevos.
pl: Sekcja :ref:`sec-learn` jest głównym *raison d'être* tej dokumentacji, ponieważ zawiera wszystkie niezbędne informacje na temat korzystania z silnika do tworzenia gier. Rozpoczyna się od samouczka :ref:`Krok po kroku <toc-learn-step_by_step>`, który powinien być punktem wejścia dla wszystkich nowych użytkowników.
sl: :ref:`sec-learn` odstavek je glavni razlog za izdelavo te dokumentacije, ker vsebuje vse potrebne informacije kako uporabljati igralni pogon za izdelavo iger. Začne se z :ref:`korak za korakom <toc-learn-step_by_step>` vajo, katera bi morala biti vstopna točka za vse nove uporabnike.
sr_latn: :ref:`sec-learn` sekcija je srž ove dokumentacije, jer sadrži sve potrebne podatke o korištenju pokretača igre radi pravljenja igara. Započinje sa :ref:`Step by step <toc-learn-step_by_step>` uputstvom koji bi trebao da bude početna tačka za sve nove korisnike.

source: The :ref:`sec-tutorials` section, on the other hand, can be read as needed, in any order. It contains many feature-specific tutorials and documentations.
ca: La secció :ref:`sec-tutorials`, d'altra banda, està pensada per accedir-hi sense ordre específic i segons calgui. Conté documentació i exemples centrats en diverses funcionalitats del motor.
da: :ref:`sec-tutorials` sektionen på den anden side kan blive læst om nødvendigt i vilkårlig rækkefølge. Den indeholder mange funktionsspecifikke guider og dokumentationer.
de: Der Abschnitt :ref:`sec-tutorials` dagegen kann ganz nach Bedarf gelesen werden, in beliebiger Reihenfolge. Er enthält viele Feature-spezifische Tutorials und Dokumentationen.
el: Το τμήμα :ref:`sec-tutorials`, όμως, μπορεί να διαβαστεί όπως απαιτείται. Περιέχει μεγάλο τμήμα τεκμηρίωσης και οδηγών για συγκεκριμένες δυνατότητες.
es_mx: La sección :ref:`sec-tutorials`, por otra parte, puede ser consultada conforme se necesite, en cualquier orden. Contiene muchos tutoriales y documentación de características específicas.
fi: :ref:`sec-tutorials` osuutta voidaan toisaalta lukea tarvittaessa ja missä tahansa järjestyksessä. Se sisältää monia ominaisuuskohtaisia tutoriaaleja ja dokumentaatiota.
sl: :ref:`sec-tutorials` odstavek, na drugi strani pa je lahko prebran, ko ga potrebujemo, v katerem koli vrstnem redu. Vsebuje veliko značilno-določenih vaj in dokumentacij.
sr_latn: S druge strane, :ref:`sec-tutorials` sekcija se može čitati u bilo kojem redosljedu. Sadrži mnoga uputstva i dokumentaciju koja objašnjava pojedinačne funkcije.
th: ส่วน :ref:`sec-tutorials` สามารถเลือกอ่านได้ตามต้องการ และอ่านบทความใดก่อนก็ได้ ประกอบด้วยเนื้อหาเกี่ยวกับฟีเจอร์ต่าง ๆ และการสอนการใช้งาน
vi: Mặt khác, phần :ref:`sec-tutorials` có thể được đọc khi nào cần, theo bất kỳ thứ tự nào. Nó chứa nhiều bài hướng dẫn và tài liệu cụ thể.
zh_tw: :ref:`sec-tutorials` 章節，相對的，需在要用到時再讀即可，沒有先後順序。它包含許多特定功能的教學和文件。

source: The :ref:`sec-community` gives information related to contributing to the engine development and the life of its community, e.g. how to report bugs, help with the documentation, etc. It also points to various community channels like IRC and Discord and contains a list of recommended third-party tutorials outside of this documentation.
ca: La secció :ref:`sec-community` dóna informació relativa a la participació en el desenvolupament del motor i la vida de la comunitat. Per exemple, com informar d'errors, ajudar amb la documentació, etc. També connecta amb diversos canals de la comunitat com IRC i Discord així com una llista de tutorials no oficials recomanats fora d'aquesta documentació.
da: :ref:`sec-community` sektionen giver information relateret til medvirken til spilmotorens udvikling og livet af dens fællesskab, f.eks. hvordan man rapporterer bugs, hjælper med dokumentation, osv. Den henviser også til diverse fællesskabskanaler såsom IRC og Discord og indeholder en liste af anbefalede tredjeparts guides udenfor denne dokumentation.
de: In :ref:`sec-community` findet man Informationen dazu, wie man zur Entwicklung der Engine und dem Leben ihrer Community beiträgt, z.B. wie man Bugs meldet, wie man bei der Dokumentation hilft, etc. Dort sind auch Verweise auf verschiedene Community-Kanäle wie IRC und Discord aufgeführt sowie eine Liste empfohlener Tutorials von Dritten außerhalb dieser Dokumentation.
el: Το ref:`sec-community` παρέχει πληροφορίες σχετικές με την συμβολή στην ανάπτυξη της μηχανής και τη ζωής της κοινότητας της, π.χ. πώς να αναφέρετε τα σφάλματα, να βοηθήσετε με τον οδηγό, κλπ. Αναφέρει επίσης διάφορα κανάλια κοινότητας όπως το IRC και το Discord και περιέχει μια λίστα από συνιστώμενα μαθήματα τρίτων εκτός αυτού του οδηγού.
es_mx: La sección :ref:`sec-community` proveé información relacionada a cómo contribuir al desarrollo del motor y la vida de la comunidad, por ejemplo: cómo reportar bugs, ayudar con la documentación, etc. También refiere a varios canales de la comunidad como IRC y Discord y contiene una lista de tutoriales de terceros recomendados fuera de esta documentación.
fi: :ref:`sec-community` osuudesta löytyy tietoa liittyen moottorin kehittämiseen osallistumisesta ja yhteisön tavoista, esim. kuinka raportoida bugeja, auttaa dokumentoinnissa, jne. Se myös sisältää reitit erilaisiin yhteisökanaviin, kuten IRC ja Discord kuin myös listan suositelluista kolmannen osapuolen tutoriaaleista tämän dokumentaation ulkopuolella.
sl: The :ref:`sec-community` daje informacije navezujoče na prispevanje h razvijanju pogona in življenje skupnosti, npr. kako poročati o napakah, pomoč pri dokumentaciji, itd. Kaže tudi na različne skupinske kanale kot IRC in Discord in vsebuje seznam priporočenih "tretjih" vaj zunaj te dokumentacije.
sr_latn: :ref:`sec-community` sadrži informacije vezane za doprinos razvoju pokretača igre i života zajednice, tj. kako prijaviti greške, pomoći sa dokumentacijom itd. Takođe daje smjernice za razne kanale zajednice kao što su IRC i Discord i sadrži listu preporučenih uputstava napravljenih od strane vanjskih saradnika izvan ove dokumentacije.
th: ส่วน :ref:`sec-community` เกี่ยวกับการร่วมพัฒนาเอ็นจิ้นและชุมชนผู้ใช้ เช่น การรายงานบัค การช่วยเขียนคู่มือ ฯลฯ รวมถึงการเชื่อมโยงไปยังช่องทางการติดต่อกับชุมชน เช่น IRC, Discord และรายชื่อการสอนการใช้งานเอ็นจิ้นนอกเหนือจากคู่มือนี้
vi: Phần :ref:`sec-community` cung cấp thông tin liên quan đến đóng góp vào sự phát triển của phần mềm và hệ thống cộng đồng của nó, ví dụ: làm thế nào để báo lỗi, giúp viết các tài liệu, vv. Nó cũng chỉ đến các kênh cộng đồng khác nhau như IRC và Discord và chứa một danh sách các bài hướng dẫn được khuyến khích của bên thứ ba ngoài bộ tài liệu này.
zh_tw: :ref:`sec-community` 中有關於貢獻至引擎開發的資訊與社群運作的內容，例如如何回報 bug與文件相關的幫助等等。它也指向幾個社群頻道像是 IRC 和 Discord，並有一個在這份文件範圍外、建議的非官方教學的列表。

source: Organisation of the documentation
ar: تنظيم الوثائق
ca: Organització de la documentació
da: Tilrettelæggelse af dokumentationen
el: Οργάνωση της τεκμηρίωσης
es_mx: Organización de la documentación
fi: Dokumentaation rakenne
id: Organisasi dari dokumentasi
sl: Organizacija dokumentacije
sr_latn: Organizacija dokumentacije
th: การจัดระบบเนื้อหาในคู่มือ
vi: Cách tổ chức của bộ tài liệu
zh_tw: 說明文件的架構

source: Godot is completely free and open source under the very permissive MIT license. No strings attached, no royalties, nothing. Users' games are theirs, down to the last line of engine code. Godot's development is fully independent and community-driven, empowering users to help shape their engine to match their expectations. It is supported by the `Software Freedom Conservancy <https://sfconservancy.org>`_ not-for-profit.
ca: Godot és completament gratuït i de codi obert sota la molt permissiva llicència MIT. Ni lligams ni cànons, res de res. Els jocs pertanyen als creadors, fins al darrer punt i coma del codi del motor. El seu desenvolupament és totalment independent i impulsat per la pròpia comunitat, apoderant els usuaris per donar forma al motor segons les seves expectatives. Rep el suport de l'organizació sense ànim de lucre, `Software Freedom Conservancy <https://sfconservancy.org>`_.
es_mx: Godot es completamente gratis y de código abierto bajo la muy permisiva licencia MIT. Sin compromisos, sin regalias, nada. Los juegos de los usuarios son propiedad de ellos, hasta la última línea de código. El desarrollo de Godot es completamente independiente y guiado por la comunidad, permitiendo a los usuarios ayudar en el desarrollo del motor para que cumpla con sus expectativas. Esta protegido por la `Software Freedom Conservancy <https://sfconservancy.org>` sin fines de lucro.
fi: Godot on täysin ilmainen ja avoimen lähdekoodin ohjelma hyvin sallivalla MIT lisenssillä. Ei vaatimuksia, ei rojalteja, ei mitään. Käyttäjän peli on hänen omansa, jokaista koodiriviä myöten. Godotin kehitys on täysin itsenäistä ja yhteisön ohjaamaa, joka kannustaa käyttäjiä muovaamaan moottoria odotuksia vastaavaksi. Godotia tukee ’Software Freedom Conservancy <https://sfconservancy.org>’ _not-for-profit. (voittoa tavoittelematon).
id: Godot sepenuhnya gratis dan kode sumber terbuka dibawah lisensi yang sangat permisif yaitu MIT. Tanpa pamrih, tidak ada royalti, intinya bebas kalian gunakan. Permainan yang anda buat adalah milik kalian, sampai ke baris terakhir kode mesin. Pengembangan Godot sepenuhnya independen dan didorong oleh komunitas, memberdayakan pengguna untuk membangun game engine untuk menyesuaikan sesuai ekspektasi mereka sendiri. Godot Engine didukung oleh `Software Freedom Conservancy <https://sfconservancy.org>`_ tidak-untuk-keuntungan.
vi: Godot hoàn toàn miễn phí và mã nguồn mở theo giấy phép sử dụng MIT. Không hề có ràng buộc, không có phí phải trả, không gì cả. Trò chơi được tạo ra bởi người dùng hoàn toàn là của họ, đến tận dòng code cuối cùng của phần mềm. Sự phát triển của Godot là hoàn toàn độc lập và được thúc đẩy bởi cộng đồng, giúp người dùng có thể tuỳ biến phần mềm cho phù hợp với nhu cầu của họ. Nó được hỗ trợ bởi `Software Freedom Conservancy <https://sfconservancy.org" `_ - Hiệp Hội Bảo Vệ Tự Do Phần Mềm, một tổ chức phi lợi nhuận.
