Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, de, fr, pt_br, zh_cn

source: List of features
cs: Seznam vlastností
de: Liste der Eigenschaften und Merkmale
fr: Liste des fonctionnalités
pt_br: Lista das funcionalidades
zh_cn: 特性列表

source: This page aims to list all features currently supported by Godot.
cs: Tato stránka si klade za cíl vypsat všechny funkce, které Godot v současné době podporuje.
de: Diese Seite zeigt alle Eigenschaften und Merkmale (Features) die aktuell von Godot unterstützt werden.
fr: Cette page liste toutes les fonctionnalités actuellement supportées par Godot.
pt_br: Esta página visa listar todos os recursos atualmente suportados pelo Godot.
zh_cn: 这一页旨在罗列所有的现在被 Godot 支持的功能特性.

source: This page lists features supported by the current stable version of Godot (3.3). `More features <https://docs.godotengine.org/en/latest/about/list_of_features.html>`__ are available in the latest development version (4.0).
de: Diese Seite zeigt unterstützte Features der aktuell stabilen Godot Version (3.3). `Weitere Features <https://docs.godotengine.org/de/latest/about/list_of_features.html>`__ sind in der letzten Entwicklerversion (4.0).
fr: Cette page liste les fonctionnalités supportées par la version stable actuelle de Godot (3.3). `Plus de fonctionnalités <https://docs.godotengine.org/en/latest/about/list_of_features.html>`__ sont disponibles dans la dernière version de développement (4.0).
pt_br: Esta página lista funcionalidades suportadas pela atual versão estável do Godot (3.3). `Mais funcionalidades <https://docs.godotengine.org/en/latest/about/list_of_features.html>`__ estão disponíveis na versão de desenvolvimento mais recente (4.0).
zh_cn: 这个页面列出了当前稳定版本的 Godot（3.3）所支持的特性。最新的开发版本（4.0）提供\ `更多特性 <https://docs.godotengine.org/en/latest/about/list_of_features.html>`_\ 。

source: Features
cs: Vlastnosti
de: Eigenschaften und Merkmale
fr: Fonctionnalités
pt_br: Funcionalidades
zh_cn: 特性

source: Platforms
cs: Platformy
de: **Plattformen**
fr: Plates-formes
pt_br: Plataformas
zh_cn: 平台

source: **Can run both the editor and exported projects:**
cs: **Může spouštět jak editor, tak exportované projekty:**
de: **Sowohl Editor und exportierte Projekte sind lauffähig:**
fr: **Peut exécuter à la fois l'éditeur et les projets exportés :**
pt_br: **Pode executar tanto o editor quanto os projetos exportados:**
zh_cn: **可以运行编辑器以及导出项目的:**

source: Windows 7 and later (64-bit and 32-bit).
cs: Windows 7 a novější (64bitový a 32bitový).
de: Windows 7 und folgende (64-bit und 32-bit).
fr: Windows 7 et suivant (64 bits et 32 bits).
pt_br: Windows 7 e superior (64-bit e 32-bit).
zh_cn: Windows 7 以及更新的系统版本(64位和32位).

source: macOS 10.12 and later (64-bit, x86 and ARM).
cs: macOS 10.12 a novější (64-bit, x86 a ARM).
de: MacOS 10.12 und folgende (64-bit, x86 und ARM).
fr: macOS 10.12 et suivants (64-bit, x86 et ARM).
pt_br: macOS 10.12 e superior (64-bit, x86 e ARM).
zh_cn: macOS 10.12 以及更新的系统版本(64位,x86, 以及ARM).

source: Linux (64-bit and 32-bit, x86 and ARM).
cs: Linux (64bitový a 32bitový, x86 a ARM).
de: Linux (64-bit und 32-bit, x86 und ARM).
fr: Linux (64-bit et 32-bit, x86 et ARM).
pt_br: Linux (64-bits e 32-bits, x86 e ARM).
zh_cn: Linux(64位和32位的x86或ARM平台).

source: Binaries are statically linked and can run on any distribution if compiled on an old enough base distribution.
cs: Binární soubory jsou staticky propojeny a mohou být spuštěny na jakékoli distribuci, pokud jsou kompilovány na dostatečně staré základní distribuci.
de: Binärdateien sind statisch verknüpft und können auf jeder Distribution ausgeführt werden, wenn sie auf einer ausreichend alten Basisdistribution kompiliert werden.
fr: Les binaires sont liés statiquement et peuvent fonctionner sur n'importe quelle distribution si compilés sur une distribution de base suffisamment ancienne.
pt_br: Arquivos binários são estaticamente vinculados e poder ser executados em qualquer distribuição, se compilados a partir de uma distribuição-base mais antiga.
zh_cn: 二进制文件是静态链接的, 并且如果在足够旧的基本发行版上进行编译, 则可以在任何发行版上运行.

source: Official binaries are compiled on Ubuntu 14.04.
cs: Oficiální binární soubory jsou kompilovány na Ubuntu 14.04.
de: Offizielle Binärdateien sind für Ubuntu 14.04 compiliert.
fr: Les binaires officiels sont compilés sur Ubuntu 14.04.
pt_br: Arquivos binários oficiais são compilados no Ubuntu 14.04.
zh_cn: 官方二进制文件是在Ubuntu 14.04上编译的.

source: HTML5 via WebAssembly (Firefox, Chrome, Edge, Opera).
cs: HTML5 přes WebAssembly (Firefox, Chrome, Edge, Opera).
zh_cn: 通过WebAssembly (火狐浏览器, 谷歌浏览器,Edge浏览器,Opera浏览器) 的HMTL5.

source: **Runs exported projects:**
cs: **Spustí exportované projekty:**
de: **nur exportierte Projekte sind lauffähig:**
fr: **Exécute les projets exportés :**
pt_br: **Executa projetos exportados:**
zh_cn: **运行导出的项目:**

source: Android 4.4 and later.
cs: Android 4.4 a novější.
de: Android 4.4 und folgende.
fr: Android 4.4 et versions ultérieures.
pt_br: Android 4.4 e superior.
zh_cn: 安卓4.4及以上版本.

source: iOS 10.0 and later.
cs: iOS 10.0 a novější.
de: iOS 10.0 und folgende.
fr: iOS 10.0 et ultérieurs.
pt_br: iOS 10.0 e superior.
zh_cn: iOS 10.0及更高版本.

source: :ref:`Consoles <doc_consoles>`.
cs: :ref:`Konzole <doc_consoles>`.
de: :ref:`Konsolen <doc_consoles>`.
zh_cn: :ref:`主机 <doc_consoles>`.

source: :ref:`Headless Linux and macOS servers <doc_exporting_for_dedicated_servers>`.
de: :ref:`Headless Linux- und macOS-Server <doc_exporting_for_dedicated_servers>`.
pt_br: :ref:`Servidores Headless Linux e macOS <doc_exporting_for_dedicated_servers>`.
zh_cn: :ref:`无界面的 Linux 和 macOS 服务器 <doc_exporting_for_dedicated_servers>`.

source: Godot aims to be as platform-independent as possible and can be ported to new platforms with relative ease.
cs: Godot si klade za cíl být co nejvíce nezávislý na platformě a může být relativně snadno portován na nové platformy.
de: Godot wurde so gut es geht Plattform unabhängig entwickelt und kann deshalb relativ einfach auf neue Plattformen portiert werden.
fr: Godot vise à être aussi indépendant des plateformes que possible et peut être porté sur de nouvelles plateformes avec une relative facilité.
pt_br: Godot visa ser o mais independente de plataforma possível e pode ser portado para novas plataformas com relativa facilidade.
zh_cn: Godot的目标是尽可能地独立于平台, 并且可以相对轻松地移植到新平台.

source: Editor
fr: Éditeur
zh_cn: 编辑器

source: **Features:**
cs: **Vlastnosti:**
de: **Funktionen:**
fr: **Fonctionnalités :**
pt_br: **Funcionalidades:**
zh_cn: **特性:**

source: Scene tree editor.
cs: Editor stromů scény.
de: Szenen-Baum Editor (SceneTree).
fr: Éditeur d'arbre de scène.
pt_br: Editor de árvore de cena.
zh_cn: 场景树编辑器.

source: Script editor.
cs: Editor skriptů.
de: Skripteditor.
fr: Éditeur de scripts.
pt_br: Editor de script.
zh_cn: 脚本编辑器.

source: Support for :ref:`external script editors <doc_external_editor>` such as Visual Studio Code or Vim.
cs: Podpora pro :ref:`externí editory skriptů <doc_external_editor>` , jako je Visual Studio Code nebo Vim.
de: Unterstützung von :ref:`externen Script Editoren <doc_external_editor>` wie z.B. Visual Studio Code oder Vim.
fr: Support des :ref:`éditeurs de script externes <doc_external_editor>` tels que Visual Studio Code ou Vim.
pt_br: Suporte a :ref:`external script editors <doc_external_editor>` como Visual Studio Code ou Vim.
zh_cn: 支持例如 Visual Studio 或者 VIM 这样的 :ref:`外部文本编辑器 <doc_external_editor>` .

source: GDScript :ref:`debugger <doc_debugger_panel>`.
zh_cn: GDScript :ref:`调试器 <doc_debugger_panel>`.

source: No support for debugging in threads yet.
cs: Zatím neexistuje podpora pro ladění ve vláknech.
de: Momentan keine Unterstützung zum Debuggen in Threads.
fr: Pas encore de support pour le débogage dans les threads.
pt_br: Por enquanto, sem suporte para depuração em threads.
zh_cn: 尚不支持在线程中调试.

source: Performance monitoring tools.
cs: Nástroje pro sledování výkonu.
de: Leistungs-Analyse Tools.
fr: Outils de suivi des performances.
pt_br: Ferramentas de monitoramento de desempenho.
zh_cn: 性能监控工具.

source: Live script reloading.
cs: Načtení skiptu za chodu.
de: Live-Skript ladet erneut.
fr: Rechargement de script à chaud.
pt_br: Recarregamento de script em tempo real.
zh_cn: 脚本热重载。

source: Live scene editing.
cs: Živé úpravy scény.
de: Live-Bearbeitung der Szene.
fr: Édition de scènes à chaud.
pt_br: Edição de cena em tempo real.
zh_cn: 场景热编辑。

source: Changes will reflect in the editor and will be kept after closing the running project.
cs: Změny se projeví v editoru a budou zachovány i po ukončení běžícího projektu.
de: Änderungen werden im Editor angezeigt und nach dem schließen des laufenden Projekts auch gespeichert.
fr: Les changements seront répercutés dans l'éditeur et seront conservés après la clôture du projet en cours.
pt_br: Alterações serão refletidas no editor e se manterão mesmo após fechar o projeto em execução.
zh_cn: 更改会在编辑器中生效并且会在关闭当前项目后保留.

source: Remote inspector.
cs: Vzdálený inspektor.
de: Fern-Inspektor (Remote).
fr: Inspecteur à distance.
pt_br: Inspetor remoto.
zh_cn: 远程检查器.

source: Changes won't reflect in the editor and won't be kept after closing the running project.
cs: Změny se neprojeví v editoru a po ukončení běžícího projektu nebudou zachovány.
de: Änderungen werden nicht im Editor angezeigt und nach dem schließen des laufenden Projekts auch nicht gespeichert.
fr: Les changements ne seront pas répercutés dans l'éditeur et ne seront pas conservés après la clôture du projet en cours.
pt_br: Alterações não serão refletidas no editor e não serão mantidas após fechar o projeto em execução.
zh_cn: 在关闭正在运行的项目后, 更改不会被反映在编辑器中, 也不会被保留.

source: Live camera replication.
cs: Animace kamery.
de: Live Kamera Replikation.
fr: Réplication de caméra à chaud.
pt_br: Replicação de câmera em tempo real.
zh_cn: 实时摄像机复制.

source: Move the in-editor camera and see the result in the running project.
cs: Přesuňte kameru v editoru a podívejte se na výsledek probíhajícího projektu.
de: Bewegt die Editor interne Kamera und zeigt das Ergebnis im laufenden Projekt.
fr: Déplacez la caméra de l'éditeur et voyez le résultat dans le projet exécuté.
pt_br: Mova a câmera do editor e veja o resultado no projeto em execução.
zh_cn: 移动编辑器中的摄像头, 并在正在运行的项目中查看结果.

source: Use the editor in dozens of languages contributed by the community.
cs: Použijte editor v desítkách jazyků připravených komunitou.
de: Nutze den Editor in vielen verschiedenen Sprachen, erstellt von der Godot Gemeinschaft.
fr: Utilisez l'éditeur dans des dizaines de langues fournies par la communauté.
pt_br: Utilize o editor em dezenas de idiomas fornecidos pela própria comunidade.
zh_cn: 使用由社区贡献的支持数十种语言的编辑器.

source: **Plugins:**
cs: **Pluginy:**
de: **Erweiterungen:**
zh_cn: **插件:**

source: Editor plugins can be downloaded from the :ref:`asset library <doc_what_is_assetlib>` to extend editor functionality.
cs: Pluginy pro rozšíření funkcí editoru lze stáhnout z :ref:`library library <doc_what_is_assetlib>` .
de: Editor Plugins können von :ref:`asset library <doc_what_is_assetlib>` runtergeladen werden, um die Editorfunktionen zu erweitern.
fr: Les plugins de l'éditeur peuvent être téléchargés depuis la bibliothèque :ref:`asset library <doc_what_is_assetlib>` pour étendre les fonctionnalités de l'éditeur.
pt_br: Plugins para o editor podem ser baixados através da :ref:`biblioteca de assets <doc_what_is_assetlib>`, permitindo a expansão das funcionalidades do editor.
zh_cn: 可以从 :ref:`asset library <doc_what_is_assetlib>` 下载编辑器插件, 以扩展编辑器功能.

source: Create your own plugins using GDScript to add new features or speed up your workflow.
cs: Vytvořte si vlastní pluginy pomocí GDScript a přidejte nové funkce nebo urychlete pracovní postup.
de: Erstelle eigene Plugins mittels GDScript um neue Funktionen hinzuzufügen oder den Arbeitsablauf zu beschleunigen.
fr: Créez vos propres plugins en utilisant le GDScript pour ajouter de nouvelles fonctionnalités ou accélérer votre flux de travail.
pt_br: Crie seus próprios plugins utilizando GDScript para adicionar novas funcionalidades ou para acelerar o seu trabalho.
zh_cn: 使用 GDScript 创建您自己的插件, 以添加新功能或加快工作流程.

source: Download projects from the asset library in the project manager and import them directly.
cs: Stáhněte si projekty z knihovny zdroju ve Správci projektů a obratem je importujte.
de: Laden Sie Projekte von der Bestandsbibliothek in den Projektmanager herunter und importieren diese direkt.
fr: Téléchargez les projets de l'asset library dans le gestionnaire de projet et importez-les directement.
pt_br: Baixe projetos a partir da biblioteca de assets e importe-os diretamente.
zh_cn: 从项目管理器中的Asset library下载项目, 然后直接导入.

source: 2D graphics
cs: 2D grafika
de: 2D Grafik
fr: Graphismes 2D
pt_br: Gráficos 2D
zh_cn: 2D图形

source: **Two renderers available:**
cs: **K dispozici dva vykreslovače:**
de: **Zwei Renderer sind verfügbar:**
fr: **Deux moteurs de rendu disponibles :**
pt_br: **Dois tipos de renderizadores disponíveis:**
zh_cn: **两个可用渲染器:**

source: OpenGL ES 3.0 renderer (uses OpenGL 3.3 on desktop platforms).
cs: Renderer OpenGL ES 3.0 (používá OpenGL 3.3 na stolních platformách).
de: OpenGL ES 3.0 Renderer (nutzt OpenGL 3.3 auf Desktop Plattformen).
fr: Moteur de rendu OpenGL ES 3.0 (utilise OpenGL 3.3 sur les plateformes de bureau).
pt_br: Renderizador OpenGL ES 3.0 (utiliza OpenGL ES 3.3 em plataformas desktop).
zh_cn: OpenGL ES 3.0 渲染器(在桌面平台上使用 OpenGL 3.3).

source: High-end visuals. Recommended on desktop platforms.
cs: Špičkové vizuální prvky. Doporučeno pro stolní platformy.
de: High-End Optik. Empfohlen auf Desktop Plattformen.
fr: Graphismes haut de gamme. Recommandé sur les plateformes de bureau.
pt_br: Visuais de alta nível. Recomendado para plataformas desktop.
zh_cn: 高端的视觉效果. 推荐在桌面平台上使用.

source: OpenGL ES 2.0 renderer (uses OpenGL 2.1 on desktop platforms).
cs: Renderer OpenGL ES 2.0 (používá OpenGL 2.1 na stolních platformách).
de: OpenGL ES 2.0 Renderer (nutzt OpenGL 2.1 auf Desktop Plattformen).
fr: Moteur de rendu OpenGL ES 2.0 (utilise OpenGL 2.1 sur les plateformes de bureau).
pt_br: Renderizador OpenGL ES 2.0 (utiliza OpenGL ES 2.1 em plataformas desktop).
zh_cn: OpenGL ES 2.0 渲染器(在桌面平台上使用 OpenGL 2.1).

source: Recommended on mobile and Web platforms.
cs: Doporučeno pro mobilní a webové platformy.
de: Empfohlen für Mobile Geräte und Webplattformen.
fr: Recommandé sur les plateformes mobiles et Web.
pt_br: Recomendado para plataformas Web e dispositivos móveis.
zh_cn: 推荐在移动和 Web 平台上使用.

source: Sprite, polygon and line rendering.
cs: Vykreslování spritů, polygonů a čar.
de: Rendering von Sprites, Polygonen und Linien.
fr: Rendu de sprite, polygone et ligne.
pt_br: Sprites, polígonos e renderização de linhas.
zh_cn: 精灵, 多边形和线条渲染.

source: High-level tools to draw lines and polygons such as Polygon2D and Line2D.
cs: Nástroje na vysoké úrovni pro kreslení čar a mnohoúhelníků, jako je Polygon2D a Line2D.
de: Fortgeschrittene Werkzeuge zum Zeichnen von Linien und Polygonen wie Polygon2D und Line2D.
fr: Des outils de haut niveau pour dessiner des lignes et des polygones tels que Polygon2D et Line2D.
pt_br: Ferramentas de alto-nível para desenhar linhas e polígnos tal como Line2D e Polygon2D.
zh_cn: 绘制线和多边形的高级工具, 例如Polygon2D和Line2D.

source: AnimatedSprite as a helper for creating animated sprites.
cs: AnimatedSprite jako pomocník při vytváření animovaných spritů.
de: AnimatedSprite als Unterstützung zur Erstellung von animierten Sprites.
fr: AnimatedSprite comme aide à la création de sprites animés.
pt_br: AnimatedSprite irá ajudar na criação de sprites animados.
zh_cn: 作为辅助创建具有动画效果的Sprites节点的AnimatedSprites 节点.

source: Parallax layers.
cs: Paralaxní vrstvy.
de: Parallax-Ebenen.
fr: Couches de parallaxe.
pt_br: Camadas de parallax.
zh_cn: 视差层.

source: Pseudo-3D support by automatically duplicating a layer several times.
cs: Podpora Pseudo-3D automatickým několikanásobným duplikováním vrstvy.
de: Pseudo-3D Unterstützung, indem ein Layer automatisch mehrfach dupliziert wird.
fr: Support pseudo-3D en dupliquant automatiquement une couche plusieurs fois.
pt_br: Suporte a Pseudo-3D duplicando automaticamente uma camada várias vezes.
zh_cn: 通过自动多次复制同一个图层来支持伪三维.

source: 2D lighting with normal maps.
cs: 2D osvětlení s normálními mapami.
de: 2D Beleuchtung mit Normal Maps.
fr: Eclairage 2D avec des normal maps.
pt_br: Iluminação 2D com mapas normais.
zh_cn: 带法线贴图的 2D 照明.

source: Hard or soft shadows.
cs: Tvrdé nebo měkké stíny.
de: Harte oder weiche Schatten.
fr: Ombres dures ou douces.
pt_br: Sombras fortes e suaves.
zh_cn: 硬阴影或软阴影.

source: Font rendering using bitmaps (BitmapFont) or rasterization using FreeType (DynamicFont).
cs: Vykreslování písem pomocí bitmapy (BitmapFont) nebo rasterizace pomocí FreeType (DynamicFont).
de: Schrift-Rendering mit Bitmaps (BitmapFont) oder Rasterisierung mit FreeType (DynamicFont).
fr: Rendu des polices à l'aide de bitmaps (BitmapFont) ou rastérisation à l'aide de FreeType (DynamicFont).
pt_br: Renderização de fonte utilizando bitmaps (BitmapFont) ou rasterização utilizando FreeType (DynamicFont).
zh_cn: 使用位图(位图字体)的字体呈现或使用 FreeType (动态字体) 进行栅格化.

source: Bitmap fonts can be exported using tools like BMFont.
cs: Bitmapová písma lze exportovat pomocí nástrojů, jako je BMFont.
de: Bitmap-Schriften können mithilfe von Werkzeugen wie BMFont exportiert werden.
fr: Les polices bitmap peuvent être exportées à l'aide d'outils comme BMFont.
pt_br: Fontes em bitmap podem ser exportadas utilizando ferramentas como BMFont.
zh_cn: 位图字体可以通过例如 BMFont 的工具被导出.

source: DynamicFont supports monochrome fonts as well as colored fonts (e.g. for emoji). Supported formats are TTF, OTF and WOFF1.
zh_cn: DynamicFont支持单色字体以及彩色字体（例如用于表情符号）。支持的格式是TTF、OTF和WOFF1。

source: DynamicFont supports optional font outlines with adjustable width and color.
cs: DynamicFont podporuje volitelné obrysy písma s nastavitelnou šířkou a barvou.
de: DynamicFont unterstützt optionale Konturierung der Schrift mit einstellbarer Breite und Farbe.
fr: DynamicFont prend en charge des contours de police optionnels dont la largeur et la couleur sont réglables.
pt_br: DynamicFont suporta contornos opcionais para fontes, com ajustes de lagura e cor.
zh_cn: 动态字体支持具有可调整宽度和颜色的可选字体轮廓.

source: Support for font oversampling to keep fonts sharp at higher resolutions.
cs: Podpora nadměrného vzorkování fontů (oversampling), aby byla písma ve vyšších rozlišeních ostrá.
de: Unterstützung um bei höheren Auflösungen den Zeichensatz scharf darzustellen (Font Oversampling).
fr: Prise en charge du suréchantillonnage des polices pour maintenir la netteté des polices à des résolutions plus élevées.
pt_br: Suporte para sobreamostragem de fontes, permitindo que elas fiquem nítidas mesmo em resoluções mais altas.
zh_cn: 支持字体超采样, 以在更高的分辨率下保持字体的清晰度.

source: GPU-based particles with support for custom particle shaders.
cs: Částice generované GPU s podporou pro vlastní částicové shadery.
de: GPU-basierte Partikel mit Unterstützung für individuelle Partikel Shader.
fr: Particules calculées par le GPU avec prise en charge de shaders de particules personnalisés.
pt_br: Particulas baseadas em GPU com suporte para shaders personalizados de particulas.
zh_cn: 支持自定义粒子着色器的基于GPU的粒子.

source: CPU-based particles.
cs: Částice generované CPU.
de: CPU-basierte Partikel.
fr: Particules générées par le CPU.
pt_br: Partículas em CPU.
zh_cn: 基于CPU的粒子.

source: 2D tools
cs: 2D nástroje
de: 2D Werkzeuge
fr: Outils 2D
pt_br: Ferramentas 2D
zh_cn: 2D工具

source: 2D camera with built-in smoothing and drag margins.
cs: 2D kamera s vestavěným vyhlazováním a okraji tažení.
de: 2D-Kamera mit eingebauter Glättung und Schlepprändern.
fr: Caméra 2D avec lissage intégré et marges de glissement.
pt_br: Camera 2D com margens e suavização integrados.
zh_cn: 内置平滑和拖动边距的2D相机.

source: Path2D node to represent a path in 2D space.
cs: Uzel Path2D reprezentující cestu ve 2D prostoru.
de: Path2D-Node zur Repräsentation eines Pfads im 2D-Raum.
fr: Nœud Path2D pour représenter un chemin dans l'espace 2D.
pt_br: O Nó Path2D para representar caminhos dentro de um espaço 2D.
zh_cn: 用于代表2维空间中的一条路径的Path2D 节点.

source: Can be drawn in the editor or generated procedurally.
cs: Lze nakreslit v editoru nebo generovat procedurálně.
de: Kann im Editor gezeichnet oder prozedural erzeugt werden.
fr: Peut être dessiné dans l'éditeur ou généré de manière procédurale.
pt_br: Pode ser desenhado através do editor ou gerado proceduralmente.
zh_cn: 可以在编辑器中绘制或者通过程序生成.

source: PathFollow2D node to make nodes follow a Path2D.
cs: Uzel PathFollow2D, pro přidání vlastnosti následovat Path2D do nadřazeného uzlu.
de: PathFollow2D node damit Nodes einem Path2D folgen können.
fr: PathFollow2D pour que les nœuds suivent un Path2D.
pt_br: O nó PathFollow2D para fazer os nós seguirem um Path2D.
zh_cn: 用于使节点跟随一条Path2D的PathFollow2D 节点.

source: 2D geometry helper class.
cs: Pomocná třída 2D geometrie.
de: 2D Geometrie Hilfs-Klasse.
fr: Classe d'aide à la géométrie 2D.
pt_br: Classe auxiliar para geometria 2D.
zh_cn: 2D 几何辅助器类.

source: Line2D node to draw textured 2D lines.
cs: Uzel Line2D pro nakreslení texturovaných 2D čar.
de: Line2D Node um texturierte 2D Linien zu zeichnen.
fr: Nœud Line2D pour dessiner des lignes 2D texturées.
pt_br: O nó Line2D para desenhar linhas 2D texturizadas.
zh_cn: 可用于绘制带纹理的2D线条的Line2D节点.

source: 2D physics
cs: 2D fyzika
de: 2D Physik
fr: Physique 2D
pt_br: Física 2D
zh_cn: 2D物理

source: **Physics bodies:**
cs: **Fyzikální tělesa:**
de: **physikalische Körper:**
fr: **Corps physiques :**
pt_br: **Corpos com suporte a física:**
zh_cn: **物理实体:**

source: Static bodies.
cs: Statická tělesa.
de: Statische Körper
fr: Corps statiques.
pt_br: Corpos estáticos.
zh_cn: 静态实体.

source: Rigid bodies.
cs: Tuhá tělesa.
de: Starre Körper
fr: Corps rigides.
pt_br: Corpos rígidos.
zh_cn: 刚体.

source: Kinematic bodies.
cs: Kinematická tělesa.
de: Bewegte Körper
fr: Corps kinematic.
pt_br: Corpos cinemáticos.
zh_cn: 动力学实体.

source: Joints.
cs: Spojení.
de: Gelenke
fr: Les articulations.
pt_br: Articulações/Junções.
zh_cn: 关节(Joints).

source: Areas to detect bodies entering or leaving it.
cs: Oblasti pro detekci těles, která do něj vstupují nebo opouštějí.
de: Bereiche um Körper zu erkennen, die sie betreten oder verlassen.
fr: Areas pour détecter les corps qui y entrent ou en sortent.
pt_br: Areas para detecção de entrada e saida de corpos.
zh_cn: 用以检测实体进入或离开的区域.

source: **Collision detection:**
cs: **Detekce kolize:**
de: **Kollisionserkennung:**
fr: **Détection de collision :**
pt_br: **Detecção de colisões:**
zh_cn: **碰撞检测:**

source: Built-in shapes: line, box, circle, capsule.
cs: Vestavěné tvary: linie, box, kruh, kapsle.
de: eingebaute Formen: Linien, Rechtecke, Kreise, Ellipsen.
fr: Formes intégrées : ligne, boîte, cercle, capsule.
pt_br: formas integradas: linha, caixa, circulo e capsula.
zh_cn: 内置形状: 线条, 框体, 圆圈, 胶囊.

source: Collision polygons (can be drawn manually or generated from a sprite in the editor).
cs: Kolizní polygony (lze je kreslit ručně nebo generovat ze sprite v editoru).
de: Kollisions Polygone (können manuell gezeichnet oder von einem Sprite im Editor erzeugt werden).
fr: Polygones de collision (peuvent être dessinés manuellement ou générés à partir d'un sprite dans l'éditeur).
pt_br: Collision polygons (podem ser desenhados manualmente ou gerados a partir de um sprite pelo editor).
zh_cn: 碰撞多边形(可以被人工绘制或在编辑器中从一个Sprite生成而来).

source: 3D graphics
cs: 3D grafika
de: 3D Grafiken
fr: Graphiques 3D
pt_br: Gráficos 3D
zh_cn: 3D 图形

source: HDR rendering with sRGB.
cs: HDR vykreslování s sRGB.
de: HDR Rendering mit sRGB.
fr: Rendu HDR avec sRGB.
pt_br: Renderização de HDR com sRGB.
zh_cn: 使用 sRGB 的 HDR 渲染。

source: LDR rendering for greater compatibility.
cs: LDR vykreslování pro větší kompatibilitu.
de: LDR Rendering für größere Kompatibilität.
fr: Rendu LDR pour une plus grande compatibilité.
pt_br: Renderização de LDR para melhor compatibilidade.
zh_cn: 兼容性更高的 LDR 渲染。
