Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, de, fr, pt_br, zh_cn

source: Automatic replication using remote procedure calls (RPCs).
cs: Automatická replikace pomocí vzdáleného volání procedur (RPC).
de: Automatische Nachbildungen mittels entfernter Prozeduraufrufe (RPCs = remote procedure calls).
fr: Réplication automatique au moyen de remote procedure calls (RPC).
pt_br: Replicação automática usando chamadas de procedimento remotas (RPCs).
zh_cn: 使用远程过程调用(RPCS)实现的自动同步复制功能.

source: Supports unreliable, reliable and ordered transfers.
cs: Podporuje nespolehlivé, spolehlivé a objednané přenosy.
de: Unterstützt unzuverlässige, zuverlässige und beantragte Transfers.
fr: Support des transferts peu fiables, sûrs et ordonnés (unreliable, reliable and ordered).
pt_br: Suporta transferências não confiáveis, confiáveis e ordenadas.
zh_cn: 支持不可靠, 可靠和有序传输模型.

source: WebSocket client and server, available on all platforms.
cs: Klient a server WebSocket, k dispozici na všech platformách.
de: WebSocket Client und Server, verfügbar auf allen Plattformen.
fr: Client et serveur WebSocket, disponible sur toutes les plateformes.
pt_br: Cliente e servidor WebSocket, disponível em todas as plataformas.
zh_cn: 全平台可用的WebSocket客户端和服务器实现.

source: WebRTC client and server, available on all platforms.
cs: WebRTC klient a server, k dispozici na všech platformách.
de: WebRTC Client und Server, verfügbar auf allen Plattformen.
fr: Client et serveur WebRTC, disponible sur toutes les plateformes.
pt_br: Cliente e servidor WebRTC, disponível em todas as plataformas.
zh_cn: 全平台可用的WebRTC 客户端和服务器实现.

source: Support for UPnP to sidestep the requirement to forward ports when hosting a server behind a NAT.
cs: Podpora UPnP pro obcházení požadavku předávání portů při hostování serveru za NAT.
de: Unterstützung für UPnP um Port-Forwarding zu umgehen wenn der Server hinter einem NAT steht.
fr: Support d'UPnP pour éviter l'obligation de forward ports lors de l'hébergement d'un serveur derrière un NAT.
pt_br: Suporte para UPnP para contornar a necessidade de encaminhar portas ao hospedar um servidor atrás de um NAT.
zh_cn: 当在NAT后部署服务器时, 支持使用UPnP来避免对转发端口的需求.

source: Internationalization
cs: Internacionalizace
de: Internationalisierung
fr: Internationalisation
pt_br: Internacionalização
zh_cn: 国际化

source: Full support for Unicode including emoji.
cs: Plná podpora unicode včetně emoji.
de: Volle Unterstützung für Unicode inklusive Emoji.
fr: Support complet d'Unicode, y compris les emojis.
pt_br: Suporte completo para Unicode incluindo emojis.
zh_cn: 对包含emoji的Unicode完整支持.

source: Store localization strings using :ref:`CSV <doc_internationalizing_games>` or :ref:`gettext <doc_localization_using_gettext>`.
cs: Uložte lokalizační řetězce pomocí :ref:`CSV <doc_internationalizing_games>` nebo :ref:`gettext <doc_localization_using_gettext>`.
de: Speichere übersetzte Zeichenketten mittels :ref:`CSV <doc_internationalizing_games>` oder :ref:`gettext <doc_localization_using_gettext>`.
fr: Enregistrez les chaînes de caractères de localisation en utilisant :ref:`CSV <doc_internationalizing_games>` ou :ref:`gettext <doc_localization_using_gettext>`.
pt_br: Armazena strings de localização usando :ref:`CSV <doc_internationalizing_games>` ou :ref:`gettext <doc_localization_using_gettext>`.
zh_cn: 使用 :ref:`CSV <doc_internationalizing_games>` 或 :ref:`gettext <doc_localization_using_gettext>` 存储本地化字符串.

source: Use localized strings in your project automatically in GUI elements or by using the ``tr()`` function.
cs: Použijte lokalizované řetězce v projektu automaticky v prvcích GUI nebo pomocí funkce ``tr ()``.
de: Nutzen Sie übersetzte Zeichenketten automatisch in Ihrem Projekt in GUI Elementen oder mit Hilfe der ``tr()`` Funktion.
fr: Utilisez les chaînes de caractère localisées dans votre projet automatiquement dans les éléments de l'interface graphique ou en utilisant la fonction ``tr()``.
pt_br: Utilize strings localizadas em seu projeto automaticamente em elementos GUI ou usando a função ``tr()``.
zh_cn: 在你的项目中自动在GUI元素中或通过使用 ``tr()`` 函数使用本地化的字符串.

source: Support for right-to-left typesetting and text shaping planned in Godot 4.0.
cs: Podpora pro sazbu zprava doleva a tvarování textu plánovaná v Godot 4.0.
de: Unterstützung für rechts-nach-links Eingabe und Text Shaping geplant in Godot 4.0.
fr: Soutien à l'écriture de droite à gauche et à la mise en forme du texte prévu dans Godot 4.0.
pt_br: Suporte para composição tipográdica da direita para a esquerda e modelagem de texto planejada em Godot 4.0.
zh_cn: 预计在Godot 4.0中加入对从右向左排版与文字塑形的支持.

source: Windowing and OS integration
cs: Integrace oken a operačního systému
de: Fensterverwaltung und OS Integration
fr: Fenêtrage et intégration au systèmes d'exploitation
pt_br: Janelas e integração de sistema
zh_cn: 窗口功能与操作系统整合

source: Move, resize, minimize, and maximize the window spawned by the project.
cs: Přesuňte, změňte velikost, minimalizujte a maximalizujte okno vytvořené projektem.
de: Bewegen, Größe verändern, minimieren und maximieren des vom Projekt erzeugten Fensters.
fr: Déplacez, redimensionnez, minimisez et maximisez la fenêtre créée par le projet.
pt_br: Mova, redimensione, minimize e maximize a janela gerada pelo projeto.
zh_cn: 移动, 调整大小, 最小化和最大化项目产生的窗口.

source: Change the window title and icon.
cs: Změňte název a ikonu okna.
de: Ändern des Fenster-Titels und Icons.
fr: Changez le titre et l'icône de la fenêtre.
pt_br: Mude o título e o ícone da janela.
zh_cn: 更改窗口标题和图标.

source: Request attention (will cause the title bar to blink on most platforms).
cs: Vyžádejte si pozornost (způsobí, že na většině platforem bliká záhlaví).
de: Aufmerksamkeit erbitten (lässt die Titelzeile auf den meisten Plattformen blinken).
fr: Demander l'attention (fera clignoter la barre de titre sur la plupart des plateformes).
pt_br: Requisite atenção (vai fazer a barra de título piscar na maioria das plataformas).
zh_cn: 吸引注意(在大多数平台上表现为标题栏闪烁).

source: Fullscreen mode.
cs: Režim celé obrazovky.
de: Vollbildmodus.
fr: Mode plein écran.
pt_br: Modo tela cheia.
zh_cn: 全屏模式.

source: Doesn't use exclusive fullscreen, so the screen resolution can't be changed this way. Use a Viewport with a different resolution instead.
cs: Nepoužívá exkluzivně celou obrazovku, takže rozlišení obrazovky nelze tímto způsobem změnit. Místo toho použijte výřez s jiným rozlišením.
de: Verwendet keinen exklusiven Vollbildmodus, daher kann die Bildschirmauflösung auf diese Weise nicht geändert werden. Verwenden Sie stattdessen ein Ansichtsfenster mit einer anderen Auflösung.
fr: N'utilise pas le plein écran exclusif, donc la résolution de l'écran ne peut pas être modifiée de cette façon. Utilisez plutôt un Viewport avec une résolution différente.
pt_br: Não usa tela inteira exclusiva, então a resolução da tela não pode ser alterada dessa forma. Use uma Viewport com uma resolução diferente.
zh_cn: 不使用全屏独占模式, 不会更改屏幕分辨率. 可使用不同分辨率的视图来代替.

source: Borderless window (fullscreen or non-fullscreen).
cs: Okno bez okrajů (na celou obrazovku nebo ne).
de: Rahmenloses Fenster (Vollbild oder kein Vollbild).
fr: Fenêtre sans bordure (plein écran ou non).
pt_br: Janela sem bordas (tela cheia ou tela não cheia).
zh_cn: 无边框窗口(全屏或非全屏).

source: Ability to keep the window always on top.
cs: Schopnost udržet okno vždy nahoře.
de: Möglichkeit das Fenster im Vordergrund zu halten.
fr: Possibilité de garder la fenêtre toujours en haut.
pt_br: Possibilidade de manter a janela sempre no topo.
zh_cn: 窗口置顶功能.

source: Transparent window with per-pixel transparency.
cs: Průhledné okno s průhledností na pixel.
de: Transparentes Fenster mit pixelgenauer Transparenz.
fr: Fenêtre transparente avec transparence par pixel.
pt_br: Janela transparente com transparência por pixel.
zh_cn: 具有每个像素透明度的透明窗口.

source: Global menu integration on macOS.
cs: Globální integrace menu v systému MacOS.
de: Globale Menü Integration auf MacOS.
fr: Intégration au menu global sur macOS.
pt_br: Integração com menu global no macOS.
zh_cn: macOS上的全局菜单整合.

source: Execute commands in a blocking or non-blocking manner.
cs: Provádět příkazy blokujícím nebo neblokujícím způsobem.
de: Führen Sie Befehle blockierend oder nicht blockierend aus.
fr: Exécuter les commandes de manière bloquante ou non bloquante.
pt_br: Executar comandos de um modo de bloqueio ou de não-bloqueio.
zh_cn: 阻塞或非阻塞的命令执行方式.

source: Open file paths and URLs using default or custom protocol handlers (if registered on the system).
cs: Otevřete cesty k souborům a adresy URL pomocí výchozích nebo vlastních obslužných rutin protokolu (pokud jsou registrovány v systému).
de: Öffnen Sie Dateipfade und URLs mit Standard- oder benutzerdefinierten Protokoll-Handlers (sofern im System registriert).
fr: Ouvrez les chemins d'accès aux fichiers et les URL en utilisant les gestionnaires de protocole par défaut ou personnalisés (s'ils sont enregistrés dans le système).
pt_br: Abrir caminhos de arquivos e URLs usando manipuladores de protocolo padrão ou personalizados (se registrados no sistema).
zh_cn: 使用默认或自定义(已注册在系统中的)协议处理器打开文件路径或URL.

source: Parse custom command line arguments.
cs: Analyzujte vlastní argumenty příkazového řádku.
de: Kommandozeilenparameter parsen.
fr: Analyser les arguments de ligne de commande personnalisés.
pt_br: Analisa argumentos de linha de comando personalizados.
zh_cn: 解析自定义命令行参数.

source: Mobile
cs: Mobilní systémy
de: Mobile Geräte
zh_cn: 移动端

source: In-app purchases on Android and iOS.
cs: Nákupy v aplikacích pro Android a iOS.
de: In-App Käufe auf Android und iOS.
fr: Achats In-app sur Android et iOS.
pt_br: Compras no aplicativo Android e iOS.
zh_cn: Android 与iOS 的应用内购买.

source: Support for advertisements using third-party modules.
cs: Podpora reklam pomocí modulů třetích stran.
de: Unterstützung für Werbung mittels Third-Party Modulen.
fr: Support des annonces publicitaires en utilisant des modules tiers.
pt_br: Suporte a anúncios usando módulos de terceira pessoa.
zh_cn: 支持第三方广告组件.

source: Support for subview embedding on Android.
de: Unterstützung für das Einbetten von Unteransichten auf Android.
pt_br: Suporte para incorporação de subvisão no Android.
zh_cn: 支持Android上的子视图嵌入。

source: XR support (AR and VR)
cs: Podpora XR (AR a VR)
de: XR Unterstützung (AR und VR)
fr: Support XR (AR et VR)
pt_br: Suporte à XR (AR e VR)
zh_cn: 支持XR(AR和VR)

source: Support for ARKit on iOS out of the box.
cs: Podpora pro ARKit v systému iOS ihned po instalaci Godota.
de: Direkte Unterstützung für ARKit auf iOS.
fr: Support de ARKit sur iOS prêt à l'emploi.
pt_br: Suporte ao ARKit no iOS quando pronto para uso.
zh_cn: 开箱即用的iOS ARKit支持.

source: Support for the OpenXR and OpenVR APIs.
cs: Podpora rozhraní OpenXR a OpenVR API.
de: Unterstützung für die OpenXR und OpenVR APIs.
fr: Support des API OpenXR et OpenVR.
pt_br: Suporte às API's de OpenXR e OpenVR.
zh_cn: 支持 OpenXR 和 OpenVR API.

source: Popular VR headsets like the Oculus Quest and HTC Vive are supported thanks to plugins.
cs: Populární náhlavní soupravy VR jako Oculus Quest a HTC Vive jsou podporovány díky zásuvným modulům.
de: Bekannte VR Headsets wie Oculus Quest und HTC Vive werden dank Plugins unterstützt.
fr: Les casques VR populaires comme l'Oculus Quest et le HTC Vive sont supportés grâce à des plugins.
pt_br: Headsets populares de VR como o Oculus Quest e HTC Vive graças à plugins.
zh_cn: 藉由插件可支持主流VR头戴设备, 例如Oculus Quest和HTC Vive.

source: GUI system
cs: GUI systém
fr: GUI système
pt_br: Sistema de Interface Gráfica do Usuário (GUI)
zh_cn: GUI 系统

source: Godot's GUI is built using the same Control nodes used to make games in Godot. The editor UI can easily be extended in many ways using add-ons.
cs: Grafické uživatelské rozhraní Godota je vytvořeno pomocí stejných řídicích uzlů, které jsou použivány při vytváření her v Godotu. Uživatelské rozhraní editoru lze snadno rozšířit mnoha způsoby pomocí doplňků.
de: Die Benutzeroberfläche von Godot wurde mit denselben Kontroll-Nodes erstellt, mit denen auch Spiele in Godot erstellt werden. Die Benutzeroberfläche des Editors kann mithilfe von Add-Ons auf vielfältige Weise erweitert werden.
fr: L'interface graphique de Godot est construite en utilisant les mêmes nœuds Control que ceux utilisés pour les jeux dans Godot. L'interface utilisateur de l'éditeur peut facilement être étendue de nombreuses façons à l'aide d'add-ons.
pt_br: A interface gráfica da Godot é construída usando os mesmos controles de Nodes usados para fazer jogos na Godot. A interface do editor pode ser facilmente estendida de diversas formas com o uso de add-ons.
zh_cn: Godot 的 GUI 也是使用 Control 节点搭建的，和制作游戏时所使用的节点一致。编辑器 UI 可以通过插件轻松地进行各种扩展。

source: **Nodes:**
cs: **Uzly:**
de: **Nodes (Knoten):**
pt_br: **Nós:**
zh_cn: **节点：**

source: Buttons.
cs: Buttons (Tlačítka).
de: Schaltflächen (Buttons).
fr: Buttons (Boutons).
pt_br: Botões.
zh_cn: 按钮。

source: Checkboxes, check buttons, radio buttons.
cs: Checkboxes (zaškrtávací políčka), check buttons (zaškrtávací tlačítka), radio buttons (přepínací tlačítka).
de: Check Boxen, Check Buttons, Radio Buttons.
fr: Cases à cocher, boutons à cocher, boutons radio.
pt_br: Caixas de seleção, botões de seleção, botões de opção.
zh_cn: 复选框、复选按钮、单选按钮。

source: Text entry using LineEdit (single line) and TextEdit (multiple lines).
cs: Zadávání textu pomocí LineEdit (jeden řádek) a TextEdit (více řádků).
de: Texteingabe nutzt LineEdit (einzelne Zeile) und TextEdit (mehrere Zeilen).
fr: Saisie de texte en utilisant LineEdit (une seule ligne) et TextEdit (plusieurs lignes).
pt_br: Entrada de texto usando LineEdit (linha única) e TextEdit (múltiplas linhas).
zh_cn: 使用 LineEdit（单行文本框）和 TextEdit（多行文本框）进行文本输入。

source: Dropdown menus using PopupMenu and OptionButton.
cs: Rozbalovací nabídky pomocí PopupMenu a OptionButton.
de: Dropdown-Menüs nutzen PopupMenu und OptionButton.
fr: Menus déroulants utilisant PopupMenu et OptionButton.
pt_br: Menus suspensos usando PopupMenu (menu suspenso) e OptionButton (botão de opção).
zh_cn: 使用 PopupMenu 和 OptionButton 实现下拉菜单。

source: Scrollbars.
cs: Scrollbars (Skrolovací lišty).
de: Scroll-Leisten.
fr: Barres de défilement.
pt_br: Barras de rolagem.
zh_cn: 滚动条。

source: Labels.
cs: Labels (Popisky).
de: Labels (Markierungen).
fr: Étiquettes (Lables).
pt_br: Rótulos.
zh_cn: 标签。

source: RichTextLabel for :ref:`text formatted using BBCode <doc_bbcode_in_richtextlabel>`.
cs: RichTextLabel pro :ref:`text formátovaný pomocí BBCode <doc_bbcode_in_richtextlabel>`.
de: RichTextLabel für :ref:`BBCode formatierten Text <doc_bbcode_in_richtextlabel>`.
fr: RichTextLabel pour :ref:`texte formaté en utilisant le BBCode <doc_bbcode_in_richtextlabel>`.
pt_br: RichTextLabel para :ref:`textos formatados usando BBCode <doc_bbcode_in_richtextlabel>`.
zh_cn: 使用 RichTextLabel 显示 :ref:`使用 BBCode 的格式化文本 <doc_bbcode_in_richtextlabel>` 。

source: Trees (can also be used to represent tables).
cs: Trees (Stromy) (mohou být také použity k reprezentaci tabulky).
de: Bäume (können auch zur Darstellung von Tabellen verwendet werden).
fr: Trees (arbres) (peuvent également être utilisés pour représenter des tableaux).
pt_br: Trees (podem também ser usadas para representar tabelas).
zh_cn: 树状图（也可用于显示表格）。

source: Containers (horizontal, vertical, grid, center, margin, draggable splitter, ...).
cs: Kontejnery (vodorovné, svislé, mřížkové, středové, okrajové, tahové rozdělovače, ...).
de: Container (horizontal, vertikal, Gitter, Mitte, Rand, ziehbarer Splitter, ...).
fr: Conteneurs (horizontal, vertical, grille, centre, marge, séparateur déplaçable, ...).
pt_br: Contêineres (horizontais, verticais, em grid, centralizados, com margem, divisórias arrastáveis, ...).
zh_cn: 容器（水平、垂直、网格、居中、边距、可拖拽分割器……）。

source: Controls can be rotated and scaled.
cs: Ovládací prvky lze otáčet a měnit jejich měřítko.
de: Steuerelemente können gedreht und skaliert werden.
fr: Controls peuvent être tournés et mis à l'échelle.
pt_br: Controles podem ser rotacionados e ter sua escala alterada.
zh_cn: 控件可以旋转和缩放。

source: **Sizing:**
cs: Změna velikosti (dimenzování)
de: **Größenbestimmung:**
fr: **Dimensionnement :**
pt_br: **Dimensionamento:**
zh_cn: **调整大小：**

source: Anchors to keep GUI elements in a specific corner, edge or centered.
cs: Kotvy (Anchors) pro udržení prvků GUI v určitém rohu, u konkrétní hrany nebo na středu.
de: Verankerung, um GUI-Elemente in einer bestimmten Ecke, Kante oder Mitte zu halten.
fr: Des ancres pour maintenir les éléments de l'interface graphique dans un coin spécifique, un bord ou au centre.
pt_br: Âncoras para manter os elementos da GUI em um canto específico, borda ou centro.
zh_cn: 锚点可将固定GUI元素在特定的角落, 边缘, 或者居中.

source: Containers to place GUI elements automatically following certain rules.
cs: Kontejnery pro umístění prvků grafického uživatelského rozhraní podle určitých pravidel.
de: Container um GUI-Elemente automatisch nach gewissen Regeln zu platzieren.
fr: Conteneurs pour placer automatiquement les éléments de l'interface graphique en suivant certaines règles.
pt_br: Contêineres para colocar elementos da GUI automaticamente seguindo certas regras.
zh_cn: 容器可根据特定规则自动放置UI元素.

source: :ref:`Stack <class_BoxContainer>` layouts.
cs: :ref:`Krabicové <class_BoxContainer>` rozložení.
fr: :ref:`Stack <class_BoxContainer>` agencement.
pt_br: Layouts :ref:`Stack <class_BoxContainer>`.
zh_cn: :ref:`堆叠 <class_BoxContainer>` 布局。

source: :ref:`Grid <class_GridContainer>` layouts.
cs: :ref:`Mřížkové <class_GridContainer>` rozložení.
fr: :ref:`Grid <class_GridContainer>` agencement.
pt_br: Layouts :ref:`Grid <class_GridContainer>`.
zh_cn: :ref:`网格 <class_GridContainer>` 布局。

source: :ref:`Margin <class_MarginContainer>` and :ref:`centered <class_CenterContainer>` layouts.
cs: :ref:`Rozložení podle okrajů<class_MarginContainer>` and :ref:`centrované <class_CenterContainer>` rozložení.
de: :ref:`Margin <class_MarginContainer>` und :ref:`centered <class_CenterContainer>` Layouts.
fr: :ref:`Margin <class_MarginContainer>` et :ref:`centered <class_CenterContainer>` layouts.
zh_cn: :ref:`边距 <class_MarginContainer>` 和 :ref:`居中 <class_CenterContainer>` 布局。

source: :ref:`Draggable splitter <class_SplitContainer>` layouts.
cs: :ref:`Rozložení s tahovým rozdělovačem <class_SplitContainer>` .
fr: :ref:`séparateur déplaçable <class_SplitContainer>` layouts.
zh_cn: :ref:`可拖拽分割器 <class_SplitContainer>` 布局。

source: Scale to multiple resolutions using the ``2d`` or ``viewport`` stretch modes.
cs: Pomocí roztahovacích režimů "2d" nebo "výřez" můžete škálovat do více rozlišení.
de: Skala um die Auflösung zu vergrößern mittels ``2d`` oder ``viewport``Streckungsmodus.
fr: Mise à l'échelle à plusieurs résolutions en utilisant les modes d'étirement ``2d`` ou ``viewport``.
pt_br: Escala para resoluções múltiplas usando os modos de alongamento ``2d`` ou `` viewport``.
zh_cn: 使用 ``2d`` 或 ``viewport`` 拉伸模式缩放至多种分辨率。

source: Support any aspect ratio using anchors and the ``expand`` stretch aspect.
cs: Podporujte jakýkoli poměr stran pomocí kotev a aspektu roztažení ``expand``.
de: Unterstützt jedes Seitenverhältnis mit Ankern und dem Streckungaspekt ``expand``.
fr: Support de tout les rapports d'aspect en utilisant des ancres et l'aspect d'étirement ``expand``.
pt_br: Suporta qualquer proporção de aspecto usando âncoras e o aspecto de extensão ``expand``.
zh_cn: 使用锚点和 ``expand`` 等比例缩放，支持任意纵横比。

source: **Theming:**
cs: **Motivy vzhledu:**
de: **Themen (Designvorlagen):**
pt_br: **Temas:**
zh_cn: **主题：**

source: Built-in theme editor.
cs: Vestavěný editor motivů.
de: Eingebauter Themen-Editor.
fr: Éditeur de thèmes intégré.
pt_br: Editor de temas embutido.
zh_cn: 内置主题编辑器。

source: Generate a theme based on the current editor theme settings.
cs: Vygenerujte motiv na základě aktuálního nastavení motivu editoru.
de: Erzeugt ein Thema basierend auf den Editor Themen Einstellungen.
fr: Générer un thème basé sur les paramètres actuels du thème de l'éditeur.
pt_br: Gera um tema com base nas configurações de tema atuais do editor.
zh_cn: 根据当前的编辑器主题设置生成主题。

source: Procedural vector-based theming using :ref:`class_StyleBoxFlat`.
cs: Procedurální vektorové tematizace pomocí :ref:`class_StyleBoxFlat`.
de: Prozeduale, vektorbasierte Themen mit :ref:`class_StyleBoxFlat`.
fr: Thème vectoriel procédural utilisant :ref:`class_StyleBoxFlat`.
pt_br: Temas baseados em vetores procedurais usando :ref:`class_StyleBoxFlat`.
zh_cn: 使用 :ref:`class_StyleBoxFlat` 进行基于矢量的程序化主题设计。

source: Supports rounded/beveled corners, drop shadows and per-border widths.
cs: Podporuje zaoblené / zkosené rohy, vržené stíny a šířku okraje.
de: Unterstützt abgerundete/abgeschrägte Ecken, Schlagschatten und Randbreiten.
fr: Supporte les coins arrondis/ biseautés, les ombres portées et les largeurs par bordure.
pt_br: Suporta cantos arredondados/chanfrados, sombras projetadas e larguras por borda.
zh_cn: 支持圆角/斜角、阴影和每边框宽度。

source: Texture-based theming using :ref:`class_StyleBoxTexture`.
cs: Motivy vytvořené z textur pomocí :ref:`class_StyleBoxTexture`.
de: Texturbasierte Themen mit :ref:`class_StyleBoxTexture`.
fr: Thème basée sur une texture en utilisant :ref:`class_StyleBoxTexture`.
pt_br: Temas baseados em textura usando :ref:`class_StyleBoxTexture`.
zh_cn: 使用 :ref:`class_StyleBoxTexture` 进行基于纹理的主题设计。

source: Godot's small distribution size can make it a suitable alternative to frameworks like Electron or Qt.
cs: Malá velikost distribuce Godot z něj činí vhodnou alternativu k frameworkům jako Electron nebo Qt.
de: Die geringe Verteilungsgröße von Godot kann es zu einer geeigneten Alternative zu Frameworks wie Electron oder Qt machen.
fr: La petite taille de distribution de Godot peut en faire une alternative appropriée à des frameworks comme Electron ou Qt.
pt_br: O tamanho de distribuição pequeno do Godot pode fazê-lo de uma alternativa para plataformas como Electron ou Qt.
zh_cn: Godot的发行软件包较小, 使其适合替代Electron或Qt之类的框架.

source: Animation
cs: Animace
pt_br: Animação
zh_cn: 动画

source: Direct kinematics and inverse kinematics.
cs: Přímá kinematika a inverzní kinematika.
de: Direkte Kinematics und inverse Kinematics.
fr: Direct kinematics et inverse kinematics.
pt_br: Cinemática direta e cinemática inversa.
zh_cn: 正向运动学与反向运动学.

source: Support for animating any property with customizable interpolation.
cs: Podpora animace libovolnévlastnosti s přizpůsobitelnou interpolací.
de: Unterstützung für die Animation jeder Eigenschaft mit änderbarer interpolation.
fr: Support de l'animation de toute propriété avec par interpolation personnalisable.
pt_br: Suporte a animação de qualquer propriedade com interpolação personalizável.
zh_cn: 支持为任何属性制作动画, 可自定义插值.

source: Support for calling methods in animation tracks.
cs: Podpora pro volání metod v animačních stopách.
de: Unterstützung um Methoden aufzurufen innerhalb von Animation-Spuren.
fr: Support des méthodes d'appel dans les pistes d'animation.
pt_br: Suporte a chamada de métodos em trilhas de animação.
zh_cn: 支持在动画轨道中调用方法.

source: Support for playing sounds in animation tracks.
cs: Podpora přehrávání zvuků v animačních stopách.
de: Unterstützung um Sounds abzuspielen innerhalb von Animation-Spuren.
fr: Support de la lecture de sons dans les pistes d'animation.
pt_br: Suporte a áudio em trilhas de animação.
zh_cn: 支持在动画轨道中播放声音.

source: Support for Bézier curves in animation.
cs: Podpora Bézierových křivek v animaci.
de: Unterstützung für Bézierkurven in Animationen.
fr: Support des courbes de Bézier dans les animations.
pt_br: Suporte a curvas Bézier em animações.
zh_cn: 支持在动画中使用贝塞尔曲线.

source: File formats
zh_cn: 文件格式
