Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, de, fr, pt_br, zh_cn

source: Scenes and resources can be saved in :ref:`text-based <doc_tscn_file_format>` or binary formats.
cs: Scény a herní zdroje lze uložit pomocí :ref:`textově založeného <doc_tscn_file_format>` nebo binárního formátu.
de: Szenen und Ressourcen können in :ref:`text-based <doc_tscn_file_format>` oder Binärformaten gespeichert werden.
fr: Les scènes et les ressources peuvent être enregistrées dans :ref:`text-based <doc_tscn_file_format>` ou des formats binaire.
pt_br: Cenas e recursos podem ser salvos como :ref:`text-based <doc_tscn_file_format>` ou em formatos binários.
zh_cn: 场景和资源可保存为 :ref:`文本 <doc_tscn_file_format>` 或二进制格式.

source: Text-based formats are human-readable and more friendly to version control.
cs: Textové formáty jsou čitelné pro člověka a přátelské k řízení verzí.
de: Text basierte Formate sind lesbarer und damit besser für eine Versionskontrolle.
fr: Les formats en texte sont lisibles par l'homme et plus compatible avec le contrôle de version.
pt_br: Formatos baseados em texto são legíveis por humanos e mais amigáveis a sistemas de versionamento.
zh_cn: 基于文本的格式易于阅读, 并且对版本控制更友好.

source: Binary formats are faster to save/load for large scenes/resources.
cs: Binární formáty se pro velké scény / zdroje rychleji ukládají / načítají.
de: Binärformate sind für große Szenen oder Ressourcen schneller geladen bzw. gespeichert.
fr: Les formats binaires sont plus rapides à sauvegarder/charger pour les grandes scènes/ressources.
pt_br: Formatos binários são mais rápidos para salvar e carregar para cenas e recursos pesados.
zh_cn: 二进制格式保存/加载大型场景/资源的速度更快.

source: Read and write text or binary files using :ref:`class_File`.
cs: Čtení a zápis textových nebo binárních souborů pomocí :ref:`class_File`.
de: Lese und schreibe Text oder Binärdateien mittels :ref:`class_File`.
fr: Lecture et écriture de fichiers texte ou binaires en utilisant :ref:`class_File`.
pt_br: Leia e escreva arquivos binários ou de texto usando :ref:`class_File`.
zh_cn: 使用 :ref:`class_File` 读写文本或二进制文件.

source: Can optionally be compressed or encrypted.
cs: Lze volitelně komprimovat nebo šifrovat.
de: Kann optional komprimiert oder verschlüsselt werden.
fr: Peut éventuellement être compressé ou chiffré.
pt_br: Podem ser opcionalmente comprimidos ou criptografados.
zh_cn: 可选择使用压缩或加密.

source: Read and write :ref:`class_JSON` files.
cs: Čtení a zápis :ref:`class_JSON` souborů.
de: Lesen und schreiben von :ref:`class_JSON` Dateien.
fr: Lecture et écriture de fichiers :ref:`class_JSON`.
pt_br: Leia e escreva arquivos :ref:`class_JSON`.
zh_cn: 读写 :ref:`class_JSON` 文件.

source: Read and write INI-style configuration files using :ref:`class_ConfigFile`.
cs: Čtení a zápis konfiguračních souborů ve stylu INI pomocí :ref:'class_ConfigFile'.
de: Lesen und schreiben von INI-Konfigurationsdateien mittels :ref:`class_ConfigFile`.
fr: Lecture et écriture de fichiers de configuration de type INI en utilisant :ref:`class_ConfigFile`.
pt_br: Leia e escreva arquivos de configuração em estilo INI usando :ref:`class_ConfigFile`.
zh_cn: 使用 :ref:`class_ConfigFile` 读写 INI 样式的配置文件.

source: Can (de)serialize any Godot datatype, including Vector, Color, ...
cs: Může (de) serializovat jakýkoli datový typ Godota, včetně Vector, Color, ...
de: Kann jeden Godot-Datentyp (de)serialisieren, unter anderem Vector, Color, ...
fr: Peut (dé)sérialiser n'importe quel type de données Godot, y compris Vector, Color, ...
pt_br: Pode (de)serializar qualquer tipo de dados do Godot, incluindo Vector, Color, ...
zh_cn: 可以(反)序列化任何Godot数据类型, 包括Vector, Color等.

source: Read XML files using :ref:`class_XMLParser`.
cs: Čtení souborů XML pomocí :ref:`class_XMLParser`.
de: Lese XML Dateien mittels :ref:`class_XMLParser`.
fr: Lire les fichiers XML en utilisant :ref:`class_XMLParser`.
pt_br: Leia arquivos XML usando :ref:`class_XMLParser`.
zh_cn: 使用 :ref:`class_XMLParser` 读取XML文件.

source: Pack game data into a PCK file (custom format optimized for fast seeking), into a ZIP archive, or directly into the executable for single-file distribution.
cs: Zabalte herní data do souboru PCK (vlastní formát optimalizovaný pro rychlé vyhledávání), do archivu ZIP nebo přímo do jednoho spustitelného souboru pro distribuci.
de: Packen Sie Spieldaten in eine PCK-Datei (benutzerdefiniertes Format, das für die schnelle Suche optimiert ist), in ein ZIP-Archiv oder direkt in die ausführbare Datei für die Verteilung als einzelne Datei.
fr: Emballez les données de jeu dans un fichier PCK (format custom optimisé pour la recherche rapide), dans une archive ZIP ou directement dans l'exécutable pour une distribution en fichier unique.
pt_br: Empacote dados de jogo num arquivo PCK (formato personalizado otimizado para buscas rápidas), num arquivo ZIP, ou diretamente no executável para distribuição de um único arquivo.
zh_cn: 将游戏数据打包到 PCK 文件(针对快速搜索优化的自定义格式), ZIP 存档或直接打包到可执行文件中以进行单文件分发.

source: :ref:`Export additional PCK files<doc_exporting_pcks>` that can be read by the engine to support mods and DLCs.
cs: :ref:`Exportovat další soubory PCK <doc_exporting_pcks>`, které lze číst enginempro podporu modů a DLC.
de: :ref:`Exportiere zusätzliche PCK Dateien<doc_exporting_pcks>` die von der Engine gelesen werden können, zur Unterstützung von Mods und DLCs.
fr: :ref:`Exporter des fichiers PCK supplémentaires <doc_exporting_pcks>` qui peuvent être lus par le moteur pour supporter les mods et les DLCs.
pt_br: :ref:`Exporte arquivos PCK adicionais<doc_exporting_pcks>` que podem ser lidos pelo Engine para suportar modificações e DLC.
zh_cn: :ref:`导出额外的PCK 文件 <doc_exporting_pcks>` , 引擎可以读取这些文件以支持mod和DLC.

source: Miscellaneous
cs: Různé
de: Verschiedenes
fr: Divers
pt_br: Diversos
zh_cn: 杂项

source: :ref:`Low-level access to servers <doc_using_servers>` which allows bypassing the scene tree's overhead when needed.
cs: :ref:`Nízkoúrovňový přístup k serverům <doc_using_servers>`, který umožňuje obejít režii stromu scény, když je to potřeba.
de: :ref:`Low-Level Zugriff auf Server <doc_using_servers>` die es erlauben den Szenenbaum-Overhead zu umgehen, falls nötig.
fr: :ref:`Accès de bas niveau aux serveurs <doc_using_servers>` ce qui permet de contourner la surcharge de l'arbre de scène lorsque cela est nécessaire.
pt_br: :ref:`Acesso de baixo nível aos servidores <doc_using_servers>` que permite ultrapassar o gargalo da árvore de cenas quando necessário.
zh_cn: :ref:`对服务器的低级别访问 <doc_using_servers>` , 能够在必要时绕过场景树的开销.

source: Command line interface for automation.
cs: Rozhraní příkazového řádku pro automatizaci.
de: Textbasierte UI (CLI) zur Automatisierung.
fr: Interface de ligne de commande pour l'automatisation.
pt_br: Interface de linha de comando para automação.
zh_cn: 用于自动化的命令行界面.

source: Export and deploy projects using continuous integration platforms.
cs: Export a nasazení projekty pomocí platforem kontinuální integrace.
de: Exportieren und Bereitstellen von Projekten mithilfe von kontinuierlich integrierten Plattformen.
fr: Exporter et déployer des projets en utilisant des plateformes d'intégration continue.
pt_br: Exporte e implante projetos usando plataformas de integração contínua.
zh_cn: 使用持续集成平台导出和部署项目.

source: `Completion scripts <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ are available for Bash, zsh and fish.
cs: `Skripty pro dokončení <https://github.com/godotengine/godot/tree/master/misc/dist/shell >`__ jsou k dispozici pro Bash, zsh a fish.
de: `komplette Skripte <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ sind verfügbar für Bash, zsh und fish.
fr: `Des scripts de complétion <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ sont disponibles pour Bash, zsh et fish.
pt_br: `Acabamento de scripts <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ estão disponíveis para Bash, zsh e fish.
zh_cn: 适用于Bash,zsh和fish的 `自动补全脚本 <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`_ .

source: Support for :ref:`C++ modules <doc_custom_modules_in_c++>` statically linked into the engine binary.
cs: Podpora pro :ref:`C ++ moduly <doc_custom_modules_in_c ++>` staticky linkovanédo binárního modulu enginu.
de: Unterstützung für :ref:`C++ Module <doc_custom_modules_in_c++>` die statisch in die binäre Engine eingebunden werden.
fr: Support :ref:`des modules C++ <doc_custom_modules_in_c++>` liés statiquement dans le binaire du moteur.
pt_br: Suporte para :ref:`módulos C++ <doc_custom_modules_in_c++>` com ligação estática ao binário do Engine.
zh_cn: 支持将 :ref:`C++ 模块 <doc_custom_modules_in_c++>` 静态链接到引擎二进制文件中.

source: Engine and editor written in C++03.
cs: Engine a editor napsaný v C ++ 03.
de: Engine und Editor geschrieben in C++03.
fr: Moteur et éditeur écrit en C++03.
pt_br: Engine e editor escritos em C++03.
zh_cn: 引擎和编辑器以C ++ 03编写.

source: Can be :ref:`compiled <doc_introduction_to_the_buildsystem>` using GCC, Clang and MSVC. MinGW is also supported.
cs: Může být :ref:`zkompilován <doc_introduction_to_the_buildsystem>` pomocí GCC, Clang a MSVC. Podporováno je také MinGW.
de: Kann :ref:`compiliert <doc_introduction_to_the_buildsystem>` werden mittels GCC, Clang und MSVC. MinGW wird auch unterstützt.
fr: Peut être :ref:`compilé <doc_introduction_to_the_buildsystem>` en utilisant GCC, Clang and MSVC. MinGW est également pris en charge.
pt_br: Pode ser :ref:`compilado <doc_introduction_to_the_buildsystem>` usando GCC, Clang e MSVC. MinGW também tem suporte.
zh_cn: 可使用GCC, Clang和MSVC进行 :ref:`编译 <doc_introduction_to_the_buildsystem>` . 同时支持MinGW.

source: Friendly towards packagers. In most cases, system libraries can be used instead of the ones provided by Godot. The build system doesn't download anything. Builds can be fully reproducible.
cs: Přátelský k balíčkovačům: ve většině případů lze místo knihoven poskytovaných Godotem použít systémové knihovny. Systém pro sestavení nic nestáhuje. Sestavení mohou být plně reprodukovatelné.
de: Benutzerfreundlich gegenüber Packagern: In den meisten Fällen können Systembibliotheken anstelle der von Godot bereitgestellten Bibliotheken verwendet werden. Das Build-System lädt nichts herunter. Builds können somit vollständig reproduzierbar sein.
fr: Respectueux des packagers. Dans la plupart des cas, les bibliothèques système peuvent être utilisées à la place de celles fournies par Godot. Le système de compilation ne télécharge rien. Les compilations peuvent être entièrement reproductibles.
pt_br: Amigável aos distribuidores de pacotes. Na maioria dos casos, bibliotecas do sistema podem ser utilizadas no lugar das fornecidas pelo Godot. O sistema de compilação não baixa nada. As compilações são completamente reproduzíveis.
zh_cn: 对打包者友好. 通常情况下, 可以使用系统库代替Godot提供的库. 构建(Build)系统不会下载任何东西. 构建完全可重现.

source: Godot 4.0 will be written in C++17.
cs: Godot 4.0 bude napsán v C ++ 17.
de: Godot 4.0 wird in C++17 geschrieben.
fr: Godot 4.0 sera écrit en C++17.
pt_br: Godot 4.0 será escrito em C++17.
zh_cn: Godot 4.0将使用C++17编写.

source: Licensed under the permissive MIT license.
cs: Licencováno pod tolerantní licencí MIT.
de: Lizenz mit Zustimmung vom MIT.
fr: Licencié sous la licence permissive MIT.
pt_br: Licenciado sob a licença permissiva MIT.
zh_cn: 宽松式MIT许可.

source: Open developement process with :ref:`contributions welcome <doc_ways_to_contribute>`.
cs: Otevřený proces vývoje s :ref:`příspěvky vítány <doc_ways_to_contribute>`.
de: Offener Entwicklungsprozess: :ref:`Beiträge willkommen <doc_ways_to_contribute>`.
fr: Développement ouvert :ref:`les contributions sont les bienvenues <doc_ways_to_contribute>`.
pt_br: Processo de desenvolvimento aberto com :ref:`contribuições bem-vindas <doc_ways_to_contribute>`.
zh_cn: 开放的开发过程, :ref:`欢迎贡献 <doc_ways_to_contribute>` .

source: The `Godot proposals repository <https://github.com/godotengine/godot-proposals>`__ lists features that have been requested by the community and may be implemented in future Godot releases.
zh_cn: `Godot 建议库 <https://github.com/godotengine/godot-proposals>`__ 列出了社区要求的、可能在未来 Godot 版本中实现的功能。

source: This page lists features supported by the current stable version of Godot (3.2). `More features <https://docs.godotengine.org/en/latest/about/list_of_features.html>`__ are available in the latest development version (4.0).
cs: Na této stránce jsou uvedeny funkce podporované aktuální stabilní verzí Godota (3.2). `Další funkce <https://docs.godotengine.org/en/latest/about/list_of_features.html >`__ jsou k dispozici v nejnovější vývojové verzi (4.0).

source: DynamicFont supports monochrome fonts as well as colored fonts. Supported formats are TTF and OTF.
cs: DynamicFont podporuje monochromatická i barevná písma. Podporované formáty jsou TTF a OTF.
de: DynamicFont unterstützt ein- sowie mehrfarbige Schriftarten. Unterstützte Formate sind TTF und OTF.
fr: DynamicFont prend en charge les polices monochromes ainsi que les polices colorées. Les formats pris en charge sont TTF et OTF.
pt_br: DynamicFont suporta fontes monocrómaticas bem como coloridas. Os formatos suportados são TTF e OTF.

source: Reflection techniques can be mixed together for greater accuracy.
cs: Odrazové techniky lze pro větší přesnost kombinovat.
de: Reflexionstechniken können für eine höhere Präzision auch kombiniert werden.
fr: Les techniques de réflexion peuvent être mélangées pour une plus grande précision.
pt_br: Técnicas de reflexão podem ser combinadas para maior precisão.

source: Built-in shapes: cuboid, sphere, capsule, cylinder (only with Bullet physics).
cs: Vestavěné tvary: kvádr, koule, kapsle, válec (pouze s fyzikou Bullet).

source: Text-based shaders using a `shader language inspired by GLSL <doc_shading_language>`.
cs: Textové shadery používající `shader jazyk inspirovaný GLSL <doc_shading_language>`.
de: Text-basierende Shader, die eine `Shader Sprache inspiriert von GLSL <doc_shading_language>` nutzen.
fr: Des shaders basés sur du texte utilisant un `langage de shader inspiré de GLSL <doc_shading_language>`.
pt_br: Shaders baseados em texto usando uma `linguagem de shader inspirada em GLSL <doc_shading_language>`.

source: :ref:`Graph-based visual scripting language <doc_what_is_visual_script>`.
cs: :ref:`Grafický vizuální skriptovací jazyk <doc_what_is_visual_script>`.
de: :ref:`Grafik-basierte visuelle Skriptsprache <doc_what_is_visual_script>`.
fr: :ref:`Langage de script visuel basé sur un graphique <doc_what_is_visual_script>`.
pt_br: :ref:`Linguagem de programação visual baseada em diagramas <doc_what_is_visual_script>`.

source: Audio input to record microphones.
cs: Zvukový vstup pro záznam mikrofonů.

source: Formats
cs: Formáty
de: Formate
pt_br: Formatos

source: The `roadmap <https://github.com/godotengine/godot-roadmap>`__ repository documents features that have been agreed upon and may be implemented in future Godot releases.
cs: `Road mapa <https://github.com/godotengine/godot-roadmap >`__ úložiště dokumentuje funkce, které již byly dohodnuty a mohou být implementovány v budoucích vydáních Godot.
de: Diese Seite zeigt einen `Fahrplan <https://github.com/godotengine/godot-roadmap>`__ mit Verbesserungen (Features) auf die man sich geeinigt hat und die möglicherweise in zukünftigen Godot-Versionen eingebaut werden.
fr: Le répertoire `roadmap <https://github.com/godotengine/godot-roadmap>`__ documente les fonctionnalités qui ont été convenues et qui pourraient être implémentées dans les futures versions de Godot.
pt_br: O repositório `roadmap <https://github.com/godotengine/godot-roadmap>`__ documenta os recursos que foram acordados e podem ser implementados em versões futuras do Godot.

source: *Windows:* WASAPI.
de: *Windows:* WASAPI (Windows Audio Session API).
