Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, de, fr, pt_br, zh_cn

source: Not all features are available. Features available only when using the OpenGL ES 3.0 renderer are marked *GLES3* below.
cs: Ne všechny funkce jsou k dispozici. Funkce dostupné pouze při použití vykreslovacího modulu OpenGL ES 3.0 jsou níže označeny *GLES3*.
de: Nicht alle Funktionen verfügbar. Funktionen, die nur bei Nutzung des Open GL ES 3.0 Renderers verfügbar sind, werden mit *GLES3" gekennzeichnet.
fr: Toutes les fonctionnalités ne sont pas disponibles. Les fonctionnalités disponibles uniquement lors de l'utilisation du moteur de rendu OpenGL ES 3.0 sont marquées *GLES3* ci-dessous.
pt_br: Nem todos os recursos estãos disponiveis. Os recursos disponiveis apenas ao utilizar OpenGL ES 3.0 estaram marcados com *GLES3*.
zh_cn: 并不是所有特性都可用。仅在使用 OpenGL ES 3.0 渲染器时可用的特性会在下文中标注 *GLES3* 。

source: **Camera:**
cs: **Kamera:**
de: **Kamera:**
fr: **Caméra :**
pt_br: **Câmera:**
zh_cn: **摄像机：**

source: Perspective, orthographic and frustum-offset cameras.
cs: Perspektivní, ortografické a komutované kamery.
de: Perspektivische, orthografische und Kegelstumpf-Offset Kameras.
fr: Caméras perspective, orthographiques et frustum-offset.
pt_br: Câmeras em perspectiva, ortográfica e deslocamento de tronco.
zh_cn: 透视、正交以及视锥偏移摄像机。

source: **Physically-based rendering:**
cs: **Vykreslování založené na fyzice**
de: **Physikalisch-basierendes Rendering:**
fr: **Rendu basé sur la physique :**
pt_br: **Renderização baseada em física:**
zh_cn: **基于物理的渲染：**

source: Follows the Disney PBR model.
cs: Následuje model Disney PBR.
de: Folgt dem Disney PBR Model.
fr: Suit le modèle Disney PBR.
pt_br: Segue o modelo Disney PBR.
zh_cn: 遵循迪士尼 PBR 模型。

source: Uses a roughness-metallic workflow with support for ORM textures.
cs: Používá roughness-metallic postup s podporou ORM textury.
de: Nutzt einen metallisch-rohen Arbeitsablauf mit Unterstützung für ORM Texturen.
fr: Utilise un flux de travail de type rugosité-métal avec support des textures ORM.
pt_br: Utiliza o fluxo de trabalho roughness-metallic com suporte para texturas ORM.
zh_cn: 使用粗糙度金属度工作流，支持 ORM 纹理。

source: Normal mapping.
cs: Normální mapování.
pt_br: Mapeamento Normal.
zh_cn: 法线贴图。

source: *GLES3:* Parallax/relief mapping with automatic level of detail based on distance.
cs: *GLES3:* Parallax / reliéfní mapování s automatickou úrovní detailů na základě vzdálenosti.
de: *GLES3:* Parallax/Relief Mapping mit automatischem Detailgrad abhängig von der Entfernung.
fr: *GLES3 :* Cartographie parallaxe/relief avec niveau de détail automatique basé sur la distance.
pt_br: *GLES3:* Mapeamento de Paralaxe/Relevo com níveis de detalhamento automático baseado na distancia.
zh_cn: *GLES3：* 基于距离的拥有自动层级细节的视差/浮雕透视。

source: *GLES3:* Sub-surface scattering and transmittance.
cs: *GLES3:* Podpovrchový rozptyl a propustnost.
de: *GLES3:* Sub-Surface Trübung und Durchlässigkeit.
fr: *GLES3 :* Diffusion et transmittance sous la surface.
pt_br: *GLES3:* Dispersão e transmissão da sub-superfície.
zh_cn: *GLES3：* 次表面散射和透射率。

source: *GLES3:* Proximity fade (soft particles).
cs: *GLES3:* Blízké vyblednutí (měkké částice).
de: *GLES3:* Umgebungsunschärfe (Soft Partikel).
fr: *GLES3 :* Fondu de proximité (particules molles).
pt_br: *GLES3:* Desvanecimento de proximidade (partículas suaves).
zh_cn: *GLES3：* 近距离衰减（软粒子）。

source: Distance fade which can use alpha blending or dithering to avoid going through the transparent pipeline.
cs: Ztráta vzdálenosti, která může používat alfa míchání nebo rozklad barev, aby se zabránilo průchodu přez pipeline průhlednosti.
de: Entfernungsunschärfe die Alpha Blending oder Dithering nutzt, um den Weg durch die Transparenz Pipeline zu vermeiden.
fr: Fondu de distance qui peut utiliser le mélange alpha ou le dithering pour éviter de passer par le pipeline transparent.
pt_br: O esmaecimento de distância pode usar mistura alfa ou matização para evitar passar pelo [i]pipeline[/i] transparente.
zh_cn: 可以使用 alpha 混合或抖动避免距离衰减通过透明管道。

source: Dithering can be determined on a per-pixel or per-object basis.
cs: Dithering lze určit na základě počtu pixelů nebo na základě jednotlivých objektů.
de: Dithering (Bewegungsunschärfe) kann auf Pixel oder Objekt Basis berechnet werden.
fr: Le Dithering peut être déterminée par pixel ou par objet.
pt_br: A matização pode ser determinada com bases em pixel ou objeto.
zh_cn: 抖动可以根据每个像素或每个对象来确定。

source: **Real-time lighting:**
cs: **Osvětlení v reálném čase:**
de: **Echtzeit Beleuchtung:**
fr: **Éclairage en temps réel :**
pt_br: **Iluminação em tempo real:**
zh_cn: **实时光照：**

source: Directional lights (sun/moon). Up to 4 per scene.
cs: Směrová světla (slunce / měsíc). Až 4 na scénu.
de: Richtungsabhängige Beleuchtung (Sonne/Mond), bis zu 4 pro Szene.
fr: Lumières directionnelles (soleil/lune). Jusqu'à 4 par scène.
pt_br: Luzes direcionadas (sol/lua). Até 4 por cena.
zh_cn: 定向光（日光/月光）。每个场景最多 4 个。

source: Omnidirectional lights.
cs: Všesměrová světla.
de: Rundum Beleuchtung.
fr: Lumières omnidirectionnelles.
pt_br: Luzes unidirecionais.
zh_cn: 全方向光。

source: Spot lights with adjustable cone angle and attenuation.
cs: Bodová světla s nastavitelným úhlem kužele a útlumem.
de: Spot Lights mit einstellbarem Kegelwinkel und Dämpfung.
fr: Lumières spot avec angle de cône et atténuation réglables.
pt_br: Focos de luz com ajuste de angulo por cone e atenuação.
zh_cn: 可调整锥角和衰减的聚光灯。

source: **Shadow mapping:**
cs: **Mapování stínů:**
de: **Schatten abbilden (Shadow Mapping):**
pt_br: **Mapeamento de sombras:**
zh_cn: **阴影贴图：**

source: *DirectionalLight:* Orthogonal (fastest), PSSM 2-split and 4-split. Supports blending between splits.
cs: *DirectionalLight:* Orthogonal (nejrychlejší), PSSM 2-split and 4-split. Podporuje prolnutí mezer.
de: *DirectionalLight:* Orthogonal (am schnellsten), PSSM 2-split und 4-split. Unterstützt Blending zwischen splits.
fr: *DirectionalLight :* Orthogonal (fastest), PSSM 2-split and 4-split. Supporte le mélange entre les divisions (splits).
pt_br: *Luz Direcional:* Ortagonal (mais rápida), PSSM 2 divisões e 4 divisões. Suporta mesclagem entre divisões.
zh_cn: *方向光:* 正交(最快), PSSM 2-split和4-split. 支持分割之间的混合.

source: *OmniLight:* Dual paraboloid (fast) or cubemap (slower but more accurate). Supports colored projector textures in the form of panoramas.
cs: *OmniLight:* Duální parabolid (rychlý) nebo cubemap (pomalejší, ale přesnější). Podporuje barevné textury projektorů ve formě panoramat.
de: *OmniLight:* Dual Parabolid (schnell) oder Cubemap (langsamer, aber genauer). Unterstützt farbige Projektortexturen in Form von Panoramen.
fr: *OmniLight :* Double paraboloïde (rapide) ou cubemap (plus lent mais plus précis). Supporte les textures colorées du projecteur sous forme de panoramas.
pt_br: *OmniLight:* Parabolóide duplo (rápido) ou mapa do cubo (mais lento, porém mais preciso ). Suporta texturas de projeção de cores na forma de panoramas.
zh_cn: *OmniLight(全向光):* 双抛物面(快速)或立方映射(较慢但更精确). 支持全景形式的彩色投影纹理.

source: *SpotLight:* Single texture.
cs: *SpotLight:* Jedna textura.
de: *SpotLight:* Einzelne Textur.
fr: *SpotLight :* Texture unique.
pt_br: *Destaque:* Testura única.
zh_cn: *SpotLight(点光):* 单个材质.

source: **Global illumination with indirect lighting:**
cs: **Globální iluminace s nepřímým osvětlením:**
de: **Globale Beleuchtung mit indirekter Beleuchtung:**
fr: **Éclairage global avec éclairage indirect :**
pt_br: **Iluminação global por luzes indiretas:**
zh_cn: **具有间接照明的全局照明:**

source: Baked lightmaps (fast, but can't be updated at run-time).
cs: Baked lightmapy (rychlé, ale nelze je aktualizovat za běhu).
de: Gebrannte LightMaps (schnell, kann aber während der Laufzeit nicht aktualisiert werden).
fr: Baked lightmaps (rapides, mais ne peuvent être mises à jour à l'exécution).
pt_br: Lightmaps previamente calculados (rápido, mas não pode ser atualizado durante a execução).
zh_cn: 烘焙光照贴图(快速, 但无法在运行时更新).

source: Supports baking indirect light only or baking both direct and indirect lighting. The bake mode can be adjusted on a per-light basis to allow for hybrid light baking setups.
zh_cn: 支持仅烘焙间接光照，或者同时烘焙直接和间接光照。可以给各个光源单独设置烘焙模式，从而实现混合光照烘焙。

source: Supports lighting dynamic objects using an automatic octree-based system. No manual probe placement is required.
zh_cn: 使用自动的基于八叉树系统对动态对象的光照进行支持。无需手动布置探针。

source: Lightmaps are baked on the CPU.
cs: Světelné mapy se připravované na CPU.
de: LightMaps werden auf der CPU eingebrannt.
fr: Lightmaps sont pré-calculées par le CPU.
pt_br: Lightmaps são previamente calculados na CPU.
zh_cn: 光照贴图在 CPU 上烘焙。

source: *GLES3:* GI probes (slower, semi-real-time). Supports reflections.
cs: *GLES3:* GI sondy (pomalejší, v reálném čase). Podporuje odrazy.
de: *GLES3:* GI Probes (langsamer, Semi-Real-Time). unterstützt Reflexionen.
fr: *GLES3 :* sondes GI (plus lentes, en temps semi-réel). Supporte les réflexions.
pt_br: *GLES3:* GI probes (mais lento, semi-tempo real). Suporta reflexões.
zh_cn: *GLES3:* GI(全局光照)探头(较慢, 半实时). 支持反射.

source: **Reflections:**
cs: **Odrazy:**
de: **Reflexionen:**
fr: **Réflexions :**
pt_br: **Opções de execução:**
zh_cn: **反射:**

source: *GLES3:* Voxel-based reflections (when using GI probes).
cs: *GLES3:* Odrazy založené na Voxelu (při použití sond GI).
de: *GLES3:* Voxel-basierende Reflexionen (bei Nutzung von GI Probes).
fr: *GLES3 :* Réflexions à base de voxels (lors de l'utilisation de GI probes).
pt_br: *GLES3:* Reflexões baseadas em Voxel (ao utilizar GI probes).
zh_cn: *GLES3:* 基于体素的反射(当使用GI全局光照探头).

source: Fast baked reflections or slow real-time reflections using ReflectionProbe. Parallax correction can optionally be enabled.
cs: Rychle vytvořené odrazy nebo pomalé odrazy v reálném čase pomocí ReflectionProbe. Korekci paralaxe lze volitelně povolit.
de: Schnell gebrannte Reflektionen oder langsame Echtzeit-Reflektionen nutzen ReflectionProbe. Parallaxe Korrekturen können wahlweise eingeschaltet werden.
fr: Réflexions rapides pré-calculées ou réflexions lentes en temps réel à l'aide de ReflectionProbe. La correction de la parallaxe peut être activée en option.
pt_br: Reflexões rápidas previamente calculadas ou reflexões lentas em tempo real usando ReflectionProbe. A correção de paralaxe pode ser ativada opcionalmente.
zh_cn: 使用 ReflectionProbe 实现较快的烘焙反射或较慢的实时反射。可以选择启用视差校正。

source: *GLES3:* Screen-space reflections.
cs: *GLES3:* Odrazy místa na obrazovce.
de: *GLES3:* Screen-Space Reflexionen.
fr: *GLES3 :* Réflexions écran-espace.
pt_br: *GLES3:* Reflexões de Screen-space.
zh_cn: *GLES3:* 屏幕空间反射.

source: Reflection techniques can be mixed together for greater accuracy or scalability.
zh_cn: 反射技术可以混合在一起，以获得更高的准确性或可扩展性。

source: **Sky:**
cs: **Obloha:**
de: **Himmel:**
fr: **Ciel :**
pt_br: **Céu:**
zh_cn: **天空:**

source: Panorama sky (using an HDRI).
cs: Panoramatická obloha (pomocí HDRI).
de: Panorama Himmel (nutzt HDRI).
fr: Ciel panoramique (en utilisant un HDRI).
pt_br: Céu de Panorama (utilizando HDRI).
zh_cn: 全景天空(使用HDRI).

source: Procedural sky.
cs: Procedurální obloha.
de: Prozeduraler Himmel.
fr: Ciel procédural.
pt_br: Céu procedural.
zh_cn: 全景天空.

source: **Fog:**
cs: **Mlha:**
de: **Nebel:**
fr: **Brouillard :**
pt_br: **Neblina:**
zh_cn: **雾:**

source: Depth fog with an adjustable attenuation curve.
cs: Hloubková mlha s nastavitelnou křivkou útlumu.
de: Sichtweite des Nebels mit anpassbarer Dämpfungskurve.
fr: Brouillard en profondeur avec une courbe d'atténuation réglable.
pt_br: Profundidade da neblina com ajuste de curva de atenuação.
zh_cn: 具有可调衰减曲线的深度雾.

source: Height fog (floor or ceiling) with adjustable attenuation.
cs: Výšková mlha (podlaha nebo strop) s nastavitelným útlumem.
de: Höhennebel (Fußboden oder Decke) mit anpassbarer Dämpfung.
fr: Brouillard de hauteur (sol ou plafond) avec atténuation réglable.
pt_br: Altura da neblina (Chão ou teto) com ajuste de atenuação.
zh_cn: 高度雾(floor 或 ceiling), 衰减可调.

source: Support for automatic depth fog color depending on the camera direction (to match the sun color).
cs: Podpora automatické hloubkové barvy mlhy v závislosti na směru kamery (podle barvy slunce).
de: Unterstützung für automatische Tiefenanpassung der Nebelfarbe abhängig von der Kameraposition (um mit der Sonnenfarbe übereinzustimmen).
fr: Prise en charge de la couleur du brouillard de profondeur automatique en fonction de la direction de la caméra (pour correspondre à la couleur du soleil).
pt_br: Suporte para auto coloração de neblina a depender da direção da câmera (para se ajustar de acordo com a cor do sol).
zh_cn: 支持基于相机角度的自动深度雾颜色(依据日光的颜色).

source: Optional transmittance to make lights more visible in the fog.
cs: Volitelná propustnost pro zviditelnění světel v mlze.
de: Optionale Lichtdurchlässigkeit um Lichter im Nebel besser zu erkennen.
fr: Transmittance optionnelle pour rendre les lumières plus visibles dans le brouillard.
pt_br: Transmissão opcional para fazer com que as luzes sejam mais visíveis quando com neblina.
zh_cn: 可选透光率, 使灯光在雾中更清晰可见.

source: **Particles:**
cs: **Částice:**
de: **Partikel:**
fr: **Particules :**
pt_br: **Partículas:**
zh_cn: **粒子:**

source: *GLES3:* GPU-based particles with support for custom particle shaders.
cs: Částice generované GPU s podporou pro vlastní částicové shadery.
de: *GLES3:* GPU-basierte Partikel mit Unterstützung für eigene Partikel Shader.
fr: *GLES3 :* particules calculées par le GPU avec support pour les shaders de particules personnalisés.
pt_br: *GLES3:* Partículas baseados em GPU com suporte para shaders de partículas personalizado.
zh_cn: *GLES3:* 支持自定义粒子着色器的GPU粒子.

source: **Post-processing:**
cs: **Následné zpracování:**
fr: **Post-traitement :**
pt_br: **Pós-processamento:**
zh_cn: **自定义后期处理:**

source: Tonemapping (Linear, Reinhard, Filmic, ACES).
cs: Tonemapování (lineární, Reinhard, filmový, ACES).
pt_br: Mapeio de Tons (Linear, Reinhard, Filmic, ACES).
zh_cn: 色调映射(线性, Reinhard, Filmic, ACES).

source: *GLES3:* Automatic exposure adjustments based on viewport brightness.
cs: *GLES3:* Automatické úpravy expozice na základě jasu výřezu.
de: *GLES3:* Automatische Regelung zur Aufdeckung basierend auf der Helligkeit des Darstellungsbereichs.
fr: *GLES3 :* Ajustements automatiques de l'exposition en fonction de la luminosité du viewport.
pt_br: *GLES3:* Ajustes de exposição automáticos baseado no brilho da janela de visualização.
zh_cn: *GLES3:* 根据视窗亮度自动调整曝光.

source: *GLES3:* Near and far depth of field.
cs: *GLES3:* Blízká a velká hloubka ostrosti.
de: *GLES3:* Nahe und ferne Tiefenschärfe.
fr: *GLES3 :* Profondeur de champ proche et lointaine.
pt_br: *GLES3:* Profundidade de campo próxima e distante.
zh_cn: *GLES3:* 近景深和远景深.

source: *GLES3:* Screen-space ambient occlusion.
cs: *GLES3:* Okolní okluze obrazovky.
de: *GLES3:* Screen-Space Ambient Occlusion (SSAO - ist eine Rendering-Technik).
fr: *GLES3,:* Occlusion ambiante de l'espace écran.
pt_br: *GLES3:* Screen-space ambient occlusion (SSAO - Oclusão de ambiente do espaço da tela).
zh_cn: *GLES3:* 屏幕空间环境光遮挡.

source: *GLES3:* Optional debanding to avoid color banding (effective when HDR rendering is enabled).
de: *GLES3:* Optionales Debanding zur Vermeidung von Color Banding (wirksam, wenn HDR-Rendering aktiviert ist).
pt_br: *GLES3:* Debanding opcional para evitar color banding (efetiva quando a renderização HDR está ativa).
zh_cn: *GLES3:* 可选的去斑，以避免产生色带（在启用HDR渲染时有效）。

source: Glow/bloom with optional bicubic upscaling and several blend modes available: Screen, Soft Light, Add, Replace.
cs: GLow/bloom s volitelným bikubickým upscalingem a několika dostupnými režimy prolnutí: Obrazovka, Měkké světlo, Přidat, Nahradit.
de: glühen/blühen mit optionaler bikubischer Hochskalierung und verschiedenen Mischmodi: Bildschirm, weiches Licht, hinzufügen, ersetzen.
fr: Glow/bloom avec mise à l'échelle bicubique en option et plusieurs modes de mélange disponibles : Screen, Soft Light, Add, Replace.
pt_br: Brilho/Bloom com escala bicúbica opcional e vários modos de combinação disponíveis: Tela, Luz Suave, Subexposição Linear, Substituir.
zh_cn: 发光(glow/bloom)可以使用可选的双三次放大和多种混合模式: 屏幕, 柔和光, 添加, 替换.

source: Color correction using an one-dimensional ramp.
cs: Korekce barev pomocí jednorozměrné rampy.
de: Farbkorrektur mit Hilfe einer eindimensionalen Rampe.
fr: Correction des couleurs à l'aide d'une rampe unidimensionnelle.
pt_br: Correção de cor de rampa unidimensional.
zh_cn: 使用一维渐变进行颜色校正.

source: Brightness, contrast and saturation adjustments.
cs: Nastavení jasu, kontrastu a sytosti.
de: Helligkeit-, Kontrast- und Sättigungs-Regler.
fr: Réglages de la luminosité, du contraste et de la saturation.
pt_br: Ajustes de brilho, contraste e saturação.
zh_cn: 亮度, 对比度和饱和度调整.

source: **Texture filtering:**
cs: **Filtrování textur:**
de: **Textur Filterung:**
fr: **Filtrage de texture :**
pt_br: **Filtragem de textura**
zh_cn: **纹理过滤:**

source: Nearest, bilinear, trilinear or anisotropic filtering.
cs: Nejbližší, bilineární, trilineární nebo anizotropní filtrování.
de: Nächstgelegene, bilineare, trilineare oder anisotrope Filterung.
fr: Filtrage nearest, bilinear, trilinear ou anisotropic.
pt_br: Filtragem mais próxima, bilinear, trilinear ou anisotrópica.
zh_cn: 最近, 双线性, 三线性或各向异性滤波.

source: **Texture compression:**
cs: **Komprese textur:**
de: **Textur Kompression:**
fr: **Compression de texture :**
pt_br: **Compressão de Textura:**
zh_cn: **纹理压缩:**

source: *GLES3:* BPTC for high-quality compression (not supported on macOS).
cs: *GLES3:* BPTC pro vysoce kvalitní kompresi (není podporováno v systému MacOS).
de: *GLES3:* BPTC für High-Quality Kompression (keine Unterstützung auf MacOS).
fr: *GLES3 :* BPTC pour une compression de haute qualité (non supporté sur macOS).
pt_br: *GLES3:* BPTC para compressão de alta qualidade (não é compatível com macOS).
zh_cn: *GLES3:* 用于高质量压缩的BPTC(macOS不支持).

source: *GLES3:* ETC2 (not supported on macOS).
cs: *GLES3:* ETC2 (není podporováno v systému MacOS).
de: *GLES3:* ETC2 (keine Unterstützung auf MacOS).
fr: *GLES3 :* ETC2 (non supporté sur macOS).
pt_br: *GLES3:* ETC2 (não é compatível com macOS).
zh_cn: *GLES3:* ETC2(macOS不支持).

source: ETC1 (recommended when using the GLES2 renderer).
cs: ETC1 (doporučeno při použití vykreslovacího modulu GLES2).
de: ETC1 (Empfohlen falls GLES2 Renderer genutzt wird).
fr: ETC1 (recommandé lors de l'utilisation du moteur de rendu GLES2).
pt_br: ETC1 (recomendado ao utilizar o renderizador GLES2).
zh_cn: ETC1(建议在使用GLES2渲染器时使用).

source: *GLES3:* S3TC (not supported on mobile/Web platforms).
cs: *GLES3:* S3TC (není podporován na mobilních / webových platformách).
de: *GLES3:* S3TC (keine Unterstützung auf mobilen Geräten/Web Plattformen).
fr: *GLES3 :* S3TC (non supporté sur les plateformes mobiles/Web).
pt_br: *GLES3:* S3TC (não é compatível com as plataformas móveis/Web).
zh_cn: *GLES3:* S3TC(移动/网络平台不支持).

source: **Anti-aliasing:**
pt_br: **antisserrilhamento:**
zh_cn: **抗锯齿:**

source: Multi-sample antialiasing (MSAA).
cs: Vícenásobné vyhlazování (MSAA).
fr: Antialiasing multi-échantillon (MSAA).
pt_br: Antisserrilhado (MSAA) de várias amostras.
zh_cn: 多采样抗锯齿(MSAA).

source: Fast approximate antialiasing (FXAA).
de: Multi-Sample Antialiasing (MSAA).
pt_br: Antialiasing aproximado rápido (FXAA).
zh_cn: 快速近似抗锯齿 (FXAA).

source: Most of these effects can be adjusted for better performance or to further improve quality. This can be helpful when using Godot for offline rendering.
cs: Většina z těchto efektů může být upravena pro lepší výkon nebo pro další zlepšení kvality. To může být užitečné při použití Godota pro offline vykreslování.
de: Die meisten dieser Effekte können zur Verbesserung der Leistung oder zur weiteren Qualitätsverbesserung angepasst werden. Dies kann hilfreich sein, wenn Sie Godot für das Offline-Rendering verwenden.
fr: La plupart de ces effets peuvent être ajustés pour obtenir de meilleures performances ou pour améliorer encore la qualité. Cela peut être utile lorsque vous utilisez Godot pour un rendu différé.
pt_br: A maioria desses efeitos pode ser ajustada para melhor desempenho ou para melhorar ainda mais a qualidade. Isso pode ser útil ao usar o Godot para renderização offline.
zh_cn: 这些效果中的大多数都可以调整以获得更好的性能或进一步提高质量. 这在使用Godot进行脱机渲染时非常有用.

source: 3D tools
cs: 3D nástroje
de: 3D Werkzeuge
fr: Outils 3D
pt_br: Ferramentas 3D
zh_cn: 3D工具

source: Built-in meshes: cube, cylinder/cone, (hemi)sphere, prism, plane, quad.
cs: Vestavěná oka: kostka, válec / kužel, (hemi) koule, hranol, rovina, čtyřúhelník.
de: eingebaute Meshes: Würfel, Zylinder/Kegel, (Halb-) Kugel, Prisma, Ebene, Quader.
fr: Maillages intégrés : cube, cylindre/cône, (hémi)sphère, prisme, plan, quadrilatère.
pt_br: Malhas integradas: cubo, cilindro/cone, (hemi) esfera, prisma, plano, quad.
zh_cn: 内置网格: 立方体, 圆柱体/圆锥体, (半)球体, 棱柱体, 平面, 四边形.

source: Tools for :ref:`procedural geometry generation <doc_procedural_geometry>`.
cs: :ref:`Proceduralní geometrie <toc-procedural_geometry>`.
de: Werkzeuge für :ref:`Prozedurale Geometrien <toc-procedural_geometry>`.
fr: Outils pour :ref:`génération de la géométrie procédurale <doc_procedural_geometry>`.
pt_br: Ferramentas para :ref:`geração de geometria procedural <doc_procedural_geometry>`.
zh_cn: 工具 :ref:`procedural geometry generation<doc_procedural_geometry>`.

source: :ref:`Constructive solid geometry <doc_csg_tools>` (intended for prototyping).
cs: :ref:`Konstrukční pevná geometrie <doc_csg_tools>` (určená pro prototypování).
de: :ref:`Constructive solid geometry <doc_csg_tools>` (vorgesehen für Prototyping).
fr: :ref:`Constructive solid geometry <doc_csg_tools>` (destiné au prototypage).
pt_br: :ref:`Geometria sólida construtiva <doc_csg_tools>` (destinado para criação de protótipos).
zh_cn: :ref:`Constructive solid geometry <doc_csg_tools>` (用于原型制作).

source: Path3D node to represent a path in 3D space.
cs: Uzel Path3D reprezentující cestu ve 3D prostoru.
de: Path3D node steht für einen Pfad in 3D Raum.
fr: Nœud Path3D pour représenter un chemin dans l'espace 3D.
pt_br: Nó Path3D para representar um caminho no espaço 3D.
zh_cn: Path3D节点表示三维空间中的路径.

source: PathFollow3D node to make nodes follow a Path3D.
cs: Uzel PathFollow3D, aby uzly sledovaly Path3D.
de: PathFollow3D damit Nodes einem Path3D folgen.
fr: PathFollow3D pour que les nœuds suivent un Path3D.
pt_br: Nó PathFollow3D para fazer com que os nós sigam um Path3D.
zh_cn: PathFollow3D节点, 使节点跟随Path3D.

source: 3D geometry helper class.
cs: Pomocná třída 3D geometrie.
de: 3D Geometrie Hilfsklasse.
fr: Classe d'aide à la géométrie 3D.
pt_br: Classe auxiliar de geometria 3D.
zh_cn: 三维几何帮助器类.

source: 3D physics
cs: 3D fyzika
de: 3D Physik
fr: Physique 3D
pt_br: Física 3D
zh_cn: 3D物理学

source: Vehicle bodies (intended for arcade physics, not simulation).
cs: Karoserie vozidel (určené pro arkádovou fyziku, nikoli pro simulaci).
de: Fahrzeug Körper (vorgesehen für Arcade Physik, keine Simulation).
fr: Corps de véhicules (destinées à la physique arcade, pas à la simulation).
pt_br: Corpos de veículos (destinado para físicas arcade, não para simulação).
zh_cn: 车身(用于街机物理, 而非模拟).

source: Soft bodies.
cs: Měkká tělesa.
de: Weiche Körper.
fr: Corps mous.
pt_br: Corpos macios.
zh_cn: 软体.

source: Ragdolls.
cs: Ragdoll.
de: Ragdolls (Gliederpuppen).
zh_cn: 布娃娃系统.

source: Built-in shapes: cuboid, sphere, capsule, cylinder.
de: Eingebaute Formen: Quader, Kugel, Kapsel, Zylinder (nur mit Projektil-Physik).
zh_cn: 内置形状: 长方体,球体, 胶囊, 圆柱体.

source: Generate triangle collision shapes for any mesh from the editor.
cs: Generujte trojúhelníkové kolizní tvary pro libovolnou síť vyrvořenou editorem.
de: Erzeugt dreieckige Kollisionsformen für jedes Mesh aus dem Editor.
fr: Générer des formes de collision triangle pour n'importe quel maillage à partir de l'éditeur.
pt_br: Gerar formas de colisão triangulares para qualquer malha pelo editor.
zh_cn: 从编辑器中为任何网格生成三角形碰撞形状.
