Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, de, fr, pt_br, zh_cn

source: Generate one or several convex collision shapes for any mesh from the editor.
cs: Vygenerujte jeden nebo několik konvexních kolizních tvarů pro libovolnou síť z editoru.
de: Erzeugt eine oder mehrere konvexe (nach außen gewölbte) Kollisionsformen für jedes Mesh aus dem Editor.
fr: Générer une ou plusieurs formes de collision convexes pour n'importe quel maillage à partir de l'éditeur.
pt_br: Gerar uma ou várias formas de colisão convexas para qualquer malha pelo editor.
zh_cn: 从编辑器中为任何网格生成一个或多个凸碰撞形状.

source: Shaders
cs: Shadery
de: Shader (Schattierer)
zh_cn: 着色器

source: *2D:* Custom vertex, fragment, and light shaders.
cs: *2D:* Vlastní vertex, fragmentové a světelné shadery.
de: *2D:* Custom Vertex, Fragment und Beleuchtungs-Shader.
fr: *2D :* Vertex, fragment et shaders de lumière personnalisés.
pt_br: *2D:* Shaders de vertíce, fragmento e luz personalizados.
zh_cn: *2D:* 自定义顶点, 片段和灯光着色器.

source: *3D:* Custom vertex, fragment, light, and sky shaders.
cs: *3D:* Vlastní vertex , fragmentové, světelné shadery a shadery oblohy.
de: *3D:* Custom Vertex, Fragment, Beleuchtungs- und Himmels-Shader.
fr: *3D :* Vertex, fragment, lumière et shaders de ciel personnalisés.
pt_br: *3D:* Shaders personalizados para vértices, fragmentos, luzes e céu.
zh_cn: *3D:* 自定义顶点, 片段, 灯光和天空着色器.

source: Text-based shaders using a :ref:`shader language inspired by GLSL <doc_shading_language>`.
zh_cn: 基于文本的着色器，使用 :ref:`由 GLSL 启发的着色器语言 <doc_shading_language>` 。

source: Visual shader editor.
cs: Vizuální editor shaderů.
de: Visueller Shader Editor.
fr: Éditeur de shaders visuels.
pt_br: Editor visual de shaders.
zh_cn: 可视化着色器编辑器.

source: Support for visual shader plugins.
cs: Podpora doplňků vizuálních shaderu.
de: Unterstützung für visuelle Shader Plugins.
fr: Prise en charge des plugins de shaders visuels.
pt_br: Suporte para plugins visuais de shader.
zh_cn: 支持可视化着色器插件.

source: Scripting
cs: Skriptování
de: Skripten
fr: Les scripts
zh_cn: 编写脚本

source: **General:**
cs: **Všeobecné:**
de: **Allgemein:**
fr: **Général :**
pt_br: **Geral:**
zh_cn: **常规:**

source: Object-oriented design pattern with scripts extending nodes.
cs: Objektově orientovaný návrhový vzor se skripty rozšiřujícími uzly.
de: Objektorientierte Designvorlagen mit Skript erweitertem Node.
fr: Modèle de conception orientée-objet avec des scripts étendant(extend) de nœuds.
pt_br: Padrão de design orientado a objetos com scripts que estendem nós.
zh_cn: 具有脚本扩展节点的面向对象设计模式.

source: Signals and groups for communicating between scripts.
cs: Signály a skupiny pro komunikaci mezi skripty.
de: Signale und Gruppen zur Kommunikation zwischen Skripten.
fr: Signaux et groupes pour la communication entre les scripts.
pt_br: Sinais e grupos para comunicação entre scripts.
zh_cn: 用于脚本之间通信的信号和组.

source: Support for :ref:`cross-language scripting <doc_cross_language_scripting>`.
cs: Podpora pro :ref:`cross-language scripting <doc_cross_language_scripting>`.
de: Unterstützung für :ref:`sprachübergreifendes Skripten <doc_cross_language_scripting>`.
fr: Prise en charge de :ref:`script cross-langage <doc_cross_language_scripting>`.
pt_br: Suporte para :ref:`scripting entre linguagens <doc_cross_language_scripting>`.
zh_cn: 支持 :ref:`cross language scripting<doc_cross_language_scripting>`.

source: Many 2D and 3D linear algebra data types such as vectors and transforms.
cs: Mnoho typů pro 2D a 3D lineární algebru, jako jsou vektory a transformace.
de: Viele 2D und 3D lineare Algebra Datentypen wie Vektoren und Transformationen.
fr: De nombreux types de données d'algèbre linéaire en 2D et 3D comme les vecteurs et les transformations.
pt_br: Diversos tipos de dados de algebra linear 2D e 3D como vetores e transformações.
zh_cn: 多种二维和三维线性代数数据类型, 如向量和变换.

source: :ref:`High-level interpreted language <doc_gdscript>` with :ref:`optional static typing <doc_gdscript_static_typing>`.
cs: :ref:`Interpretovaný high-level jazyk i <doc_gdscript>` s :ref:`volitelné statické typy<doc_gdscript_static_typing>`.
de: :ref:`High-Level Interpreter Sprache <doc_gdscript>` mit :ref:`optionaler statischer Typisierung <doc_gdscript_static_typing>`.
fr: :ref:`Langage interprété de haut niveau <doc_gdscript>` avec :ref:`typage statique optionnel <doc_gdscript_static_typing>`.
pt_br: :ref:`Linguagem interpretada de alto nível <doc_gdscript>` com :ref:`tipagem estática opcional <doc_gdscript_static_typing>`.
zh_cn: :ref:`High-level interpreted language <doc_gdscript>` 和 :ref:`optional static typing <doc_gdscript_static_typing>`.

source: Syntax inspired by Python.
cs: Syntaxe inspirovaná Pythonem.
de: Syntax inspiriert von Python.
fr: Syntaxe inspirée de Python.
pt_br: Sintaxe inspirada em Python.
zh_cn: 语法灵感来自Python.

source: Syntax highlighting is provided on GitHub.
cs: Zvýraznění syntaxe je k dispozici na GitHubu.
de: Syntax Highlighting (Hervorhebung) wird unterstützt auf GitHub.
fr: La mise en évidence de la syntaxe est fournie sur GitHub.
pt_br: Destaque de sintaxe é providenciado no GitHub.
zh_cn: GitHub上提供了语法高亮显示.

source: :ref:`Use threads <doc_using_multiple_threads>` to perform asynchronous actions or make use of multiple processor cores.
cs: :ref:`Použít vlákna <doc_using_multiple_threads>` k provádění asynchronních akcí nebo k využití více jader procesorů.
de: :ref:`Benutze Threads <doc_using_multiple_threads>` um asynchrone Aktionen auszuführen oder um mehrere Prozessor-Cores zu nutzen.
fr: :ref:`Utiliser les threads <doc_using_multiple_threads>` pour effectuer des actions asynchrones ou utiliser plusieurs cœurs de processeur.
pt_br: :ref:`Usa threads <doc_using_multiple_threads>`para executar ações assíncronas ou fazer uso de múltiplos núcleos de processador.
zh_cn: :ref:`Use threads <doc_using_multiple_threads>` 执行异步操作或使用多个处理器内核.

source: Packaged in a separate binary to keep file sizes and dependencies down.
cs: Baleno v samostatném binárním formátu, aby se snížila velikost souborů a počet závislostí.
de: In einer separaten Binärdatei verpackt, um Dateigrößen und Abhängigkeiten gering zu halten.
fr: Emballé dans un binaire séparé pour limiter la taille des fichiers et les dépendances.
pt_br: Empacotado em um binário separado para manter os tamanhos de arquivo e dependências pequeno.
zh_cn: 打包成一个单独的二进制文件, 以保持文件大小和依赖性.

source: Uses Mono 6.x.
cs: Používá Mono 6.x.
de: nutzt Mono 6.x.
fr: Utilise Mono 6.x.
pt_br: Usa Mono 6.x.
zh_cn: 使用Mono 6.x.

source: Full support for the C# 7.0 syntax and features.
cs: Plná podpora syntaxe a funkcí C # 7.0.
de: Vollständige Unterstützung für C# 7.0 Syntax und Features.
fr: Support complet de la syntaxe et des fonctionnalités du C# 7.0.
pt_br: Suporte completo para a sintaxe e funcionalidades do C# 7.0.
zh_cn: 完全支持C#7.0语法和功能.

source: Supports all platforms.
cs: Podporuje všechny platformy.
de: Unterstützt alle Plattformen.
fr: Prend en charge toutes les plates-formes.
pt_br: Suporta todas as plataformas.
zh_cn: 支持所有平台.

source: Using an external editor is recommended to benefit from IDE functionality.
cs: Doporučujeme používat externí editor, abyste mohli využívat funkce IDE.
de: Nutzung eines externen Editors wird empfohlen um von der IDE Funktionalität zu profitieren.
fr: Il est recommandé d'utiliser un éditeur externe pour bénéficier des fonctionnalités d'un IDE.
pt_br: Utilizar um editor externo é recomendado para ter benefícios de funcionalidades de IDE.
zh_cn: 建议使用外部编辑器以从IDE功能中获益.

source: Works best when used for specific purposes (such as level-specific logic) rather than as a language to create entire projects.
cs: Funguje nejlépe, když je použit pro specifické účely (jako je logika specifická pro levely), spíše než jako jazyk pro vytváření celých projektů.
de: Funktioniert am besten, wenn es für bestimmte Zwecke (z.B. Level-spezifische Logik) verwendet wird und nicht als Sprache zum Erstellen ganzer Projekte.
fr: Il fonctionne mieux lorsqu'il est utilisé à des fins spécifiques (comme une logique spécifique à un niveau) plutôt que comme un langage permettant de créer des projets entiers.
pt_br: Funciona melhor quando utilizado para propósitos específicos (como lógica específica por nível) do que como uma linguagem para criar projetos inteiros.
zh_cn: 当用于特定的目的(如特定级别的逻辑)而不是作为一种语言来创建整个项目时, 效果最好.

source: When you need it, link to native libraries for higher performance and third-party integrations.
cs: Pokud to potřebujete pro vyšší výkon integrujte nativní knihovny a hotová řešení třetích stran.
de: Stellen Sie bei Bedarf eine Verknüpfung zu nativen Bibliotheken her, um eine höhere Leistung und eine Integrationen von Drittanbietern zu erzielen.
fr: Lorsque vous en avez besoin, créez un lien vers des bibliothèques natives pour des performances plus élevées et des intégrations tierces.
pt_br: Quando necessário, conecte a bibliotecas nativas para melhor desempenho e integração com terceiros.
zh_cn: 在需要时, 可以链接到本机库以获得更高的性能和第三方集成.

source: For scripting game logic, GDScript or C# are recommended if their performance is suitable.
cs: Pro skriptování herní logiky se doporučuje GDScript nebo C #, pokud na to jejich výkon stačí.
de: Um Spiele-Logik zu skripten wird GDScript oder C# empfohlen, wenn deren Leistung ausreicht.
fr: Pour les scripts de logique de jeu, GDScript ou C # sont recommandés si leurs performances sont appropriées.
pt_br: Para programar a lógica do jogo, GDScript ou C# são recomendados, caso sua performance seja adequada.
zh_cn: 对于脚本游戏逻辑, 如果性能足够, 建议使用 GDScript 或 C#.

source: Official bindings for C and C++.
cs: Oficiální binding pro C a C ++.
de: Offizielle Einbindung für C und C++.
fr: Bindings officielles pour C et C++.
pt_br: Vinculações oficiais para C e C++.
zh_cn: C和C++的官方绑定.

source: Use any build system and language features you wish.
cs: Použijte systém sestavení a jazyk , který vám bude vyhovovat.
de: Nutzen Sie das Bau-System und die Sprachfeatures die Sie möchten.
fr: Utilisez le système de compilation et les fonctionnalités de langage que vous souhaitez.
pt_br: Use qualquer build system e funcionalidades da linguagem que você quiser.
zh_cn: 使用任何你想要的构建系统和语言功能.

source: Maintained D, Kotlin, Python, Nim, and Rust bindings provided by the community.
cs: Komunita poskytuje integraci pro D, Kotlin, Python, Nim a Rust.
de: Unterstützt D, Kotlin, Python, Nim, und Rust Einbindungen entwickelt von der Community.
fr: Support des bindings D, Kotlin, Python, Nim et Rust fournies par la communauté.
pt_br: Vínculos mantidos de D, Kotlin, Python, Nim e Rust fornecidos pela comunidade.
zh_cn: 维护社区提供的 D, Kotlin, Python, Nim 和 Rust 绑定.

source: Audio
cs: Zvuk
pt_br: Áudio
zh_cn: 音频

source: Mono, stereo, 5.1 and 7.1 output.
cs: Mono, stereo, 5.1 a 7.1 výstup.
de: Mono, Stereo, 5.1 und 7.1 Ausgabe.
fr: Mono, stéréo, sortie 5.1 et 7.1.
pt_br: Mono, estéreo, saídas 5.1 e 7.1.
zh_cn: 单声道, 立体声, 5.1和7.1输出.

source: Non-positional and positional playback in 2D and 3D.
cs: Nepoziční a poziční přehrávání ve 2D a 3D.
de: Positionsabhängige und PositionsUNabhängige Wiedergabe in 2D und 3D.
fr: Lecture(playback) non positionnelle et positionnelle en 2D et 3D.
pt_br: Reprodução não-posicional e posicional em 2D e 3D.
zh_cn: 2D和3D的非定位和定位播放.

source: Optional Doppler effect in 2D and 3D.
cs: Volitelný Dopplerův efekt ve 2D a 3D.
de: Optionaler Doppler-Effekt in 2D und 3D.
fr: Effet Doppler optionnel en 2D et 3D.
pt_br: Efeito Doppler opcional em 2D e 3D.
zh_cn: 选择2D或3D的多普勒效应.

source: Support for re-routable :ref:`audio buses <doc_audio_buses>` and effects with dozens of effects included.
cs: Podpora re-routable :ref:`audio bus <doc_audio_buses>` a efekty s tucty efektů v ceně.
de: Unterstützung für Re-Routable :ref:`Audio Busse <doc_audio_buses>` und Effekte.
fr: Support d' :ref:`audio bus <doc_audio_buses>` re-routable et des effets avec des dizaines d'effets inclus.
pt_br: Suporte para :ref:`barramentos de áudio <doc_audio_buses>` redirecionáveis e efeitos com dezenas de efeitos inclusos.
zh_cn: 支持重路由 :ref:`音频总线 <doc_audio_buses>` 以及大量其它效果.

source: Listener3D node to listen from a position different than the camera in 3D.
cs: Uzel Listener3D k poslechu z jiné polohy než kamera ve 3D.
de: Listener3D Node um von einer anderen Position als die Kamera in 3D zu hören.
fr: Nœud Listener3D pour écouter depuis une position différente de celle de la caméra en 3D.
pt_br: Node Listener3D para escutar de uma posição diferente da câmera em 3D.
zh_cn: Listener3D 节点从不同于 3D 摄像机的位置进行侦听.

source: Audio input to record microphones with real-time access using the AudioEffectCapture class.
de: Audioeingang zur Aufnahme von Mikrofonen mit Echtzeitzugriff über die Klasse AudioEffectCapture.
pt_br: Entrada de áudio para gravar microfones com acesso em tempo real usando a classe AudioEffectCapture.
zh_cn: 使用AudioEffectCapture类实时访问记录麦克风的音频输入。

source: MIDI input.
cs: Vstup MIDI.
de: MIDI Eingang.
fr: Entrée MIDI.
pt_br: Entrada MIDI.
zh_cn: MIDI 输入.

source: No support for MIDI output yet.
cs: Zatím žádná podpora pro výstup MIDI.
de: Momentan keine Unterstützung für MIDI Ausgabe.
fr: Pas encore de support pour la sortie MIDI.
pt_br: Sem suporte para saída MIDI por enquanto.
zh_cn: 尚不支持MIDI输出.

source: **APIs used:**
cs: **použité API:**
de: **genutzte APIs:**
fr: **API utilisés :**
pt_br: **APIs utilizadas:**
zh_cn: **使用的 API：**

source: *Linux:* PulseAudio or ALSA.
cs: *Linux:* PulseAudio nebo ALSA.
de: *Linux:* PulseAudio oder ALSA.
fr: *Linux :* PulseAudio ou ALSA.
pt_br: *Linux:* PulseAudio ou ALSA.
zh_cn: *Linux：* PulseAudio 或 ALSA。

source: Import
fr: Importation
pt_br: Importar
zh_cn: 导入

source: Support for :ref:`custom import plugins <doc_import_plugins>`.
cs: Podpora pro :ref:`custom import plugins <doc_import_plugins>`.
de: Unterstützung für :ref:`custom import plugins <doc_import_plugins>`.
fr: Prise en charge de :ref:`plugins d'importation personnalisés <doc_import_plugins>`.
pt_br: Suporte para :ref:`plugins de importação personalizados <doc_import_plugins>`.
zh_cn: 支持 :ref:`自定义导入插件 <doc_import_plugins>`.

source: **Formats:**
cs: **Formáty:**
de: **Formate:**
pt_br: **Formatos:**
zh_cn: **格式：**

source: *Images:* See :ref:`doc_import_images`.
cs: *Obrázky:* Viz: odkaz: `doc_import_images`.
de: *Bilder:* Siehe :ref:`doc_import_images`.
fr: *Images :* Voir :ref:`doc_import_images`.
pt_br: *Imagens:* Veja :ref:`doc_import_images`.
zh_cn: *图片：* 请参阅 :ref:`doc_import_images` 。

source: *Audio:*
cs: *Zvuk:*
pt_br: *Áudio:*
zh_cn: *音频：*

source: WAV with optional IMA-ADPCM compression.
cs: WAV s volitelnou kompresí IMA-ADPCM.
de: WAV mit optionaler IMA-ADPCM Kompression.
fr: WAV avec compression IMA-ADPCM optionnelle.
pt_br: WAV com compressão IMA-ADPCM opcional.
zh_cn: WAV，可选 IMA-ADPCM 压缩。

source: *3D scenes:*
cs: *3D scény:*
de: *3D Szenen:*
fr: *Scènes 3D :*
pt_br: *Cenas 3D:*
zh_cn: *3D 场景：*

source: glTF 2.0 *(recommended)*.
cs: glTF 2,0 *(doporučeno)*.
de: glTF 2.0 *(empfohlen)*.
fr: glTF 2.0 *(recommandé)*.
pt_br: glTF 2.0 *(recomendado)*.
zh_cn: glTF 2.0 *（推荐）* 。

source: `ESCN <https://github.com/godotengine/godot-blender-exporter>`__ (direct export from Blender).
cs: `ESCN <https://github.com/godotengine/godot-blender-exporter >`__ (přímý export z Blenderu).
de: `ESCN <https://github.com/godotengine/godot-blender-exporter>`__ (Direkter Export von Blender).
fr: `ESCN <https://github.com/godotengine/godot-blender-exporter>`__ (exportation directe à partir de Blender).
pt_br: `ESCN <https://github.com/godotengine/godot-blender-exporter>`__ (exportação direta do Blender).
zh_cn: `ESCN <https://github.com/godotengine/godot-blender-exporter>`__ （直接从 Blender 导出）。

source: FBX (experimental).
cs: FBX (experimentální).
de: FBX (experimentel).
fr: FBX (expérimental).
zh_cn: FBX（实验性）。

source: Wavefront OBJ (static scenes only, can be loaded directly as a mesh).
cs: Wavefront OBJ (pouze statické scény, lze načíst přímo jako síť).
de: Wavefront OBJ (nur statische Szenen, kann direkt als Mesh geladen werden).
fr: Wavefront OBJ (scènes statiques uniquement, peut être chargé directement sous forme de maillage).
pt_br: Wavefront OBJ (apenas cenas estáticas, pode ser carregado diretamente como uma malha).
zh_cn: Wavefront OBJ（仅静态场景，可直接被加载为网格）。

source: Input
cs: Vstup
de: Eingang
fr: Entrée
pt_br: Entrada
zh_cn: 输入

source: Input mapping system using hardcoded input events or remappable input actions.
cs: Systém mapování vstupů využívající pevně zakódované vstupní události nebo namapované vstupní akce.
de: Eingabe-Zuordnungs-System nutzt fest codierte Eingabeereignisse oder neu zuweisbare Eingabeaktionen.
fr: Système de cartographie des entrées utilisant des événements d'entrée codés en dur ou des actions d'entrée remappables.
pt_br: Sistema de mapeamento de entrada usando eventos de entrada codificados ou ações de entrada remapeáveis.
zh_cn: 该输入映射系统使用硬编码的输入事件, 也可以使用可重定向的输入动作.

source: Axis values can be mapped to two different actions with a configurable deadzone.
cs: Hodnoty os lze mapovat na dvě různé akce pomocí konfigurovatelného mrtvého pásma.
de: Achsenwerte können zwei verschiedenen Aktionen zugeordnet werden mit einer konfigurierbaren Totzone.
fr: Les valeurs des axes peuvent être associées à deux actions différentes avec une zone morte configurable.
pt_br: Valores de eixo podem ser mapeados em duas ações diferentes com uma zona morta configurável.
zh_cn: 坐标轴参数可以映射到两个不同的操作上, 这些操作可以配置死区.

source: Use the same code to support both keyboards and gamepads.
cs: Použijte stejný kód pro podporu klávesnice i gamepadů.
de: Nutze den gleichen Code um Tastatur und Gamepad zu unterstützen.
fr: Utilise le même code pour prendre en charge les claviers et les gamepads.
pt_br: Usar o mesmo código para dar suporte à teclados e gamepads.
zh_cn: 使用相同的代码支持键盘和手柄操作.

source: Keyboard input.
cs: Vstup z klávesnice.
de: Tastatureingaben.
fr: Entrée clavier.
pt_br: Entrada de Teclado.
zh_cn: 键盘输入.

source: Keys can be mapped in "physical" mode to be independent of the keyboard layout.
cs: Klávesy lze mapovat ve „fyzickém“ režimu tak, aby byly nezávislé na rozložení klávesnice.
de: Tasten können im "physischen" Modus unabhängig vom Tastaturlayout zugeordnet werden.
fr: Les touches peuvent être mappées en mode "physique" pour être indépendantes de la disposition du clavier.
pt_br: Teclas podem ser mapeadas em modo "físico" para serem independentes do layout do teclado.
zh_cn: 按键可以被映射到 "物理" 模式, 该模式下按键行为和键盘布局无关.

source: Mouse input.
cs: Vstup myši.
de: Mauseingaben.
fr: Entrée souris.
pt_br: Entrada de Mouse.
zh_cn: 鼠标输入.

source: The mouse cursor can be visible, hidden, captured or confined within the window.
cs: Kurzor myši může být viditelný, skrytý, zachycený nebo uzavřený v okně.
de: Der Mauszeiger kann sichtbar, ausgeblendet, erfasst oder auf das Fenster begrenzt sein.
fr: Le curseur de la souris peut être visible, caché, capturé ou confiné dans la fenêtre.
pt_br: O cursor do mouse pode ser visível, escondido, capturado ou confinado dentro da janela.
zh_cn: 鼠标箭头可以配置为可见, 隐藏, 捕获, 或者限制在窗口范围内.

source: When captured, raw input will be used on Windows and Linux to sidestep the OS' mouse acceleration settings.
cs: Při zachycení bude nezpracovaný vstup použit v systémech Windows a Linux, aby se vyhnul nastavení akcelerace myši operačního systému.
de: Bei der Erfassung werden Rohdaten unter Windows und Linux verwendet, um die Einstellungen der Maus des Betriebssystems zu umgehen.
fr: Lorsque capturées, les données brutes seront utilisées sous Windows et Linux pour contourner les paramètres d'accélération de la souris du système d'exploitation.
pt_br: Quando capturada, a entrada bruta será usada no Windows e no Linux para contornar as configurações de aceleração do mouse do sistema operacional.
zh_cn: 当捕获了鼠标的原始输入时, 将会绕过windows或者linux操作系统的鼠标加速设置.

source: Gamepad input (up to 8 simultaneous controllers).
cs: Vstup pro gamepad (až 8 současně připojených ovladačů).
de: Gamepad Eingabe (bis zu 8 Controller gleichzeitig).
fr: Entrée manette (jusqu'à 8 contrôleurs en simultané).
pt_br: Entrada por gamepad (até 8 controles simultâneos).
zh_cn: 手柄输入(最多同时支持8个控制器).

source: Pen/tablet input with pressure support.
cs: Vstup pera / tabletu s tlakovou podporou.
de: Stift/Tablet Eingabe mit Erkennung des Anpressdrucks.
fr: Saisie au stylet/tablette avec support de la pression.
pt_br: Entrada de caneta/tablet com suporte a pressão.
zh_cn: 支持带压感的绘图笔和平板输入.

source: Gamepad, keyboard and mouse input support are also available on Android.
de: Gamepad-, Tastatur- und Mauseingabeunterstützung sind auch auf Android verfügbar.
pt_br: Suporte para entrada de gamepad, teclado e mouse também estão disponíveis no Android.
zh_cn: 安卓系统也支持游戏手柄、键盘和鼠标输入。

source: Navigation
cs: Navigace
pt_br: Navegação
zh_cn: 导航

source: A* algorithm in 2D and 3D.
cs: A* algoritmus ve 2D a 3D.
de: Ein* Algorithmus in 2D und 3D.
fr: Algorithme A* en 2D et 3D.
pt_br: Algoritmo A* em 2D e 3D.
zh_cn: 2D和3D A星算法.

source: Navigation meshes.
cs: Navigační sítě.
de: Navigations-Meshes.
fr: Maillages de Navigation.
pt_br: Malhas de Navegação.
zh_cn: 导航网格.

source: Support for dynamic obstacle avoidance planned in Godot 4.0.
cs: V Godot 4.0 je plánována podpora dynamického vyhýbání se překážkám.
de: Unterstützung für die dynamische Vermeidung von Hindernissen ist in Godot 4.0 geplant.
fr: Support de l'évitement dynamique des obstacles prévu dans Godot 4.0.
pt_br: Suporte para evasão de obstáculos dinâmica planejada para o Godot 4.0.
zh_cn: Godot4.0 支持动态障碍物躲避规划.

source: Generate navigation meshes from the editor.
cs: Generování navigačních sítí z editoru.
de: Generieren Sie ein Navigations-Mesh aus dem Editor.
fr: Générer des maillages de navigation à partir de l'éditeur.
pt_br: Gerar malhas de navegação pelo editor.
zh_cn: 编辑器内生成导航网格.

source: Networking
cs: Sítě
de: Netzwerke
fr: Réseau
pt_br: Trabalho em rede
zh_cn: 网络

source: Low-level TCP networking using StreamPeer and TCP_Server.
cs: Nízkoúrovňové sítě TCP pomocí StreamPeer a TCP_Server.
de: Low-Level TCP Netzwerk mittels StreamPeer und TCP Server.
fr: Réseau TCP de bas niveau utilisant StreamPeer et TCP_Server.
pt_br: Networking TCP de baixo nível usando StreamPeer e TCP_Server.
zh_cn: 使用StreamPeer和TCP_Server开发底层TCP网络通信.

source: Low-level UDP networking using PacketPeer and UDPServer.
cs: Nízkoúrovňové sítě UDP pomocí PacketPeer a UDPServer.
de: Low-Level UDP Netzwek mittels PacketPeer und UDP Server.
fr: Réseau UDP de bas niveau utilisant PacketPeer et UDPServer.
pt_br: Networking UDP de baixo nível usando PacketPeer e UDPServer.
zh_cn: 使用PacketPeer和UDPServer 开发底层UDP网络通信.

source: Low-level HTTP requests using HTTPClient.
cs: Požadavky HTTP nízké úrovně pomocí HTTPClient.
de: Low-Level HTTP Anfragen mittels HTTPClient.
fr: Requêtes HTTP de bas niveau utilisant HTTPClient.
pt_br: Requisições HTTP de baixo nível utilizando HTTPClient.
zh_cn: 使用HTTPClient开发底层HTTP请求.

source: High-level HTTP requests using HTTPRequest.
cs: Požadavky HTTP vysoké úrovně pomocí HTTPRequest.
de: High-Level HTTP Anfragen mittels HTTPRequest.
fr: Requêtes HTTP de haut niveau utilisant HTTPRequest.
pt_br: Requisições HTTP de alto nível utilizando HTTPRequest.
zh_cn: 使用HTTPRequest 开发上层HTTP请求.

source: Supports HTTPS out of the box using bundled certificates.
cs: Podporuje HTTPS nativně pomocí přiložených certifikátů.
de: Unterstützt standardmäßig HTTPS mittels gebündelter Zertifikate.
fr: Support HTTPS utilisant des certificats groupés.
pt_br: Suporta HTTPS pronto para uso usando certificados inclusos.
zh_cn: 使用打包的证书相关工具, 支持开箱即用的HTTPS功能.

source: High-level multiplayer API using UDP and ENet.
cs: High-level multiplayer API pomocí UDP a ENet.
de: High-Level Mehrspieler API mittels UDP und ENet.
fr: API multijoueur de haut niveau utilisant UDP et ENet.
pt_br: API multijogador de alto nível utilizando UDP e ENet.
zh_cn: 使用UDP和ENet的高级联机API.
