Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/release_policy.po
Languages: cs, de, ru

source: Godot release policy
cs: Zásady uvolňování Godota
de: Godot Veröffentlichungs-Richtlinie
ru: Политика релизов Godot

source: Godot's release policy is in constant evolution. What is described below is intended to give a general idea of what to expect, but what will actually happen depends on the choices of core contributors, and the needs of the community at a given time.
de: Die Release Richtlinie von Godot ist in konstanter Entwicklung. Die unten beschriebenen Punkte geben eine generelle Vorstellung davon, was zu erwarten ist, aber was tatsächlich passieren wird hängt von den Entscheidungen der Haupt-Beitragenden und den momentanen Bedürfnissen der Community ab.
ru: Политика выпуска Godot находится в постоянном развитии. То, что описано ниже, предназначено для того, чтобы дать общее представление о том, чего ожидать, но то, что на самом деле произойдет, зависит от выбора основных участников и потребностей сообщества в данный момент.

source: Godot versioning
cs: Godot verze
de: Godot Versionsangabe
ru: Информация о версии

source: Godot loosely follows `Semantic Versioning <https://semver.org/>`__ with a ``major.minor.patch`` versioning system, albeit with an interpretation of each term adapted to the complexity of a game engine:
de: Godot befolgt verlustlos das `Semantic Versioning <https://semver.org/>`__ with a ``major.minor.patch`` Versionssystem, wenn auch mit einer Interpretation jedes Begriffs angepasst an die Komplexität der Game Engine:
ru: Godot вольно следует за `Semantic Versioning <https://semver.org/>` __ с системой управления версиями ``основная.дополнительная.патч ``, хотя и с интерпретацией каждого термина, адаптированной к сложности игрового движка:

source: The ``major`` version is incremented when major compatibility breakages happen which imply significant porting work to move projects from one major version to another.
de: Die ``major``-Version wird erhöht, wenn wesentliche Brüche in der Kompatibilität stattfinden, welche signifikanten Aufwand beim Portieren von Projekten einer major-Version zu einer anderen bedeuten.
ru: ``Основная`` версия увеличивается, когда происходят серьезные нарушения совместимости, которые подразумевают значительную работу по переносу для перемещения проектов из одной основной версии в другую.

source: For example, porting Godot projects from Godot 2.1 to Godot 3.0 required running the project through a conversion tool, and then performing a number of further adjustments manually for what the tool could not do automatically.
de: Zum Beispiel erforderte das Portieren von Godot Projekten von Godot 2.1 nach Godot 3.0 die Ausführung des Projekts mithilfe eines Konversionstools, und dann die Durchführung einer Anzahl von weiteren manuellen Anpassungen, was das Werkzeug nicht automatisch erledigen konnte.
ru: Например, для переноса проектов Godot с Godot 2.1 на Godot 3.0 требовалось запустить проект с помощью инструмента преобразования, а затем вручную выполнить ряд дополнительных настроек, которые инструмент не мог сделать автоматически.

source: The ``minor`` version is incremented for feature releases which do not break compatibility in a major way. Minor compatibility breakage in very specific areas *may* happen in minor versions, but the vast majority of projects should not be affected or require significant porting work.
de: Die ``minor`` Version wird bei jeder funktionellen Veröffentlichung erhöht, die nicht Kompatibilität in größerem Maße bricht. Geringfügiger Kompatibilitätsbruch in sehr speziellen Bereichen *kann* in Minor-Versionen vorkommen, aber die große Mehrheit an Projekten sollte nicht betroffen sein oder umfangreiche Portierungsarbeiten erfordern.
ru: ``Дополнительная`` версия увеличивается для выпусков функций, которые не нарушают совместимость в значительной степени. Незначительное нарушение совместимости в очень специфических областях *может* произойти в дополнительных версиях, но подавляющее большинство проектов не должно быть затронуто или требовать значительной работы по переносу.

source: The reason for this is that as a game engine, Godot covers many areas such as rendering, physics, scripting, etc., and fixing bugs or implementing new features in a given area may sometimes require changing the behavior of a feature, or modifying the interface of a given class, even if the rest of the engine API remains backwards compatible.
de: Der Grund dafür ist, dass Godot als eine Game Engine viele Bereiche wie Rendering, Physik, Skripting, etc. abdeckt, und das Beheben von Fehlern oder Implementieren von neuen Funktionen in einem gegebenen Bereich manchmal das Ändern des Verhalten in der Zukunft erfordert, oder Ändern des der Schnittstelle einer gegebenen Klasse, selbst wenn der Rest der Engine API abwärtkompatibel bleibt.
ru: Причина этого в том, как игровой движок Godot охватывает многие области, такие как рендеринг, физика, написание сценариев и т. д., и для исправления ошибок или внедрения новых функций в определенной области иногда может потребоваться изменение поведения функции или изменение интерфейса заданного класса, даже если остальная часть API движка остается обратно совместимой.

source: Upgrading to a new minor version is therefore recommended for all users, but some testing is necessary to ensure that your project still behaves as expected in a new minor version.
de: Aktualisierungen auf eine neue Version sind dementsprechend empfohlen für alle Nutzer, aber etwas Testen is nötig, um sicherzustellen, dass sich das Projekt in einer neuen minor Version immer noch wie erwartet verhält.
ru: Поэтому обновление до новой дополнительной версии рекомендуется для всех пользователей, но необходимо некоторое тестирование, чтобы убедиться, что ваш проект по-прежнему ведет себя так, как ожидалось в новой дополнительной версии.

source: The ``patch`` version is incremented for maintenance releases which focus on fixing bugs and security issues, implementing new requirements for platform support, and backporting safe usability enhancements. Patch releases are backwards compatible.
de: Die ``patch`` Version wird für Wartungsversionen erhöht, die den Schwerpunkt auf das Beheben von Fehlern und Sicherheitsproblemen, Einführen von neuen Vorraussetzungen für Plattformunterstützung und Zurückportieren von Verbesserungen der Benutzbarkeit legt. Patch-Versionen sind rückwärtskompatibel.
ru: Версия ``исправление`` увеличивается для выпусков обслуживания, которые сосредоточены на исправлении ошибок и проблем безопасности, реализации новых требований для поддержки платформы и резервном копировании улучшений для безопасного использования. Релизы исправлений обратно совместимы.

source: Patch versions may include minor new features which do not impact the existing API, and thus have no risk of impacting existing projects.
de: Patch-Versionen könnten geringfügige neue Funktionen enthalten, welche nicht die existierende API beeinflussen, und dementsprechend kein Risiko einer Auswirkung auf existierende Projekte haben.
ru: Версии исправлений могут включать незначительные новые функции, которые не влияют на существующий API и, следовательно, не имеют риска повлиять на существующие проекты.

source: Updating to new patch versions is therefore considered safe and strongly recommended to all users of a given stable branch.
de: Das Aktualisieren auf eine neue Patch-Version wird dementsprechend als sicher betrachtet und ausdrücklich emphohlen für alle Nutzer eines gegebenen stabilen Zweigs.
ru: Поэтому обновление до новых версий исправлений считается безопасным и настоятельно рекомендуется всем пользователям данной стабильной ветви.

source: We call ``major.minor`` combinations *stable branches*. Each stable branch starts with a ``major.minor`` release (without the ``0`` for ``patch``) and is further developed for maintenance releases in a Git branch of the same name (for example patch updates for the 3.3 stable branch are developed in the ``3.3`` Git branch).
de: Wir nennen ``major.minor``Kombinationen *stabile Zweige*. Jeder stabile Zweig fängt mit einer ``major.minor``Veröffentlichung an (ohne die ``0`` für ``patch``) und wird für Wartungsversionen in einem Git Zweig unter dem selben Namen weiterentwickelt (zum Beispiel werden Patch-Updates für den 3.3 stabilen Zweig im ``3.3``Git Zweig entwickelt).
ru: Мы называем комбинации ``основная.второстепенная`` *стабильными ветвями*. Каждая стабильная ветвь начинается с ``основного.второстепенного`` выпуска (без ``0`` для ``исправлений``) и дорабатывается для отладочных выпусков в одноименной ветви Git (например, обновления исправлений для стабильной ветки 3.3 разрабатываются в Git ветви ``3.3``).

source: As mentioned in the introduction, Godot's release policy is evolving, and earlier Godot releases may not have followed the above rules to the letter. In particular, the 3.2 stable branch received a number of new features in 3.2.2 which would have warranted a ``minor`` version increment.
de: Wie in der Einführung erwähnt entwickelt sich Godots Veröffentlichungsrichtlinie weiter, and frühere Godot Veröffentlichungen haben möglicherweise nicht die oberen Regeln buchstabengetreu befolgt. Insbesondere der stabile 3.2 Zweig hat eine Anzahl von neuen Funktionen in 3.2.2 erhalten, welche eine ``minor``Versionserhöhung gerechtfertigt hätten.
ru: Как упоминалось во введении, политика выпуска Godot постоянно развивается, и более ранние выпуски Godot, возможно, не следовали вышеуказанным правилам в точности. В частности, стабильная ветвь 3.2 получила ряд новых функций в 3.2.2, которые требовали бы увеличения ``дополнительной`` версии.

source: Release support timeline
cs: Podpora jednotlivých vydání
de: Versionsunterstützungs Zeiten
ru: Сроки поддержки релиза

source: Stable branches are supported *at minimum* until the next stable branch is released and has received its first patch update. In practice, we support stable branches on a *best effort* basis for as long as they have active users who need maintenance updates.
de: Stabile Zweige werden *mindestens* bis zur Veröffentlichung des nächsten stabilen Zweiges mit dem ersten Patch-Update unterstützt. In der Praxis unterstützen wir stabile Zweige auf einer Basis *besten Aufwands* für solange wie sie aktive Nutzer haben, die Wartungs-Updates benötigen.
ru: Стабильные ветви поддерживаются *как минимум* до тех пор, пока не будет выпущена следующая стабильная ветвь и не будет получено первое обновление с исправлениями. На практике мы поддерживаем стабильные ветви на основе *наилучших усилий* до тех пор, пока у них есть активные пользователи, которым нужны обновления обслуживания.

source: **Version**
cs: **Verze**
ru: **Версия**

source: **Release date**
cs: **Datum vydání**
de: **Erscheinungsdatum**
ru: **Дата выпуска**

source: **Support level**
cs: **Úroveň podpory**
de: **Unterstützungsniveau**
ru: **Уровень поддержки**

source: ~2022 (see below)
ru: ~2022 г. (см. ниже)

source: |unstable| *Current focus of development (unstable).*
cs: |unstable| *Aktuální zaměření vývoje (nestabilní).*
de: |unstable| *Momentaner Schwerpunkt der Entwicklung (instabil).*
ru: |unstable| *Текущий фокус развития (нестабильный).*

source: |supported| *Beta.* Receives new features as well as bug fixes while under development.
de: |unterstützt| *Beta.* Erhält neue Funktionen sowie Fehlerkorrekturen während der Entwicklung.
ru: |поддерживается| *Бета.* Получает новые функции и исправления ошибок в процессе разработки.

source: Godot 3.3
ru: Godot 3.2

source: April 2021
ru: Апрель 2021

source: |supported| Receives fixes for bugs, security and platform support issues, as well as backwards-compatible usability enhancements.
de: |supported| Erhält Fehler-, Sicherheits- und Plattformunterstützungsbehebungen sowie rückwärtskompatible Verbesserungen der Benutzerfreundlichkeit.
ru: |поддерживается| Получает исправления ошибок, вопросов безопасности и поддержки платформ, а также улучшения удобства использования с обратной совместимостью.

source: Godot 3.2
ru: В Godot 3.2

source: January 2020
cs: Leden 2020
de: Januar 2020
ru: Январь 2020

source: |eol| No longer supported as fully superseded by the compatible 3.3 release (last update: 3.2.3).
de: |eol| Wird nicht mehr unterstützt, da vollständig durch die kompatible Version 3.3 ersetzt (letztes Update: 3.2.3).
ru: |eol| Больше не поддерживается как полностью замененный совместимым релизом 3.3(последнее обновление:3.2.3).

source: Godot 3.1
ru: В Godot 3.1

source: March 2019
cs: Březen 2019
de: März 2019
ru: Март 2019

source: January 2018
cs: Leden 2018
de: Januar 2018
ru: Январь 2018

source: |eol| No longer supported (last update: 3.0.6).
de: |eol| Nicht mehr unterstützt (letztes Update: 3.0.6).
ru: |eol| Больше не поддерживается (последнее обновление: 3.0.6).

source: Godot 2.1
ru: Godot 3.1

source: July 2016
cs: Červenec 2016
de: Juli 2016
ru: Июль 2016

source: February 2016
cs: Únor 2016
de: Februar 2016
ru: Февраль 2016

source: |eol| No longer supported (last update: 2.0.4.1).
de: |eol| Nicht mehr unterstützt (letztes Update: 2.0.4.1).
ru: |eol| Больше не поддерживается (Последнее обновление: 2.0.4.1).

source: May 2015
cs: Květen 2015
de: Mai 2015
ru: Май 2015

source: |eol| No longer supported.
cs: |eol| Již není podporována.
de: |eol| Nicht mehr unterstützt.
ru: |eol| Больше не поддерживается.

source: December 2014
cs: Prosinec 2014
de: Dezember 2014
ru: Декабрь 2014

source: **Legend:** |supported| Full support – |partial| Partial support – |eol| No support (end of life) – |unstable| Development version
de: **Legende:** |supported| Volle Unterstützung - |partial| Teilweise Unterstützung - |eol| Keine Unterstützung (Ende der Lebensdauer) - |unstable| Entwicklungsversion
ru: **Легенда:** |supported| Полная поддержка - |partial| Частичная поддержка - |eol| Не поддерживается (завершено) - |unstable| Разрабатываемая версия

source: Pre-release Godot versions aren't intended to be used in production and are provided for testing purposes only.
de: Vorabversionen von Godot sind nicht dazu gedacht in der Produktion eingesetzt zu werden und werden nur zum Testen zur Verfügung gestellt.
ru: Предварительные версии Godot не предназначены для использования в производстве и предоставляются с только для тестирования.

source: When is the next release out?
cs: Kdy vyjde další verze?
de: Wann erscheint die nächste Godot-Version?
ru: Когда следующий релиз?

source: While Godot contributors aren't working under any deadlines, we have historically had one major or minor release per year, with several maintenance updates between each.
de: Obwohl Mitwirkende des Godot-Projekts keine Terminfristen haben, gab es in der Vergangenheit für gewöhnlich jedes Jahr eine neue größere oder kleinere Veröffentlichung und einige Wartungsupdates dazwischen.
ru: Несмотря на то, что участники Godot не работают по установленным срокам, исторически выпускается большой или маленький релиз Godot каждый год, с несколькими обслуживающими обновлениями между ними.

source: Starting with Godot 3.3, we aim to accelerate our development cycles for minor releases, so you can expect a new minor release every 3 to 6 months.
de: Beginnend mit Godot 3.3 wollen wir unsere Entwicklungszyklen für kleinere Veröffentlichungen beschleunigen, sodass alle drei bis sechs Monate eine neue Nebenversion erwartet werden kann.
ru: Начиная с Godot 3.3, мы стремимся ускорить наши циклы разработки второстепенных выпусков, поэтому вы можете ожидать выпуск нового второстепенного выпуска каждые 3–6 месяцев.

source: Maintenance (patch) releases will be released as needed with potentially very short development cycles, to provide users of the current stable branch with the latest bug fixes for their production needs.
de: Wartungsupdates werden veröffentlicht, wenn sie gebraucht werden und können sehr kurze Entwicklungszyklen haben, um Benutzer des derzeitigen stabilen Zweigs mit den neuesten Fehlerbehebungen zu versorgen.
ru: Сопровождающие (исправления) релизы будут выпускаться по мере необходимости с потенциально очень короткими циклами разработки, чтобы предоставить пользователям текущей стабильной ветки последние исправления ошибок для их производственных нужд.

source: As for the upcoming Godot 4.0, we can only say that we aim for a **2022** release, but any closer estimate is likely to be hard to uphold. Alpha builds will be published as soon as the main features for Godot 4.0 are finalized.
ru: Что касается грядущей Godot 4.0, мы можем только сказать, что мы стремимся к выпуску **2022**, но более точной оценки, вероятно, будет трудно придерживаться. Альфа-версии будут опубликованы, как только будут завершены основные функции Godot 4.0.

source: Whenever a new major version is released, we make the previous stable branch a long-term supported release, and do our best to provide fixes for issues encountered by users of that branch who cannot port complex projects to the new major version. This is the case for the 2.1 branch, and will be the case for the latest 3.x stable branch by the time Godot 4.0 is released.
de: Sobald eine neue Hauptversion veröffentlicht ist, machen wir den vorherigen stabilen Zweig zur langfristig unterstützten Veröffentlichung, und tun unser Bestes, um Behebungen für Fehler, die von Nutzern dieses Zweiges festgestellt wurden, welche komplexe Projekte nicht auf die neue Hauptversion aktualisieren können, bereitzustellen.

source: ~2021 (see below)
cs: ~ 2021 (viz níže)
de: ~2021 (siehe unten)

source: Q2 or Q3 2021
de: Q2 oder Q3 2021

source: |partial| Only critical, security and platform support fixes (last update: 3.1.2).
de: |partial| Nur Behebung kritischer Fehler und Verbesserung der Sicherheit und Plattformunterstützung (letztes Update: 3.1.2).

source: |partial| Only critical, security and platform support fixes (last update: 2.1.6).
de: |partial| Nur Behebung kritischer Fehler und Verbesserung der Sicherheit und Plattformunterstützung (letztes Update: 2.1.6).

source: As for the upcoming Godot 4.0, we can only say that we aim for a **2021** release, but any closer estimate is likely to be hard to uphold. Alpha builds will be published as soon as the main features for Godot 4.0 are finalized.
de: Zum kommenden Godot 4.0 können wir nur sagen, dass wir auf eine Veröffentlichung in **2021** abzielen, genauere Schätzungen wären vermutlich schwer einzuhalten. Alpha-Builds werden veröffentlicht, sobald die Hauptfeatures von Godot 4.0 fertiggestellt sind.

source: Godot uses ``major.minor.patch`` version numbering. However, it does not strictly follow `Semantic Versioning <https://semver.org/>`__. This means that releases considered "semver-minor" by that standard (such as 3.1 -> 3.2) will most likely introduce breaking changes. Still, there won't be as many breaking changes as a "semver-major" version bump such as 3.2 -> 4.0.
cs: Godot používá ``major.minor.patch`` číslování verzí. Neřídí se však striktně podle `Sémantického verzování <https://semver.org/ >`__. To znamená, že vydání, která jsou podle této normy považována za "semver-minor" (například 3.1 -> 3.2), s největší pravděpodobností přinesou zlomové změny. Stále však nedojde k tolika zlomovým změnám jako u verze „semver-major“, jako je 3.2 -> 4.0.

source: In the interest of stability and usability, patch releases may occasionally introduce small breaking changes as well. When repackaging Godot projects (e.g. in a Flatpak), make sure to always use the same patch version as the one used to initially export the project.
cs: V zájmu stability a použitelnosti mohou uvolněné patche občas zavést i menší zlomové změny. Při přebalování projektů Godotu (např. ve flatpaku) se vždy ujistěte, že používáte stejnou verzi patche, jaká byla použita při původním exportu projektu.

source: The first release in a major/minor release series doesn't end with a trailing zero. For example, the first release in the 3.2 series is ``3.2``, not ``3.2.0``.
cs: První vydání v řadě hlavních / vedlejších vydání nekončí koncovou nulou. Například první verze v řadě 3.2 je ``3.2``, nikoli ``3.2.0``.

source: Godot versions are supported for a certain amount of time. While these durations are not set in stone, here's a table with the expected level of support for each Godot version:
cs: Verze Godota jsou podporovány jen po určitou dobu. I když tyto doby trvání nejsou tesány do kamene, zde je tabulka s očekávanou úrovní podpory pro každou verzi Godot:

source: |supported| Backwards-compatible new features (backported from the ``master`` branch) as well as bug, security, and platform support fixes.
cs: |supported| Zpětně kompatibilní nové funkce (backportované z větve „master“) a opravy chyb, zabezpečení a podpory platforem.

source: |partial| Only critical, security and platform support fixes.
cs: |partial| Pouze kritické, bezpečnostní opravy a podpora platformy.

source: **Legend:** |supported| Full support - |partial| Partial support - |eol| No support (end of life) - |unstable| Development version
cs: **Legenda:** |supported| Plná podpora - |partial| Částečná podpora - |eol| Žádná podpora (konec životnosti) - |unstable| Vývojová verze

source: Pre-release Godot versions aren't intended to be used in production and are provided on a best-effort basis.
cs: Vývojové verze Godota nejsou určeny k použití v produkčním prostředí a jsou poskytovány s vynaložením maximálního možného úsilí.

source: While Godot contributors aren't working under any deadlines, there's usually a major or minor Godot release made available every year. Following this trend, this means Godot 4.0 will most likely be released in **2021**.
cs: Přestože vývojáři Godota nefungují v žádných termínech, obvykle je každoročně k dispozici hlavní nebo menší vydání Godota.Podle tohoto trendu to znamená, že Godot 4.0 bude s největší pravděpodobností vydán v **2021**.

source: Patch releases are made available more frequently, typically every 2-6 months while a release is fully supported. Partially supported releases will only have new patch releases once an important security or platform support fix has been merged.
cs: Vydávání oprav je k dispozici častěji, obvykle každé 2-6 měsíce, pro plně podporovanou verzi. Částečně podporované verze budou mít nová vydání oprav pouze po sloučení důležité opravy zabezpečení nebo podpory platformy.

source: The `roadmap <https://github.com/godotengine/godot-roadmap>`__ repository documents features that have been agreed upon and may be implemented in future Godot releases.
cs: `Road mapa <https://github.com/godotengine/godot-roadmap >`__ úložiště dokumentuje funkce, které již byly dohodnuty a mohou být implementovány v budoucích vydáních Godot.
