Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/about/troubleshooting.po
Languages: ko, pt_br, uk

source: Troubleshooting
ko: 문제해결
pt_br: Solução de problemas
uk: Вирішення проблем

source: This page lists common issues encountered when using Godot and possible solutions.
ko: 이 페이지에는 Godot 및 가능한 솔루션을 사용할 때 발생하는 일반적인 문제가 나열됩니다.
pt_br: Esta página lista problemas comuns ao usar a Godot e possíveis soluções.
uk: На цій сторінці перелічено найпоширеніші проблеми, що виникають при використанні Godot, та можливі способи їх вирішення.

source: See :ref:`doc_using_the_web_editor` for caveats specific to the HTML5 version of the Godot editor.
ko: Godot 편집기의 HTML5 버전과 관련된 주의 사항은 :ref:'doc_using_the_web_editor` 참조하세요.

source: Everything I do in the editor or project manager appears delayed by one frame.
ko: 에디터 나 프로젝트 매니저에서하는 모든 작업이 한 프레임 지연된 것처럼 보입니다.
pt_br: Tudo que eu faço no editor ou no gerenciador de projeto aparece atrasado em um frame.
uk: Все, що я роблю в редакторі, або менеджері проектів, підвисає на один кадр.

source: This is a `known bug <https://github.com/godotengine/godot/issues/23069>`__ on Intel graphics drivers on Windows. Updating to the latest graphics driver version *provided by Intel* should fix the issue.
ko: 이것은 Windows에서 Intel 그래픽 드라이버의 `알려진 버그 <https://github.com/godotengine/godot/issues/23069>`__ 입니다. *인텔에서 제공하는* 최신 그래픽 드라이버 버전으로 업데이트하면 문제가 해결됩니다.
pt_br: Esse é um bug conhecido <https://github.com/godotengine/godot/issues/23069>`__ em drivers gráficos da Intel no Windows. Atualizar os drivers para sua última versão *providenciada pela intel* deve resolver o problema.
uk: Це `відома помилка <https://github.com/godotengine/godot/issues/23069>`__ на графічних драйверах Intel під Windows. Оновлення графічного драйвера *наданого Intel* до останньої версії має вирішити проблему.

source: You should use the graphics driver provided by Intel rather than the one provided by your desktop or laptop's manufacturer because their version is often outdated.
ko: 데스크탑 또는 랩톱 제조업체에서 제공하는 그래픽 드라이버가 아닌 인텔에서 제공하는 그래픽 드라이버를 사용해야합니다. 해당 버전이 종종 오래 되었기 때문입니다.
pt_br: Você deve usar os drivers gráficos providenciados pela Intel ao invés do entregue pela fabricante do seu desktop ou laptop porque muitas das vezes este está desatualizado.
uk: Вам варто використовувати графічний драйвер, що надається компанією Intel, а не той, який надає виробник комп'ютера, чи ноутбука, оскільки їх версія часто застаріла.

source: The grid disappears and meshes turn black when I rotate the 3D camera in the editor.
ko: 에디터에서 3D 카메라를 회전하면 그리드가 사라지고 메시가 검게 변합니다.
pt_br: A grade deasparece e as malhas ficam pretas quando eu rotaciono a câmera 3D no editor.

source: This is a `known bug <https://github.com/godotengine/godot/issues/30330>`__ on Intel graphics drivers on Windows.
ko: 이것은 Windows에서 Intel 그래픽 드라이버의`알려진 버그 <https://github.com/godotengine/godot/issues/30330>`__ 입니다.
pt_br: Este é um `bug conhecido <https://github.com/godotengine/godot/issues/30330>`__ em drivers gráficos da Intel no Windows.
uk: Це `відома помилка <https://github.com/godotengine/godot/issues/30330>`__ графічних драйверів Intel під Windows.

source: The only workaround, for now, is to switch to the GLES2 renderer. You can switch the renderer in the top-right corner of the editor or the Project Settings.
ko: 현재로서는 GLES2 렌더러로 전환하는 것이 유일한 해결 방법입니다. 편집기 또는 프로젝트 설정의 오른쪽 상단 모서리에 있는 렌더러를 전환할 수 있습니다.
pt_br: A única forma de contornar isto,por agora,é mudar para o renderizador GLES2.Você pode mudar o renderizador no canto superior-direito do editor ou nas Configurações do Projeto.
uk: На даний момент єдиним обхідним шляхом є перехід на візуалізатор (рендер) GLES2. Ви можете змінити його у верхньому правому куті редактора, або в Налаштуваннях проекту.

source: If you use a computer allowing you to switch your graphics card, like NVIDIA Optimus, you can use the dedicated graphics card to run Godot.
ko: NVIDIA Optimus와 같이 컴퓨터의 그래픽 카드를 전환할 수 있는 경우, 전용 그래픽 카드를 사용해 고도 엔진을 구동할 수 있습니다.
pt_br: Se você usa um computador que lhe permite trocar sua placa gráfica, como NVIDIA Optimus, você pode usar a placa dedicada para executar o Godot.
uk: Якщо ви використовуєте комп’ютер, що дозволяє переключити вашу графічну карту, наприклад NVIDIA Optimus, ви можете використовувати спеціальну відеокарту для роботи Godot.

source: The editor or project takes a very long time to start.
ko: 편집기 및 프로젝트는 시작하기까지 오랜 시간이 걸립니다.
pt_br: O editor ou projeto leva muito tempo para iniciar.
uk: Редактор або проєкт довго запускається.

source: This is a `known bug <https://github.com/godotengine/godot/issues/20566>`__ on Windows when you have specific USB peripherals connected. In particular, Corsair's iCUE software seems to cause the bug. Try updating your USB peripherals' drivers to their latest version. If the bug persists, you need to disconnect the faulty peripherals before opening the editor. You can then connect the peripheral again.
ko: 이는 특정 USB 주변 장치가 연결되어 있을 때 Windows에서 '알려진 버그 <https://github.com/godotengine/godot/issues/20566>'__입니다. 특히, 커세어의 iCUE 소프트웨어는 버그를 일으키는 것 같습니다. USB 주변 기기의 드라이버를 최신 버전으로 업데이트해 보세요. 버그가 지속되면 편집기를 열기 전에 결함이 있는 주변 장치를 분리해야 합니다. 그런 다음 주변 장치를 다시 연결할 수 있습니다.
pt_br: Esse é um ´bug conhecido <https://github.com/godotengine/godot/issues/20566>´__ no Windows quando você tem periféricos USB específicos conectados. Em particular, o software iCUE da Corsair parece causar o bug. Tente atualizar os drivers dos seus periféricos USB para a última versão. Se o bug persistir, você precisa desconectar os periféricos suspeiros antes de abrir o editor. Após isso, você pode conectá-lo novamente.

source: The Godot editor appears frozen after clicking the system console.
ko: 시스템 콘솔을 클릭하면 Godot 편집기가 고정된 것처럼 보입니다.
pt_br: O editor Godot parece congelar após clicar no console do sistema.
uk: Редактор Godot зависає при натисканні на системну консоль.

source: When running Godot on Windows with the system console enabled, you can accidentally enable *selection mode* by clicking inside the command window. This Windows-specific behavior pauses the application to let you select text inside the system console. Godot cannot override this system-specific behavior.
ko: 시스템 콘솔을 사용하도록 설정한 Windows에서 Godot을 실행할 때, 명령 창 내부를 클릭하여 실수로 *선택 모드*를 활성화할 수 있습니다. 이 Windows 관련 동작은 응용 프로그램을 일시 중지하여 시스템 콘솔 내에서 텍스트를 선택할 수 있도록 합니다. Godot는 이 시스템 전용 동작을 바꿀 수 없습니다.
pt_br: Quando rodando a Godot no Windows,com o console do sistema aberto,você pode acidentalmente habilitar o *modo de seleção* clicando dentro da janela de comando.Esse comportamento característico do Windows para a aplicação para que você selecione o texto dentro do console do sistema.A Godot não pode ignorar esse comportamento específico do sistema.
uk: При роботі Godot у Windows із увімкненою системною консоллю ви можете випадково увімкнути *режим вибору*, клацнувши всередині командного вікна. Ця поведінка, специфічна для Windows, призупиняє програму, щоб дозволити вам вибрати текст усередині системної консолі. Godot не може замінити цю специфічну для системи поведінку.

source: To solve this, select the system console window and press Enter to leave selection mode.
ko: 이것을 해결하려면 시스템 콘솔 창을 선택하고 Enter를 눌러 선택 모드를 종료하십시오.
pt_br: Para resolver isto,selecione a janela do console do sistema e pressione Enter para sair do modo de seleção.
uk: Щоб вирішити цю проблему, виберіть вікно системної консолі та натисніть Enter, щоб вийти з режиму вибору.

source: Some text such as "NO DC" appears in the top-left corner of the project manager and editor window.
ko: "NO DC"와 같은 일부 텍스트가 프로젝트 관리자 및 편집기 창의 왼쪽 상단 모서리에 나타납니다.

source: This is caused by the NVIDIA graphics driver injecting an overlay to display information.
ko: 이것은 NVIDIA 그래픽 드라이버가 정보를 표시하기 위해 오버레이를 삽입하기 때문에 발생합니다.

source: To disable this overlay on Windows, restore your graphics driver settings to the default values in the NVIDIA Control Panel.
ko: Windows에서 이 오버레이를 비활성화하려면, 그래픽 드라이버 설정을 NVIDIA 제어판의 기본값으로 복원하십시오.

source: To disable this overlay on Linux, open ``nvidia-settings``, go to **X Screen 0 > OpenGL Settings** then uncheck **Enable Graphics API Visual Indicator**.
ko: 리눅스에서 이 오버레이를 사용 중지하려면, '엔비디아 설정'을 열고, **X 화면 0 > OpenGL 설정 **으로 가서 **그래픽스 API 시각적 표시기 켜기 **를 선택 취소 합니다.

source: The project window appears blurry, unlike the editor.
ko: 편집기와 달리 프로젝트 창이 흐릿하게 나타납니다.
pt_br: A janela do projeto está borrada,diferente do editor.
uk: Вікно проекту виглядає розмитим, на відміну від редактора.

source: Unlike the editor, the project isn't marked as DPI-aware by default. This is done to improve performance, especially on integrated graphics, where rendering 3D scenes in hiDPI is slow.
ko: 편집기와 달리 프로젝트는 기본적으로 DPI를 인식하는 것으로 표시되지 않습니다. 이는 특히 hiDPI에서 3D 장면을 렌더링하는 속도가 느린 통합 그래픽에서 성능을 향상시키기 위해 수행됩니다.
pt_br: Diferente do editor, o projeto não está marcado como DPI-aware por padrão.Isso é feito para melhorar a performance,especialmente em gráficos integrados,onde a renderização de cenas em hiDPI é lenta.

source: To resolve this, open **Project > Project Settings** and enable **Display > Window > Dpi > Allow Hidpi**. On top of that, make sure your project is configured to support :ref:`multiple resolutions <doc_multiple_resolutions>`.
ko: 이 문제를 해결하려면 ** 프로젝트> 프로젝트 설정 **을 열고 ** 디스플레이> 창> Dpi> Hidpi 허용 **을 활성화합니다. 제일 먼저 프로젝트가 : ref :`multiple resolutions <doc_multiple_resolutions>`를 지원하도록 구성되어 있는지 확인하세요.
pt_br: Para resolver isso,abra **Projeto > Configurações do Projeto** e habilite **Tela > Janela > Dpi > permitir Hidpi**. Além disso,verifique se o seu projeto está configurado para suportar :ref:`múltiplas resoluções <doc_multiple_resolutions>`.
uk: Для вирішення відкрийте **Проект > Параметри проекта** і позначте опцію **Display > Window > Dpi > Allow Hidpi**. Крім цього переконайтеся, що ваш проект налаштований на підтрмку :ref:`декількох розширень <doc_multiple_resolutions>`.

source: The project window doesn't appear centered when I run the project.
ko: 프로젝트를 실행할 때 프로젝트 창이 중앙에 나타나지 않습니다.
pt_br: A janela do projeto não aparece centralizada quando eu executo o projeto.
uk: При запуску вікно проекта не відображається по центрі.

source: This is a `known bug <https://github.com/godotengine/godot/issues/13017>`__. To resolve this, open **Project > Project Settings** and enable **Display > Window > Dpi > Allow Hidpi**. On top of that, make sure your project is configured to support :ref:`multiple resolutions <doc_multiple_resolutions>`.
ko: 해당 오류는 `알려진 오류<https://github.com/godotengine/godot/issues/13017>`__입니다. 해당 오류를 해결하시려면 **Project > Project Settings**에서 enable **Display > Window > Dpi > Allow Hidpi**를 사용 가능하도록 설정해주세요. 제일 먼저 프로젝트가 다음을 지원하도록 설정되어 있어야 합니다 :ref:`multiple resolutions <doc_multiple_resolutions>`.
pt_br: Este é um `problema conhecido <https://github.com/godotengine/godot/issues/13017>`__. Para resolvê-lo, Abra **Projeto > Configurações do Projeto** e habilite **Tela > Janela > Dpi > Permitir Hidpi**. Além disso, verifique se o seu projeto está configurado para suportar :ref:`múltiplas resoluções <doc_multiple_resolutions>`.
uk: Це `відома помилка <https://github.com/godotengine/godot/issues/13017>`__. Для вирішення відкрийте **Проект > параметри проекта** і позначте опцію **Display > Window > Dpi > Allow Hidpi**. А також переконайтеся, що ваш проект налаштований на підтримку :ref:`декількох розширень <doc_multiple_resolutions>`.

source: The project works when run from the editor, but fails to load some files when running from an exported copy.
ko: 프로젝트는 편집기에서 실행할 때 작동하지만 내 보낸 사본에서 실행할 때 일부 파일을 로드하지 못합니다.
pt_br: O projeto funciona quando executado a partir do editor, mas falha ao carregar alguns arquivos ao executar a partir de uma cópia exportada.
uk: Проект працює при запуску з редактора, але не вдається завантажити деякі файли при запуску з експортованої копії.

source: This is usually caused by forgetting to specify a filter for non-resource files in the Export dialog. By default, Godot will only include actual *resources* into the PCK file. Some files commonly used, such as JSON files, are not considered resources. For example, if you load ``test.json`` in the exported project, you need to specify ``*.json`` in the non-resource export filter. See :ref:`doc_exporting_projects_export_mode` for more information.
ko: 해당 오류는 '대화 상자 내보내기'(export dialog)에서 리소스 파일이 아닌 파일의 필터링을 특정하지 않아 발생하는 오류입니다. 기본적으로 Godot은 PCK 파일에 실제 *리소스( 파일만을 포함하고 있습니다. JSON 파일과 같이 일반적으로 자주 사용되는 일부 파일들이 있을 수 있지만, 이러한 파일 형식은 리소스 파일로 분류되지 않습니다. 예를 들어, 내보낸 프로젝트에서 "test.json" 파일을 불러오는 경우 "비-리소스 파일 파일 내보내기 필터"에서 "*.json" 파일 형식을 특정해야 합니다. 자세한 내용은 `doc_exporting_projects_export_mode`를 확인하세요.
pt_br: Isso é geralmente causado ao esquecer de especificar um filtro para arquivos sem recursos no diálogo Exportar. Por padrão, Godot somente incluirá *recursos* presentes no arquivo PCK. Alguns arquivos comumente usados, como arquivos JSON, não são considerados recursos. Por exemplo, se você carregar ``test.json`` no projeto exportado, você precisa especificar ``*.json`` no filtro de exportação sem recursos. Veja :ref:`doc_exporting_projects_export_mode` para mais informação.
uk: Зазвичай таке трапляється, якщо забути вказати фільтр для нересурсних файлів у діалоговому вікні Експорт. За замовчуванням, Godot включатиме лише фактичні (актуальні) *ресурси* у файл PCK. Деякі часто використовувані файли, наприклад файли JSON, не вважаються ресурсами. Наприклад, якщо ви завантажуєте ``test.json`` в експортованому проекті, вам потрібно вказати ``*.json`` у фільтрі експорту не-ресурсів. Дивіться :ref:`doc_exporting_projects_export_mode` для отримання додаткової інформації.

source: On Windows, this can also be due to :ref:`case sensitivity <doc_project_organization_case_sensitivity>` issues. If you reference a resource in your script with a different case than on the filesystem, loading will fail once you export the project. This is because the virtual PCK filesystem is case-sensitive, while Windows's filesystem is case-insensitive by default.
ko: Windows에서 이것은 또한 : ref :`대소 문자 구분 <doc_project_organization_case_sensitivity>`문제 때문일 수 있습니다. 파일 시스템과 다른 대소 문자를 사용하여 스크립트에서 리소스를 참조하는 경우 프로젝트를 내 보내면로드가 실패합니다. 가상 PCK 파일 시스템은 대소 문자를 구분하지만 Windows의 파일 시스템은 기본적으로 대소 문자를 구분하지 않습니다.
pt_br: No Windows, isso pode também ser devido aos problemas :ref:`case sensitivity <doc_project_organization_case_sensitivity>` . Se você referenciar um recurso em seu script com um caso diferente disso no sistema de arquivos, carregamento falhará uma vez que você exportar o projeto. Isto se dá porque o sistema de arquivos virtual PCK é sensível aos caracteres maiúsculos e minúsculos, enquanto o sistema de arquivos do Windows não é sensível por padrão.
uk: У Windows це може бути пов'язано з :ref:`чутливістю до регістру <doc_project_organization_case_sensibility>`. Якщо ви посилаєтесь на ресурс у своєму скрипті з іншим регістром, ніж у файловій системі, завантаження не вдасться після експорту проекту. Це пов’язано з тим, що віртуальна файлова система PCK чутлива до регістру, тоді як файлова система Windows за замовчуванням не чутлива до нього.
