Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/io/data_paths.po
Languages: es, fr, ja

source: Data paths
es: Rutas de datos
fr: Chemins de données
ja: データパス

source: Path separators
es: Separadores de rutas
fr: Séparateurs de chemin
ja: パスの区切り記号

source: For the sake of supporting as many platforms as possible, Godot only accepts UNIX-style path separators (``/``). These work on all platforms, including Windows.
es: Con el fin de apoyar tantas plataformas como sea posible, Godot sólo acepta separadores de ruta de estilo UNIX (``/``). Estos funcionan en todas las plataformas, incluyendo Windows.
fr: Afin de supporter le plus grand nombre de plateformes possible, Godot n'accepte que les séparateurs de chemin de type UNIX (``/``). Ceux-ci fonctionnent sur toutes les plateformes, y compris Windows.
ja: できるだけ多くのプラットフォームをサポートするために、GodotはUNIXスタイルのパス区切り文字 (``/``) のみを受け入れます。これらは、Windowsを含むすべてのプラットフォームで機能します。

source: A path like ``C:\Projects`` will become ``C:/Projects``.
es: Una ruta como ``C:\Projects`` se convertirá en ``C:/Projects``.
fr: Un chemin comme ``C:\Projects`` deviendra ``C:/Projects``.
ja: ``C:\Projects`` のようなパスは ``C:/Projects`` になります。

source: Resource path
es: Ruta del recurso
fr: Chemin des ressources (Resource path)
ja: リソースパス

source: As mentioned in the :ref:`doc_command_line_tutorial`, Godot considers that a project exists in any given folder that contains a ``project.godot`` text file, even if such file is empty.
es: Como se menciona en :ref:`doc_command_line_tutorial`, Godot considera que un proyecto existe en cualquier carpeta que contenga un archivo de texto ``project.godot``, incluso si dicho archivo está vacío.
fr: Comme mentionné dans le :ref:`doc_command_line_tutorial`, Godot considère qu'un projet existe dans tout dossier contenant un fichier texte ``project.godot``, même si ce fichier est vide.
ja: :ref:`doc_command_line_tutorial` で述べたように、Godotは例えそのファイルが空であったとしても ``project.godot`` テキストファイルを含む任意のフォルダにプロジェクトが存在すると見なします。

source: Accessing project files can be done by opening any path with ``res://`` as a base. For example, a texture located in the root of the project folder may be opened from the following path: ``res://some_texture.png``.
es: El acceso a los archivos del proyecto se puede hacer abriendo cualquier ruta con ``res://`` como base. Por ejemplo, una textura ubicada en la raíz de la carpeta del proyecto puede abrirse desde la siguiente ruta: ``res://some_texture.png``.
fr: L'accès aux fichiers du projet peut être fait en ouvrant n'importe quel chemin avec ``res://`` comme base. Par exemple, une texture située à la racine du dossier du projet peut être ouverte à partir du chemin suivant : ``res://some_texture.png``.
ja: プロジェクトファイルへのアクセスは、\ ``res://`` をベースとして任意のパスを開くことで実行できます。たとえば、プロジェクトフォルダのルートにあるテクスチャは、次のパスから開くことができます: ``res://some_texture.png``\ 。

source: User path (persistent data)
es: Ruta de usuario (datos persistentes)
fr: Chemin utilisateur (données persistantes)
ja: ユーザーパス(永続的なデータ)

source: While the project is running, it is a common scenario that the resource path will be read-only, due to it being inside a package, self-contained executable, or system-wide install location.
es: Mientras el proyecto esté en marcha, es un escenario común que la ruta de recursos sea de sólo lectura, debido a que está dentro de un paquete, un ejecutable autónomo o una ubicación de instalación en todo el sistema.
fr: Pendant l'exécution du projet, il est courant que le chemin des ressources soit en lecture seule, parce qu'il se trouve dans un paquet, un exécutable autonome ou un emplacement d'installation à l'échelle du système.
ja: プロジェクトの実行中は、パッケージ、自己完結型の実行可能ファイル、またはシステム全体のインストール場所の中にあるため、一般的なシナリオではリソースパスは読み取り専用になります。

source: Storing persistent files in such scenarios should be done by using the ``user://`` prefix, for example: ``user://game_save.txt``.
es: El almacenamiento de archivos persistentes en tales escenarios debe hacerse usando el prefijo ``user://``, por ejemplo: ``user://game_save.txt``.
fr: Le stockage de fichiers persistants dans de tels scénarios devrait être fait en utilisant le préfixe ``user://``, par exemple : ``user://game_save.txt``.
ja: このようなシナリオで永続的なファイルを格納するには、\ ``user://`` プレフィックスを使用する必要があります。例: ``user://game_save.txt``。

source: On some devices (for example, mobile and consoles), this path is unique to the project. On desktop operating systems, the engine uses the typical ``~/.local/share/godot/app_userdata/Name`` on macOS and Linux, and ``%APPDATA%/Name`` on Windows. ``Name`` is taken from the application name defined in the Project Settings, but it can be overridden on a per-platform basis using :ref:`feature tags <doc_feature_tags>`.
es: En algunos dispositivos (por ejemplo, móviles y consolas), esta ruta es única para el proyecto. En los sistemas operativos de escritorio, el motor utiliza el típico ``~/.local/share/godot/app_userdata/Name`` en macOS y Linux, y ``%APPDATA%/Name`` en Windows. El nombre se toma del nombre de la aplicación definido en la configuración del proyecto, pero puede ser sobrescrito en cada plataforma usando :ref:`feature tags <doc_feature_tags>`.
fr: Sur certains appareils (par exemple, les mobiles et les consoles), ce chemin est unique au projet. Sur les systèmes d'exploitation de bureau, le moteur utilise le typique ``~/.local/share/godot/app_userdata/Name`` sur macOS et Linux, et ``%APPDATA%/Name`` sur Windows. ``Name`` est tiré du nom de l'application défini dans les Paramètres du Projet, mais il peut être écrasé pour chaque plateforme en utilisant :ref:`feature tags <doc_feature_tags>`.
ja: 一部のデバイス(モバイルやコンソールなど)では、このパスはプロジェクトに固有です。デスクトップオペレーティングシステムでは、エンジンはmacOSとLinuxでは典型的な ``~/.local/share/godot/app_userdata/Name`` を使用し、Windowsでは ``%APPDATA%/Name`` を使用します。\ ``Name`` はプロジェクト設定で定義されたアプリケーション名から取得されますが、プラットフォームごとに :ref:`feature tags <doc_feature_tags>` を使用して上書きできます。

source: Editor data paths
es: Rutas de datos del editor
fr: Chemins de données de l'éditeur
ja: エディタデータのパス

source: The editor uses different paths for user data, user settings and cache depending on the platform. By default, these paths are:
es: El editor utiliza diferentes rutas para los datos del usuario, la configuración del usuario y la caché dependiendo de la plataforma. Por defecto, estas rutas son:
fr: L'éditeur utilise différents chemins pour les données utilisateur, les paramètres utilisateur et le cache en fonction de la plate-forme. Par défaut, ces chemins sont :
ja: エディタは、プラットフォームに応じて、ユーザーデータ、ユーザー設定、およびキャッシュに異なるパスを使用します。デフォルトでは、これらのパスは次のとおりです:

source: Type
es: Tipo
ja: タイプ(型)

source: Location
es: Localización
fr: Emplacement
ja: 場所(Location)

source: User data
es: Datos de usuario
fr: Données utilisateur
ja: ユーザーデータ

source: User settings
es: Ajustes de usuario
fr: Réglages utilisateur
ja: ユーザー設定

source: Cache
ja: キャッシュ

source: **User data** contains export templates and project-specific data.
es: **Los datos de usuario** contienen plantillas de exportación y datos específicos del proyecto.
fr: **Les données utilisateur** contiennent des modèles d'exportation et des données spécifiques au projet.
ja: **ユーザーデータ** には、エクスポートテンプレートとプロジェクト固有のデータが含まれます。

source: **User settings** contains editor settings, text editor themes, script templates, etc.
es: **Los ajustes del usuario** contienen ajustes del editor, temas del editor de texto, plantillas de script, etc.
fr: **Paramètres utilisateur** contient les paramètres de l'éditeur, les thèmes de l'éditeur de texte, les modèles de script, etc.
ja: **ユーザー設定** には、エディタ設定、テキストエディタのテーマ、スクリプトテンプレートなどが含まれます。

source: **Cache** contains temporary data. It can safely be removed when Godot is closed.
es: **La cache** contiene datos temporales. Pueden ser eliminados con seguridad cuando Godot se cierre.
fr: **Cache** contient des données temporaires. Il peut être supprimé en toute sécurité lorsque Godot est fermé.
ja: **キャッシュ** には一時データが含まれます。 Godotを閉じたときに安全に削除できます。

source: Godot complies with the `XDG Base Directory Specification <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`__ on all platforms. Environment variables can be overridden as per the specification to change the editor (and project) data paths.
es: Godot cumple con la `XDG Base Directory Specification <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>` en todas las plataformas. Las variables de entorno pueden ser anuladas según la especificación para cambiar las rutas de datos del editor (y del proyecto).
fr: Godot est conforme à la `XDG Base Directory Specification <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`__ sur toutes les plateformes. Les variables d'environnement peuvent être remplacées selon la spécification pour modifier les chemins de données de l'éditeur (et du projet).
ja: Godotは、すべてのプラットフォームで `XDG Base Directory Specification <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`__ に準拠しています。環境変数は、仕様に従ってオーバーライドして、エディタ(およびプロジェクト)データパスを変更できます。

source: If you use `Godot packaged as a Flatpak <https://flathub.org/apps/details/org.godotengine.Godot>`__, the editor data paths will be located in subfolders in ``~/.var/app/org.godotengine.Godot/``.
es: Si usas `Godot empaquetado como un Flatpak <https://flathub.org/apps/details/org.godotengine.Godot>`__, las rutas de datos del editor se ubicarán en subcarpetas como ``~/.var/app/org.godotengine.Godot/``.
fr: Si vous utilisez `Godot comme package Flatpak <https://flathub.org/apps/details/org.godotengine.Godot>`__, les chemins de données de l'éditeur seront situés dans des sous-dossiers de ``~/.var/app/org.godotengine.Godot/``.
ja: `フラットパック(Flatpak)としてパッケージ化されたGodot <https://flathub.org/apps/details/org.godotengine.Godot>`__ を使用する場合、エディタのデータパスは ``~/.var/app/org.godotengine.Godot/`` のサブフォルダに配置されます。

source: Self-contained mode
es: Modo autónomo
fr: Mode autonome
ja: 自己完結型モード

source: If you create a file called ``._sc_`` or ``_sc_`` in the same directory as the editor binary, Godot will enable *self-contained mode*. This will make Godot write all user data to a directory named ``editor_data/`` in the same directory as the editor binary. This is useful to create a "portable" installation, which can then be placed on an USB drive.
es: Si creas un archivo llamado ``._sc_`` o ``_sc_`` en el mismo directorio que el binario del editor, Godot habilitará el *modo autónomo* (self-contained mode). Esto hará que Godot escriba todos los datos del usuario en un directorio llamado ``editor_data/`` en el mismo directorio que el binario del editor. Esto es útil para crear una instalación "portable", que luego puede ser colocada en una unidad USB.
fr: Si vous créez un fichier appelé ``._sc_`` ou ``_sc_`` dans le même répertoire que le binaire de l'éditeur, Godot activera le mode *self-contained*. Ceci fera que Godot écrira toutes les données utilisateur dans un répertoire nommé ``editor_data/`` dans le même répertoire que le binaire de l'éditeur. Ceci est utile pour créer une installation "portable", qui peut ensuite être placée sur une clé USB.
ja: エディタバイナリと同じディレクトリに ``._sc_`` または ``_sc_`` というファイルを作成すると、Godotは *自己完結型モード* を有効にします。これにより、Godotはすべてのユーザーデータを、エディタバイナリと同じディレクトリにある ``editor_data/`` という名前のディレクトリに書き込みます。これは、USBドライブに配置できる「ポータブル」インストールを作成するのに便利です。

source: The `Steam release of Godot <https://store.steampowered.com/app/404790/>`__ uses self-contained mode by default.
es: El `Steam release of Godot <https://store.steampowered.com/app/404790/>`__ utiliza el modo autónomo por defecto.
fr: La version `Steam de Godot <https://store.steampowered.com/app/404790/>`__ utilise le mode autonome par défaut.
ja: `Steam用にリリースされるGodot <https://store.steampowered.com/app/404790/>`__ は、デフォルトで自己完結型モードを使用します。
