Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/io/encrypting_save_games.po
Languages: de, es, fr, ja, zh_cn

source: Encrypting save games
de: Verschlüsseln von Spielständen
es: Encriptar las partidas guardadas
fr: Cryptage des sauvegardes de jeu
ja: セーブデータの暗号化
zh_cn: 加密保存游戏

source: Why?
de: Warum?
es: ¿Por qué?
fr: Pourquoi ?
ja: どうして？
zh_cn: 为什么？

source: Because the world today is not the world of yesterday. A capitalist oligarchy runs the world and forces us to consume in order to keep the gears of this rotten society on track. As such, the biggest market for video game consumption today is the mobile one. It is a market of poor souls forced to compulsively consume digital content in order to forget the misery of their everyday life, commute, or just any other brief free moment they have that they are not using to produce goods or services for the ruling class. These individuals need to keep focusing on their video games (because not doing so will fill them with tremendous existential angst), so they go as far as spending money on them to extend their experience, and their preferred way of doing so is through in-app purchases and virtual currency.
de: Die Welt von heute ist nicht die Welt von Gestern, eine kapitalistische Oligarchie (Herrschaft von Wenigen) bestimmt die Welt und drängt uns zu konsumieren um diese Zahnräder unserer verrotteten Gesellschaft am laufen zu halten. Genauso ist der größte Markt für Video Spiele heutzutage der Mobile Sektor. Es ist ein Markt für arme Seelen die zwanghaft digitale Inhalte konsumieren müssen, um ihren miserablen Alltag, oder einfach jeden freien Moment indem sie mal keine Güter produzieren oder Dienstleistungen anbieten für die führende Gesellschaftsklasse, zu vergessen. Diese Individuen müssen sich auf ihre Videospiele konzentrieren, den wenn sie es nicht tun, erfüllt es sie mit enormer panischer Angst. Daher gehen sie soweit, dass sie dafür Geld bezahlen, um ihre Erfahrungen und ihren bevorzugten Lebensweg durch diese In-App Käufe und virtueller Währung zu befriedigen.
es: Porque el mundo de hoy no es el mundo de ayer. Una oligarquía capitalista dirige el mundo y nos obliga a consumir para mantener los engranajes de esta sociedad podrida. Por lo tanto, el mayor mercado para el consumo de videojuegos hoy en día es el móvil. Es un mercado de pobres almas obligadas a consumir compulsivamente contenidos digitales para olvidar la miseria de su vida cotidiana, los desplazamientos, o cualquier otro breve momento libre que tengan y que no utilicen para producir bienes o servicios para la clase dominante. Estos individuos necesitan seguir centrándose en sus videojuegos (porque no hacerlo les llenará de una tremenda angustia existencial), por lo que llegan a gastar dinero en ellos para ampliar su experiencia, y su forma preferida de hacerlo es a través de compras in-app y moneda virtual.
fr: Parce que le monde d'aujourd'hui n'est pas le monde d'hier. Une oligarchie capitaliste dirige le monde et nous oblige à consommer pour maintenir les rouages de cette société pourrie sur les rails. Ainsi, le plus grand marché pour la consommation de jeux vidéo aujourd'hui est celui du mobile. C'est un marché de pauvres âmes forcées de consommer compulsivement du contenu numérique afin d'oublier la misère de leur vie quotidienne, de faire la navette ou tout autre bref moment de liberté qu'elles ont et qu'elles n'utilisent pas pour produire des biens ou des services pour la classe dirigeante. Ces personnes doivent continuer à se concentrer sur leurs jeux vidéo (car ne pas le faire les remplira d'une énorme angoisse existentielle), alors elles vont jusqu'à dépenser de l'argent afin de prolonger leur expérience, et leurs moyens préférés de le faire sont les achats dans l'application et la monnaie virtuelle.
ja: なぜなら、今日の世界は昨日の世界ではないからです。資本主義の少数独裁者は世界を運営し、この腐敗した社会の歯車を軌道に乗せるために私たちに消費を強制します。そのため、今日のビデオゲームの消費における最大の市場はモバイル市場です。それは、日常生活の苦悩、通勤、または支配階級の商品やサービスの生産に使用していない他の短い自由時間を忘れるために、強制的にデジタルコンテンツを消費することを余儀なくされた貧しい亡霊たちの市場です。これらの個人は、ビデオゲームに集中し続ける必要があります(そうしないと、現実的な不安にとらわれてしまいます)。そのため、彼らは自分の経験を伸ばすためにそれにお金を費やしますが、彼らの好む方法はアプリ内購入と仮想通貨を使用することです。

source: But what if someone were to find a way to edit the saved games and assign the items and currency without effort? That would be terrible, because it would help players consume the content much faster, and therefore run out of it sooner than expected. If that happens, they will have nothing that avoids them to think, and the tremendous agony of realizing their own irrelevance would again take over their life.
es: Pero, ¿y si alguien encontrara la forma de editar las partidas guardadas y asignar los objetos y la moneda sin esfuerzo? Eso sería terrible, porque ayudaría a los jugadores a consumir el contenido mucho más rápido, y por lo tanto se agotaría antes de lo esperado. Si eso sucede, no tendrán nada que les impida pensar, y la tremenda agonía de darse cuenta de su propia irrelevancia se apoderaría nuevamente de su vida.
fr: Mais que se passerait-il si quelqu'un trouvait un moyen d'éditer les jeux sauvegardés et d'attribuer les objets et la monnaie sans effort ? Ce serait terrible, car cela aiderait les joueurs à consommer le contenu beaucoup plus rapidement, et donc à en épuiser le contenu plus tôt que prévu. Si cela se produit, ils n'auront rien pour les empêcher de penser, et l'agonie énorme de réaliser leur propre inutilité prendra de nouveau le dessus.
ja: しかし、誰かが保存されたゲームを編集し、手間をかけずにアイテムと通貨を割り当てる方法を見つけたらどうでしょうか？それはプレイヤーがはるかに速くコンテンツを消費し、したがって、予想よりも早くそれを使い果たすのを助けるので、それはひどい結果になります。それが起こると、彼らが現実から目を背けるためのものは何もなくなり、自分自身の無意味さに気付くという恐ろしい苦悩が再び彼らの人生を覆いつくすでしょう。

source: No, we definitely do not want that to happen, so let's see how to encrypt savegames and protect the world order.
de: Nein, wir wollen definitiv nicht, dass das passiert, also lasst uns sehen, wie man Savegames verschlüsselt und die Weltordnung schützt.
es: No, definitivamente no queremos que eso suceda, así que veamos cómo encriptar las partidas guardadas y proteger el orden mundial.
fr: Non, nous ne voulons définitivement pas que cela se produise, alors regardons comment encrypter nos sauvegardes et protéger l'ordre mondial.
ja: いいえ、私たちは絶対にそれを望まないので、セーブゲームを暗号化し、世界の秩序を保護する方法を見てみましょう。

source: How?
de: Wie?
es: ¿Cómo?
fr: Comment ?
ja: どうやって？
zh_cn: 怎么用？

source: The class :ref:`File <class_File>` can open a file at a location and read/write data (integers, strings and variants). It also supports encryption. To create an encrypted file, a passphrase must be provided, like this:
de: Die Klasse :ref:`File <class_File>` kann eine Datei an einem Speicherort öffnen und Daten (Ganzzahlen, Zeichenfolgen und Varianten) lesen bzw. schreiben. Es unterstützt auch die Verschlüsselung. Um eine verschlüsselte Datei zu erstellen, muss ein Passwort wie folgt angegeben werden:
es: La clase :ref:`File <class_File>` puede abrir un archivo en una ubicación y leer/escribir datos (enteros, cadenas y variantes). También soporta la encriptación. Para crear un archivo cifrado, se debe proporcionar una expresión de seguridad, como esta:
fr: La classe :ref:`Fichier <classe_Fichier>` peut ouvrir un fichier à un emplacement et lire/écrire des données (entiers, chaînes de caractères et variantes). Il supporte également le cryptage. Pour créer un fichier crypté, une passphrase doit être fournie, comme ceci :
ja: クラス :ref:`File <class_File>` は、ある場所でファイルを開き、データ(整数、文字列、バリアント)を読み書きできます。暗号化もサポートしています。暗号化されたファイルを作成するには、次のようにパスフレーズを提供する必要があります:
zh_cn: 类 :ref:`File <class_File>` 可以在一个位置打开文件并读/写数据(整数、字符串和变量)。它还支持加密。要创建加密文件，必须提供一个密码，如下所示:

source: This will make the file unreadable to users, but will still not prevent them from sharing savefiles. To solve this, use the device unique id or some unique user identifier, for example:
de: Dadurch wird die Datei für Benutzer unlesbar, sie kann aber immer noch weitergegeben werden. Verwenden Sie zur Lösung dieses Problems die eindeutige ID des Geräts oder eine eindeutige Benutzerkennung, z.B.:
es: Esto hará que el archivo sea ilegible para los usuarios, pero aún así no impedirá que compartan los archivos de guardado. Para resolver esto, utiliza el id único del dispositivo o algún identificador de usuario único, por ejemplo:
fr: Cela rendra le fichier illisible pour les utilisateurs, mais ne les empêchera pas de partager les fichiers de sauvegarde. Pour résoudre ce problème, utilisez l'identifiant unique de l'appareil ou un identifiant utilisateur unique, par exemple :
ja: これにより、ユーザーはファイルを読み取れなくなりますが、ユーザーがセーブファイルを共有できなくなることはありません。これを解決するには、デバイスの一意のIDまたは一意のユーザー識別子を使用します。次に例を示します:

source: Note that ``OS.get_unique_id()`` does not work on UWP or HTML5.
de: Beachten Sie das ``OS.get_unique_id()`` nicht mit UWP oder HTML5 zusammenarbeitet.
es: Ten en cuenta que ``OS.get_unique_id()`` no funciona en UWP o HTML5.
fr: Notez que ``OS.get_unique_id()`` ne fonctionne pas en UWP ou HTML5.
ja: ``OS.get_unique_id()`` はUWPまたはHTML5では機能しないことに注意してください。

source: That is all! Thank you for your cooperation, citizen.
de: Das war's! Danke für die Zusammenarbeit, Bürger.
es: ¡Eso es todo! Gracias por su cooperación, ciudadano.
fr: C'est tout ! Merci pour votre coopération, citoyen.
ja: これだけです！ 市民よ、ご協力に感謝します。

source: This method cannot really prevent players from editing their savegames locally because, since the encryption key is stored inside the game, the player can still decrypt and edit the file themselves. The only way to prevent this from being possible is to store the save data on a remote server, where players can only make authorized changes to their save data. If your game deals with real money, you need to be doing this anyway.
de: Diese Methode kann Spieler nicht wirklich daran hindern, ihre Spielstände lokal zu verändern. Da der Schlüssel (Encryption key) im Spiel gespeichert ist, kann der Spieler die Datei dennoch selbst entschlüsseln und bearbeiten. Die einzige Möglichkeit, dies zu verhindern, besteht darin, die Spielstandsdaten auf einem Remote-Server zu speichern, auf dem Spieler nur autorisierte Änderungen an ihrem Savegame vornehmen können. Wenn Ihr Spiel mit echtem Geld zu tun hat, müssen Sie dies sogar auf diese Weise tun.
fr: Cette méthode ne peut pas vraiment empêcher les joueurs d'éditer leurs sauvegardes localement car, puisque la clé de cryptage est stockée à l'intérieur du jeu, le joueur peut toujours décrypter et éditer le fichier lui-même. La seule façon d'empêcher cela est de stocker les données de sauvegarde sur un serveur distant, où les joueurs ne peuvent apporter que des modifications autorisées à leurs données de sauvegarde. Si votre jeu traite de l'argent réel, vous devez le faire de toute façon.
ja: 暗号化キーはゲーム内に保存されているため、プレイヤーはファイルを自分で復号化および編集できるため、この方法では、プレイヤーがセーブゲームをローカルで編集することを実際に防ぐことはできません。これができないようにする唯一の方法は、セーブデータをリモートサーバーに保存することです。この場合、プレイヤーはセーブデータに対して許可された変更のみを行うことができます。ゲームで実際のお金を扱う場合は、とにかくこれを行う必要があります。

source: Because the world today is not the world of yesterday. A capitalist oligarchy runs the world and forces us to consume in order to keep the gears of this rotten society on track. As such, the biggest market for video game consumption today is the mobile one. It is a market of poor souls forced to compulsively consume digital content in order to forget the misery of their every day life, commute, or just any other brief free moment they have that they are not using to produce goods or services for the ruling class. These individuals need to keep focusing on their video games (because not doing so will produce them a tremendous existential angst), so they go as far as spending money on them to extend their experience, and their preferred way of doing so is through in-app purchases and virtual currency.
zh_cn: 因为今天的世界不是昨天的世界。一个资本主义寡头统治世界，强迫我们消费，以便使这个腐朽社会的齿轮保持在轨道上。因此，当今视频游戏消费最大的市场是手机游戏市场。这是一个穷人被迫消费数字内容的市场，以便忘记他们日常生活、通勤的痛苦，或仅仅享受他们没有被用来为统治阶级生产商品或服务的短暂自由时刻。这些人需要继续关注他们的电子游戏(因为不这样做将给他们带来巨大的生存焦虑)，所以他们甚至花钱在游戏上来扩展他们的体验，而他们这样做的首选方式是通过应用内购买和虚拟货币。

source: But, imagine if someone was to find a way to edit the saved games and assign the items and currency without effort? This would be terrible, because it would help players consume the content much faster, and as such run out of it sooner than expected. If this happens they will have nothing that avoids them to think, and the tremendous agony of realizing their own irrelevance would again take over their life.
zh_cn: 但是，想象一下，如果有人想办法编辑保存的游戏，不用任何努力地就可以分配物品和货币？这将是可怕的，因为它将使得游戏角色更快地消费游戏内容，导致更快地消费完游戏内容。如果发生这种情况，他们将没有别东西可以逃避生活，并且生活的窘迫将再次占据他们的生活。

source: No, we definitely do not want this to happen, so let's see how to encrypt savegames and protect the world order.
zh_cn: 不，我们绝对不希望这种情况发生，所以让我们看看如何加密保存游戏从而维护现实世界的秩序。

source: This will make the file unreadable to users, but will still not prevent them sharing save files. To solve this, use the device unique id or some unique user identifier, for example:
zh_cn: 对用户而言，这将使文件不可读，但仍然不会阻止他们分享保存的文件。为了解决这个问题，可以使用设备唯一的id或某个唯一用户标识符，例如:

source: Note that ``OS.get_unique_id()`` only works on iOS and Android.
zh_cn: 请注意， ``OS.get_unique_id()`` 只适用于iOS和Android系统。

source: This is all! Thanks for your cooperation, citizen.
zh_cn: 这就是全部！谢谢您的合作，公民。

source: This method cannot really prevent players from editing their savegames locally, because since the encryption key is stored inside the game, the player can still decrypt and edit the file themselves. The only way to prevent this from being possible is to store the save data on a remote server where players can only make authorized changes to their save data. If your game deals with real money, you need to be doing this anyway.
zh_cn: 这种方法并不能真正阻止游戏角色在本地编辑他们的保存游戏，因为加密密钥存储在游戏中，所以游戏角色仍然可以对文件本身进行解密和编辑。防止出现这种情况的唯一方法是将保存的游戏数据存储在远程服务器上，其中游戏角色只能对其中的保存数据进行授权更改。如果您的游戏涉及到真正的金钱，您无论如何都需要这样做。
