Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android_*_app_purchases.po
Languages: de, fr, ja, zh_cn

source: Android in-app purchases
de: Android In-App Käufe
fr: Achats intégrés à l’application Android
ja: Androidのアプリ内購入
zh_cn: Android应用内购买

source: Godot Engine has integrated GooglePaymentsV3 module with which we can implement in-app purchases in our game.
fr: Le moteur Godot a intégré le module GooglePaymentsV3 avec lequel nous pouvons mettre en place des achats in-app dans notre jeu.

source: The `Godot demo projects repository <https://github.com/godotengine/godot-demo-projects>`__ has an `android_iap <https://github.com/godotengine/godot-demo-projects/tree/master/misc/android_iap>`__ example project. It includes a GDScript interface for Android IAPs.
fr: Le `dépôt de projets de démonstration de Godot <https://github.com/godotengine/godot-demo-projects>`__ a un projet d'exemple `android_iap <https://github.com/godotengine/godot-demo-projects/tree/master/misc/android_iap>`__. Il comprend une interface GDScript pour les IAP Android.

source: Find the ``iap.gd`` script in:
fr: Trouvez le script ``iap.gd`` dans :

source: Copy it to your project, then open the Project Settings, add it to the AutoLoad list and name it as IAP so that we can reference it anywhere in the game.
fr: Copiez-le dans votre projet, puis ouvrez les paramètres du projet, ajoutez-le à la liste AutoLoad et nommez-le IAP afin que nous puissions le référencer partout dans le jeu.

source: Getting the product details
fr: Obtenir les détails du produit
ja: 製品の詳細を取得する

source: When starting our game, we will need to get the item details from Google such as the product price, description, localized price string, etc.
fr: Au début de notre jeu, nous devrons obtenir de Google les détails des articles, tels que le prix du produit, la description et la chaîne de caractère de prix localisée, etc.

source: We can use the IAP details to display the title, price and/or description on our shop scene.
fr: Nous pouvons utiliser les détails du IAP pour afficher le titre, le prix et/ou la description sur notre scène de magasin.
ja: IAPの詳細を使用して、ショップシーンのタイトル、価格、説明を表示できます。

source: Check if user purchased an item
fr: Vérifier si l'utilisateur a acheté un article
ja: ユーザーがアイテムを購入したかどうかを確認する

source: When starting our game, we can check if the user has purchased any product. **You should do this only after 2/3 seconds after your game is loaded.** If we do this as the first thing when the game is launched, IAPs might not be initialized and our game will crash on start.
fr: Lors du démarrage de notre jeu, nous pouvons vérifier si l'utilisateur a acheté un produit. **Vous ne devez le faire qu'après 2/3 secondes après le chargement de votre jeu.** Si nous le faisons en premier lors du lancement du jeu, les IAP peuvent ne pas être initialisés et notre jeu se bloquera au démarrage.

source: The Google IAP policy says the game should restore the user's purchases if the user replaces their phone or reinstalls the same app. We can use the above code to check what products the user has purchased and we can make our game respond accordingly.
fr: La politique Google IAP stipule que le jeu doit restaurer les achats de l'utilisateur si l'utilisateur remplace son téléphone ou réinstalle la même application. Nous pouvons utiliser le code ci-dessus pour vérifier quels produits l'utilisateur a achetés et nous pouvons faire réagir notre jeu en conséquence.

source: Simple Purchase
fr: Achat simple
ja: 簡単な購入

source: We can put this purchase logic on a product's buy button.
fr: On peut mettre cette logique d'achat sur le bouton d'achat d'un produit.
ja: この購入ロジックを製品の購入ボタンに配置できます。

source: We can also implement other signals for the purchase flow and improve the user experience as you needed.
fr: Nous pouvons également mettre en place d'autres signaux pour le flux d'achat et améliorer l'expérience de l'utilisateur selon vos besoins.
ja: また、購入フローに他のシグナルを実装し、必要に応じてユーザーエクスペリエンスを向上させることもできます。

source: ``purchase_fail``: When the purchase is failed due to any reason.
fr: ``purchase_fail`` : Lorsque l'achat échoue pour une raison quelconque.

source: ``purchase_cancel``: When the user cancels the purchase.
fr: ``purchase_cancel`` : Lorsque l'utilisateur annule l'achat.

source: ``purchase_owned``: When the user already bought the product earlier.
fr: ``purchase_owned`` : Lorsque l'utilisateur a déjà acheté le produit auparavant.

source: Consumables and Non-Consumables
fr: Consommables et non-consommables
ja: 消耗品と非消耗品

source: There are two types of products - consumables and non-consumables:
fr: Il existe deux types de produits - consommables et non consommables :

source: **Consumables** are purchased and used, for example, healing potions which can be purchased again and again.
fr: Les **Consumables** sont achetés et utilisés, par exemple, les potions de soins qui peuvent être achetées à plusieurs reprises.

source: **Non-consumables** are one time purchases, for example, level packs.
fr: Les **non-consumables** sont des achats ponctuels, par exemple des packs de niveau.

source: Google doesn't have this separation in their dashboard. If our product is a consumable, and if a user has purchased it, it will not be available for purchase until it is consumed. So we should call the consume method for our consumables and don't call consume for your non-consumables.
fr: Google n'a pas cette séparation dans son tableau de bord. Si notre produit est un consommable, et si un utilisateur l'a acheté, il ne sera pas disponible à l'achat tant qu'il n'aura pas été consommé. Nous devrions donc appeler la méthode de consommation pour nos produits consommables et ne pas appeler la méthode de consommation pour vos produits non consommables.
ja: Googleでは、ダッシュボードにこの分別はありません。提供する商品が消耗品であり、ユーザーがそれを購入した場合、それが消費されるまで新たに購入できません。したがって、私たちは消耗品に対して消費メソッドを呼び出し、非消耗品に対しては消費メソッドを呼び出さないでください。

source: If our game has only consumables, we don't have to do this. We can set it to consume the item automatically after a purchase.
fr: Si notre jeu n'a que des consommables, nous n'avons pas à le faire. Nous pouvons le paramétrer pour qu'il consomme automatiquement l'article après un achat.
ja: ゲームに消耗品しかない場合、これを行う必要はありません。購入後にアイテムを自動的に消費するように設定できます。

source: If our game has only non-consumables, we can
fr: Si notre jeu n'a que des non-consommables, nous pouvons
ja: ゲームに非消耗品のみが含まれている場合、つぎのようにできます

source: We should set the auto consume value only once when the game starts.
fr: Nous devrions fixer la valeur de consommation automatique une seule fois au début du jeu.
ja: ゲームの開始時に1回だけ自動消費(auto consume)の値を設定する必要があります。

source: Testing
fr: En période de test
ja: テストする

source: If we add a Gmail ID as a tester in the Google Play dashboard, that tester can purchase items and they will not be charged. Another way to test IAP is using redeem codes generated by us for our game because the purchase flow is the same.
fr: Si nous ajoutons un identifiant Gmail comme testeur dans le tableau de bord de Google Play, ce testeur peut acheter des articles et ils ne seront pas facturés. Une autre façon de tester IAP consiste à utiliser les codes de rachat générés par nous pour notre jeu, car le flux d'achat est le même.

source: Third way of testing is in development side. If we put the product ids as shown below, we will get a static fixed response according to the product ID. This is a quick way of testing things before going to the dashboard.
fr: La troisième façon de tester se situe du côté du développement. Si nous mettons les identifiants des produits comme indiqué ci-dessous, nous obtiendrons une réponse statique fixe en fonction de l'identifiant du produit. C'est une façon rapide de tester les choses avant d'aller sur le tableau de bord.

source: Godot engine has integrated GooglePaymentsV3 module with which we can implement in-app purchases in our game.
ja: GodotエンジンにはGooglePaymentsV3モジュールが統合されており、ゲーム内でアプリ内購入を実装できます。

source: The Godot engine demo project repository has an android-iap example project. It includes a gdscript interface for android IAP.
ja: Godotエンジンのデモプロジェクトリポジトリには、android-iapサンプルプロジェクトがあります。これには、Android IAP用のgdscriptインターフェイスが含まれています。

source: Check the repository here https://github.com/godotengine/godot-demo-projects
ja: ここでリポジトリを確認してください https://github.com/godotengine/godot-demo-projects

source: Find the iap.gd script in
ja: iap.gdスクリプトを探す

source: Add it to the Autoload list and name it as IAP so that we can reference it anywhere in the game.
ja: Autoloadリストに追加し、IAPという名前を付けて、ゲーム内のどこからでも参照できるようにします。

source: When starting our game, we will need to get the item details from Google such as the product price, description and localized price string etc.
ja: ゲームを始める際には、商品価格、説明、ローカライズされた価格文字列など、Googleから商品の詳細を取得する必要があります。

source: When starting our game, we can check if the user has purchased any product. YOU SHOULD DO THIS ONLY AFTER 2/3 SECONDS AFTER YOUR GAME IS LOADED. If we do this as the first thing when the game is launched, IAP might not be initialized and our game will crash on start.
ja: ゲームを開始するときに、ユーザーが製品を購入したかどうかを確認できます。ゲームをロードした後、2/3秒後にのみこれを行う必要があります。ゲームの起動時にこれを最初に行うと、IAPが初期化されない可能性があり、開始時にゲームがクラッシュします。

source: Google IAP policy says the game should restore the user's purchases if the user replaces their phone or reinstalls the same app. We can use the above code to check what products the user has purchased and we can make our game respond accordingly.
ja: Google IAPポリシーでは、ユーザーが携帯電話を交換するか、同じアプリを再インストールした場合、ゲームはユーザーの購入を復元する必要があるとしています。上記のコードを使用して、ユーザーが購入した製品を確認し、それに応じてゲームを応答させることができます。

source: ``purchase_fail`` - When the purchase is failed due to any reason
ja: ``purchase_fail`` - 何らかの理由で購入が失敗したとき

source: ``purchase_cancel`` - When the user cancels the purchase
ja: ``purchase_cancel`` - ユーザーが購入をキャンセルしたとき

source: ``purchase_owned`` - When the user already bought the product earlier
ja: ``purchase_owned`` - ユーザーが既に以前に製品を購入している場合

source: There are two types of products - consumables and non-consumables. **Consumables** are purchased and used, for eg: healing potions which can be purchased again and again. **Non-consumables** are one time purchases, for eg: Level packs.
ja: 製品には、消耗品と非消耗品の2種類があります。\ **消耗品** を購入して使用します。たとえば、何度も購入できる治癒ポーション。\ **非消耗品** は1回限りの購入です。例: レベルパック。

source: If we add a gmail id as a tester in Google dashboard, that tester can purchase items and they will not be charged. Another way to test IAP is using redeem codes generated by us for our game because the purchase flow is the same.
ja: GoogleダッシュボードでテスターとしてGmail IDを追加すると、そのテスターはアイテムを購入でき、課金されません。 IAPをテストする別の方法は、購入フローが同じであるため、ゲーム用に生成されたコードを使用することです。

source: Third way of testing is in development side. If we put the product ids as shown below, we will get a static fixed response according to the product id. This is a quick way of testing things before going to the dashboard.
ja: 第3のテスト方法は開発側です。以下に示すように、製品IDを入力すると、製品IDに基づいて静的な固定応答が返されます。これは、ダッシュボードに移動する前に、簡単にテストする方法です。

source: Godot offers a first-party ``GodotGooglePlayBilling`` Android plugin since Godot 3.2.2. The new plugin uses the `Google Play Billing library <https://developer.android.com/google/play/billing>`__ instead of the now deprecated AIDL IAP implementation.
zh_cn: 自Godot 3.2.2以来,Godot提供了一个第一方的 ``GodotGooglePlayBilling`` 安卓插件.新插件使用 `Google Play Billing库<https://developer.android.com/google/play/billing>`__ ,而不是现在已经废弃的AIDL IAP实现.

source: If you learn better by looking at an example, you can find the demo project `here <https://github.com/godotengine/godot-demo-projects/tree/master/mobile/android_iap>`__.
de: Wenn Sie anhand eines Beispiels besser lernen, finden Sie das Demo-Projekt `hier <https://github.com/godotengine/godot-demo-projects/tree/master/mobile/android_iap>`__.
zh_cn: 如果您通过查看示例更好地学习,可以在此处找到演示项目 `这里 <https://github.com/godotengine/godot-demo-projects/tree/master/mobile/android_iap>`__.

source: Migrating from Godot 3.2.1 and lower (GodotPaymentsV3)
de: Migrieren von Godot 3.2.1 und kleiner (GodotPaymentsV3)
zh_cn: 从Godot 3.2.1和更低版本迁移(GodotPaymentsV3)

source: The new ``GodotGooglePlayBilling`` API is not compatible with its predecessor ``GodotPaymentsV3``.
de: Die neue ``GodotGooglePlayBilling`` API ist nicht mit dem Vorgänger ``GodotPaymentsV3`` kompatibel.
zh_cn: 新的 ``GodotGooglePlayBilling`` API与其前身 ``GodotPaymentsV3`` 不兼容.

source: Changes
de: Veränderungen
zh_cn: 修改

source: You need to enable the Custom Build option in your Android export settings and install the ``GodotGooglePlayBilling`` plugin manually (see below for details)
de: Sie müssen die Benutzerdefinierte Build-Option in Ihren Android-Exporteinstellungen aktivieren und das Plugin ``GodotGooglePlayBilling`` manuell installieren (Details siehe unten).
zh_cn: 你需要在你的Android导出设置中启用自定义构建选项,并手动安装 ``GodotGooglePlayBilling`` 插件(详见下文)

source: All purchases have to be acknowledged by your app. This is a `requirement from Google <https://developer.android.com/google/play/billing/integrate#process>`__. Purchases that are not acknowledged by your app will be refunded.
zh_cn: 所有的购买都必须被你的应用程序所承认.这是 `谷歌<https://developer.android.com/google/play/billing/integrate#process>`__ 要求的.您的应用程序不承认的购买将被退还.

source: Support for subscriptions
de: Unterstützung für Abonnements
zh_cn: 支持订阅

source: Signals (no polling or callback objects)
de: Signale (keine Abruf- oder Rückrufobjekte)
zh_cn: 信号(没有轮询或回调对象)

source: Usage
de: Nutzung
zh_cn: 用法

source: Getting started
de: Erste Schritte
zh_cn: 入门

source: If not already done, make sure you have enabled and successfully set up :ref:`Android Custom Builds <doc_android_custom_build>`. Grab the``GodotGooglePlayBilling`` plugin binary and config from the `releases page <https://github.com/godotengine/godot-google-play-billing/releases>`__ and put both into `res://android/plugins`. The plugin should now show up in the Android export settings, where you can enable it.
zh_cn: 如果还没有完成,请确保你已经启用并成功设置 :ref:`Android Custom Builds <doc_android_custom_build>`.从 `releases page <https://github.com/godotengine/godot-google-play-billing/releases>`__"中抓取``GodotGooglePlayBilling``插件二进制文件和配置文件,并将两者放入`res://android/plugins`中.现在该插件应该出现在Android导出设置中,你可以启用它.

source: To use the ``GodotGooglePlayBilling`` API you first have to get the ``GodotGooglePlayBilling`` singleton and start the connection:
zh_cn: 要使用 ``GodotGooglePlayBilling`` API,你首先要获得 ``GodotGooglePlayBilling`` 单例,并启动连接:

source: All API methods only work if the API is connected. You can use ``payment.isReady()`` to check the connection status.
de: Alle API-Methoden funktionieren nur, wenn die API verbunden ist. Sie können ``payment.isReady()`` verwenden, um den Verbindungsstatus zu überprüfen.
zh_cn: 所有的API方法只有在API被连接的情况下才会工作,你可以使用 ``payment.isReady()`` 检查连接状态.

source: Querying available items
de: Verfügbare Elemente abfragen
zh_cn: 查询可获取的项目

source: As soon as the API is connected, you can query SKUs using ``querySkuDetails``.
de: Sobald die API verbunden ist, können Sie SKUs mit ``querySkuDetails`` abfragen.
zh_cn: 只要连接了API,你就可以使用 ``querySkuDetails`` 来查询SKU.

source: Full example:
de: Ein komplettes Beispiel:
zh_cn: 完整示例:

source: Purchase an item
de: Einen Artikel kaufen
zh_cn: 购买项目

source: To initiate the purchase flow for an item, call ``purchase``. You **must** query the SKU details for an item before you can initiate the purchase flow for it.
zh_cn: 要启动一个项目的购买流程,请调用 ``purchase`` .在启动购买流程之前,你必须**查询一个项目的SKU详情.

source: Check if the user purchased an item
de: Prüfen Sie, ob der Nutzer einen Artikel gekauft hat
zh_cn: 检查用户是否购买了某个项目

source: To get all purchases, call ``queryPurchases``. Unlike most of the other functions, ``queryPurchases`` is a synchronous operation and returns a :ref:`Dictionary <class_Dictionary>` with a status code and either an array of purchases or an error message.
zh_cn: 要获得所有的购买,调用 ``queryPurchases`` .与大多数其他函数不同的是, ``queryPurchases`` 是一个同步操作,并返回一个 :ref:`Dictionary <class_Dictionary>` 的状态码和一个购买数组或一个错误信息.

source: Consumables
de: Käufliches
zh_cn: 消耗品

source: If your in-app item is not a one-time purchase but a consumable item (e.g. coins) which can be purchased multiple times, you can consume an item by calling ``consumePurchase`` with a purchase token. Call ``queryPurchases`` to get the purchase token. Calling ``consumePurchase`` automatically acknowledges a purchase.
zh_cn: 如果你的应用内物品不是一次性购买,而是可以多次购买的消耗品(如硬币),你可以用购买令牌调用 ``consumePurchase`` 来消耗物品.调用 ``queryPurchases`` 来获取购买令牌.调用 ``consumePurchase`` 会自动确认购买.

source: Subscriptions
de: Abonnements
zh_cn: 订阅

source: Subscriptions don't work much different from regular in-app items. Just use ``"subs"`` as second argument to ``querySkuDetails`` to get subscription details. Check ``is_auto_renewing`` in the results of ``queryPurchases()`` to see if a user has cancelled an auto-renewing subscription
zh_cn: 订阅的工作原理和普通的应用内项目没有太大区别.只要使用 ``"subs"`` 作为 ``querySkuDetails`` 的第二个参数,就可以得到订阅的详细信息.在 ``queryPurchases()`` 的结果中检查 ``is_auto_renewing`` 来查看用户是否取消了自动更新的订阅
