Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/consoles.po
Languages: de, fr, pt_br, zh_cn

source: Console support in Godot
de: Konsolenunterstützung unter Godot
fr: Support des consoles dans Godot
pt_br: Suporte a Consoles em Godot
zh_cn: Godot支持的游戏机

source: Console publishing process
de: Konsolen-Veröffentlichungsprozess
fr: Processus de publication sur console
pt_br: Processo de publicação para console
zh_cn: 主机平台发布流程

source: Regardless of the engine used to create the game, the process to publish a game to a console platform is as follows:
fr: Quel que soit le moteur utilisé pour créer le jeu, le processus de publication d'un jeu sur une plateforme de console est le suivant :
pt_br: Independentemente do motor usado para criar o jogo, o processo para publicar um jogo para uma plataforma de console é a seguinte:
zh_cn: 无论使用哪种引擎制作游戏,将游戏发布到游戏主机平台的流程如下:

source: Register a developer account on the console manufacturer's website, then sign NDAs and publishing contracts. This requires you to have a registered legal entity.
fr: Enregistrez un compte de développeur sur le site web du fabricant de la console, puis signez des accords de confidentialité et des contrats d'édition. Pour cela, vous devez disposer d'une entité juridique enregistrée.
pt_br: Registrar uma conta de desenvolvedor no site da fabricante do console, então assinar acordos de não-divulgação e contratos de publicação. Isso requer que você tenha uma entidade legal registrada.
zh_cn: 在游戏机制造商的网站上注册一个开发者账号,然后签署NDA和出版合同.这需要你有一个注册的法人实体.

source: Gain access to the publishing platform by passing the acceptance process. This can take up to several months. Note that this step is significantly easier if an established publisher is backing your game. Nintendo is generally known to be more accepting of smaller developers, but this is not guaranteed.
fr: Accédez à la plateforme de publication en passant par le processus d'acceptation. Cela peut prendre jusqu'à plusieurs mois. Notez que cette étape est beaucoup plus facile si un éditeur établi soutient votre jeu. Nintendo est généralement connu pour accepter davantage les petits développeurs, mais ce n'est pas garanti.
pt_br: Obter acesso à plataforma de publicação ao passar no processo de aceitação. Isso pode levar meses. Observe que este passo é significantemente mais fácil se uma publicadora estabelecida está apoiando seu jogo. A Nintendo é geralmente conhecida aceitar melhor desenvolvedores pequenos, mas isso não é garantido.
zh_cn: 通过验收程序,获得进入出版平台的机会.这可能需要长达几个月的时间.注意,如果有成熟的发行商支持你的游戏,这一步就会明显容易很多.众所周知,任天堂通常更接受小型开发商,但这并不保证.

source: Get access to developer tools and order a console specially made for developers (*devkit*). The cost of those devkits is confidential.
fr: Accédez aux outils de développement et commandez une console spécialement conçue pour les développeurs (*devkit*). Le coût de ces devkits est confidentiel.
pt_br: Conseguir acesso a ferramentas de desenvolvedor e encomendar um console especialmente feito para desenvolvedores (*devkit*). O custo desses devkits é confidencial.
zh_cn: 获得使用开发者工具的权限,并订购专门为开发者制作的控制台(*devkit*).这些devkits的费用是保密的.

source: Port the engine to the console platform or pay a company to do it.
de: Portieren Sie die Engine auf die Konsolenplattform oder bezahlen Sie ein Unternehmen dafür.
fr: Portez le moteur sur la plateforme de la console ou payez une entreprise pour le faire.
pt_br: Portar o motor para a plataforma de console ou pagar uma empresa para fazê-lo.
zh_cn: 把引擎移植到游戏机平台上,或者花钱请一家公司来做.

source: To be published, your game needs to be rated in the regions you'd like to sell it in. For example, in North America, the `ESRB <https://www.esrb.org/>`__ handles game ratings. In Europe, this is done by `PEGI <https://pegi.info/>`__. Indie developers can generally get a rating for cheaper compared to more established developers.
fr: Pour être publié, votre jeu doit être classé dans les régions où vous souhaitez le vendre. Par exemple, en Amérique du Nord, c'est l'`ESRB <https://www.esrb.org/>`__ qui gère le classement des jeux. En Europe, c'est le `PEGI <https://pegi.info/>`__ qui s'en charge. Les développeurs indépendants peuvent généralement obtenir une classification moins chère par rapport aux développeurs plus établis.
pt_br: Para ser publicado, seu jogo precisa ser classificado nas regiões em que você deseja vendê-lo. Por exemplo, na América do Norte, a `ESRB <https://www.esrb.org/>`__ lida com classificações de jogo. Na Europa, isso é feito pela `PEGI <https://pegi.info/>`__. Já no Brasil é feito pela `Cocind <https://www.justica.gov.br/seus-direitos/classificacao>`__. Desenvolvedores independentes geralmente podem conseguir uma classificação por um valor menor comparado a desenvolvedores mais estabelecidos.
zh_cn: 要想出版,你的游戏需要在你想销售的地区进行评级.例如,在北美, `ESRB <https://www.esrb.org/>` __处理游戏评级.在欧洲,这是由 `PEGI <https://pegi.info/>` __完成的.与更成熟的开发商相比,独立开发商通常可以以更低的价格获得评级.

source: Due to the complexity of the process, the budget to publish a game by yourself on a single console often exceeds $1,000 (this is a rough figure).
fr: En raison de la complexité du processus, le budget nécessaire pour publier un jeu par vous-même sur une seule console dépasse souvent 1 000 dollars (ce chiffre est approximatif).
pt_br: Devido à complexidade do processo, o orçamento para publicar um jogo por conta própria em um único console excede $1000 (aproximadamente).
zh_cn: 由于流程复杂,自己在主机上发布一款游戏的预算往往超过1000美元(这是一个粗略的数字).

source: Official support
de: Offizielle Unterstützung
fr: Support officiel
pt_br: Suporte oficial
zh_cn: 官方支持

source: Godot currently does not officially support consoles. The reasons for this are:
de: Offiziell unterstützt Godot derzeit keine Konsolen. Die Gründe dafür sind:
fr: Actuellement, Godot ne supporte pas officiellement les consoles. Les raisons en sont les suivantes :
pt_br: O Godot atualmente não suporta consoles oficialmente. Os motivos para isso são:
zh_cn: Godot目前不正式支持游戏机.原因如下:

source: To develop for consoles, one must be licensed as a company. As an open source project, Godot does not have such a legal figure.
de: Um für Konsolen zu entwickeln, muss man als Unternehmen lizenziert sein. Als Open-Source-Projekt hat Godot keinen solch juristischen Status.
fr: Pour développer pour les consoles, il faut être licencié en tant qu'entreprise. En tant que projet open source, Godot n'a pas une telle figure juridique.
pt_br: Para desenvolver para consoles, é preciso ser licenciado como uma empresa. Como um projeto de código aberto, o Godot não tem uma imagem legal.
zh_cn: 要为游戏机开发游戏,必须获得公司许可. 作为一个开源项目,Godot没有这样的法律部分.

source: Console SDKs are secret and covered by non-disclosure agreements. Even if we could get access to them, we could not publish the platform-specific code under an open source license.
de: Konsolen-SDKs sind geheim und unterliegen Geheimhaltungsvereinbarungen. Selbst wenn wir Zugriff auf sie erhalten könnten, könnten wir den plattformspezifischen Code nicht unter einer Open-Source-Lizenz veröffentlichen.
fr: Les SDK de consoles sont secrets et couverts par des accords de non-divulgation. Même si nous pouvions y accéder, nous ne pourrions pas publier le code spécifique à la plateforme sous une licence open source.
pt_br: SDKs de console são secretas e cobertas por acordos de não-divulgação. Mesmo se pudéssemos conseguir acesso a elas, não poderíamos publicar o código específico da plataforma sob uma licença de código aberto.
zh_cn: 游戏机的SDK是保密的,并由保密协议保护. 即使我们可以访问它们,我们也无法在开源许可下发布特定平台的代码.

source: Consoles require specialized hardware to develop for, so regular individuals can't create games for them anyway.
de: Für die Entwicklung von Konsolen ist spezielle Hardware erforderlich, sodass normale Personen ohnehin keine Spiele für sie erstellen können.
fr: Pour développer dessus, les consoles nécessitent du matériel spécialisé. Ainsi, les individus ordinaires ne peuvent de toute façon pas créer des jeux pour celles-ci.
pt_br: Consoles requerem hardware especializado para desenvolver para, então pessoas normais não podem criar jogos para eles de qualquer forma.
zh_cn: 游戏机的游戏开发需要专门的硬件,因此普通人无论如何也无法为游戏机创建游戏.

source: However, it is still possible to port your games to consoles thanks to services provided by third-party companies.
de: Dank der Dienste von Drittanbietern ist es jedoch weiterhin möglich, Ihre Spiele auf Konsolen zu portieren.
fr: Cependant, il est toujours possible de porter vos jeux sur les consoles grâce aux services fournis par des sociétés tierces.
pt_br: Porém, ainda é possível portar seus jogos para consoles graças a serviços fornecidos por empresas de terceiros.
zh_cn: 但是,基于第三方公司提供的服务,仍然可以将游戏移植到游戏机中.

source: In practice, the process is quite similar to Unity and Unreal Engine, except that you need to contact a third-party developer to handle the porting process. In other words, there is no engine that is legally allowed to distribute console export templates without requiring the user to prove that they are a licensed console developer. Doing so would violate the console manufacturer's NDA.
de: In der Praxis ist der Prozess Unity und Unreal Engine sehr ähnlich, außer dass Sie sich an einen Drittanbieter wenden müssen, um den Portierungsprozess durchzuführen. Mit anderen Worten, es gibt keine Engine, die gesetzlich dazu berechtigt ist Konsolenexportvorlagen zu verteilen, ohne dass der Benutzer nachweisen muss, dass er ein lizenzierter Konsolenentwickler ist. Dies würde gegen die NDA des Konsolenherstellers verstoßen.
fr: En pratique, le processus est assez similaire à Unity et Unreal Engine, sauf que vous devez contacter un développeur tiers pour gérer le processus de portage. En d'autres termes, aucun moteur n'est légalement autorisé à distribuer des modèles d'exportation de console sans exiger de l'utilisateur qu'il prouve qu'il est un développeur de console sous licence. Cela violerait le NDA du fabricant de la console.
pt_br: Na prática, o processo é bastante similar ao Unity e Unreal Engine, exceto que você precisa contatar um desenvolvedor de terceiros para lidar com o processo de port. Em outras palavras, não há motor que esteja legalmente permitido a distribuir modelos de exportação para consoles sem exigir que o usuário prove que ele(a) é um desenvolvedor licenciado de console. Fazer isso violaria o acordo de não-divulgação da fabricante do console.
zh_cn: 实际上,这个过程与Unity和虚幻引擎十分相似,只是你需要联系第三方开发者来处理移植过程.换句话说,在法律上,没有任何一个引擎可以在不要求用户证明自己是授权的游戏机开发者的情况下发布游戏机导出模板.这样做会违反控制台制造商的NDA.

source: Third-party support
de: Unterstützung durch Dritte
fr: Support de tierce partie
pt_br: Suporte de terceiros
zh_cn: 第三方支持

source: Console ports of Godot are offered by third-party companies (which have ported Godot on their own). These companies also offer publishing of your games to various consoles.
de: Konsolenports von Godot werden von Drittunternehmen angeboten (die Godot selbst portiert haben). Diese Unternehmen bieten auch die Veröffentlichung Ihrer Spiele auf verschiedenen Konsolen an.
fr: Les portages sur console de Godot sont proposés par des sociétés tierces (qui ont porté Godot de leur propre chef). Ces sociétés proposent également la publication de vos jeux sur différentes consoles.
pt_br: Ports para console do Godot são oferecidos por empresas de terceiros (que portaram o Godot por conta própria). Estas empresas também oferecem publicação de seus jogos a vários consoles.
zh_cn: Godot的游戏机端口由第三方公司提供(它们自己移植了Godot). 这些公司还提供各种游戏机的游戏发布.

source: Following is the list of providers:
de: Es folgt die Liste der Anbieter:
fr: Voici la liste des fournisseurs :
pt_br: A seguir uma lista de fornecedoras:
zh_cn: 以下是提供者列表:

source: `Lone Wolf Technology <http://www.lonewolftechnology.com/>`_ offers Switch, PS4 and Xbox One porting and publishing of Godot games.
fr: `Lone Wolf Technology <http://www.lonewolftechnology.com/>`_ propose le portage et l'édition de jeux Godot sur Switch, PS4 et Xbox One.
pt_br: A `Lone Wolf Technology <http://www.lonewolftechnology.com/>`_ oferece porting e publicação de jogos em Godot para Switch, PS4 e Xbox One.

source: `Pineapple Works <https://pineapple.works/>`_ offers Switch and Xbox One porting and publishing of Godot games.
de: `Pineapple Works <https://pineapple.works/>`_ bietet Switch und Xbox One die Portierung und Veröffentlichung von Godot-Spielen an.
fr: `Pineapple Works <https://pineapple.works/>`_ propose le portage et l'édition de jeux Godot sur Switch et Xbox One.
pt_br: A `Pineapple Works <https://pineapple.works/>`_ oferece porting e publicação de jogos em Godot para Switch e Xbox One.
zh_cn: `Pineapple Works <https://pineapple.works/>` _提供Switch和Xbox One的Godot游戏的移植和发布.

source: If your company offers porting and/or publishing services for Godot games, feel free to `open an issue or pull request <https://github.com/godotengine/godot-docs>`_ to add your company to the list above.
fr: Si votre entreprise propose des services de portage et/ou de publication pour les jeux Godot, n'hésitez pas à `ouvrir une issue ou à faire une pull request <https://github.com/godotengine/godot-docs>`_ pour ajouter votre entreprise à la liste ci-dessus.
pt_br: Se sua empresa oferece serviços de porting e/ou publicação para jogos em Godot, sinta-se livre para `abrir um issue ou pull request <https://github.com/godotengine/godot-docs>`_ para adicionar sua empresa à lista acima.
zh_cn: 如果您的公司为Godot游戏提供移植和/或发布服务,请随时 `打开一个issue或发送一个pull request <https://github.com/godotengine/godot-docs>`_ 将您的公司添加到上面的列表中.

source: `Lone Wolf Technology <http://www.lonewolftechnology.com/>`_ offers Switch and PS4 porting and publishing of Godot games.
zh_cn: `Lone Wolf Technology <http://www.lonewolftechnology.com/>` _提供Switch和PS4的Godot游戏的移植和发布.
