Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/customizing_html5_shell.po
Languages: fr, zh_cn

source: Customizing the Web export HTML page
zh_cn: 自定义Web导出HTML页面

source: Rather than the default HTML page that comes with the export templates, it is also possible to use a custom HTML page. This allows drastic customization of the final web presentation and behavior. The path to the custom HTML page is specified in the export options as ``Html/Custom Html Shell``.
zh_cn: 除了导出模板附带的默认HTML页面之外，还可以使用自定义HTML页面。 这允许对最终的Web表示和行为进行大量定制。 自定义HTML页面的路径在导出选项中指定为 ``Html/Custom Html Shell`` 。

source: Loading files from a different directory
zh_cn: 从其他目录加载文件

source: Loading a ``.zip`` file instead of a ``.pck`` file as main pack
zh_cn: 加载 ``.zip`` 文件而不是 ``.pck`` 文件作为主包

source: Loading engine files from a different directory than the main pack file
zh_cn: 从主包文件以外的目录中加载引擎文件

source: Adding a click-to-play button so games can be started in full-screen mode
zh_cn: 添加一个点击播放按钮，这样游戏可以在全屏模式下启动

source: Loading some extra files before the engine starts, so they are available in the file system later
zh_cn: 在引擎启动之前加载一些额外的文件，以便稍后在文件系统中可用

source: Passing custom "command line" arguments, e.g. ``-s`` to start a MainLoop script
zh_cn: 传递自定义“命令行”参数，例如 ``-s`` 启动MainLoop脚本

source: Placeholder substitution
zh_cn: 占位符替换

source: When exporting the game, several placeholders in the HTML page are replaced with values depending on the export:
zh_cn: 导出游戏时，HTML页面中的多个占位符将替换为值，具体取决于导出:

source: Placeholder
zh_cn: 占位符

source: Substituted by
zh_cn: 替换为

source: Basename of exported files without suffixes, e.g. ``game`` when exporting ``game.html``
zh_cn: 没有后缀的导出文件的基本名称，例如 ``game`` 在导出 ``game.html`` 时

source: ``true`` if debugging, ``false`` otherwise
zh_cn: 如果调试就是 ``true`` ，否则是 ``false``

source: Custom string to include just before the end of the HTML ``<head>`` element
zh_cn: 自定义字符串，包含在HTML `` <head>`` 元素的结尾之前

source: The HTML file must evaluate the JavaScript file ``$GODOT_BASENAME.js``. This file defines a global ``Engine`` object used to start the engine, :ref:`see below <doc_javascript_engine_object>` for details.
zh_cn: HTML文件必须评估JavaScript文件 ``$ GODOT_BASENAME.js`` 。 这个文件定义了一个用于启动引擎的全局 ``Engine`` 对象，参见 :ref:`see below <doc_javascript_engine_object>` 了解详细信息。

source: The boot splash image is exported as ``$GODOT_BASENAME.png`` and can be used e.g. in ``<img />`` elements.
zh_cn: 引导启动图像被导出为 ``$ GODOT_BASENAME.png`` 并且可以用于例如 在 ``<img />`` 元素中。

source: ``$GODOT_DEBUG_ENABLED`` can be useful to optionally display e.g. an output console or other debug tools.
zh_cn: ``$ GODOT_DEBUG_ENABLED`` 可用于可选地显示，例如 输出控制台或其他调试工具。

source: ``$GODOT_HEAD_INCLUDE`` is replaced with the string specified by the export option ``Html/Head Include``.
zh_cn: ``$GODOT_HEAD_INCLUDE`` 被导出选项 ``Html / Head Include`` 指定的字符串替换。

source: The ``Engine`` object
zh_cn: ``Engine`` 对象

source: The JavaScript global object ``Engine`` is defined by ``$GODOT_BASENAME.js`` and serves as an interface to the engine start-up process.
zh_cn: JavaScript全局对象 ``Engine`` 由 ``$GODOT_BASENAME.js`` 定义，并作为引擎启动过程的接口。

source: The API is based on and requires basic understanding of `Promises <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Using_promises>`__.
zh_cn: 本API基于并要求对承诺有基本的理解。 <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Using_promises>`__.

source: The object itself has only the following methods:
zh_cn: 对象本身只有以下方法:

source: Load the engine from the passed base path.
zh_cn: 从已通过的底层路径加载引擎。

source: Arguments
zh_cn: 参数

source: Base path of the engine to load.
zh_cn: 引擎加载的底层路径。

source: Returns
zh_cn: 返回

source: Promise which resolves once the engine is loaded.
zh_cn: 当引擎加载时承诺解决。

source: Unload the engine to free memory.
zh_cn: 卸载引擎以释放内存。

source: This is called automatically once the engine is started unless explicitly disabled using :js:func:`engine.setUnloadAfterInit`.
zh_cn: 除非使用:js:func:`引擎.初始化后卸载`显式禁用，否则引擎一旦启动就会自动调用。

source: Check whether WebGL is available.
zh_cn: 检查WebGL是否可用。

source: The major WebGL version to check for. Defaults to 1 for *WebGL 1.0*.
zh_cn: 主要WebGL版本检查。*WebGL 1.0*默认值为1。

source: ``true`` if the given major version of WebGL is available, ``false`` otherwise.
zh_cn: 如果WebGL的主要版本可用，则为真，否则为假。

source: When loading the engine, the filename extension of the WebAssembly module is assumed to be ``wasm``. This function allows usage of an alternate extension.
zh_cn: 加载引擎时，WebAssembly模块的文件名扩展假定为“wasm”。这个函数允许使用替代扩展。

source: This is useful for outdated hosts that only accept uploads of files with certain filename extensions.
zh_cn: 对于过时的主机来说，只接受某些文件扩展名的文件的上传，是非常有用的。

source: Filename extension without preceding dot.
zh_cn: 文件名扩展没有前面的点。

source: Depending on the host, using an alternate filename extension can prevent some start-up optimizations. This occurs when the file is delivered with a MIME-type other than :mimetype:`application/wasm`.
zh_cn: 根据主机，使用替代文件名扩展可以防止某些启动优化。当文件使用mime类型交付时，就会发生这种情况。而不是 :mimetype:`应用程序/wasm`。

source: Starting an ``Engine`` instance
zh_cn: 启动 ``Engine`` 实例

source: :js:class:`Engine` also acts a class:
zh_cn: :js:类:`引擎`还是一个类:

source: An instance of the engine that can be started, usually a game.
zh_cn: 可以启动的引擎实例，通常是一个游戏。

source: Instantiate the class using the ``new`` operator:
zh_cn: 使用“new”操作符实例化类:

source: This yields an :js:class:`Engine` instance, referred to as ``engine`` with a lower-case ``e`` from here.
zh_cn: 这将生成一个:js:类:`引擎`实例，在这里用小写的“e”代替“engine”。

source: To start such an instance, the global ``Engine`` object must be loaded, then the ``engine`` instance must be initialized and finally started.
zh_cn: 要启动这样的实例，必须加载全局 ``Engine`` 对象，然后必须初始化并启动 ``engine`` 实例。

source: Initialize the instance. The instance can then be started with one of the ``start`` functions, usually :js:func:`engine.startGame`.
zh_cn: 初始化实例。然后可以使用其中一个``开始`` 函数启动实例，通常是:js:函数:“引擎.开始游戏”。

source: The base path to the engine, same as in :js:func:`Engine.load`. Must be passed only if the engine hasn't been loaded yet.
zh_cn: 引擎的基本路径与:js:函数:`引擎.加载`相同。只有在引擎尚未加载时才能通过。

source: Promise that resolves once the engine is loaded and initialized.
zh_cn: 承诺一旦加载并初始化引擎就会解析。

source: Load a file so it is available in the file system once the instance runs. Must be called **before** starting the instance.
zh_cn: 这会加载一个文件，以便在启动实例后在文件系统中可用。 必须在启动实例**之前** 调用。

source: If type is string, the file will be loaded from that path.
zh_cn: 如果类型是字符串，则文件将从该路径加载。

source: The engine must be loaded beforehand.
zh_cn: 引擎必须预先加载。

source: Requires that the engine has been loaded, and that a canvas can be found on the page.
zh_cn: 需要的引擎已经加载完毕，可以在页面上找到画布。

source: Command line arguments.
zh_cn: 命令行参数。

source: Promise that resolves once the engine started.
zh_cn: 引擎启动后解析的承诺。

source: Initializes the engine if not yet initialized and starts the game with the main pack loaded from the passed URL.
zh_cn: 初始化引擎(如果还没有初始化)，并使用从传递的URL加载的主包启动游戏。

source: If the engine isn't loaded yet, the base path of the passed URL will be used to load the engine.
zh_cn: 如果尚未加载引擎，则将使用传递的URL的基本路径来加载引擎。

source: This function ignores overrides of filenames and their extensions to start only the main pack passed as argument.
zh_cn: 这个函数忽略文件名及其扩展名的覆盖，只启动作为参数传递的主包。

source: Path to the main pack to start. Also used as base path to load the engine if not loaded already.
zh_cn: 从主包路径启动游戏。如果还没有加载引擎，也可用作加载引擎的基本路径。

source: Promise that resolves once the game started.
zh_cn: 当游戏启动后承诺解析。

source: Configuring start-up behaviour
zh_cn: 配置启动行为

source: Beside starting the engine, other methods of the engine instance allow configuring the behavior:
zh_cn: 除启动引擎外，引擎实例的其他方法还允许配置行为:

source: Specify whether the Engine will be unloaded automatically after the instance is initialized.
zh_cn: 指定初始化实例后是否自动卸载引擎。

source: This frees browser memory by unloading files that are no longer needed once the instance is initialized. However, if more instances of the engine will be started, the Engine will have to be loaded again.
zh_cn: 这通过卸载初始化实例后不再需要的文件来释放浏览器内存。 但是，如果将启动更多引擎实例，则必须再次加载引擎。

source: Enabled by default.
zh_cn: 默认启用。

source: ``true`` if the engine shall be unloaded after initializing, ``false`` otherwise.
zh_cn: 如果引擎在初始化后卸载，则为“真”，否则为“假”。

source: Specify a canvas to use.
zh_cn: 指定要使用的画布。

source: By default, the first canvas element on the page is used for rendering.
zh_cn: 默认情况下，页面上的第一个画布元素用于呈现。

source: The canvas to use.
zh_cn: 使用的画布。

source: Specifies whether the canvas will be resized to the width and height specified in the project settings on start.
zh_cn: 设置是否将画布调整为启动时项目设置中指定的宽度和高度。

source: ``true`` if the canvas shall be resized on start, ``false`` otherwise.
zh_cn: 如果在开始时需要调整画布大小，则为"真"，否则为“假”。

source: By default, the engine will try to guess the locale to use from the JavaScript environment. It is usually preferable to use a server-side user-specified locale, or at least use the locale requested in the HTTP ``Accept-Language`` header. This method allows specifying such a custom locale string.
zh_cn: 默认情况下，引擎将尝试从JavaScript环境猜测要使用的语言环境。通常最好使用服务器端用户指定的区域设置，或者至少使用HTTP ``Accept-Language`` header中请求的区域设置。该方法允许指定这样的自定义区域设置字符串。

source: For example, with PHP:
zh_cn: 例如，使用PHP的情况:

source: Locale.
zh_cn: 地区设置。

source: List of :ref:`locales <doc_locales>`.
zh_cn: 列表:参考:`地区设置<文档_地区设置>`.

source: Specify the virtual filename of the executable.
zh_cn: 指定可执行文件的虚拟文件名。

source: A real executable file doesn't exist for the HTML5 platform. However, a virtual filename is stored by the engine for compatibility with other platforms.
zh_cn: HTML5平台不存在真正的可执行文件。但是，引擎存储虚拟文件名是为了与其他平台兼容。

source: By default, the base name of the loaded engine files is used. This method allows specifying another name.
zh_cn: 默认情况下，使用加载的引擎文件的基本名称。此方法允许指定另一个名称。

source: This affects the output of :ref:`OS.get_executable_path() <class_OS_method_get_executable_path>` and the automatically started main pack, :file:`{ExecutableName}.pck`.
zh_cn: 这将影响:参考:`操作系统.获取可执行文件路径()<类_操作系统_方法_获取可执行文件路径>`和自动启动的主包:文件:`{可执行文件名称}.pck`。

source: Executable name.
zh_cn: 可执行文件名称。

source: Customizing the presentation
fr: Personnalisation de la présentation
zh_cn: 自定义演示文稿

source: The following methods are used to implement the presentation:
zh_cn: 以下方法用于实现演示:

source: Set the callback for displaying download progress.
zh_cn: 设置显示下载进度的回调函数。

source: Callback called once per frame with two number arguments: bytes loaded so far, and total bytes to load.
zh_cn: 每帧调用一个回调函数，有两个数值类型的参数：目前已加载的字节数，以及要加载的总字节数。

source: If the total is 0, it couldn't be calculated. Possible reasons include:
zh_cn: 如果总数为0，则无法计算。 可能的原因包括:

source: Files are delivered with server-side chunked compression
zh_cn: 文件随服务器端分块压缩一起提供

source: Files are delivered with server-side compression on Chromium
zh_cn: 文件在Chromium上通过服务器端压缩提供

source: Not all file downloads have started yet (usually on servers without multi-threading)
zh_cn: 并非所有文件下载都已开始(通常在没有多线程的服务器上)

source: For ease of use, the callback is only called once per frame, so that usage of ``requestAnimationFrame()`` is not necessary.
zh_cn: 为便于使用，每帧只调用一次回调，因此，没有必要使用“请求动画帧()”。

source: Specify the standard output stream callback.
zh_cn: 指定标准输出流回调。

source: Callback function called with one argument, the string to print.
zh_cn: 回调函数调用带有一个参数，要打印的字符串。

source: This method should usually only be used in debug pages. The ``$GODOT_DEBUG_ENABLED`` placeholder can be used to check for this.
zh_cn: 这些方法通常只在调试页面中使用。 可以使用"$GODOT_调试_激活"占位符来检查这一点。

source: By default, ``console.log()`` is used.
zh_cn: 默认情况下，使用的是“console.log()”。

source: Specify the standard error stream callback.
zh_cn: 调整标准错误流回调。

source: By default, ``console.warn()`` is used.
zh_cn: 默认情况下，使用的是“console.warn()”。

source: Accessing the Emscripten ``Module``
zh_cn: 访问Emscripten ``Module``

source: If you know what you're doing, you can access the runtime environment (Emscripten's ``Module``) as ``engine.rtenv``. Check the official Emscripten documentation for information on how to use it: https://kripken.github.io/emscripten-site/docs/api_reference/module.html
zh_cn: 如果您知道您在做什么，您可以访问运行时环境(Emscripten的 ``Module`` )作为 ``engine.rtenv`` 。 查看官方Emscripten文档以获取有关如何使用它的信息:https://kripken.github.io/emscripten-site/docs/api_reference/module.html

source: Custom HTML page for Web export
fr: Page HTML custom pour un export Web

source: While Web export templates provide a default HTML page fully capable of launching the project without any further customization, it may be beneficial to create a custom HTML page. While the game itself cannot be directly controlled from the outside, such page allows to customize the initialization process for the engine.
fr: Tandis que les export Web fournissent un modèle de page HTML absolument capable de lancer le projet sans nécessiter de customisation supplémentaire, Il peut être bénéfique de créer une page HTML customisée. Une telle page permet de customiser l'initialisation du jeu, bien que le jeu lui même ne puisse être manipulé de l’extérieur.

source: Some use-cases where customizing the default page is useful include:
fr: Quelques cas pratique où une telle page puisse être utile :

source: Loading files from a different directory than the page;
fr: Chargement de fichiers à partir d'un répertoire différent de la page ;

source: Loading a ``.zip`` file instead of a ``.pck`` file as the main pack;
fr: Chargement d'un fichier ``.zip`` au lieu d'un fichier ``.pck`` comme paquet principal ;

source: Loading the engine from a different directory than the main pack file;
fr: Chargement du moteur à partir d'un répertoire différent de celui du fichier du pack principal ;

source: Adding a click-to-play button so that games can be started in the fullscreen mode;
fr: Ajout d'un bouton click-to-play pour que les jeux puissent être lancés en mode plein écran ;

source: Loading some extra files before the engine starts, making them available in the project file system as soon as possible;
fr: Chargement de quelques fichiers supplémentaires avant le démarrage du moteur, en les rendant disponibles dans le système de fichiers du projet dès que possible ;

source: Passing custom command line arguments, e.g. ``-s`` to start a ``MainLoop`` script.
fr: Passer des arguments de ligne de commande personnalisés, par exemple ``-s`` pour démarrer un script ``MainLoop``.

source: The default HTML page is available in the Godot Engine repository at `/misc/dist/html/full-size.html <https://github.com/godotengine/godot/blob/master/misc/dist/html/full-size.html>`__ and can be used as a reference implementation. Another sample HTML page is available at `/misc/dist/html/fixed-size.html <https://github.com/godotengine/godot/blob/master/misc/dist/html/fixed-size.html>`__. It differs from the default one by having a fixed size canvas area and an output widget below it.
fr: La page HTML par défaut est disponible dans le dépôt Godot Engine à l'adresse `/misc/dist/html/full-size.html <https://github.com/godotengine/godot/blob/master/misc/dist/html/full-size.html>`__ et peut être utilisée comme implémentation de référence. Un autre exemple de page HTML est disponible à l'adresse suivante : `/misc/dist/html/fixed-size.html <https://github.com/godotengine/godot/blob/master/misc/dist/html/fixed-size.html>`__. Elle diffère de la page par défaut en ayant une zone de canevas de taille fixe et un widget de sortie en dessous.

source: It is recommended to use developer tools provided by browser vendors to debug exported projects. Output generated by the engine may be limited and does not include WebGL errors.
fr: Il est recommandé d'utiliser les outils développeurs fournit par le navigateur web pour déboguer le projet exporté. Les données générés en sortie par Godot peuvent en effet être limitées et n'incluent par les erreurs WebGL.

source: Setup
fr: Configuration

source: As evident by the default HTML page, it is mostly a regular HTML document. To work with Godot projects it needs to be fully realized, to have a control code that calls the :js:class:`Engine` class, and to provide places for several placeholders, which are replaced with their actual values during export.
fr: Comme le montre la page HTML par défaut, il s'agit pour l'essentiel d'un document HTML ordinaire. Pour travailler avec les projets Godot, il doit être pleinement réalisé, avoir un code de contrôle qui appelle la classe :js:class:`Engine`, et fournir des places pour plusieurs espaces réservés, qui sont remplacés par leurs valeurs réelles lors de l'exportation.

source: ``$GODOT_BASENAME``: The base name from the *Export Path*, as set up in the export options; suffixes are omitted (e.g. ``game.html`` becomes ``game``). This variable can be used to generate a path to the main JavaScript file ``$GODOT_BASENAME.js``, which provides the :js:class:`Engine` class. A splash image shown during the booting process can be accessed using this variable as well: ``$GODOT_BASENAME.png``.
fr: ``$GODOT_BASENAME`` : Le nom de base pour le *Chemin d'export* ( *Export Path* ), tel que configuré dans les options d'exports ; les suffixes sont omis (e.g. ``game.html`` devient ``game``). Cette variable peut être utilisé pour générer un chemin vers le fichier JavaScript principal. ``$GODOT_BASENAME.js``, qui fournit la classe :js:class:`Engine` . Une image splash montré pendant le démarrage peut être accédé en utilisant cette variable à nouveau : ``$GODOT_BASENAME.png``.

source: ``$GODOT_PROJECT_NAME``: The project name as defined in the Project Settings.
fr: ``$GODOT_PROJECT_NAME`` : Le nom du projet tel qu'il est défini dans les paramètres du projet.

source: ``$GODOT_HEAD_INCLUDE``: A custom string to include in the HTML document just before the end of the ``<head>`` tag. It is customized in the export options under the *Html / Head Include* section. While you fully control the HTML page you create, this variable can be useful for configuring parts of the HTML ``head`` element from the Godot Editor, e.g. for different Web export presets.
fr: ``$GODOT_HEAD_INCLUDE`` : Une chaîne de charactère customisée à inclure dans le document HTML, juste avant la fin du tag ``<head>``. Elle est spécifié dans les options d'export dans la section *Html / Head Include* . Même si vous avez le contrôle total de la page HTML que vous créez, cette variable peut être utile pour configurer une partie des éléments tagué ``head`` depuis l'éditeur Godot. Par exemple, pour différents préreglages d'export Web.

source: ``$GODOT_DEBUG_ENABLED``: A flag that tells if this is a debug build, or not. This variable is substituted by strings ``true`` and ``false``, and can be used to disable debug branches within your control code.
fr: ``$GODOT_DEBUG_ENABLED`` : Un drapeau qui indique s'il s'agit d'une version de débogage, ou non. Cette variable est substituée par les strings ``true`` et ``false``, et peut être utilisée pour désactiver les branches de débogage dans votre contrôleur de code.

source: When the custom page is ready, it can be selected in the export options under the *Html / Custom Html Shell* section.
fr: Quand la page custom est prête, elle peut être sélectionné dans les options d'exports dans la section *Html / Custom Html Shell*.

source: Starting the project
fr: Démarrage du projet

source: To be able to start the game, you need to write a script that initializes the engine — the control code. This process consists of three steps, though some of them can be skipped and left for a default behavior.
fr: Pour être capable de démarrer le jeu, vous aurez besoin d'écrire un script qui initialise le moteur Godot : Le nœud control. Ce processus d'initialisation comporte trois phases, mais certaines d'entre elles peuvent être laissé au comportement par défaut.

source: First, the engine must be loaded, then it needs to be initialized, and after this the project can finally be started. You can perform every of these steps manually and with great control. However, in the simplest case all you need to do is to create an instance of the :js:class:`Engine` class and then call the :js:meth:`engine.startGame` method.
fr: Premièrement, le moteur de jeu doit être chargé en mémoire, il doit ensuite être initialisé, et après ça le projet peut finalement être démarré. Vous pouvez effectuer chacune de ces étapes manuellement avec un grand contrôle, cependant, dans le cas le plus simple la seule chose nécessaire est de créer une instance de la classe :js:class:`Engine` et d’appeler la méthode :js:meth:`engine.startGame`.

source: This snippet of code automatically loads and initializes the engine before starting the game. It uses the given path to the executable to deduce the path to load the engine. The :js:meth:`engine.startGame` method is asynchronous and returns a ``Promise``. This allows your control code to track if the game was loaded correctly without blocking execution or relying on polling.
fr: Cet extrait de code automatiquement charge en mémoire et initialise le moteur de jeu avant de commencer le jeu. Il utilise le chemin vers l’exécutable donné pour déduire le chemin utilisé pour charger le moteur. La méthode :js:meth:`engine.startGame` est asynchrone et retourne une ``Promise`` (ce qui signifie promesse). Cela permet au nœud control de vérifier si le jeu a été chargé correctement sans avoir à bloquer son propre fonctionnement et de pouvoir s'en remettre au "polling" (attribuer un temps de calcul pour charger le jeu, vérifier si le jeu est entièrement chargé puis recommencer).

source: In case your project needs to have special arguments passed to it by the start-up script, :js:meth:`engine.startGame` can be replaced by :js:meth:`engine.start`. This method takes an arbitrary list of string arguments. As it does not have a defined list of arguments, :js:meth:`engine.start` cannot automatically load the engine.
fr: Si dans votre cas, votre projet à besoin qu'un argument spécial lui soit passé au début du script d'initialisation, remplacez la méthode :js:meth:`engine.startGame` par :js:meth:`engine.start`. Cette deuxième méthode peut en effet accepter une liste arbitrairement longue de chaîne de caractère. Comme elle ne possède pas une liste définie d'arguments, elle ne peut pas automatiquement charger le moteur.

source: To load the engine manually the :js:meth:`Engine.load` static method must be called. As this method is static, multiple engine instances can be spawned with the exact same ``basePath``. If an instance requires a different ``basePath``, you can call the :js:meth:`engine.init` method with that path before starting the game.
fr: Pour charger manuellement le moteur, la méthode statique :js:meth:`Engine.load` doit être appelé. Comme cette méthode est statique, plusieurs instances du moteur peuvent être créer avec le même chemin de base ``basePath``. Si une instance requiert un différent chemin de base, vous pouvez appeler la méthode :js:meth:`engine.init` avec ce chemin avant de commencer le jeu.

source: Multiple instances cannot be spawned by default, as the engine is immediately unloaded after it is initialized. To prevent this from happening the :js:meth:`engine.setUnloadAfterInit` method can be called. It is still possible to unload the engine manually afterwards by calling the :js:meth:`Engine.unload` static method. Unloading the engine frees browser memory by unloading files that are no longer needed once the instance is initialized.
fr: Par défaut, plusieurs instances ne peuvent pas être crées car le moteur est immédiatement déchargé après son initialisation. Pour accomplir cela il faut empêcher ce déchargement en appelant la méthode :js:meth:`engine.setUnloadAfterInit`. Il faudra alors décharger le moteur manuellement après en appelant la méthode statique :js:meth:`Engine.unload`. Décharger le moteur libère la mémoire du navigateur Web en déchargeant les fichiers qui ne sont plus nécessaire après l'initialisation.
