Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/customizing_html5_shell.po
Languages: fr, zh_cn

source: To correctly load the engine on some hosting providers and network configurations you may need to change the default filename extension by using :js:meth:`Engine.setWebAssemblyFilenameExtension`. By default, the extension is assumed to be ``wasm``. If your hosting provider blocks this extension, this static method can be used to change it to something that is supported.
fr: Pour charger le moteur correctement sur certains hôtes fournisseurs et certaines configurations réseaux, vous aurez peut être besoin de changer l'extension de fichier par défaut en utilisant la méthode :js:meth:`Engine.setWebAssemblyFilenameExtension`. Par défaut, l'extension est ``wasm``. Si votre hôte fournisseur bloque cette extension, utilisé cette méthode pour le changer à une autre extension supporté par votre hôte.

source: If a different filename extension is used, some web servers may automatically set the MIME-type of the file to something other than :mimetype:`application/wasm`. In that case some start-up optimizations may be skipped.
fr: Si une extension de nom de fichier différente est utilisée, certains serveurs web risque de régler automatiquement le MIME-type des fichiers à quelque chose de différent de :mimetype:`application/wasm`, les conséquences sont l’absence de certaines optimisation au démarrage.

source: Customizing the behavior
fr: Personnaliser le comportement

source: In the Web environment several methods can be used to guarantee that the game will work as intended.
fr: Dans l'environnement web, plusieurs méthodes peuvent être utilisés pour garantir que le jeu fonctionne comme prévu.

source: If you target a specific version of WebGL, or just want to check if WebGL is available at all, you can call the :js:meth:`Engine.isWebGLAvailable` method. It optionally takes an argument that allows to test for a specific major version of WebGL.
fr: Si vous ciblez une version spécifique de WebGL ou que voulez juste vérifier que WebGL est disponible tout court, vous pouvez appeler la méthode :js:meth:`Engine.isWebGLAvailable`. Elle prends optionnellement un argument qui permet de faire un test pour une version majeur spécifique de WebGL.

source: As the real executable file does not exist in the Web environment, the engine only stores a virtual filename formed from the base name of loaded engine files. This value affects the output of the :ref:`OS.get_executable_path() <class_OS_method_get_executable_path>` method and defines the name of the automatically started main pack. The :js:meth:`engine.setExecutableName` method can be used to override this value.
fr: Alors que le véritable fichier exécutable n'existe pas dans l'environnement Web, le moteur de jeu stocke seulement un nom de fichier virtuel, formé du nom de base des fichiers chargé du moteur. Cette valeur affecte les données de sorties de la méthode :ref:`OS.get_executable_path() <class_OS_method_get_executable_path>` et défini le nom du paquet principal automatiquement démarré. La méthode meth:`engine.setExecutableName` peut être utilisé pour réécrire cette valeur.

source: If your project requires some files to be available the moment it is loaded, you can preload them by calling the :js:meth:`engine.preloadFile` method with a path to a file or by providing it with an ``ArrayBuffer`` object. In case of the ``ArrayBuffer``, or one of its views, a second argument must be specified to define an internal path for the loaded resource.
fr: Si votre projet requiert la disponibilité de quelques fichiers au moment de son chargement, vous pouvez les précharger en appelant la méthode :js:meth:`engine.preloadFile` avec comme argument le chemin vers un fichier ou un objet ``ArrayBuffer`` ( auquel cas un deuxième argument devra être spécifié pour définir un chemin interne pour la ressource chargé.

source: Several methods can be used to further customize the look and behavior of the game on your page.
fr: Plusieurs méthodes peuvent être utilisées pour personnaliser davantage l'apparence et le comportement du jeu sur votre page.

source: By default, the first canvas element on the page is used for rendering. To use a different canvas element the :js:meth:`engine.setCanvas` method can be used. It requires a reference to the DOM element itself.
fr: Par défaut, le premier élément du canvas sur la page est utilisé pour le rendu graphique. Pour utiliser un élément canvas différent, la méthode :js:meth:`engine.setCanvas` peut être utilisée. Elle nécessite une référence à l'élément DOM lui-même.

source: If the width and height of this canvas element differ from values set in the project settings, it will be resized on the project start. This behavior can be disabled by calling the :js:meth:`engine.setCanvasResizedOnStart` method.
fr: Si la largeur et la hauteur de cet élément du canvas diffèrent des valeurs définies dans les paramètres du projet, il sera redimensionné au début du projet. Ce comportement peut être désactivé en appelant la méthode :js:meth:`engine.setCanvasResizedOnStart`.

source: If your game takes some time to load, it may be useful to display a custom loading UI which tracks the progress. This can be achieved with the :js:meth:`engine.setProgressFunc` method which allows to set up a callback function to be called regularly as the engine loads new bytes.
fr: Si le chargement de votre jeu prend un certain temps, il peut être utile d'afficher une interface de chargement personnalisée qui suit la progression. Cela peut être réalisé avec la méthode :js:meth:`engine.setProgressFunc` qui permet de mettre en place une fonction de rappel qui sera appelée régulièrement au fur et à mesure que le moteur charge de nouveaux octets.

source: Be aware that in some cases ``total`` can be ``0``. This means that it cannot be calculated.
fr: Sachez que dans certains cas, ``total`` peut être ``0``. Cela signifie qu'il ne peut pas être calculé.

source: If your game supports multiple languages, the :js:meth:`engine.setLocale` method can be used to set a specific locale, provided you have a valid language code string. It may be good to use server-side logic to determine which languages a user may prefer. This way the language code can be taken from the ``Accept-Language`` HTTP header, or determined by a GeoIP service.
fr: Si votre jeu supporte plusieurs langues, la méthode :js:meth:`engine.setLocale` peut être utilisée pour définir une locale spécifique, à condition que vous disposiez d'un string de code de langue valide. Il peut être bon d'utiliser une logique du côté serveur pour déterminer les langues qu'un utilisateur peut préférer. De cette façon, le code de langue peut être pris dans l'en-tête HTTP ``Accept-Language``, ou déterminé par un service GeoIP.

source: Debugging
fr: Débogage

source: To debug exported projects, it may be useful to read the standard output and error streams generated by the engine. This is similar to the output shown in the editor console window. By default, standard ``console.log`` and ``console.warn`` are used for the output and error streams respectively. This behavior can be customized by setting your own functions to handle messages.
fr: Pour déboguer les projets exportés, il peut être utile de lire la sortie standard et les flux d'erreurs générés par le moteur. Ceci est similaire à la sortie affichée dans la fenêtre de la console de l'éditeur. Par défaut, les fichiers standard ``console.log`` et ``console.warn`` sont utilisés respectivement pour la sortie et le flux d'erreurs. Ce comportement peut être personnalisé en définissant vos propres fonctions pour traiter les messages.

source: Use the :js:meth:`engine.setStdoutFunc` method to set a callback function for the output stream. Default behavior is similar to this:
fr: Utilisez la méthode :js:meth:`engine.setStdoutFunc` pour définir une fonction de rappel pour le flux de sortie. Le comportement par défaut est similaire à celui-ci :

source: Use the :js:meth:`engine.setStderrFunc` method to set a callback function for the error stream. Default behavior is similar to this:
fr: Utilisez la méthode :js:meth:`engine.setStderrFunc` pour définir une fonction de rappel pour le flux d'erreurs. Le comportement par défaut est similaire à celui-ci :

source: When handling the engine output keep in mind, that it may not be desirable to print it out in the finished product. To control whether or not the current execution is actually a debug build you can use ``$GODOT_DEBUG_ENABLED`` placeholder.
fr: Lorsque vous manipulez les données de sortie du moteur, gardez à l'esprit qu'il n'est peut-être pas souhaitable de l'imprimer dans le produit fini. Pour contrôler si l'exécution en cours est ou non une compilation de débogage, vous pouvez utiliser le caractère de remplissage ``$GODOT_DEBUG_ENABLED``.

source: Further debugging options and a low level access to the execution environment are available in a form of Emscripten's ``Module`` object. It can be accessed using the :js:attr:`engine.rtenv` property on the engine instance.
fr: D'autres options de débogage et un accès de bas niveau à l'environnement d'exécution sont disponibles sous la forme d'un objet ``Module`` de Emscripten. On peut y accéder en utilisant la propriété :js:attr:`engine.rtenv` sur l'instance du moteur.
