Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_six.po
Languages: es, fr, ja, zh_cn

source: Part 6
es: Parte 6
fr: Partie 6
ja: パート6
zh_cn: 第6部分

source: Part overview
es: Resumen
fr: Aperçu cette partie
ja: パートの概要

source: In this part, we're going to add a main menu and pause menu, add a respawn system for the player, and change/move the sound system so we can use it from any script.
es: En esta parte, vamos a añadir un menú principal y un menú de pausa, añadir un sistema de regeneración para el jugador, y cambiar/mover el sistema de sonido para que podamos usarlo desde cualquier script.
fr: Dans cette partie, nous allons ajouter un menu principal, un menu de pause, ajouter un système de respawn pour le joueur et changer/déplacer le système de son de façon à pouvoir l'utiliser dans n'importe quel script.
ja: このパートでは、メインメニューと一時停止メニューを追加し、プレーヤーの再出現システムを追加し、サウンドシステムを変更/移動して、どのスクリプトからでも使用できるようにします。

source: This is the last part of the FPS tutorial; by the end of this, you will have a solid base to build amazing FPS games with Godot!
es: ¡Esta es la última parte del tutorial de FPS; al final de esto, tendrás una base sólida para construir increíbles juegos FPS con Godot!
fr: C'est la dernière partie du tutoriel FPS; à la fin de celui-ci, vous aurez de solides bases pour construire d'incroyables jeux FPS avec Godot !
ja: これはFPSチュートリアルの最後の部分です。これが完了すると、GodotですばらしいFPSゲームを構築するための強固な基盤が得られます！

source: You are assumed to have finished :ref:`doc_fps_tutorial_part_five` before moving on to this part of the tutorial. The finished project from :ref:`doc_fps_tutorial_part_five` will be the starting project for part 6
es: Se supone que has terminado :ref:`doc_fps_tutorial_part_five` antes de pasar a esta parte del tutorial. El proyecto terminado de :ref:`doc_fps_tutorial_part_five` será el proyecto inicial de la parte 6
fr: Vous êtes supposé avoir terminé :ref:`doc_fps_tutorial_part_five` avant de passer à cette partie du tutoriel. Le projet fini de :ref:`doc_fps_tutorial_part_five` sera le projet de départ de la partie 6
ja: チュートリアルのこの部分に進む前に、\ :ref:`doc_fps_tutorial_part_five` を終了していると想定しています。\ :ref:`doc_fps_tutorial_part_five` の完成したプロジェクトは、パート6の開始プロジェクトになります

source: Let's get started!
es: ¡Vamos a empezar!
fr: Commençons tout de suite !
ja: では、始めましょう！
zh_cn: 让我们开始吧！

source: Adding the main menu
es: Añadiendo el menú principal
fr: Ajouter le menu principal
ja: メインメニューの追加
zh_cn: 添加主菜单

source: Firstly, open up ``Main_Menu.tscn`` and take a look at how the scene is set up.
es: En primer lugar, abre el ``Main_Menu.tscn`` y echa un vistazo a cómo está montada la escena.
fr: Premièrement, ouvrez ``Main_Menu.tscn`` et jetez un œil à la mise en place de la scène.
ja: まず、\ ``Main_Menu.tscn`` を開き、シーンがどのように設定されているかを見てみましょう。

source: The main menu is broken up into three different panels, each representing a different 'screen' of our main menu.
es: El menú principal está dividido en tres paneles diferentes, cada uno de los cuales representa una 'pantalla' diferente de nuestro menú principal.
fr: Le menu principal se décompose en trois différents panneaux, chacun représentant un 'écran' différent de notre menu principal.
ja: メインメニューは3つの異なるパネルに分かれており、それぞれがメインメニューの異なる「画面」を表しています。
zh_cn: 主菜单分为三个不同的面板，每个面板代表主菜单的不同“屏幕”。

source: The ``Background_Animation`` node is just so the background of the menu is a bit more interesting than a solid color. It's a camera looking around the skybox, nothing fancy.
es: El nodo ``Background_Animation`` es sólo para que el fondo del menú sea un poco más interesante que un color sólido. Es una cámara mirando alrededor del skybox, nada elegante.
fr: Le nœud ``Background_Animation``est là pour rendre le fond du menu un peu plus intéressant qu'une simple couleur. C'est une caméra qui regarde autour dans le ciel, rien d'extraordinaire.
ja: ``Background_Animation`` ノードは、メニューの背景が単色よりも少し興味深くなるようになっています。 それはスカイボックスの周りを見るカメラであり、空想的なものではありません。
zh_cn: ``Background_Animation``节点就是这样，菜单的背景比纯色更有趣。 这是一个环顾天空盒的相机，没什么特别的。

source: Feel free to expand all the nodes and see how they're set up. Remember to keep only ``Start_Menu`` visible when you're done, as that's the screen we want to show first when we enter the main menu.
es: Siéntete libre de expandir todos los nodos y ver cómo están configurados. Recuerda mantener sólo ``Start_Menu`` visible cuando termines, ya que es la pantalla que queremos mostrar primero cuando entremos al menú principal.
fr: N'hésitez pas à développer tous les nœuds et à voir comment ces nœuds sont mis en place. Gardez en mémoire que seul ``Start_Menu`` doit être visible quand vous aurez terminé, car c'est ce que nous voulons montrer en premier quand nous entrons dans le menu principal.
ja: すべてのノードを自由に展開して、どのように設定されているかを確認してください。メインメニューに入ったときに最初に表示したい画面なので、終了したら ``Start_Menu`` のみを表示することを忘れないでください。

source: Select ``Main_Menu`` (the root node) and create a new script called ``Main_Menu.gd``. Add the following:
es: Selecciona ``Main_Menu`` (el nodo raíz) y crea un nuevo script llamado ``Main_Menu.gd``. Añade lo siguiente:
fr: Sélectionnez ``Main_Menu`` (la scène racine) et créez un nouveau script appelé ``Main_Menu.gd``. Ajoutez ce qui suit :
ja: ``Main_Menu``(ルートノード)を選択し、\ ``Main_Menu.gd`` という新しいスクリプトを作成します。次のように追加します:
zh_cn: 选择 ``Main_Menu`` (根节点)并创建一个名为 ``Main_Menu.gd`` 的新脚本。 添加以下内容:

source: Most of the code here relates to making UIs, which is outside of the purpose of this tutorial series. **We're only going to look at the UI related code briefly.**
es: La mayor parte del código aquí se relaciona con hacer UIs, lo cual está fuera del propósito de esta serie de tutoriales. **Sólo vamos a mirar el código relacionado con la UI brevemente.**
fr: La grande majorité du code ici se rapport aux interfaces, ce qui est en dehors du propos de cette série de tutoriel. **Nous allons seulement regardez brièvement le code relatif à l'UI.**
ja: ここのコードの大部分はUIの作成に関連していますが、これはこのチュートリアルシリーズの目的外です。\ **UI関連のコードについては簡単に説明します。**
zh_cn: 这里的大多数代码都与制作UI有关，这超出了本教程系列的目的。 **我们只是简要介绍一下与UI相关的代码。**

source: See :ref:`doc_ui_main_menu` and the tutorials following for better ways to make GUIs and UIs!
es: ¡Ver :ref:`doc_ui_main_menu` y los siguientes tutoriales para mejores formas de hacer GUIs y UIs!
fr: Voir :ref:`doc_ui_main_menu` et les tutoriels qui suivent pour avoir de meilleurs méthodes de créer des GUI et des UIs !
ja: GUIとUIを作成するより良い方法については、\ :ref:`doc_ui_main_menu` とそのチュートリアルを参照してください！
zh_cn: 请参阅 :ref:`doc_ui_main_menu`以及以下教程，以获得更好的GUI和UI方法！

source: Let's look at the class variables first.
es: Veamos primero las variables de clase.
fr: Examinons d'abord les variables de classe.
ja: まずクラス変数を見てみましょう。
zh_cn: 我们先来看看类变量。

source: ``start_menu``: A variable to hold the ``Start_Menu`` :ref:`Panel <class_Panel>`.
es: ``start_menu``: Una variable para mantener el ``Start_Menu`` :ref:`Panel <class_Panel>`.
fr: ``start_menu``: Une variable utilisée pour stocker le ``Start_Menu`` :ref:`Panel <class_Panel>`.
ja: ``start_menu``: ``Start_Menu`` を保持する :ref:`Panel <class_Panel>` 変数 。
zh_cn: ``start_menu``:一个用于保存``Start_Menu``的变量 :ref:`Panel <class_Panel>`。

source: ``level_select_menu``: A variable to hold the ``Level_Select_Menu`` :ref:`Panel <class_Panel>`.
es: ``level_select_menu``: Una variable para mantener el ``Level_Select_Menu`` :ref:`Panel <class_Panel>`.
fr: ``level_select_menu``: Une variable utilisée pour stocker le ``Level_Select_Menu`` :ref:`Panel <class_Panel>`.
ja: ``level_select_menu``: ``Level_Select_Menu`` を保持する :ref:`Panel <class_Panel>` 変数。
zh_cn: ``level_select_menu``:一个用于保存``Level_Select_Menu``的变量 :ref:`Panel <class_Panel>`。

source: ``options_menu``: A variable to hold the ``Options_Menu`` :ref:`Panel <class_Panel>`.
es: ``options_menu``: Una variable para mantener el ``Options_Menu`` :ref:`Panel <class_Panel>`.
fr: ``options_menu``: Une variable utilisée pour stocker le ``Options_Menu`` :ref:`Panel <class_Panel>`.
ja: ``options_menu``: ``Options_Menu`` を保持する :ref:`Panel <class_Panel>` 変数。
zh_cn: ``options_menu``:一个变量来保存``Options_Menu`` :ref:`Panel <class_Panel>`。

source: ``testing_area_scene``: The path to the ``Testing_Area.tscn`` file, so we can change to it from this scene.
es: ``testing_area_scene``: La ruta del archivo ``Testing_Area.tscn``, así que podemos cambiarla desde esta escena.
fr: ``testing_area_scene``: Le chemin vers le fichier ``Testing_Area.tscn``de façon à ce que nous puissions le changer depuis la scène.
ja: ``testing_area_scene``: ``Testing_Area.tscn`` ファイルへのパスなので、このシーンから変更できます。
zh_cn: ``testing_area_scene``:``Testing_Area.tscn``文件的路径，所以我们可以从这个场景改变它。

source: ``space_level_scene``: The path to the ``Space_Level.tscn`` file, so we can change to it from this scene.
es: ``space_level_scene``: La ruta del archivo ``Space_Level.tscn``, así que podemos cambiarla desde esta escena.
fr: ``space_level_scene``: Le chemin vers le fichier ``Space_Level.tscn`` de façon à ce que nous puissions le modifier depuis la scène.
ja: ``space_level_scene``: ``Space_Level.tscn`` ファイルへのパスなので、このシーンから変更できます。
zh_cn: ``space_level_scene``:``Space_Level.tscn``文件的路径，所以我们可以从这个场景改变它。

source: ``ruins_level_scene``: The path to the ``Ruins_Level.tscn`` file, so we can change to it from this scene.
es: ``ruins_level_scene``: La ruta del archivo ``Ruins_Level.tscn``, así que podemos cambiarla desde esta escena.
fr: ``ruins_level_scene``: Le chemin vers le fichier ``Ruins_Level.tscn`` de façon à ce que nous puissions le modifier depuis la scène.
ja: ``ruins_level_scene``: ``Ruins_Level.tscn`` ファイルへのパスなので、このシーンから変更できます。
zh_cn: ``ruins_level_scene``:``Ruins_Level.tscn``文件的路径，所以我们可以从这个场景改变它。

source: You'll have to set the paths to the correct files in the editor before testing this script! Otherwise it will not work!
es: ¡Tendrás que establecer las rutas de los archivos correctos en el editor antes de probar este script! ¡De lo contrario no funcionará!
fr: Vous devrez entrer les bons chemins d'accès aux bons fichiers dans l'éditeur avant de tester ce script ! Sinon, ça ne marchera pas !
ja: このスクリプトをテストする前に、エディタで正しいファイルへのパスを設定する必要があります！ それ以外の場合は動作しません！
zh_cn: 在测试此脚本之前，您必须在编辑器中设置正确文件的路径！ 否则它将无法正常工作！

source: Now let's go over ``_ready``
es: Ahora vamos a repasar el ``_ready``
fr: Maintenant, voyons ce que fait ``_ready``
ja: さあ、\ ``_ready`` を見てみましょう
zh_cn: 现在让我们回顾一下 ``_ready``

source: Firstly, we get all the :ref:`Panel <class_Panel>` nodes and assign them to the proper variables.
es: Primero, obtenemos todos los nodos :ref:`Panel <class_Panel>` y los asignamos a las variables correspondientes.
fr: Tout d'abord, nous récupérons tous les nœuds :ref:`Panel <class_Panel>` et nous les assignons aux bonnes variables.
ja: まず、すべての :ref:`Panel <class_Panel>` ノードを取得し、適切な変数に割り当てます。

source: Next, we connect all the buttons ``pressed`` signals to their respective ``[panel_name_here]_button_pressed`` functions.
es: A continuación, conectamos todas las señales de los botones ``pressed`` a sus respectivas funciones ``[panel_name_here]_button_pressed``.
fr: Ensuite, nous connectons tous les signaux ``pressed`` de boutons à leur fonction respectives ``[nom_panneau_ici]_button_pressed``.
ja: 次に、すべてのボタンの ``pressed`` シグナルをそれぞれの ``[ここはにはパネル名が入る]_button_pressed`` 関数に接続します。

source: We then set the mouse mode to ``MOUSE_MODE_VISIBLE`` to ensure whenever the player returns to this scene, the mouse will be visible.
es: Luego ponemos el modo del ratón a ``MOUSE_MODE_VISIBLE`` para asegurarnos de que siempre que el jugador regrese a esta escena, el ratón estará visible.
fr: Nous assignons ensuite ``MOUSE_MODE_VISIBLE`` au nœud de la souris pour s'assurer que quand le joueur retourne sur cette scène, la souris soit visible.
ja: 次に、マウスモードを ``MOUSE_MODE_VISIBLE`` に設定して、プレイヤーがこのシーンに戻るたびにマウスが表示されるようにします。

source: Then we get a singleton, called ``Globals``. We then set the values for the :ref:`HSlider <class_HSlider>` nodes so their values line up with the mouse and joypad sensitivity in the singleton.
es: Luego tenemos un singleton, llamado ``Globals``. A continuación establecemos los valores para los nodos :ref:`HSlider <class_HSlider>` de forma que sus valores se alineen con la sensibilidad del ratón y el joypad en el singleton.
fr: Nous récupérons ensuite un singleton appelé ``Globals``. On assigne ensuite des valeurs aux nœuds :ref:`HSlider <class_HSlider>` pour que leur valeurs correspondent à celles de la sensibilité de la souris et des contrôleurs dans le singleton.
ja: 次に、\ ``Globals`` と呼ばれるシングルトンを取得します。次に、\ :ref:`HSlider <class_HSlider>` ノードの値を設定し、その値がシングルトンのマウスとジョイパッドの感度と一致するようにします。
zh_cn: 然后我们得到一个叫做“Globals”的单例人士。 然后我们设置 :ref:`HSlider <class_HSlider>` 节点的值，使它们的值与单例中的鼠标和游戏手柄灵敏度对齐。

source: We have not made the ``Globals`` singleton yet, so don't worry! We're going to make it soon!
es: Aún no hemos hecho el singleton ``Globals``, así que no te preocupes! ¡Vamos a hacerlo pronto!
fr: Nous n'avons pas encore créé le singleton ``Globals``, pas de panique ! Nous allons le faire bientôt !
ja: まだ ``Globals`` シングルトンを作成していませんが、心配しないでください！ 私たちはすぐにそれを作るつもりです！
zh_cn: 我们还没有制作 ``Globals`` 单例，所以不用担心！ 我们很快就会成功！

source: In ``start_menu_button_pressed``, we check to see which button is pressed.
es: En ``start_menu_button_pressed``, comprobamos qué botón está pulsado.
fr: Dans ``start_menu_button_pressed``, on vérifie quel bouton a été appuyé.
ja: ``start_menu_button_pressed`` では、どのボタンが押されているかを確認します。

source: Based on the button pressed, we either change the currently visible panel, quit the application, or open the Godot website.
es: Basándonos en el botón pulsado, cambiamos el panel actualmente visible, salimos de la aplicación, o abrimos la página web de Godot.
fr: En se basant sur le bouton appuyé, soit nous changeons le panneau actuellement visible, soit on quitte l'application, soit on ouvre le site web de Godot.
ja: 押されたボタンに基づいて、現在表示されているパネルを変更するか、アプリケーションを終了するか、Godot Webサイトを開きます。
zh_cn: 根据按下的按钮，我们要么更改当前可见的面板，退出应用程序，要么打开Godot网站。

source: In ``level_select_menu_button_pressed``, we check to see which button is pressed.
es: En ``level_select_menu_button_pressed``, comprobamos qué botón está pulsado.
fr: Dans ``level_select_menu_button_pressed``, on vérifie quel bouton a été appuyé.
ja: ``level_select_menu_button_pressed`` で、どのボタンが押されているかを確認します。
zh_cn: 在 ``level_select_menu_button_pressed`` 中，我们检查按下了哪个按钮。

source: If the ``back`` button has been pressed, we change the currently visible panels to return to the main menu.
es: Si se ha pulsado el botón ``back``, cambiamos los paneles actualmente visibles para volver al menú principal.
fr: Si le bouton ``back`` a été appuyé, on change les panneaux visibles pour retourner au menu principal.
ja: ``back`` ボタンが押された場合、現在表示されているパネルを変更してメインメニューに戻ります。
zh_cn: 如果按下“后退”按钮，我们会更改当前可见的面板以返回主菜单。

source: If one of the scene changing buttons is pressed, we fist call ``set_mouse_and_joypad_sensitivity`` so the singleton (``Globals.gd``) has the values from the :ref:`HSlider <class_HSlider>` nodes. Then, we tell the singleton to change nodes using its ``load_new_scene`` function, passing in the file path of the scene the player has selected.
es: Si se pulsa uno de los botones de cambio de escena, llamaremos primero a ``set_mouse_and_joypad_sensitivity`` para que el singleton (``Globals.gd``) tenga los valores de los nodos :ref:`HSlider <class_HSlider>`. Luego le decimos al singleton que cambie los nodos usando su función ``load_new_scene``, pasando la ruta del archivo de la escena que el jugador ha seleccionado.
fr: Si un des boutons de changement de scène est appuyé, on commence par appeller ``set_mouse_and_joypad_sensitivity`` pour que le singleton (``Globals.gd``) ait les valeurs depuis les nœuds :ref:`HSlider <class_HSlider>`. Ensuite, nous demandons au singleton de changer ses nœuds en utilisant la fonction ``load_new_scene`` et en passant en paramètre le chemin d'accès à la scène que le joueur a demandé.
ja: シーン変更ボタンのいずれかが押された場合、最初に ``set_mouse_and_joypad_sensitivity`` を呼び出すので、シングルトン(``Globals.gd``)は :ref:`HSlider <class_HSlider>` ノードからの値を持ちます。 次に、シングルトンに ``load_new_scene`` 関数を使用してノードを変更し、プレイヤーが選択したシーンのファイルパスを渡します。

source: Don't worry about the singleton, we'll get there soon!
es: No te preocupes por el singleton ¡Llegaremos pronto!
fr: Ne vous inquiétez pas pour le singleton, nous allons y venir !
ja: シングルトンについては心配しないでください、すぐにそこへ到着します！
zh_cn: 不要担心单例人士，我们很快就会到达那里！

source: In ``options_menu_button_pressed``, we check to see which button is pressed.
es: En ``options_menu_button_pressed``, comprobamos qué botón está pulsado.
fr: Dans ``options_menu_button_pressed``, on vérifie quel bouton est appuyé.
ja: ``options_menu_button_pressed`` で、どのボタンが押されているかを確認します。
zh_cn: 在 ``options_menu_button_pressed`` 中，我们检查按下了哪个按钮。

source: If the ``fullscreen`` button is pressed, we toggle the :ref:`OS <class_OS>`'s full screen mode by setting it to the flipped version of its current value.
es: Si se presiona el botón de ``fullscreen``, cambiamos el modo de pantalla completa de :ref:`OS <class_OS>` ajustándolo a la versión volteada de su valor actual.
fr: Si le bouton ``fullscreen`` est appuyé, on active/désactive le mode plein écran de :ref:`OS <class_OS>`en lui attribuant la valeur inverse de sa valeur actuelle.
ja: ``fullscreen`` ボタンが押された場合、\ :ref:`OS <class_OS>` のフルスクリーンモードを、現在のモードと逆のモードに設定することで切り替えます。

source: If the ``vsync`` button is pressed, we set the :ref:`OS <class_OS>`'s Vsync based on the state of the Vsync check button.
es: Si se pulsa el botón ``vsync``, establecemos el :ref:`OS <class_OS>`'s Vsync basado en el estado del botón de comprobación de Vsync.
fr: Si le bouton ``vsync`` est appuyé, on active/désactive le mode vsync de :ref:`OS <class_OS>`en fonction du statut actuel du bouton de Vsync.
ja: ``vsync`` ボタンが押されると、Vsyncチェックボタンの状態に基づいて :ref:`OS <class_OS>` のVsyncを設定します。

source: Finally, lets take a look at ``set_mouse_and_joypad_sensitivity``.
es: Por último, echemos un vistazo a ``set_mouse_and_joypad_sensitivity``.
fr: Enfin, on jette un œil à ``set_mouse_and_joypad_sensitivity``.
ja: 最後に、\ ``set_mouse_and_joypad_sensitivity`` を見てみましょう。
zh_cn: 最后，让我们来看看 ``set_mouse_and_joypad_sensitivity`` 。

source: Firstly, we get the ``Globals`` singleton and assign it to a local variable.
es: Primero obtenemos el singleton ``Globals`` y lo asignamos a una variable local.
fr: Tout d'abord, on récupère le singleton ``Globals`` et on l'assigne à une variable locale.
ja: まず、\ ``Globals`` シングルトンを取得し、ローカル変数に割り当てます。

source: We then set the ``mouse_sensitivity`` and ``joypad_sensitivity`` variables to the values in their respective :ref:`HSlider <class_HSlider>` node counterparts.
es: Luego ponemos las variables ``mouse_sensitivity`` y ``joypad_sensitivity`` a los valores de sus respectivos nodos :ref:`HSlider <class_HSlider>`.
fr: On assigne ensuite aux variables ``mouse_sensitivity`` et ``joypad_sensitivity`` aux valeurs dans leur homologues :ref:`HSlider <class_HSlider>` respectifs.
ja: 次に、\ ``mouse_sensitivity`` および ``joypad_sensitivity`` 変数を、それぞれの :ref:`HSlider <class_HSlider>` ノードの対応する値に設定します。
zh_cn: 然后我们将 ``mouse_sensitivity`` 和``joypad_sensitivity``变量设置为它们各自的值 :ref:`HSlider <class_HSlider>` 节点对应物。

source: Making the ``Globals`` singleton
es: Haciendo el singleton ``Globals``
fr: Créer le singleton ``Globals``
ja: ``Globals`` シングルトンを作る
zh_cn: 使 ``Globals`` 单例

source: Now, for all this to work, we need to create the ``Globals`` singleton. Make a new script in the ``Script`` tab and call it ``Globals.gd``.
es: Ahora, para que todo esto funcione necesitamos crear el singleton ``Globals``. Crea un nuevo script en la pestaña ``Script`` y llámalo ``Globals.gd``.
fr: Maintenant, pour que tout ceci fonctionne, nous devons créer le singleton ``Globals``. Créez un nouveau script dans l'onglet ``Script`` et appelez le ``Globals.gd``.
ja: さて、これがすべて機能するためには、\ ``Globals`` シングルトンを作成する必要があります。\ ``Script``タブで新しいスクリプトを作成し、\ ``Globals.gd`` と呼びます。

source: To make the ``Globals`` singleton, go to the ``Script`` tab in the editor, then click ``New`` and a ``Create Script`` box will appear, leave everything unchanged except for the ``Path`` where you need to insert the script's name ``Globals.gd``.
es: Para hacer el singleton de ``Globals``, ve a la pestaña ``Script`` en el editor, luego haz clic en ``New`` y aparecerá una caja de ``Create Script``, deja todo sin cambios excepto la ``Path`` donde necesitas insertar el nombre del script ``Globals.gd``.
fr: Pour créer le singleton ``Globals``, allez dans l'onglet ``Script`` de l'éditeur, sélectionnez ensuite ``New`` et une boîte ``Create Script`` va apparaître. Ne changez rien à part ``Path`` où nous allons insérer le nom du script ``Globals.gd``.
ja: ``Globals`` シングルトンを作成するには、エディタの ``Script`` タブに移動し、\ ``新規スクリプト`` をクリックすると ``スクリプト作成`` ボックスが表示されます。 スクリプト名 ``Globals.gd`` を挿入する必要がある ``パス`` 以外は変更しないでください。
zh_cn: 要制作 ``Globals`` 单例，请转到编辑器中的 ``Script`` 选项卡，然后单击 ``New`` 并出现一个``Create Script``框，除了`` 路径``您需要插入脚本名称``Globals.gd``。

source: Add the following to ``Globals.gd``.
es: Añade lo siguiente a ``Globals.gd``.
fr: Ajoutez ce qui suit à ``Globals.gd``.
ja: ``Globals.gd`` に以下を追加します。
zh_cn: 将以下内容添加到 ``Globals.gd`` 中。

source: As you can see, it's quite small and simple. As this part progresses, we will keep adding more complex logic to ``Globals.gd``, but for now, all it is doing is holding two class variables, and abstract defining how we change scenes.
es: Como puedes ver, es bastante pequeño y simple. A medida que esta parte avance, seguiremos añadiendo una lógica más compleja a ``Globals.gd``, pero por ahora, todo lo que está haciendo es mantener dos variables de clase, y definir de forma abstracta cómo cambiamos de escena.
fr: Comme vous pouvez le voir, c'est court et simple. Au fur et à mesure que cette partie progresse, nous allons continuer d'ajouter de la logique plus complexe dans ``Globals.gd``, mais pour l'heure, tout ce que ce singleton fait, c'est contenir deux variables de classe et définir de manière abstraite comment nous changeons de scènes.
ja: ご覧のとおり、非常に小さくシンプルです。 この部分が進むにつれて、\ ``Globals.gd`` にさらに複雑なロジックを追加し続けますが、現時点では、2つのクラス変数を保持し、シーンの変更方法を抽象的に定義するだけです。

source: ``mouse_sensitivity``: The current sensitivity for our mouse, so we can load it in ``Player.gd``.
es: ``mouse_sensitivity``: La sensibilidad actual de nuestro ratón, para que podamos cargarla en ``Player.gd``.
fr: ``mouse_sensitivity``: La sensibilité actuelle de notre souris, afin que nous puissions la charger dans``Player.gd``.
ja: ``mouse_sensitivity``: マウスの現在の感度です。これを ``Player.gd`` で読み込むことができます。
zh_cn: ``mouse_sensitivity``:我们鼠标的当前灵敏度，所以我们可以在 ``Player.gd`` 中加载它。

source: ``joypad_sensitivity``: The current sensitivity for our joypad, so we can load it in ``Player.gd``.
es: ``joypad_sensitivity``: La sensibilidad actual de nuestro joypad, para que podamos cargarlo en``Player.gd``.
fr: ``joypad_sensitivity``: La sensibilité actuelle de notre contrôleur, afin que nous puissions la charger dans ``Player.gd``.
ja: ``joypad_sensitivity``: ジョイパッドの現在の感度です。これを ``Player.gd`` で読み込むことができます。
zh_cn: ``joypad_sensitivity``:我们游戏手柄的当前灵敏度，所以我们可以在 ``Player.gd`` 中加载它。
