Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_six.po
Languages: es, fr, ja, zh_cn

source: ``dead_time``: A variable to track how long the player has been dead.
es: ``dead_time``: Una variable para saber cuánto tiempo lleva muerto el jugador.
fr: ``dead_time``: Une variable pour suivre depuis combien de temps le joueur est mort.
ja: ``dead_time``: プレイヤーがどれくらいの時間死んでいるかを追跡する変数。
zh_cn: ``dead_time``:一个跟踪游戏角色死亡时间的变量。

source: ``is_dead``: A variable to track whether or not the player is currently dead.
es: ``is_dead``: Una variable para saber si el jugador está muerto o no.
fr: ``is_dead``: Une variable pour savoir actuellement si le joueur est mort ou non.
ja: ``is_dead``: プレイヤーが現在死んでいるかどうかを追跡する変数。
zh_cn: ``is_dead``:一个跟踪游戏角色当前是否死亡的变量。

source: ``globals``: A variable to hold the ``Globals.gd`` singleton.
es: ``globals``: Una variable para contener el singleton ``Globals.gd``.
fr: ``globals``: Une variable pour stocker le singleton ``Globals.gd``.
ja: ``globals``: ``Globals.gd`` シングルトンを保持する変数。
zh_cn: ``globals``:一个变量来保存 ``Globals.gd`` 单例。

source: We now need to add a couple lines to ``_ready``, so we can use ``Globals.gd`` in ``Player.gd``. Add the following to ``_ready``:
es: Ahora necesitamos añadir un par de líneas a ``_ready``, para poder usar ``Globals.gd`` en ``Player.gd``. Añade lo siguiente a ``_ready``:
fr: Nous devons maintenant ajouter quelques lignes à ``_ready``, de façon à pouvoir utiliser ``Globals.gd`` dans ``Player.gd``. Ajoutez ce qui suit dans ``_ready`` :
ja: ``_ready`` に数行を追加する必要があります。それにより、\ ``Player.gd`` で ``Globals.gd`` が使用できます。以下を ``_ready`` に追加します:
zh_cn: 我们现在需要在 ``_ready`` 中添加几行，所以我们可以在 ``Player.gd`` 中使用 ``Globals.gd`` 。 将以下内容添加到 ``_ready``:

source: Now we're getting the ``Globals.gd`` singleton and assigning it to ``globals``. We also set the player's global position by setting the origin in the player's global :ref:`Transform <class_Transform>` to the position returned by ``globals.get_respawn_position``.
es: Ahora obtenemos el singleton ``Globals.gd`` y lo asignamos a ``globals``. También establecemos nuestra posición global usando el origen de nuestro :ref:`Transform <class_Transform>` a la posición devuelta por ``globals.get_respawn_position``.
fr: Nous allons maintenant récupérer le singleton ``Globals.gd`` et l'assigner à ``globals``. On définit aussi la position globale du joueur en mettant son origine dans le :ref:`Transform <class_Transform>` global du joueur à la position renvoyé par ``globals.get_respawn_position``.
ja: これで、\ ``Globals.gd`` シングルトンを取得し、それを ``globals`` に割り当てています。また、プレイヤーのグローバル :ref:`Transform <class_Transform>` の原点を ``globals.get_respawn_position`` によって返される位置に設定することにより、プレイヤーのグローバル位置を設定します。
zh_cn: 现在我们得到 ``Globals.gd`` 单例并将其分配给 ``globals``。 我们还通过在游戏角色的全局中设置原点来设置游戏角色的全局位置 :ref:`Transform <class_Transform>` 到 ``globals.get_respawn_position`` 返回的位置。

source: Don't worry, we will be adding ``get_respawn_position`` further below!
es: No te preocupes, añadiremos ``get_respawn_position`` más abajo!
fr: Ne vous inquiétez pas, nous ajouterons ``get_respawn_position`` un petit peu plus bas !
ja: 心配しないでください、さらに下で ``get_respawn_position`` を追加します！
zh_cn: 别担心，我们将在下面添加“get_respawn_position`”！

source: Next, we need to make a few changes to ``_physics_process``. Change ``_physics_process`` to the following:
es: A continuación, tenemos que hacer algunos cambios en el ``_physics_process``. Cambiar ``_physics_process`` a lo siguiente:
fr: Ensuite, nous avons besoin d'apporter quelques modifications à ``_physics_process``. Changez ``_physics_process`` en ce qui suit :
ja: 次に、 ``_physics_process`` にいくつかの変更を加える必要があります。\ ``_physics_process`` を次のように変更します:

source: Now the player will not be processing input or movement input when the player is dead. We are also now calling ``process_respawn``.
es: Ahora el jugador no procesará la entrada o el movimiento de entrada cuando el jugador esté muerto. También estamos llamando ahora a ``process_respawn``.
fr: À présent, le joueur ne va plus interpréter les commandes de mouvement ou d'action quand celui-ci sera mort. Nous appelons maintenant également ``process_respawn``.
ja: プレイヤーが死亡した場合、プレイヤーは入力または移動入力を処理しません。また、死亡中は ``process_respawn`` を呼び出しています。
zh_cn: 现在，当游戏角色死亡时，游戏角色将不会处理输入或移动输入。 我们现在也在调用 ``process_respawn`` 。

source: The ``if !is_dead:`` expression is equivalent and works in the same way as the expression ``if is_dead == false:``. And by removing the ``!`` sign from the expression we obtain the opposite expression ``if is_dead == true:``. It is just a shorter way of writing the same code functionality.
es: La expresión ``if !is_dead:`` es equivalente y funciona de la misma manera que la expresión ``if is_dead == false:``. Y eliminando el signo ``!`` de la expresión obtenemos la expresión opuesta ``if is_dead == true:``. Es una forma más corta de escribir la misma funcionalidad del código.
fr: L'expression ``if !is_dead:`` est équivalente et fonctionne de la même façon que l'expression ``if is_dead == false:``. En enlevant le signe ``!`` de l'expression, on obtient l'expression opposée ``if is_dead == true:``. C'est simplement une façon plus compacte d'écrire la même fonctionnalité.
ja: ``if !is_dead:`` 式は比較であり、\ ``if is_dead == false:`` 式 と同じように機能します。そして、式から ``! `` 記号を削除すると、反対の式 ``if is_dead == true:`` が得られます。これは、同じコード機能を記述する短い方法です。

source: We have not made ``process_respawn`` yet, so let's change that.
es: No hemos hecho ``process_respawn`` todavía, así que cambiemos eso.
fr: Nous n'avons pas encore écrit ``process_respawn``. Changeons cela maintenant.
ja: まだ ``process_respawn`` を作成していないので、その変更をしましょう。
zh_cn: 我们还没有制作 ``process_respawn`` ，所以让我们改变它。

source: Let's add ``process_respawn``. Add the following to ``Player.gd``:
es: Añadamos ``process_respawn``. Añade lo siguiente a ``Player.gd``:
fr: Ajoutez ce qui suit à ``Player.gd`` :
ja: ``process_respawn`` を追加しましょう。以下を ``Player.gd`` に追加します:
zh_cn: 让我们添加 ``process_respawn`` 。 将以下内容添加到``Player.gd``:

source: Let's go through what this function is doing.
es: Repasemos lo que está haciendo esta función.
fr: Passons en revue ce que fait cette fonction.
ja: この関数の動作を見てみましょう。
zh_cn: 让我们来看看这个功能正在做什么。

source: Firstly, we check whether the player has just died by checking if ``health`` is less than or equal to ``0`` and ``is_dead`` is ``false``.
es: En primer lugar, comprobamos si el jugador acaba de morir comprobando si ``health`` es menor o igual a ``0`` y ``is_dead`` es ``falso``.
fr: Tout d'abord, on vérifie si le joueur vient de mourir en vérifiant si ``health``est inférieur ou égal à ``0`` et si ``is_dead`` est ``false``.
ja: 最初に、\ ``health`` が ``0`` 以下であり、\ ``is_dead`` が ``false`` であるかどうかを確認することにより、プレイヤーが死亡したかどうかを確認します。
zh_cn: 首先，我们通过检查``health``是否等于或小于``0``并且``is_dead``是``false``来检查游戏角色是否刚刚死亡。

source: If the player has just died, we disable the collision shapes for the player. We do this to make sure the player is not blocking anything with their dead body.
es: Si el jugador acaba de morir, deshabilitamos las formas de colisión para el jugador. Hacemos esto para asegurarnos de que el jugador no bloquee nada con su cadáver.
fr: Si le joueur vient de mourir, on désactive les collision shapes du joueur. On fait cela pour s'assurer que le joueur ne bloque rien avec son cadavre.
ja: プレイヤーが死亡したばかりの場合、プレイヤーのコリジョンシェイプを無効にします。これは、プレイヤーが死体で何かをブロックしていないことを確認するために行います。
zh_cn: 如果游戏角色刚刚去世，我们会禁用游戏角色的碰撞形状。 我们这样做是为了确保游戏角色不会用尸体挡住任何东西。

source: Next, we set ``changing_weapon`` to ``true`` and set ``changing_weapon_name`` to ``UNARMED``. This is so, if the player is using a weapon, it is put away when they dies.
es: Luego, ponemos ``changing_weapon`` a ``true`` y ponemos ``changing_weapon_name`` en ``UNARMED``. Esto es así, si el jugador está usando un arma, se guarda cuando muere.
fr: Ensuite, on assigne ``true`` à ``changing_weapon`` ainsi que ``UNARMED`` à ``changing_weapon_name``. Nous faisons cela pour que si le joueur utilise une arme, elle sera mise de côté quand il meurt.
ja: 次に、\ ``changing_weapon`` を ``true`` に設定し、\ ``changing_weapon_name`` を ``UNARMED`` に設定します。そのため、プレイヤーが武器を使用している場合は、プレイヤーが死んだときに片付けられます。

source: We then make the ``Death_Screen`` :ref:`ColorRect <class_ColorRect>` visible so the player gets a nice grey overlay over everything when they have died. We then make the rest of the UI, the ``Panel`` and ``Crosshair`` nodes, invisible.
es: Luego hacemos la ``Death_Screen`` :ref:`ColorRect <clase_ColorRect>` visible para que el jugador obtenga una bonita capa gris sobre todo cuando haya muerto. Luego hacemos el resto de la interfaz de usuario, los nodos ``Panel`` y "Crosshair", invisibles.
fr: On rend ensuite le :ref:`ColorRect <class_ColorRect>` ``Death_Screen`` visible afin que le joueur ait un bel écran gris au dessus de tout le reste quand il meurt.On rend ensuite le reste de l'UI, les nœuds ``Panel`` et ``Crosshair`` invisibles.
ja: 次に、\ ``Death_Screen`` :ref:`ColorRect <class_ColorRect>` を表示して、プレイヤーが死亡したときにすべての上にグレーのオーバーレイが表示されるようにします。次に、残りのUIである ``Panel`` および ``Crosshair`` ノードを非表示にします。
zh_cn: 然后我们制作``Death_Screen`` :ref:`ColorRect <class_ColorRect>` 可见，这样当游戏角色死亡时，游戏角色会得到漂亮的灰色覆盖。 然后我们制作UI的其余部分， ``Panel`` 和``Crosshair``节点，看不见。

source: Next, we set ``dead_time`` to ``RESPAWN_TIME`` so we can start counting down how long the player has been dead. We also set ``is_dead`` to ``true`` so we know the player has died.
es: A continuación, ponemos ``dead_time`` en ``RESPAWN_TIME`` para que podamos empezar la cuenta atrás del tiempo que el jugador ha estado muerto. También ponemos ``is_dead`` a ``true`` para saber que el jugador ha muerto.
fr: On assigne alors ``RESPAWN_TIME`` à ``dead_time`` de façon à ce que le compte à rebours de « depuis quand le joueur est mort » démarre. On assigne aussi ``true`` à ``is_dead`` pour qu'on sache que le joueur est mort.
ja: 次に、\ ``dead_time`` を ``RESPAWN_TIME`` に設定して、プレイヤーが死んでいる時間のカウントダウンを開始できるようにします。また、\ ``is_dead`` を ``true`` に設定して、プレイヤーが死亡したことを確認します。

source: If the player is holding an object when they died, we need to throw it. We first check whether the player is holding an object or not. If the player is holding a object, we throw it using the same code as the throwing code we added in :ref:`doc_fps_tutorial_part_five`.
es: Si el jugador tiene un objeto en la mano cuando murió, tenemos que tirarlo. Primero comprobamos si el jugador está sosteniendo un objeto o no. Si el jugador está sosteniendo un objeto, lo lanzamos usando el mismo código de lanzamiento que añadimos en :ref:`doc_fps_tutorial_part_five`.
fr: Si le joueur tient un objet quand il meurt, nous devons le jeter. On vérifie d'abord si le joueur tient un objet dans sa main ou non. Si c'est le cas, on jette cet objet en utilisant le même code que nous avons ajouté dans la :ref:`doc_fps_tutorial_part_five`.
ja: プレイヤーが死亡したときにオブジェクトを保持している場合、それを投げる必要があります。まず、プレイヤーがオブジェクトを持っているかどうかを確認します。プレイヤーがオブジェクトを保持している場合は、\ :ref:`doc_fps_tutorial_part_five` で追加したスローコードと同じコードを使用してオブジェクトをスローします。

source: The ``\n`` combination from the expression ``You have died\n`` is a command used to display the text following after it on a new line below. This is always useful when you want to nicely group displayed text in multiple lines so it looks better and is more readable by the players of your games.
es: La combinación ``\n`` de la expresión ``You have died\n`` es un comando usado para mostrar el texto que sigue a continuación en una nueva línea. Esto es siempre útil cuando quieres agrupar el texto mostrado en varias líneas para que se vea mejor y sea más legible para los jugadores de tus juegos.
fr: La ``\n`` combination from the expression ``You have died\n`` est une commande utilisée pour afficher un texte suivi d'une nouvelle ligne en dessous. C'est toujours utile quand vous voulez des textes bien répartis en groupes de plusieurs lignes pour qu'il soit plus beau et plus lisible pour les joueurs de votre jeu.
ja: 表現 ``You have died\n`` の ``\n`` の組み合わせは、以下の新しい行に続くテキストを表示するために使用されるコマンドです。これは、表示されたテキストを複数の行にうまくグループ化する場合に常に役立ちます。これにより、見栄えが良くなり、ゲームのプレーヤーが読みやすくなります。

source: Then we check whether the player is dead. If so, we then remove ``delta`` from ``dead_time``.
es: Entonces comprobamos si el jugador está muerto. Si es así, entonces quitamos ``delta`` del ``dead_time``.
fr: On vérifie alors si le joueur est mort ou non. Si c'est le cas, on retire alors ``delta`` de ``dead_time``.
ja: 次に、プレイヤーが死んでいるかどうかを確認します。その場合、\ ``dead_time`` から ``delta`` を減らします。

source: We then make a new variable called ``dead_time_pretty``, where we convert ``dead_time`` to a string, using only the first three characters starting from the left. This gives the player a nice looking string showing how much time the player has left to wait before the player can respawn.
es: Luego hacemos una nueva variable llamada ``dead_time_pretty``, donde convertimos ``dead_time`` en una string, usando sólo los tres primeros caracteres que empiezan por la izquierda. Esto le da al jugador una string de aspecto agradable que muestra cuánto tiempo le queda de espera antes de que el jugador pueda volver a aparecer.
fr: On créer alors une nouvelle variable appelée ``dead_time_pretty``, où nous convertissons ``dead_time`` en string en utilisant les trois premiers caractères en partant de la gauche. Cela donne au joueur une joli chaîne de caractères sur le temps qu'il lui reste avant de pouvoir réapparaître.
ja: 次に、\ ``dead_time_pretty`` という新しい変数を作成します。この変数では、\ ``dead_time`` を文字列に変換し、左から最初の3文字のみを使用します。これにより、プレイヤーが再出現できるようになるまでにプレイヤーが待機する時間を示す、見栄えの良い文字列が得られます。
zh_cn: 然后我们创建一个名为 ``dead_time_pretty`` 的新变量，我们将 ``dead_time`` 转换为字符串，只使用从左边开始的前三个字符。 这为游戏角色提供了一个漂亮的字符串，显示游戏角色在游戏角色重生之前需要等待多长时间。

source: We then change the :ref:`Label <class_Label>` in ``Death_Screen`` to show how much time the player has left.
es: Luego cambiamos el :ref:`Label <class_Label>` en ``Death_Screen`` para mostrar cuánto tiempo le queda al jugador.
fr: On change alors le :ref:`Label <class_Label>` dans ``Death_Screen`` pour montrer combien de temps il reste au joueur.
ja: 次に、\ ``Death_Screen`` の :ref:`Label <class_Label>` を変更して、プレイヤーが残した時間を表示します。
zh_cn: 然后我们在``Death Screen``中更改 :ref:`Label <class Label>` 来显示游戏角色离开的时间。

source: Next we check to see if the player has waited long enough and can respawn. We do this by checking to see if ``dead_time`` is ``0`` or less.
es: A continuación comprobamos si el jugador ha esperado lo suficiente y puede volver a aparecer. Lo hacemos comprobando si el ``dead_time`` es ``0`` o menos.
fr: Nous vérifions ensuite si le joueur a attendu suffisamment longtemps pour pouvoir réapparaître. On fait cela en vérifiant si ``dead_time`` est égal à ``0`` ou moins.
ja: 次に、プレイヤーが十分に待機して再出現できるかどうかを確認します。これを行うには、\ ``dead_time`` が ``0`` 以下かどうかを確認します。
zh_cn: 接下来我们检查游戏角色是否已经等待足够长时间并且可以重生。 我们通过检查 ``dead_time`` 是否为“0”或更少来做到这一点。

source: If the player has waited long enough to respawn, we set the player's position to a new respawn position provided by ``get_respawn_position``.
es: Si el jugador ha esperado lo suficiente para reaparecer, ponemos la posición del jugador en una nueva posición de reaparición proporcionada por ``get_respawn_position``.
fr: Si le joueur a attendu suffisamment longtemps, on met la position du joueur à une nouvelle position de réapparition fournie par ``get_respawn_position``.
ja: プレイヤーが再出現するのに十分な時間待機している場合、プレイヤーの位置を ``get_respawn_position`` によって提供される新しい再出現位置に設定します。
zh_cn: 如果游戏角色等待足够长时间重生，我们将游戏角色的位置设置为“get_respawn_position”提供的新重生位置。

source: We then enable both of the player's collision shapes so the player can collide again with the environment.
es: Luego habilitamos las dos formas de colisión del jugador para que pueda colisionar de nuevo con el entorno.
fr: On active alors les deux collision shapes du joueur pour qu'il puisse à nouveau entrer en contact avec l'environnement.
ja: 次に、両方のプレイヤーのコリジョンシェイプを有効にして、プレイヤーが環境と再び衝突できるようにします。
zh_cn: 然后我们启用两个游戏角色的碰撞形状，以便游戏角色可以再次与环境发生碰撞。

source: Next, we make the ``Death_Screen`` invisible and make the rest of the UI, the ``Panel`` and ``Crosshair`` nodes, visible again.
es: Luego, hacemos invisible la ``Death_Screen`` y hacemos el resto de la interfaz de usuario, el ``Panel`` y los nodos de ``Crosshair``, visibles de nuevo.
fr: Ensuite, on rend le ``Death_Screen`` invisible et on rend le reste de l'UI, les nœuds ``Panel`` et ``Crosshair``visibles à nouveau.
ja: 次に、\ ``Death_Screen`` を非表示にし、残りのUI、\ ``Panel`` および ``Crosshair`` ノードを再び表示します。

source: We then go through each weapon and call its ``reset_weapon`` function, which we will add soon.
es: Luego revisamos cada arma y llamamos a su función de ``reset_weapon``, que añadiremos pronto.
fr: On parcours alors chaque arme et on appelle sa fonction ``reset_weapon`` que nous allons ajouter bientôt.
ja: 次に、各武器を調べて、その ``reset_weapon`` 関数を呼び出します。この関数はすぐに追加します。
zh_cn: 然后我们通过每个武器并调用它的 ``reset_weapon`` 函数，我们将很快添加它。

source: Then, we reset ``health`` to ``100``, ``grenade_amounts`` to its default values, and change ``current_grenade`` to ``Grenade``. This effectively resets these variables to their default values.
es: Luego, reajustamos ``health`` a ``100``, ``grenade_amounts`` a sus valores por defecto, y cambiamos ``current_grenade`` a ``Grenade``. Esto efectivamente restablece estas variables a sus valores por defecto.
fr: Ensuite, on réinitialise ``health`` à sa valeur initiale de ``100``, ``grenade_amounts`` de même et ``current_grenade`` à ``Grenade``. Cela ré-initialise complètement les variables à leur état d'origine.
ja: 次に、\ ``health`` を ``100`` にリセットし、\ ``grenade_amounts`` をデフォルト値にリセットし、\ ``current_grenade`` を ``Grenade`` に変更します。これにより、これらの変数がデフォルト値に効果的にリセットされます。

source: Finally, we set ``is_dead`` to ``false``.
es: Por último, ponemos ``is_dead`` a ``false``.
fr: Enfin, on met ``is_dead`` à ``false``.
ja: 最後に、\ ``is_dead`` を ``false`` に設定します。
zh_cn: 最后，我们将 ``is_dead`` 设置为 ``false`` 。

source: Before we leave ``Player.gd``, we need to add one quick thing to ``_input``. Add the following at the beginning of ``_input``:
es: Antes de dejar ``Player.gd``, necesitamos añadir una cosa rápida a ``_input``. Añade lo siguiente al principio de ``_input``:
fr: Avant de quitter ``Player.gd``, nous devons ajouter une dernière petite chose à ``_input``. Ajoutez ce qui suit au début de ``_input`` :
ja: ``Player.gd`` を離れる前に、簡単なことを ``_input`` に追加する必要があります。\ ``_input`` の先頭に次を追加します:
zh_cn: 在我们离开 ``Player.gd`` 之前，我们需要在 ``_input`` 中添加一个快速的东西。 在`_input``的开头添加以下内容:

source: Now, when the player is dead, they cannot look around with the mouse.
es: Ahora, cuando el jugador está muerto, no pueden mirar a su alrededor con el ratón.
fr: Maintenant, quand le joueur est mort, il ne peut plus regarder autour de lui avec la souris.
ja: これで、プレイヤーが死んでいるとき、プレイヤーはマウスで周りを見回すことはできません。

source: Finishing the respawn system
es: Terminando el sistema de resucitación
fr: Terminer le système de réapparition
ja: 再出現システムの終了
zh_cn: 完成重生系统

source: Firstly, let's open ``Weapon_Pistol.gd`` and add the ``reset_weapon`` function. Add the following:
es: Primero, abramos ``Weapon_Pistol.gd`` y agreguemos la función ``reset_weapon``. Añade lo siguiente:
fr: Premièrement, ouvrez ``Weapon_Pistol.gd`` et ajoutez la fonction ``reset_weapon``. Ajoutez ce qui suit :
ja: まず、\ ``Weapon_Pistol.gd`` を開いて、\ ``reset_weapon`` 関数を追加しましょう。以下を追加します:

source: Now, when we call ``reset_weapon``, the ammo in the pistol and the ammo in the spares will be reset to their default values.
es: Ahora, cuando llamemos a ``reset_weapon``, la munición de la pistola y la munición sobrante se restablecerán a sus valores por defecto.
fr: Maintenant, quand nous appelons ``reset_weapon``, les munitions dans le pistolet et les munitions restantes seront réinitialisées.
ja: ``reset_weapon`` を呼び出すと、ピストルの弾薬とスペアの弾薬がデフォルト値にリセットされます。

source: Now let's add ``reset_weapon`` in ``Weapon_Rifle.gd``:
es: Ahora añadamos ``reset_weapon`` en ``Weapon_Rifle.gd``:
fr: Ajoutons maintenant ``reset_weapon`` à ``Weapon_Rifle.gd`` :
ja: ``Weapon_Rifle.gd`` に ``reset_weapon`` を追加しましょう:
zh_cn: 现在让我们在 ``Weapon_Rifle.gd`` 中添加``reset_weapon``:

source: And add the following to ``Weapon_Knife.gd``:
es: Y añadimos lo siguiente a ``Weapon_Knife.gd``:
fr: Et ajoutez ce qui suit à ``Weapon_Knife.gd`` :
ja: そして、以下を ``Weapon_Knife.gd`` に追加します:
zh_cn: 并将以下内容添加到``Weapon_Knife.gd``:

source: Now all the weapons will reset when the player dies.
es: Ahora todas las armas se resetearán cuando el jugador muera.
fr: Maintenant toutes les armes se réinitialiseront quand le joueur meurt.
ja: これで、プレイヤーが死亡するとすべての武器がリセットされます。

source: Now we need to add a few things to ``Globals.gd``. Firstly, add the following class variable:
es: Ahora tenemos que agregar unas cosas más a ``Globals.gd``. Primero agrega la siguiente variable de clase:
fr: Maintenant nous avons besoin d'ajouter des choses à ``Globals.gd``. Tout d'abord, ajouter les variables de classe suivantes :
ja: ここで、\ ``Globals.gd`` にいくつかの項目を追加する必要があります。まず、次のクラス変数を追加します:

source: ``respawn_points``: A variable to hold all the respawn points in a level
es: ``respawn_points``: Una variable para mantener todos los puntos de respawn en el nivel
fr: ``respawn_points``: Une variable utilisée pour stocker tous les points de réapparition du niveau
ja: ``respawn_points``: レベル内のすべてのリスポーンポイントを保持する変数

source: Because we're getting a random spawn point each time, we need to randomize the number generator. Add the following to ``_ready``:
es: Como estamos obteniendo un punto de regeneración al azar cada vez, necesitamos aleatorizar el generador de números. Añade lo siguiente a ``_ready``:
fr: Du fait que nous allons récupérer un point de réapparition aléatoire à chaque fois, nous devons rendre aléatoire le générateur de nombre. Ajoutez ce qui suit à ``_ready`` :
ja: 毎回ランダムな出現ポイントを取得しているため、数値ジェネレーターをランダム化する必要があります。以下を ``_ready`` に追加します:
zh_cn: 因为我们每次都得到一个随机的衍生点，我们需要随机化这个数字生成器。在“_ready”中添加以下内容:

source: ``randomize`` will get us a new random seed so we get a (relatively) random string of numbers when we use any of the random functions.
es: ``randomize`` nos dará una nueva semilla aleatoria para que obtengamos una string de números (relativamente) aleatoria cuando usemos cualquiera de las funciones aleatorias.
fr: ``randomize`` va nous donner un nouveau seed aléatoire de façon à obtenir une chaîne de caractère (relativement) aléatoire quand nous utilisons une fonction de nombres aléatoires.
ja: ``randomize`` は新しいランダムシードを取得するので、任意のランダム関数を使用すると(比較的)ランダムな数字の文字列を取得します。

source: Now let's add ``get_respawn_position`` to ``Globals.gd``:
es: Ahora agreguemos ``get_respawn_position`` a ``Globals.gd``:
fr: Ajoutons maintenant ``get_respawn_position`` à ``Globals.gd`` :
ja: ``get_respawn_position`` を ``Globals.gd`` に追加しましょう:
zh_cn: 现在让我们将 ``get_respawn_position`` 添加到``Globals.gd``:

source: Let's go over what this function does.
es: Repasemos lo que hace esta función.
fr: Regardons son fonctionnement.
ja: この関数の動作について説明します。
zh_cn: 让我们回顾一下这个功能的作用。

source: Firstly, we check if ``Globals.gd`` has any ``respawn_points`` by checking whether ``respawn_points`` is ``null`` or not.
es: Primero, comprobamos si ``Globals.gd`` tiene algún ``respawn_points`` comprobando si ``respawn_points`` es "null" o no.
fr: Premièrement, nous devons vérifier si ``Globals.gd`` a un ``respawn_points`` en vérifiant si ``respawn_points`` est ``null`` ou non.
ja: まず、 ``respawn_points`` が ``null`` であるかどうかを確認することで、\ ``Globals.gd`` に ``respawn_points`` があるかどうかを確認します。

source: If ``respawn_points`` is ``null``, we return a position of empty :ref:`Vector 3 <class_Vector3>` with the position ``(0, 0, 0)``.
es: Si ``respawn_points`` es ``null``, devolvemos una posición vacía, :ref:`Vector 3 <class_Vector3>` con la posición ``(0, 0, 0)``.
fr: Si ``respawn_points`` est ``null``, on retourne la position d'un :ref:`Vector 3 <class_Vector3>` vide avec la position ``(0, 0, 0)``.
ja: ``respawn_points`` が ``null`` の場合、空の :ref:`Vector 3 <class_Vector3>` の位置を ``(0, 0, 0)`` の位置で返します。
zh_cn: 如果 ``respawn_points`` 是``null``，我们返回一个空位置 :ref:`Vector 3 <class_Vector3>` ，位置为``(0,0,0)``。
