Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_six.po
Languages: es, fr, ja, zh_cn

source: If ``respawn_points`` is not ``null``, we then get a random number between ``0`` and the number of elements we have in ``respawn_points``, minus ``1`` since most programming languages, including ``GDScript``, start counting from ``0`` when you are accessing elements in a list.
es: Si ``respawn_points`` no es ``null``, entonces obtenemos un número aleatorio entre ``0`` y el número de elementos que tenemos en ``respawn_points``, menos ``1`` ya que la mayoría de los lenguajes de programación, incluyendo ``GDScript``, comienzan a contar desde ``0`` cuando accedes a los elementos de una lista.
fr: Si ``respawn_points`` n'est pas ``null``, nous devons alors récupérer un nombre aléatoire entre ``0`` et le nombre d'éléments que nous avons dans ``respawn_points``, en enlevant ``1`` puisque la plupart des langages de programmation (``GDScript`` inclut) commencent à compter à partir de ``0`` quand vous accéder à un élément dans une liste.
ja: ``respawn_points`` が ``null`` でない場合、\ ``0`` と要素数の ``respawn_points`` から ``1`` を引いた値との間の乱数を取得します。``GDScript`` を含むほとんどのプログラミング言語が 、リスト内の要素にアクセスするときに ``0`` からカウントを開始します。
zh_cn: 如果' respawn_points ' '不是' null ' '，那么我们就会得到一个介于' 0 ' '和' respawn_points ' ' '中的元素数量之间的随机数，减去' 1 ' '，因为大多数编程语言，包括' GDScript ' ' '，在访问列表中的元素时，都是从' 0 ' '开始计数的。

source: We then return the position of the :ref:`Spatial <class_Spatial>` node at ``respawn_point`` position in ``respawn_points``.
es: Entonces devolvemos la posición del nodo :ref:`Spatial <class_Spatial>` a la posición de ``respawn_point`` en ``respawn_points``.
fr: On renvoie alors la position du nœud :ref:`Spatial <class_Spatial>`à la position ``respawn_point`` dans ``respawn_points``.
ja: 次に、\ ``respawn_points`` の ``respawn_point`` 位置にある :ref:`Spatial <class_Spatial>` ノードの位置を返します。
zh_cn: 然后，我们在 ``respawn_points`` 的``respawn_point``位置返回 :ref:`Spatial <class_Spatial>` 节点的位置。

source: Before we are done with ``Globals.gd``, we need to add the following to ``load_new_scene``:
es: Antes de que terminemos con ``Globals.gd``, necesitamos añadir lo siguiente a ``load_new_scene``:
fr: Avant d'en avoir finit avec ``Globals.gd``, nous devons ajouter ce qui suit à ``load_new_scene`` :
ja: ``Globals.gd`` を完了する前に、\ ``load_new_scene`` に以下を追加する必要があります:

source: We set ``respawn_points`` to ``null`` so when/if the player gets to a level with no respawn points, we do not respawn the player at the respawn points that were in the level prior.
es: Ponemos ``respawn_points`` en ``null`` para que cuando si el jugador llegue a un nivel sin puntos de regeneración, no reaparezca en los puntos de regeneración que estaban en el nivel anterior.
fr: On met ``respawn_points`` à ``null`` pour que quand/si le joueur arrive à un niveau sans point de réapparition, on ne fait pas réapparaître le joueur aux points de réapparition du niveau précédent.
ja: プレイヤーが再出現ポイントのないレベルに到達した場合、またはそのレベルに達した場合、以前のレベルにあった再出現ポイントでプレイヤーが再出現しないように、\ ``respawn_points`` を ``null`` に設定します。
zh_cn: 我们将 ``respawn_points`` 设置为 ``null`` ，所以当/如果游戏角色达到没有重生点的等级时，我们不会在先前等级的重生点重生游戏角色。

source: Now all we need is a way to set the respawn points. Open up ``Ruins_Level.tscn`` and select ``Spawn_Points``. Add a new script called ``Respawn_Point_Setter.gd`` and attach it to ``Spawn_Points``. Add the following to ``Respawn_Point_Setter.gd``:
es: Ahora todo lo que necesitamos es una forma de establecer los puntos de regeneración. Abre ``Ruins_Level.tscn`` y selecciona ``Spawn_Points``. Añade un nuevo script llamado ``Respawn_Point_Setter.gd`` y adjúntalo a ``Spawn_Points``. Añade lo siguiente a ``Respawn_Point_Setter.gd``:
fr: Tout ce dont nous avons besoin maintenant c'est d'une façon de définir les points de réapparition. Ouvrez ``Ruins_Level.tscn`` et sélectionnez ``Spawn_Points``. Ajoutez un nouveau script appelé ``Respawn_Point_Setter.gd`` et attachez le à ``Spawn_Points``. Ajoutez ce qui suit à ``Respawn_Point_Setter.gd`` :
ja: ここで必要なのは、再出現ポイントを設定する方法だけです。\ ``Ruins_Level.tscn`` を開き、\ ``Spawn_Points`` を選択します。\ ``Respawn_Point_Setter.gd`` という新しいスクリプトを追加し、それを ``Spawn_Points`` にアタッチします。以下を ``Respawn_Point_Setter.gd`` に追加します:
zh_cn: 现在我们需要的是一种设置重生点的方法。 打开 ``Ruins_Level.tscn`` 并选择 ``Spawn_Points`` 。 添加一个名为 ``Respawn_Point_Setter.gd`` 的新脚本，并将其附加到 ``Spawn_Points`` 。 将以下内容添加到``Respawn_Point_Setter.gd``:

source: Now, when a node with ``Respawn_Point_Setter.gd`` has its ``_ready`` function called, all the children nodes of the node with ``Respawn_Point_Setter.gd``, ``Spawn_Points`` in the case of ``Ruins_Level.tscn``, will be added to ``respawn_points`` in ``Globals.gd``.
es: Ahora, cuando un nodo con ``Respawn_Point_Setter.gd`` tiene su función ``_ready`` llamada, todos los nodos hijos del nodo con ``Respawn_Point_Setter.gd``, ``Spawn_Points`` en el caso de ``Ruins_Level.tscn``, serán añadidos a ``respawn_points`` en ``Globals.gd``.
fr: Maintenant, quand un nœud avec ``Respawn_Point_Setter.gd``a sa fonction ``_ready`` appelée , tous les nœuds enfants du nœud avec ``Respawn_Point_Setter.gd``, ``Spawn_Points`` dans le cas de ``Ruins_Level.tscn``, vont être ajoutés aux ``respawn_points`` de ``Globals.gd``.
ja: これで、Respawn_Point_Setter.gdを持つノードの_ready関数が呼び出されると、\ ``Ruins_Level.tscn`` の場合、\ ``Respawn_Point_Setter.gd``\ 、\ ``Spawn_Points`` を持つノードのすべての子ノードが ``Globals.gd`` の ``respawn_points`` に追加されます。

source: Any node with ``Respawn_Point_Setter.gd`` has to be above the player in the :ref:`SceneTree <class_SceneTree>` so the respawn points are set before the player needs them in the player's ``_ready`` function.
es: Cualquier nodo con ``Respawn_Point_Setter.gd`` tiene que estar por encima del jugador en el :ref:`SceneTree <class_SceneTree>` así que los puntos de regeneración se establecen antes de que el jugador los necesite en la función ``_ready`` del jugador.
fr: N'importe quel nœud avec ``Respawn_Point_Setter.gd`` doit être au dessus du joueur dans la :ref:`SceneTree <class_SceneTree>` pour que les points de réapparition soient affectés avant que le joueur en ait besoin dans la fonction ``_ready`` du joueur.
ja: ``Respawn_Point_Setter.gd`` を持つノードは、プレイヤーの ``_ready`` 関数で必要になる前に、再出現ポイントが設定されるように、\ :ref:`SceneTree <class_SceneTree>` 内でプレイヤーより上に位置する必要があります。
zh_cn: 任何带有“Respawn_Point_Setter.gd`”的节点都必须位于 :ref:`SceneTree <class_SceneTree>中的游戏角色上方，所以重新生成的点在游戏角色需要它们在游戏角色的 ``_ready`` 函数之前设置。

source: Now, when the player dies, they will respawn after waiting ``4`` seconds!
es: ¡Ahora, cuando el jugador muera, se resucitará después de esperar ``4`` segundos!
fr: Maintenant, quand un joueur meurt, il va réapparaître après avoir attendu ``4`` secondes !
ja: プレイヤーが死ぬと、\ ``4`` 秒待ってから復活します！

source: No spawn points are already set up for any of the levels besides ``Ruins_Level.tscn``! Adding spawn points to ``Space_Level.tscn`` is left as an exercise for the reader.
es: ¡No hay puntos de generación en ninguno de los niveles, aparte de "Ruins_Level.tscn"! Agregar puntos de generación a "Space_Level.tscn" es un ejercicio para el lector.
fr: Aucun points de réapparition n'ont été mis en place pour les niveaux mise à part pour ``Ruins_Level.tscn`` ! Ajoutez des points de réapparition au ``Space_Level.tscn`` est un exercice qu'on vous laisse faire par vous même.
ja: ``Ruins_Level.tscn`` 以外のレベルの出現ポイントはまだ設定されていません！出現ポイントを ``Space_Level.tscn`` に追加することは、読者の演習として残しておきます。
zh_cn: 除了 ``Ruins_Level.tscn`` 之外，还没有为任何级别设置生成点！ 将生成点添加到“Space_Level.tscn”将留给读者练习。

source: Writing a sound system we can use anywhere
es: Escribir un sistema de sonido que podamos usar en cualquier lugar
fr: Écrire un système de son qui puisse être utilisé partout
ja: どこでも使えるサウンドシステムを書く
zh_cn: 编写一个我们可以随处使用的音响系统

source: Finally, let's make a sound system so we can play sounds from anywhere, without having to use the player.
es: Por último, hagamos un sistema de sonido para que podamos reproducir sonidos de cualquier lugar, sin tener que usar el reproductor.
fr: Enfin, créons un système de son qui puisse jouer des sons de n'importe où, sans avoir à utiliser le joueur.
ja: 最後に、プレイヤーを使用せずにどこからでもサウンドを再生できるように、サウンドシステムを作成しましょう。

source: Firstly, open up ``SimpleAudioPlayer.gd`` and change it to the following:
es: Primero, abre ``SimpleAudioPlayer.gd`` y cambia lo siguiente:
fr: D'abord, ouvrer ``SimpleAudioPlayer.gd`` et changer le comme ce qui suit :
ja: まず、\ ``SimpleAudioPlayer.gd`` を開き、次のように変更します:

source: There are several changes from the old version, first and foremost being we are no longer storing the sound files in ``SimpleAudioPlayer.gd`` anymore. This is much better for performance since we're no longer loading each audio clip when we create a sound, but instead we are forcing an audio stream to be passed in to ``play_sound``.
es: Hay varios cambios con respecto a la versión antigua, en primer lugar ya no estamos almacenando los archivos de sonido en ``SimpleAudioPlayer.gd``. Esto es mucho mejor para el rendimiento ya que ya no estamos cargando cada clip de audio cuando creamos un sonido, sino que estamos forzando a que se pase un flujo de audio a ``play_sound``.
fr: Il y a plusieurs changements par rapport à la version précédente. Premièrement, nous ne stockons plus les fichiers de son dans ``SimpleAudioPlayer.gd``. Cela apporte de bien meilleures performances puisque nous n'avons plus à charger chaque clip audio quand nous créons un son. À la place, on force à passer un flux audio dans ``play_sound``.
ja: 古いバージョンからいくつかの変更点があります。何よりもまず、もはや ``SimpleAudioPlayer.gd`` にサウンドファイルを保存しなくなっています。これは、サウンドを作成するときに各オーディオクリップを読み込むのではなく、代わりにオーディオストリームを ``play_sound`` に強制的に渡すため、パフォーマンスにとってははるかに優れています。
zh_cn: 旧版本有一些变化，首先是我们不再将声音文件存储在 ``SimpleAudioPlayer.gd`` 中。 这对性能要好得多，因为我们在创建声音时不再加载每个音频片段，而是强制将音频流传递到“play_sound”。

source: Another change is we have a new class variable called ``should_loop``. Instead of just destroying the audio player every time it's finished, we instead want to check and see if the audio player is set to loop or not. This allows us to have audio like looping background music without having to spawn a new audio player with the music when the old one is finished.
es: Otro cambio es que tenemos una nueva variable de clase llamada ``should_loop``. En lugar de destruir el reproductor de audio cada vez que se termina, queremos comprobar y ver si el reproductor de audio está configurado para hacer un bucle o no. Esto nos permite tener audio como música de fondo en bucle sin tener que generar un nuevo reproductor de audio con la música cuando el antiguo esté terminado.
fr: Un autre changement est une nouvelle variable de classe appelée ``should_loop``. Au lieu de simplement détruire le lecteur audio quand il a finit de jouer, on vérifie à la place si le lecteur audio est définit comme boucle ou non. Cela va nous permettre de lancer des sons en boucle comme des musiques de fond qui se répètent sans avoir à faire apparaître un nouveau lecteur audio avec la musique quand l'ancien est terminé.
ja: もう1つの変更点は、\ ``should_loop`` という新しいクラス変数があることです。終了するたびにオーディオプレーヤーを破棄する代わりに、オーディオプレーヤーがループするように設定されているかどうかを確認します。これにより、バックグラウンドミュージックのループのようなオーディオを作成できます。古いオーディオプレーヤーが終了したときに、新しいオーディオプレーヤーで音楽を生成する必要はありません。
zh_cn: 另一个变化是我们有一个名为 ``should_loop`` 的新类变量。 我们不是仅在每次完成时销毁音频播放器，而是要检查并查看音频播放器是否设置为循环播放。 这使得我们可以像循环背景音乐那样使用音频，而不必在旧音频播放完成后用音乐生成新的音频播放器。

source: Finally, instead of being instanced/spawned in ``Player.gd``, the audio player is instead going to be spawned in ``Globals.gd`` so we can create sounds from any scene. Now the audio player stores ``Globals.gd`` singleton so when the audio player is destroyed, we can also remove it from a list in ``Globals.gd``.
es: Finalmente, en lugar de ser instanciado/generado en ``Player.gd``, se va a generar en ``Globals.gd`` para que podamos crear sonidos desde cualquier escena. Ahora necesitamos almacenar el singleton ``Globals.gd`` para que cuando destruyamos el reproductor de audio, también lo eliminemos de una lista en ``Globals.gd``.
fr: Enfin, à la place d'être instancié dans ``Player.gd``, le lecteur audio va être instancié dans ``Globals.gd`` pour que nous puissions créer des sons de n'importe quelle scène. Maintenant, le lecteur audio va stocker le singleton ``Globals.gd`` pour que quand le lecteur audio est détruit, il puisse également le supprimer d'une liste dans ``Globals.gd``.
ja: 最後に、\ ``Player.gd`` でインスタンス化/産出される代わりに、オーディオプレーヤーは ``Globals.gd`` で産出されるため、どのシーンからでもサウンドを作成できます。オーディオプレーヤーは ``Globals.gd`` シングルトンを保存するようになったため、オーディオプレーヤーが破棄されたときに、\ ``Globals.gd`` のリストから削除することもできます。
zh_cn: 最后，不是在 ``Player.gd`` 中实例化/生成，而是在“Globals.gd”中生成音频播放器，这样我们就可以从任何场景创建声音。 现在音频播放器存储了 ``Globals.gd`` 单例，所以当音频播放器被销毁时，我们也可以从 ``Globals.gd`` 中的列表中删除它。

source: Let's go over the changes.
es: Repasemos los cambios.
fr: Passons en revue les changements.
ja: 変更点を調べてみましょう。
zh_cn: 让我们回顾一下这些变化。

source: For the class variables, we removed all the ``audio_[insert name here]`` variables since we will instead have these passed in from ``Globals.gd``.
es: Para las variables de clase, hemos eliminado todas las variables ``audio_[insertar nombre aqui]`` ya que en su lugar las tendremos pasadas de ``Globals.gd``.
fr: Pour les variables de classe, on retire toutes les variables ``audio_[insérer nom ici]`` puisque nous les passerons à la place dans ``Globals.gd``.
ja: クラス変数については、代わりに ``Globals.gd`` から渡されるため、すべての ``audio_[ここに名前を挿入]`` 変数を削除しました。

source: We also added two new class variables, ``should_loop`` and ``globals``. We'll use ``should_loop`` to tell whether the audio player should loop when the sound has finished, and ``globals`` will hold the ``Globals.gd`` singleton.
es: También agregamos dos nuevas variables de clase, ``should_loop`` y ``globals``. Usaremos ``should_loop`` para decir si el reproductor de audio debe hacer un bucle cuando el sonido haya terminado, y ``globals`` contendrá el singleton ``Globals.gd``.
fr: Nous avons également ajouté deux nouvelles variables de classe, ``should_loop`` et ``globals``. Nous utiliserons ``should_loop`` pour dire au lecteur audio s'il doit jouer le son à nouveau quand il est terminé et ``globals`` afin de stocker le singleton ``Globals.gd``.
ja: また、2つの新しいクラス変数 ``should_loop`` と ``globals`` を追加しました。\ ``should_loop`` を使用して、オーディオプレーヤーがサウンドの終了時にループする必要があるかどうかを判断し、\ ``globals`` は ``Globals.gd`` シングルトンを保持します。
zh_cn: 我们还添加了两个新的类变量 ``should_loop`` 和 ``globals`` 。 我们将使用 ``should_loop`` 来判断音频播放器是否应该在声音结束时循环，而 ``globals`` 将保持 ``Globals.gd`` 单例。

source: The only change in ``_ready`` is now audio player is getting the ``Globals.gd`` singleton and assigning it to ``globals``.
es: El único cambio en ``_ready`` es que ahora el reproductor de audio obtiene el singleton ``Globals.gd`` y lo asigna a ``globals``.
fr: Le seul changement dans ``_ready`` est que le lecteur audio récupère le singleton ``Globals.gd`` et l'assigne à ``globals``.
ja: ``_ready``の唯一の変更は、オーディオプレーヤーが ``Globals.gd`` シングルトンを取得し、それを ``globals`` に割り当てることです。

source: ``play_sound`` now expects an audio stream, named ``audio_stream``, to be passed in, instead of ``sound_name``. Instead of checking the sound name and setting the stream for the audio player, we instead check to make sure an audio stream was passed in. If an audio stream was not passed in, we print an error message, remove the audio player from a list in the ``Globals.gd`` singleton called ``created_audio``, and then free the audio player.
es: ``play_sound`` espera ahora que se pase un stream de audio, llamado ``audio_stream``, en lugar de ``sound_name``. En lugar de comprobar el nombre del sonido y configurar el stream para el reproductor de audio, comprobamos que se ha introducido un stream de audio. Si no se ha pasado un stream de audio, se imprime un mensaje de error, se elimina el reproductor de audio de la lista en el singleton ``Globals.gd`` llamado ``created_audio``, y luego se libera el reproductor de audio.
fr: ``play_sound`` attend maintenant en paramètre un flux audio, appelé ``audio_stream``, au lieu de ``sound_name``. Au lieu de vérifier le nom du son et de paramétrer le flux pour le lecteur audio, on vérifie qu'un flux audio est passé en paramètre. Si aucun flux n'est passé en paramètre, on affiche un message d'erreur, retire le lecteur audio de la liste dans le singleton ``Globals.gd`` appelé ``created_audio`` et on libère le lecteur audio.
ja: ``play_sound`` は ``sound_name`` ではなく、\ ``audio_stream`` という名前のオーディオストリームが渡されることを期待しています。サウンド名を確認してオーディオプレーヤーのストリームを設定する代わりに、オーディオストリームが渡されたことを確認します。オーディオストリームが渡されなかった場合、エラーメッセージを出力し、\ ``Globals.gd`` シングルトンの ``created_audio`` という名前のリストからオーディオプレーヤーを削除してから、オーディオプレーヤーを解放します。
zh_cn: ``play_sound``现在需要传入一个名为``audio_stream``的音频流，而不是 ``sound_name`` 。 我们不是检查声音名称和设置音频播放器的流，而是检查以确保传入音频流。如果未传入音频流，我们打印错误消息，从列表中删除音频播放器 在 ``Globals.gd`` 单例中称为 ``created_audio`` ，然后释放音频播放器。

source: Finally, in ``sound_finished`` we first check to see if the audio player is supposed to loop or not using ``should_loop``. If the audio player is supposed to loop, we play the sound again from the start, at position ``0.0``. If the audio player is not supposed to loop, we remove the audio player from a list in the ``Globals.gd`` singleton called ``created_audio``, and then free the audio player.
es: Finalmente, en ``sound_finished`` primero comprobamos si se debe usar ``should_loop`` o no. Si se supone que debemos hacer un bucle, reproducimos el sonido de nuevo desde el principio del audio, en la posición ``0.0``. Si no se supone que debemos hacer un bucle, quitamos el reproductor de audio de la lista en el singleton ``Globals.gd`` llamado ``created_audio``, y luego liberamos el reproductor de audio.
fr: Enfin, dans ``sound_finished``, on vérifie si le lecteur audio est supposé répéter ou non en utilisant ``should_loop``. Si le lecteur audio doit répéter, on joue leson à nouveau depuis le début à la position ``0.0``. Au contraire, si le lecteur audio n'est pas sensé répéter, on retire le lecteur audio d'une liste dans le singleton ``Globals.gd`` appelé ``created_audio`` et on libère le lecteur audio.
ja: 最後に、 ``sound_finished`` で、オーディオプレーヤーが ``should_loop`` を使用するかどうかを最初に確認します。オーディオプレーヤーがループすることになっている場合、\ ``0.0`` の位置で最初から再びサウンドを再生します。オーディオプレーヤーがループすることになっていない場合、\ ``created_audio`` と呼ばれる ``Globals.gd`` シングルトンのリストからオーディオプレーヤーを削除し、オーディオプレーヤーを解放します。
zh_cn: 最后，在 ``sound_finished`` 中，我们首先检查音频播放器是否应该使用 ``should_loop`` 循环。 如果音频播放器应该循环，我们将从头开始再次播放声音，位置为“0.0”。 如果音频播放器不应该循环，我们从名为 ``created_audio`` 的``Globals.gd``单曲列表中删除音频播放器，然后释放音频播放器。

source: Now that we've finished our changes to ``SimpleAudioPlayer.gd``, we now need to turn our attention to ``Globals.gd``. First, add the following class variables:
es: Ahora que hemos terminado los cambios en ``SimpleAudioPlayer.gd``, necesitamos prestar atención a ``Globals.gd``. Primero, agrega las siguientes variables de clase:
fr: Maintenant que nous avons fini nos modifications dans ``SimpleAudioPlayer.gd``, nous devons tourner notre attention vers ``Globals.gd``. Tout d'abord, ajoutez les variables de classe suivantes :
ja: ``SimpleAudioPlayer.gd`` への変更が完了したので、次に ``Globals.gd`` に注意を向ける必要があります。まず、次のクラス変数を追加します:
zh_cn: 现在我们已完成对 ``SimpleAudioPlayer.gd`` 的更改，现在我们需要将注意力转向 ``Globals.gd`` 。 首先，添加以下类变量:

source: Let's go over these global variables.
es: Veamos esas variables globales.
fr: Voyons ce que font ces variables globales.
ja: これらのグローバル変数について説明します。

source: ``audio_clips``: A dictionary holding all the audio clips ``Globals.gd`` can play.
es: ``audio_clips``: Un diccionario que contiene todos los clips de audio que ``Globals.gd`` puede reproducir.
fr: ``audio_clips``: Un dictionnaire qui contient tous les clips audio que ``Globals.gd`` peut jouer.
ja: ``audio_clips``: ``Globals.gd`` が再生できるすべてのオーディオクリップを保持するdictionary。

source: ``SIMPLE_AUDIO_PLAYER_SCENE``: The simple audio player scene.
es: ``SIMPLE_AUDIO_PLAYER_SCENE``: La simple escena del reproductor de audio.
fr: ``SIMPLE_AUDIO_PLAYER_SCENE``: La scène du lecteur audio.
ja: ``SIMPLE_AUDIO_PLAYER_SCENE``: シンプルなオーディオプレーヤーシーン。
zh_cn: ``SIMPLE_AUDIO_PLAYER_SCENE``:简单的音频播放器场景。

source: ``created_audio``: A list to hold all the simple audio players ``Globals.gd`` has created.
es: ``created_audio``: Una lista que tiene referencias a todos los audio player que ``Global.gd`` ha creado.
fr: ``created_audio``: Une liste pour contenir tous les lecteurs audio que ``Globals.gd`` a créé.
ja: ``created_audio``: ``Globals.gd`` が作成したすべてのシンプルオーディオプレーヤーを保持するリスト。

source: If you want to add additional audio, you need to add it to ``audio_clips``. No audio files are provided in this tutorial, so you will have to provide your own.
es: Si quieres añadir audio adicional, necesitas añadirlo a ``audio_clips``. No se proporcionan archivos de audio en este tutorial, así que tendrás que proporcionar los tuyos propios.
fr: Si vous souhaitez ajouter des sons supplémentaires, vous devez les ajouter à ``audio_clips``. Aucun sons ne seront fournis dans ce tutoriel, vous devrez donc vous les procurer vous même.
ja: オーディオを追加したい場合は、それを ``audio_clips`` に追加する必要があります。このチュートリアルでは音声ファイルは提供されないため、独自の音声ファイルを提供する必要があります。
zh_cn: 如果要添加其他音频，则需要将其添加到“audio_clips”。 本教程中未提供音频文件，因此您必须提供自己的音频文件。

source: One site I'd recommend is **GameSounds.xyz**. I'm using the Gamemaster audio gun sound pack included in the Sonniss' GDC Game Audio bundle for 2017. The tracks I've used (with some minor editing) are as follows:
es: Un sitio que recomendaría es **GameSounds.xyz**. Estoy usando el paquete de sonido de la pistola de audio Gamemaster incluido Sonniss' GDC Game Audio bundle for 2017. Las pistas que he usado (con algo de edición menor) son las siguientes:
fr: Un site que je vous recommande cependant est **GameSounds.xyz**. J'utilise le pack de son « Gamemaster audio gun sound pack » inclus dans le « Sonniss' GDC Game Audio bundle for 2017 ». Les pistes que j'ai utilisé (avec quelques éditions mineures) sont les suivantes :
ja: 推奨するサイトの1つは **GameSounds.xyz** です。Sonniss' GDC Game Audio bundle for 2017 に含まれている Gamemaster audio gun sound pack を使用しています。使用したトラック(若干の編集を含む)は次のとおりです:
zh_cn: 我推荐的一个网站是** GameSounds.xyz **。 我正在使用2017年Sonniss'GDC游戏音频包中包含的Gamemaster音频枪声音包。我使用过的轨道(经过一些小编辑)如下:

source: Now we need to add a new function called ``play_sound`` to ``Globals.gd``:
es: Ahora necesitamos añadir una nueva función llamada ``play_sound`` a ``Globals.gd``:
fr: Nous devons maintenant ajouter une nouvelle fonction appelée ``play_sound`` à ``Globals.gd`` :
ja: ここで、\ ``play_sound`` という新しい関数を ``Globals.gd`` に追加する必要があります:
zh_cn: 现在我们需要在 ``Globals.gd`` 中添加一个名为 ``play_sound`` 的新函数:

source: Firstly, we check whether ``Globals.gd`` has an audio clip with the name ``sound_name`` in ``audio_clips``. If it does not, we print an error message.
es: Primero, comprobamos si ``Globals.gd`` tiene un clip de audio con el nombre ``sound_name`` en ``audio_clips``. Si no lo tiene, imprimimos un mensaje de error.
fr: Tout d'abord, nous devons vérifier si ``Globals.gd`` dispose d'un clip audio avec le nom ``sound_name`` dans ``audio_clips``. Si il n'en a pas, on affiche un message d'erreur.
ja: まず、 ``Globals.gd`` に ``audio_clips`` に ``sound_name`` という名前のオーディオクリップがあるかどうかを確認します。そうでない場合は、エラーメッセージを出力します。

source: If ``Globals.gd`` has an audio clip with the name ``sound_name``, we then instance/spawn a new ``SIMPLE_AUDIO_PLAYER_SCENE`` and assign it to ``new_audio``.
es: Si ``Globals.gd`` tiene un clip de audio con el nombre de ``sound_name``, entonces creamos una nueva ``SIMPLE_AUDIO_PLAYER_SCENE`` y la asignamos a ``new_audio``.
fr: Si ``Globals.gd`` a un clip audio avec le nom ``sound_name``, on instancie un nouveau ``SIMPLE_AUDIO_PLAYER_SCENE`` et on l'assigne à ``new_audio``.
ja: ``Globals.gd`` に ``sound_name`` という名前のオーディオクリップがある場合、新しい ``SIMPLE_AUDIO_PLAYER_SCENE`` をインスタンス化/生成し、それを ``new_audio`` に割り当てます。
zh_cn: 如果 ``Globals.gd`` 有一个名为 ``sound_name`` 的音频剪辑，我们然后实例/生成一个新的 ``SIMPLE_AUDIO_PLAYER_SCENE`` 并将其分配给 ``new_audio`` 。
