Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_six.po
Languages: es, fr, ja, zh_cn

source: We then set ``should_loop``, and add ``new_audio`` as a child of ``Globals.gd``.
es: Luego ponemos ``should_loop``, y agregamos ``new_audio`` como un hijo de ``Globals.gd``.
fr: On paramètre alors ``should_loop`` et on ajoute ``new_audio`` en tant qu'enfant de ``Globals.gd``.
ja: 次に、\ ``should_loop`` を設定し、\ ``Globals.gd`` の子として ``new_audio`` を追加します。
zh_cn: 然后我们设置 ``should_loop`` ，并添加 ``new_audio`` 作为 ``Globals.gd`` 的子节点。

source: Remember, we have to be careful adding nodes to a singleton, since these nodes will not be destroyed when changing scenes.
es: Recuerda, debemos tener cuidado al añadir nodos a un singleton, ya que estos nodos no se destruirán al cambiar de escena.
fr: Souvenez vous, nous devons êtres prudent en ajoutant un nœud à un singleton, puisque ces nœuds ne seront pas détruit lors d'un changement de scène.
ja: シーンを変更してもこれらのノードは破棄されないため、シングルトンにノードを追加する場合は注意が必要です。
zh_cn: 请记住，我们必须小心地将节点添加到单个节点，因为在更改场景时这些节点不会被销毁。

source: We add the ``new_audio`` into the ``created_audio`` list to hold all created audios.
es: Añadimos el ``new_audio`` a la lista de ``created_audio`` para mantener todos los audios creados.
fr: Nous ajoutons ``new_audio``dans la liste des pistes crées ``created_audio``.
ja: 作成されたすべてのオーディオを保持するために、\ ``new_audio`` を ``created_audio`` リストに追加します。

source: We then call ``play_sound``, passing in the audio clip associated with ``sound_name`` and the sound position.
es: Luego llamamos a ``play_sound``, pasando el clip de audio asociado a ``sound_name`` y la posición del sonido.
fr: Nous appelons alors ``play_sound`` en passant en paramètre le clip audio associé au ``sound_name`` ainsi que la position du son.
ja: 次に、\ ``play_sound`` を呼び出し、\ ``sound_name`` に関連付けられたオーディオクリップとサウンドの位置を渡します。
zh_cn: 然后我们调用 ``play_sound`` ，传入与 ``sound_name`` 相关的音频片段和声音位置。

source: Before we leave ``Globals.gd``, we need to add a few lines of code to ``load_new_scene`` so when the player changes scenes, all the audio is destroyed.
es: Antes de salir de ``Globals.gd``, necesitamos agregar algunas líneas de código a ``load_new_scene`` para que cuando el jugador cambie de escena, todo el audio sea destruido.
fr: Avant de quitter ``Globals.gd``, nous devons ajouter quelques lignes de code à ``load_new_scene`` de façon à ce que quand le joueur change de scènes, tout l'audio soit détruit.
ja: ``Globals.gd`` を離れる前に、プレイヤーがシーンを変更したときにすべてのオーディオが破棄されるように、数行のコードを ``load_new_scene`` に追加する必要があります。

source: Add the following to ``load_new_scene``:
es: Añade lo siguiente a ``load_new_scene``:
fr: Ajoutez ce qui suit dans ``load_new_scene`` :
ja: 以下を ``load_new_scene`` に追加します:
zh_cn: 将以下内容添加到``load_new_scene``:

source: Now, before ``Globals.gd`` changes scenes, it goes through each simple audio player in ``created_sounds`` and frees/destroys them. Once ``Globals.gd`` has gone through all the sounds in ``created_audio``, we clear ``created_audio`` so it no longer holds any references to any (now freed/destroyed) simple audio players.
es: Ahora, antes de que ``Globals.gd`` cambie de escena, pasa por cada simple reproductor de audio en ``created_sounds`` y los libera/destruye. Una vez que ``Globals.gd`` ha pasado por todos los sonidos en ``created_audio``, limpiamos ``created_audio`` para que ya no contenga ninguna referencia a ningún (ahora liberado/destruido) reproductor de audio simple.
fr: Maintenant, avant que ``Globals.gd`` ne change de scène, il va passer par tous les lecteurs audio dans ``created_sounds`` et les libérer. Une fois que ``Globals.gd`` a parcouru tous les sons de ``created_audio``, on vide ``created_audio`` de façon à ce qu'il ne contienne plus aucune référence à aucun lecteurs audio (maintenant libérés).
ja: さて、\ ``Globals.gd`` はシーンを変更する前に、\ ``created_sounds`` 内の各シンプルオーディオプレーヤーを通して、それらを解放/破棄します。\ ``Globals.gd`` が ``created_audio`` のすべてのサウンドを処理したら、\ ``created_audio`` をクリアして、(既に解放/破棄されている)シンプルオーディオプレーヤーへの参照を保持しないようにします。

source: Let's change ``create_sound`` in ``Player.gd`` to use this new system. First, remove ``simple_audio_player`` from ``Player.gd``'s class variables since we will no longer be directly instancing/spawning sounds in ``Player.gd``.
es: Cambiemos ``create_sound`` en ``Player.gd`` para usar este nuevo sistema. Primero, elimina ``simple_audio_player`` de las variables de clase de ``Player.gd``, ya que no estaremos directamente instanciando/solicitando sonidos en ``Player.gd``.
fr: Modifions ``create_sound`` dans ``Player.gd`` afin qu'il utilise ce nouveau système. D'abord, supprimez ``simple_audio_player`` des variables de classe de ``Player.gd`` puisque nous n'instancierons plus de sons dans ``Player.gd``.
ja: この新しいシステムを使用するために、\ ``Player.gd`` の ``create_sound`` を変更しましょう。まず、\ ``Player.gd`` のサウンドを直接インスタンス化/生成することはないため、\ ``Player.gd``のクラス変数から ``simple_audio_player`` を削除します。

source: Now, change ``create_sound`` to the following:
es: Ahora, cambia ``create_sound`` por lo siguiente:
fr: Maintenant, changez ``create_sound`` en ce qui suit :
ja: 次に、\ ``create_sound`` を次のように変更します:
zh_cn: 现在，将 ``create_sound`` 更改为以下内容:

source: Now, whenever ``create_sound`` is called, we simply call ``play_sound`` in ``Globals.gd``, passing in all the arguments received.
es: Ahora, cada vez que llamamos a ``create_sound``, simplemente llamamos a ``play_sound`` en ``Globals.gd``, pasando todos los argumentos recibidos.
fr: Désormais, à chaque appel de ``create_sound``, nous appelons simplement ``play_sound`` dans ``Globals.gd`` en passant en paramètre les arguments reçus.
ja: さて、\ ``create_sound`` が呼び出されるたびに、\ ``Globals.gd`` の ``play_sound`` を呼び出して、受け取ったすべての引数を渡します。

source: Now all the sounds in our FPS can be played from anywhere. All we have to do is get the ``Globals.gd`` singleton, and call ``play_sound``, pass in the name of the sound we want to play, whether we want it to loop or not, and the position from which to play the sound.
es: Ahora todos los sonidos de nuestro FPS se pueden reproducir desde cualquier lugar. Todo lo que tenemos que hacer es tomar el singleton ``Globals.gd``, y llamar ``play_sound``, pasando el nombre del sonido que queremos reproducir, si queremos que se reproduzca en bucle o no, y la posición para reproducir el sonido.
fr: Tous les sons de notre FPS peuvent maintenant être joué de n'importe où. Tout ce que nous avons à faire, c'est de récupérer le singleton ``Globals.gd``, appeler ``play_sound``, passer en paramètre le nom du son que nous souhaitons jouer, s'il doit être joué en boucle ou non ainsi que la position à laquelle le son devrait être joué.
ja: これで、FPSのすべてのサウンドをどこからでも再生できます。必要なのは、\ ``Globals.gd`` シングルトンを取得し、\ ``play_sound`` を呼び出し、再生するサウンドの名前、ループするかどうか、およびサウンドを再生する位置を渡すことだけです。

source: For example, if you want to play an explosion sound when the grenade explodes you'd need to add a new sound to ``audio_clips`` in ``Globals.gd``, get the ``Globals.gd`` singleton, and then you just need to add something like ``globals.play_sound("explosion", false, global_transform.origin)`` in the grenades ``_process`` function, right after the grenade damages all the bodies within its blast radius.
es: Por ejemplo, si quieres reproducir un sonido de explosión cuando las granadas explotan necesitarás añadir un nuevo sonido a ``audio_clips`` en ``Globals.gd``, ve al singleton ``Globals.gd``, y luego sólo necesitas añadir algo como ``globals.play_sound("explosion", false, global_transform.origin)`` en la función ``_process`` de la granada, justo después de que la granada dañe todos los cuerpos dentro de su radio de explosión.
fr: Par exemple, si vous voulez jouer un son d'explosion quand la grenade explose, vous devrez ajouter un nouveau son dans ``audio_clips`` de ``Globals.gd``, récupérer le singleton ``Globals.gd`` et ensuite vous aurez simplement à ajouter quelque chose comme ``globals.play_sound("explosion", false, global_transform.origin)`` dans la fonction ``_process`` des grenades, juste après que les grenades aient infligé des dégâts à tous les corps de la zone.
ja: たとえば、手榴弾が爆発したときに爆発音を鳴らしたい場合は、\ ``Globals.gd`` の ``audio_clips`` に新しいサウンドを追加する必要があり、\ ``Globals.gd`` シングルトンを取得し、そして、手榴弾が爆発半径内のすべての体にダメージを与えた直後に、手榴弾の ``_process`` 関数に ``globals.play_sound("explosion", false, global_transform.origin)`` のようなものを追加する必要があります。

source: Final notes
es: Notas finales
fr: Notes finales
ja: 最終ノート
zh_cn: 最后的笔记

source: Now you have a fully working single player FPS!
es: ¡Ahora tienes un FPS de un solo jugador que funciona completamente!
fr: Vous avez maintenant un jeu FPS solo complètement fonctionnel !
ja: これで、完全に機能するシングルプレーヤーFPSが完成しました！
zh_cn: 现在您有一个完全工作的单人FPS！

source: At this point, you have a good base to build more complicated FPS games.
es: En este punto, tienes una buena base para construir juegos FPS más complicados.
fr: À ce stade, vous avez de solides bases pour créer des FPS plus compliqués.
ja: この時点で、より複雑なFPSゲームを構築するための良い基盤ができました。
zh_cn: 在此之上，你已打下构建更复杂的FPS游戏的良好基础。

source: If you ever get lost, be sure to read over the code again!
es: ¡Si alguna vez te pierdes, asegúrate de leer el código de nuevo!
fr: Si jamais vous vous perdez, n'oubliez pas de relire le code !
ja: 迷子になったら、必ずコードをもう一度読んでください！
zh_cn: 如果您迷路了，请务必再次阅读代码！

source: You can download the finished project for the entire tutorial here: :download:`Godot_FPS_Part_6.zip <files/Godot_FPS_Finished.zip>`
es: Puedes descargar el proyecto terminado para el tutorial completo aquí: :download:`Godot_FPS_Part_6.zip <files/Godot_FPS_Finished.zip>`
fr: Vous pouvez télécharger le projet terminé pour le tutoriel complet ici : :download:`Godot_FPS_Part_6.zip <files/Godot_FPS_Finished.zip>`
ja: チュートリアル全体の完成したプロジェクトは、ここからダウンロードできます: :download:`Godot_FPS_Part_6.zip <files/Godot_FPS_Finished.zip>`
zh_cn: 您可以在这里下载整个教程的完成项目: :download:`Godot_FPS_Part_6.zip <files / Godot_FPS_Finished.zip>`

source: The finished project source files contain the same code, just written in a different order. This is because the finished project source files are what the tutorial is based on.
es: Los archivos fuente del proyecto terminado contienen el mismo código, sólo que escrito en un orden diferente. Esto se debe a que los archivos fuente del proyecto terminado son en loÑ que se basa el tutorial.
fr: Les fichiers sources du projet terminé contiennent le même code, écrit dans un ordre différent. Ceci est du au fait que les fichiers sources du projet terminé sont ceux sur lesquels le tutoriel se base.
ja: 完成したプロジェクトソースファイルには同じコードが含まれており、異なる順序で記述されています。これは、完成したプロジェクトソースファイルがチュートリアルの基になっているためです。
zh_cn: 完成的项目源文件包含相同的代码，只是书写顺序稍有不同。因为本教程的撰写基于已完成的项目源文件。

source: The finished project code was written in the order that features were created, not necessarily in a order that is ideal for learning.
es: El código del proyecto terminado se escribió en el orden en que se crearon las características, no necesariamente en un orden ideal para el aprendizaje.
fr: Le code du projet terminé a été écrit dans l'ordre où les fonctionnalités ont été créées, pas nécessairement dans un ordre idéal pour apprendre.
ja: 完成したプロジェクトコードは、機能が作成された順序で作成されましたが、必ずしも学習に最適な順序ではありません。
zh_cn: 完成的项目代码是按照创建功能的顺序编写的，不一定是理想的学习顺序。

source: Other than that, the source is exactly the same, just with helpful comments explaining what each part does.
es: Aparte de eso, la fuente es exactamente la misma, sólo que con comentarios útiles que explican lo que hace cada parte.
fr: En dehors de ça, les source sont exactement les mêmes, simplement avec des commentaires utiles en plus pour expliquer ce que chaque partie fait.
ja: それ以外は、ソースはまったく同じですが、各部分の機能を説明する役立つコメントが付いています。
zh_cn: 除此之外，源代码完全相同，只是提供有用的评论，解释每个部分的作用。

source: The finished project source is hosted on GitHub as well: https://github.com/TwistedTwigleg/Godot_FPS_Tutorial
es: La fuente del proyecto terminado está alojada en GitHub también: https://github.com/TwistedTwigleg/Godot_FPS_Tutorial

source: **Please note that the code in GitHub may or may not be in sync with the tutorial in the documentation**.
es: **Por favor, tenga en cuenta que el código de GitHub puede o no estar sincronizado con el tutorial de la documentación**.

source: The code in the documentation is likely better managed and/or more up to date. If you are unsure of which to use, use the project(s) provided in the documentation, as they are maintained by the Godot community.
es: Es probable que el código de la documentación esté mejor gestionado y/o más actualizado. Si no está seguro de cuál utilizar, utilice el proyecto o proyectos proporcionados en la documentación, ya que son mantenidos por la comunidad Godot.
fr: Le code dans la documentation est certainement mieux géré et/ou plus à jour. Si vous n'êtes pas sûr de quelle version utiliser, utilisez le(s) projet(s) fournis dans la documentation car ceux-ci sont maintenus par la communauté de Godot.
ja: ドキュメント内のコードは、より適切に管理されているか、より最新である可能性があります。どちらを使用するかわからない場合は、ドキュメントで提供されているプロジェクトを使用してください。プロジェクトはGodotコミュニティによって管理されています。
zh_cn: 文档中的代码可能会随时更新至最新版。如果您不确定使用哪个，请使用文档中提供的项目，因为它们是由Godot社区负责维护的。

source: You can download all the ``.blend`` files used in this tutorial here: :download:`Godot_FPS_BlenderFiles.zip <files/Godot_FPS_BlenderFiles.zip>`
es: Puedes encontrar los archivos ``.blend`` usados en este tutorial aquí: :download:`Godot_FPS_Starter.zip <files/Godot_FPS_Starter.zip>`
fr: Vous pouvez télécharger tous les fichiers ``.blend`` utilisés dans ce tutoriel ici : :download:`Godot_FPS_BlenderFiles.zip <files/Godot_FPS_BlenderFiles.zip>`
ja: このチュートリアルで使用されているすべての ``.blend`` ファイルはこちらからダウンロードできます: :download:`Godot_FPS_BlenderFiles.zip <files/Godot_FPS_BlenderFiles.zip>`

source: All assets provided in the started assets (unless otherwise noted) were **originally created by TwistedTwigleg, with changes/additions by the Godot community.** All original assets provided for this tutorial are released under the ``MIT`` license.
es: Todos los activos proporcionados en los activos iniciados (a menos que se indique lo contrario) fueron **originalmente creados por TwistedTwigleg, con cambios/adiciones por la comunidad Godot.** Todos los activos originales proporcionados para este tutorial son liberados bajo la licencia ``MIT``.
fr: Tous les assets fournis dans les assets standards (sauf s'il est écrit autrement) sont **crées à l'origine par TwistedTwigleg, avec des changements/modifications par la communauté Godot.** Tous les assets originaux fournis pour ce tutoriel sont sous la licence ``MIT``.
ja: 開始済みアセットで提供されるすべてのアセットは、(特に明記されていない限り) **Godotコミュニティによる変更/追加により、もともとTwistedTwiglegによって作成されました。** このチュートリアルで提供されるすべての元となるアセットは、\ ``MIT`` ライセンスの下でリリースされます。
zh_cn: 启动资源中提供的所有资源(除非另有说明)最初由TwistedTwigleg创建，由Godot社区进行更改/添加。**本教程提供的所有原始资源均在“MIT”许可下发布。

source: Feel free to use these assets however you want! All original assets belong to the Godot community, with the other assets belonging to those listed below:
es: ¡Siéntete libre de usar estos recursos como quieras! Todos los recursos originales pertenecen a la comunidad Godot, con los otros recursos pertenecientes a los enumerados a continuación:
fr: N'hésitez pas à utiliser ces assets comme vous le souhaitez ! Tous les assets originaux appartiennent à la communauté Godot, les autres assets appartenant à ceux énumérés ci-dessous :
ja: これらのアセットは自由に使用できます。すべての元のアセットはGodotコミュニティに属し、他のアセットは以下にリストされているものに属します:
zh_cn: 您可以随意使用这些资源！ 所有原始资源均属于Godot社区，其他资源属于以下列出的资源:

source: The skybox is created by **StumpyStrust** and can be found at OpenGameArt.org. https://opengameart.org/content/space-skyboxes-0 . The skybox is licensed under the ``CC0`` license.
es: El skybox es creado por **StumpyStrust** y se puede encontrar en OpenGameArt.org. https://opengameart.org/content/space-skyboxes-0 . El skybox está licenciado bajo la licencia ``CC0``.
fr: La skybox a été créée par **StumpyStrust** et peut être trouvé sur OpenGameArt.org. https://opengameart.org/content/space-skyboxes-0. La skybox est sous licence ``CC0``.
ja: スカイボックスは **StumpyStrust ** によって作成され、OpenGameArt.org https://opengameart.org/content/space-skyboxes-0 で見つけることができます。スカイボックスは ``CC0`` ライセンスの下でライセンスされています。
zh_cn: 天空盒由** StumpyStrust **创建，可以在OpenGameArt.org找到。 https://opengameart.org/content/space-skyboxes-0。 天空盒根据“CC0”许可证授权。

source: The font used is **Titillium-Regular**, and is licensed under the ``SIL Open Font License, Version 1.1``.
es: La fuente utilizada es **Titillium-Regular**, y está licenciada bajo la ``SIL Open Font License, Version 1.1``.
fr: La police utilisée est **Titillium-Regular**, et est sous licence ``SIL Open Font License, Version 1.1``.
ja: 使用されるフォントは **Titillium-Regular** であり、\ ``SIL Open Font License, Version 1.1`` の下でライセンスされています。
zh_cn: 使用的字体是** Titillium-Regular **，并根据``SIL Open Font License，Version 1.1`许可。

source: The skybox was converted to a 360 equirectangular image using this tool: https://www.360toolkit.co/convert-cubemap-to-spherical-equirectangular.html
es: La caja celeste fue convertida en una imagen equirectangular de 360º usando esta herramienta: https://www.360toolkit.co/convert-cubemap-to-spherical-equirectangular.html
fr: La skybox a été convertie d'une projection cylindrique équidistante 360 en utilisant cet outil : https://www.360toolkit.co/convert-cubemap-to-spherical-equirectangular.html
ja: このツールを使用して、スカイボックスを360の正距円筒イメージに変換しました: https://www.360toolkit.co/convert-cubemap-to-spherical-equirectangular.html
zh_cn: 使用此工具将天空盒转换为360 equirectangular图像:https://www.360toolkit.co/convert-cubemap-to-spherical-equirectangular.html

source: While no sounds are provided, you can find many game ready sounds at https://gamesounds.xyz/
es: Aunque no se proporcionan sonidos, puede encontrar muchos sonidos listos para el juego en https://gamesounds.xyz/
fr: Bien qu'aucun sons n'ont été fournis, vous pouvez trouver beaucoup de très bon sons à cette adresse : https://gamesounds.xyz/
ja: サウンドは提供されませんが、 https://gamesounds.xyz/ で多くのゲーム向きの音を見つけることができます
zh_cn: 虽然没有提供声音，但您可以在https://gamesounds.xyz/找到许多游戏就绪声音

source: **OpenGameArt.org, 360toolkit.co, the creator(s) of Titillium-Regular, StumpyStrust, and GameSounds.xyz are in no way involved in this tutorial.**
es: **OpenGameArt.org, 360toolkit.co, los creadores de Titillium-Regular, StumpyStrust, y GameSounds.xyz no están de ninguna manera involucrados en este tutorial.**
fr: **OpenGameArt.org, 360toolkit.co, le(s) créateur(s) de Titillium-Regular, StumpyStrust, et GameSounds.xyz ne sont en aucune façon impliqués dans ce tutoriel.**
ja: **OpenGameArt.org、360toolkit.co、Titillium-Regular、StumpyStrust、およびGameSounds.xyzの作成者は、このチュートリアルには一切関与していません。**
zh_cn: ** OpenGameArt.org，360toolkit.co，Titillium-Regular，StumpyStrust和GameSounds.xyz的创建者都不参与本教程。**

source: The finished project source is hosted on Github as well: https://github.com/TwistedTwigleg/Godot_FPS_Tutorial
fr: Les sources du projet terminé sont également stockés sur Github : https://github.com/TwistedTwigleg/Godot_FPS_Tutorial
zh_cn: 完成的项目源也托管在Github上:https://github.com/TwistedTwigleg/Godot_FPS_Tutorial

source: **Please note that the code in Github may or may not be in sync with the tutorial in the documentation**.
fr: **Notez que les sources sur Github peuvent ou non êtres synchronisés avec la documentation de ce tutoriel**.
zh_cn: **请注意，Github中的代码可能与文档中的教程同步也可能不同步**。
