Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_five.po
Languages: de, es, fr, ja, zh_cn

source: We then get the smoke particles node and assign it to the ``smoke_particles`` variable. We also set ``emitting`` to ``false`` to ensure the particles are not emitting until the turret is broken.
es: Luego obtenemos el nodo de partículas de humo y lo asignamos a la variable ``smoke_particles``. También ponemos ``emitting`` en ``false`` para asegurarnos de que las partículas no emitan hasta que la torreta se rompa.
fr: Nous obtenons ensuite le nœud de particules de fumée et nous l'assignons à la variable ``smoke_particles``. Nous attribuons ``false`` à ``emitting`` pour s'assurer que les particules ne s'émettent pas tant que la tourelle n'est pas détruite.
ja: 次に、smoke particleノードを取得し、それを ``smoke_particles`` 変数に割り当てます。また、\ ``emitting`` を ``false`` に設定して、砲塔が破壊されるまでパーティクルが放出されないようにします。

source: Finally, we set the turret's health to ``MAX_TURRET_HEALTH`` so it starts at full health.
de: Schließlich stellen wir den Gesundheitszustand des Geschützturms auf ``MAX_TURRET_HEALTH`` ein, so dass er bei voller Gesundheit startet.
es: Por último, ponemos la salud de la torreta en``MAX_TURRET_HEALTH`` para que empiece con plena salud.
fr: Enfin, nous assignons ``MAX_TURRET_HEALTH`` à la vie de la tourelle afin qu'elle commence avec toute sa vie.
ja: 最後に、砲塔の体力を ``MAX_TURRET_HEALTH`` に設定して、完全な体力で開始するようにします。
zh_cn: 最后，我们将炮塔的生命值设置为“MAX_TURRET_HEALTH”，以便从完全健康状态开始。

source: Now let's go through ``_physics_process``.
de: Lassen Sie uns nun ``_physics_process`` durchgehen.
es: Ahora vamos a pasar por el ``_physics_process``.
fr: Regardons maintenant ``_physics_process``.
ja: それでは、\ ``_physics_process`` を見てみましょう。
zh_cn: 现在让我们来看看`_physics_process``。

source: Firstly, we check whether the turret is active. If the turret is active, we want to process the firing code.
es: En primer lugar, comprobamos si la torreta está activa. Si la torreta está activa, queremos procesar el código de disparo.
fr: Premièrement, nous vérifions si la tourelle est active. Si c'est le cas, nous voulons activer le code de tir.
ja: まず、砲塔がアクティブかどうかを確認します。 砲塔がアクティブな場合、発射コードを処理します。

source: Next, if ``flash_timer`` is greater than zero, meaning the flash meshes are visible, we want to remove delta from ``flash_timer``. If ``flash_timer`` gets to zero or less after we've subtracted ``delta``, we want to hide both of the flash meshes.
es: A continuación, si ``flash_timer`` es mayor que cero, que significa que las mallas de flash son visibles, queremos eliminar el delta de ``flash_timer``. Si ``flash_timer`` llega a cero o menos después de restar ``delta``, queremos ocultar ambas mallas de flash.
fr: Ensuite, si ``flash_timer`` est supérieur à zéro, ce qui veut dire que les mesh de flash sont visibles, nous voulons supprimer delta de ``flash_timer``. Si ``flash_timer`` atteint zéro ou moins après avoir soustrait ``delta``, nous voulons cacher les deux mesh de flash.
ja: 次に、\ ``flash_timer`` がゼロより大きい場合、つまりフラッシュメッシュが表示されている場合、\ ``flash_timer`` からdeltaを減らします。``delta`` を減算した後に ``flash_timer`` がゼロ以下になった場合、両方のフラッシュメッシュを非表示にする必要があります。

source: Next, we check whether the turret has a target. If the turret has a target, we make the turret head look at it, adding ``PLAYER_HEIGHT`` so it is not aiming at the player's feet.
es: A continuación, comprobamos si la torreta tiene un objetivo. Si la torreta tiene un objetivo, hacemos que la cabeza de la torreta lo mire, añadiendo ``PLAYER_HEIGHT`` para que no apunte a los pies del jugador.
fr: Ensuite, nous vérifions si la tourelle a une cible. Si c'est le cas, nous faisons en sorte que le tourelle la regarde en lui ajoutant ``PLAYER_HEIGHT`` de façon à ce qu'elle ne fixe pas les pieds du joueur.
ja: 次に、砲塔にターゲットがあるかどうかを確認します。 砲塔にターゲットがある場合、砲塔の頭がプレイヤーの足元を狙わないように ``PLAYER_HEIGHT`` を加算して見るようにします。

source: We then check whether the turret's health is greater than zero. If it is, we then check whether there is ammo in the turret.
es: Entonces comprobamos si la salud de la torreta es mayor que cero. Si lo es, entonces comprobamos si hay munición en la torreta.
fr: Nous vérifions ensuite si la santé de la tourelle est supérieur à zéro. Si c'est le cas, nous vérifions si la tourelle a encore des munitions.
ja: 次に、砲塔の体力がゼロより大きいかどうかを確認します。 そうであれば、砲塔に弾薬があるかどうかを確認します。

source: If there is, we then check whether ``fire_timer`` is greater than zero. If it is, the turret cannot fire and we need to remove ``delta`` from ``fire_timer``. If ``fire_timer`` is less than or equal to zero, the turret can fire a bullet, so we call the ``fire_bullet`` function.
es: Si lo hay, entonces comprobamos si el ``fire_timer`` es mayor que cero. Si lo es, la torreta no puede disparar y tenemos que quitar ``delta`` del ``fire_timer``. Si el ``fire_timer`` es menor o igual a cero, la torreta puede disparar una bala, así que llamamos a la función ``fire_bullet``.
fr: S'il y en a, nous vérifions alors si ``fire_timer`` est supérieur à zéro. Si c'est le cas, la tourelle ne peut pas tirer et nous devons soustraire ``delta`` de ``fire_timer``. Si ``fire_timer`` est inférieur ou égal à zéro, la tourelle peut alors tirer une balle, nous appelons donc la fonction ``fire_bullet``.
ja: そうである場合は、\ ``fire_timer`` がゼロより大きいかどうかを確認します。 もしそうなら、砲塔は発砲できず、\ ``fire_timer`` から ``delta`` 分を減らす必要があります。\ ``fire_timer`` がゼロ以下の場合、砲塔は弾丸を発射できるため、\ ``fire_bullet`` 関数を呼び出します。

source: If there isn't any ammo in the turret, we check whether ``ammo_reload_timer`` is greater than zero. If it is, we subtract ``delta`` from ``ammo_reload_timer``. If ``ammo_reload_timer`` is less than or equal to zero, we set ``ammo_in_turret`` to ``AMMO_IN_FULL_TURRET`` because the turret has waited long enough to refill its ammo.
es: Si no hay munición en la torreta, comprobamos si el ``ammo_reload_timer`` es mayor que cero. Si lo es, restamos ``delta`` del ``ammo_relaod_timer``. Si ``ammo_reload_timer`` es menor o igual a cero, ponemos ``ammo_in_turret`` en ``AMMO_IN_FULL_TURRET`` porque la torreta ha esperado lo suficiente para recargar su munición.
fr: S'il n'y a plus aucune munitions dans la tourelle, nous vérifions si ``ammo_reload_timer`` est supérieur à zéro. Si c'est le cas, nous soustrayons ``delta`` de ``ammo_reload_timer``. Si ``ammo_reload_timer`` est inférieur ou égal à zéro, on assigne ``ammo_in_turret`` à ``AMMO_IN_FULL_TURRET`` car la tourelle a attendu suffisamment longtemps pour se réapprovisionner en munitions.
ja: 砲塔に弾薬がない場合、\ ``ammo_reload_timer`` がゼロより大きいかどうかを確認します。 そうである場合、\ ``ammo_reload_timer`` から ``delta`` を減算します。\ ``ammo_reload_timer`` がゼロ以下の場合、砲塔が弾薬を補充するのに十分な時間待機しているため、\ ``ammo_in_turret`` を ``AMMO_IN_FULL_TURRET`` に設定します。

source: Next, we check whether the turret's health is less than or equal to ``0`` outside of whether it is active or not. If the turret's health is zero or less, we then check whether ``destroyed_timer`` is greater than zero. If it is, we subtract ``delta`` from ``destroyed_timer``.
es: A continuación, comprobamos si la salud de la torreta es menor o igual que ``0`` fuera de si está activa o no. Si la salud de la torreta es cero o menos, entonces comprobamos si el ``destroyed_timer`` es mayor que cero. Si lo es, restamos ``delta`` de ``destroyed_timer``.
fr: Ensuite, nous vérifions si la vie de tourelle est inférieur ou égale à ``0`` en dehors du fait qu'elle est active ou non. Si la santé de la tourelle est zéro ou moins, nous vérifions alors si ``destroyed_timer`` est supérieur à zéro. Si c'est le cas, nous soustrayons ``delta`` de ``destroyed_timer``.
ja: 次に、砲塔がアクティブかどうか以外に、砲塔の体力が ``0`` 以下かどうかを確認します。砲塔の体力がゼロ以下の場合、\ ``destroyed_timer`` がゼロより大きいかどうかを確認します。 もしそうなら、\ ``destroyed_timer`` から ``delta`` を減算します。

source: If ``destroyed_timer`` is less than or equal to zero, we set ``turret_health`` to ``MAX_TURRET_HEALTH`` and stop emitting smoke particles by setting ``smoke_particles.emitting`` to ``false``.
es: A continuación, comprobamos si la salud de la torreta es menor o igual que ``0`` fuera de si está activa o no. Si la salud de la torreta es cero o menos, entonces comprobamos si el ``destroyed_timer`` es mayor que cero. Si lo es, restamos ``delta`` de ``destroyed_timer``.
fr: Si ``destroyed_timer`` est inférieur ou égal à zéro, on assigne ``turret_health`` à ``MAX_TURRET_HEALTH`` et on stoppe les émissions de particules de fumée en assignant ``false`` à ``smoke_particles.emitting``.
ja: ``destroyed_timer`` がゼロ以下の場合、\ ``turret_health`` を ``MAX_TURRET_HEALTH`` に設定し、\ ``smoke_particles.transmit`` を ``false`` に設定して煙のパーティクルの放出を停止します。
zh_cn: 如果 ``destroyed_timer`` 小于或等于零，我们将 ``turret_health`` 设置为 ``MAX_TURRET_HEALTH`` 并通过将 ``smoke_particles.emitting`` 设置为 ``false`` 来停止冒烟。

source: Next let's go through ``fire_bullet``.
de: Lassen Sie uns als nächstes ``fire_bullet`` durchgehen.
es: A continuación vamos a pasar a través de ``fire_bullet``.
fr: Regardons maintenant ``fire_bullet``.
ja: 次に、\ ``fire_bullet`` を見てみましょう。
zh_cn: 接下来让我们来看看 ``fire_bullet`` 。

source: Firstly, we check whether the turret is using a raycast.
de: Zuerst prüfen wir, ob der Turm einen Ray-Cast verwendet.
es: En primer lugar, comprobamos si la torreta está usando un raycast.
fr: Tout d'abord, nous vérifions si la tourelle utilise un raycast.
ja: まず、砲塔がレイキャストを使用しているかどうかを確認します。

source: The code for using a raycast is almost entirely the same as the code in the rifle from :ref:`doc_fps_tutorial_part_two`, so I'm only going to go over it briefly.
es: El código para usar un raycast es casi idéntico al código del rifle de :ref:`doc_fps_tutorial_part_two`, así que sólo voy a repasarlo brevemente.
fr: Le code pour utiliser un raycast est presque identique à celui présent dans le fusil de la :ref:`doc_fps_tutorial_part_two`, je vais donc passer dessus très brièvement.
ja: レイキャストを使用するためのコードは、\ :ref:`doc_fps_tutorial_part_two` のライフルのコードとほぼ同じなので、簡単に説明します。

source: We first make the raycast look at the target, ensuring the raycast will hit the target if nothing is in the way. We then force the raycast to update so we get a frame perfect collision check. We then check whether the raycast has collided with anything. If it has, we then check whether the collided body has the ``bullet_hit`` method. If it does, we call it and pass in the damage a single raycast bullet does along with the raycast's transform. We then subtract ``1`` from ``ammo_in_turret``.
es: Primero hacemos que el raycast mire al objetivo, asegurándonos de que el raycast dará en el blanco si no hay nada en el camino. Luego forzamos el raycast a actualizarse para obtener un fotograma perfecto de verificación de colisión. Luego comprobamos si el raycast ha colisionado con algo. Si lo ha hecho, entonces comprobamos si el cuerpo colisionado tiene el método "bullet_hit". Si lo tiene, lo llamamos y pasamos el daño que hace una bala de un solo raycast junto con la transformación del raycast. Luego restamos ``1`` de ``ammo_in_turret``.
fr: Nous allons d'abord tourner le raycast vers la cible, en s'assurant que celui-ci va toucher sa cible si rien n'est sur le chemin. On force ensuite le raycast à se mettre à jour de façon à obtenir une collision à la frame près. Nous vérifions ensuite si le raycast est entré en collision avec quelque chose. Si c'est le cas, nous vérifions ensuite si le corps entré en collision a une méthode ``bullet_hit``. Si elle l'a, on l'appelle et on lui passe les dommages qu'inflige un simple raycast de balle ainsi que le Transform du raycast. On soustrait ensuite ``1`` de ``ammo_in_turret``.
ja: 最初にレイキャストでターゲットを確認し、何も邪魔されていない場合にレイキャストがターゲットにヒットするようにします。 次に、レイキャストを強制的に更新して、フレームパーフェクトコリジョンチェックを取得します。 次に、レイキャストが何かと衝突したかどうかを確認します。 その場合、衝突したボディに ``bullet_hit`` メソッドがあるかどうかを確認します。 もしそうなら、私たちはそれを呼び出して、レイキャストのtransformとともに単一のレイキャストの弾丸が与えるダメージを渡します。 次に、\ ``ammo_in_turret`` から ``1`` を引きます。

source: If the turret is not using a raycast, we spawn a bullet object instead. This code is almost entirely the same as the code in the pistol from :ref:`doc_fps_tutorial_part_two`, so like with the raycast code, I'm only going to go over it briefly.
es: Si la torreta no usa un raycast, en su lugar producimos un objeto de bala. Este código es casi completamente igual al código de la pistola de :ref:`doc_fps_tutorial_part_two`, así que al igual que con el código de raycast, sólo voy a repasarlo brevemente.
fr: Si la tourelle n'utilise pas de raycast, on fait apparaître une balle à la place. Ce code est pratiquement le même que celui du pistolet dans :ref:`doc_fps_tutorial_part_two`, donc comme pour le code du raycast, je vais le passer en revue rapidement.
ja: 砲塔がレイキャストを使用していない場合、代わりに弾丸オブジェクトを生成します。 このコードは :ref:`doc_fps_tutorial_part_two` のピストルのコードとほぼ完全に同じであるため、レイキャストコードと同様に、簡単に説明します。
zh_cn: 如果炮塔没有使用光线投射，我们会生成一个子弹对象。 这段代码几乎完全与手枪中的代码相同 :ref:`doc_fps_tutorial_part_two`，所以与光线播放代码一样，我只是简单地介绍一下。

source: We first make a bullet clone and assign it to ``clone``. We then add that as a child of the root node. We set the bullet's global transform to the barrel end, scale it up since it's too small, and set its damage and speed using the turret's constant class variables. We then subtract ``1`` from ``ammo_in_turret``.
es: Primero hacemos un clon de bala y lo asignamos a ``clone``. Luego lo añadimos como un hijo del nodo raíz. Establecemos la transformación global de la bala en el extremo del cañón, la escalamos ya que es demasiado pequeña, y establecemos su daño y velocidad usando las variables de clase constante de la torreta. Luego restamos ``1`` de ``ammo_in_turret``.
fr: Nous créons d'abord une clone de balle en lui assignant ``clone``. On l'ajoute ensuite en tant qu'enfant du nœud racine. On assigne la position du bout du canon au Transform global de la balle, on ajuste un peu sa taille car c'est trop petit et on lui assigne ses dommages et sa vitesse en utilisant les variables de classe constantes de la tourelle. On soustrait ensuite ``1`` de ``ammo_in_turret``.
ja: 最初に弾丸のクローンを作成し、それを ``clone`` に割り当てます。 次に、それをルートノードの子として追加します。 弾丸のグローバルtransformを砲身の終端に設定し、そのままでは小さすぎるためにスケールアップし、砲塔の定数クラス変数を使用してダメージと速度を設定します。 次に、\ ``ammo_in_turret`` から ``1`` を引きます。

source: Then, regardless of which bullet method we used, we make both of the muzzle flash meshes visible. We set ``flash_timer`` and ``fire_timer`` to ``FLASH_TIME`` and ``FIRE_TIME``, respectively. We then check whether the turret has used the last bullet in its ammo. If it has, we set ``ammo_reload_timer`` to ``AMMO_RELOAD_TIME`` so the turret reloads.
es: Entonces, independientemente del método de bala que utilizamos, hacemos visibles las dos mallas de flash del cañón. Ponemos ``flash_timer`` y ``fire_timer`` en ``FLASH_TIME`` y ``FIRE_TIME``, respectivamente. Entonces comprobamos si la torreta ha usado la última bala de su munición. Si lo ha hecho, ponemos el ``ammo_reload_timer`` a ``AMMO_RELOAD_TIME`` para que la torreta se recargue.
fr: Ensuite, quelque soit la méthode utilisée pour la balle, on rend les deux mesh du flash visible. On assigne ``FLASH_TIME`` à ``flash_timer`` et ``FIRE_TIME`` à ``fire_timer``. On vérifie ensuite si la tourelle a utilisé sa dernière balle. Si c'est le cas, on affecte ``AMMO_RELOAD_TIME`` à ``ammo_reload_timer`` de façon à ce que la tourelle recharge.
ja: 次に、使用した弾丸方式に関係なく、両方の銃口フラッシュメッシュを表示します。 ``flash_timer`` と ``fire_timer`` をそれぞれ ``FLASH_TIME`` と ``FIRE_TIME`` に設定します。 次に、砲塔が弾薬の最後の弾丸を使用したかどうかを確認します。 その場合は、砲塔がリロードされるように ``ammo_reload_timer`` を ``AMMO_RELOAD_TIME`` に設定します。

source: Let's look at ``body_entered_vision`` next, and thankfully it is rather short.
de: Schauen wir uns als nächstes ``body_entered_vision`` an, und zum Glück ist dies recht kurz.
es: Veamos a continuación ``body_entered_vision``, y por suerte es bastante corta.
fr: Regardons maintenant ``body_entered_vision``, et heureusement, c'est relativement court.
ja: 次に ``body_entered_vision`` を見てみますが、ありがたいことにそれはかなり短いです。
zh_cn: 让我们看看接下来的 ``body_entered_vision`` ，谢天谢地，它很短。

source: We first check whether the turret currently has a target by checking if ``current_target`` is equal to ``null``. If the turret does not have a target, we then check whether the body that has just entered the vision :ref:`Area <class_Area>` is a :ref:`KinematicBody <class_KinematicBody>`.
es: Primero comprobamos si la torreta tiene actualmente un objetivo comprobando si ``current_target`` es igual a ``null``. Si la torreta no tiene un objetivo, entonces comprobamos si el cuerpo que acaba de entrar en la visión :ref:`Area <class_Area>` es un :ref:`KinematicBody <class_KinematicBody>`.
fr: Nous commençons par vérifier si la tourelle a une cible en vérifiant si ``current_target`` est égal à ``null``. Si la tourelle n'a pas de cible, on vérifie alors si le corps qui est entré dans le :ref:`Area <class_Area>` de vision est un :ref:`KinematicBody <class_KinematicBody>`.
ja: まず、 \ ``current_target`` が ``null`` と等しいかどうかを確認することにより、砲塔が現在ターゲットを持っているかどうかを確認します。 砲塔にターゲットがない場合は、ビジョンに入ったばかりのボディ :ref:`Area <class_Area>` が :ref:`KinematicBody <class_KinematicBody>` であるかどうかを確認します。

source: We're assuming the turret should only fire at :ref:`KinematicBody <class_KinematicBody>` nodes since that is what the player is using.
es: Asumimos que la torreta sólo debería disparar a los nodos :ref:`KinematicBody <class_KinematicBody>` ya que eso lo que está usando el jugador.
fr: Nous supposons que la tourelle ne devrait cibler que les nœuds :ref:`KinematicBody <class_KinematicBody>` puisque que le joueur utilise ces nœuds.
ja: 砲塔は :ref:`KinematicBody <class_KinematicBody>` ノードでのみ発動するはずであると想定しています。これはプレイヤーが使用しているものだからです。

source: If the body that just entered the vision :ref:`Area <class_Area>` is a :ref:`KinematicBody <class_KinematicBody>`, we set ``current_target`` to the body, and set ``is_active`` to ``true``.
es: Si el cuerpo que acaba de entrar en la visión :ref:`Area <clasS_Area>` es un :ref:`KinematicBody <class_KinematicBody>`, ponemos ``current_target`` al cuerpo, y ponemos ``is_active`` a ``true``.
fr: Si le corps qui vient d'entrer dans la vision :ref:`Area <class_Area>` est un :ref:`KinematicBody <class_KinematicBody>`, on assigne le corps à ``current_target``, et on met ``is_active`` à ``true``.
ja: ビジョン :ref:`Area <class_Area>` に入ったばかりのボディが :ref:`KinematicBody <class_KinematicBody>` である場合、\ ``current_target`` にボディに設定し、\ ``is_active`` を `` true`` に設定します。
zh_cn: 如果刚进入视觉的主体 :ref:`Area <class_Area>` 是 :ref:`KinematicBody <class_KinematicBody>`，我们将 ``current_target`` 设置为body，并将 ``is_active`` 设置为 ``true`` 。

source: Now let's look at ``body_exited_vision``.
de: Schauen wir uns nun ``body_exited_vision`` an.
es: Ahora veamos la ``body_exited_vision``.
fr: Regardons maintenant ``body_exited_vision``.
ja: それでは、\ ``body_exited_vision`` を見てみましょう。
zh_cn: 现在让我们来看看 ``body_exited_vision`` 。

source: Firstly, we check whether the turret has a target. If it does, we then check whether the body that has just left the turret's vision :ref:`Area <class_Area>` is the turret's target.
es: En primer lugar, comprobamos si la torreta tiene un objetivo. Si lo tiene, entonces comprobamos si el cuerpo que acaba de salir de la visión de la torreta :ref:`Area <clase_Area>` es el objetivo de la torreta.
fr: Premièrement, on vérifie si la tourelle a une cible. Si c'est le cas, on vérifie alors si le corps qui vient de sortir de la vision de la tourelle :ref:`Area <class_Area>` est la cible de la tourelle.
ja: まず、砲塔にターゲットがあるかどうかを確認します。もしそうなら、砲塔の視界から出たばかりのボディ :ref:`Area <class_Area>` が砲塔のターゲットかどうかを確認します。

source: If the body that has just left the vision :ref:`Area <class_Area>` is the turret's current target, we set ``current_target`` to ``null``, set ``is_active`` to ``false``, and reset all the variables related to firing the turret since the turret no longer has a target to fire at.
es: Si el cuerpo que acaba de salir de la visión :ref:`Area <class_Area>` es el objetivo actual de la torreta, ponemos ``current_target`` en ``null``, ponemos ``is_active`` a ``false``, y reajustamos todas las variables relacionadas con el disparo de la torreta ya que ésta ya no tiene un objetivo al que disparar.
fr: Si le corps qui vient de sortir de la vision :ref:`Area <class_Area>` est la cible de la tourelle, on assigne ``null`` à ``current_target``, ``false`` à ``is_active`` et on ré-initialise toutes les variables liées au tir de la tourelle puisque la tourelle n'a plus de cibles sur laquelle tirer.
ja: 視界 :ref:`Area <class_Area>` を出たばかりのボディが砲塔の現在のターゲットである場合、\ ``current_target`` を ``null`` に設定し、\ ``is_active`` を ``false`` に設定し、砲塔には発射するターゲットがなくなったため、砲塔の発射に関連するすべての変数をリセットします。

source: Finally, let's look at ``bullet_hit``.
de: Lass uns zum Schluss einen Blick auf ``bullet_hit`` werfen.
es: Por último, veamos el ``bullet_hit``.
fr: Terminons par un coup d’œil à ``bullet_hit``.
ja: 最後に、\ ``bullet_hit`` を見てみましょう。
zh_cn: 最后，让我们看一下 ``bullet_hit`` 。

source: We first subtract however much damage the bullet causes from the turret's health.
de: Zuerst ziehen wir vom Gesundheitszustand des Turms den vom Geschoss verursachten Schaden ab.
es: Primero restamos el daño que la bala causa a la salud de la torreta.
fr: Nous soustrayons d'abord les dommages que cause la balle à la santé de la tourelle.
ja: まず、砲塔の体力から弾丸が引き起こすダメージを差し引きます。

source: Then, we check whether the turret has been destroyed (health being zero or less). If the turret is destroyed, we start emitting the smoke particles and set ``destroyed_timer`` to ``DESTROYED_TIME`` so the turret has to wait before being repaired.
es: Entonces, comprobamos si la torreta ha sido destruida (la salud es cero o menos). Si la torreta está destruida, empezamos a emitir las partículas de humo y ponemos ``destroyed_timer`` en ``DESTROYED_TIME`` para que la torreta tenga que esperar antes de ser reparada.
fr: Ensuite, on vérifie si la tourelle est détruite ou non (sa santé atteint zéro ou moins). Si la tourelle est détruite, on commence à émettre le signal d'émission des particules de fumée et on assigne ``DESTROYED_TIME`` à ``destroyed_timer`` afin que la tourelle attende pour être réparée.
ja: 次に、砲塔が破壊されたかどうかを確認します(体力ゼロ以下)。砲塔が破壊された場合、煙のパーティクルの放出を開始し、\ ``destroyed_timer`` を `` DESTROYED_TIME`` に設定して、砲塔が修理されるまで待機させる必要があります。

source: Whew, with all of that done and coded, we only have one last thing to do before the turret is ready for use. Open up ``Turret.tscn`` if it's not already open and select one of the :ref:`StaticBody <class_StaticBody>` nodes from either ``Base`` or ``Head``. Create a new script called ``TurretBodies.gd`` and attach it to whichever :ref:`StaticBody <class_StaticBody>` you have selected.
es: Uf, con todo eso hecho y codificado, sólo tenemos una última cosa que hacer antes de que la torreta esté lista para su uso. Abre ``Turret.tscn`` si no está ya abierta y selecciona uno de los nodos :ref:`StaticBody <class_StaticBody>` de cualquiera de los nodos ``Base`` o ``Head``. Crea un nuevo script llamado ``TurretBodies.gd`` y adjúntalo a cualquiera de los :ref:`StaticBody <class_StaticBody>` que hayas seleccionado.
fr: Ouf, maintenant que tout ceci est fait, il ne nous reste plus qu'une dernière chose à faire avant que la tourelle soit prête à l'utilisation. Ouvrez ``Turret.tscn`` si ce n'est pas encore le cas et sélectionnez un des nœuds :ref:`StaticBody <class_StaticBody>` de ``Base`` ou ``Head`` Créez un nouveau script appelé ``TurretBodies.gd`` et attachez n'importe quel :ref:`StaticBody <class_StaticBody>` que vous avez sélectionné.
ja: ふう、コーディングが完了したので、砲塔を使用する準備ができるまでに最後にやるべきことは1つだけです。 まだ開いていない場合は ``Turret.tscn`` を開き、\ ``Base`` または ``Head`` から :ref:`StaticBody <class_StaticBody>` ノードのいずれかを選択します。\ ``TurretBodies.gd`` という新しいスクリプトを作成し、選択した :ref:`StaticBody <class_StaticBody>` のいずれかにアタッチします。

source: Add the following code to ``TurretBodies.gd``:
de: Fügen Sie den folgenden Code zu ``TurretBodies.gd`` hinzu:
es: Agregue el siguiente código a `` TurretBodies.gd``:
fr: Ajoutez le code suivant à ``TurretBodies.gd`` :
ja: 次のコードを ``TurretBodies.gd`` に追加します:
zh_cn: 将以下代码添加到``TurretBodies.gd``:
