Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_four.po
Languages: es, fr, ja, zh_cn

source: For each child, we first check to see if it's a :ref:`RigidBody <class_RigidBody>` node. If it is, we then calculate the center position of the target relative to the child node. Then we figure out which direction the child node is relative to the center. Using those calculated variables, we push the child from the calculated center, in the direction away from the center, using the damage of the bullet as the force.
es: Para cada niño, primero comprobamos si es un nodo :ref:`RigidBody <class_RigidBody>`. Si lo es, entonces calculamos la posición central del objetivo relativa al nodo hijo. Luego averiguamos en qué dirección está el nodo hijo con respecto al centro. Usando esas variables calculadas, empujamos al niño desde el centro calculado, en la dirección opuesta al centro, usando el daño de la bala como fuerza.
fr: Pour chaque enfant, nous vérifions d'abord si c'est un nœud :ref:`RigidBody <class_RigidBody>`. Si c'est le cas, on calcule alors la position centrale de la cible relative au nœud enfant. Ensuite, on détermine dans quelle direction le nœud enfant est relatif au centre. En utilisant ces variables calculées, on pousse l'enfant du centre calculé vers une direction éloignée du centre en utilisant les dégâts de la balle comme force.
ja: 各子について、最初に :ref:`RigidBody <class_RigidBody>` ノードかどうかを確認します。 そうである場合、次に、子ノードを基準にしてターゲットの中心位置を計算します。 次に、子ノードが中心を基準とする方向を把握します。 これらの計算された変数を使用して、弾丸の損傷を力として使用して、計算された中心から中心から離れる方向に子を押します。
zh_cn: 对于每个子节点，我们首先检查它是否是 :ref:`RigidBody <class_RigidBody>` 节点。 如果是，我们然后计算目标相对于子节点的中心位置。 然后我们计算出子节点相对于中心的方向。 使用这些计算出的变量，我们将子弹从计算中心推向远离中心的方向，使用子弹的损伤作为力。

source: We multiply the damage by ``12`` so it has a more dramatic effect. You can change this to a higher or lower value depending on how explosively you want your targets to shatter.
es: Multiplicamos el daño por ``12`` para que tenga un efecto más dramático. Puedes cambiar esto a un valor más alto o más bajo dependiendo de la explosividad con la que quieras que se rompan tus objetivos.
fr: On multiplie les dégâts par ``12`` de façon à avoir un effet plus dramatique. Vous pouvez changer ceci à une valeur plus basse ou plus élevée en fonction du degré d'explosion souhaité pour vos cibles détruites.
ja: ダメージに ``12`` を掛けると、より劇的な効果が得られます。 ターゲットをどの程度爆発的に粉砕したいかに応じて、これを高い値または低い値に変更できます。

source: Next, we set the target's respawn timer. We set the timer to ``TARGET_RESPAWN_TIME``, so it takes ``TARGET_RESPAWN_TIME`` in seconds until it is respawned.
es: A continuación, fijamos el temporizador de reposición del objetivo. Ponemos el temporizador en ``TARGET_RESPAWN_TIME``, así que toma ``TARGET_RESPAWN_TIME``en segundos hasta que se regenera.
fr: Ensuite, on fixe la minuterie de réapparition de la cible. On fixe celle-ci à ``TARGET_RESPAWN_TIME`` de façon à ce qu'il prenne ``TARGET_RESPAWN_TIME`` en secondes avant de réapparaître.
ja: 次に、ターゲットの再産出タイマーを設定します。 タイマーを ``TARGET_RESPAWN_TIME`` に設定しているため、再生成されるまで ``TARGET_RESPAWN_TIME`` 数がかかります。

source: Then we disable the non-broken target's collision shape, and set the target's visibility to ``false``.
es: Luego deshabilitamos la forma de colisión del objetivo no roto, y ponemos la visibilidad del objetivo en ``false``.
fr: Nous désactivons ensuite les collision shapes des cibles non détruites et on met la visibilité de la cible à ``false``.
ja: 次に、壊れていないターゲットのコリジョンシェイプを無効にし、ターゲットの可視性を ``false`` に設定します。
zh_cn: 然后我们禁用非破坏目标的碰撞形状，并将目标的可见性设置为“假”。

source: Make sure to set the exported ``destroyed_target`` value for ``Target.tscn`` in the editor! Otherwise the targets will not be destroyed and you will get an error!
es: ¡Asegúrate de poner el valor exportado de ``destroyed_target`` para ``Target.tscn`` en el editor! ¡De lo contrario los objetivos no serán destruidos y obtendrás un error!
fr: Assurez-vous d'assigner une valeur à celle exportée ``destroyed_target`` de ``Target.tscn`` dans l'éditeur ! Dans le cas contraire, les cibles ne seront pas détruites et vous aurez une erreur !
ja: エディタで ``Target.tscn`` にエクスポートされた ``destroyed_target`` 値を設定してください！ そうしないと、ターゲットは破壊されず、エラーが発生します！
zh_cn: 确保在编辑器中为 ``Target.tscn`` 设置导出的 ``destroyed_target`` 值！ 否则目标将不会被销毁，您将收到错误！

source: With that done, go place some ``Target.tscn`` instances around in one/both/all of the levels. You should find they explode into five pieces after they've taken enough damage. After a little while, they'll respawn into a whole target again.
es: Con eso hecho, ve a colocar algunas instancias de ``Target.tscn`` alrededor en uno/ambos/todos los niveles. Deberías encontrar que explotan en cinco pedazos después de haber recibido suficiente daño. Después de un rato, volverán a convertirse en un objetivo completo de nuevo.
fr: Ceci fait, allez placer quelques instances de ``Target.tscn`` autour de un/deux/tous les niveaux. Vous devriez les voir exploser en 5 morceaux après avoir subi suffisamment de dégâts. Après un certain temps, elles vont réapparaître en une cible intacte à nouveau.
ja: それが完了したら、1つ/両方/すべてのレベルに ``Target.tscn`` インスタンスをいくつか配置します。 十分なダメージを受けた後、それらが5つの破片に爆発することに気付くはずです。 しばらくすると、再びターゲット全体に再出現します。
zh_cn: 完成后，在一个/两个/所有级别中放置一些 ``Target.tscn`` 实例。 您会发现他们在受到足够的伤害后会爆炸成五件。 过了一会儿，他们会再次重生成一个整体目标。

source: Final notes
es: Notas finales
fr: Notes finales
ja: 最終ノート
zh_cn: 最后的笔记

source: Now you can use a joypad, change weapons with the mouse's scroll wheel, replenish your health and ammo, and break targets with your weapons.
es: Ahora puedes usar un joypad, cambiar de arma con la rueda de desplazamiento del ratón, reponer tu salud y munición, y romper objetivos con tus armas.
fr: Vous pouvez dès à présent utiliser un contrôleur, changer d’armes avec la molette de la souris, reconstituer votre santé ou vos munitions et casser des cibles avec vos armes.
ja: これで、ジョイパッドを使用し、マウスのスクロールホイールで武器を変更し、体力と弾薬を補充し、武器でターゲットを破壊できます。
zh_cn: 现在您可以使用游戏手柄，用鼠标的滚轮更换武器，补充您的健康和弹药，并用您的武器打破目标。

source: In the next part, :ref:`doc_fps_tutorial_part_five`, we're going to add grenades to our player, give our player the ability to grab and throw objects, and add turrets!
es: En la siguiente parte, :ref:`doc_fps_tutorial_part_five`, ¡vamos a añadir granadas a nuestro jugador, dándole la posibilidad de agarrar y lanzar objetos, y añadir torretas!
fr: Dans la prochaine partie, :ref:`doc_fps_tutorial_part_five`, nous allons ajouter des grenades à notre joueur, lui donner la capacité d'attraper et de lancer des objets et nous ajouterons également des tourelles !
ja: 次のパート、\ :ref:`doc_fps_tutorial_part_five` では、プレイヤーに手榴弾を追加し、プレイヤーにオブジェクトをつかんで投げる能力を与えて、さらに砲塔を追加します！
zh_cn: 在下一部分中， :ref:`doc_fps_tutorial_part_five`，我们将为我们的游戏角色添加手榴弹，让我们的游戏角色能够抓住并投掷物体，并添加炮塔！

source: If you ever get lost, be sure to read over the code again!
es: ¡Si alguna vez te pierdes, asegúrate de leer el código de nuevo!
fr: Si jamais vous vous perdez, n'oubliez pas de relire le code !
ja: 迷子になったら、必ずコードをもう一度読んでください！
zh_cn: 如果您迷路了，请务必再次阅读代码！

source: You can download the finished project for this part here: :download:`Godot_FPS_Part_4.zip <files/Godot_FPS_Part_4.zip>`
es: Puede descargar el proyecto terminado para esta parte aquí: :download:`Godot_FPS_Part_4.zip <files/Godot_FPS_Part_4.zip>`
fr: Vous pouvez télécharger le projet terminé pour cette partie ici : :download:`Godot_FPS_Part_4.zip <files/Godot_FPS_Part_4.zip>`
ja: このパートの完成したプロジェクトは、ここからダウンロードできます: :download:`Godot_FPS_Part_4.zip <files/Godot_FPS_Part_4.zip>`
zh_cn: 您可以在这里下载这个部分的完成项目: :download:`Godot_FPS_Part_4.zip <files / Godot_FPS_Part_4.zip>`

source: movement_sprint: ``Device 0, Button 4 (L, L1)``
zh_cn: movement_sprint:``设备0，按钮4(L，L1)``

source: fire: ``Device 0, Button 0 (PS Cross, XBox A, Nintendo B)``
zh_cn: fire:``设备0，按钮0(PS Cross，XBox A，Nintendo B)``

source: reload: ``Device 0, Button 0 (PS Square, XBox X, Nintendo Y)``
zh_cn: 重新加载:``设备0，按钮0(PS Square，XBox X，Nintendo Y)``

source: flashlight: ``Device 0, Button 12 (D-Pad Up)``
zh_cn: 手电筒:``设备0，按钮12(D-Pad Up)``

source: shift_weapon_positive: ``Device 0, Button 15 (D-Pad Right)``
zh_cn: shift_weapon_positive:``设备0，按钮15(D-Pad右)``

source: shift_weapon_negative: ``Device 0, Button 14 (D-Pad Left)``
zh_cn: shift_weapon_negative:``设备0，按钮14(D-Pad Left)``

source: fire_grenade: ``Device 0, Button 1 (PS Circle, XBox B, Nintendo A).``
zh_cn: fire_grenade:``设备0，按钮1(PS圈，XBox B，任天堂A).``

source: This tutorial assumes you are using a XBox 360 or a Playstation wired controller. Also, I do not (currently) have access to a Mac computer, so the joystick axes may need changing. If they do, please open a GitHub issue on the Godot documentation repository! Thanks!
zh_cn: 本教程假设您使用的是XBox 360或Playstation有线控制器。 此外，我(目前)没有访问Mac计算机，因此操纵杆轴可能需要更改。 如果有，请在Godot文档存储库中打开GitHub问题！ 谢谢！

source: You can find a great article explaining all about how to handle joypad/controller dead zones here: http://www.third-helix.com/2013/04/12/doing-thumbstick-dead-zones-right.html
zh_cn: 您可以在这里找到一篇很棒的文章解释如何处理游戏手柄/控制器死区:http://www.third-helix.com/2013/04/12/doing-thumbstick-dead-zones-right.html
