Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_three.po
Languages: es, fr, ja, zh_cn

source: If this doesn't make sense to you, don't worry too much about it. The second line of code only does not work reliably if you have multiple scenes loaded as children of the root node at a time, which will rarely happen for most projects and will not be happening in this tutorial series. This is only potentially a issue depending on how you handle scene loading.
es: Si esto no tiene sentido para ti, no te preocupes demasiado por ello. La segunda línea de código sólo no funciona de forma fiable si tienes varias escenas cargadas como hijos del nodo raíz a la vez, lo que raramente ocurrirá en la mayoría de los proyectos y no ocurrirá en esta serie de tutoriales. Esto es sólo potencialmente un problema dependiendo de cómo manejes la carga de escenas.
fr: Si cela n'a pas de sens à vos yeux, ne vous en faites pas trop. La seconde ligne de code ne fonctionne pas de façon fiable si vous avez plusieurs scènes chargées en tant qu'enfant du nœud source à la fois, ce qui n'arrive que rarement dans la plupart des projets et qui n'arrivera pas dans cette série de tutoriels. C'est un potentiel problème suivant la façon dont vous gérez le chargement de scène.
ja: これがあなたにとって意味をなさない場合、それについてあまり心配しないでください。、一度に複数のシーンがルートノードの子としてロードされている場合にのみ、コードの2行目は確実に動作しません。これは、ほとんどのプロジェクトではまず発生せず、このチュートリアルシリーズでも発生しません。しかしこれは、シーンの読み込みの処理方法によっては潜在的な問題になります。
zh_cn: 如果这对你没有意义,不要太担心.第二行代码只有在你将多个场景作为根节点的子节点同时加载的情况下才会不可靠地运行,这在大多数项目中很少发生,在本系列教程中也不会发生.这只是潜在的问题,取决于你如何处理场景加载.

source: The third line adds our newly created ``Simple_Audio_Player`` scene to be a child of the scene root. This works exactly the same as when we are spawning bullets.
es: La tercera línea añade nuestra escena recién creada ``Simple_Audio_Player`` para ser un hijo de la raíz de la escena. Esto funciona exactamente igual que cuando estamos produciendo balas.
fr: La troisième ligne ajoute notre scène nouvellement créé ``Simple_Audio_Player`` comme enfant de la scène source. Cela fonctionne exactement de la même façon que l'apparition des balles.
ja: 3行目は、新しく作成された ``Simple_Audio_Player`` シーンをシーンルートの子として追加します。これは、弾丸を産出するときとまったく同じように機能します。
zh_cn: 第三行将我们新创建的 ``Simple_Audio_Player`` 场景添加为场景根的子节点. 这与我们产生子弹时的工作方式完全相同.

source: Finally, we call the ``play_sound`` function and pass in the arguments passed in to ``create_sound``. This will call ``Simple_Audio_Player.gd``'s ``play_sound`` function with the passed in arguments.
es: Finalmente, llamamos a la función ``play_sound`` y pasamos los argumentos pasados a ``create_sound``. Esto llamará a la función ``play_sound`` del script ``Simple_Audio_Player.gd`` con los argumentos pasados.
fr: Enfin, nous appelons la fonction ``play_sound`` et on lui passe les arguments passés dans ``create_sound``. Cela va appeler la fonction ``play_sound`` de ``Simple_Audio_Player.gd`` avec les arguments passés en paramètre.
ja: 最後に、\ ``play_sound`` 関数を呼び出し、\ ``create_sound`` に渡された引数を渡します。これは、渡された引数で ``Simple_Audio_Player.gd`` の ``play_sound`` 関数を呼び出します。
zh_cn: 最后,我们调用 ``play_sound`` 函数并将传入的参数传递给 ``create_sound`` . 这将使用传入的参数调用 ``Simple_Audio_Player.gd`` 的 ``play_sound`` 函数.

source: Now all that is left is playing the sounds when we want to. Let's add sound to the pistol first!
es: Ahora todo lo que queda es tocar los sonidos cuando queramos. ¡Añadamos primero el sonido a la pistola!
fr: Maintenant, tout ce qu'il reste à faire c'est de jouer les sons quand nous le voulons. Ajoutons d'abord du son pour le pistolet d'abord !
ja: あとは、必要なときにサウンドを再生するだけです。最初にピストルに音を追加しましょう！
zh_cn: 现在剩下的就是在我们想要的时候播放声音. 让我们首先为手枪添加声音！

source: Open up ``Weapon_Pistol.gd``.
es: Abre ``Weapon_Pistol.gd``.
fr: Ouvrez ``Weapon_Pistol.gd``.
ja: ``Weapon_Pistol.gd`` を開きます.
zh_cn: 打开 ``Weapon_Pistol.gd`` .

source: Now, we want to make a noise when the player fires the pistol, so add the following to the end of the ``fire_weapon`` function:
es: Ahora, queremos hacer un ruido cuando el jugador dispara la pistola, así que añade lo siguiente al final de la función ``fire_weapon``:
fr: Le but maintenant est de faire du bruit quand le joueur tire au pistolet. Ajoutez donc ce qui suit à la fin de la fonction ``fire_weapon`` :
ja: ここで、プレイヤーがピストルを発射したときに音を立てたいので、\ ``fire_weapon`` 関数の最後に以下を追加します:
zh_cn: 现在,我们想在游戏角色发射手枪时发出噪音,所以将以下内容添加到 ``fire_weapon`` 函数的末尾:

source: Now when the player fires the pistol, we'll play the ``Pistol_shot`` sound.
es: Ahora, cuando el jugador dispare la pistola, tocaremos el sonido ``Pistol_shot``.
fr: Désormais, quand le joueur va tirer au pistolet, nous jouerons le son ``Pistol_shot``.
ja: プレイヤーがピストルを発射したら、\ ``Pistol_shot`` サウンドを再生します。
zh_cn: 现在,当游戏角色发射手枪时,我们将发出"手枪射击"的声音.

source: To make a sound when the player reloads, we need to add the following right under ``player_node.animation_manager.set_animation(RELOADING_ANIM_NAME)`` in the ``reload_weapon`` function:
es: Para hacer un sonido cuando el reproductor se recarga, necesitamos añadir lo siguiente debajo de ``player_node.animation_manager.set_animation(RELOADING_ANIM_NAME)`` en la función ``reload_weapon``:
fr: Pour émettre un son quand le joueur recharge, nous devons ajouter ce qui suit juste en dessous de ``player_node.animation_manager.set_animation(RELOADING_ANIM_NAME)`` dans la fonction ``reload_weapon`` :
ja: プレイヤーがリロードしたときに音を出すには、\ ``reload_weapon`` 関数の ``player_node.animation_manager.set_animation(RELOADING_ANIM_NAME)`` の下に以下を追加する必要があります:
zh_cn: 要在游戏角色重新加载时发出声音,我们需要在 ``reload_weapon`` 函数中的 ``player_node.animation_manager.set_animation(RELOADING_ANIM_NAME)`` 下添加以下内容:

source: Now when the player reloads, we'll play the ``Gun_cock`` sound.
es: Ahora, cuando el reproductor se recargue, tocaremos el sonido ``Gun_cock``.
fr: Désormais, quand le joueur rechargera, nous jouerons le son ``Gun_cock``.
ja: プレイヤーがリロードすると、\ ``Gun_cock`` サウンドが再生されます。
zh_cn: 现在当游戏角色重新加载时,我们将播放 ``Gun_cock`` 声音.

source: Now let's add sounds to the rifle. Open up ``Weapon_Rifle.gd``.
es: Ahora añadamos sonidos al rifle. Abre ``Weapon_Rifle.gd``.
fr: Ajoutons maintenant du son pour le fusil. Ouvrez ``Weapon_Rifle.gd``.
ja: さて、ライフルに音を加えましょう。\ ``Weapon_Rifle.gd`` を開きます。
zh_cn: 现在让我们为步枪添加声音. 打开 ``Weapon_Rifle.gd`` .

source: To play sounds when the rifle is fired, add the following to the end of the ``fire_weapon`` function:
es: Para reproducir los sonidos cuando se dispara el rifle, añada lo siguiente al final de la función ``fire_weapon``:
fr: Afin de jouer un son quand le fusil tire, ajoutez ce qui suit à la fin de la fonction ``fire_weapon`` :
ja: ライフルが発射されたときに音を鳴らすには、\ ``fire_weapon`` 関数の最後に以下を追加します:
zh_cn: 要在步枪被射击时发出声音,请将以下内容添加到 ``fire_weapon`` 函数的末尾:

source: Now when the player fires the rifle, we'll play the ``Rifle_shot`` sound.
es: Ahora, cuando el jugador dispare el rifle, tocaremos el sonido ``Rifle_shot``.
fr: Désormais, quand le joueur tire au fusil, nous jouerons le son ``Rifle_shot``.
ja: プレイヤーがライフルを発射したら、\ ``Rifle_shot`` サウンドを再生します。
zh_cn: 现在,当游戏角色发射步枪时,我们将发出"Rifle_shot"声音.

source: Final notes
es: Notas finales
fr: Notes finales
ja: 最終ノート
zh_cn: 最后的笔记

source: Now you have weapons with limited ammo that play sounds when you fire them!
es: ¡Ahora tienes armas con munición limitada que reproducen sonidos cuando las disparas!
fr: Maintenant, vous avez des armes avec des munitions limités qui jouent des sons quand vous tirez avec !
ja: 今、あなたは発射すると音が鳴る弾薬が制限された武器を手にしています！
zh_cn: 现在您拥有有限弹药的武器,当您开火时它们会播放声音！

source: At this point, we have all the basics of an FPS game working. There are still a few things that would be nice to add, and we're going to add them in the next three parts!
es: En este punto, tenemos todos los fundamentos de un juego FPS funcionando. Todavía hay algunas cosas que sería bueno añadir, y vamos a añadirlas en las próximas tres partes!
fr: À ce stade, nous avons toutes les bases fonctionnelles d'un jeu en vue FPS. Nous pourrions cependant ajouter quelques améliorations, et c'est ce que nous allons faire dans les trois prochaines parties !
ja: この時点で、FPSゲームが動作するための基本はすべて揃っています。追加するとよいと思われるものがまだいくつかあるので、次の3つのパートで追加します！
zh_cn: 至此,我们已经具备了一个FPS游戏的所有基本功能.还有一些东西可以添加,将在接下来的三个部分中添加它们!

source: For example, right now we have no way to add ammo to our spares, so we'll eventually run out. Also, we don't have anything to shoot at outside of the :ref:`RigidBody <class_RigidBody>` nodes.
es: Por ejemplo, ahora mismo no tenemos forma de añadir munición a nuestros sobrantes, así que al final se nos acabará. Además, no tenemos nada a lo que disparar fuera de los nodos :ref:`RigidBody <class_RigidBody>`.
fr: Par exemple, il n'y a à l'heure actuelle aucun moyen d'ajouter des munitions à notre stock, nous allons donc finir par en manquer. aussi, nous rien sur quoi tirer à part les nœuds :ref:`RigidBody <class_RigidBody>`.
ja: たとえば、現時点ではスペアに弾薬を追加する方法がないため、最終的には使い果たします。また、\ :ref:`RigidBody <class_RigidBody>` ノードの外側には撃てるものはありません。
zh_cn: 例如,现在我们无法为我们的备件添加弹药,所以我们最终会耗尽. 另外,我们没有任何东西可以射击 :ref:`RigidBody <class_RigidBody>` 节点.

source: In :ref:`doc_fps_tutorial_part_four` we'll add some targets to shoot at, along with some health and ammo pick ups! We're also going to add joypad support, so we can play with wired Xbox 360 controllers!
es: En :ref:`doc_fps_tutorial_part_four` añadiremos algunos objetivos a los que disparar, junto con algunas recogidas de salud y munición! También vamos a añadir soporte para joypad, para que podamos jugar con los mandos de la Xbox 360 por cable!
fr: Dans :ref:`doc_fps_tutorial_part_four`, nous ajoutons quelques cibles sur lesquelles tirer accompagnées de quelques items permettant de regagner de la vie et des munitions ! Nous allons également ajouter le support des manettes afin que nous puissions jouer avec des manettes Xbox 360 filaires !
ja: :ref:`doc_fps_tutorial_part_four` では、回復アイテムと弾薬のピックアップに加えて、射撃するターゲットを追加します！ジョイパッドのサポートも追加するため、有線のXbox 360コントローラーで遊ぶことができます！
zh_cn: 在:参考:`doc_fps_tutorial_part_four`我们将添加一些射击目标,以及一些健康和弹药拾取！ 我们还将添加joypad支持,因此我们可以使用有线Xbox 360控制器！

source: If you ever get lost, be sure to read over the code again!
es: ¡Si alguna vez te pierdes, asegúrate de leer el código de nuevo!
fr: Si jamais vous vous perdez, n'oubliez pas de relire le code !
ja: 迷子になったら、必ずコードをもう一度読んでください！
zh_cn: 如果你感到迷茫,请一定要再读一遍代码！

source: You can download the finished project for this part here: :download:`Godot_FPS_Part_3.zip <files/Godot_FPS_Part_3.zip>`
es: Puede descargar el proyecto terminado para esta parte aquí: :download:`Godot_FPS_Part_3.zip <files/Godot_FPS_Part_3.zip>`
fr: Vous pouvez télécharger le projet terminé pour cette partie ici : :download:`Godot_FPS_Part_3.zip <files/Godot_FPS_Part_3.zip>`
ja: このパートの完成したプロジェクトは、ここからダウンロードできます: :download:`Godot_FPS_Part_3.zip <files/Godot_FPS_Part_3.zip>`
zh_cn: 您可以在这里下载这个部分的完成项目: :download:`Godot_FPS_Part_3.zip <files / Godot_FPS_Part_3.zip>`
