Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_five.po
Languages: de, es, fr, ja, zh_cn

source: All this code does is call ``bullet_hit`` on whatever node to which ``path_to_turret_root`` leads. Go back to the editor and assign the :ref:`NodePath <class_NodePath>` to the ``Turret`` node.
es: Todo lo que este código hace es llamar ``bullet_hit`` en cualquier nodo al que ``path_to_turret_root`` lleva. Vuelve al editor y asigna el :ref:`NodePath <class_NodePath>` al nodo ``Turret``.
fr: Tout ce que ce code fait, c'est d’appeler ``bullet_hit`` sur n'importe quel nœud où mène ``path_to_turret_root``. Revenez à l'éditeur et assignez le :ref:`NodePath <class_NodePath>` au nœud ``Turret``.
ja: このコードは単に、\ ``path_to_turret_root`` で導かれるあらゆるノードで ``bullet_hit`` を呼び出します。エディタに戻り、\ :ref:`NodePath <class_NodePath>` を ``Turret`` ノードに割り当てます。

source: Now select the other :ref:`StaticBody <class_StaticBody>` node (either in ``Body`` or ``Head``) and assign ``TurretBodies.gd`` script to it. Once the script is attached, assign again the :ref:`NodePath <class_NodePath>` to the ``Turret`` node.
es: Ahora selecciona el otro nodo :ref:`StaticBody <class_StaticBody>` (ya sea en ``Body`` o ``Head``) y asígnale el script ``TurretBodies.gd``. Una vez que el script se adjunta, asigna de nuevo el nodo :ref:`NodePath <class_NodePath>` al nodo ``Turret``.
fr: Sélectionnez maintenant l'autre nœud :ref:`StaticBody <class_StaticBody>`(que ce soit dans ``Body`` ou dans ``Head``) et assignez lui le script ``TurretBodies.gd``. Une fois le script attaché, assignez de nouveau le :ref:`NodePath <class_NodePath>` au nœud ``Turret``.
ja: 次に、他の :ref:`StaticBody <class_StaticBody>` ノード(``Body`` または ``Head`` のいずれか)を選択し、\ ``TurretBodies.gd`` スクリプトを割り当てます。スクリプトがアタッチされたら、再び :ref:`NodePath <class_NodePath>` を ``Turret`` ノードに割り当てます。
zh_cn: 现在选择另一个 :ref:`StaticBody <class_StaticBody>` 节点(在 ``Body`` 或 ``Head`` 中)并为其指定 ``TurretBodies.gd`` 脚本。 附加脚本后，再次将 :ref:`NodePath <class_NodePath>` 分配给 ``Turret`` 节点。

source: The last thing we need to do is add a way for the player to be hurt. Since all the bullets use the ``bullet_hit`` function, we need to add that function to the player.
es: Lo último que debemos hacer es agregar una forma para que el jugador resulte herido. Como todas las balas usan la función `` bullet_hit``, necesitamos agregar esa función al jugador.
fr: La dernière chose que nous devons ajouter, c'est une façon pour le joueur d'être blessé. Puisque toutes les balles utilisent la fonction ``bullet_hit``, nous devons ajouter cette fonction au joueur.
ja: 最後に行う必要があるのは、プレイヤーを傷つける方法を追加することです。すべての弾丸は ``bullet_hit`` 関数を使用するため、プレイヤーにその関数を追加する必要があります。

source: Open ``Player.gd`` and add the following:
de: Öffnen Sie ``Player.gd`` und fügen Sie Folgendes hinzu:
es: Abre ``Player.gd`` y añade lo siguiente:
fr: Ouvrez ``Player.gd`` et ajoutez ce qui suit :
ja: ``Player.gd`` を開き、次のように追加します:
zh_cn: 打开 ``Player.gd`` 并添加以下内容:

source: With all that done, you should have fully operational turrets! Go place a few in one/both/all of the scenes and give them a try!
es: Con todo eso hecho, ¡deberíais tener torretas totalmente operativas! ¡Ve a colocar algunas en una/ambas/todas las escenas y pruébalas!
fr: Avec tout ceci fait, vous avez désormais des tourelles complètement opérationnelles ! Allez en placer quelques unes dans un/deux ou toutes les scènes et essayez par vous-même !
ja: すべて完了したら、完全に機能する砲塔を実際に手にすべきです！ 1つ/両方/すべてのシーンにいくつか配置して、試してみてください！
zh_cn: 完成所有这些后，您应该拥有完全可操作的炮塔！ 在一个/两个/所有场景中进行几次尝试！

source: Final notes
de: Schlussbemerkungen
es: Notas finales
fr: Notes finales
ja: 最終ノート
zh_cn: 最后的笔记

source: Now you can pick up :ref:`RigidBody <class_RigidBody>` nodes and throw grenades. We now also have turrets to fire at the player.
es: Ahora puedes coger :ref:`RigidBody <class_RigidBody>` nodos y lanzar granadas. Ahora también tenemos torretas para disparar al jugador.
fr: Vous pouvez maintenant récupérer des nœuds :ref:`RigidBody <class_RigidBody>` et lancer des grenades. Nous avons également des tourelles qui tirent sur le joueur.
ja: これで :ref:`RigidBody <class_RigidBody>` ノードを取得して手榴弾を投げることができます。 また、プレイヤーを攻撃するための砲塔もあります。
zh_cn: 现在您可以拿起 :ref:`RigidBody <class_RigidBody>` 节点并投掷手榴弹。 我们现在也有炮塔射击游戏角色。

source: In :ref:`doc_fps_tutorial_part_six`, we're going to add a main menu and a pause menu, add a respawn system for the player, and change/move the sound system so we can use it from any script.
es: En: ref: `doc_fps_tutorial_part_six`, vamos a agregar un menú principal y un menú de pausa, agregar un sistema de reaparición (respawn) para el jugador y cambiar/mover el sistema de sonido para que podamos usarlo desde cualquier script.
fr: Dans :ref:`doc_fps_tutorial_part_six`, nous allons ajouter un menu principal et un menu de pause, ajouter un système de respawn pour le joueur et changer/déplacer le système de son de façon à pouvoir l'utiliser dans n'importe quel script.
ja: :ref:`doc_fps_tutorial_part_six` では、メインメニューと一時停止メニューを追加し、プレイヤーの再出現システムを追加し、任意のスクリプトから使用できるようにサウンドシステムを変更/移動します。
zh_cn: 在 :ref:`doc_fps_tutorial_part_six`中，我们将添加一个主菜单和一个暂停菜单，为游戏角色添加重新生成的系统，以及更改/移动声音系统，以便我们可以从任何脚本中使用它。

source: If you ever get lost, be sure to read over the code again!
de: Wenn Sie jemals die Orientierung verlieren, lesen Sie den Code unbedingt noch einmal durch!
es: ¡Si alguna vez te pierdes, asegúrate de leer el código de nuevo!
fr: Si jamais vous vous perdez, n'oubliez pas de relire le code !
ja: 迷子になったら、必ずコードをもう一度読んでください！
zh_cn: 如果您迷路了，请务必再次阅读代码！

source: You can download the finished project for this part here: :download:`Godot_FPS_Part_5.zip <files/Godot_FPS_Part_5.zip>`
de: Sie können das fertige Projekt für diesen Teil hier herunterladen: :download:`Godot_FPS_Teil_5.zip <files/Godot_FPS_Teil_5.zip>`
es: Puede descargar el proyecto terminado para esta parte aquí: :download:`Godot_FPS_Part_5.zip <files/Godot_FPS_Part_5.zip>`
fr: Vous pouvez télécharger le projet terminé pour cette partie ici : :download:`Godot_FPS_Part_5.zip <files/Godot_FPS_Part_5.zip>`
ja: このパートの完成したプロジェクトは、ここからダウンロードできます: :download:`Godot_FPS_Part_5.zip <files/Godot_FPS_Part_5.zip>`
zh_cn: 您可以在这里下载这个部分的完成项目: :download:`Godot_FPS_Part_5.zip <files / Godot_FPS_Part_5.zip>`

source: see :ref:`Ray-casting <doc_ray-casting>` for more information on raycasting in Godot.
ja: Godotでのレイキャストの詳細については :ref:`レイキャスティング <doc_ray-casting>` を参照してください。
zh_cn: 请参阅 :ref:`Ray-casting <doc_ray-casting>` 了解有关Godot的光线投射的更多信息。
