Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_two.po
Languages: es, fr, ja, zh_cn

source: Open up ``Knife_Point`` and you'll find an :ref:`Area <class_Area>` node. We are using an :ref:`Area <class_Area>` for the knife because we only care for all the bodies close to us, and because our knife does not fire into space. If we were making a throwing knife, we would likely spawn a bullet object that looks like a knife.
es: Abre el ``Knife_Point`` y encontrarás un nodo :ref:`Area <clasS_Area>`. Estamos usando un :ref:`Area <class_Area>` para el cuchillo porque sólo nos preocupamos por todos los cuerpos cercanos a nosotros, y porque nuestro cuchillo no dispara al espacio. Si hiciéramos un cuchillo lanzador, probablemente generaríamos un objeto bala que se parece a un cuchillo.
fr: Ouvrez ``Knife_Point`` et vous trouverez un nœud :ref:`Area <class_Area>`. Nous utilisons un :ref:`Area <class_Area>>` pour le couteau parce que nous nous occupons seulement de tous les corps proches de nous, et parce que notre couteau ne tire pas dans l'espace. Si nous fabriquions un couteau à lancer, nous produirions probablement un objet de balle qui ressemble à un couteau.
ja: ``Knife_Point`` を開くと :ref:`Area <class_Area>` ノードが見つかります。私たちはナイフに :ref:`Area <class_Area>` を使用しています。なぜなら、私たちは身近なすべての体だけを気にし、ナイフを空間に発射しないからです。投げナイフを作っている場合は、ナイフのように見える弾丸オブジェクトを生成する可能性があります。

source: Finally, we have ``Pistol_Point``. This is the point where we will be creating/instancing our bullet objects. We do not need any additional nodes here, as the bullet handles all of its own collision detection.
es: Finalmente, tenemos ``Pistol_Point``. Este es el punto donde crearemos/iniciaremos nuestros objetos bala. No necesitamos ningún nodo adicional aquí, ya que la bala maneja toda su propia detección de colisiones.
fr: Enfin, nous avons ``Pistol_Point``. C'est à ce moment-là que nous allons créer/instancier nos objets balles. Nous n'avons pas besoin de nœuds supplémentaires ici, car la balle gère sa propre détection de collision.
ja: 最後に、\ ``Pistol_Point`` があります。これが、弾丸オブジェクトを作成/インスタンス化するポイントです。弾丸は独自の衝突検出をすべて自分で処理するため、ここに追加のノードは必要ありません。
zh_cn: 最后，我们有了 ``Pistol_Point`` 。 这是我们将创建/实例化子弹对象的点。 我们这里不需要任何额外的节点，因为子弹处理它自己的所有碰撞检测。

source: Now that we've seen how we will handle our other weapons, and where we will spawn the bullets, let's start working on making them work.
es: Ahora que hemos visto como manejaremos nuestras otras armas, y donde engendraremos las balas, empecemos a trabajar en hacerlas funcionar.
fr: Maintenant que nous avons vu comment nous allons manipuler nos autres armes et où nous allons fabriquer les balles, commençons à travailler pour qu'elles fonctionnent.
ja: 他の武器をどのように扱うか、そして弾丸をどこで生成するかを見てきたので、それらを機能させるための作業を始めましょう。
zh_cn: 现在我们已经看到了我们将如何处理我们的其他武器，以及我们将在哪里产生子弹，让我们开始努力让它们发挥作用。

source: You can also look at the HUD nodes if you want. There is nothing fancy there and other than using a single :ref:`Label <class_Label>`, we will not be touching any of those nodes. Check :ref:`doc_design_interfaces_with_the_control_nodes` for a tutorial on using GUI nodes.
es: También puedes mirar los nodos del HUD si quieres. No hay nada elegante allí y aparte de usar un simple :ref:`Label <class_Label>`, no tocaremos ninguno de esos nodos. Revisa :ref:`doc_design_interfaces_with_the_control_nodes`` para ver un tutorial sobre el uso de los nodos GUI.
fr: Vous pouvez également regarder les nœuds HUD si vous le souhaitez. Il n'y a rien d'extravagant et à part l'utilisation d'un seul :ref:`Label <class_Label>`, nous ne toucherons aucun de ces nœuds. Vérifier :ref:`doc_design_interfaces_with_the_control_nodes` pour un tutoriel sur l'utilisation des nœuds GUI.
ja: 必要に応じてHUDノードを確認することもできます。そこに特別なものはなく、単一の :ref:`Label <class_Label>` を使用すること以外、これらのノードには触れません。 GUIノードの使用に関するチュートリアルについては、\ :ref:`doc_design_interfaces_with_the_control_nodes` を確認してください。
zh_cn: 如果需要，您还可以查看HUD节点。 除了使用单个参考之外没有任何花哨的东西 :ref:`Label <class_Label>`，我们不会触及任何这些节点。 检查 :ref:`doc_design_interfaces_with_the_control_nodes`获取有关使用GUI节点的教程。

source: Creating the first weapon
es: Creando la primera arma
fr: Créer la première arme
ja: 最初の武器を作成する
zh_cn: 创造第一个武器

source: Lets write the code for each of our weapons, starting with the pistol.
es: Escribamos el código de cada una de nuestras armas, empezando por la pistola.
fr: Écrivons le code de chacune de nos armes, en commençant par le pistolet.
ja: ピストルから始めて、各武器のコードを書きましょう。
zh_cn: 让我们为每个武器编写代码，从手枪开始。

source: Select ``Pistol_Point`` (``Player`` -> ``Rotation_Helper`` -> ``Gun_Fire_Points`` -> ``Pistol_Point``) and create a new script called ``Weapon_Pistol.gd``.
es: Selecciona ``Pistol_Point`` (``Player`` -> ``Rotation_Helper`` -> ``Gun_Fire_Points`` -> ``Pistol_Point``) y crea un nuevo script llamado ``Weapon_Pistol.gd``.
fr: Sélectionnez ``Pistolet_Point`` (``Player`` -> ``Rotation_Helper`` -> ``Gun_Fire_Points`` -> ``Pistol_Point``) et créez un nouveau script appelé ``Weapon_Pistol.gd``.
ja: ``Pistol_Point`` (``Player`` -> ``Rotation_Helper`` -> ``Gun_Fire_Points`` -> ``Pistol_Point``) を選択し、\ ``Weapon_Pistol.gd`` という新しいスクリプトを作成します。
zh_cn: 选择 ``Pistol_Point`` (``Player`` ->` `Rotation_Helper`` ->` `Gun_Fire_Points`` ->` `Pistol_Point``)并创建一个名为``Weapon_Pistol.gd``的新脚本。

source: Add the following code to ``Weapon_Pistol.gd``:
es: Añade el siguiente código a ``Weapon_Pistol.gd``:
fr: Ajoutez le code suivant à ``Weapon_Pistol.gd`` :
ja: 次のコードを ``Weapon_Pistol.gd`` に追加します:
zh_cn: 将以下代码添加到``Weapon_Pistol.gd``:

source: Let's go over how the script works.
es: Repasemos cómo funciona el script.
fr: Voyons comment fonctionne le script.
ja: スクリプトの仕組みを見ていきましょう。
zh_cn: 让我们回顾一下脚本的工作原理。

source: First we define some class variables we'll need in the script:
es: Primero definimos algunas variables de clase que necesitaremos en el script:
fr: Tout d'abord, nous définissons quelques variables de classe dont nous aurons besoin dans le script :
ja: 最初に、スクリプトで必要なクラス変数を定義します:
zh_cn: 首先，我们在脚本中定义一些我们需要的类变量:

source: ``DAMAGE``: The amount of damage a single bullet does.
es: ``DAMAGE``: La cantidad de daño que hace una sola bala.
fr: ``DAMAGE`` : L'ampleur des dommages causés par une seule balle.
ja: ``DAMAGE``: 1つの弾丸が与えるダメージの量。
zh_cn: ``DAMAGE``:单个子弹造成的伤害量。

source: ``IDLE_ANIM_NAME``: The name of the pistol's idle animation.
es: ``IDLE_ANIM_NAME``: El nombre de la animación en reposo de la pistola.
fr: ``IDLE_ANIM_NAME`` : Le nom de l'animation d'inactivité du pistolet.
ja: ``IDLE_ANIM_NAME``: ピストルのアイドルアニメーションの名前。
zh_cn: ``IDLE_ANIM_NAME``:手枪空闲动画的名称。

source: ``FIRE_ANIM_NAME``: The name of the pistol's fire animation.
es: ``FIRE_ANIM_NAME``: El nombre de la animación de disparo de la pistola.
fr: ``FIRE_ANIM_NAME`` : Le nom de l'animation de tir du pistolet.
ja: ``FIRE_ANIM_NAME``: ピストルの発射アニメーションの名前。
zh_cn: ``FIRE_ANIM_NAME``:手枪的火焰动画的名称。

source: ``is_weapon_enabled``: A variable for checking whether this weapon is in use/enabled.
es: ``is_weapon_enabled``: Una variable para comprobar si esta arma está en uso o habilitada.
fr: ``is_weapon_enabled`` : Variable permettant de vérifier si cette arme est utilisée/activée.
ja: ``is_weapon_enabled``: この武器が使用中か有効かを確認するための変数。
zh_cn: ``is_weapon_enabled``:用于检查此武器是否正在使用/启用的变量。

source: ``bullet_scene``: The bullet scene we worked on earlier.
es: ``bullet_scene``: La escena de la bala en la que trabajamos antes.
fr: ``bullet_scene`` : La scène de la balle sur laquelle on a travaillé plus tôt.
ja: ``bullet_scene``: 先ほど作業した弾丸のシーン。
zh_cn: ``bullet_scene``:我们之前处理的子弹场景。

source: ``player_node``: A variable to hold ``Player.gd``.
es: ``player_node``: Una variable para mantener ``Player.gd``.
fr: ``player_node`` : Une variable pour contenir ``Player.gd``.
ja: ``player_node``: ``Player.gd`` を保持する変数。
zh_cn: ``player_node``:一个容纳 ``Player.gd`` 的变量。

source: The reason we define most of these variables is so we can use them in ``Player.gd``.
es: La razón por la que definimos la mayoría de estas variables es para poder usarlas en ``Player.gd``.
fr: La raison pour laquelle nous définissons la plupart de ces variables est que nous pouvons les utiliser dans ``Player.gd``.
ja: これらの変数のほとんどを定義するのは、\ ``Player.gd`` で使用できるようにするためです。
zh_cn: 我们定义大多数这些变量的原因是我们可以在 ``Player.gd`` 中使用它们。

source: Each of the weapons we'll make will have all these variables (minus ``bullet_scene``) so we have a consistent interface to interact with in ``Player.gd``. By using the same variables/functions in each weapon, we can interact with them without having to know which weapon we are using, which makes our code much more modular because we can add weapons without having to change much of the code in ``Player.gd`` and it will just work.
es: Cada una de las armas que haremos tendrá todas estas variables (menos ``bullet_scene``) así que tenemos una interfaz uniforme para interactuar en ``Player.gd``. Usando las mismas variables/funciones en cada arma, podemos interactuar con ellas sin tener que saber qué arma estamos usando, lo que hace que nuestro código sea mucho más modular porque podemos añadir armas sin tener que cambiar mucho del código en ``Player.gd`` y sencillamente funcionará.
fr: Chacune des armes que nous fabriquerons aura toutes ces variables (moins ``bullet_scene``) donc nous avons une interface cohérente pour interagir avec ``Player.gd``. En utilisant les mêmes variables/fonctions dans chaque arme, nous pouvons interagir avec elles sans avoir à savoir quelle arme nous utilisons, ce qui rend notre code beaucoup plus modulaire parce que nous pouvons ajouter des armes sans avoir à changer une grande partie du code dans ``Player.gd``et ça fonctionne.
ja: 作成する各武器にはこれらすべての変数が含まれるため("bullet_scene"を除く)、\ ``Player.gd`` でやり取りするための一貫したインターフェイスがあります。 各武器で同じ変数/関数を使用することで、使用している武器を知らなくてもそれらとやり取りできます。これにより、\ ``Player.gd`` の多くのコードを変更することなく武器を追加できるため、コードがよりモジュール化され、上手く動作します。

source: We could write all the code in ``Player.gd``, but then ``Player.gd`` will get increasingly harder to manage as we add weapons. By using a modular design with a consistent interface, we can keep ``Player.gd`` nice and neat, while also making it easier to add/remove/modify weapons.
es: Podríamos escribir todo el código en ``Player.gd``, pero entonces ``Player.gd`` será cada vez más difícil de manejar a medida que agreguemos armas. Usando un diseño modular con una interfaz consistente, podemos mantener ``Player.gd`` limpio y agradable, mientras que también es más fácil añadir/quitar/modificar armas.
fr: Nous pourrions écrire tout le code dans ``Player.gd``, mais ensuite ``Player.gd`` sera de plus en plus difficile à gérer à mesure que nous ajouterons des armes. En utilisant une conception modulaire avec une interface cohérente, nous pouvons garder ``Player.gd`` agréable et soigné, tout en facilitant l'ajout, la suppression et la modification d'armes.
ja: すべてのコードを ``Player.gd`` に書くこともできますが、そこに武器を追加すると ``Player.gd`` の管理がますます難しくなります。一貫したインターフェースを備えたモジュール設計を使用することで、\ ``Player.gd`` をきちんとした状態に保つとともに、武器の追加/削除/変更を容易にします。

source: In ``_ready`` we simply pass over it.
es: En ``_ready`` simplemente pasamos por encima.
fr: Dans ``_ready``, nous ne faisons que passer.
ja: ``_ready`` では、単にそれをパスします。
zh_cn: 在 ``_ready`` 中我们简单地将它传递过来。

source: There is one thing of note though, an assumption that we'll fill in ``Player.gd`` at some point.
es: Sin embargo, hay una cosa importante, la suposición de que en algún momento rellenaremos ``Player.gd``.
fr: Il y a une chose à noter cependant, l'hypothèse que nous allons remplir ``Player.gd`` à un moment.
ja: ただし、注意すべき点が1つあります。ある時点で ``Player.gd`` を書き込むという前提です。
zh_cn: 但有一点值得注意，我们假设我们会在某些时候填写“Player.gd”。

source: We are going to assume that ``Player.gd`` will pass themselves in before calling any of the functions in ``Weapon_Pistol.gd``.
es: Vamos a asumir que ``Player.gd`` se pasará a sí mismo antes de llamar a cualquiera de las funciones en ``Weapon_Pistol.gd``.
fr: Nous allons supposer que ``Player.gd`` passe lui-mêmes en avant l'appel à des fonctions de ``Weapon_Pistol.gd``.
ja: ``Weapon_Pistol.gd`` の関数のいずれかを呼び出す前に、\ ``Player.gd`` が自身を渡すと前提しています。
zh_cn: 我们假设 ``Player.gd`` 会在调用 ``Weapon_Pistol.gd`` 中的任何函数之前自行传递。

source: While this can lead to situations where the player does not pass themselves in (because we forget), we would have to have a long string of ``get_parent`` calls to traverse up the scene tree to retrieve the player. This does not look pretty (``get_parent().get_parent().get_parent()`` and so on) and it is relatively safe to assume we will remember to pass ourselves to each weapon in ``Player.gd``.
es: Aunque esto puede llevar a situaciones en las que el jugador no se pasa (porque nos olvidamos), tendríamos que tener una larga string de ``get_parent`` para atravesar el árbol de la escena para recuperar al jugador. Esto no se ve bien (``get_parent().get_parent().get_parent()`` y así sucesivamente) y es relativamente seguro asumir que nos acordaremos de pasarnos a cada arma en ``Player.gd``.
fr: Bien que cela puisse conduire à des situations où le joueur ne se passe pas lui-même (parce que nous oublions), nous aurions besoin d'une longue chaîne d'appels ``get_parent`` pour parcourir l'arbre de scène pour récupérer le joueur. Cela n'a pas l'air joli (``get_parent().get_parent().get_parent()`` et ainsi de suite) et il est relativement sûr de supposer que nous allons nous rappeler de nous passer à chaque arme dans ``Player.gd``.
ja: これは、プレイヤーが自分自身を渡さないという(問題のある)状況につながる可能性がありますが(忘れているため)、プレイヤーを取得するためにシーンツリーを走査するには、長い文字列の ``get_parent`` の呼び出しが必要です。これは見た目が良く無く(``get_parent().get_parent().get_parent()`` など)、\ ``Player.gd`` 内の各武器に自分自身を渡すことを忘れないでおくという考え方は比較的安全です。
zh_cn: 虽然这可能导致游戏角色没有进入自己的情况(因为我们忘记)，但我们必须有一长串 ``get_parent`` 调用来遍历场景树以检索游戏角色。 这看起来不太漂亮(``get_parent()。get_parent()。get_parent()``依此类推)假设我们会记得将自己传递给``Player.gd``中的每个武器，这是相对安全的。

source: Next let's look at ``fire_weapon``:
es: A continuación, veamos el ``fire_weapon``:
fr: Ensuite regardons ``fire_weapon`` :
ja: 次に ``fire_weapon`` を見てみましょう:
zh_cn: 接下来让我们看看``fire_weapon``:

source: The first thing we do is instance the bullet scene we made earlier.
es: Lo primero que hacemos es instanciar la escena de la bala que hicimos antes.
fr: La première chose que nous faisons, c'est instancier la scène balles que nous avons faite tout à l'heure.
ja: 最初に行うことは、先ほど作成した弾丸シーンのインスタンス化です。
zh_cn: 我们做的第一件事就是我们之前制作的子弹场景。

source: By instancing the scene, we are creating a new node holding all the node(s) in the scene we instanced, effectively cloning that scene.
es: Al instanciar la escena, estamos creando un nuevo nodo que contiene todos los nodos de la escena que instanciamos, clonando efectivamente esa escena.
fr: En instanciant la scène, nous créons un nouveau nœud contenant tous les nœuds de la scène que nous avons instanciée, clonant effectivement cette scène.
ja: シーンをインスタンス化することにより、インスタンス化したシーン内のすべてのノードを保持する新しいノードを作成し、そのシーンを効果的に複製します。

source: Then we add a ``clone`` to the first child node of the root of the scene we are currently in. By doing this, we're making it a child of the root node of the currently loaded scene.
es: Luego añadimos un ``clone`` al primer nodo hijo de la raíz de la escena en la que estamos. Haciendo esto, lo convertimos en un hijo del nodo raíz de la escena actualmente cargada.
fr: Ensuite, nous ajoutons un ``clone`` au premier nœud enfant de la racine de la scène dans laquelle nous sommes actuellement. En faisant cela, nous en faisons un enfant du nœud racine de la scène actuellement chargée.
ja: 次に、現在のシーンのルートの最初の子ノードに ``clone`` を追加します。これにより、現在ロードされているシーンのルートノードの子になります。

source: In other words, we are adding a ``clone`` as a child of the first node (whatever is at the top of the scene tree) in the currently loaded/opened scene. If the currently loaded/open scene is ``Testing_Area.tscn``, we'd be adding our ``clone`` as a child of ``Testing_Area``, the root node in that scene.
es: En otras palabras, estamos añadiendo un ``clone`` como hijo del primer nodo (lo que esté en la parte superior del árbol de la escena) en la escena actualmente cargada/abierta. Si la escena actualmente cargada/abierta es ``Testing_Area.tscn``, añadiremos nuestro ``clon`` como hijo de ``Testing_Area``, el nodo raíz de esa escena.
fr: En d'autres termes, nous ajoutons un ``clone`` en tant qu'enfant du premier nœud (ce qui se trouve en haut de l'arbre de scène) dans la scène actuellement chargée/ouverte. Si la scène actuellement chargée/ouverte est ``Testing_Area.tscn``, nous ajouterions notre ``clone`` en tant qu'enfant de ``Testing_Area``, le nœud racine dans cette scène.
ja: 言い換えると、現在ロードされている/開かれているシーンの最初のノード(シーンツリーの一番上にあるもの)の子として ``clone`` を追加しています。現在ロードされている/開いているシーンが ``Testing_Area.tscn`` の場合、そのシーンのルートノードである ``Testing_Area`` の子として ``clone`` を追加します。
zh_cn: 换句话说，我们在当前加载/打开的场景中添加一个 ``clone`` 作为第一个节点的子节点(无论在场景树的顶部)。 如果当前加载/打开的场景是 ``Testing_Area.tscn`` ，我们将把 ``clone`` 添加为 ``Testing_Area`` 的子项，这是该场景中的根节点。

source: As mentioned later below in the section on adding sounds, this method makes an assumption. This will be explained later in the section on adding sounds in :ref:`doc_fps_tutorial_part_three`
es: Como se menciona más adelante en la sección sobre la adición de sonidos, este método hace una suposición. Esto se explicará más adelante en la sección sobre la adición de sonidos en :ref:`doc_fps_tutorial_part_three`
fr: Comme mentionné plus loin dans la section sur l'ajout de sons, cette méthode fait une hypothèse. Ceci sera expliqué plus loin dans la section sur l'ajout de sons dans :ref:`doc_fps_tutorial_part_three`
ja: サウンドの追加に関するセクションで後述するように、この方法は推定を行います。これについては、後ほど :ref:`doc_fps_tutorial_part_three` でサウンドを追加するセクションで説明します

source: Next we set the global transform of the clone to the ``Pistol_Point``'s global transform. The reason we do this is so the bullet is spawned at the end of the pistol.
es: A continuación establecemos la transformación global del clon en la transformación global de ``Pistol_Point``. La razón por la que hacemos esto es para que la bala salga al final de la pistola.
fr: Ensuite, nous réglons la transformation globale du clone sur la transformation globale du ``Pistol_Point``. La raison pour laquelle nous faisons cela, c'est pour que la balle soit crée à l'extrémité du pistolet.

source: You can see that ``Pistol_Point`` is positioned right at the end of the pistol by clicking the :ref:`AnimationPlayer <class_AnimationPlayer>` and scrolling through ``Pistol_fire``. You'll find the position is more or less at the end of the pistol when it fires.
es: Puedes ver que el ``Pistol_Point`` está colocado justo al final de la pistola haciendo clic en el :ref:`AnimationPlayer <class_AnimationPlayer>` y desplazándote a través de ``Pistol_fire``. Verás que la posición está más o menos al final de la pistola cuando ésta dispara.
fr: Vous pouvez voir que ``Pistol_Point`` est positionné au bout du pistolet en cliquant sur le bouton :ref:`AnimationPlayer <class_AnimationPlayer>` et en faisant défiler ``Pistol_fire``. Vous verrez que la position est plus ou moins à l'extrémité du pistolet quand il tire.

source: Next we scale it up by a factor of ``4`` because the bullet scene is a little too small by default.
es: Luego los escalamos por un factor de ``4`` porque la escena de la bala es un poco demasiado pequeña por defecto.
fr: Ensuite, nous mettons à l'échelle d'un facteur de ``4`` parce que la scène balle est un peu trop petite par défaut.
ja: 次に、弾丸のシーンはデフォルトでは少し小さすぎるため、\ ``4`` の係数でスケールアップします。
zh_cn: 接下来我们将它扩大一倍因为“4”，因为子弹场景默认情况下有点太小了。

source: Then we set the bullet's damage (``BULLET_DAMAGE``) to the amount of damage a single pistol bullet does (``DAMAGE``).
es: Entonces fijamos el daño de la bala (``BULLET_DAMAGE``) a la cantidad de daño que hace una sola bala de pistola (``DAMAGE``).
fr: Ensuite, nous fixons les dommages de la balle (``BULLET_DAMAGE``) à la quantité de dommages causés par une seule balle de pistolet (``DAMAGE``).
ja: 次に、弾丸のダメージ(``BULLET_DAMAGE``)を1つのピストルの弾丸が与えるダメージの量(``DAMAGE``) 設定します。

source: Now let's look at ``equip_weapon``:
es: Ahora veamos el ``equip_weapon``:
fr: Regardons maintenant ``equip_weapon`` :
ja: では、\ ``equip_weapon`` を見てみましょう:
zh_cn: 现在让我们来看看`equip_weapon``:

source: The first thing we do is check to see whether the animation manager is in the pistol's idle animation. If we are in the pistol's idle animation, we set ``is_weapon_enabled`` to ``true`` and return ``true`` because the pistol has successfully been equipped.
es: Lo primero que hacemos es comprobar si el encargado de la animación está en la animación de la pistola en reposo. Si estamos en la animación de la pistola, ponemos ``is_weapon_enabled`` en ``true`` y devolvemos ``true`` porque la pistola ha sido equipada exitosamente.
fr: La première chose que nous faisons est de vérifier si le gestionnaire d'animation est dans l'animation d'inactivité du pistolet. Si nous sommes dans l'animation d'inactivité du pistolet, nous réglons ``is_weapon_enabled`` sur ``true`` et retournons ``true`` parce que le pistolet a été équipé avec succès.
ja: 最初に行うことは、アニメーションマネージャーがピストルのアイドルアニメーション中であるかどうかを確認することです。ピストルのアイドルアニメーション中の場合、ピストルが正常に装備されているため、\ ``is_weapon_enabled`` を ``true`` に設定し、\ ``true`` を返します。

source: Because we know our pistol's ``equip`` animation automatically transitions to the pistol's idle animation, if we are in the pistol's idle animation the pistol must have finished playing the equip animation.
es: Porque sabemos que la animación ``equip`` de nuestra pistola pasa automáticamente a la animación de la pistola en reposo, si estamos en la animación de la pistola en reposo, la pistola debe haber terminado de reproducir la animación del equipo.
fr: Parce que nous savons que l'animation ``equip`` de notre pistolet passe automatiquement à l'animation d'inactivité du pistolet, si nous sommes dans l'animation d'inactivité du pistolet, le pistolet doit logiquement avoir terminé de jouer l'animation d'équipement.
ja: ピストルの ``equip`` アニメーションは自動的にピストルのアイドルアニメーションに移行することがわかっているため、ピストルのアイドルアニメーション中の場合、ピストルは装備(equip)アニメーションの再生を完了している必要があります。
zh_cn: 因为我们知道我们的手枪的“装备”动画会自动转换为手枪的空闲动画，如果我们在手枪的空闲动画中，手枪必须完成播放装备动画。

source: We know these animations will transition because we wrote the code to make them transition in ``Animation_Manager.gd``
es: Sabemos que estas animaciones harán la transición porque escribimos el código para hacer la transición en ``Animation_Manager.gd``
fr: Nous savons que ces animations seront en transition parce que nous avons écrit le code pour les faire transitionner dans ``Animation_Manager.gd``
ja: これらのアニメーションが遷移することは、\ ``Animation_Manager.gd`` で遷移させるコードを記述したので知っているはずです
zh_cn: 我们知道这些动画将会转换，因为我们编写了代码以使它们在 ``Animation_Manager.gd`` 中转换

source: Next we check to see if the player is in the ``Idle_unarmed`` animation state. Because all unequipping animations go to this state, and because any weapon can be equipped from this state, we change animations to ``Pistol_equip`` if the player is in the ``Idle_unarmed`` state.
es: A continuación comprobamos si el jugador está en el estado de animación ``Idle_unarmed``. Debido a que todas las animaciones no equipadas van a este estado, y debido a que cualquier arma puede ser equipada desde este estado, cambiamos las animaciones de ``Pistol_equip`` si el jugador está en el estado "Idle_unarmed".
fr: Ensuite, nous vérifions si le joueur est dans l'état d'animation ``Idle_unarmed``. Parce que toutes les animations non équipées vont dans cet état, et parce que n'importe quelle arme peut être équipée à partir de cet état, nous changeons les animations en ``Pistol_equip`` si le joueur est dans l'état ``Idle_unarmed``.
ja: 次に、プレイヤーが ``Idle_unarmed`` アニメーション状態にあるかどうかを確認します。すべての装備解除アニメーションがこの状態になり、この状態から武器を装備できるため、プレイヤーが ``Idle_unarmed`` 状態にある場合、アニメーションを ``Pistol_equip`` に変更します。
zh_cn: 接下来我们检查游戏角色是否处于“Idle_unarmed”动画状态。 因为所有非装备动画都会进入这种状态，并且因为任何武器都可以从这种状态装备，所以如果游戏角色处于“Idle_unarmed”状态，我们会将动画更改为“Pistol_equip”。
