Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_six.po
Languages: es, fr, ja, zh_cn

source: If ``Globals.gd`` is turning off the display, we then check to see if ``debug_display`` is not equal to ``null``. If ``debug_display`` is not equal to ``null``, then ``Globals.gd`` must have a debug display currently active. If ``Globals.gd`` has a debug display active, we free it using ``queue_free`` and then assign ``debug_display`` to ``null``.
es: Si ``Globals.gd`` está apagando la pantalla, entonces comprobamos si ``debug_display`` no es igual a ``null``. Si ``debug_display`` no es igual a ``null``, entonces ``Globals.gd`` debe tener una pantalla de depuración actualmente activa. Si ``Globals.gd`` tiene una pantalla de depuración activa, la liberamos usando ``queue_free`` y luego asignamos ``debug_display`` a ``null``.
fr: Si ``Globals.gd`` est en train d'éteindre l'affichage, on vérifie alors si ``debug_display`` n'est pas égal à ``null``. Si c'est le cas, ``Globals.gd`` doit avoir un affichage de débogage actif. Si ``Globals.gd`` a un affichage de débogage actif, on le libère en utilisant ``queue_free`` et on assigne ``null`` à ``debug_display``.
ja: ``Globals.gd`` がディスプレイをオフにしている場合、\ ``debug_display`` が ``null`` と等しくないかどうかを確認します。\ ``debug_display`` が ``null`` と等しくない場合、\ ``Globals.gd`` には現在アクティブなデバッグ表示が必要です。\ `` Globals.gd`` がデバッグ表示をアクティブにしている場合、\ ``queue_free`` を使用してそれを解放し、\ ``null`` を ``debug_display`` に割り当てます。
zh_cn: 如果 ``Globals.gd`` 正在关闭显示，我们检查 ``debug_display`` 是否不等于 ``null`` 。 如果 ``debug_display`` 不等于 ``null`` ，那么 ``Globals.gd`` 必须有一个当前有效的调试显示。 如果 ``Globals.gd`` 的调试显示处于活动状态，我们使用 ``queue_free`` 释放它，然后将 ``debug_display`` 分配给 ``null`` 。

source: If ``Globals.gd`` is turning on the display, we then check to make sure ``Globals.gd`` do not already have a debug display active. We do this by making sure ``debug_display`` is equal to ``null``. If ``debug_display`` is ``null``, we instance a new ``DEBUG_DISPLAY_SCENE``, and add it as a child of ``canvas_layer``.
es: Si ``Globals.gd`` está encendiendo la pantalla, entonces comprobamos que ``Globals.gd`` no tenga ya una pantalla de depuración activa. Lo hacemos asegurándonos de que ``debug_display`` es igual a ``null``. Si ``debug_display`` es ``null``, ponemos una nueva ``DEBUG_DISPLAY_SCENE``, y la añadimos como un hijo de ``canvas_layer``.
fr: Si ``Globals.gd`` allume l'affichage, on s'assure que ``Globals.gd`` n'a pas déjà un affichage de débogage actif. On s'en assure en vérifiant si ``debug_display`` est égal à ``null``. Si c'est le cas, on instancie une nouvelle ``DEBUG_DISPLAY_SCENE`` et on l'ajoute en tant que fils de ``canvas_layer``.
ja: ``Globals.gd`` がディスプレイをオンにしている場合、\ ``Globals.gd`` のデバッグディスプレイがまだアクティブになっていないことを確認します。これを行うには、\ ``debug_display`` が ``null`` と等しくなるようにします。\ ``debug_display`` が ``null`` の場合、新しい ``DEBUG_DISPLAY_SCENE`` をインスタンス化し、それを ``canvas_layer`` の子として追加します。
zh_cn: 如果 ``Globals.gd`` 打开显示器，我们检查以确保 ``Globals.gd`` 没有激活调试显示。 我们通过确保 ``debug_display`` 等于 ``null`` 来做到这一点。 如果 ``debug_display`` 是``null``，我们实例化一个新的 ``DEBUG_DISPLAY_SCENE`` ，并将其添加为 ``canvas_layer`` 的子节点。

source: With that done, we can now toggle the debug display on and off by switching the :ref:`CheckButton <class_CheckButton>` in the ``Options_Menu`` panel. Go give it a try!
es: Una vez hecho esto, ahora podemos activar y desactivar la pantalla de depuración cambiando el :ref:`CheckButton <class_CheckButton>` en el panel ``Options_Menu``. ¡Inténtalo!
fr: Ceci fait, on peut activer ou désactiver l'affichage en cochant ou décochant le :ref:`CheckButton <class_CheckButton>` dans le panneau ``Options_Menu``. Essayez !
ja: これで、\ ``Options_Menu`` パネルの :ref:`CheckButton <class_CheckButton>` を切り替えることで、デバッグ表示のオンとオフを切り替えることができます。試してみてください！
zh_cn: 完成后，我们现在可以通过在 ``Options_Menu`` 面板中切换 :ref:`CheckButton <class_CheckButton>` 来打开和关闭调试显示。 去尝试吧！

source: Notice how the debug display stays even when you change scenes from the ``Main_Menu.tscn`` to another scene (like ``Testing_Area.tscn``). This is the beauty of instancing/spawning nodes in a singleton/autoload and adding them as children to the singleton/autoload. Any of the nodes added as children of the singleton/autoload will stay for as long as the game is running, without any additional work on our part!
es: Observa cómo la pantalla de depuración permanece incluso cuando cambias escenas del ``Menu_Main.tscn`` a otra escena (como ``Testing_Area.tscn``). Esta es la belleza de instanciar/generar nodos en un singleton/autoload y añadirlos como hijos al singleton/autoload. Cualquiera de los nodos añadidos como hijos del singleton/autoload permanecerán mientras el juego esté en marcha ¡sin ningún trabajo adicional por nuestra parte!
fr: Notez comme l'affichage de débogage reste même après que vous ayez changé de scène du ``Main_Menu.tscn`` à une autre scène (comme ``Testing_Area.tscn``). C'est là toute la beauté de l'instanciation de nœuds dans un singleton et de les ajouter comme enfant de ce même singleton. N'importe quel nœud ajouté en tant qu'enfant du singleton va rester tant que le jeu tourne sans aucun travail supplémentaire de votre part !
ja: シーンを ``Main_Menu.tscn`` から別のシーン(``Testing_Area.tscn`` など)に変更しても、デバッグ表示がどのように維持されるかに注意してください。これは、シングルトン/自動読み込みにノードをインスタンス化/生成し、それらをシングルトン/自動読み込みに子として追加することの美しさです。シングルトン/自動読み込みの子として追加されたノードは、ゲームが実行されている限り、追加作業なしで残ります！
zh_cn: 请注意，即使将“Main_Menu.tscn`”中的场景更改为另一个场景(如“Testing_Area.tscn``)，调试显示仍然保持不变。 这是单例/自动加载中实例化/生成节点的美妙之处，并将它们作为子元素添加到单例/自动加载中。 作为单件/自动加载的子节点添加的任何节点将在游戏运行期间保持不变，而我们没有任何额外的工作！

source: Adding a pause menu
es: Añadir un menú de pausa
fr: Ajouter un menu de pause
ja: 一時停止メニューの追加
zh_cn: 添加暂停菜单

source: Let's add a pause menu so we can return to the main menu when we press the ``ui_cancel`` action.
es: Añadamos un menú de pausa para que podamos volver al menú principal cuando presionemos la acción ``ui_cancel``.
fr: Ajoutons un menu de pause afin de pouvoir retourner au menu principal quand on appuie sur l'action ``ui_cancel``.
ja: 一時停止メニューを追加して、\ ``ui_cancel`` アクションを押したときにメインメニューに戻ることができるようにします。
zh_cn: 让我们添加一个暂停菜单，这样当我们按下 ``ui_cancel`` 动作时我们可以返回主菜单。

source: Open up ``Pause_Popup.tscn``.
es: Abre ``Pause_Popup.tscn``.
fr: Ouvrez ``Pause_Popup.tscn``.
ja: ``Pause_Popup.tscn`` を開きます。
zh_cn: 打开 ``Pause_Popup.tscn`` 。

source: Notice how the root node in ``Pause_Popup`` is a :ref:`WindowDialog <class_WindowDialog>`; :ref:`WindowDialog <class_WindowDialog>` inherits from :ref:`Popup <class_Popup>`, which means :ref:`WindowDialog <class_WindowDialog>` can act like a popup.
es: Fíjate en cómo el nodo raíz en ``Pause_Popup`` es un :ref:`WindowDialog <class_WindowDialog>`; :ref:`WindowDialog <class_WindowDialog>` hereda de :ref:`Popup <class_Popup>`, lo que significa que :ref:`WindowDialog <class_WindowDialog>` puede actuar como un popup.
fr: Notez comment le nœud racine dans ``Pause_Popup`` est une :ref:`WindowDialog <class_WindowDialog>`. :ref:`WindowDialog <class_WindowDialog>` hérite de :ref:`Popup <class_Popup>`, ce qui signifie que :ref:`WindowDialog <class_WindowDialog>` peut agir comme un popup.
ja: ``Pause_Popup`` のルートノードが :ref:`WindowDialog <class_WindowDialog>` であることに注意してください。\ :ref:`WindowDialog <class_WindowDialog>` は :ref:`Popup <class_Popup>` から継承します。つまり、\ :ref:`WindowDialog <class_WindowDialog>` はポップアップのように機能します。

source: Select ``Pause_Popup`` and scroll down all the way till you get to the ``Pause`` menu in the inspector. Notice how the pause mode is set to ``process`` instead of ``inherit`` like it is normally set by default. This makes it so it will continue to process even when the game is paused, which we need in order to interact with the UI elements.
es: Selecciona ``Pause_Popup`` y desplázate hacia abajo hasta llegar al menú ``Pause`` del inspector. Observe cómo el modo de pausa está configurado como ``process`` en lugar de ``inherit`` como se establece normalmente por defecto. Esto hace que continúe procesándose incluso cuando el juego está en pausa, lo cual necesitamos para poder interactuar con los elementos de la UI.
fr: Sélectionnez ``Pause_Popup`` et descendez jusqu'à atteindre le menu ``Pause`` dans l'inspecteur. Remarquez comme le mode de pause est mis à ``process`` au lieu de ``inherit`` qui est le paramètre par défaut. Cela fera en sorte qu'il est possible de continuer les traitements même quand le jeu est en pause (nous allons en avoir besoin pour interagir avec les éléments UI).
ja: ``Pause_Popup`` を選択し、インスペクタの ``Pause`` メニューに到達するまで下にスクロールします。一時停止モードが、デフォルトで通常設定されているように、\ ``inherit`` ではなく ``process`` に設定されていることに注意してください。これにより、ゲームが一時停止されている場合でも処理を続行します。これは、UI要素と対話するために必要です。

source: Now that we've looked at how ``Pause_Popup.tscn`` is set up, let's write the code to make it work. Normally, we'd attach a script to the root node of the scene, ``Pause_Popup`` in this case, but since we'll need to receive a couple of signals in ``Globals.gd``, we'll write all the code for the popup there.
es: Ahora que hemos visto como ``Pause_Popup.tscn`` está configurado, escribamos el código para que funcione. Normalmente, adjuntaríamos un script al nodo raíz de la escena, ``Pause_Popup`` en este caso, pero como necesitaremos recibir un par de señales en ``Globals.gd``, escribiremos todo el código para el popup allí.
fr: Maintenant que nous avons vu comment ``Pause_Popup.tscn`` est mis en place, écrivons le code pour le faire fonctionner. Nous voudrions normalement attacher un script au nœud racine de la scène, ``Pause_Popup`` dans notre cas mais parce que nous allons avoir besoin de recevoir des signaux dans ``Globals.gd``, nous allons écrire tous le code pour le popup là dedans.
ja: ``Pause_Popup.tscn`` の設定方法を確認したので、それを機能させるコードを書きましょう。通常、シーンのルートノード、この場合は ``Pause_Popup`` にスクリプトをアタッチしますが、\ ``Globals.gd`` でいくつかのシグナルを受信する必要があるため、ポップアップのすべてのコードをそこに記述します。

source: ``MAIN_MENU_PATH``: The path to the main menu scene.
es: ``MAIN_MENU_PATH``: La ruta a la escena del menú principal.
fr: ``MAIN_MENU_PATH``: Le chemin vers la scène de menu principal.
ja: ``MAIN_MENU_PATH``: メインメニューシーンへのパス。
zh_cn: ``MAIN_MENU_PATH``:主菜单场景的路径。

source: ``POPUP_SCENE``: The pop up scene we looked at earlier.
es: ``POPUP_SCENE``: La escena pop up que vimos antes.
fr: ``POPUP_SCENE``: La scène de popup que nous avons exploré tout à l'heure.
ja: ``POPUP_SCENE``: 先ほど見たポップアップシーン。
zh_cn: ``POPUP_SCENE``:我们之前看过的弹出场景。

source: ``popup``: A variable to hold the pop up scene.
es: ``popup``: Una variable para mantener la escena pop up.
fr: ``popup``: Une variable pour stocker la scène de popup.
ja: ``popup``: ポップアップシーンを保持する変数。
zh_cn: ``popup``:一个用于保存弹出场景的变量。

source: Now we need to add ``_process`` to ``Globals.gd`` so it can respond when the ``ui_cancel`` action is pressed. Add the following to ``_process``:
es: Ahora tenemos que añadir ``_process`` a ``Globals.gd`` para que pueda responder cuando la acción ``ui_cancel`` sea presionada. Añade lo siguiente a ``_process``:
fr: Maintenant, nous devons ajouter ``_process`` à ``Globals.gd`` de façon à ce qu'il puisse répondre quand l'action ``ui_cancel`` est appuyé. Ajoutez ce qui suit dans ``_process`` :
ja: ここで ``_process`` を ``Globals.gd`` に追加して、\ ``ui_cancel`` アクションが押されたときに応答できるようにします。\ ``_process`` に以下を追加します:
zh_cn: 现在我们需要将 ``_process`` 添加到 ``Globals.gd`` 中，这样当按下 ``ui_cancel`` 动作时它就会响应。 将以下内容添加到``_process``:

source: Let's go over what's happening here.
es: Repasemos lo que está pasando aquí.
fr: Voyons ce qui s'y passe.
ja: ここで何が起こっているのか見ていきましょう。
zh_cn: 让我们回顾一下这里发生的事情。

source: Firstly, we check to see if the ``ui_cancel`` action is pressed. Then, we check to make sure ``Globals.gd`` does not already have a ``popup`` open by checking to see if ``popup`` is equal to ``null``.
es: En primer lugar, comprobamos si la acción ``ui_cancel`` está presionada. Luego, comprobamos que ``Globals.gd`` no tenga ya un ``popup`` abierto comprobando si el ``popup`` es igual a ``null``.
fr: Tout d'abord, nous devons vérifier si l'action ``ui_cancel`` est appuyé. Ensuite, nous nous assurons que ``Globals.gd``n'a pas de ``popup`` ouvert en vérifiant si ``popup`` est égal à ``null``.
ja: まず、\ ``ui_cancel`` アクションが押されているかどうかを確認します。次に、\ ``popup`` が ``null`` に等しいかどうかを確認することにより、\ ``Globals.gd`` が ``popup`` を開いていないことを確認します。

source: If ``Globals.gd`` do not have a pop-up open, we instance ``POPUP_SCENE`` and assign it to ``popup``.
es: Si ``Globals.gd`` no tiene una ventana emergente abierta, escribimos ``POPUP_SCENE`` y la asignamos a ``popup``.
fr: Si ``Globals.gd`` ne possède pas de popup ouvert, on instancie ``POPUP_SCENE`` et on l'assigne à ``popup``.
ja: ``Globals.gd`` がポップアップが開いていない場合、\ ``POPUP_SCENE`` をインスタンス化し、それを ``popup`` に割り当てます。

source: We then get the quit button and assign its ``pressed`` signal to ``popup_quit``, which we will be adding shortly.
es: Entonces obtenemos el botón de salir y asignamos su señal de ``pressed`` a ``popup_quit``, que añadiremos en breve.
fr: On récupère ensuite le bouton quitter et on l'assigne son signal ``pressed`` à ``popup_quit`` qui sera ajouté bientôt.
ja: 次に、終了ボタンを取得し、その ``pressed`` シグナルを ``popup_quit`` に割り当てます。この関数は少し先で追加します。
zh_cn: 然后我们得到退出按钮并将它的 ``pressed`` 信号分配给 ``popup_quit`` ，我们将很快添加。

source: Next, we assign both the ``popup_hide`` signal from the :ref:`WindowDialog <class_WindowDialog>` and the ``pressed`` signal from the resume button to ``popup_closed``, which we will be adding shortly.
es: A continuación, asignamos tanto la señal ``popup_hide`` de la :ref:`WindowDialog <class_WindowDialog>` como la señal ``pressed`` del botón de reanudación a ``popup_closed``, que añadiremos en breve.
fr: Ensuite, on assigne le signal ``popup_hide`` de la :ref:`WindowDialog <class_WindowDialog>` et le signal ``pressed`` du bouton de reprise à ``popup_closed``, que nous allons ajouter bientôt.
ja: 次に、\ :ref:`WindowDialog <class_WindowDialog>` からの ``popup_hide`` シグナルと、再開ボタンからの ``pressed`` シグナルの両方を ``popup_closed`` に割り当てます。

source: Then, we add ``popup`` as a child of ``canvas_layer`` so it's drawn on top. We then tell ``popup`` to pop up at the center of the screen using ``popup_centered``.
es: Luego, agregamos ``popup`` como un hijo de ``canvas_layer`` para que se dibuje en la parte superior. Luego le decimos al ``popup`` que aparezca en el centro de la pantalla usando ``popup_centered``.
fr: Ensuite, nous ajoutons ``popup`` en tant qu'enfant de ``canvas_layer`` de façon à ce qu'il se dessine au dessus. On dit ensuite au ``popup`` de s'afficher au centre de l'écran en utilisant ``popup_centered``.
ja: 次に、\ ``canvas_layer`` の子として ``popup`` を追加して、上に描画されるようにします。次に、\ ``popup_centered`` を使用して、画面の中央にポップアップするように ``popup`` に指示します。

source: Next, we make sure the mouse mode is ``MOUSE_MODE_VISIBLE`` so the player can interact with the pop-up. If we did not do this, the player would not be able to interact with the pop up in any scene where the mouse mode is ``MOUSE_MODE_CAPTURED``.
es: A continuación, nos aseguramos de que el modo del ratón es ``MOUSE_MODE_VISIBLE`` para que el jugador pueda interactuar con el pop-up. Si no lo hiciéramos, el jugador no podría interactuar con el pop-up en ninguna escena en la que el modo del ratón sea ``MOUSE_MODE_CAPTURED``.
fr: Nous nous assurons alors que le mode de la souris est ``MOUSE_MODE_VISIBLE`` pour que le joueur puisse interagir avec le popup. Si nous ne faisions pas cela, le joueur ne serait capable d'interagir avec le popup dans aucune scène où le mode de la souris est ``MOUSE_MODE_CAPTURED``.
ja: 次に、マウスモードが ``MOUSE_MODE_VISIBLE`` になっていることを確認して、プレイヤーがポップアップを操作できるようにします。これを行わなかった場合、プレイヤーは、マウスモードが ``MOUSE_MODE_CAPTURED`` のシーンでポップアップを操作できなくなります。

source: Finally, we pause the entire :ref:`SceneTree <class_SceneTree>`.
es: Finalmente, hacemos una pausa en todo el :ref:`SceneTree <class_SceneTree>`.
fr: Enfin, on met en pause toute la :ref:`SceneTree <class_SceneTree>`.
ja: 最後に、\ :ref:`SceneTree <class_SceneTree>` 全体を一時停止します。
zh_cn: 最后，我们暂停整个 :ref:`SceneTree <class_SceneTree>`。

source: For more information on pausing in Godot, see :ref:`doc_pausing_games`
es: Para más información sobre la pausa en Godot, ver :ref:`doc_pausing_games`
fr: Pour plus d'informations sur la pause dans Godot, voir :ref:`doc_pausing_games`
ja: Godotでの一時停止の詳細については、\ :ref:`doc_pausing_games` を参照してください
zh_cn: 有关在Godot中暂停的更多信息，请参阅 :ref:`doc_pausing_games`

source: Now, we need to add the functions to which we've connected the signals. Let's add ``popup_closed`` first.
es: Ahora, necesitamos añadir las funciones a las que hemos conectado las señales. Primero agreguemos ``popup_closed``.
fr: Maintenant, nous devons ajouter des fonctions auxquelles sont connectés les signaux. Ajoutons ``popup_closed`` en premier.
ja: 次に、シグナルを接続した関数を追加する必要があります。最初に ``popup_closed`` を追加しましょう。

source: Add the following to ``Globals.gd``:
es: Añade lo siguiente a ``Globals.gd``:
fr: ajoutez ce qui suit dans ``Globals.gd`` :
ja: 以下を ``Globals.gd``に追加します:
zh_cn: 将以下内容添加到``Globals.gd``:

source: ``popup_closed`` will resume the game and destroy the pop-up if there is one.
es: ``popup_cerrado`` reanudará el juego y destruirá el popup si lo hay.
fr: ``popup_closed`` va reprendre le jeu et détruire le popup s'il y en a un.
ja: ``popup_closed`` はゲームを再開し、ポップアップがあればそれを破棄します。

source: ``popup_quit`` is similar, but we're also making sure the mouse is visible and changing scenes to the title screen.
es: ``popup_quit`` es similar, pero también nos aseguramos de que el ratón esté visible y cambiamos las escenas a la pantalla de título.
fr: ``popup_quit``est similaire, mais nous nous assurons que la souris soit visible et change de scène pour le menu principal.
ja: ``popup_quit`` も似ていますが、マウスを見えるようにし、シーンをタイトル画面に変更することも確認しています。
zh_cn: ``popup_quit``类似，但我们也确保鼠标可见并将场景更改为标题屏幕。

source: ``popup_quit`` will resume the game, set the mouse mode to ``MOUSE_MODE_VISIBLE`` to ensure the mouse is visible in the main menu, destroy the pop-up if there is one, and change scenes to the main menu.
es: ``popup_quit`` reanudará el juego, establece el modo del ratón en ``MOUSE_MODE_VISIBLE`` para asegurar que el ratón esté visible en el menú principal, destruye el pop-up si lo hay, y cambia las escenas al menú principal.
fr: ``popup_quit`` va reprendre le jeu, mettre le mode de la souris à ``MOUSE_MODE_VISIBLE`` pour s'assurer que la souris soit visible dans le menu principal, détruire le popup s'il y en a un et changer la scène pour le menu principal.
ja: ``popup_quit`` はゲームを再開し、マウスモードを ``MOUSE_MODE_VISIBLE`` に設定して、マウスがメインメニューに表示されるようにし、ポップアップがあればポップアップを破棄し、シーンをメインメニューに変更します。

source: Before we're ready to test the pop-up, we should change one thing in ``Player.gd``.
es: Antes de que estemos listos para probar el pop-up, deberíamos cambiar una cosa en ``Player.gd``.
fr: Avant de pouvoir tester le popup, nous devons changer une chose dans ``Player.gd``.
ja: ポップアップをテストする準備が整う前に、\ ``Player.gd`` の1つを変更する必要があります。

source: Open up ``Player.gd`` and in ``process_input``, change the code for capturing/freeing the cursor to the following:
es: Abre ``Player.gd`` y en ``process_input``, cambia el código para capturar/liberar el cursor a lo siguiente:
fr: Ouvrez ``Player.gd`` et dans ``process_input``, changez le code pour capturer/libérer le curseur pour ce qui suit :
ja: ``Player.gd`` を開き、\ ``process_input`` で、カーソルをキャプチャ/解放するためのコードを次のように変更します:
zh_cn: 打开 ``Player.gd`` 并在 ``process_input`` 中，将捕获/释放光标的代码更改为以下内容:

source: Instead of:
es: En lugar de:
fr: Au lieu de :
ja: これの代わりに:
zh_cn: 代替:

source: You will leave only:
es: Sólo te vas a ir:
fr: Vous ne laisserez que :
ja: これだけを残します:
zh_cn: 您只会离开:

source: Now, instead of capturing/freeing the mouse, we check whether the current mouse mode is ``MOUSE_MODE_VISIBLE``. If it is, we set it back to ``MOUSE_MODE_CAPTURED``.
es: Ahora, en lugar de capturar/liberar el ratón, comprobamos si el modo actual del ratón es ``MOUSE_MODE_VISIBLE``. Si lo es, lo ponemos de nuevo en ``MOUSE_MODE_CAPTURED``.
fr: Maintenant, au lieu de capturer/libérer la souris, on vérifie si le mode courant de la souris est ``MOUSE_MODE_VISIBLE``. Si c'est le cas, on le remet à ``MOUSE_MODE_CAPTURED``.
ja: ここで、マウスをキャプチャ/解放する代わりに、現在のマウスモードが ``MOUSE_MODE_VISIBLE`` であるかどうかを確認します。そうである場合、\ ``MOUSE_MODE_CAPTURED`` に戻します。

source: Because the pop-up makes the mouse mode ``MOUSE_MODE_VISIBLE`` whenever you pause, we no longer have to worry about freeing and capturing the cursor in ``Player.gd``.
es: Debido a que el pop-up hace que el modo del ratón ``MOUSE_MODE_VISIBLE`` cada vez que se hace una pausa, ya no tenemos que preocuparnos de liberar y capturar el cursor en ``Player.gd``.
fr: Parce que le popup rend le mode de la souris ``MOUSE_MODE_VISIBLE``, quand vous mettez le jeu en pause, nous n'avons plus à nous soucier de libérer et capturer le curseur dans ``Player.gd``.
ja: ポップアップは一時停止するたびにマウスモードを ``MOUSE_MODE_VISIBLE`` にするため、\ ``Player.gd`` でカーソルを解放してキャプチャすることを心配する必要がなくなりました。

source: Now the pause menu pop-up is finished. You can now pause at any point in the game and return to the main menu!
es: Ahora que el pop-up del menú de la pausa ha terminado. ¡Ahora puedes hacer una pausa en cualquier punto del juego y volver al menú principal!
fr: Maintenant, le popup du menu de pause est terminé. Vous pouvez mettre en pause à n'importe quel moment et retourner au menu principal !
ja: これで一時停止メニューのポップアップが終了しました。ゲームの任意の時点で一時停止して、メインメニューに戻ることができます！

source: Starting the respawn system
es: Iniciando el sistema de regeneración
fr: Commencer le système de réapparition
ja: 再出現システムの開始
zh_cn: 启动重生系统

source: Since the player can lose all their health, it would be ideal if the player died and respawned too, so let's add that next!
es: Ya que el jugador puede perder toda su salud, sería ideal que el jugador muriera y volviera a nacer también, ¡así que añadamos eso a continuación!
fr: Puise que le joueur peut perdre toute sa vie, il serait idéal que le joueur réapparaisse s'il meurt, c'est donc ce que nous allons faire !
ja: プレイヤーは体力をすべて失う可能性があるため、プレイヤーが死亡して復活する事が理想的です。次はそれを追加しましょう！
zh_cn: 由于游戏角色可以失去所有的健康，如果游戏角色死亡和重生，那将是理想的，所以让我们接下来添加！

source: Firstly, open up ``Player.tscn`` and expand ``HUD``. Notice how there is a :ref:`ColorRect <class_ColorRect>` called ``Death_Screen``. When the player dies, we're going to make ``Death_Screen`` visible, and show them how long they have to wait before the player is able to respawn.
es: En primer lugar, abre ``Player.tscn`` y expande ``HUD``. Fíjate en cómo hay una :ref:`ColorRect <class_ColorRect>` llamada ``Death_Screen``. Cuando el jugador muera, vamos a hacer visible la ``Death_Screen``, y mostrarles cuánto tiempo tienen que esperar antes de que el jugador sea capaz de volver a aparecer.
fr: Premièrement, ouvrez ``Player.tscn`` et développez ``HUD``. Vous remarquerez qu'il existe un :ref:`ColorRect <class_ColorRect>` appelé ``Death_Screen``. Quand le joueur meurt, nous allons rendre ``Death_Screen`` visible et lui montrer combien de temps il doit attendre avant que le joueur puisse réapparaitre.
ja: まず、\ ``Player.tscn`` を開き、\ ``HUD`` を展開します。\ ``Death_Screen`` という :ref:`ColorRect <class_ColorRect>` があることに注意してください。プレイヤーが死んだとき、\ ``Death_Screen`` を表示し、プレイヤーが再出現できるようになるまで待機する時間を表示します。

source: Open up ``Player.gd`` and add the following class variables:
es: Abre ``Player.gd`` y añade las siguientes variables de clase:
fr: Ouvrez ``Player.gd`` et ajouter les variables de classe suivantes :
ja: ``Player.gd`` を開き、以下のクラス変数を追加してください:
zh_cn: 打开 ``Player.gd`` 并添加以下类变量:

source: ``RESPAWN_TIME``: The amount of time (in seconds) it takes to respawn.
es: ``RESPAWN_TIME``: La cantidad de tiempo (en segundos) que se tarda en reaparecer.
fr: ``RESPAWN_TIME``: Le temps qu'il faut (en secondes) pour que joueur réapparaisse.
ja: ``RESPAWN_TIME``: 再出現にかかる時間(秒単位)。
zh_cn: ``RESPAWN_TIME``:重生的时间(以秒为单位)。
