Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_one.po
Languages: es, fr, zh_cn

source: Finally, we clamp the ``rotation_helper``'s ``X`` rotation to be between ``-70`` and ``70`` degrees so the player cannot rotate themselves upside down.
es: Por último, fijamos la rotación X de ``rotation_helper`` entre ``-70`` y ``70`` grados para que el jugador no pueda girar al revés.
fr: Finalement, nous bloquons la rotation ``X`` de ``rotation_helper`` pour qu'elle soit entre ``-70`` et ``70`` degrés afin que le joueur ne puisse pas se tourner la tête en bas.
zh_cn: 最后，我们将 ``rotation_helper`` 的 ``X`` 旋转夹在 ``-70`` 和 ``70`` 度之间，这样游戏角色就不能自己颠倒了。

source: See :ref:`using transforms <doc_using_transforms>` for more information on rotating transforms.
es: Ver :ref:`using transforms <doc_using_transforms>` para más información sobre las transformaciones rotativas.
fr: Voir :ref:`using transforms <doc_using_transforms>` pour plus d'informations sur les transformations en rotation.

source: To test the code, open up the scene named ``Testing_Area.tscn``, if it's not already opened up. We will be using this scene as we go through the next few tutorial parts, so be sure to keep it open in one of your scene tabs.
es: Para probar el código, abre la escena llamada ``Testing_Area.tscn``, si no está ya abierta. Usaremos esta escena a medida que vayamos avanzando en las próximas partes del tutorial, así que asegúrate de mantenerla abierta en una de tus pestañas de escenas.
fr: Pour tester le code, ouvrez la scène nommée ``Testing_Area.tscn``, si elle n'est pas déjà ouverte. Nous utiliserons cette scène au cours des prochaines parties du tutoriel, assurez-vous donc de la garder ouverte dans l'un des onglets de votre scène.

source: Go ahead and test your code either by pressing ``F6`` with ``Testing_Area.tscn`` as the open tab, by pressing the play button in the top right corner, or by pressing ``F5``. You should now be able to walk around, jump in the air, and look around using the mouse.
fr: Allez-y et testez votre code soit en appuyant sur ``F6`` avec ``Testing_Area.tscn`` comme onglet ouvert, soit en appuyant sur le bouton play dans le coin supérieur droit, soit en appuyant sur ``F5``. Vous devriez maintenant être capable de marcher, de sauter dans les airs et de regarder autour de vous à l'aide de la souris.

source: Giving the player a flash light and the option to sprint
es: Dando al jugador una linterna y la opción de esprintar
fr: Donner au joueur une lampe flash et la possibilité de sprinter
zh_cn: 为游戏角色提供闪光灯和冲刺选项

source: Before we get to making the weapons work, there are a couple more things we should add.
es: Antes de que lleguemos a hacer funcionar las armas, hay un par de cosas más que deberíamos añadir.
fr: Avant de commencer à faire fonctionner les armes, il y a quelques autres choses que nous devrions ajouter.

source: Many FPS games have an option to sprint and a flashlight. We can easily add these to our player, so let's do that!
es: Muchos juegos de FPS tienen una opción para correr y una linterna. Podemos fácilmente añadirlas a nuestro jugador, ¡así que hagámoslo!
fr: De nombreux jeux FPS ont une option pour le sprint et une lampe de poche. Nous pouvons les ajouter facilement à notre joueur, alors faisons-le !
zh_cn: 许多FPS游戏都可以选择冲刺和手电筒。 我们可以轻松地将这些添加到我们的游戏角色中，所以让我们这样做！

source: First we need a few more class variables in our player script:
es: Primero necesitamos unas cuantas variables de clase más en nuestro script de jugador:
fr: Tout d'abord, nous avons besoin de quelques variables de classe supplémentaires dans notre script de joueur :
zh_cn: 首先，我们需要在游戏角色脚本中添加更多类变量:

source: All the sprinting variables work exactly the same as the non sprinting variables with similar names.
es: Todas las variables de sprint funcionan exactamente igual que las variables de no sprint con nombres similares.
fr: Toutes les variables de sprint fonctionnent exactement de la même manière que les variables non sprint avec des noms similaires.

source: ``is_sprinting`` is a boolean to track whether the player is currently sprinting, and ``flashlight`` is a variable we will be using to hold the player's flash light node.
es: ``is_sprinting`` es una booleana para saber si el jugador está corriendo, y "flashlight" es una variable que usaremos para mantener el nodo de la luz de la linterna del jugador.
fr: ``is_sprinting`` est un booléen pour savoir si le joueur est en train de sprinter, et ``flashlight`` est une variable que nous allons utiliser pour tenir le nœud de lumière flash du joueur.
zh_cn: ``is_sprinting``是一个布尔值来跟踪游戏角色当前是否正在冲刺，而'`flashlight``是我们用来保持游戏角色闪光灯节点的变量。

source: Now we need to add a few lines of code, starting in ``_ready``. Add the following to ``_ready``:
es: Ahora tenemos que añadir unas cuantas líneas de código, empezando por ``_ready``. Añade lo siguiente a ``_ready``:
fr: Il nous faut maintenant ajouter quelques lignes de code, en commençant par ``_ready``. Ajouter ce qui suit à ``_ready`` :
zh_cn: 现在我们需要添加几行代码，从 ``_ready`` 开始。 将以下内容添加到``_ready``:

source: This gets the ``Flashlight`` node and assigns it to the ``flashlight`` variable.
es: Esto obtiene el nodo ``Flashlight`` (linterna) y lo asigna a la variable ``flashlight``.
fr: Ceci obtient le nœud ``Flashlight`` et l'affecte à la variable ``flashlight``.

source: Now we need to change some of the code in ``process_input``. Add the following somewhere in ``process_input``:
es: Ahora tenemos que cambiar algo del código en ``process_input``. Añade lo siguiente en algún lugar de ``process_input``:
fr: Nous devons maintenant changer une partie du code dans ``process_input``. Ajoutez ce qui suit quelque part dans ``process_input`` :
zh_cn: 现在我们需要更改 ``process_input`` 中的一些代码。 在 ``process_input`` 中添加以下内容:

source: Let's go over the additions:
es: Repasemos los añadidos:
fr: Revoyons les ajouts :
zh_cn: 让我们回顾一下:

source: We set ``is_sprinting`` to ``true`` when the player is holding down the ``movement_sprint`` action, and ``false`` when the ``movement_sprint`` action is released. In ``process_movement`` we'll add the code that makes the player faster when they sprint. Here in ``process_input`` we are just going to change the ``is_sprinting`` variable.
es: Ponemos ``is_sprinting`` en ``true`` cuando el jugador mantiene presionada la acción de la ``movement_sprint`` y ``false`` cuando la acción de la ``movement_sprint`` es liberada. En ``process_movement`` añadiremos el código que hace que el jugador sea más rápido cuando corra. Aquí, en ``process_input`` vamos a cambiar la variable ``is_sprinting``.
fr: Nous réglons ``is_sprinting`` sur ``true`` lorsque le joueur maintient l'action ``movement_sprint``, et ``false`` lorsque l'action ``movement_sprint`` est relâchée. Dans ``process_movement`` nous ajouterons le code qui rend le joueur plus rapide lorsqu'il sprinte. Ici, dans ``process_input``, nous allons simplement changer la variable ``is_sprinting``.

source: We do something similar to freeing/capturing the cursor for handling the flashlight. We first check to see if the ``flashlight`` action was just pressed. If it was, we then check to see if ``flashlight`` is visible in the scene tree. If it is, then we hide it, and if it's not, we show it.
es: Hacemos algo similar a liberar/capturar el cursor para manejar la linterna. Primero comprobamos si la acción "linterna" acaba de ser presionada. Si lo estaba, entonces comprobamos si la "linterna" es visible en el árbol de la escena. Si lo es, entonces la escondemos, y si no lo es, la mostramos.
fr: Nous faisons quelque chose de similaire pour libérer/capturer le curseur afin de manipuler la lampe flash. Nous vérifions d'abord si l'action ``flashlight`` vient d'être pressée. Si c'était le cas, nous vérifions alors si ``flashlight``est visible dans l'arbre de scène. Si c'est le cas, on le cache, et si ce n'est pas le cas, on le montre.

source: Now we need to change a couple things in ``process_movement``. First, replace ``target *= MAX_SPEED`` with the following:
es: Ahora tenemos que cambiar un par de cosas en ``process_movement``. Primero, reemplace``target *= MAX_SPEED`` con lo siguiente:
fr: Maintenant nous avons besoin de changer quelques choses dans le ``process_movement``. Tout d'abord, remplacer ``target *= MAX_SPEED`` par ce qui suit :
zh_cn: 现在我们需要在 ``process_movement`` 中改变一些东西。 首先，用以下代码替换``target * = MAX_SPEED``:

source: Now instead of always multiplying ``target`` by ``MAX_SPEED``, we first check to see if the player is sprinting or not. If the player is sprinting, we instead multiply ``target`` by ``MAX_SPRINT_SPEED``.
es: Ahora, en lugar de multiplicar siempre ``target`` por ``MAX_SPEED``, primero comprobamos si el jugador está corriendo o no. Si el jugador está corriendo, multiplicamos ``target`` por ``MAX_SPRINT_SPEED``.
fr: Maintenant, au lieu de toujours multiplier ``target``par ``MAX_SPEED``, nous vérifions d'abord si le joueur sprinte ou non. Si le joueur sprinte, on multiplie ``target`` par ``MAX_SPRINT_SPEED``.
zh_cn: 现在我们首先检查游戏角色是否在冲刺，而不是总是将 ``target`` 乘以 ``MAX_SPEED`` 。 如果游戏角色正在冲刺，我们将 ``target`` 乘以 ``MAX_SPRINT_SPEED`` 。

source: Now all that's left is to change the acceleration when sprinting. Change ``accel = ACCEL`` to the following:
es: Ahora todo lo que queda es cambiar la aceleración al correr. Cambiar ``acceAhora todo lo que queda es cambiar la aceleración al correr. Cambiar ``accel = ACCEL`` a lo siguiente:l = ACCEL`` a lo siguiente:
fr: Il ne reste plus qu'à modifier l'accélération au sprint. Modifier ``accel = ACCEL`` par ce qui suit :

source: Now, when the player is sprinting, we'll use ``SPRINT_ACCEL`` instead of ``ACCEL``, which will accelerate the player faster.
es: Ahora, cuando el jugador esté corriendo, usaremos ``SPRINT_ACCEL`` en lugar de ``ACEL``, lo que acelerará al jugador más rápido.
fr: Maintenant, lorsque le joueur sprinte, nous utiliserons ``SPRINT_ACCEL`` au lieu de ``ACCEL``, ce qui accélérera le joueur plus rapidement.

source: You should now be able to sprint if you press the ``shift`` button, and can toggle the flash light on and off by pressing the ``F`` button!
fr: Vous devriez maintenant être capable de sprinter si vous appuyez sur le bouton ``shift``, et vous pouvez allumer et éteindre la lampe flash en appuyant sur le bouton ``F`` !

source: Go try it out! You can change the sprint-related class variables to make the player faster or slower when sprinting!
es: ¡Ve a probarlo! ¡Puedes cambiar las variables de clase relacionadas con el sprint para que el jugador sea más rápido o más lento al sprint!
fr: Allez l'essayer ! Vous pouvez changer les variables de classe liées au sprint pour rendre le joueur plus rapide ou plus lent lors du sprint !

source: Final notes
es: Notas finales
fr: Notes finales
zh_cn: 最后的笔记

source: Whew! That was a lot of work. Now you have a fully working first person character!
es: ¡Uf! Eso fue un montón de trabajo. ¡Ahora tienes un personaje en primera persona que funciona completamente!
fr: Whew ! C'était beaucoup de travail. Maintenant, vous avez un personnage à la première personne qui fonctionne parfaitement !

source: In :ref:`doc_fps_tutorial_part_two` we will add some guns to our player character.
es: En :ref:`doc_fps_tutorial_part_two` añadiremos algunas armas a nuestro personaje jugador.
fr: Dans :ref:`doc_fps_tutorial_part_tutorial_part_two` nous allons ajouter des armes à feu à notre personnage joueur.
zh_cn: 在 :ref:`doc_fps_tutorial_part_two` 我们将为我们的游戏角色角色添加一些枪支。

source: At this point we've recreated the Kinematic character demo from first person perspective with sprinting and a flash light!
es: ¡En este punto hemos recreado la demo del Personaje Cinemático desde una perspectiva en primera persona con sprint y una luz de flash!
fr: A ce stade, nous avons recréé la démo du personnage Kinematic du point de vue de la première personne avec un sprint et une lumière flash !
zh_cn: 在这一点上，我们通过短跑和闪光灯从第一人称角度重新创建了运动角色演示！

source: Currently the player script would be at an ideal state for making all sorts of first person games. For example: Horror games, platformer games, adventure games, and more!
es: Actualmente el guión del jugador estaría en un estado ideal para hacer todo tipo de juegos en primera persona. ¡Por ejemplo: Juegos de terror, juegos de plataformas, juegos de aventuras y más!
fr: Actuellement, le script du joueur serait dans un état idéal pour faire toutes sortes de jeux à la première personne. Par exemple : Jeux d'horreur, jeux de plates-formes, jeux d'aventure, et plus encore !
zh_cn: 目前，游戏角色脚本将处于制作各种第一人称游戏的理想状态。 例如:恐怖游戏，平台游戏，冒险游戏等等！

source: If you ever get lost, be sure to read over the code again!
es: ¡Si alguna vez te pierdes, asegúrate de leer el código de nuevo!
fr: Si jamais vous vous perdez, n'oubliez pas de relire le code !
zh_cn: 如果您迷路了，请务必再次阅读代码！

source: You can download the finished project for this part here: :download:`Godot_FPS_Part_1.zip <files/Godot_FPS_Part_1.zip>`
es: Puede descargar el proyecto terminado para esta parte aquí: :download:`Godot_FPS_Part_1.zip <files/Godot_FPS_Part_1.zip>`
fr: Vous pouvez télécharger le projet terminé pour cette partie ici : :download:`Godot_FPS_Part_1.zip <files/Godot_FPS_Part_1.zip>`
zh_cn: 您可以在这里下载这个部分的完成项目: :download:`Godot_FPS_Part_1.zip <files / Godot_FPS_Part_1.zip>`

source: If you do this, all the code copied will be using spaces instead of tabs.
es: Si haces esto, todo el código copiado estará usando espacios en lugar de tabulaciones.

source: This question from Game Development Stack Exchange has a much better explanation of world space and local space.
es: Esta pregunta de Game Development Stack Exchange tiene una explicación mejor del espacio mundial y del espacio local.

source: You can change between local and world space modes by pressing :kbd:`T` or the little cube button when you have a :ref:`Spatial <class_Spatial>` based node selected.
es: Puedes cambiar entre los modos de espacio local y mundial presionando :kbd:`T` o el pequeño botón del cubo cuando tienes seleccionado un nodo basado en :ref:`Spatial <class_Spatial>`.

source: All the code in ``process_movement`` is exactly the same as the movement code from the Kinematic Character demo!
es: ¡Todo el código en ``process_movement`` es exactamente igual que el código de movimiento de la demo Kinematic Character!

source: Go ahead and test your code either by pressing :kbd:`F6` with ``Testing_Area.tscn`` as the open tab, by pressing the play button in the top right corner, or by pressing :kbd:`F5`. You should now be able to walk around, jump in the air, and look around using the mouse.
es: Adelante y prueba tu código ya sea presionando :kbd:`F6` con ``Testing_Area.tscn`` como la pestaña abierta, presionando el botón de reproducción en la esquina superior derecha, o presionando :kbd:`F5`. Ahora deberías ser capaz de caminar, saltar en el aire, y mirar alrededor usando el ratón.

source: You should now be able to sprint if you press :kbd:`Shift`, and can toggle the flash light on and off by pressing :kbd:`F`!
es: Ahora deberías ser capaz de correr si presionas :kbd:`Shift`, y puedes encender y apagar la linterna presionando :kbd:`F`!
