Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_three.po
Languages: es, fr, ja, zh_cn

source: There are no game sounds provided in this tutorial (for legal reasons). https://gamesounds.xyz/ is a collection of **"royalty free or public domain music and sounds suitable for games"**. I used Gamemaster's Gun Sound Pack, which can be found in the Sonniss.com GDC 2017 Game Audio Bundle.
es: No hay sonidos de juegos en este tutorial (por razones legales). https://gamesounds.xyz/ es una colección de **"música y sonidos de dominio público o libres de derechos de autor adecuados para juegos "**. Yo usé Gamemaster's Gun Sound Pack, que se encuentra en Sonniss.com GDC 2017 Game Audio Bundle.
fr: Nous ne proposons aucun assets de sons dans ce tutoriel (pour des raisons légales). https://gamesounds.xyz/ est une collection de **"sons et musiques du domaine public qui conviennent aux jeux video"**. J'ai utilisé le Gamemaster's Gun Sound Pack qui peut être trouvé dans le Sonniss.com GDC 2017 Game Audio Bundle.
ja: (法的な理由のため)このチュートリアルではゲームサウンドは提供されていません。 https://gamesounds.xyz/ は、\ **「ロイヤルティフリーまたはパブリックドメインの音楽とゲームに適したサウンド」**\ のコレクションです。Sonniss.com GDC 2017 Game Audio Bundle にある Gamemaster's Gun Sound Pack を使用しました。
zh_cn: 本教程中没有提供游戏声音(出于法律原因). https://gamesounds.xyz/是 **免版税或公共领域音乐和适合游戏的声音的集合** . 我使用了Gamemaster的Gun Sound Pack,可以在Sonniss.com GDC 2017 Game Audio Bundle中找到.

source: Open up ``Simple_Audio_Player.tscn``. It is simply a :ref:`Spatial <class_Spatial>` with an :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` as its child.
es: Abre ``Simple_Audio_Player.tscn``. Es simplemente un :ref:`Spatial <class_Spatial>` con un :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` como su hijo.
fr: Ouvrez ``Simple_Audio_Player.tscn``. Il s'agit simplement d'un :ref:`Spatial <class_Spatial>` avec un :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` comme enfant.
ja: ``Simple_Audio_Player.tscn`` を開きます。それは、単に :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` を子とする :ref:`Spatial <class_Spatial>` です。
zh_cn: 打开 ``Simple_Audio_Player.tscn`` . 它只是一个 :ref:`Spatial <class_Spatial>` ,其中 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 作为它的子节点.

source: The reason this is called a 'simple' audio player is because we are not taking performance into account and because the code is designed to provide sound in the simplest way possible.
es: La razón por la que se llama un 'simple' reproductor de audio es porque no tenemos en cuenta el rendimiento y porque el código está diseñado para proporcionar sonido de la manera más simple posible.
fr: La raison pour laquelle cela est appelé un « simple » lecteur audio est du fait que nous ne prenons pas en compte les performances et parce que le code est conçu pour fournir du son de la manière la plus simple possible.
ja: これが「シンプルな」オーディオプレーヤーと呼ばれる理由は、パフォーマンスを考慮していないため、またコードが可能な限り簡単な方法でサウンドを提供するように設計されているためです。
zh_cn: 这被称为"简单"音频播放器的原因是因为我们没有考虑性能,因为代码旨在以最简单的方式提供声音.

source: If you want to use 3D audio, so it sounds like it's coming from a location in 3D space, right click the :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` and select "Change type".
es: Si quieres usar audio 3D, para que suene como si viniera de un lugar en el espacio 3D, haz clic con el botón derecho del ratón en :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` y selecciona "Change type".
fr: Si vous souhaitez utiliser de l'audio 3D, de sorte qu'il semble que cela vient d'un espace 3D, cliquez droit sur le :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` et sélectionnez "Change type".
ja: 3Dオーディオを使用して、3D空間の場所から来ているように聞こえる場合は、\ :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` を右クリックし、[型を変更]を選択します。
zh_cn: 如果您想使用3D音频,所以它听起来像是来自3D空间中的一个位置,右键单击 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 并选择"更改类型".

source: This will open the node browser. Navigate to :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` and select "change". In the source for this tutorial, we will be using :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`, but you can optionally use :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` if you desire, and the code provided below will work regardless of which one you chose.
es: Esto abrirá el navegador de nodos. Navega a :ref:`AudioStreamPlayer3D <clase_AudioStreamPlayer3D>` y selecciona "change". En el código fuente de este tutorial, usaremos :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`, pero puedes usar opcionalmente :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` si lo deseas, y el código proporcionado a continuación funcionará independientemente del que hayas elegido.
fr: Cela ouvrira le navigateur de nœud. Naviguez vers :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` et sélectionnez "change". Dans les sources de ce tutoriel, nous allons utiliser :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`, mais vous pouvez utiliser :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` si vous le souhaitez. Le code fourni ci-dessous fonctionnera indépendamment duquel vous choisirez.
ja: これにより、ノードブラウザが開きます。\ :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` に移動し、[変更]を選択します。このチュートリアルのソースでは、\ :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` を使用しますが、必要に応じて :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` を使用することもできます。選択したノードに関係なく、以下のコードが機能します。
zh_cn: 这将打开节点浏览器. 导航到 :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` 并选择"更改". 在本教程的源代码中,我们将使用 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`,但如果需要,您可以选择使用 :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>`,无论哪一个,下面提供的代码都可以使用 您选择了.

source: Create a new script and call it ``Simple_Audio_Player.gd``. Attach it to the :ref:`Spatial <class_Spatial>` in ``Simple_Audio_Player.tscn`` and insert the following code:
es: Crea un nuevo script y llámalo ``Simple_Audio_Player.gd``. Adjúntalo al :ref:`Spatial <class_Spatial>` en ``Simple_Audio_Player.tscn`` e inserta el siguiente código:
fr: Créez un nouveau script et appelez-le ``Simple_Audio_Player.gd``. Attachez-le à :ref:`Spatial <class_Spatial>` dans ``Simple_Audio_Player.tscn`` et insérez le code suivant :
ja: 新しいスクリプトを作成し、\ ``Simple_Audio_Player.gd`` と呼びます。\ ``Simple_Audio_Player.tscn`` の :ref:`Spatial <class_Spatial>` にアタッチし、次のコードを挿入します:
zh_cn: 创建一个新脚本并将其命名为 ``Simple_Audio_Player.gd`` . 将它附加到 ``Simple_Audio_Player.tscn`` 中的 :ref:`Spatial <class_Spatial>` 并插入以下代码:

source: By setting ``position`` to ``null`` by default in ``play_sound``, we are making it an optional argument, meaning ``position`` doesn't necessarily have to be passed in to call ``play_sound``.
es: Al poner ``position`` en ``null`` por defecto en ``play_sound``, lo hacemos un argumento opcional, lo que significa que ``position`` no necesariamente tiene que ser pasado para llamar a ``play_sound``.
fr: En mettant ``position`` à ``null`` par défaut dans ``play_sound``, nous en faisons un argument facultatif, signifiant que ``position`` n'a pas nécessairement besoin d'être passé en paramètre pour appeler ``play_sound``.
ja: ``play_sound`` で ``position`` のデフォルト値を ``null`` に設定することで、オプションの引数にしています。つまり、\ ``play_sound`` を呼び出すときに、必ずしも ``position`` を渡す必要はありません。
zh_cn: 在 ``play_sound`` 中默认将 ``position`` 设置为 ``null`` ,我们将它作为一个可选的参数,这意味着 ``position`` 不一定要传入才能调用 ``play_sound`` .

source: Let's go over what's happening here:
es: Repasemos lo que está pasando aquí:
fr: Voyons ce qui se passe ici :
ja: ここで何が起こっているのかを見てみましょう:
zh_cn: 让我们回顾一下这里发生的事情:

source: In ``_ready``, we get the :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` and connect its ``finished`` signal to the ``destroy_self`` function. It doesn't matter if it's an :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` or :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` node, as they both have the finished signal. To make sure it is not playing any sounds, we call ``stop`` on the :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`.
es: En ``_ready``, obtenemos la :ref: `AudioStreamPlayer` y conectamos su señal de ``finished`` a la función ``destroy_self``. No importa si es un nodo :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` o :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>`, ya que ambos tienen la señal terminada. Para asegurarnos de que no está reproduciendo ningún sonido, llamamos a ``stop`` en el nodo :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`.
fr: Dans ``_ready``, nous récupérons le :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` et connectons son signal ``finished`` à la fonction ``destroy_self``. Peu importe qu'il s'agisse d'un nœud :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` ou d'un nœud :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>`, car ils ont tous deux le signal ``finished``. Pour s'assurer qu'il ne joue pas de sons, nous appelons ``stop`` sur le :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`.
ja: ``_ready`` で :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` を取得し、その ``finished`` シグナルを ``destroy_self`` 関数に接続します。\ :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` または :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` ノードのどちらであるかは問題ではありません。両方とも終了シグナルを持っているからです。サウンドが再生されていないことを確認するには、\ :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` で ``stop`` を呼び出します。
zh_cn: 在 ``_ready`` 中我们得到 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 并将其 ``finished`` 信号连接到 ``destroy_self`` 函数. 无论是否为 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 或 :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` 节点,因为它们都有finished信号. 为了确保它不播放任何声音,我们在 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`上调用 ``stop`` .

source: Make sure your sound files are **not** set to loop! If it is set to loop, the sounds will continue to play infinitely and the script will not work!
es: ¡Asegúrate de que tus archivos de sonido **no** estén en bucle! ¡Si está configurado en bucle, los sonidos seguirán reproduciéndose infinitamente y el script no funcionará!
fr: Assurez-vous que vos fichiers son ne sont **pas** réglés sur boucle ! Si c'est le cas, les sons continueront de jouer à l'infini et ne script ne marchera pas !
ja: サウンドファイルがループするように設定されて\**いない**\ ことを確認してください！ループするように設定されている場合、サウンドは無限に再生され続け、スクリプトは機能しません！
zh_cn: 确保您的声音文件 **不是** 设置为循环！ 如果设置为循环,声音将无限播放,脚本将无法正常工作！

source: The ``play_sound`` function is what we will be calling from ``Player.gd``. We check if the sound is one of the three possible sounds, and if it is one of the three sounds we set the audio stream in :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` to the correct sound.
es: La función ``play_sound`` es lo que llamaremos desde ``Player.gd``. Comprobamos si el sonido es uno de los tres posibles, y si es uno de los tres sonidos ponemos el flujo de audio en :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` al sonido correcto.
fr: La fonction ``play_sound`` est celle que nous appellerons de ``Player.gd``. Nous vérifions si le son correspond à l'un des trois sons possibles et si c'est l'un des trois sons, nous réglons le flux audio dans :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` au son correct.
ja: ``play_sound`` 関数は ``Player.gd`` から呼び出すものです。サウンドが3つの可能なサウンドの1つであるかどうかをチェックし、3つのサウンドの1つである場合、\ :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` のオーディオストリームを正しいサウンドに設定します。
zh_cn: ``play_sound``函数是我们将从``Player.gd``调用的函数. 我们检查声音是否是三种可能的声音之一,如果它是三种声音之一,我们将音频流设置为 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 到正确的声音.

source: If it is an unknown sound, we print an error message to the console and free the audio player.
es: Si es un sonido desconocido, imprimimos un mensaje de error en la consola y liberamos el reproductor de audio.
fr: Si c'est un son inconnu, nous affichons un message d'erreur dans la console et on libère le lecteur audio.
ja: 不明な音の場合、コンソールにエラーメッセージを出力し、オーディオプレーヤーを解放します。
zh_cn: 如果是未知声音,我们会向控制台输出错误消息并释放音频播放器.

source: If you are using an :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>`, remove the ``#`` to set the position of the audio player node so it plays at the correct position.
es: Si estás usando un :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>`, quita el ``#`` para establecer la posición del nodo de reproducción de audio para que se reproduzca en la posición correcta.
fr: Si vous utilisez un :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>`, supprimez le ``#`` pour définir la position du nœud du lecteur audio afin qu'il joue à la bonne position.
ja: :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` を使用している場合は、\ ``＃`` を削除してオーディオプレーヤーノードの位置を設定し、正しい位置で再生されるようにします。
zh_cn: 如果您使用的是 :ref:`AudioStreamPlayer3D <class_AudioStreamPlayer3D>` ,请删除 ``#`` 以设置音频播放器节点的位置,使其在正确的位置播放.

source: Finally, we tell the :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` to play.
es: Finalmente, le decimos al :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` que toque.
fr: Enfin, nous disons au :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` de jouer.
ja: 最後に、\ :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` に再生するように指示します。
zh_cn: 最后,我们告诉 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 来玩.

source: When the :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` is finished playing the sound, it will call ``destroy_self`` because we connected the ``finished`` signal in ``_ready``. We stop the :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` and free the audio player to save on resources.
es: Cuando el :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` termine de reproducir el sonido, se llamará ``destroy_self`` porque conectamos la señal ``finished`` en ``ready``. Detenemos el :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` y liberamos el reproductor de audio para ahorrar recursos.
fr: Lorsque le :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` a fini de jouer le son, il va appeler ``destroy_self`` parce que nous avons connecté le signal ``finished`` dans ``_ready``. Nous arrêtons le :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` et libérons le lecteur audio pour économiser des ressources.
ja: :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` がサウンドの再生を終了すると、\ ``_ready`` の ``finished`` シグナルを接続してあるので、\ ``destroy_self`` を呼び出します。\ :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` を停止し、オーディオプレーヤーを解放してリソースを節約します。
zh_cn: 当 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 播放声音时,它将调用 ``destroy_self`` ,因为我们连接了 ``_ready`` 中的 ``finished`` 信号. 我们停止 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 并释放音频播放器以节省资源.

source: This system is extremely simple and has some major flaws:
es: Este sistema es extremadamente simple y tiene algunas fallas importantes:
fr: Ce système est extrêmement simple et présente quelques défauts majeurs :
ja: このシステムは非常に単純で、いくつかの大きな欠陥があります:
zh_cn: 这个系统非常简单,有一些重大缺陷:

source: One flaw is we have to pass in a string value to play a sound. While it is relatively simple to remember the names of the three sounds, it can be increasingly complex when you have more sounds. Ideally, we'd place these sounds in some sort of container with exposed variables so we do not have to remember the name(s) of each sound effect we want to play.
es: Un defecto es que tenemos que pasar un valor de string para reproducir un sonido. Aunque es relativamente simple recordar los nombres de los tres sonidos, puede ser cada vez más complejo cuando se tienen más sonidos. Lo ideal sería colocar estos sonidos en algún tipo de container con variables expuestas para no tener que recordar el nombre(s) de cada efecto de sonido que queramos reproducir.
fr: Un des défaut est que nous devons passer une chaîne de caractère en paramètre pour jouer un son. Bien qu'il soit relativement simple de retenir le nom de trois sons, cela peut devenir de plus en plus complexe quand nous avons plus de sons. Idéalement, nous placerions ces trois sons dans un conteneur avec des variables exposés afin de ne pas avoir à retenir le(s) nom(s) de chaque son que nous voulons jouer.
ja: 欠点の1つは、サウンドを再生するために文字列値を渡す必要があることです。 3つのサウンドの名前を覚えるのは比較的簡単ですが、より多くのサウンドがある場合はますます複雑になる可能性があります。理想的には、これらのサウンドを変数が公開された何らかのコンテナに配置して、再生する各サウンドエフェクトの名前を覚えておく必要がないようにします。
zh_cn: 有一个缺陷是我们必须传入一个字符串值来播放一个声音.虽然记住这三个声音的名字相对简单,但当你有更多的声音时,它可能会越来越复杂.理想的情况是,我们将这些声音放在某种容器中,并有暴露的变量,这样我们就不必记住要播放的每个声音效果的名字.

source: Another flaw is we cannot play looping sounds effects, nor background music, easily with this system. Because we cannot play looping sounds, certain effects, like footstep sounds, are harder to accomplish because we then have to keep track of whether or not there is a sound effect and whether or not we need to continue playing it.
es: Otro defecto es que no podemos reproducir efectos de sonido en bucle, ni música de fondo, fácilmente con este sistema. Debido a que no podemos reproducir sonidos en bucle, ciertos efectos, como los sonidos de pasos, son más difíciles de lograr porque entonces tenemos que hacer un seguimiento de si hay o no un efecto de sonido y si necesitamos o no seguir reproduciéndolo.
fr: Un des autres défauts est que nous ne pouvons pas jouer des effets sonores en boucle, ni de musique de fond facilement avec ce système. Parce que nous ne pouvons pas jouer de sons en boucle, certains effets comme les sons de pas sont plus difficiles à réaliser car nous devons alors garder une trace de si oui ou non il y a un effet sonore et si oui ou non nous avons besoin de continuer à le jouer.
ja: もう1つの欠点は、このシステムではループサウンドエフェクトやバックグラウンドミュージックを簡単に再生できないことです。ループサウンドを再生できないため、足音のような特定のエフェクトは、サウンドエフェクトがあるかどうか、および再生を継続する必要があるかどうかを追跡する必要があるため、達成するのが難しくなります。
zh_cn: 另一个缺陷是我们无法使用此系统轻松播放循环音效,也无法播放背景音乐. 因为我们无法播放循环声音,某些效果(如脚步声)难以实现,因为我们必须跟踪是否存在声音效果以及是否需要继续播放它.

source: One of the biggest flaws with this system is we can only play sounds from ``Player.gd``. Ideally we'd like to be able to play sounds from any script at any time.
es: Una de las mayores fallas de este sistema es que sólo podemos reproducir sonidos de ``Player.gd``. Idealmente nos gustaría poder reproducir sonidos de cualquier script en cualquier momento.
fr: L'un des plus gros défauts de ce système est que nous ne pouvons jouer que des sons provenant du ``Player.gd``. Idéalement, nous aimerions pouvoir jouer des sons provenant de n'importe quel script à tout moment.
ja: このシステムの最大の欠点の1つは、\ ``Player.gd`` からのサウンドしか再生できないことです。理想的には、いつでも任意のスクリプトからサウンドを再生できるようにしたいと考えています。
zh_cn: 这个系统最大的缺点之一是我们只能播放"Player.gd"中的声音. 理想情况下,我们希望能够随时播放任何脚本中的声音.

source: With that done, let's open up ``Player.gd`` again. First we need to load the ``Simple_Audio_Player.tscn``. Place the following code in the class variables section of the script:
es: Una vez hecho esto, abramos ``Player.gd`` de nuevo. Primero necesitamos cargar el ``Simple_Audio_Player.tscn``. Coloca el siguiente código en la sección de variables de clase del script:
fr: Ceci fait, ouvrons ``Player.gd`` à nouveau. Nous devons d'abord charger ``Simple_Audio_Player.tscn``. Placez le code suivant dans la section des variables de classe du script :
ja: それが終わったら、再び ``Player.gd`` を開きましょう。まず、\ ``Simple_Audio_Player.tscn`` をロードする必要があります。スクリプトのクラス変数セクションに次のコードを配置します:
zh_cn: 做完这些,我们再打开 ``Player.gd`` .首先我们需要加载 ``Simple_Audio_Player.tscn`` .在脚本的类变量部分放入以下代码:

source: Now we need to instance the simple audio player when we need it, and then call its ``play_sound`` function and pass the name of the sound we want to play. To make the process simpler, let's create a ``create_sound`` function in ``Player.gd``:
es: Ahora tenemos que ponerle una instancia al simple reproductor de audio cuando lo necesitemos, y luego llamar a su función ``play_sound`` y pasarle el nombre del sonido que queremos reproducir. Para hacer el proceso más simple, vamos a crear una función ``create_sound`` en ``Player.gd``:
fr: Maintenant, nous avons besoin d'instancier le lecteur audio simple quand nous en avons besoin, puis appeler sa fonction ``play_sound`` et passer le nom du son que nous voulons jouer. Pour simplifier le processus, créons une fonction ``create_sound`` dans ``Player.gd`` :
ja: 次に、必要なときに単純なオーディオプレーヤーをインスタンス化してから、その ``play_sound`` 関数を呼び出して、再生するサウンドの名前を渡す必要があります。プロセスを簡単にするために、\ ``Player.gd`` に ``create_sound`` 関数を作成しましょう:
zh_cn: 现在我们需要在需要时实例化简单的音频播放器,然后调用它的 ``play_sound`` 函数并传递我们想要播放的声音的名称. 为了简化这个过程,让我们在 ``Player.gd`` 中创建一个 ``create_sound`` 函数:

source: Let's walk through what this function does:
es: Repasemos lo que hace esta función:
fr: Passons en revue ce que cette fonction fait :
ja: この関数が何をするかを見てみましょう:
zh_cn: 我们来介绍一下这个函数的作用:

source: The first line instances the ``Simple_Audio_Player.tscn`` scene and assigns it to a variable named ``audio_clone``.
es: La primera línea instancia la escena ``Simple_Audio_Player.tscn`` y la asigna a una variable llamada ``audio_clone``.
fr: La première ligne instancie la scène ``Simple_Audio_Player.tscn`` et l'assigne à une variable appelée ``audio_clone``.
ja: 最初の行は ``Simple_Audio_Player.tscn`` シーンをインスタンス化し、それを ``audio_clone`` という名前の変数に割り当てます。
zh_cn: 第一行实例化 ``Simple_Audio_Player.tscn`` 场景,并将其分配给一个名为 ``audio_clone`` 的变量.

source: The second line gets the scene root, and this has a large (though safe) assumption.
es: La segunda línea obtiene la raíz de la escena, y esto tiene una gran (aunque segura) suposición.
fr: La seconde ligne récupère la racine de la scène et fait une grosse (bien que sûre) supposition.
ja: 2行目はシーンのルートを取得しますが、これには大きな(ただし安全な)仮定があります。
zh_cn: 第二行获取场景根,这有一个很大(虽然安全)的假设.

source: We first get this node's :ref:`SceneTree <class_SceneTree>`, and then access the root node, which in this case is the :ref:`Viewport <class_Viewport>` this entire game is running under. Then we get the first child of the :ref:`Viewport <class_Viewport>`, which in our case happens to be the root node in ``Test_Area.tscn`` or any of the other provided levels. **We are making a huge assumption that the first child of the root node is the root scene that the player is under, which may not always be the case**.
es: Primero obtenemos el nodo :ref:`SceneTree <class_SceneTree>`, y luego accedemos al nodo raíz, que en este caso es el :ref:`Viewport <class_Viewport>` bajo el cual se está ejecutando todo el juego. Entonces obtenemos el primer hijo de :ref:`Viewport <class_Viewport>`, que en nuestro caso resulta ser el nodo raíz de ``Test_Area.tscn`` o cualquiera de los otros niveles proporcionados. **Estamos haciendo una gran suposición de que el primer hijo del nodo raíz es la escena raíz bajo la que está el jugador, lo que no siempre puede ser el caso**.
fr: Nous récupérons d'abord la :ref:`SceneTree <class_SceneTree> de ce nœud, puis nous accédons au nœud source qui, dans ce cas, est la :ref:`Viewport <class_Viewport>` sur laquelle le jeu tourne. Ensuite, nous allons chercher le premier enfant de la :ref:`Viewport <class_Viewport>`, qui dans notre cas s'avère être le nœud source de ``Test_Area.tscn`` ou n'importe quel autre niveau fournis. **Nous faisons une énorme hypothèse ici en assumant que le premier enfant du nœud source est la scène source sur laquelle se situe le joueur, ce qui n'est pas tout le temps le cas**.
ja: 最初にこのノードの :ref:`SceneTree <class_SceneTree>` を取得し、次にルートノードにアクセスします。この場合、このノードは :ref:`Viewport <class_Viewport>` であり、このゲーム全体が実行されています。次に :ref:`Viewport <class_Viewport>` の最初の子を取得します。この場合、これはたまたま ``Test_Area.tscn`` または他の提供されたレベルのルートノードです。\ **ルートノードの最初の子はプレイヤーがいるルートシーンであるという大きな仮定を立てていますが、これは必ずしもそうとは限りません**\ 。
zh_cn: 我们首先得到这个节点 :ref:`SceneTree <class_SceneTree>`,然后访问根节点,在这种情况下是 :ref:`Viewport <class_Viewport>` 这整个游戏正在运行. 然后我们得到了第一个子节点 :ref:`Viewport <class_Viewport>`,在我们的示例中恰好是 ``Test_Area.tscn`` 中的根节点或任何其他提供的级别. **我们正在做出一个巨大的假设,即根节点的第一个子节点是游戏角色所处的根场景,这可能并非总是如此**.
