Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_four.po
Languages: es, fr, ja, zh_cn

source: Next, we set ``is_ready`` to ``true`` so we can use the ``setget`` function.
es: Luego, ponemos ``is_ready`` en ``true`` para poder usar la función ``setget``.
fr: Ensuite, nous assignons à ``is_ready`` la valeur ``true`` afin de pouvoir utiliser la fonction ``setget``.
ja: 次に、\ ``set_`` 関数を使用できるように ``is_ready`` を ``true`` に設定します。

source: Then we hide all the possible kits and their collision shapes using ``kit_size_change_values``. The first argument is the size of the kit, while the second argument is whether to enable or disable the collision shape and mesh at that size.
es: Luego escondemos todos los posibles kits y sus formas de colisión usando ``kit_size_change_values``. El primer argumento es el tamaño del kit, mientras que el segundo argumento es si se activa o desactiva la forma de colisión y la malla de ese tamaño.
fr: Nous cachons ensuite tout les kits existants ainsi que leur collision shapes en utilisant ``kit_size_change_values``. Le premier argument est la taille du kit, quand au second, il correspond l'activation ou non du collision shape ainsi que de la mesh à cette taille.
ja: 次に、\ ``kit_size_change_values`` を使用して、すべての可能なキットとそのコリジョンシェイプを非表示にします。 最初の引数はキットのサイズであり、2番目の引数はそのサイズでコリジョンシェイプとメッシュを有効にするか無効にするかです。

source: Then we make only the kit size we selected visible, calling ``kit_size_change_values`` and passing in ``kit_size`` and ``true``, so the size at ``kit_size`` is enabled.
es: Entonces hacemos visible sólo el tamaño del kit que seleccionamos, llamando a ``kit_size_change_values`` y pasando en ``kit_size`` y ``true``, para que el tamaño en ``kit_size`` esté habilitado.
fr: Ensuite, nous faisons en sorte que seul le kit sélectionné soit visible en appelant ``kit_size_change_values`` et en lui passant ``kit_size`` et ``true`` en paramètre afin que la taille à ``kit_size`` soit activée.
ja: 次に、選択したキットのサイズのみを表示し、\ ``kit_size_change_values`` を呼び出して ``kit_size`` と ``true`` を渡すので、\ ``kit_size`` のサイズが有効になります。
zh_cn: 然后我们只选择我们选择的工具包大小，调用 ``kit_size_change_values`` 并传入 ``kit_size`` 和 ``true`` ，这样就可以启用 ``kit_size`` 的大小。

source: Next let's look at ``kit_size_change``.
es: A continuación, veamos el ``kit_size_change``.
fr: Ensuite, regardons ``kit_size_change``.
ja: 次に、\ ``kit_size_change`` を見てみましょう。
zh_cn: 接下来让我们看一下 ``kit_size_change`` 。

source: The first thing we do is check to see if ``is_ready`` is ``true``.
es: Lo primero que hacemos es comprobar si ``is_ready`` es ``true``.
fr: La première chose que nous faisons, est de vérifier si ``is_ready`` est ``true``.
ja: 最初に行うことは、\ ``is_ready`` が ``true`` であるかどうかを確認することです。
zh_cn: 我们要做的第一件事就是检查 ``is_ready`` 是否为 ``true`` 。

source: If ``is_ready`` is ``true``, we then make whatever kit already assigned to ``kit_size`` disabled using ``kit_size_change_values``, passing in ``kit_size`` and ``false``.
es: Si ``is_ready`` es ``true``, entonces hacemos que cualquier kit ya asignado a ``kit_size`` sea desactivado usando ``kit_size_change_values``, pasando ``kit_size`` y ``false``.
fr: Si ``is_ready`` est ``true``, alors nous rendons n'importe quel kit déjà assigné à ``kit_size`` désactivé en utilisant ``kit_size_change_values`` et en passant ``kit_size`` et ``false`` en paramètres.
ja: ``is_ready`` が ``true`` の場合、\ ``kit_size_change_values`` を使用して ``kit_size`` に既に割り当てられているキットを無効にし、\ ``kit_size`` と ``false`` を渡します。
zh_cn: 如果 ``is_ready`` 是 ``true`` ，那么我们使用 ``kit_size_change_values`` 制作已经分配给 ``kit_size`` 的任何工具包，传入 ``kit_size`` 和 ``false`` 。

source: Then we assign ``kit_size`` to the new value passed in, ``value``. Then we call ``kit_size_change_values`` passing in ``kit_size`` again, but this time with the second argument as ``true`` so we enable it. Because we changed ``kit_size`` to the passed in value, this will make whatever kit size was passed in visible.
es: Luego asignamos ``kit_size`` al nuevo valor pasado, ``value``. Luego llamamos a ``kit_size_change_values`` pasando en ``kit_size`` otra vez, pero esta vez con el segundo argumento como ``true`` así que lo activamos. Como cambiamos ``kit_size`` al valor pasado, esto hará visible cualquier tamaño de kit que se haya pasado.
fr: Nous assignons ensuite ``kit_size`` à la nouvelle valeur passé en paramètre ``value``. Puis, nous appelons ``kit_size_change_values`` en passant ``kit_size`` en paramètre mais en ajoutant cette fois-ci ``true`` en tant que second argument afin de l'activer. Parce que nous avons changé ``kit_size`` à la valeur passée en paramètre, cela va rendre le kit passé en paramètre visible.
ja: 次に、渡された新しい値 ``value`` を ``kit_size`` に割り当てます。 次に ``kit_size_change_values`` を呼び出して ``kit_size`` を再度渡しますが、今回は2番目の引数を ``true`` にして、有効にします。\ ``kit_size`` を渡された値に変更したため、渡されたキットのサイズが見えるようになります。
zh_cn: 然后我们将 ``kit_size`` 分配给传入的新值 ``value`` 。 然后我们再次调用 ``kit_size_change_values`` 传递 ``kit_size`` ，但这次使用第二个参数作为 ``true`` ，所以我们启用它。 因为我们将 ``kit_size`` 更改为传入的值，这将使得任何工具包大小都可见。

source: If ``is_ready`` is not ``true``, we simply assign ``kit_size`` to the passed in ``value``.
es: Si "is_ready" no es ``true``, simplemente asignamos ``kit_size`` al ``valor`` pasado.
fr: Si ``is_ready`` n'est pas à ``true``, on assigne simplement la valeur passé en paramètre ``value`` à ``kit_size``.
ja: ``is_ready`` が ``true`` でない場合、渡された ``value`` に ``kit_size`` を割り当てるだけです。
zh_cn: 如果 ``is_ready`` 不是 ``true`` ，我们只需将 ``kit_size`` 分配给传入的 ``value`` 。

source: Now let's look at ``kit_size_change_values``.
es: Ahora veamos los ``kit_size_change_values``.
fr: Maintenant, jetons un œil à ``kit_size_change_values``.
ja: それでは、\ ``kit_size_change_values`` を見てみましょう。
zh_cn: 现在让我们来看看 ``kit_size_change_values`` 。

source: The first thing we do is check to see which size was passed in. Based on which size we want to enable/disable, we want to get different nodes.
es: Lo primero que hacemos es comprobar qué tamaño se pasó. Basándonos en el tamaño que queremos activar/desactivar, queremos obtener diferentes nodos.
fr: La première chose que nous faisons est de vérifier quelle taille a été passé en paramètre. En fonction de la taille que nous voulons activer, nous voulons différents nœuds.
ja: 最初に行うのは、渡されたサイズを確認することです。有効/無効にするサイズに基づいて、異なるノードを取得します。

source: We get the collision shape for the node corresponding to ``size`` and disable it based on the ``enabled`` passed in argument/variable.
es: Obtenemos la forma de colisión del nodo correspondiente al ``size`` y lo deshabilitamos basándonos en el ``enabled`` pasado en el argumento/variable.
fr: On récupère la collision shape pour le nœud correspondant à la ``size`` et on la désactive grâce au paramètre ``enabled`` passé en argument/variable.
ja: ``size`` に対応するノードのコリジョンシェイプを取得し、引数/変数で渡された ``enabled`` に基づいて無効にします。
zh_cn: 我们得到对应于 ``size`` 的节点的碰撞形状，并根据参数/变量中传递的 ``enabled`` 禁用它。

source: Why are we using ``!enable`` instead of ``enable``? This is so when we say we want to enable the node, we can pass in ``true``, but since :ref:`CollisionShape <class_CollisionShape>` uses disabled instead of enabled, we need to flip it. By flipping it, we can enable the collision shape and make the mesh visible when ``true`` is passed in.
es: ¿Por qué usamos ``!enable`` en lugar de ``enable``? Esto es así, cuando decimos que queremos habilitar el nodo, podemos pasar en ``true``, pero como :ref:`CollisionShape <class_CollisionShape>` usa disabled en lugar de enabled, necesitamos darle la vuelta. Al voltearlo, podemos habilitar la forma de colisión y hacer la malla visible cuando se pasa ``true``.
fr: Pourquoi utilisons nous ``!enable`` au lieu de ``enable`` ? C'est ainsi car quand nous souhaitons activer le nœud, nous pouvons passer ``true`` en paramètre mais parce que :ref:`CollisionShape <class_CollisionShape>` utilise ``disabled`` au lieu de ``enabled``, nous devons l'inverser. En faisant cela, nous pouvons activer la collision shape et rendre le mesh visible quand ``true`` est passé en paramètre.
ja: ``enable`` の代わりに ``!enable`` を使用するのはなぜですか？ これは、ノードを有効にしたいというときは ``true`` を渡すことができますが、\ :ref:`CollisionShape <class_CollisionShape>` は有効化ではなく無効化という考え方を使っているので、反転する必要があります。 それを反転させることで、コリジョンシェイプを有効にし、\ ``true`` が渡されたときにメッシュを表示できます。
zh_cn: 为什么我们使用 ``！enable`` 而不是 ``enable`` ？ 当我们说要启用节点时，我们可以传入 ``true`` ，但是因为 :ref:`CollisionShape <class_CollisionShape>` 使用禁用而不是启用，我们需要翻转它。 通过翻转它，我们可以启用碰撞形状，并在传入“true”时使网格可见。

source: We then get the correct :ref:`Spatial <class_Spatial>` node holding the mesh and set its visibility to ``enable``.
es: Entonces obtenemos el nodo correcto :ref:`Spatial <class_Spatial>` que sostiene la malla y fijamos su visibilidad en ``enable``.
fr: Nous récupérons alors la bon nœud :ref:`Spatial <class_Spatial>` qui contient le mesh et nous changeons sa visibilité en ``enable``.
ja: 次に、メッシュを保持する正しい :ref:`Spatial <class_Spatial>` ノードを取得し、その可視性を ``enable`` に設定します。
zh_cn: 然后我们得到正确的 :ref:`Spatial <class_Spatial>` 节点保存网格并将其可见性设置为 ``enable`` 。

source: This function may be a little confusing; try to think of it like this: We're enabling/disabling the proper nodes for ``size`` using ``enabled``. This is so we cannot pick up health for a size that is not visible, and so only the mesh for the proper size will be visible.
es: Esta función puede ser un poco confusa; intente pensar en ella de esta manera: Estamos habilitando/deshabilitando los nodos apropiados para ``size`` usando ``enabled``. Esto es para que no podamos recoger la salud para un tamaño que no es visible, y así sólo la malla para el tamaño adecuado será visible.
fr: Cette fonction peut être déroute ; essayez de penser comme ceci : On active/désactive les nœuds appropriés pour ``size`` en utilisant ``enabled``. Ainsi, nous ne pouvons pas récupérer de la santé pour une taille qui n'est pas visible et seul les mesh avec la taille appropriés sont visibles.
ja: この関数は少しわかりにくいかもしれません。 このように考えてみてください: ``enabled`` を使用して ``size`` の適切なノードを有効/無効にします。 これにより、表示されていないサイズの回復アイテムは取得できず、適切なサイズのメッシュのみが表示されます。

source: Finally, let's look at ``trigger_body_entered``.
es: Finalmente, veamos ``trigger_body_entered``.
fr: Enfin, regardons ``trigger_body_entered``.
ja: 最後に、\ ``trigger_body_entered`` を見てみましょう。
zh_cn: 最后，让我们看一下 ``trigger_body_entered`` 。

source: The first thing we do is check whether or not the body that has just entered has a method/function called ``add_health``. If it does, we then call ``add_health`` and pass in the health provided by the current kit size.
es: Lo primero que hacemos es comprobar si el cuerpo que acaba de entrar tiene un método/función llamado ``add_health``. Si lo tiene, entonces llamamos ``add_health`` y pasamos la salud proporcionada por el tamaño del kit actual.
fr: La première chose que nous vérifions est si oui ou non le corps qui vient d'entrer dispose d'une méthode/fonction appelée ``add_health``. Si c'est le cas, alors nous appelons ``add_health`` et passons en paramètre la santé donnée par la taille de kit actuelle.
ja: 最初に行うことは、入力した本体に ``add_health`` というメソッド/関数があるかどうかを確認することです。 もしそうなら、\ ``add_health`` を呼び出して、現在のキットサイズによって提供される回復量を渡します。

source: Then we set ``respawn_timer`` to ``RESPAWN_TIME`` so the player has to wait before the player can get health again. Finally, call ``kit_size_change_values``, passing in ``kit_size`` and ``false`` so the kit at ``kit_size`` is invisible until it has waited long enough to respawn.
es: Luego ponemos ``respawn_timer`` a ``RESPAWN_TIME`` para que el jugador tenga que esperar antes de que pueda recuperar la salud. Finalmente, llama a ``kit_size_change_value``, pasando ``kit_size`` y ``false`` para que el kit en ``kit_size`` sea invisible hasta que haya esperado lo suficiente para reaparecer.
fr: Ensuite, on assigne ``RESPAWN_TIME`` à ``respawn_timer`` de façon à ce que le joueur doive attendre avant de pouvoir regagner de la vie. Enfin, appelez ``kit_size_change_values`` en passant ``kit_size`` et ``false`` en paramètres de sorte que ``kit_size`` soit invisible jusqu'à ce qu'il ait attendu suffisamment longtemps pour réapparaître.
ja: 次に、\ ``respawn_timer`` を ``RESPAWN_TIME`` に設定し、プレイヤーが再び健康になるまで待機する必要があります。 最後に、\ ``kit_size_change_values`` を呼び出して、\ ``kit_size`` と ``false`` を渡して、\ ``kit_size`` のキットが再産出するのを待つまで、見えないようにします。
zh_cn: 然后我们将 ``respawn_timer`` 设置为 ``RESPAWN_TIME`` ，这样游戏角色必须等待游戏角色再次恢复健康状态。 最后，调用 ``kit_size_change_values`` ，传入 ``kit_size`` 和 ``false`` ，这样 ``kit_size`` 的工具包是不可见的，直到它等待足够长的时间重新生成。

source: The last thing we need to do before the player can use this health pickup is add a few things to ``Player.gd``.
es: Lo último que tenemos que hacer antes de que el jugador pueda usar esta recogida de salud es añadir algunas cosas a ``Player.gd``.
fr: La dernière chose que nous devons faire avant que le joueur puisse utiliser ces bonus de santé, c'est de compléter ``Player.gd``.
ja: プレイヤーがこの回復アイテムピックアップを使用する前に行う必要がある最後の作業は、\ ``Player.gd`` にいくつかの項目を追加することです。

source: Open up ``Player.gd`` and add the following class variable:
es: Abre ``Player.gd`` y añade la siguiente variable de clase:
fr: Ouvrez ``Player.gd`` et ajouter les variables de classe suivantes :
ja: ``Player.gd`` を開き、次のクラス変数を追加します:
zh_cn: 打开 ``Player.gd`` 并添加以下类变量:

source: ``MAX_HEALTH``: The maximum amount of health a player can have.
es: ``MAX_HEALTH``: La máxima cantidad de salud que un jugador puede tener.
fr: ``MAX_HEALTH`` : Le montant maximum de santé que le joueur peut avoir.
ja: ``MAX_HEALTH``: プレイヤーが持つことができる体力の最大量。
zh_cn: ``MAX_HEALTH``:游戏角色可以拥有的最大健康状态。

source: Now we need to add the ``add_health`` function to the player. Add the following to ``Player.gd``:
es: Ahora necesitamos agregar la función ``add_health`` al jugador. Añade lo siguiente a ``Player.gd``:
fr: Maintenant, nous devons ajouter la fonction ``add_health`` au joueur. Ajoutez ce qui suit au ``Player.gd`` :
ja: 次に、プレイヤーに ``add_health`` 関数を追加する必要があります。以下を ``Player.gd`` に追加します:
zh_cn: 现在我们需要将“add_health”函数添加到游戏角色中。 将以下内容添加到``Player.gd``:

source: Let's quickly go over what this does.
es: Repasemos rápidamente lo que esto hace.
fr: Passons en revue rapidement son utilité.
ja: これを簡単に説明しましょう。
zh_cn: 让我们快点回顾一下这个问题。

source: We first add ``additional_health`` to the player's current health. We then clamp the health so that it cannot take on a value higher than ``MAX_HEALTH``, nor a value lower than ``0``.
es: Primero añadimos ``additional_health`` a la salud actual del jugador. Luego fijamos la salud de manera que no pueda tomar un valor más alto que ``MAX_HEALTH``, ni un valor más bajo que ``0``.
fr: Nous ajoutons d'abord ``additional_health`` à la santé actuelle du joueur. Nous limitons ensuite la santé de façon à ce que cette valeur ne dépasse pas la valeur de ``MAX_HEALTH``, ou bien une valeur inférieure à ``0``.
ja: まず、プレイヤーの現在の体力に ``additional_health`` を追加します。次に、体力をクランプして、\ ``MAX_HEALTH`` よりも高い値、または ``0`` よりも低い値を取ることができないようにします。

source: With that done, the player can now collect health! Go place a few ``Health_Pickup`` scenes around and give it a try. You can change the size of the health pickup in the editor when a ``Health_Pickup`` instanced scene is selected, from a convenient drop down.
es: Con eso hecho, el jugador puede ahora recoger la salud! Coloca algunas escenas de ``Health_Pickup`` alrededor y pruébalo. Puedes cambiar el tamaño de la recogida de salud en el editor cuando se selecciona una escena instanciada de ``Health_Pickup``, desde un conveniente menú desplegable.
fr: Ceci fait, le joueur peut maintenant récupérer de la santé ! Allez placer quelques scènes ``Health_Pickup`` dans la carte et essayez par vous-même. Vous pouvez changer la taille des bonus de santé dans l'éditeur quand un ``Health_Pickup`` instancié dans la scène est sélectionné à partir d'une liste déroulante très pratique.
ja: これが完了すると、プレイヤーは回復アイテムを収集できるようになります！いくつかの ``Health_Pickup`` シーンをいくつか配置して試してみてください。インスタンス化された ``Health_Pickup`` シーンが選択されたときに、便利なドロップダウンからエディタで回復アイテムピックアップのサイズを変更できます。

source: Adding the ammo pickups
es: Añadiendo las recogidas de munición
fr: Ajouter des munitions ramassables
ja: 弾薬ピックアップの追加

source: While adding health is good and all, we can't reap the rewards from adding it since nothing can (currently) damage us. Let's add some ammo pickups next!
es: Aunque añadir salud es bueno y todo eso, no podemos recoger las recompensas ya que nada puede (actualmente) dañarnos. ¡Ahora vamos a añadir algunas municiones!
fr: Bien que l'ajout de santé soit bénéfique, nous ne pouvons pas en voir les effets (actuellement) car rien ne peut nous faire des dégâts. Ajoutons quelques bonus de munitions ensuite !
ja: 体力を追加できることはとても良いことですが、(現在)何ものも私たちを傷つけることはできないので、追加してもなにもご褒美を得ることができません。 次に弾薬箱を追加しましょう！

source: Open up ``Ammo_Pickup.tscn``. Notice how it's structured exactly the same as ``Health_Pickup.tscn``, but with the meshes and trigger collision shapes changed slightly to account for the difference in mesh sizes.
es: Abre ``Ammo_Pickup.tscn``. Fíjate en cómo está estructurado exactamente igual que ``Health_Pickup.tscn``, pero con las mallas y las formas de colisión disparadoras cambiaran ligeramente para explicar la diferencia en los tamaños de las mallas.
fr: Ouvrez ``Ammo_Pickup.tscn``. Notez que la structure est exactement la même que ``Health_Pickup.tscn``, mais que les meshes et les déclencheurs collision shapes sont changé un petit peu pour prendre en compte les différences de tailles des meshes.
ja: ``Ammo_Pickup.tscn`` を開きます。\ ``Health_Pickup.tscn`` とまったく同じように構成されていますが、メッシュとトリガーのコリジョンシェイプがメッシュサイズの違いを考慮してわずかに変更されていることに注意してください。

source: Select ``Ammo_Pickup`` and add a new script called ``Ammo_Pickup.gd``. Add the following:
es: Selecciona ``Ammo_Pickup`` y añade un nuevo script llamado ``Ammo_Pickup.gd``. Añade lo siguiente:
fr: Sélectionnez ``Ammo_Pickup`` et ajoutez un nouveau script appelé ``Ammo_Pickup.gd``. Ajoutez ce qui suit :
ja: ``Ammo_Pickup`` を選択し、\ ``Ammo_Pickup.gd`` という新しいスクリプトを追加します。 次のように追加します:
zh_cn: 选择 ``Ammo_Pickup`` 并添加一个名为 ``Ammo_Pickup.gd`` 的新脚本。 添加以下内容:

source: You may have noticed this code looks almost exactly the same as the health pickup. That's because it largely is the same! Only a few things have been changed, and that's what we're going to go over.
es: Habrás notado que este código se ve casi exactamente igual que el de la salud. ¡Eso es porque en gran medida es el mismo! Sólo unas pocas cosas han sido cambiadas, y eso es lo que vamos a repasar.
fr: Vous avez peut être remarqué que ce code ressemble presque exactement à celui des bonus de santé. Cela est du au fait qu'il lui ressemble énormément. Seuls quelques détails ont changés et ce que nous allons examiner.
ja: このコードは、回復アイテムピックアップとほぼ同じに見えることに気付いたかもしれません。 それはほとんど同じだからです！ 変更されたのはごく一部であり、それが私たちが検討することです。

source: Firstly, notice the change to ``AMMO_AMOUNTS`` from ``HEALTH_AMMOUNTS``. ``AMMO_AMOUNTS`` will be how many ammo clips/magazines the pickup adds to the current weapon. (Unlike in the case of ``HEALTH_AMMOUNTS``, which has stood for how many health points would be awarded, we add an entire clip to the current weapon instead of the raw ammo amount)
es: Primero, nota el cambio a ``AMMO_AMOUNTS`` de ``HEALTH_AMMOUNTS``. ``AMMO_AMMOUNTS`` será la cantidad de municiones/cargadores que se añade al arma actual. (A diferencia del caso de ``HEALTH_AMMOUNTS``, que el cual nos dice cuantos puntos de salud se conceden, añadiremos un clip entero al arma actual en lugar de la cantidad de munición bruta)
fr: Premièrement, remarquez le changement de ``HEALTH_AMMOUNTS`` à ``AMMO_AMOUNTS``. ``AMMO_AMOUNTS`` va correspondre au nombre de chargeurs que le bonus ajoute à votre arme courante. (Contrairement au cas de ``HEALTH_AMMOUNTS`` qui représente le nombre de points de santé ajouté, nous ajoutons ici un chargeur entier à larme actuelle au lieu d'une quantité brute de munitions)
ja: まず、\ ``HEALTH_AMMOUNTS`` から ``AMMO_AMOUNTS`` に変更することに注意してください。\ ``AMMO_AMOUNTS`` は、ピックアップが現在の武器に追加する弾薬クリップ/マガジンの数です。回復ポイントがいくつ付与されるかを表す ``HEALTH_AMMOUNTS`` の場合とは異なり、生の弾薬量ではなくクリップ全体を現在の武器に加算します)

source: The only other thing to notice is in ``trigger_body_entered``. We're checking for the existence of and calling a function called ``add_ammo`` instead of ``add_health``.
es: La única otra cosa que hay que notar está en ``trigger_body_entered``. Estamos comprobando la existencia y llamando a una función llamada ``add_ammo`` en lugar de ``add_health``.
fr: La seule autre chose à remarquer est dans ``trigger_body_entered``. Nous vérifions l'existence et nous appelons la fonction appelée ``add_ammo`` et non pas ``add_health``.
ja: 注目すべき他の唯一のものは ``trigger_body_entered`` にあります。\ ``add_health`` の代わりに ``add_ammo`` と呼ばれる関数の存在を確認し、呼び出しています。

source: Other than those two small changes, everything else is the same as the health pickup!
es: Aparte de esos dos pequeños cambios, ¡todo lo demás es lo mismo que la salud!
fr: En dehors de ces deux petits changements, tout le reste est exactement pareil que pour le bonus de santé !
ja: これら2つの小さな変更を除いて、他のすべては回復アイテムピックアップと同じです！

source: All we need to do to make the ammo pickups work is add a new function to the player. Open ``Player.gd`` and add the following function:
es: Todo lo que tenemos que hacer para que funcionen las recogidas de munición es añadir una nueva función al jugador. Abre ``Player.gd`` y añade la siguiente función:
fr: Tout ce que nous devons faire pour faire fonctionner ces bonus de munitions, c'est d'ajouter une nouvelle fonction au joueur. Ouvrez ``Player.gd`` et ajoutez la fonction suivante :
ja: 弾薬のピックアップを機能させるために必要なことは、プレイヤーに新しい関数を追加することだけです。\ ``Player.gd`` を開き、次の関数を追加します:

source: Let's go over what this function does.
es: Repasemos lo que hace esta función.
fr: Regardons son fonctionnement.
ja: この関数の動作について説明します。
zh_cn: 让我们回顾一下这个功能的作用。

source: The first thing we check is whether the player is ``UNARMED``. Because ``UNARMED`` does not have a node/script, we want to make sure the player is not ``UNARMED`` before trying to get the node/script attached to ``current_weapon_name``.
es: Lo primero que comprobamos es si el jugador está ``UNARMED``. Como ``UNARMED`` no tiene un nodo/script, queremos asegurarnos de que el jugador no está ``UNARMED`` antes de intentar que el nodo/script se adjunte al ``current_weapon_name``.
fr: La première chose que nous vérifions c'est si le joueur est ``UNARMED``. Nous devons vérifier ceci car ``UNARMED`` ne dispose pas d'un nœud/script et nous devons nous assurer que le joueur n'est pas ``UNARMED`` avant de récupérer le nœud/script attaché à ``current_weapon_name``.
ja: 最初に確認するのは、プレイヤーが ``UNARMED`` かどうかです。\ ``UNARMED`` にはノード/スクリプトがないため、ノード/スクリプトを ``current_weapon_name`` にアタッチする前に、プレイヤーが ``UNARMED`` になっていないことを確認する必要があります。

source: Next, we check to see if the current weapon can be refilled. If the current weapon can, we add a full clip/magazine worth of ammo to the weapon by multiplying the current weapon's ``AMMO_IN_MAG`` value by however many ammo clips we're adding (``additional_ammo``).
es: A continuación, comprobamos si el arma actual puede ser recargada. Si el arma actual puede, añadimos un cargador completo de munición al arma multiplicando el valor de ``AMMO_IN_MAG`` del arma actual por todos los cargadores de munición que añadamos(``additional_ammo``).
fr: Ensuite, nous vérifions que l'arme courante peut être remplie. Si c'est le cas, nous lui ajoutons un chargeur entier de munitions en multipliant la valeur ``AMMO_IN_MAG`` par combien de chargeurs nous voulons lui ajouter (``additional_ammo``).
ja: 次に、現在の武器を補充できるかどうかを確認します。 現在の武器が補充可能であれば、現在の武器の ``AMMO_IN_MAG`` 値に追加する弾薬クリップの数(``additional_ammo``)を掛けることで、完全なクリップ/弾倉に相当する弾薬を武器に追加します。
zh_cn: 接下来我们检查当前的武器是否可以重新填充。 如果当前的武器可以，我们通过将当前武器的 ``AMMO_IN_MAG`` 变量乘以额外的弹夹数目（``additional_ammo``），来为武器添加完整的弹夹/弹仓所容纳的弹药量。
