Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_five.po
Languages: de, es, fr, ja, zh_cn

source: If the sticky grenade is attached, we then make sure the attached point is not equal to ``null``. If the attached point is not equal to ``null``, we set the sticky grenade's global position (using its global :ref:`Transform <class_Transform>`'s origin) to the global position of the :ref:`Spatial <class_Spatial>` assigned to ``attach_point`` (using its global :ref:`Transform <class_Transform>`'s origin).
de: Wenn die Haftgranate befestigt ist, stellen wir sicher, dass der Befestigungspunkt nicht gleich ``null`` ist. Wenn der angehängte Punkt nicht gleich ``null``` ist, setzen wir die globale Position der Haftgranate (unter Verwendung ihres globalen :ref:`Transform <class_Transform>` Ursprungs) auf die globale Position des :ref:`Spatial <class_Spatial>`, das dem ``attach_point`` zugeordnet ist (unter Verwendung ihres globalen :ref:`Transform <class_Transform>` Ursprungs).
es: Si la granada pegajosa está pegada, nos aseguramos de que el punto pegado no sea igual a ``null``. Si el punto de unión no es igual a ``null``, fijamos la posición global de la granada pegajosa (usando su global :ref:`Transform <class_Transform>`'s origin) a la posición global de la :ref:`Spatial <class_Spatial>` asignada al ``attach_point`` (usando su global :ref:`Transform <class_Transform>`'s origin).
fr: Si la grenade collante est attachée, nous nous assurons que le point sur lequel elle est attachée n'est pas ``null``. Si le point attaché n'est pas égal à ``null``, on assigne à la position globale de la grenade (en utilisant l'origine globale de son :ref:`Transform <class_Transform>`) à la position globale du :ref:`Spatial <class_Spatial>` assigné au ``attach_point`` (en utilisant l'origine globale de son :ref:`Transform <class_Transform>`).
ja: 粘着性手榴弾が固着している場合、取り付けられたポイントが ``null`` と等しくないことを確認します。固着したポイントが ``null`` と等しくない場合、粘着性手榴弾のグローバルポジション(グローバル :ref:`Transform <class_Transform>` のorigin)を ``attach_point`` に割り当てられた :ref:`Spatial <class_Spatial>` のグローバルポジション(グローバル :ref:`Transform <class_Transform>` のorigin)に設定します。
zh_cn: 如果连接了粘性手榴弹，我们确保附加的点不等于“null”。 如果附加的点不等于 ``null`` ，我们将粘性手榴弹的全局位置(使用其global :ref:`Transform <class_Transform>的原点)设置为 :ref:`Spatial <的全局位置 class_Spatial>` 赋值给 ``attach_point`` (使用它的global :ref:`Transform <class_Transform>` 的原点)。

source: The only other change is now before we free/destroy the sticky grenade is to check to see if the sticky grenade has an attached point. If it does, we also call ``queue_free`` on the attach point, so it's also freed/destroyed.
de: Die einzige andere Änderung ist nun, dass wir vor dem Freilassen/Zerstören der Haftgranate prüfen müssen, ob die Haftgranate einen Befestigungspunkt hat. Wenn das der Fall ist, rufen wir auch ``queue_free`` auf dem Befestigungspunkt auf, so dass sie ebenfalls freigesetzt/zerstört wird.
es: El único otro cambio es que antes de liberar/destruir la granada adhesiva es comprobar si la granada adhesiva tiene un punto de enganche. Si lo tiene, también llamamos ``queue_free`` al punto de unión, así que también se libera/destruye.
fr: Le seul autre changement est avant la destruction de la grenade collante pour vérifier si celle-ci a un point attaché. Si c'est le cas, on appelle aussi ``queue_free`` sur ce point afin qu'il soit également détruit.
ja: 他の唯一の変更点は、粘着性手榴弾を解放/破棄する前に、粘着性手榴弾が固着したポイントを保持しているかどうかを確認することです。 もしそうなら、固着ポイントで ``queue_free`` も呼び出すので、それも解放/破棄されます。
zh_cn: 在我们释放/销毁粘性手榴弹之前，现在唯一的另一个变化是检查粘性手榴弹是否有附着点。 如果是这样，我们也在连接点上调用 ``queue_free`` ，因此它也被释放/销毁。

source: Adding grenades to the player
de: Dem Spieler Granaten hinzufügen
es: Añadiendo granadas al jugador
fr: Ajouter des grenades au joueur
ja: プレイヤーに手榴弾を追加する
zh_cn: 向游戏角色添加手榴弹

source: Now we need to add some code to ``Player.gd`` so we can use the grenades.
de: Jetzt müssen wir etwas Code zu ``Player.gd`` hinzufügen, damit wir die Granaten benutzen können.
es: Ahora necesitamos añadir algún código a ``Player.gd`` para poder usar las granadas.
fr: Nous devons maintenant ajouter un petit peu de code au ``Player.gd`` afin de pouvoir utiliser les grenades.
ja: 次に、手榴弾を使用できるように、いくつかのコードを ``Player.gd`` に追加する必要があります。
zh_cn: 现在我们需要在 ``Player.gd`` 中添加一些代码，以便我们可以使用手榴弹。

source: Firstly, open up ``Player.tscn`` and expand the node tree until you get to ``Rotation_Helper``. Notice how in ``Rotation_Helper`` we have a node called ``Grenade_Toss_Pos``. This is where we will be spawning the grenades.
de: Öffnen Sie zunächst ``Player.tscn`` und erweitern Sie den Nodebaum, bis Sie bei ``Rotation_Helper`` angelangt sind. Beachten Sie, dass wir in ``Rotation_Helper`` eine Node namens ``Granate_Toss_Pos`` haben. Hier werden wir die Granaten spawnen.
es: En primer lugar, abre ``Player.tscn`` y expande el árbol de nodos hasta que llegues a ``Rotation_Helper``. Fíjate en que en ``Rotation_Helper`` tenemos un nodo llamado ``Grenade_Toss_Pos``. Aquí es donde generaremos las granadas.
fr: Commencez par ouvrir ``Player.tscn`` et développez l'arbre des nœuds jusqu'à ce que vous obteniez ``Rotation_Helper``. Remarquez que nous avons un nœud appelé ``Grenade_Toss_Pos`` dans ``Rotation_Helper``. C'est ici que nous allons faire apparaître les grenades.
ja: まず、\ ``Player.tscn`` を開き、\ ``Rotation_Helper`` に到達するまでノードツリーを展開します。\ ``Rotation_Helper`` に ``Grenade_Toss_Pos`` というノードがあることに注意してください。これは手榴弾を産出する場所です。

source: Also notice how it's slightly rotated on the ``X`` axis, so it's not pointing straight, but rather slightly up. By changing the rotation of ``Grenade_Toss_Pos``, you can change the angle at which the grenades are tossed.
de: Beachten Sie auch, wie es leicht um die ``X``-Achse gedreht ist, so dass es nicht gerade, sondern eher leicht nach oben zeigt. Indem Sie die Drehung von ``Granate_Toss_Pos`` ändern, können Sie den Winkel ändern, in dem die Granaten geworfen werden.
es: También noten cómo está ligeramente girado en el eje ``X``, así que no está apuntando derecho, sino ligeramente hacia arriba. Cambiando la rotación de ``Grenade_Toss_Poss``, puedes cambiar el ángulo en el que se lanzan las granadas.
fr: Remarquez également que le nœud est légèrement incliné sur l'axe ``X`` de façon à ce qu'il ne pointe pas tout droit mais plutôt un peu en l'air. En changeant la rotation de ``Grenade_Toss_Pos``, vous pouvez également changer l'angle où les grenades sont projetées.
ja: また、\ ``X`` 軸上でわずかに回転しているため、真っ直ぐではなく、わずかに上を向いています。\ ``Grenade_Toss_Pos`` の回転を変更することで、手榴弾が投げられる角度を変更できます。

source: Okay, now let's start making the grenades work with the player. Add the following class variables to ``Player.gd``:
de: Okay, fangen wir nun an, die Granaten mit dem Spieler zum Funktionieren zu bringen. Fügen Sie die folgenden Klassenvariablen zu ``Player.gd`` hinzu:
es: Bien, ahora empecemos a hacer que las granadas funcionen con el jugador. Añade las siguientes variables de clase a ``Player.gd``:
fr: Très bien, faisons maintenant en sorte que les grenades fonctionnent avec le joueur. Ajoutez les variables de classe suivantes au ``Player.gd`` :
ja: さて、プレイヤーと手榴弾を機能させましょう。次のクラス変数を ``Player.gd`` に追加します:
zh_cn: 好的，现在让我们开始让手榴弹与游戏角色一起工作。 将以下类变量添加到``Player.gd``:

source: ``grenade_amounts``: The amount of grenades the player is currently carrying (for each type of grenade).
de: ``grenade_amounts``: Die Anzahl der Granaten, die der Spieler gerade trägt (für jeden Granatentyp).
es: ``grenade_amounts``: La cantidad de granadas que el jugador lleva actualmente (para cada tipo de granada).
fr: ``grenade_amounts`` : Le nombre de grenades que le joueur porte actuellement (pour chaque type de grenade).
ja: ``grenade_amounts``: プレイヤーが現在運んでいる手榴弾の量(手榴弾の種類ごとの)。
zh_cn: ``grenade_amounts``:游戏角色当前携带的手榴弹数量(针对每种类型的手榴弹)。

source: ``current_grenade``: The name of the grenade the player is currently using.
de: ``current_grenade``: Der Name der Granate, die der Spieler gerade verwendet.
es: ``current_grenade``: El nombre de la granada que el jugador está usando actualmente.
fr: ``current_grenade`` : Le nom de la grenade que le joueur utilise actuellement.
ja: ``current_grenade``: プレイヤーが現在使用している手榴弾の名前。
zh_cn: ``current_grenade``:游戏角色目前正在使用的手榴弹的名称。

source: ``grenade_scene``: The grenade scene we worked on earlier.
de: ``grenade_scene``: Die Granatenszene, an der wir früher gearbeitet haben.
es: ``grenade_scene``: La escena de la granada en la que trabajamos antes.
fr: ``grenade_scene`` : La scène de grenade sur laquelle nous avons travaillé plus tôt.
ja: ``grenade_scene``: 先ほど取り組んだ手榴弾のシーン。
zh_cn: ``grenade_scene``:我们之前工作的手榴弹场景。

source: ``sticky_grenade_scene``: The sticky grenade scene we worked on earlier.
de: ``sticky_grenade_scene``: Die Haftgranaten-Szene, an der wir früher gearbeitet haben.
es: ``sticky_grenade_scene``: La escena de la granada pegajosa en la que trabajamos antes.
fr: ``sticky_grenade_scene`` : La scène de grenade collante sur laquelle nous avons travaillé plus tôt.
ja: ``sticky_grenade_scene``: 先ほど取り組んだ粘着性手榴弾のシーン。
zh_cn: ``sticky_grenade_scene``:我们之前工作过的粘手榴弹场景。

source: ``GRENADE_THROW_FORCE``: The force at which the player will throw the grenades.
de: ``GRENADE_THROW_FORCE``: Die Kraft mit der der Spieler die Granaten wirft.
es: ``GRENADE_THROW_FORCE``: La fuerza a la que el jugador lanzará las granadas.
fr: ``GRENADE_THROW_FORCE`` : La force avec laquelle le joueur va lancer les grenades.
ja: ``GRENADE_THROW_FORCE``: プレイヤーが手榴弾を投げる力。

source: Most of these variables are similar to how we have our weapons set up.
de: Die meisten dieser Variablen ähneln der Art und Weise, wie wir unsere Waffen eingerichtet haben.
es: La mayoría de estas variables son parecidas a la forma en que tenemos nuestras armas configuradas.
fr: La plupart de ces variables sont similaires à la façon dont nous avons mis en place nos armes.
ja: これらの変数のほとんどは、武器のセットアップ方法に似ています。
zh_cn: 大多数这些变量与我们设置武器的方式类似。

source: While it's possible to make a more modular grenade system, I found it was not worth the additional complexity for just two grenades. If you were going to make a more complex FPS with more grenades, you'd likely want to make a system for grenades similar to how we have the weapons set up.
es: Aunque es posible hacer un sistema de granadas más modular, descubrí que no valía la pena la complejidad adicional por sólo dos granadas. Si fueras a hacer un FPS más complejo con más granadas, probablemente querrías hacer un sistema para granadas similar a como tenemos las armas puestas.
fr: Bien qu'il soit possible de faire un système de grenade plus modulaire, j'ai trouvé qu'il n'était pas nécessaire d'ajouter de la complexité pour seulement deux grenades. Si vous étiez amené à créer un FPS plus complexe avec plus de grenades, vous devriez probablement utiliser un système de grenade similaire à celui utilisé pour les armes.
ja: よりモジュール化された手榴弾システムを作成することは可能ですが、たった2つの手榴弾を追加するだけの為には、その複雑さに価値はないことがわかりました。手榴弾の種類の多いより複雑なFPSを作成する場合は、武器のセットアップ方法と同様の手榴弾用のシステムを作成することをお勧めします。
zh_cn: 虽然可以制作更模块化的手榴弹系统，但我发现仅仅两枚手榴弹的额外复杂性是不值得的。 如果您打算制造一个更复杂的FPS和更多的手榴弹，您可能想要建立一个类似于我们如何设置武器的手榴弹系统。

source: Now we need to add some code in ``_process_input`` Add the following to ``_process_input``:
de: Jetzt müssen wir etwas Code in ``_process_input`` hinzufügen:
es: Ahora necesitamos añadir algún código en ``_process_input`` Añadimos lo siguiente a ``_process_input``:
fr: Nous avons maintenant besoin 'ajouter un peu de code dans ``_process_input``. Ajoutez ce qui suit :
ja: ``_process_input`` にコードを追加する必要があります ``_process_input`` に以下を追加します:
zh_cn: 现在我们需要在 ``_process_input`` 中添加一些代码。将以下内容添加到``_process_input``:

source: Let's go over what's happening here.
de: Lassen Sie uns noch einmal durchgehen was hier passiert.
es: Repasemos lo que está pasando aquí.
fr: Voyons ce qui s'y passe.
ja: ここで何が起こっているのか見ていきましょう。
zh_cn: 让我们回顾一下这里发生的事情。

source: Firstly, we check to see if the ``change_grenade`` action has just been pressed. If it has, we then check to see which grenade the player is currently using. Based on the name of the grenade the player is currently using, we change ``current_grenade`` to the opposite grenade name.
es: En primer lugar, comprobamos si la acción ``change_grenade`` acaba de ser presionada. Si lo ha hecho, entonces comprobamos qué granada está usando actualmente el jugador. Basándonos en el nombre de la granada que el jugador está usando actualmente, cambiamos ``current_grenade`` por el nombre de la granada opuesta.
fr: Premièrement, nous allons vérifier si l'action ``change_grenade`` vient d'être activée. Si c'est le cas, nous vérifions alors qu'elle grenade le joueur utilise. En fonction du nom de la grenade que le joueur utilise, on change ``current_grenade`` au nom de la grenade opposée.
ja: まず、\ ``change_grenade`` アクションが押されたかどうかを確認します。その場合は、プレイヤーが現在使用している手榴弾を確認します。プレイヤーが現在使用している手榴弾の名前に基づいて、\ ``current_grenade`` を逆のの手榴弾の名前に変更します。

source: Next we check to see if the ``fire_grenade`` action has just been pressed. If it has, we then check to see if the player has more than ``0`` grenades for the current grenade type selected.
es: A continuación comprobamos si la acción ``fire_grenade`` acaba de ser presionada. Si lo ha hecho, entonces comprobamos si el jugador tiene más de ``0`` granadas para el tipo de granada seleccionada.
fr: Nous vérifions ensuite si l'action ``fire_grenade`` vient d'être activée. SI c'est le cas, on vérifie alors si le joueur a plus de ``0`` grenades pour le type de grenade actuellement sélectionnée.
ja: 次に、\ ``fire_grenade`` アクションが押されたばかりかどうかを確認します。その場合は、選択した現在の手榴弾タイプに対して、プレイヤーが ``0`` 以上の手榴弾を持っているかどうかを確認します。
zh_cn: 接下来我们检查是否刚刚按下了 ``fire_grenade`` 动作。 如果有，我们检查游戏角色是否有超过“0”的手榴弹，用于当前选择的手榴弹类型。

source: If the player has more than ``0`` grenades, we then remove one from the grenade amounts for the current grenade. Then, based on the grenade the player is currently using, we instance the proper grenade scene and assign it to ``grenade_clone``.
es: Si el jugador tiene más de ``0`` granadas, entonces quitamos una de las cantidades de granadas para la granada actual. Entonces, basándonos en la granada que el jugador está usando actualmente, ponemos la escena de granada apropiada y la asignamos a ``grenade_clone``.
fr: Si le joueur a plus de ``0`` grenades, on retire un du nombre actuellement porté pour le type de grenade sélectionné. Ensuite, en se basant sur la grenade actuellement utilisée, on instancie la scène de la grenade est on l'assigne à ``grenade_clone``.
ja: プレイヤーが ``0`` を超える手榴弾を持っている場合、現在の手榴弾の手榴弾数から1つ減らします。次に、プレイヤーが現在使用している手榴弾に基づいて、適切な手榴弾シーンをインスタンス化し、\ ``grenade_clone`` に割り当てます。
zh_cn: 如果游戏角色拥有超过“0”的手榴弹，我们就会从当前手榴弹的手榴弹数量中移除一枚。 然后，根据游戏角色当前正在使用的手榴弹，我们实例化正确的手榴弹场景并将其分配给“grenade_clone”。

source: Next we add ``grenade_clone`` as a child of the node at the root and set its global :ref:`Transform <class_Transform>` to ``Grenade_Toss_Pos``'s global :ref:`Transform <class_Transform>`. Finally, we apply an impulse to the grenade so that it is launched forward, relative to the ``Z`` directional vector of ``grenade_clone``'s.
es: A continuación añadimos ``grenade_clone`` como hijo del nodo de la raíz y ponemos su global :ref:`Transform <class_Transform>` al global de ``Grenade_Toss_Pos`` :ref:`Transform <class_Transform>`. Finalmente, aplicamos un impulso a la granada para que sea lanzada hacia adelante, relativo al vector direccional ``Z`` del ``grenade_clone``.
fr: Nous ajoutons ensuite ``grenade_clone`` en tant que fils du nœud à la racine et on assigne son :ref:`Transform <class_Transform>` global au :ref:`Transform <class_Transform>` global de ``Grenade_Toss_Pos``. Enfin, on applique une impulsion à la grenade de façon à ce qu'elle soit lancée devant, de façon relative au vecteur directionnel ``Z`` de ``grenade_clone``.
ja: 次に、ルートのノードの子として ``grenade_clone`` を追加し、そのグローバル :ref:`Transform <class_Transform>` を ``Grenade_Toss_Pos`` のグローバル :ref:`Transform <class_Transform>` に設定します。最後に、手榴弾に衝撃を与え、手榴弾クローンの ``Z`` 方向ベクトルに対して前方に発射されるようにします。
zh_cn: 接下来，我们将 ``grenade_clone`` 添加为根节点的子节点，并将其global :ref:`Transform <class_Transform>` 设置为 ``Grenade_Toss_Pos`` 的global :ref:`Transform <class_Transform>`。 最后，我们对手榴弹施加一个冲动，使它相对于 ``grenade_clone`` 的 ``Z`` 方向向量向前发射。

source: Now the player can use both types of grenades, but there are still a few things we should probably add before we move on to adding the other things.
de: Jetzt kann der Spieler beide Arten von Granaten verwenden, aber es gibt noch einige Dinge, die wir wahrscheinlich hinzufügen sollten, bevor wir mit dem Hinzufügen der anderen Sachen fortfahren.
es: Ahora el jugador puede usar ambos tipos de granadas, pero todavía hay algunas cosas que probablemente deberíamos añadir antes de pasar a añadir las otras cosas.
fr: Maintenant, le joueur peut utiliser les deux types de grenades mais il reste encore quelques éléments que nous devrions probablement ajouter avant de passer à l'ajout de nouvelles fonctionnalités.
ja: プレイヤーは両方のタイプの手榴弾を使用できるようになりましたが、他のものを追加する前に追加する必要があるものがいくつかあります。
zh_cn: 现在游戏角色可以使用两种类型的手榴弹，但在我们继续添加其他东西之前，我们应该添加一些东西。

source: We still need a way to show the player how many grenades are left, and we should probably add a way to get more grenades when the player picks up ammo.
es: Aún necesitamos una forma de mostrarle al jugador cuántas granadas quedan, y probablemente deberíamos añadir una forma de conseguir más granadas cuando el jugador recoja munición.
fr: Il nous faut une manière d'indiquer au joueur combien de grenades il lui reste et nous devrions probablement ajouter une façon de récupérer plus de grenades quand le joueur ramasse des munitions.
ja: プレイヤーに手榴弾いくつ残っているかを示す方法も必要ですし、プレイヤーが弾薬を拾ってより多くの手榴弾を得る方法を追加する必要もあります。
zh_cn: 我们仍然需要一种方法向游戏角色展示剩下多少手榴弹，我们应该在游戏角色拿起弹药时增加一种获得更多手榴弹的方法。

source: Firstly, let's change some of the code in ``Player.gd`` to show how many grenades are left. Change ``process_UI`` to the following:
es: En primer lugar, cambiemos algo del código de ``Player.gd`` para mostrar cuántas granadas quedan. Cambia ``process_UI`` por lo siguiente:
fr: Tout d'abord, changeons un peu le code dans ``Player.gd`` de manière à afficher combien de grenades il lui reste. Changez ``process_UI`` de cette façon ``process_UI`` :
ja: まず、残っている手榴弾の数を示すために ``Player.gd`` のコードの一部を変更しましょう。\ ``process_UI`` を次のように変更します:

source: Now we'll show how many grenades the player has left in the UI.
de: Jetzt zeigen wir, wie viele Granaten der Spieler noch in der Benutzeroberfläche hat.
es: Ahora mostraremos cuántas granadas le quedan al jugador en la UI.
fr: Nous allons maintenant montrer de combien de grenades le joueur dispose dans l'UI.
ja: 次に、UIにプレイヤーが残している手榴弾の数を示します。
zh_cn: 现在我们将展示游戏角色在UI中留下多少手榴弹。

source: While we're still in ``Player.gd``, let's add a function to add grenades to the player. Add the following function to ``Player.gd``:
es: Mientras estamos en ``Player.gd``, agreguemos una función para agregar granadas al jugador. Añade la siguiente función a ``Player.gd``:
fr: Tant que nous sommes dans ``Player.gd``, créons une fonction pour ajouter des grenades au joueur. Ajoutez ka fonction suivante dans ``Player.gd`` :
ja: まだ ``Player.gd`` の中に、プレイヤーに手榴弾を追加する関数を追加しましょう。次の関数を ``Player.gd`` に追加します:
zh_cn: 当我们还在 ``Player.gd`` 时，让我们添加一个向游戏角色添加手榴弹的功能。 将以下函数添加到``Player.gd``:

source: Now we can add a grenade using ``add_grenade``, and it will automatically be clamped to a maximum of ``4`` grenades.
es: Ahora podemos añadir una granada usando ``add_grenade``, y automáticamente será sujetada a un máximo de ``4`` granadas.
fr: Nous pouvons maintenant ajouter une grenade en utilisant ``add_grenade``, et la valeur sera automatiquement limité à un maximum de ``4`` grenades.
ja: これで ``add_grenade`` を使用して手榴弾を追加でき、自動的に ``4`` 個の手榴弾の最大値にクランプされます。
zh_cn: 现在我们可以使用 ``add_grenade`` 添加一个手榴弹，它会自动被夹到最大的 ``4`` 手榴弹。

source: You can change the ``4`` to a constant if you want. You'd need to make a new global constant, something like ``MAX_GRENADES``, and then change the clamp from ``clamp(grenade_amounts[current_grenade], 0, 4)`` to ``clamp(grenade_amounts[current_grenade], 0, MAX_GRENADES)``
es: Puedes cambiar el ``4`` a una constante si quieres. Necesitarías hacer una nueva constante global, algo como ``MAX_GRENADES``, y luego cambiar el la cantidad de de ``clamp(grenade_amounts[current_grenade], 0, 4)`` a ``clamp(grenade_amounts[current_grenade], 0, MAX_GRENADES)``
fr: Vous pouvez changer le ``4`` en une constante si vous le souhaitez. Vous auriez besoin de créer une nouvelle constante globale, quelque chose comme ``MAX_GRENADES`` et ensuite limiter la valeur de ``clamp(grenade_amounts[current_grenade], 0, 4)`` à ``clamp(grenade_amounts[current_grenade], 0, MAX_GRENADES)``
ja: 必要に応じて、\ ``4`` を定数に変更できます。\ ``MAX_GRENADES`` のような新しいグローバル定数を作成してから、クランプを ``clamp(grenade_amounts[current_grenade], 0, 4)`` から ``clamp(grenade_amounts[current_grenade], 0, MAX_GRENADES)`` に修正します
zh_cn: 如果需要，可以将“4”改为常量。 您需要创建一个新的全局常量，比如 ``MAX_GRENADES`` ，然后将钳位从``clamp(grenade_amounts [current_grenade]，0,4)``更改为``clamp(grenade_amounts [current_grenade]， 0，MAX_GRENADES)``

source: If you do not want to limit how many grenades the player can carry, remove the line that clamps the grenades altogether!
es: Si no quieres limitar la cantidad de granadas que el jugador puede llevar, ¡quita la línea que sujeta las granadas por completo!
fr: Si vous ne voulez pas limiter combien de grenades le joueur peut porter, enlevez simplement la ligne qui limite les grenades !
ja: プレイヤーが手に入れることができる手榴弾の数を制限したくない場合は、手榴弾をクランプしている行を完全に削除してください！
zh_cn: 如果您不想限制游戏角色可以携带多少手榴弹，那就去掉完全夹住手榴弹的线！

source: Now we have a function to add grenades, let's open up ``AmmoPickup.gd`` and use it!
de: Jetzt haben wir eine Funktion zum Hinzufügen von Granaten, öffnen wir ``AmmoPickup.gd`` und benutzen sie!
es: Ahora tenemos una función para añadir granadas, ¡abramos ``AmmoPickup.gd`` y usémosla!
fr: Maintenant que nous avons une fonction pour ajouter des grenades, ouvrez ``AmmoPickup.gd`` et utilisez la !
ja: これで手榴弾を追加する関数ができましたので、\ ``AmmoPickup.gd`` を開いて使用しましょう！
zh_cn: 现在我们有一个添加手榴弹的功能，让我们打开 ``AmmoPickup.gd`` 并使用它！

source: Open up ``AmmoPickup.gd`` and go to the ``trigger_body_entered`` function. Change it to the following:
de: Öffnen Sie ``AmmoPickup.gd`` und gehen Sie zur Funktion ``trigger_body_entered``. Ändern Sie es wie folgt:
es: Abre ``AmmoPickup.gd`` y ve a la función ``trigger_body_entered``. Cámbialo a lo siguiente:
fr: Ouvrez ``AmmoPickup.gd`` et allez dans la fonction ``trigger_body_entered``. Changer son contenu en ceci :
ja: ``AmmoPickup.gd`` を開き、\ ``trigger_body_entered`` 関数に移動します。次のように変更します:
zh_cn: 打开 ``AmmoPickup.gd`` 并转到 ``trigger_body_entered`` 函数。 将其更改为以下内容:

source: Now we are also checking to see if the body has the ``add_grenade`` function. If it does, we call it like we call ``add_ammo``.
es: Ahora también estamos comprobando si el cuerpo tiene la función ``add_grenade``. Si la tiene, la llamamos como si llamáramos a ``add_ammo``.
fr: Maintenant, nous vérifions également si le corps dispose de la fonction ``add_grenade``. Si c'est le cas, nous l’appelons comme nous appelons ``add_ammo``.
ja: また、bodyに ``add_grenade`` 関数があるかどうかも確認しています。存在する場合、\ ``add_ammo`` を呼び出す場合と同じように呼び出します。
zh_cn: 现在我们还要检查主体是否有 ``add_grenade`` 函数。 如果是这样，我们称之为“add_ammo”。

source: You may have noticed we are using a new constant we have not defined yet, ``GRENADE_AMOUNTS``. Let's add it! Add the following class variable to ``AmmoPickup.gd`` with the other class variables:
es: Habrás notado que estamos usando una nueva constante que aún no hemos definido, ``GRENADE_AMOUNTS``. Agreguémosla. Añade la siguiente variable de clase a ``AmmoPickup.gd`` con las otras variables de clase:
fr: Vous avez peut être remarqué que nous utilisons une nouvelle constante que nous n'avons pas encore définie, ``GRENADE_AMOUNTS``. Implémentons la ! Ajoutez les variables de classes suivantes dans ``AmmoPickup.gd`` avec les autres :
ja: まだ定義していない新しい定数 ``GRENADE_AMOUNTS`` を使用していることに気づいたかもしれません。追加しましょう！次のクラス変数を他のクラス変数とともに ``AmmoPickup.gd`` に追加します:
zh_cn: 您可能已经注意到我们正在使用一个尚未定义的新常量， ``GRENADE_AMOUNTS`` 。 我们加上吧！ 使用其他类变量将以下类变量添加到``AmmoPickup.gd``:
