Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_two.po
Languages: es, fr, ja, zh_cn

source: Finally, we check to see whether the player has successfully equipped the new weapon. If (s)he has done so, we set ``changing_weapon`` to ``false`` because the player is no longer changing weapons. We also set ``current_weapon_name`` to ``changing_weapon_name`` since the current weapon has changed, and then we set ``changing_weapon_name`` to an empty string.
es: Finalmente, comprobamos si el jugador ha equipado con éxito la nueva arma. Si lo ha hecho, ponemos ``changing_weapon`` a ``false`` porque el jugador ya no está cambiando de arma. También ponemos ``current_weapon_name`` en ``changing_weapon_name`` ya que el arma actual ha cambiado, y luego ponemos ``changing_weapon_name`` en una string vacía.
fr: Enfin, nous vérifions si le joueur a bien équipé la nouvelle arme. S'il l'a fait, nous réglons ``changing_weapon`` sur ``false`` parce que le joueur ne change plus d'arme. Nous réglons aussi ``current_weapon_name`` sur ``changing_weapon_name`` puisque l'arme courante a changé, puis nous réglons ``changing_weapon_name`` sur un string vide.
ja: 最後に、プレイヤーが新しい武器を正常に装備したかどうかを確認します。プレイヤーがそうしている場合、プレイヤーはもはや武器の変更中ではないので、\ ``changeing_weapon`` を ``false`` に設定します。また、現在の武器が変更されたため、\ ``current_weapon_name`` を ``changing_weapon_name`` に設定してから、\ ``changing_weapon_name`` を空の文字列に設定します。

source: Now, we need to add one more function to the player, and then the player is ready to start firing the weapons!
es: Ahora, necesitamos añadir una función más al jugador, ¡y entonces estará listo para empezar a disparar sus armas!
fr: Maintenant, nous avons besoin d'ajouter une nouvelle fonction au joueur, et après le joueur pourra commencer a tirer !
ja: ここで、プレイヤーにもう1つの関数を追加する必要があります。これで、プレイヤーは武器を発砲する準備が整いました！
zh_cn: 现在，我们需要为游戏角色增加一个功能，然后游戏角色就可以开始射击武器！

source: We need to add ``fire_bullet``, which will be called by the :ref:`AnimationPlayer <class_AnimationPlayer>` at those points we set earlier in the :ref:`AnimationPlayer <class_AnimationPlayer>` function track:
es: Necesitamos añadir ``fire_bullet``, que será llamado por la pista de la función :ref:`AnimationPlayer <class_AnimationPlayer>` en los puntos que establecimos antes en la pista de la función :ref:`AnimationPlayer <class_AnimationPlayer>`:
fr: On a besoin d'ajouter ``fire_bullet``, qui peut être appelée par :ref:`AnimationPlayer <class_AnimationPlayer>` aux points que nous avons fixé précédemment dans l':ref:`AnimationPlayer <class_AnimationPlayer>` :
ja: :ref:`AnimationPlayer <class_AnimationPlayer>` の関数トラックで以前に設定したポイントで :ref:`AnimationPlayer <class_AnimationPlayer>` によって呼び出される ``fire_bullet`` を追加する必要があります:
zh_cn: 我们需要添加 ``fire_bullet`` ，它将由 :ref:`AnimationPlayer <class_AnimationPlayer>` 调用，我们在前面设置的那些点 :ref:`AnimationPlayer <class_AnimationPlayer>` 函数轨道:

source: Let's go over what this function does:
es: Veamos lo que hace esta función:
fr: Voyons ce que fait cette fonction :
ja: この関数が何をするのか見てみましょう:

source: First we check to see whether the player is changing weapons. If the player is changing weapons, we do not want shoot, so we ``return``.
es: Primero comprobamos si el jugador está cambiando de armas. Si el jugador está cambiando de arma, no queremos disparar, así que ``return``.
fr: Premièrement on vérifie que le joueur est en train de changer d'arme. Et si le joueur change d'arme, on ne veut pas tirer, donc on ``return``.
ja: まず、プレイヤーが武器を変更しているかどうかを確認します。プレイヤーが武器を変更している場合、私たちは撃つことを望まないので ``return`` します。

source: Calling ``return`` stops the rest of the function from being called. In this case, we are not returning a variable because we are only interested in not running the rest of the code, and because we are not looking for a returned variable either when we call this function.
es: Llamar ``return`` impide que se llame al resto de la función. En este caso, no estamos devolviendo una variable porque sólo nos interesa no ejecutar el resto del código, y porque tampoco buscamos una variable devuelta cuando llamamos a esta función.
fr: L'appel de ``return`` empêche le reste de la fonction d'être appelé. Dans ce cas, nous ne retournons pas de variable parce que nous sommes seulement intéressés à ne pas exécuter le reste du code, et parce que nous n'attendons pas non plus de variable retournée lorsque nous appelons cette fonction.
ja: ``return`` を呼び出すと、関数の残りの部分が呼び出されなくなります。この場合、残りのコードを実行しないことにのみ関心があり、この関数を呼び出すときに返される変数を探していないため、変数を返しません。
zh_cn: 调用 ``return`` 会停止调用函数的其余部分。 在这种情况下，我们不返回变量，因为我们只对不运行其余代码感兴趣，并且因为我们在调用此函数时不会查找返回的变量。

source: Then we tell the current weapon the player is using to fire by calling its ``fire_weapon`` function.
es: Luego le decimos al arma actual que el jugador está usando para disparar su función de ``fire_weapon``.
fr: Ensuite nous disons que le joueur est en train de tirer avec l'arme actuelle en appelant sa fonction ``fire_weapon``.
ja: 次に、プレイヤーが ``fire_weapon`` 関数を呼び出して、現在使用している武器を発射するように指示します。
zh_cn: 然后我们通过调用它的 ``fire_weapon`` 函数来告诉游戏角色正在使用的当前武器。

source: Remember how we mentioned the speed of the animations for firing was faster than the other animations? By changing the firing animation speeds, you can change how fast the weapon fires bullets!
es: ¿Recuerdas que mencionamos que la velocidad de las animaciones para disparos era más rápida que las otras animaciones? ¡Cambiando las velocidades de la animación de disparo, puedes cambiar la velocidad del arma para disparar balas!
fr: Rappelez-vous que nous avons mentionné que la vitesse des animations pour le tir était plus rapide que les autres animations ? En changeant les vitesses d'animation de tir, vous pouvez changer la vitesse à laquelle l'arme tire des balles !
ja: 発砲のアニメーションの速度が他のアニメーションよりも速いと言ったことを覚えていますか？発射アニメーションの速度を変更することにより、武器が弾丸を発射する速度を変更できます！
zh_cn: 还记得我们如何提到射击动画的速度比其他动画更快吗？ 通过改变射击动画速度，您可以改变武器射击子弹的速度！

source: Before we are ready to test our new weapons, we still have a bit of work to do.
es: Antes de que estemos listos para probar nuestras nuevas armas, todavía tenemos un poco de trabajo que hacer.
fr: Avant de pouvoir tester nos nouvelles armes, nous avons encore un peu de travail à faire.

source: Creating some test subjects
es: Creando algunos sujetos de prueba
fr: Création de quelques sujets de tests
ja: いくつかのテスト対象の作成
zh_cn: 创建一些测试科目

source: Create a new script by going to the scripting window, clicking "file", and selecting new. Name this script ``RigidBody_hit_test`` and make sure it extends :ref:`RigidBody <class_RigidBody>`.
es: Crea un nuevo script yendo a la ventana del guión, haciendo clic en "archivo" y seleccionando nuevo. Nombra este script ``RigidBody_hit_test`` y asegúrate de que extienda :ref:`RigidBody <class_RigidBody>`.
fr: Crée un nouveau script en allant dans la fenêtre de script, puis clique sur "fichier", et sélectionne nouveau. Nomme ce script ``RigidBody_hit_test`` et soit sur qu'il hérite de :ref:`RigidBody <class_RigidBody>`.
ja: スクリプトウィンドウに移動し、[ファイル]をクリックし、[新規スクリプト]を選択して、新しいスクリプトを作成します。このスクリプトに ``RigidBody_hit_test.gd`` という名前を付けて、\ :ref:`RigidBody <class_RigidBody>` が拡張されていることを確認します。
zh_cn: 通过转到脚本窗口，单击“文件”，然后选择新脚本来创建新脚本。 将此脚本命名为 ``RigidBody_hit_test`` 并确保它扩展 :ref:`RigidBody <class_RigidBody>`。

source: Now we need to add this code:
es: Ahora tenemos que añadir este código:
fr: Maintenant nous avons besoin d'ajouter ce code :
ja: 次のコードを追加する必要があります:
zh_cn: 现在我们需要添加以下代码:

source: Let's go over how ``bullet_hit`` works:
es: Repasemos cómo funciona el ``bullet_hit``:
fr: Voyons comment ``bullet_hit`` fonctionne :
ja: ``bullet_hit`` の仕組みを見ていきましょう:

source: First we get the bullet's forward directional vector. This is so we can tell from which direction the bullet will hit the :ref:`RigidBody <class_RigidBody>`. We will use this to push the :ref:`RigidBody <class_RigidBody>` in the same direction as the bullet.
es: Primero tenemos el vector direccional de la bala. Esto es para que podamos decir desde cuál dirección la bala golpeará el :ref:`RigidBody <class_RigidBody>`. Usaremos esto para empujar el :ref:`RigidBody <class_RigidBody>` en la misma dirección que la bala.
fr: D'abord, on obtient le vecteur directionnel vers l'avant de la balle. C'est ainsi que nous pouvons dire dans quelle direction la balle va frapper le :ref:`RigidBody <class_RigidBody>`. Nous l'utiliserons pour pousser le :ref:`RigidBody <class_RigidBody>` dans la même direction que la balle.
ja: まず、弾丸の順方向ベクトルを取得します。これは、どの方向から弾丸が :ref:`RigidBody <class_RigidBody>` に当たるかを判断できるようにするためです。これを使用して、\ :ref:`RigidBody <class_RigidBody>` を弾丸と同じ方向に押し出します。
zh_cn: 首先，我们得到子弹的前向方向向量。 这样我们可以知道子弹将从哪个方向击中 :ref:`RigidBody <class_RigidBody>`。 我们将使用它来推送 :ref:`RigidBody <class_RigidBody>` 与子弹的方向相同。

source: We need to boost the directional vector by ``BASE_BULLET_BOOST`` so the bullets pack a bit more of a punch and move the :ref:`RigidBody <class_RigidBody>` nodes in a visible way. You can just set ``BASE_BULLET_BOOST`` to lower or higher values if you want less or more of a reaction when the bullets collide with the :ref:`RigidBody <class_RigidBody>`.
es: Necesitamos aumentar el vector direccional por ``BASE_BULLET_BOOST`` para que las balas den un poco más de golpe y mueven los nodos :ref:`RigidBody <class_RigidBody>` de forma visible. Puedes poner ``BASE_BULLET_BOOST`` a valores más bajos o más altos si quieres que haya más o menos reacción cuando las balas choquen con el :ref:`RigidBody <class_RigidBody>`.
fr: Nous devons booster le vecteur directionnel par ``BASE_BULLET_BOOST`` pour que les balles aient un peu plus de punch et déplacent les nœuds :ref:`RigidBody <class_RigidBody>` d'une manière visible. Vous pouvez simplement régler ``BASE_BULLET_BOOST`` sur des valeurs inférieures ou supérieures si vous voulez une réaction plus ou moins importante lorsque les balles entrent en collision avec le :ref:`RigidBody <class_RigidBody>`.
ja: 方向ベクトルを ``BASE_BULLET_BOOST`` でブーストして、弾丸がもう少しパンチを込め、\ :ref:`RigidBody <class_RigidBody>` ノードを目に見える方法で移動させる必要があります。弾丸が :ref:`RigidBody <class_RigidBody>` と衝突したときの反応をより少なくしたりより多くしたい場合は、単に ``BASE_BULLET_BOOST`` を低い値または高い値に設定することができます。
zh_cn: 我们需要通过 ``BASE_BULLET_BOOST`` 来增加方向向量，这样子弹可以打包更多，并以可见的方式移动 :ref:`RigidBody <class_RigidBody>` 节点。 如果在子弹与 :ref:`RigidBody <class_RigidBody>` 发生冲突时想要更少或更多的反应，您可以将 ``BASE_BULLET_BOOST`` 设置为更低或更高的值。

source: Then we apply an impulse using ``apply_impulse``.
es: Luego aplicamos un impulso usando ``apply_impulse``.
fr: Puis on applique une impulsion en utilisant ``apply_impulse``.
ja: 次に、\ ``apply_impulse`` を使用して衝撃を加えます。
zh_cn: 然后我们使用 ``apply_impulse`` 来施加冲动。

source: First, we need to calculate the position for the impulse. Because ``apply_impulse`` takes a vector relative to the :ref:`RigidBody <class_RigidBody>`, we need to calculate the distance from the :ref:`RigidBody <class_RigidBody>` to the bullet. We do this by subtracting the :ref:`RigidBody <class_RigidBody>`'s global origin/position from the bullet's global origin/position. This gets us the distance from the :ref:`RigidBody <class_RigidBody>` to the bullet. We normalize this vector so the size of the collider does not effect how much the bullets move the :ref:`RigidBody <class_RigidBody>`.
es: Primero, tenemos que calcular la posición del impulso. Debido a que ``apply_impulse`` toma un vector relativo a la :ref:`RigidBody <class_RigidBody>`, necesitamos calcular la distancia desde la :ref:`RigidBody <class_RigidBody>` a la bala. Lo hacemos restando el origen/posición global de :ref:`RigidBody <class_RigidBody>` del origen/posición global de la bala. Esto nos da la distancia de la :ref:`RigidBody <class_RigidBody>` a la bala. Normalizamos este vector para que el tamaño del colisionador no afecte a cuánto se mueven las balas el :ref:`RigidBody <class_RigidBody>`.
fr: Premièrement, nous avons besoin de calculer la position de l'impulsion. Car ``apply_impulse`` prends en entrée un vecteur relatif au :ref:`RigidBody <class_RigidBody>` , nous avons besoin de calculer la distance du :ref:`RigidBody <class_RigidBody>` à la balle. Nous calculons cela en soustrayant la position globale du :ref:`RigidBody <class_RigidBody>`à la position globale de la balle. Cela nous donne le vecteur de la balle au :ref:`RigidBody <class_RigidBody>`. Nous normalisons ce vecteur pour que la taille du collisionneur n'affecte pas l'influence de la balle sur le :ref:`RigidBody <class_RigidBody>`.
ja: 最初に、衝撃の位置を計算する必要があります。 ``apply_impulse`` は :ref:`RigidBody <class_RigidBody>` を基準にしたベクトルを取るため、\ :ref:`RigidBody <class_RigidBody>` から弾丸までの距離を計算する必要があります。これを行うには、弾丸グローバル原点/位置から :ref:`RigidBody <class_RigidBody>` のグローバル原点/位置を減算します。これにより、\ :ref:`RigidBody <class_RigidBody>` から弾丸までの距離がわかります。このベクトルを正規化して、コライダーのサイズが、弾丸が :ref:`RigidBody <class_RigidBody>` をどれだけ動かすかに影響しないようにします。
zh_cn: 首先，我们需要计算冲动的位置。 因为 ``apply_impulse`` 采用相对于 :ref:`RigidBody <class_RigidBody>的向量，我们需要计算从 :ref:`RigidBody <class_RigidBody>` 到子弹的距离。 我们通过从子弹的全局原点/位置减去 :ref:`RigidBody <class_RigidBody>的全局原点/位置来做到这一点。 这使我们与 :ref:`RigidBody <class_RigidBody>` 到子弹的距离。 我们规范化这个向量，这样对撞机的大小不会影响子弹移动的程度 :ref:`RigidBody <class_RigidBody>`。

source: Finally, we need to calculate the force for the impulse. For this, we use the direction the bullet is facing and multiply it by the bullet's damage. This gives a nice result and for stronger bullets, we get a stronger result.
es: Finalmente, necesitamos calcular la fuerza del impulso. Para ello, utilizamos la dirección a la que está orientada la bala y la multiplicamos por el daño de la bala. Esto da un buen resultado y para balas más fuertes, obtenemos un resultado más fuerte.
fr: Finalement, nous avons besoin de calculer la force de l'impulsion. Pour cela, on utilise la direction vers laquelle est orienté la balle et nous la multiplions par les dégâts de la balle. Cela donne un bon résultat et pour des balles plus puissantes on obtient un résultat plus important.
ja: 最後に、衝撃の力を計算する必要があります。このために、弾丸が向いている方向を使用し、弾丸のダメージを掛けます。これにより良い結果が得られ、より強力な弾丸の場合、より強力な結果が得られます。

source: Now we need to attach this script to all of the :ref:`RigidBody <class_RigidBody>` nodes we want to affect.
es: Ahora necesitamos anexar este script a todos los :ref:`RigidBody <class_RigidBody>` que queremos afectar.
fr: Maintenant, nous devons attacher ce script à tous les nœuds :ref:`RigidBody <class_RigidBody>` que l'on veut affecter.
ja: 次に、このスクリプトを、影響するすべての :ref:`RigidBody <class_RigidBody>` ノードにアタッチする必要があります。

source: Open up ``Testing_Area.tscn`` and select all the cubes parented to the ``Cubes`` node.
es: Abre ``Testing_Area.tscn`` y selecciona todos los cubos que están en el nodo ``Cubes``.
fr: Ouvrez ``Testing_Area.tscn`` et sélectionnez tous les cubes parentés au nœud ``Cubes`` node.
ja: ``Testing_Area.tscn`` を開き、\ ``Cubes`` ノードを親とするすべてのキューブを選択します。

source: If you select the top cube, and then hold down :kbd:`Shift` and select the last cube, Godot will select all the cubes in-between!
es: Si seleccionas el cubo superior, y luego mantienes pulsado :kbd:`Shift` y seleccionas el último cubo, Godot seleccionará todos los cubos intermedios!
fr: Si vous sélectionnez le cube supérieur, puis maintenez la touche :kbd:`Shift` et sélectionnez le dernier cube, Godot sélectionnera tous les cubes entre les deux !
ja: 一番上のキューブを選択し、\ :kbd:`Shift` を押しながら最後のキューブを選択すると、Godotはその間のすべてのキューブを選択します！

source: Once you have all the cubes selected, scroll down in the inspector until you get to the "scripts" section. Click the drop down and select "Load". Open your newly created ``RigidBody_hit_test.gd`` script.
es: Una vez que tengas todos los cubos seleccionados, baja en el inspector hasta que llegues a la sección de "scripts". Haga clic en el menú desplegable y seleccione "Cargar". Abre tu recién creado script ``RigidBody_hit_test.gd``.
fr: Une fois que vous avez sélectionné tous les cubes, faites défiler vers le bas dans l’inspecteur jusqu’à ce que vous obtenez à la section "scripts". Cliquez sur la liste déroulante et sélectionnez "charger". Ouvrez le script ``RigidBody_hit_test.gd`` nouvellement créé.
ja: すべてのキューブを選択したら、"Script"セクションに到達するまでインスペクタを下にスクロールします。ドロップダウンをクリックして、「読み込み」を選択します。新しく作成した ``RigidBody_hit_test.gd`` スクリプトを開きます。

source: Final notes
es: Notas finales
fr: Notes finales
ja: 最終ノート
zh_cn: 最后的笔记

source: That was a lot of code! But now, with all that done, you can go and give your weapons a test!
es: ¡Eso fue un montón de código! Pero ahora, con todo eso hecho, ¡puedes ir y probar sus armas!
fr: C’était beaucoup de code ! Mais maintenant, avec tout ce qui est fait, vous pouvez tester vos armes !
ja: これは大量のコードでした！しかし、今、すべての作業が完了すると、あなたはあなたの武器をテストすることができます！

source: You should now be able to fire as many bullets as you want at the cubes and they will move in response to the bullets colliding with them.
es: Ahora deberías poder disparar tantas balas como quieras a los cubos y se moverán en respuesta a las balas que choquen con ellos.
fr: Vous devriez maintenant être capable de tirer autant de balles que vous le voulez sur les cubes, et ces derniers bougeront en fonction des balles qui entrent en collision avec ces derniers.
ja: これで、キューブで必要な数の弾丸を発射でき、それらが衝突する弾丸に応じて移動します。

source: In :ref:`doc_fps_tutorial_part_three`, we will add ammo to the weapons, as well as some sounds!
es: En :ref:`doc_fps_tutorial_part_three`, añadiremos munición a las armas, así como algunos sonidos!
fr: ICI :ref:`doc_fps_tutorial_part_three`, nous ajouterons des munitions aux armes, mais aussi des bruitages !
ja: :ref:`doc_fps_tutorial_part_three` では、武器に弾薬といくつかのサウンドを追加します！
zh_cn: 在 :ref:`doc_fps_tutorial_part_three`中，我们将为武器添加弹药以及一些声音！

source: If you ever get lost, be sure to read over the code again!
es: ¡Si alguna vez te pierdes, asegúrate de leer el código de nuevo!
fr: Si jamais vous vous perdez, n'oubliez pas de relire le code !
ja: 迷子になったら、必ずコードをもう一度読んでください！
zh_cn: 如果您迷路了，请务必再次阅读代码！

source: You can download the finished project for this part here: :download:`Godot_FPS_Part_2.zip <files/Godot_FPS_Part_2.zip>`
es: Puede descargar el proyecto terminado para esta parte aquí: :download:`Godot_FPS_Part_2.zip <files/Godot_FPS_Part_2.zip>`
fr: Vous pouvez télécharger le projet fini pour cette partie ICI : :download:`Godot_FPS_Part_2.zip <files/Godot_FPS_Part_2.zip>`
ja: この部分の完成したプロジェクトは、ここからダウンロードできます: :download:`Godot_FPS_Part_2.zip <files/Godot_FPS_Part_2.zip>`
zh_cn: 您可以在这里下载这个部分的完成项目: :download:`Godot_FPS_Part_2.zip <files / Godot_FPS_Part_2.zip>`

source: If we try to transition to a state that is not included in the possible transitions states for the state we are in, then we get a warning message and the animation does not change. We can also automatically transition from some states into others, as will be explained further below in ``animation_ended``.
es: Si intentamos hacer la transición a un estado que no está incluido en los posibles estados de transición para el estado en que estamos, entonces recibimos un mensaje de advertencia y la animación no cambia. También podemos pasar automáticamente de unos estados a otros, como se explicará más adelante en ``animation_ended``.

source: Thirdly, we check whether ``current_state`` is set. If ``current_state`` is *not* currently set, then we set ``current_state`` to the passed in animation name and tell :ref:`AnimationPlayer <class_AnimationPlayer>` to start playing the animation with a blend time of ``-1`` at the speed set in ``animation_speeds`` and then we return ``true``.
ja: 第三に、\ ``current_state`` が設定されているかどうかを確認します。\ ``current_state`` が現在設定\*されていない*\場合、渡されたアニメーション名を ``current_state`` に設定し、\ :ref:`AnimationPlayer <class_AnimationPlayer>` にその名前と、blend time ``-1 ``\ 、speed ``animation_speeds`` を設定して ``true`` を返します。

source: If we have a state in ``current_state``, then we get all the possible states we can transition to.
ja: ``current_state`` にstate(状態)がある場合、遷移可能なすべてのstateを取得します。

source: Next we set the global transform of the clone to the ``Pistol_Aim_Point``'s global transform. The reason we do this is so the bullet is spawned at the end of the pistol.
zh_cn: 接下来，我们将克隆的全局变换设置为“Pistol_Aim_Point”的全局变换。 我们这样做的原因是手枪末端会产生子弹。

source: Before we are ready to test our new weapons, we still have a little bit of work to do.
zh_cn: 在我们准备测试新武器之前，我们还有一些工作要做。
