Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_two.po
Languages: es, fr, ja, zh_cn

source: Creating the bullet scene
es: Creando la escena de la bala
fr: Créer la scène balle
ja: 弾丸シーンの作成
zh_cn: 创建子弹场景

source: There are several ways to handle a gun's bullets in video games. In this tutorial series, we will be exploring two of the more common ways: Objects, and raycasts.
es: Hay varias maneras de manejar las balas de un arma en los videojuegos. En esta serie de tutoriales, exploraremos dos de las formas más comunes: Objetos, y raycasts.
fr: Il existe plusieurs façons de manipuler les balles d'une arme à feu dans les jeux vidéo. Dans cette série de tutoriels, nous explorerons deux des méthodes les plus courantes : Objets, et raycasts.
ja: ビデオゲームで銃の弾丸を処理する方法はいくつかあります。このチュートリアルシリーズでは、2つの一般的な方法を検討します: オブジェクトとレイキャストです。
zh_cn: 有几种方法可以处理电子游戏中枪支的子弹。 在本系列教程中，我们将探讨两种更常见的方法:对象和光线投射。

source: One of the two ways is using a bullet object. This will be an object that travels through the world and handles its own collision code. In this method we create/spawn a bullet object in the direction our gun is facing, and then it travels forward.
es: Una de las dos formas es usando un objeto bala. Este será un objeto que viaja a través del mundo y maneja su propio código de colisión. En este método, creamos un objeto bala en la dirección en la que se dirige nuestro arma, y luego se desplaza hacia adelante.
fr: L'une des deux façons est d'utiliser un objet balle. Ce sera un objet qui voyage à travers le monde et manipule son propre code de collision. Dans cette méthode, nous créons un objet balle dans la direction de notre fusil, puis il se déplacera vers l'avant.
ja: 2つの方法の1つは、弾丸オブジェクトを使用することです。これは、世界を移動し、独自の衝突コードを処理するオブジェクトになります。このメソッドでは、銃が向いている方向に弾丸オブジェクトを作成/産出し、次に前進します。
zh_cn: 两种方法之一是使用子弹对象。 这将是一个穿越世界并处理自己的碰撞代码的对象。 在这种方法中，我们在枪的方向上创建/生成一个子弹对象，然后向前行进。

source: There are several advantages to this method. The first being we do not have to store the bullets in our player. We can simply create the bullet and then move on, and the bullet itself will handle checking for collisions, sending the proper signal(s) to the object it collides with, and destroying itself.
es: Este método tiene varias ventajas. La primera es que no tenemos que almacenar las balas en nuestro jugador. Podemos simplemente crear la bala y luego seguir adelante, y la bala misma se encargará de comprobar si hay colisiones, enviando la(s) señal(es) adecuada(s) al objeto con el que choca, y destruyéndose a sí misma.
fr: Cette méthode présente plusieurs avantages. Le premier étant que nous n'avons pas besoin de stocker les balles dans notre joueur. Nous pouvons simplement créer la balle, puis passer à autre chose, et la balle elle-même vérifiera les collisions, envoyant le ou les signaux appropriés à l'objet avec lequel elle entre en collision, et se détruisant d'elle-même.
ja: この方法にはいくつかの利点があります。 1つ目は、弾丸をプレイヤーに保存する必要がないことです。弾丸を作成して先に進みむと、弾丸自体が衝突のチェック、衝突するオブジェクトへの適切なシグナルの送信、およびそれ自体の破壊を処理します。

source: Another advantage is we can have more complex bullet movement. If we want to make the bullet fall ever so slightly as time goes on, we can make the bullet controlling script slowly push the bullet towards the ground. Using an object also makes the bullet take time to reach its target, it doesn't instantly hit whatever it's pointed at. This feels more realistic because nothing in real life moves instantly from one point to another.
es: Otra ventaja es que podemos tener un movimiento más complejo de la bala. Si queremos que la bala caiga ligeramente a medida que pasa el tiempo, podemos hacer que el script de control de la bala empuje lentamente la bala hacia el suelo. El uso de un objeto también hace que la bala tarde en alcanzar su objetivo, no golpea instantáneamente a lo que sea que esté apuntando. Esto se siente más realista porque nada en la vida real se mueve instantáneamente de un punto a otro.
fr: Un autre avantage est que nous pouvons avoir des mouvements de balles plus complexes. Si nous voulons faire tomber la balle légèrement au fur et à mesure que le temps passe, nous pouvons faire que le script de contrôle de balle pousse lentement la balle vers le sol. L'utilisation d'un objet implique aussi que la balle prend du temps pour atteindre sa cible, elle ne touche pas instantanément ce vers quoi elle est pointée. Cela semble plus réaliste parce que rien dans la vie réelle ne bouge instantanément d'un point à l'autre.
ja: 別の利点は、より複雑な弾丸の動きができることです。時間が経つにつれて弾丸を少しでも落としたい場合は、弾丸制御スクリプトを使用して、弾丸をゆっくりと地面に向かって押します。また、オブジェクトを使用すると、弾丸がターゲットに到達するまでに時間がかかり、指したものがすぐにヒットすることはありません。実際の生活の中で、ある地点から別の地点に瞬時に移動するものはないため、これはより現実的です。

source: One of the huge disadvantages is performance. While having each bullet calculate their own paths and handle their own collision allows for a lot of flexibility, it comes at the cost of performance. With this method we are calculating every bullet's movement every step, and while this may not be a problem for a few dozen bullets, it can become a huge problem when you potentially have several hundred bullets.
es: Una de las grandes desventajas es el rendimiento. Si bien el hecho de que cada bala calcule su propia trayectoria y maneje su propia colisión permite una gran flexibilidad, esto se produce a costa del rendimiento. Con este método estamos calculando el movimiento de cada bala en cada paso, y aunque esto puede no ser un problema para unas pocas docenas de balas, puede convertirse en un gran problema cuando potencialmente tienes varios cientos de balas.
fr: L'un des inconvénients majeurs est la performance. Bien que le fait que chaque balle calcule sa propre trajectoire et gère sa propre collision offre beaucoup de souplesse, cela se fait au détriment de la performance. Avec cette méthode, nous calculons le mouvement de chaque balle à chaque étape, et bien que ce ne soit pas un problème pour quelques dizaines de balles, cela peut devenir un énorme problème lorsque vous avez potentiellement plusieurs centaines de balles.
ja: 大きな欠点の1つはパフォーマンスです。各弾丸に独自のパスを計算させ、独自の衝突を処理させると、柔軟性が大幅に向上しますが、パフォーマンスが犠牲になります。この方法では、すべてのステップのすべての弾丸の動きを計算しています。これは数十の弾丸では問題にならないかもしれませんが、数百の弾丸がある場合には大きな問題になります。
zh_cn: 性能的一个巨大缺点。 虽然让每个子弹计算他们自己的路径并处理他们自己的碰撞可以提供很大的灵活性，但这需要以性能为代价。 通过这种方法，我们每一步计算每个子弹的运动，虽然这可能不是几十个子弹的问题，但当您可能有几百个子弹时，它可能会成为一个巨大的问题。

source: Despite the performance hit, many first person shooters include some form of object bullets. Rocket launchers are a prime example because in many first person shooters, rockets do not just instantly explode at their target position. You can also find bullets as objects many times with grenades because they generally bounce around the world before exploding.
es: A pesar del impacto en el rendimiento, muchos shooters en primera persona incluyen alguna forma de balas de objeto. Los lanzadores de cohetes son un buen ejemplo porque en muchos de los que disparan en primera persona, los cohetes no explotan instantáneamente en la posición del objetivo. También puedes encontrar balas como objetos muchas veces con granadas porque generalmente rebotan por el mundo antes de explotar.
fr: Malgré le coût en terme de performance, de nombreux jeux de tir à la première personne incluent une certaine forme d'objet balle. Les lance-roquettes en sont un excellent exemple, car dans de nombreux jeux de tir à la première, les roquettes n'explosent pas instantanément à la position prise pour cible. Vous pouvez également souvent trouver des balles comme objets avec les grenades parce qu'elles rebondissent généralement dans le monde avant d'exploser.
ja: パフォーマンスの低下にもかかわらず、多くの一人称シューティングゲームには何らかの形のオブジェクトの弾丸が含まれています。ロケットランチャーは、多くの一人称シューティングゲームでは、ロケットが瞬時にターゲットの位置で爆発するわけではないため、弾丸オブジェクトの典型的な例です。また、良く見かける手榴弾は一般的に爆発する前に世界のあちこちで跳ね返るので、これも弾丸オブジェクトの一例です。
zh_cn: 尽管性能受到了影响，但许多第一人称射击游戏包括某种形式的物体子弹。 火箭发射器是一个很好的示例，因为在许多第一人称射击游戏中，火箭不会立即在目标位置爆炸。 您也可以用手榴弹多次发现子弹作为物体，因为它们通常会在爆炸前在世界各地反弹。

source: While I cannot say for sure this is the case, these games *probably* use bullet objects in some form or another: (These are entirely from my observations. **They may be entirely wrong**. I have never worked on **any** of the following games)
es: Aunque no puedo decir con certeza que este sea el caso, estos juegos *probablemente* utilizan objetos bala de una forma u otra: (Estos son enteramente de mis observaciones. **Pueden estar completamente equivocados**. Nunca he trabajado en **cualquier** de los siguientes juegos)
fr: Bien que je ne puisse pas dire avec certitude que c'est le cas, ces jeux utilisent *probablement* des objets balles sous une forme ou une autre : (Ce sont entièrement de mes observations. **J'ai peut-être tout à fait tort**. Je n'ai travaillé sur **aucun** des jeux suivants)
ja: 確実にそうだとは言えませんが、これらのゲームは\ *何らかの形で*\ 弾丸オブジェクトを使用している可能性があります: (これらは完全に私の観察によるものです。次のゲームの\ **いずれ**\ にも関わったことはありません)
zh_cn: 虽然我不能肯定地说是这种情况，但这些游戏 *可能* 以某种形式使用子弹物体:(这些完全来自我的观察。 **它们可能完全错误** 。我从未参与** 任何**以下游戏)

source: Halo (Rocket launchers, fragmentation grenades, sniper rifles, brute shot, and more)
es: Halo (Lanzacohetes, granadas de fragmentación, rifles de francotirador, tiro bruto y más)
fr: Halo (lance-roquettes, grenades à fragmentation, fusils de sniper, balles brutes, et plus)
ja: Halo (ロケットランチャー、フラグメンテーション手榴弾、狙撃ライフル、ブルートショットなど)

source: Destiny (Rocket launchers, grenades, fusion rifles, sniper rifles, super moves, and more)
es: Destino (Lanzacohetes, granadas, rifles de fusión, rifles de francotirador, súper movimientos y más)
fr: Destiny (lance-roquettes, grenades, fusils à fusion, fusils sniper, super mouvements, et plus)
ja: Destiny (ロケットランチャー、手榴弾、フュージョンライフル、スナイパーライフル、スーパームーブなど)
zh_cn: 命运(火箭发射器，手榴弹，聚变步枪，狙击步枪，超级动作等)

source: Call of Duty (Rocket launchers, grenades, ballistic knives, crossbows, and more)
es: Call of Duty (Lanzacohetes, granadas, cuchillos balísticos, ballestas y más)
fr: Call of Duty (lance-roquettes, grenades, couteaux balistiques, arbalètes et autres)
ja: Call of Duty (ロケットランチャー、手榴弾、弾道ナイフ、クロスボウなど)
zh_cn: 使命召唤(火箭发射器，手榴弹，弹道刀，弩等)

source: Battlefield (Rocket launchers, grenades, claymores, mortars, and more)
es: Campo de batalla (Lanzacohetes, granadas, minas claymore, morteros y más)
fr: Battlefield (lance-roquettes, grenades, mortiers, et plus)
ja: Battlefield (ロケットランチャー、手榴弾、クレイモア、迫撃砲など)
zh_cn: 战场(火箭发射器，手榴弹，claymores，迫击炮等)

source: Another disadvantage with bullet objects is networking. Bullet objects have to sync the positions (at least) with all the clients that are connected to the server.
es: Otra desventaja de los objetos bala es la interconexión. Los objetos bala tienen que sincronizar las posiciones (al menos) con todos los clientes que están conectados al servidor.
fr: Un autre inconvénient des objets balle est la mise en réseau. Les objets balle doivent synchroniser les positions (au moins) avec tous les clients connectés au serveur.
ja: 弾丸オブジェクトのもう1つの欠点はネットワークです。 弾丸オブジェクトは、(少なくとも)サーバーに接続されているすべてのクライアントと位置を同期する必要があります。
zh_cn: 子弹对象的另一个缺点是网络。 Bullet对象必须(至少)与连接到服务器的所有客户端同步位置。

source: While we are not implementing any form of networking (as that would be in its own entire tutorial series), it is a consideration to keep in mind when creating your first person shooter, especially if you plan on adding some form of networking in the future.
es: Aunque no estamos implementando ningún tipo de red (como sería en toda la serie de tutoriales), es una consideración que hay que tener en cuenta al crear tu shooter en primera persona, especialmente si planeas añadir alguna forma de red en el futuro.
fr: Bien que nous n'implémentons aucune forme de réseau (le réseau aura une série de tutoriels spécifique), c'est une considération à garder à l'esprit lors de la création de votre jeu de tir à la première personne, surtout si vous prévoyez d'ajouter une forme de réseau dans l'avenir.
ja: (チュートリアルシリーズ全体として)何らかのネットワーキング形式を実装していませんが、一人称シューティングゲームを作成する際、将来的に何らかのネットワーキングを追加する予定がある場合は、特に留意する必要があります。
zh_cn: 虽然我们没有实现任何形式的网络(因为它将在其自己的整个教程系列中)，但在创建第一人称射击游戏时要牢记这一点，特别是如果您计划在未来添加某种形式的网络。

source: The other way of handling bullet collisions we will be looking at is raycasting.
es: La otra forma de manejar las colisiones de bala que veremos es el raycasting.
fr: L'autre façon de gérer les collisions de balles que nous allons examiner est le raycasting.
ja: 弾丸の衝突を処理するもう1つの方法は、レイキャスティングです。

source: This method is extremely common in guns that have fast moving bullets that rarely change trajectory over time.
es: Este método es extremadamente común en armas que tienen balas de movimiento rápido que rara vez cambian de trayectoria en el tiempo.
fr: Cette méthode est extrêmement courante dans les armes à feu qui ont des balles qui se déplacent rapidement et qui changent rarement de trajectoire avec le temps.
ja: この手法は、時間の経過とともに軌道を変えることがほとんどない高速移動弾を持つ銃では非常に一般的です。
zh_cn: 这种方法在具有快速移动的子弹的枪支中非常常见，这些子弹很少随时间改变轨道。

source: Instead of creating a bullet object and sending it through space, we instead send a ray starting from the barrel/muzzle of the gun forwards. We set the raycast's origin to the starting position of the bullet, and based on the length we can adjust how far the bullet 'travels' through space.
es: En lugar de crear un objeto bala y enviarlo a través del espacio, en su lugar enviamos un rayo desde el cañón/boca del arma hacia adelante. Fijamos el origen del rayo en la posición inicial de la bala, y basándonos en la longitud podemos ajustar la distancia que la bala "viaja" a través del espacio.
fr: Au lieu de créer un objet de balle et de l'envoyer dans l'espace, nous envoyons plutôt un rayon à partir du canon/museau de l'arme vers l'avant. Nous réglons l'origine du raycast à la position de départ de la balle, et en fonction de la longueur, nous pouvons ajuster la distance à laquelle la balle 'voyage' dans l'espace.
ja: 弾丸オブジェクトを作成して空間に送り出す代わりに、銃の銃身/銃口から前方に向かって光線を送り出します。レイキャストの原点を弾丸の開始位置に設定し、長さに基づいて弾丸が空間を「移動する」距離を調整できます。
zh_cn: 我们不是创建一个子弹对象并通过空间发送它，而是从枪的枪管/枪口向前发送一条射线。 我们将光线投射的原点设置为子弹的起始位置，并根据长度调整子弹在空间中``行进``的距离。

source: While I cannot say for sure this is the case, these games *probably* use raycasts in some form or another: (These are entirely from my observations. **They may be entirely wrong**. I have never worked on **any** of the following games)
es: Aunque no puedo decir con certeza que este sea el caso, estos juegos *probablemente* usan raycasts de una forma u otra: (Estos son enteramente de mis observaciones. **Pueden estar completamente equivocados**. Nunca he trabajado en **cualquier** de los siguientes juegos)
fr: Bien que je ne puisse pas dire avec certitude que c'est le cas, ces jeux utilisent *probablement* des raycasts sous une forme ou une autre : (Ceci est entièrement tirés de mes observations. **J'ai peut-être tout à fait tort**. Je n'ai jamais travaillé sur **aucun** des jeux suivants)
ja: 確実にそうだとは言えませんが、これらのゲームは\ *何らかの形で*\ レイキャストを使用している可能性があります: (これらは完全に私の観察によるものです。次のゲームの\ **いずれ**\ にも関わったことはありません)
zh_cn: 虽然我不能肯定地说是这种情况，但这些游戏*可能会以某种形式使用光线投射:(这些完全来自我的观察。 **它们可能完全错误** 。我从来没有工作**任何 **以下游戏)

source: Halo (Assault rifles, DMRs, battle rifles, covenant carbine, spartan laser, and more)
es: Halo (Rifles de asalto, DMRs, rifles de batalla, carabina de pacto, láser espartano, y más)
fr: Halo (fusils d'assaut, DMR, fusils de combat, carabine d'engagement, laser spartan, et plus)
ja: Halo (アサルトライフル、DMR、バトルライフル、コヴナントカービン、スパルタンレーザーなど)
zh_cn: Halo(突击步枪，DMR，战斗步枪，契约卡宾枪，斯巴达激光等)

source: Destiny (Auto rifles, pulse rifles, scout rifles, hand cannons, machine guns, and more)
es: Destiny (Rifles automáticos, rifles de pulso, rifles de exploración, cañones de mano, ametralladoras y más)
fr: Destiny (Auto fusils, fusils à impulsion, fusils scouts, canons à main, mitrailleuses, et plus)
ja: Destiny (オートライフル、パルスライフル、スカウトライフル、ハンドキャノン、機関銃など)
zh_cn: 命运(自动步枪，脉冲步枪，侦察步枪，手枪，机关枪等)

source: Call of Duty (Assault rifles, light machine guns, sub machine guns, pistols, and more)
es: Call of Duty (Rifles de asalto, ametralladoras ligeras, subametralladoras, pistolas y más)
fr: Call of Duty (fusils d'assaut, mitrailleuses légères, mitrailleuses, pistolets, et plus)
ja: Call of Duty (アサルトライフル、軽機関銃、サブマシンガン、ピストルなど)
zh_cn: 使命召唤(突击步枪，轻型机枪，子机枪，手枪等)

source: Battlefield (Assault rifles, SMGs, carbines, pistols, and more)
es: Campo de batalla (Rifles de asalto, SMGs, carabinas, pistolas y más)
fr: Battlefield (fusils d'assaut, SMG, carabines, pistolets, et plus)
ja: Battlefield (アサルトライフル、SMG、カービン銃、ピストルなど)
zh_cn: 战场(突击步枪，SMG，卡宾枪，手枪等)

source: One huge advantage of this method is that it's light on performance. Sending a couple hundred rays through space is *much* easier for the computer to calculate than sending a couple hundred bullet objects.
es: Una gran ventaja de este método es que es de bajo rendimiento. Enviar un par de cientos de rayos a través del espacio es *mucho* más fácil de calcular para la computadora que enviar un par de cientos de objetos bala.
fr: L'un des grands avantages de cette méthode est qu'elle est légère en termes de performances. Envoyer quelques centaines de rayons dans l'espace est *beaucoup* plus facile à calculer pour l'ordinateur que d'envoyer quelques centaines d'objets balles.
ja: この方法の大きな利点の1つは、パフォーマンスが軽いことです。スペースを介して数百の光線を送信することは、コンピュータが数百の弾丸オブジェクトを送出するよりも計算がはるかに簡単です。

source: Another advantage is we can instantly know if we've hit something or not exactly when we call for it. For networking this is important because we do not need to sync the bullet movements over the Internet, we only need to send whether or not the raycast hit.
es: Otra ventaja es que podemos saber instantáneamente si hemos golpeado algo o no exactamente cuando lo pedimos. Para la red esto es importante porque no necesitamos sincronizar los movimientos de la bala por Internet, sólo necesitamos enviar si el raycast golpeó o no.
fr: Un autre avantage est que nous pouvons savoir instantanément si nous avons touché quelque chose ou pas exactement au moment où nous l'appelons. Pour le réseau, c'est important parce que nous n'avons pas besoin de synchroniser les mouvements des balles sur Internet, nous n'avons qu'à envoyer si oui ou non le raycast touche.
ja: もう1つの利点は、何かを呼び出したときに正確に何かをヒットしたかどうかを即座に知ることができることです。ネットワーキングでは、インターネット上で弾丸の動きを同期する必要はなく、レイキャストがヒットしたかどうかを送信するだけで済むので、これは重要です。
zh_cn: 另一个优点是我们可以立即知道我们是否在确实遇到了什么，或者当我们要求它时。 对于网络而言，这很重要，因为我们不需要通过互联网同步子弹移动，我们只需要发送光线投射。

source: Raycasting does have some disadvantages, though. One major disadvantage is we cannot easily cast a ray in anything but a linear line. This means we can only fire in a straight line for however long our ray length is. You can create the illusion of bullet movement by casting multiple rays at different positions, but not only is this hard to implement in code, it is also heavier on performance.
es: Sin embargo, el Raycasting tiene algunas desventajas. Una gran desventaja es que no podemos lanzar fácilmente un rayo en otra cosa que no sea una línea lineal. Esto significa que sólo podemos disparar en línea recta por la longitud de nuestro rayo. Puedes crear la ilusión del movimiento de la bala lanzando múltiples rayos en diferentes posiciones, pero no sólo es difícil de implementar en el código, sino que también es más pesado en el rendimiento.
fr: Le raycasting a cependant quelques inconvénients. Un inconvénient majeur est que nous ne pouvons pas facilement lancer un rayon dans autre chose qu'une ligne linéaire. Cela signifie que nous ne pouvons tirer qu'en ligne droite, quelle que soit la longueur de notre rayon. Vous pouvez créer l'illusion d'un mouvement de balle en projetant plusieurs rayons à différentes positions, mais non seulement c'est difficile à mettre en œuvre en code, mais c'est aussi plus lourd sur les performances.
ja: ただし、レイキャスティングにはいくつかの欠点があります。大きな欠点の1つは、直線以外に光線を簡単に投じることができないことです。これは、レイの長さが長くても直線でしか発射できないことを意味します。さまざまな位置に複数の光線を投げることにより、弾丸の動きのような錯覚を作り出すことができますが、これをコードに実装するのが難しいだけでなく、パフォーマンスも重くなります。

source: Another disadvantage is we cannot see the bullet. With bullet objects we can actually see the bullet travel through space if we attach a mesh to it, but because raycasts happen instantly, we do not have a decent way of showing the bullets. You could draw a line from the origin of the raycast to the point where the raycast collided, and that is one popular way of showing raycasts. Another way is simply not drawing the raycast at all, because theoretically the bullets move so fast our eyes could not see it anyway.
es: Otra desventaja es que no podemos ver la bala. Con los objetos de la bala podemos ver realmente que la bala viaja a través del espacio si le ponemos una malla, pero debido a que los rayos ocurren instantáneamente, no tenemos una forma decente de mostrar las balas. Podrías dibujar una línea desde el origen del raycast hasta el punto donde el raycast colisionó, y esa es una forma popular de mostrar los raycasts. Otra forma es simplemente no dibujar el raycast en absoluto, porque teóricamente las balas se mueven tan rápido que nuestros ojos no podrían verlo de todos modos.
fr: Un autre inconvénient est que nous ne pouvons pas voir la balle. Avec les objets à balles, nous pouvons voir la balle se déplacer dans l'espace si nous y attachons un maillage, mais comme les raycasts se produisent instantanément, nous n'avons pas une façon décente de montrer les balles. Vous pourriez tracer une ligne à partir de l'origine du raycast jusqu'au point où le raycast est entré en collision, et c'est une façon populaire de montrer les raycasts. Une autre façon est tout simplement de ne pas dessiner le raycast du tout, parce que théoriquement les balles se déplacent si vite que nos yeux ne pourraient pas le voir de toute façon.
ja: もう1つの欠点は、弾丸が見えないことです。弾丸オブジェクトでは、メッシュをアタッチすると弾丸が空間を移動するのを実際に見ることができますが、レイキャストは即座に発生するため、弾丸を表示する適切な方法はありません。レイキャストの原点から、レイキャストが衝突したポイントまで線を引くことができます。これは、レイキャストを表示する一般的な方法の1つです。もう1つの方法は、理論的には弾丸が非常に速く動くため、レイキャストをまったく描画しないことです。
zh_cn: 另一个缺点是我们看不到子弹。 对于子弹物体，我们实际上可以看到子弹穿过空间，如果我们将一个网格附加到它上面，但由于光线投射立即发生，我们没有一个体面的方式来显示子弹。 您可以从光线投射的原点到光线投射相撞的点绘制一条线，这是显示光线投影的一种流行方式。 另一种方法是根本不绘制光线投射，因为从理论上讲，子弹移动得如此之快，我们的眼睛无论如何都看不到它。

source: Let's get the bullet object set up. This is what our pistol will create when the "Pistol_fire" animation callback function is called.
es: Preparemos el objeto de la bala. Esto es lo que nuestra pistola creará cuando se llame a la función de llamada de la animación "Pistol_fire".
fr: Préparons l'objet balle. C'est ce que notre pistolet va créer lorsque la fonction de rappel d'animation "Pistol_fire" est appelée.
ja: 弾丸オブジェクトを設定してみましょう。これは、"Pistol_fire"アニメーションコールバック関数が呼び出されたときにピストルが作成するものです。

source: Open up ``Bullet_Scene.tscn``. The scene contains :ref:`Spatial <class_Spatial>` node called bullet, with a :ref:`MeshInstance <class_MeshInstance>` and an :ref:`Area <class_Area>` with a :ref:`CollisionShape <class_CollisionShape>` children to it.
es: Abre ``Bullet_Scene.tscn``. La escena contiene un nodo :ref:`Spatial <class_Spatial>` llamado bala, con una :ref:`MeshInstance <class_MeshInstance>` y una :ref:`Area <class_Area>` con una :ref:`CollisionShape <class_CollisionShape>` hijo a la misma.
fr: Ouvrez ``Bullet_Scene_Scene.tscn``. La scène contient un nœud :ref:`Spatial <class_Spatial>` appelé bullet, avec un :ref:`MeshInstance <class_MeshInstance>` et un :ref:`Area <class_Area>` avec un :ref:`CollisionShape <class_CollisionShape>` enfant.
ja: ``Bullet_Scene.tscn`` を開きます。シーンには、bulletと呼ばれる :ref:`Spatial <class_Spatial>`ノードと\ :ref:`MeshInstance <class_MeshInstance>`\ 、\ :ref:`CollisionShape <class_CollisionShape>`を子として持つ :ref:`Area <class_Area>` が含まれます。
zh_cn: 打开 ``Bullet_Scene.tscn`` 。 场景包含 :ref:`Spatial <class_Spatial>` 节点名为bullet，带有 :ref:`MeshInstance <class_MeshInstance>` 和 :ref:`Area <class_Area>` 带有 :ref:`CollisionShape <class_CollisionShape>` children 它。
