Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_six.po
Languages: es, fr, ja, zh_cn

source: Right now, all we will be using ``Globals.gd`` for is a way to carry variables across scenes. Because the sensitivities of our mouse and joypad are stored in ``Globals.gd``, any changes we make in one scene (like in ``Options_Menu``) will affect the sensitivity for the player.
es: Ahora mismo, todo lo que usaremos ``Globals.gd`` es una forma de llevar las variables a través de las escenas. Debido a que las sensibilidades de nuestro ratón y el joypad se almacenan en ``Globals.gd``, cualquier cambio que hagamos en una escena (como en ``Options_Menu``) afectará a la sensibilidad del jugador.
fr: Pour l'instant, la seule utilité de ``Globals.gd`` est de contenir des variables à travers des scènes. Du fait que les sensibilités de nos souris et contrôleurs sont stockés dans ``Globals.gd``, chaque changement fait dans une scène (comme dans ``Options_Menu``) va affecter la sensibilité de notre joueur.
ja: 今のところ、\ ``Globals.gd`` を使用するのは、シーン間で変数をやりとりする手段としてだけです。マウスとジョイパッドの感度は ``Globals.gd`` に保存されているため、1つのシーン(``Options_Menu`` など)で行った変更は、プレイヤーの感度に影響します。

source: All we're doing in ``load_new_scene`` is calling :ref:`SceneTree <class_SceneTree>`'s ``change_scene`` function, passing in the scene path given in ``load_new_scene``.
es: Todo lo que hacemos en ``load_new_scene`` es llamar :ref:`SceneTree <class_SceneTree>` a la función ``change_scene``, pasando por la ruta de la escena dada en ``load_new_scene``.
fr: Tout ce que nous faisons dans ``load_new_scene``, c'est d'appeler la fonction de ``change_scene`` de :ref:`SceneTree <class_SceneTree>`, en passant en paramètre le chemin d'accès à la scène donné dans ``load_new_scene``.
ja: ``load_new_scene`` で行っているのは、\ :ref:`SceneTree <class_SceneTree>` の ``change_scene`` 関数を呼び出して、\ ``load_new_scene`` で指定されたシーンパスを渡すことです。
zh_cn: 我们在 ``load_new_scene`` 中所做的就是调用 :ref:`SceneTree <class_SceneTree>` 的 ``change_scene`` 函数，传入 ``load_new_scene`` 中给出的场景路径。

source: That's all the code needed for ``Globals.gd`` right now! Before we can test the main menu, we first need to set ``Globals.gd`` as an autoload script.
es: ¡Ese es todo el código necesario para ``Globals.gd`` ahora mismo! Antes de que podamos probar el menú principal, primero tenemos que configurar ``Globals.gd`` como un script de carga automática.
fr: C'est tout le code nécessaire pour ``Globals.gd`` pour l'instant ! Avant de pouvoir tester le menu principal, nous devons d'abord définir ``Globals.gd`` comme un script chargé automatiquement.
ja: ``Globals.gd`` に今必要なコードはこれだけです！ メインメニューをテストする前に、まず ``Globals.gd`` を自動読み込みスクリプトとして設定する必要があります。

source: Open up the ``Project Settings`` and click the ``AutoLoad`` tab.
es: Abre la pestaña ``Project Settings`` y haz clic en la pestaña ``AutoLoad`` .
fr: Ouvrez l'onglet ``Project Settings`` et cliquez sur l'onglet ``AutoLoad``.
ja: ``プロジェクト設定`` を開き、\ ``自動読み込み`` タブをクリックします。
zh_cn: 打开``Project Settings``并单击 ``AutoLoad`` 选项卡。

source: Then select the path to ``Globals.gd`` in the ``Path`` field by clicking the button (``..``) beside it. Make sure the name in the ``Node Name`` field is ``Globals``. If you have everything like in the picture above, then press ``Add``!
es: Luego selecciona el camino a ``Globals.gd`` en el campo ``Path`` haciendo clic en el botón (``..``) al lado. ¡Asegúrate de que el nombre en el campo ``Node Name`` es ``Globals``. Si tienes todo como en la imagen de arriba, entonces presiona ``Add``!
fr: Sélectionnez ensuite le chemin pour ``Globals.gd`` dans le champ ``Path`` en cliquant sur le bouton (``..``) à côté. Assurez-vous que le nom dans le champ ``Node Name`` est ``Globals``. Si vous avez tout comme dans l'image ci-dessus, appuyez alors sur ``Add`` !
ja: 次に、\ ``パス`` フィールドの横にあるボタン(フォルダのアイコン)をクリックして、\ ``Globals.gd`` へのパスを選択します。\ ``ノード名`` フィールドの名前が ``Globals`` であることを確認します。 上の図のようになっていれば、\ ``追加`` を押してください！
zh_cn: 然后通过单击旁边的按钮(`````)选择``Path``字段中``Globals.gd``的路径。 确保``Node Name``字段中的名称是``Globals``。 如果您拥有上图所示的所有内容，请按“添加”！

source: This will make ``Globals.gd`` a singleton/autoload script, which will allow us to access it from any script, in any scene.
es: Esto hará de ``Globals.gd`` un script singleton/autoload, que nos permitirá acceder a él desde cualquier script, en cualquier escena.
fr: Cela rendra ``Globals.gd`` comme un singleton (script chargé automatiquement), ce qui nous permettra d'accéder à ce script depuis n'importe quelle scène.
ja: これにより、\ ``Globals.gd`` がシングルトン/自動読み込みスクリプトになり、どのシーンのどのスクリプトからでもアクセスできるようになります。
zh_cn: 这将使 ``Globals.gd`` 成为单例/自动加载脚本，这将允许我们从任何场景中的任何脚本访问它。

source: For more information on singleton/autoload scripts, see :ref:`doc_singletons_autoload`.
es: Para más información sobre scripts singleton/autoload, ve :ref:`doc_singletons_autoload`.
fr: Pour plus d'informations sur les scripts singleton, regardez :ref:`doc_singletons_autoload`.
ja: シングルトン/自動読み込みスクリプトの詳細については、\ :ref:`doc_singletons_autoload` を参照してください。
zh_cn: 有关单例/自动加载脚本的更多信息，请参阅 :ref:`doc_singletons_autoload`。

source: Now that ``Globals.gd`` is a singleton/autoload script, you can test the main menu!
es: Ahora que ``Globals.gd`` es un script singleton/autoload ¡puedes probar el menú principal!
fr: Maintenant que ``Globals.gd`` est un singleton, vous pouvez tester le menu principal !
ja: ``Globals.gd`` はシングルトン/自動読み込みスクリプトなので、メインメニューをテストできます！
zh_cn: 现在 ``Globals.gd`` 是一个单例/自动加载脚本，您可以测试主菜单！

source: You may want to change the main scene from ``Testing_Area.tscn`` to ``Main_Menu.tscn`` so when we export the game the player will start at the main menu. You can do this through the ``Project Settings``, under the ``General`` tab. Then in the ``Application`` category, click the ``Run`` subcategory and you can change the main scene by changing the value in ``Main Scene``.
es: Puede que quieras cambiar la escena principal de ``Testing_Area.tscn`` a ``Menú_Mayor.tscn`` para que cuando exportemos el juego el jugador comience en el menú principal. Puedes hacerlo a través de la pestaña ``Project Settings``, bajo la pestaña ``General``. Luego, en la categoría ``Aplication``, haz clic en la subcategoría ``Run`` y puedes cambiar la escena principal cambiando el valor en ``Main Scene``.
fr: Vous voudrez peut-être changer la scène principale de ``Testing_Area.tscn`` à ``Main_Menu.tscn`` de sorte que lorsqu'on exporte le jeu, le joueur va commencer dans le menu principal. Vous pouvez faire cela en allant dans ``Project Settings``, sous l'onglet ``General``. Sélectionnez la catégorie ``Application``, cliquez sur la sous-catégorie ``Run`` et vous pourrez alors changer la valeur de ``Main Scene``.
ja: メインシーンを ``Testing_Area.tscn`` から ``Main_Menu.tscn`` に変更すると、ゲームをエクスポートするときにプレイヤーがメインメニューで開始するようになります。 これは、\ ``プロジェクト設定`` の ``一般`` タブで行うことができます。\ ``Application`` カテゴリの ``Run`` サブカテゴリをクリックし、\ ``Main Scene`` の値を変更してメインシーンを変更できます。
zh_cn: 您可能希望将主场景从 ``Testing_Area.tscn`` 更改为 ``Main_Menu.tscn`` ，因此当我们导出游戏时，游戏角色将从主菜单开始。 您可以通过 ``General`` 选项卡下的``Project Settings``来完成此操作。 然后在 ``Application`` 类别中，单击 ``Run`` 子类别，您可以通过更改``Main Scene``中的值来更改主场景。

source: You'll have to set the paths to the correct files in ``Main_Menu`` in the editor before testing the main menu! Otherwise you will not be able to change scenes from the level select menu/screen.
es: ¡Tendrás que establecer las rutas de los archivos correctos en ``Main_Menu`` en el editor antes de probar el menú principal! De lo contrario, no podrás cambiar de escena desde el menú/pantalla de selección de nivel.
fr: Vous devrez entrer les bons chemins d'accès aux bons fichiers dans ``Main_Menu`` dans l'éditeur avant de tester le menu principal ! Autrement, vous ne serez pas en mesure de changer de scènes depuis le menu de sélection de niveaux.
ja: メインメニューをテストする前に、エディタの ``Main_Menu`` で正しいファイルへのパスを設定する必要があります！ そうしないと、レベル選択メニュー/画面からシーンを変更できません。
zh_cn: 在测试主菜单之前，您必须在编辑器中的 ``Main_Menu`` 中设置正确文件的路径！ 否则，您将无法从级别选择菜单/屏幕更改场景。

source: Adding the debug menu
es: Añadiendo el menú de depuración
fr: Ajouter le menu de débogage
ja: デバッグメニューの追加
zh_cn: 添加调试菜单

source: Now, let's add a simple debugging scene so we can track things like FPS (Frames Per Second) in-game. Open up ``Debug_Display.tscn``.
es: Ahora, vamos a añadir una simple escena de depuración para que podamos rastrear cosas como FPS (Fotogramas Por Segundo) en el juego. Abre ``Debug_Display.tscn``.
fr: Ajoutons maintenant une simple scène de débogage de façon à pouvoir suivre des éléments tels que les IPS (Images Par Secondes) en jeu. Ouvrez ``Debug_Display.tscn``.
ja: では、ゲーム内でFPS(Frames Per Second)などを追跡できるように、簡単なデバッグシーンを追加しましょう。\ ``Debug_Display.tscn`` を開きます。

source: You can see it's a :ref:`Panel <class_Panel>` positioned in the top right corner of the screen. It has three :ref:`Labels <class_Label>`, one for displaying the FPS at which the game is running, one for showing on what OS the game is running, and a label for showing with which Godot version the game is running.
es: Puedes ver que es un :ref:`Panel <class_Panel>` posicionado en la esquina superior derecha de la pantalla. Tiene tres :ref:`Labels <class_Label>`, una para mostrar el FPS en el que se está ejecutando el juego, otra para mostrar en qué sistema operativo se está ejecutando el juego, y una etiqueta para mostrar con qué versión de Godot se está ejecutando el juego.
fr: Vous pouvez voir qu'un :ref:`Panel <class_Panel>` est positionné dans le coin supérieur droit de l'écran. Il dispose de trois :ref:`Labels <class_Label>`, un pour afficher les IPS du jeu, un pour afficher sur quel OS le jeu tourne et un pour afficher quelle version de Godot est utilisée.
ja: 画面の右上隅に配置された :ref:`Panel <class_Panel>` であることがわかります。\ :ref:`Labels <class_Label>` が3つあります。1つはゲームが実行されているFPSを表示するためのもの、もう1つはゲームが実行されているOSを示すためのもの、そしてゲームが実行されているGodotバージョンを示すためのラベルです。

source: Let's add the code needed to fill these :ref:`Labels <class_Label>`. Select ``Debug_Display`` and create a new script called ``Debug_Display.gd``. Add the following:
es: Añadamos el código necesario para llenar estos :ref:`Labels <class_Label>`. Selecciona ``Debug_Display`` y crea un nuevo script llamado ``Debug_Display.gd``. Añade lo siguiente:
fr: Ajoutons le code nécessaire pour remplir ces :ref:`Labels <class_Label>`. Sélectionnez ``Debug_Display`` et créez un nouveau script appelé ``Debug_Display.gd``. Ajoutez ce qui suit :
ja: これらの :ref:`Lebels <class_Label>` を埋めるために必要なコードを追加しましょう。\ ``Debug_Display`` を選択し、\ ``Debug_Display.gd`` という新しいスクリプトを作成します。 次のように追加します:
zh_cn: 让我们添加填充这些代码所需的代码 :ref:`Labels <class_Label>`。 选择 ``Debug_Display`` 并创建一个名为 ``Debug_Display.gd`` 的新脚本。 添加以下内容:

source: Let's go over what this script does.
es: Repasemos lo que hace este script.
fr: Passons en revue ce que fait ce code.
ja: このスクリプトの動作について説明します。
zh_cn: 我们来看看这个脚本的功能。

source: In ``_ready``, we set the ``OS_Label``'s text to the name provided by :ref:`OS <class_OS>` using the ``get_name`` function. This will return the name of the OS (or Operating System) for which Godot was compiled. For example, when you are running Windows, it will return ``Windows``, while when you are running Linux, it will return ``X11``.
es: En ``_ready``, ponemos el texto de la ``OS_Label`` al nombre proporcionado por :ref:`OS <class_OS>` usando la función ``get_name``. Esto devolverá el nombre del SO (o Sistema Operativo) para el cual Godot fue compilado. Por ejemplo, cuando se ejecuta Windows, devolverá ``Windows``, mientras que cuando se ejecuta Linux, devolverá ``X11``.
fr: Dans ``_ready``, on affecte au texte de ``OS_Label`` le nom fournit par :ref:`OS <class_OS>` en utilisant la fonction ``get_name``. Cela va renvoyer le nom de l'OS (Système d'exploitation) sur lequel Godot a été compilé. Par exemple, si vous utilisez Windows, il va retourner ``Windows``, si vous utilisez Linux, il va retourner ``X11``.
ja: ``_ready`` では、\ ``get_name`` 関数を使用して、\ :ref:`OS <class_OS>` によって提供される名前に ``OS_Label`` のテキストを設定します。これは、GodotがコンパイルされたOS(またはオペレーティングシステム)の名前を返します。たとえば、Windowsを実行している場合は ``Windows`` を返し、Linuxを実行している場合は ``X11`` を返します。

source: Then, we set the ``Engine_Label``'s text to the version info provided by ``Engine.get_version_info``. ``Engine.get_version_info`` returns a dictionary full of useful information about the version of Godot which is currently running. We only care about the string version, for this label at least, so we get the string and assign that as the ``text`` in ``Engine_Label``. See :ref:`Engine <class_Engine>` for more information on the values ``get_version_info`` returns.
es: Entonces, ponemos el texto de la ``Engine_Label`` en la información de la versión proporcionada por ``Engine.get_version_info``. ``Engine.get_version_info`` devuelve un diccionario lleno de información útil sobre la versión de Godot que se está ejecutando actualmente. Sólo nos importa la versión de la string, al menos para esta etiqueta, por lo que obtenemos la string y la asignamos como el ``text`` en ``Engine_Label``. Ver :ref:`Engine <class_Engine>` para más información sobre los valores que devuelve ``get_version_info``.
fr: Ensuite, nous au texte de ``Engine_Label`` les infos de versions fournies par ``Engine.get_version_info``. ``Engine.get_version_info``renvoie un dictionnaire remplit d'informations utiles à propos de la version de Godot couramment utilisée. Nous ne nous intéressons qu'à la chaîne concernant la version, pour ce label en tout cas, afin de pouvoir assigner celui-ci au ``text`` de ``Engine_Label``. Voir :ref:`Engine <class_Engine>` pour plus d'informations sur les valeurs que retourne ``get_version_info``.
ja: 次に、\ ``Engine_Label`` のテキストを ``Engine.get_version_info`` によって提供されるバージョン情報に設定します。\ ``Engine.get_version_info`` は、現在実行中のGodotのバージョンに関する有用な情報が満載されたdictionaryを返します。少なくともこのラベルについては、文字列バージョンのみが重要なので、文字列を取得し、それを\ ``Engine_Label`` の ``text`` として割り当てます。\ ``get_version_info`` が返す値の詳細については :ref:`Engine <class_Engine>` を参照してください。

source: In ``_process``, we set the text of the ``FPS_Label`` to ``Engine.get_frames_per_second``, but because ``get_frames_per_second`` returns an integer, we have to cast it to a string using ``str`` before we can add it to the :ref:`Label <class_Label>`.
es: En ``_process``, ponemos el texto de la ``FPS_Label`` a ``Engine.get_frames_per_second``, pero como ``get_frames_per_second`` devuelve un entero, tenemos que convertirlo a una string usando ``str`` antes de que podamos añadirlo al :ref:`Label <class_Label>`.
fr: Dans ``_process``, on affecte au texte de ``FPS_Label`` la valeur de ``Engine.get_frames_per_second``, mais parce que ``get_frames_per_second`` retourne un entier, nous devons le convertir en chaîne de caractère en utilisant ``str`` avant de l'ajouter au :ref:`Label <class_Label>`.
ja: ``_process`` では、\ ``FPS_Label`` のテキストを ``Engine.get_frames_per_second`` に設定しますが、\ ``get_frames_per_second`` は整数を返すため、\ ``:ref:`Label <class_Label>` に追加する前に ``str`` を使用して文字列にキャストする必要があります。

source: Now let's jump back to ``Main_Menu.gd`` and change the following in ``options_menu_button_pressed``:
es: Ahora volvamos al ``Main_Menu.gd`` y cambiemos lo siguiente en ``options_menu_button_pressed``:
fr: Maintenant, revenons au ``Main_Menu.gd`` et changeons ce qui suit dans ``options_menu_button_pressed`` :
ja: 次に、\ ``Main_Menu.gd`` に戻って、\ ``options_menu_button_pressed`` で次の項目を変更してみましょう:
zh_cn: 现在让我们跳回到 ``Main_Menu.gd`` 并在 ``options_menu_button_pressed`` 中更改以下内容:

source: to this instead:
es: a esto en cambio:
fr: à ceci à la place :
ja: 代わりにこれを実行します:
zh_cn: 改为:

source: This will call a new function called ``set_debug_display`` in our singleton, so let's add that next!
es: Esto llamará a una nueva función en nuestra llamada singleton ``set_debug_display`` ¡así que agreguemos eso a continuación!
fr: Cela va appeler une nouvelle fonction appelée ``set_debug_display`` dans notre singleton, donc ajoutons cela maintenant !
ja: これにより、シングルトン内で ``set_debug_display`` という新しい関数が呼び出されるので、次に追加しましょう！

source: Open up ``Globals.gd`` and add the following class variables:
es: Abre ``Globals.gd`` y añade las siguientes variables de clase:
fr: Ouvrez ``Globals.gd`` et ajouter les variables de classe suivantes :
ja: ``Globals.gd`` を開き、次のクラス変数を追加します:
zh_cn: 打开 ``Globals.gd`` 并添加以下类变量:

source: ``canvas_layer``: A canvas layer so the GUI/UI created in ``Globals.gd`` is always drawn on top.
es: ``canvas_layer``: Una capa de lienzo para que el GUI/UI creado en ``Globals.gd`` esté siempre dibujado encima.
fr: ``canvas_layer``: Une couche du canvas afin que le GUI/UI créée dans ``Globals.gd``soit toujours affichée au dessus.
ja: ``canvas_layer``: ``Globals.gd`` で作成されたGUI / UIが常に一番上に描画されるキャンバスレイヤー。
zh_cn: ``canvas_layer``:一个画布层，因此在 ``Globals.gd`` 中创建的GUI / UI总是在顶部绘制。

source: ``DEBUG_DISPLAY``: The debug display scene we worked on earlier.
es: ``DEBUG_DISPLAY``: La escena de visualización de depuración en la que trabajamos antes.
fr: ``DEBUG_DISPLAY``: La scène d'affichage de débogage sur laquelle nous avons travaillé plus tôt.
ja: ``DEBUG_DISPLAY``: 先ほど取り組んだデバッグ表示シーン。
zh_cn: ``DEBUG_DISPLAY``:我们之前处理过的调试显示场景。

source: ``debug_display``: A variable to hold the debug display when/if there is one.
es: ``debug_display``: Una variable para mantener la pantalla de depuración cuando/si la hay.
fr: ``debug_display``: Une variable utilisée pour stocker l'affichage de débogage quand/si il y en a une.
ja: ``debug_display``: デバッグ表示がある場合にデバッグ表示を保持する変数。
zh_cn: ``debug_display``:一个变量，用于在/如果存在时保持调试显示。

source: Now that we have the class variables defined, we need to add a few lines to ``_ready`` so ``Globals.gd`` will have a canvas layer to use (which we will store in ``canvas_layer``). Change ``_ready`` to the following:
es: Ahora que tenemos las variables de clase definidas, necesitamos añadir unas pocas líneas a ``_ready`` para que ``Globals.gd`` tenga una capa de lienzo para usar (que guardaremos en ``canvas_layer``). Cambia ``_ready`` por lo siguiente:
fr: Maintenant que les variables de classe sont définies, nous devons ajouter quelques lignes à ``_ready`` pour que ``Globals.gd``ait une couche de canvas à utiliser (que nous allons stocker dans ``canvas_layer``). Changez ``_ready`` par ce qui suit :
ja: クラス変数が定義されたので、\ ``_ready`` に数行を追加して、使用するキャンバスレイヤーを ``Globals.gd`` が保持するようにする必要があります。\ ``_ready`` を次のように変更します:
zh_cn: 现在我们已经定义了类变量，我们需要在 ``_ready`` 中添加几行，以便 ``Globals.gd`` 将使用一个画布层(我们将存储在 ``canvas_layer`` 中)。 将 ``_ready`` 更改为以下内容:

source: Now in ``_ready``, we create a new canvas layer, assign it to ``canvas_layer`` and add it as a child. Because ``Globals.gd`` is an autoload/singleton, Godot will make a :ref:`Node <class_Node>` when the game is launched, and it will have ``Globals.gd`` attached to it. Since Godot makes a :ref:`Node <class_Node>`, we can treat ``Globals.gd`` like any other node with regard to adding/removing children nodes.
es: Ahora en ``_ready``, creamos una nueva capa de lienzo, la asignamos a ``canvas_layer`` y la agregamos como un niño. Debido a que ``Globals.gd`` es un autoload/singleton, Godot hará un :ref:`Node <class_Node>` cuando el juego sea lanzado, y tendrá ``Globals.gd`` adjunto a él. Ya que Godot hace un :ref:`Node <class_Node>`, podemos tratar ``Globals.gd`` como cualquier otro nodo con respecto a agregar/quitar nodos hijos.
fr: Nous allons maintenant dans ``_ready`` créer une nouvelle couche de canvas, l'assigner à ``canvas_layer`` et l'ajouter en tant que fils. Parce que ``Globals.gd`` est un singleton, Godot va créer un :ref:`Node <class_Node>` quand le jeu se lancera, qui aura ``Globals.gd`` d'attaché. Puisque Godot créer un :ref:`Node <class_Node>`, nous pouvons traiter ``Globals.gd`` comme n'importe quel nœud en ce qui concerne l'ajout et la suppressions de nœuds enfants.
ja: ``_ready`` で、新しいキャンバスレイヤーを作成し、それを ``canvas_layer`` に割り当てて、子として追加します。\ ``Globals.gd`` は自動読み込み/シングルトンであるため、Godotはゲームの起動時に :ref:`Node <class_Node>` を作成し、それに ``Globals.gd`` がアタッチされます。Godotは :ref:`Node <class_Node>` を作成するため、子ノードの追加/削除に関しては、他のノードと同様に ``Globals.gd`` を扱うことができます。

source: The reason we're adding a :ref:`CanvasLayer <class_CanvasLayer>` is so all our GUI and UI nodes we instance/spawn in ``Globals.gd`` are always drawn on top of everything else.
es: La razón por la que añadimos un :ref:`CanvasLayer <class_CanvasLayer>` es para que todos nuestros nodos GUI y UI que instancia/aparecen en ``Globals.gd`` estén siempre dibujados encima de todo lo demás.
fr: La raison pour laquelle nous ajoutons un :ref:`CanvasLayer <class_CanvasLayer>` est parce que nous voulons que tous nos nœuds d'UI/GUI que nous instantons dans ``Globals.gd`` se dessinent toujours au dessus de tout le reste.
ja: :ref:`CanvasLayer <class_CanvasLayer>` を追加する理由は、\ ``Globals.gd`` でインスタンス化/生成するすべてのGUIおよびUIノードが常に他のすべての上に描画されるためです。

source: When adding nodes to a singleton/autoload, you have to be careful not to lose reference to any of the child nodes. This is because nodes will not be freed/destroyed when you change the active scene, meaning you can run into memory problems if you are instancing/spawning lots of nodes and you are not freeing them.
es: Al añadir nodos a un singleton/autoload, hay que tener cuidado de no perder la referencia a ninguno de los nodos hijos. Esto se debe a que los nodos no serán liberados/destruidos cuando se cambia de escena, lo que significa que se pueden producir problemas de memoria si se están instanciando/generando muchos nodos y no se están liberando.
fr: Lorsque vous ajoutez des nœuds à un singleton, vous devez faire attention à ne pas perdre la référence des nœuds enfants. Nous devons faire cela car ces nœuds ne sont pas détruis lorsque l'on change de scène active, ce qui veut dire que vous rencontrerez des problèmes de mémoire si vous créer beaucoup de nœuds et que vous ne les détruisez pas.
ja: シングルトン/自動読み込みにノードを追加するときは、子ノードへの参照を失わないように注意する必要があります。これは、アクティブなシーンを変更してもノードが解放/破棄されないためです。つまり、多くのノードをインスタンス化/生成していて、それを解放していない場合、メモリの問題が発生する可能性があります。

source: Now we need to add ``set_debug_display`` to ``Globals.gd``:
es: Ahora necesitamos añadir ``set_debug_display`` a ``Globals.gd``:
fr: Nous devons maintenant ajouter ``set_debug_display`` à ``Globals.gd`` :
ja: 次に、\ ``set_debug_display`` を ``Globals.gd`` に追加する必要があります:
zh_cn: 现在我们需要将 ``set_debug_display`` 添加到``Globals.gd``:

source: Let's go over what's happening.
es: Repasemos lo que está pasando.
fr: Voyons ce qui se passe.
ja: 何が起こっているのか見ていきましょう。
zh_cn: 让我们回顾一下正在发生的事情。

source: First we check to see if ``Globals.gd`` is trying to turn on the debug display, or turn it off.
es: Primero comprobamos si ``Globals.gd`` está intentando encender la pantalla de depuración, o apagarla.
fr: Nous vérifions d'abord si ``Globals.gd`` essaie d'allumer ou d'éteindre l'affichage de débogage.
ja: まず、\ ``Globals.gd`` がデバッグ表示をオンにしようとしているか、オフにしようとしているかを確認します。
zh_cn: 首先，我们检查 ``Globals.gd`` 是否正在尝试打开调试显示，或者将其关闭。
