Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_five.po
Languages: de, es, fr, ja, zh_cn

source: If the grenade has waited long enough to explode, we first tell the ``explosion_particles`` to emit. Then we make ``grenade_mesh`` invisible, and disable ``rigid_shape``, effectively hiding the grenade.
es: Si la granada ha esperado lo suficiente para explotar, primero le decimos a las ``explosion_particles`` que emitan. Luego hacemos invisible la ``grenade_mesh``, y desactivamos la ``rigid_shape``, ocultando la granada.
fr: Si la grenade a attendue suffisamment longtemps pour exploser, on dit aux ``explosion_particles`` qu'elles peuvent émettent. Nous rendons ensuite ``grenade_mesh`` invisible et on désactive ``rigid_shape``, ce qui cachera la grenade.
ja: 手榴弾が爆発するのに十分な時間待機した場合、まず ``explosion_particles`` に放出するように指示します。次に、\ ``grenade_mesh`` を非表示にし、\ ``rigid_shape`` を無効にして、手榴弾を効果的に隠します。
zh_cn: 如果手榴弹已经等待足够长的时间爆炸，我们首先告诉“爆炸_粒子”发射。 然后我们使 ``grenade_mesh`` 不可见，并禁用 ``rigid_shape`` ，有效地隐藏了手榴弹。

source: We then set the :ref:`RigidBody <class_RigidBody>`'s mode to ``MODE_STATIC`` so the grenade does not move.
de: Dann setzen wir den Modus des :ref:`RigidBody <class_RigidBody>` auf ``MODE_STATIC``, damit sich die Granate nicht bewegt.
es: Luego ponemos el modo de :ref:`RigidBody <class_RigidBody>` en ``MODE_STATIC`` para que la granada no se mueva.
fr: Nous réglons alors le mode du :ref:`RigidBody <class_RigidBody>` à ``MODE_STATIC`` afin que la grenade ne bouge pas.
ja: 次に :ref:`RigidBody <class_RigidBody>` のモードを ``MODE_STATIC``に設定し、手榴弾が動かないようにします。
zh_cn: 然后我们将 :ref:`RigidBody <class_RigidBody>的模式设置为 ``MODE_STATIC`` ，这样手榴弹就不会移动了。

source: Then we get all the bodies in ``blast_area``, check to see if they have the ``bullet_hit`` method/function, and if they do, we call it and pass in ``GRENADE_DAMAGE`` and the transform from the body looking at the grenade. This makes it where the bodies exploded by the grenade will explode outwards from the grenade's position.
es: Entonces tenemos todos los cuerpos en el ``blast_area``, comprobamos si tienen el método/función del ``bullet_hit``, y si lo tienen, lo llamamos y pasamos a ``GRENADE_DAMAGE` y la transformación del cuerpo mirando la granada. Esto hace que los cuerpos explotados por la granada exploten hacia afuera desde la posición de la granada.
fr: Nous récupérons ensuite tous les corps dans la ``blast_area``, nous vérifions qu'ils ont la méthode/fonction et si ils l'ont, on l'appelle et on passe en argument ``GRENADE_DAMAGE`` ainsi que le transform du corps touché par la grenade. Cela fera en sorte que les corps touchés par la grenade explosent vers l'extérieur de la position de la grenade.
ja: 次に、\ ``blast_area`` 内のすべてのボディを取得し、それらが ``bullet_hit`` メソッド/関数を持っているかどうかを確認し、もしあれば、それを呼び出して ``GRENADE_DAMAGE`` と手榴弾を見ているボディからのtransformを渡します。 これにより、手榴弾で爆発した体が手榴弾の位置から外側に爆発します。

source: We then check to see if ``explosion_wait_timer`` is less than ``EXPLOSION_WAIT_TIME``. If it is, we add ``delta`` to ``explosion_wait_timer``.
es: Luego comprobamos si ``explosion_wait_timer`` es menos que ``EXPLOSION_WAIT_TIME``. Si lo es, añadimos ``delta`` a ``explosion_wait_timer``.
fr: Nous vérifions ensuite si ``explosion_wait_timer`` est plus petit que ``EXPLOSION_WAIT_TIME``. Si c'est le cas, on ajoute ``delta`` à ``explosion_wait_timer``.
ja: 次に、\ ``explosion_wait_timer`` が ``EXPLOSION_WAIT_TIME`` よりも小さいかどうかを確認します。 そうである場合、\ ``delta`` を `` explosion_wait_timer`` に加算します。

source: Next, we check to see if ``explosion_wait_timer`` is greater than or equal to ``EXPLOSION_WAIT_TIME``. Because we added ``delta``, this will only be called once. If ``explosion_wait_timer`` is greater or equal to ``EXPLOSION_WAIT_TIME``, the grenade has waited long enough to let the :ref:`Particles <class_Particles>` play and we can free/destroy the grenade, as we no longer need it.
de: Als nächstes prüfen wir, ob ``explosion_wait_timer`` größer oder gleich ``EXPLOSION_WAIT_TIME`` ist. Da wir ``delta`` hinzugefügt haben, wird dies nur einmal aufgerufen. Wenn ``explosion_wait_timer`` größer oder gleich ``EXPLOSION_WAIT_TIME`` ist, hat die Granate lange genug gewartet, um die :ref:`Particles <class_Particles>` abspielen zu lassen, und wir können die Granate freigeben/zerstören, da wir sie nicht mehr brauchen.
es: A continuación, comprobamos si ``explosion_wait_timer`` es mayor o igual que ``EXPLOSION_WAIT_TIME``. Como añadimos ``delta``, esto sólo se llamará una vez. Si ``explosion_wait_timer`` es mayor o igual a ``EXPLOSION_WAIT_TIME``, la granada ha esperado lo suficiente para que la :ref:`Particles <class_Particles>` juegue y podamos liberar/destruir la granada, ya que no la necesitamos.
fr: Ensuite, nous vérifions si ``explosion_wait_timer`` est supérieur ou égal à ``EXPLOSION_WAIT_TIME``. Parce que nous avons ajouté ``delta``, cela va être appelée une seule fois. Si ``explosion_wait_timer`` est supérieur ou égal à ``EXPLOSION_WAIT_TIME``, les grenades ont attendues suffisamment longtemps pour laisser les :ref:`Particles <class_Particles>` se lancer et nous pouvons détruire/libérer la grenade comme nous n'en avons plus besoin.
ja: 次に、\ ``explosion_wait_timer`` が ``EXPLOSION_WAIT_TIME`` 以上かどうかを確認します。\ ``delta`` を加算したため、これは一度だけ呼び出されます。\ ``explosion_wait_timer`` が ``EXPLOSION_WAIT_TIME`` 以上の場合、手榴弾は :ref:`Particles <class_Particles>` を再生するのに十分な時間待機しており、手榴弾は不もう必要ないので解放/破棄できます 。

source: Let's quickly get the sticky grenade set up too. Open up ``Sticky_Grenade.tscn``.
de: Lassen Sie uns schnell auch die Haftgranate aufsetzen. Öffnen Sie ``Sticky_Granate.tscn``.
es: Preparemos rápidamente la granada adhesiva también. Abre ``Sticky_Grenade.tscn``.
fr: Paramétrons rapidement la grenade collante également. Ouvrez ``Sticky_Grenade.tscn``.
ja: 引き続き、粘着性手榴弾も設定してみしましょう。\ ``Sticky_Grenade.tscn`` を開きます。
zh_cn: 让我们快速设置粘性手榴弹。 打开 ``Sticky_Grenade.tscn`` 。

source: ``Sticky_Grenade.tscn`` is almost identical to ``Grenade.tscn``, with one small addition. We now have a second :ref:`Area <class_Area>`, called ``Sticky_Area``. We will be using ``Stick_Area`` to detect when the sticky grenade has collided with the environment and needs to stick to something.
de: ``Sticky_Grenade.tscn`` ist fast identisch zu ``Grenade.tscn``, mit einem kleinen Zusatz. Wir haben jetzt eine zweite :ref:`Area <class_Area>`, genannt ``Sticky_Area``. Wir werden ``Stick_Area`` benutzen, um festzustellen, wann die Haftgranate mit der Umgebung kollidiert ist und an etwas haften bleiben muss.
es: ``Sticky_Grenade.tscn`` es casi idéntico a ``Grenade.tscn``, con una pequeña adición. Ahora tenemos un segundo :ref:`Area <class_Area>`, llamado ``Sticky_Area``. Usaremos ``Stick_Area`` para detectar cuando la granada pegajosa ha chocado con el ambiente y necesita pegarse a algo.
fr: ``Sticky_Grenade.tscn`` est presque identique à ``Grenade.tscn``, avec une petite addition. Nous avons maintenant une seconde :ref:`Area <class_Area>`, appelée ``Sticky_Area``. Nous allons utiliser ``Stick_Area`` pour détecter quand les grenades collantes sont entrés en collision avec l'environnement et quand elles ont besoin de coller quelque chose.
ja: ``Sticky_Grenade.tscn`` は ``Grenade.tscn`` とほとんど同じですが、1つだけ追加されています。\ ``Sticky_Area`` と呼ばれる2つ目の :ref:`Area <class_Area>` です。\ ``Stick_Area`` を使用して、粘着性手榴弾が周囲と衝突し、何かに固着する必要があるときを検出します。
zh_cn: ``Sticky_Grenade.tscn``几乎与``Grenade.tscn``相同，只有一个小的补充。 我们现在有第二个 :ref:`Area <class_Area>`，称为 ``Sticky_Area`` 。 我们将使用“Stick_Area”来检测粘性手榴弹何时与环境相撞并需要粘在某物上。

source: Select ``Sticky_Grenade`` and make a new script called ``Sticky_Grenade.gd``. Add the following:
de: Wählen Sie ``Sticky_Grenade`` und erstellen Sie ein neues Skript namens ``Sticky_Grenade.gd``. Fügen Sie Folgendes hinzu:
es: Selecciona ``Sticky_Grenade`` y haz un nuevo script llamado ``Sticky_Grenade.gd``. Añade lo siguiente:
fr: Sélectionnez ``Sticky_Grenade`` et créez un nouveau script appelé ``Sticky_Grenade.gd``. Ajoutez ce qui suit :
ja: ``Sticky_Grenade`` を選択し、\ ``Sticky_Grenade.gd`` という新しいスクリプトを作成します。次のように追加します:
zh_cn: 选择 ``Sticky_Grenade`` 并制作一个名为 ``Sticky_Grenade.gd`` 的新脚本。 添加以下内容:

source: The code above is almost identical to the code for ``Grenade.gd``, so let's just go over what's changed.
de: Der obige Code ist fast identisch mit dem Code für ``Grenate.gd``, also lassen Sie uns einfach durchgehen, was sich geändert hat.
es: El código de arriba es casi idéntico al código de ``Grenade.gd``, así que repasemos lo que ha cambiado.
fr: Le code au-dessus, est presque identique au code pour les ``Grenade.gd``, passons seulement en revue les changements.
ja: 上記のコードは ``Grenade.gd`` のコードとほとんど同じなので、何が変更されたかを見てみましょう。
zh_cn: 上面的代码几乎与 ``Grenade.gd`` 的代码完全相同，所以让我们回顾一下已经改变的代码。

source: Firstly, we have a few more class variables:
de: Zunächst einmal haben wir einige weitere Klassenvariablen:
es: Primero, tenemos algunas variables de clase más:
fr: Premièrement, nous avons quelques variables de classe en plus :
ja: まず、いくつかのクラス変数があります:

source: ``attached``: A variable for tracking whether or not the sticky grenade has attached to a :ref:`PhysicsBody <class_PhysicsBody>`.
de: ``attached``: Eine Variable zum Verfolgen ob die Haftgranate an einem :ref:`PhysicsBody <class_PhysicsBody>` angehängt wurde oder nicht.
es: ``attached``: Una variable para rastrear si la granada pegajosa se ha unido o no a un :ref:``PhysicsBody <class_PhysicsBody>`.
fr: ``attached`` : Une variable utilisé pour savoir si oui ou non, la grenade collante est attachée à un :ref:`PhysicsBody <class_PhysicsBody>`.
ja: ``attached``: 粘着性手榴弾が :ref:`PhysicsBody <class_PhysicsBody>` にアタッチされているかどうかを追跡するための変数。
zh_cn: ``附加``:一个变量，用于跟踪粘性手榴弹是否附加到 :ref:`PhysicsBody <class_PhysicsBody>`。

source: ``attach_point``: A variable to hold a :ref:`Spatial <class_Spatial>` that will be at the position where the sticky grenade collided.
de: ``attach_point``: Eine Variable, um einen :ref:`Spatial <class_Spatial>` zu halten, der sich an der Stelle befindet, an der die Klebe-Granate kollidierte.
es: ``attach_point``: Una variable para mantener un :ref:`Spatial <class_Spatial>` que estará en la posición donde la granada pegajosa colisionó.
fr: ``attach_point`` : Une variable qui stocke un :ref:`Spatial <class_Spatial>` qui sera à la position où la grenade collante est entrée en collision.
ja: ``attach_point``: 粘着性手榴弾が衝突した位置にある :ref:`Spatial <class_Spatial>` を保持する変数。

source: ``player_body``: The player's :ref:`KinematicBody <class_KinematicBody>`.
de: ``player_body``: Der :ref:`KinematicBody <class_KinematicBody>` des Spielers.
es: ``player_body``: El jugador es :ref:``KinematicBody <class_KinematicBody>`.
fr: ``player_body`` : Le :ref:`KinematicBody <class_KinematicBody>` du joueur.
ja: ``player_body``: プレイヤーの :ref:`KinematicBody <class_KinematicBody>`\ 。
zh_cn: ``player_body``:游戏角色的 :ref:`KinematicBody <class_KinematicBody>`。

source: They have been added to enable the sticky grenade to stick to any :ref:`PhysicsBody <class_PhysicsBody>` it might hit. We also now need the player's :ref:`KinematicBody <class_KinematicBody>` so the sticky grenade does not stick to the player when the player throws it.
de: Sie wurden hinzugefügt, damit die Haftgranate an jedem :ref:`PhysicsBody <class_PhysicsBody>` haften kann, den sie treffen könnte. Außerdem benötigen wir jetzt den :ref:`KinematicBody <class_KinematicBody>` des Spielers, damit die Haftgranate nicht am Spieler kleben bleibt, wenn der Spieler sie wirft.
es: Se han añadido para permitir que la granada pegajosa se adhiera a cualquier :ref:`PhysicsBody <class_PhysicsBody>` que pueda impactar. También necesitamos el :ref:`KinematicBody <class_KinematicBody>` del jugador para que la granada no se pegue al jugador cuando éste la lance.
fr: Ils ont été ajoutés pour permettre à la grenade collante de s'accrocher à n'importe quel :ref:`PhysicsBody <class_PhysicsBody>` qu'il pourrait toucher. Nous devons également besoin du :ref:`KinematicBody <class_KinematicBody>` du joueur pour que la grenade collante ne s'accroche pas au joueur quand il la lance.
ja: 粘着性手榴弾がヒットする可能性のある :ref:`PhysicsBody <class_PhysicsBody>` に固着するために追加されました。また、プレイヤーは :ref:`KinematicBody <class_KinematicBody>` を必要とするため、プレイヤーが投げたときに粘着性手榴弾がプレイヤーにくっつかないようになります。

source: Now let's look at the small change in ``_ready``. In ``_ready`` we've added a line of code so when any body enters ``Stick_Area``, the ``collided_with_body`` function is called.
de: Schauen wir uns nun die kleine Änderung in ``_ready`` an. In ``_ready`` haben wir eine Zeile Code hinzugefügt, so dass die Funktion ``collided_with_body`` aufgerufen wird, wenn ein Körper in die ``Stick_Area`` eintritt.
es: Ahora veamos el pequeño cambio en ``_ready``. En ``_ready`` hemos añadido una línea de código para que cuando un cuerpo entre en ``Stick_Area``, se llame a la función ``collided_with_body``.
fr: Maintenant, regardons les petits changements dans ``_ready``. Nous avons ajouté une ligne de code de façon à ce que quand n'importe quel corps rentre dans ``Stick_Area``, la fonction ``collided_with_body`` soit appelée.
ja: では、\ ``_ready`` の小さな変更を見てみましょう。\ ``_ready`` にコード行を追加したので、ボディが ``Stick_Area`` に入ると ``collided_with_body`` 関数が呼び出されます。
zh_cn: 现在让我们来看看`_ready``中的小变化。 在 ``_ready`` 中我们添加了一行代码，因此当任何物体进入 ``Stick_Area`` 时，会调用 ``collided_with_body`` 函数。

source: Next let's take a look at ``collided_with_body``.
de: Lassen Sie uns als nächstes einen Blick auf ``collided_with_body`` werfen.
es: A continuación, echemos un vistazo a ``collided_with_body``.
fr: Jetons maintenant un œil à ``collided_with_body``.
ja: 次に ``collided_with_body`` を見てみましょう。
zh_cn: 接下来让我们来看看 ``collided_with_body`` 。

source: Firstly, we make sure the sticky grenade is not colliding with itself. Because the sticky :ref:`Area <class_Area>` does not know it's attached to the grenade's :ref:`RigidBody <class_RigidBody>`, we need to make sure it's not going to stick to itself by checking to make sure the body it has collided with is not itself. If we have collided with ourself, we ignore it by returning.
de: Erstens stellen wir sicher, dass die Haftgranate nicht mit sich selbst kollidiert. Da die klebrige :ref:`Area <class_Area>` nicht weiß, dass sie am :ref:`RigidBody <class_RigidBody>` der Granate befestigt ist, müssen wir sicherstellen, dass sie nicht an sich selbst haftet, indem wir überprüfen, ob der Körper, mit dem sie kollidiert ist, nicht sie selbst ist. Wenn wir mit uns selbst kollidiert sind, ignorieren wir ihn, indem wir returnen.
es: En primer lugar, nos aseguramos de que la granada pegajosa no colisione consigo misma. Debido a que la pegajosa :ref:`Area <class_Area>` no sabe que está pegada a la granada :ref:`RigidBody <class_RigidBody>`, tenemos que asegurarnos de que no se va a pegar a sí misma comprobando que el cuerpo con el que ha chocado no es el mismo. Si hemos chocado con nosotros mismos, lo ignoramos regresando.
fr: Tout d'abord, nous nous assurons que la grenade collante ne rentre pas en collision avec elle-même. Parce que la :ref:`Area <class_Area>` collante ne sait pas si elle est attachée au :ref:`RigidBody <class_RigidBody>` de la grenade, nous devons nous assurer qu'il ne va pas se coller à lui-même en vérifiant que le corps n'est pas rentré en collision avec lui-même. Si c'est le cas, on ignore en faisant un renvoi.
ja: まず、粘着性手榴弾がそれ自体と衝突しないようにします。sticky(粘着性) :ref:`Area <class_Area>` は、grenade(手榴弾) :ref:`RigidBody <class_RigidBody>` に取り付けられていることを知らないので、衝突したbodyがそれ自体ではないことを確認することで、それ自体に固着しないようにする必要があります。自体と衝突した場合は、リターンすることで無視します。

source: We then check to see if we have something assigned to ``player_body``, and if the body the sticky grenade has collided with is the player that threw it. If the body the sticky grenade has collided with is indeed ``player_body``, we ignore it by returning.
de: Dann prüfen wir, ob wir dem ``player_body`` etwas zugeordnet haben, und ob der Körper, mit dem die Haftgranate zusammengestoßen ist, der Spieler ist, der sie geworfen hat. Wenn der Körper, mit dem die Haftgranate kollidiert ist, tatsächlich ein ``player_body`` ist, ignorieren wir ihn, indem wir returnen.
es: Luego comprobamos si tenemos algo asignado al ``player_body``, y si el cuerpo con el que ha chocado la granada pegajosa es el jugador que la ha lanzado. Si el cuerpo con el que la granada pegajosa ha chocado es en efecto el ``player_body``, lo ignoramos retornando.
fr: Nous vérifions ensuite si quelque chose est assigné au ``player_body``, et si le corps avec lequel la grenade collante est entré en contact est le joueur. Si le corps avec lequel la grenade collante est entré en contact est bien le ``player_body``, on l'ignore et on fait un renvoi.
ja: 次に、\ ``player_body`` に何かが割り当てられているかどうかを確認し、粘着性手榴弾が衝突したbodyがそれを投げたプレイヤーであるかどうかを確認します。粘着性手榴弾が衝突したbodyが実際に ``player_body`` である場合、リターンすることでそれを無視します。
zh_cn: 然后我们检查一下是否有东西分配给 ``player_body`` ，如果粘手榴弹碰撞的物体是投掷它的游戏角色。 如果粘手榴弹碰到的物体确实是'`player_body``，我们会通过返回来忽略它。

source: Next, we check if the sticky grenade has attached to something already or not.
de: Als nächstes prüfen wir, ob die Haftgranate bereits an etwas befestigt ist oder nicht.
es: A continuación, comprobamos si la granada pegajosa ya se ha adherido a algo o no.
fr: Ensuite, nous vérifions si la grenade collante s'est déjà attachée à quelque chose ou non.
ja: 次に、粘着性手榴弾が既に何かに固着しているかどうかを確認します。

source: If the sticky grenade is not attached, we then set ``attached`` to ``true`` so we know the sticky grenade has attached to something.
de: Wenn die Haftgranate nicht befestigt ist, dann setzen wir ``attached`` auf ``true``, damit wir wissen, dass die Haftgranate an etwas befestigt ist.
es: Si la granada pegajosa no está adherida, entonces ponemos ``attached`` a ``true`` para saber que la granada pegajosa se ha adherido a algo.
fr: Si la grenade collante n'est pas attachée, nous réglons alors ``attachée`` sur ``vraie`` de façon à savoir que la grenade collante est attachée à quelque chose.
ja: 粘着性手榴弾が固着していない場合は、\ ``attached`` を ``true`` に設定して、粘着性手榴弾が何かに固着したことを知らせます。

source: We then make a new :ref:`Spatial <class_Spatial>` node, and make it a child of the body the sticky grenade collided with. We then set the :ref:`Spatial <class_Spatial>`'s position to the sticky grenade's current global position.
de: Dann machen wir eine neue Node :ref:`Spatial <class_Spatial>`, und machen sie zu einem Kind des Körpers, mit dem die Haftgranate kollidierte. Dann setzen wir die Position :ref:`Spatial <class_Spatial>` auf die aktuelle globale Position der Haftgranate.
es: Luego hacemos un nuevo nodo :ref:`Spatial <class_Spatial>`, y lo convertimos en un hijo del cuerpo con el que chocó la granada pegajosa. Luego establecemos la posición de :ref:`Spatial <class_Spatial>` en la posición global actual de la granada pegajosa.
fr: Nous créons alors un nouveau nœud :ref:`Spatial <class_Spatial>` et on le met en tant qu'enfant du corps auquel s'est accroché la grenade. Nous assignons alors la position du :ref:`Spatial <class_Spatial>`à la position courante globale de la grenade.
ja: 次に、新しい :ref:`Spatial <class_Spatial>` ノードを作成し、粘着性手榴弾が衝突したbodyの子にします。次に、\ :ref:`Spatial <class_Spatial>` の位置を粘着性手榴弾の現在のグローバルポジションに設定します。
zh_cn: 然后我们创建一个新的 :ref:`Spatial <class_Spatial>` 节点，并使其成为粘性手榴弹与之碰撞的物体的子节点。 然后我们将 :ref:`Spatial <class_Spatial>的位置设置为粘性手榴弹当前的全球位置。

source: Because we've added the :ref:`Spatial <class_Spatial>` as a child of the body the sticky grenade has collided with, it will follow along with said body. We can then use this :ref:`Spatial <class_Spatial>` to set the sticky grenade's position, so it is always at the same position relative to the body it collided with.
de: Da wir das :ref:`Spatial <class_Spatial>` als Kind des Körpers hinzugefügt haben, mit dem die Haftgranate kollidiert ist, wird sie zusammen mit dem besagten Körper folgen. Wir können dann dieses :ref:`Spatial <class_Spatial>` verwenden, um die Position der Haftgranate so festzulegen, dass sie sich immer an der gleichen Position relativ zu dem Körper befindet, mit dem sie kollidiert ist.
es: Porque hemos añadido la :ref:`Spatial <class_Spatial>` como hijo del cuerpo con el que la granada pegajosa ha chocado, seguirá junto con dicho cuerpo. Podemos usar este :ref:`Space <class_Spatial>` para establecer la posición de la granada pegajosa, de modo que siempre estará en la misma posición relativa al cuerpo con el que ha chocado.
fr: Parce que nous avons ajouté le :ref:`Spatial <class_Spatial>` en tant qu'enfant du corps attaché à la grenade collante, celui-ci va suivre le corps. Nous pouvons alors utiliser ce :ref:`Spatial <class_Spatial>` pour assigner la position de la grenade collante de façon à ce qu'elle ait tout le temps la même position relative au corps avec lequel elle est entrée en contact.
ja: :ref:`Spatial <class_Spatial>` を粘着性手榴弾が衝突したbodyの子として追加したため、そのbodyとひと続きになります。次に、この :ref:`Spatial <class_Spatial>` を使用して、粘着性手榴弾の位置を設定することができるので、衝突したbodyに対して常に同じ位置に配置されます。
zh_cn: 因为我们已经添加了 :ref:`Spatial <class_Spatial>` 作为粘性手榴弹碰撞的物体的一个子节点，它将跟随所述物体。 然后我们可以使用它 :ref:`Spatial <class_Spatial>` 来设置粘性手榴弹的位置，因此它总是在相对于它碰撞的物体的相同位置。

source: We then disable ``rigid_shape`` so the sticky grenade is not constantly moving whatever body it has collided with. Finally, we set our mode to ``MODE_STATIC`` so the grenade does not move.
de: Dann schalten wir die ``rigid_shape`` aus, damit die Haftgranate sich nicht ständig bewegt, mit welchem Körper sie auch immer kollidiert ist. Schließlich stellen wir unseren Modus auf ``MODE_STATIC``, damit sich die Granate nicht bewegt.
es: Luego deshabilitamos la ``rigid_shape`` para que la granada pegajosa no se mueva constantemente con cualquier cuerpo con el que haya chocado. Por último, fijamos nuestro modo en ``MODE_STATIC`` para que la granada no se mueva.
fr: Nous désactivons ensuite la ``rigid_shape`` de façon à ce que la grenade collante ne déplace pas constamment l’objet avec lequel elle est en contact. Enfin, nous mettons le mode à ``MODE_STATIC`` afin que la grenade ne bouge pas.
ja: 次に、\ ``rigid_shape`` を無効にして、粘着性手榴弾が衝突したbodyを絶えず動かしてしまわないようにします。最後に、手榴弾が動かないようにモードを ``MODE_STATIC`` に設定します。
zh_cn: 然后我们禁用 ``rigid_shape`` ，这样粘手榴弹就不会一直移动它碰到的任何物体。 最后，我们将模式设置为“MODE_STATIC”，因此手榴弹不会移动。

source: Finally, lets go over the few changes in ``_process``.
de: Lassen Sie uns schließlich die wenigen Änderungen im ``_process`` durchgehen.
es: Finalmente, repasemos los pocos cambios en el ``_process``.
fr: Enfin, passons en revue les quelques changements dans ``_process``.
ja: 最後に、\ ``_process`` のいくつかの変更を見ていきましょう。
zh_cn: 最后，让我们回顾一下 ``_process`` 中的一些变化。

source: Now we're checking to see if the sticky grenade is attached right at the top of ``_process``.
de: Jetzt prüfen wir, ob die Haftgranate ganz oben auf dem ``_process`` angebracht ist.
es: Ahora estamos comprobando si la granada pegajosa está pegada justo en la parte superior del ``_process``.
fr: Nous vérifions désormais si la grenade est attachée ou non tout en haut de la fonction ``_process``.
ja: ``_process`` の一番上で、粘着性手榴弾が 固着してるかどうかを確認しています。
zh_cn: 现在我们正在检查粘性手榴弹是否附在“_process`”的顶部。
