Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_one.po
Languages: es, fr, zh_cn

source: First, we define some class variables to dictate how our player will move about the world.
es: Primero, definiremos algunas variables de clase para dictar cómo nuestro jugador se moverá por el mundo.
fr: Tout d'abord, nous définissons quelques variables de classe pour dicter comment notre joueur va se déplacer dans le monde.
zh_cn: 首先，我们定义一些类变量来决定我们的游戏角色将如何在世界范围内移动。

source: Throughout this tutorial, **variables defined outside functions will be referred to as "class variables"**. This is because we can access any of these variables from any place in the script.
es: A lo largo de este tutorial, las **variables definidas fuera de las funciones serán referidas como "variables de clase "**. Esto se debe a que podemos acceder a cualquiera de estas variables desde cualquier lugar del script.
fr: Tout au long de ce tutoriel, **les variables définies à l'extérieur de fonctions seront appelées "variables de classe"**. C'est parce que nous avons accès à ces variables à partir de n'importe quel endroit dans le script.
zh_cn: 在本教程中， **函数外部定义的变量将被称为“类变量”** 。 这是因为我们可以从脚本中的任何位置访问这些变量中的任何一个。

source: Let's go through each of the class variables:
es: Vamos a repasar cada una de las variables de clase:
fr: Passons en revue chacune des variables de classe :
zh_cn: 让我们来看看每个类变量:

source: ``GRAVITY``: How strong gravity pulls us down.
es: "GRAVEDAD": Como la fuerte gravedad nos empuja hacia abajo.
fr: ``GRAVITY`` : Comme la gravité nous tire vers le bas.
zh_cn: ``GRAVITY``:强大的重力让我们失望。

source: ``vel``: Our :ref:`KinematicBody <class_KinematicBody>`'s velocity.
es: ``vel``: nuestra velocidad para el :ref`KinematicBody <class_KinematicBody>`.
fr: ``vel`` : la vélocité de notre :ref:`CinematicBody <class_KinematicBody>`.
zh_cn: ``vel``:我们的 :ref:`KinematicBody <class_KinematicBody>` 的速度。

source: ``MAX_SPEED``: The fastest speed we can reach. Once we hit this speed, we will not go any faster.
es: "MAX_SPEED": La velocidad más rápida que podemos alcanzar. Una vez que alcancemos esta velocidad, no podremos aumentarla.
fr: ``MAX_SPEED`` : La vitesse la plus rapide que nous puissions atteindre. Une fois que nous aurons atteint cette vitesse, nous n'irons pas plus vite.
zh_cn: ``MAX_SPEED``:我们可以达到的最快速度。 一旦我们达到这个速度，我们就不会更快。

source: ``JUMP_SPEED``: How high we can jump.
es: ``JUMP_SPEED``: Qué tan alto podemos saltar.
fr: ``JUMP_SPEED`` : À quelle hauteur nous pouvons sauter.
zh_cn: ``JUMP_SPEED``:我们能跳得多高。

source: ``ACCEL``: How quickly we accelerate. The higher the value, the sooner we get to max speed.
es: "ACCEL": La rapidez con que aceleramos. Cuanto más alto sea el valor, más rápido llegaremos a la velocidad máxima.
fr: ``ACCEL`` : L'accélération. Plus la valeur est élevée, plus vite nous atteignons la vitesse maximale.

source: ``DEACCEL``: How quickly we are going to decelerate. The higher the value, the sooner we will come to a complete stop.
es: "DEACCEL": Qué tan rápido vamos a frenarnos. Cuanto más alto sea el valor, antes nos detendremos por completo.
fr: ``DEACCEL`` : La décéléreration. Plus la valeur est élevée, plus vite nous nous arrêterons complètement.

source: ``MAX_SLOPE_ANGLE``: The steepest angle our :ref:`KinematicBody <class_KinematicBody>` will consider as a 'floor'.
es: "ÁNGULO DE INCLINACIÓN MÁXIMA": El ángulo más pronunciado que nuestro :ref:``KinematicBody <class_KinematicBody>` considerará como un 'piso'.
fr: ``MAX_SLOPE_ANGLE``: L'angle le plus raide que notre :ref:`KinematicBody <class_KinematicBody>` considère comme un 'plancher'.
zh_cn: ``MAX_SLOPE_ANGLE``:我们最陡的角度 :ref:`KinematicBody <class_KinematicBody>` 将被视为'floor'。

source: ``camera``: The :ref:`Camera <class_Camera>` node.
es: ``camara``: El nodo :ref:`Camera <class_Camera>`.
fr: ``camera`` : Le nœud :ref:`Camera <class_Camera>`.
zh_cn: ``camera``: :ref:`Camera <class_Camera>` 节点。

source: ``rotation_helper``: A :ref:`Spatial <class_Spatial>` node holding everything we want to rotate on the X axis (up and down).
es: ``rotation_helper``: Un nodo :ref:`Spatial <class_Spatial>` que contiene todo lo que queremos que rote en el eje X (arriba y abajo).
fr: ``rotation_helper`` : Un nœud :ref:`Spatial <class_Spatial>` contenant tout ce que nous voulons faire tourner sur l'axe X (haut et bas).
zh_cn: ``rotation_helper``:一个 :ref:`Spatial <class_Spatial>` 节点，包含我们想要在X轴上旋转的所有内容(向上和向下)。

source: ``MOUSE_SENSITIVITY``: How sensitive the mouse is. I find a value of ``0.05`` works well for my mouse, but you may need to change it based on how sensitive your mouse is.
es: "SENSIBILIDAD AL RATÓN": Lo sensible que es el ratón. Encuentro que un valor de "0.05" funciona bien para mi ratón, pero puede que necesites cambiarlo basado en lo sensible que es tu ratón.
fr: ``MOUSE_SENSITIVITY`` : La sensibilité de la souris. Je trouve qu'une valeur de ``0.05`` fonctionne bien pour ma souris, mais vous devrez peut-être la modifier en fonction de la sensibilité de votre souris.
zh_cn: ``MOUSE_SENSITIVITY``:鼠标的敏感程度。 我发现``0.05``的值适用于我的鼠标，但您可能需要根据鼠标的敏感程度进行更改。

source: You can tweak many of these variables to get different results. For example, by lowering ``GRAVITY`` and/or increasing ``JUMP_SPEED`` you can get a more 'floaty' feeling character. Feel free to experiment!
es: Puedes ajustar muchas de estas variables para obtener resultados diferentes. Por ejemplo, bajando ``GRAVEDAD`` y/o aumentando ``JUMP_SPEED`` puedes obtener un carácter con sensación flotante. Siéntete libre de experimentar!
fr: Vous pouvez ajuster plusieurs de ces variables pour obtenir des résultats différents. Par exemple, en diminuant ``GRAVITY`` et/ou en augmentant ``JUMP_SPEED``vous pouvez obtenir un personnage plus 'flottant'. N'hésitez pas à expérimenter !
zh_cn: 您可以调整其中的许多变量以获得不同的结果。 例如，通过降低 ``GRAVITY`` 和/或增加 ``JUMP_SPEED`` ，您可以获得一个更“浮动”的感觉角色。 随意尝试！

source: You may have noticed that ``MOUSE_SENSITIVITY`` is written in all caps like the other constants, but ``MOUSE_SENSITIVITY`` is not a constant.
es: Habrás notado que ``SENSIBILIDAD DE RATON`` está escrita en mayúsculas como las otras constantes, pero la ``SENSIBILIDAD DE RATON`` no es una constante.
fr: Vous avez peut-être remarqué que ``MOUSE_SENSITIVITY`` est écrit en majuscules comme les autres constantes, mais ``MOUSE_SENSITIVITY`` n'est pas une constante.
zh_cn: 您可能已经注意到 ``MOUSE_SENSITIVITY`` 写在所有大写字母中，就像其他常量一样，但 ``MOUSE_SENSITIVITY`` 不是常量。

source: The reason behind this is we want to treat it like a constant variable (a variable that cannot change) throughout our script, but we want to be able to change the value later when we add customizable settings. So, in an effort to remind ourselves to treat it like a constant, it's named in all caps.
es: La razón de esto es que queremos tratarlo como una variable constante (una variable que no puede cambiar) a lo largo de todo nuestro script, pero queremos poder cambiar el valor más tarde cuando agreguemos ajustes personalizables. Así que, en un esfuerzo por recordarnos a nosotros mismos tratarla como una constante, se nombra en mayúsculas.
fr: La raison est que nous voulons le traiter comme une variable constante (une variable qui ne peut pas changer) tout au long de notre script, mais nous voulons être en mesure de changer la valeur plus tard lorsque nous ajoutons des paramètres personnalisables. Donc, dans un effort pour nous rappeler de la traiter comme une constante, elle est nommée en majuscules.
zh_cn: 这背后的原因是我们希望在整个脚本中将其视为一个常量变量(一个无法更改的变量)，但我们希望能够在以后添加可自定义设置时更改该值。 因此，为了提醒自己将其视为一个常量，它以全部大写命名。

source: Now let's look at the ``_ready`` function:
es: Ahora veamos la función ``_ready``:
fr: Voyons maintenant la fonction ``_ready`` :
zh_cn: 现在让我们看一下 ``_ready`` 函数:

source: First we get the ``camera`` and ``rotation_helper`` nodes and store them into their variables.
es: Primero obtenemos los nodos de la ``camara`` y de la ``rotation_helper`` y los almacenamos en sus variables.
fr: On obtient d'abord les nœuds ``camera`` et ``rotation_helper`` et on les stocke dans leurs variables.
zh_cn: 首先，我们获得“camera”和“rotation_helper”节点，并将它们存储到它们的变量中。

source: Then we need to set the mouse mode to captured, so the mouse cannot leave the game window.
es: Entonces tenemos que establecer el modo de ratón a capturado, para que el ratón no pueda salir de la ventana del juego.
fr: Ensuite, nous devons régler le mode de capture de la souris, de sorte que la souris ne puisse pas quitter la fenêtre de jeu.

source: This will hide the mouse and keep it at the center of the screen. We do this for two reasons: The first reason being we do not want the player to see their mouse cursor as they play.
es: Esto esconderá el ratón y lo mantendrá en el centro de la pantalla. Hacemos esto por dos razones: La primera razón es que no queremos que el jugador vea el cursor del ratón mientras juega.
fr: Ceci cachera la souris et la gardera au centre de l'écran. Nous le faisons pour deux raisons : La première raison étant que nous ne voulons pas que le joueur voit le curseur de sa souris en jouant.

source: The second reason is because we do not want the cursor to leave the game window. If the cursor leaves the game window there could be instances where the player clicks outside the window, and then the game would lose focus. To assure neither of these issues happens, we capture the mouse cursor.
es: La segunda razón es porque no queremos que el cursor salga de la ventana del juego. Si el cursor sale de la ventana del juego podría haber casos en los que el jugador hace clic fuera de la ventana, y entonces el juego perdería el foco. Para asegurarnos de que ninguno de estos problemas ocurra, capturamos el cursor del ratón.
fr: La deuxième raison est que nous ne voulons pas que le curseur quitte la fenêtre de jeu. Si le curseur quitte la fenêtre de jeu, il peut y avoir des cas où le joueur clique à l'extérieur de la fenêtre, et alors le jeu perdrait le focus. Pour s'assurer qu'aucun de ces problèmes ne se produise, nous capturons le curseur de la souris.

source: See :ref:`Input documentation <class_Input>` for the various mouse modes. We will only be using ``MOUSE_MODE_CAPTURED`` and ``MOUSE_MODE_VISIBLE`` in this tutorial series.
es: Ver :ref:`Input documentation <class_Input>` para los distintos modos de ratón. Sólo usaremos "MOUSE_MODE_CAPTURED" y "MOUSE_MODE_VISIBLE" en esta serie de tutoriales.
fr: Voir :ref:`Documentation d'entrée <class_Input>` pour les différents modes de souris. Nous utiliserons seulement ``MOUSE_MODE_CAPTURED``et ``MOUSE_MODE_VISIBLE`` dans cette série de tutoriels.

source: Next let's take a look at ``_physics_process``:
es: A continuación, echemos un vistazo al ``-physics_process``:
fr: Voyons maintenant ``_processus_physique`` :
zh_cn: 接下来让我们来看看``_physics_process``:

source: All we're doing in ``_physics_process`` is calling two functions: ``process_input`` and ``process_movement``.
es: Todo lo que estamos haciendo en ``_physics_process`` es llamar a dos funciones: ``process_input`` and ``process_movement``.
fr: Tout ce que nous faisons dans ``_physics_process``` est d'appeler deux fonctions : ``process_input`` et ``process_movement``.
zh_cn: 我们在 ``_physics_process`` 中所做的就是调用两个函数: ``process_input`` 和 ``process_movement`` 。

source: ``process_input`` will be where we store all the code relating to player input. We want to call it first, before anything else, so we have fresh player input to work with.
es: ``process_input`` será donde almacenaremos todo el código relacionado con la entrada del jugador. Queremos llamarlo primero, antes que nada, para tener una nueva entrada del jugador con la que trabajar.
fr: ``process_input`` sera l'endroit où nous stockerons tout le code relatif aux entrées joueur. Nous voulons l'appeler d'abord, avant toutes choses, pour que nous puissions travailler avec les dernière entrées joueur.

source: ``process_movement`` is where we'll send all the data necessary to the :ref:`KinematicBody <class_KinematicBody>` so it can move through the game world.
es: ``process_movement`` es donde enviaremos todos los datos necesarios al :ref:`KinematicBody <class_KinematicBody>` para que pueda moverse por el mundo del juego.
fr: ``process_movement`` est l'endroit où nous enverrons toutes les données nécessaires au :ref:`KinematicBody <class_KinematicBody>` pour lui permettre de se déplacer dans le monde du jeu.

source: Let's look at ``process_input`` next:
es: Veamos el ``process_input`` a continuación:
fr: Regardons ``process_input`` suivant :
zh_cn: 让我们看看下面的``process_input``:

source: First we set ``dir`` to an empty :ref:`Vector3 <class_Vector3>`.
es: Primero ponemos ``dir`` a un :ref:`Vector3 <class_Vector3>`.
fr: Tout d'abord, nous réglons ``dir`` à une :ref:`Vector3 <class_Vector3>` vide.
zh_cn: 首先我们将 ``dir`` 设置为空 :ref:`Vector3 <class_Vector3>`。

source: ``dir`` will be used for storing the direction the player intends to move towards. Because we do not want the player's previous input to effect the player beyond a single ``process_movement`` call, we reset ``dir``.
es: ``dir`` se usará para almacenar la dirección hacia la que el jugador pretende moverse. Como no queremos que la entrada previa del jugador afecte al jugador más allá de una simple llamada de ``process_movement``, reiniciamos el ``dir``.
fr: ``dir``` sera utilisé pour mémoriser la direction vers laquelle le joueur a l'intention de se déplacer. Parce que nous ne voulons pas que l'entrée précédente du joueur affecte le joueur au-delà d'un seul appel de ``process_movement``, nous réinitialisons ``dir``.
zh_cn: ``dir`` 将用于存储游戏角色打算移动的方向。 因为我们不希望游戏角色以前的输入影响游戏角色超过单个 ``process_movement`` 调用，所以我们重置 ``dir`` 。

source: Next we get the camera's global transform and store it as well, into the ``cam_xform`` variable.
es: Luego obtenemos la transformada global de la cámara y la almacenamos también, en la variable ``cam_xform``.
fr: Ensuite, nous récupérons la transformation globale de la caméra et la stockons également, dans la variable ``cam_xform``.
zh_cn: 接下来，我们获取相机的全局变换并将其存储到 ``cam_xform`` 变量中。

source: The reason we need the camera's global transform is so we can use its directional vectors. Many have found directional vectors confusing, so let's take a second to explain how they work:
es: La razón por la que necesitamos la transformada global de la cámara es para poder usar sus vectores direccionales. Muchos han encontrado los vectores direccionales confusos, así que vamos a tomarnos un momento para explicar cómo funcionan:
fr: La raison pour laquelle nous avons besoin de la transformation globale de la caméra est que nous puissions utiliser ses vecteurs directionnels. Beaucoup ont trouvé les vecteurs directifs déroutants, alors prenons une seconde pour expliquer comment ils fonctionnent :
zh_cn: 我们需要相机的全局变换的原因是我们可以使用它的方向向量。 许多人发现方向向量令人困惑，所以让我们花一点时间来解释它们是如何工作的:

source: World space can be defined as: The space in which all objects are placed in, relative to a constant origin point. Every object, no matter if it is 2D or 3D, has a position in world space.
es: El espacio mundial puede definirse como: El espacio en el que todos los objetos se colocan, en relación con un punto de origen constante. Cada objeto, no importa si es 2D o 3D, tiene una posición en el espacio mundial.
fr: L'espace mondial peut être défini comme il suit : L'espace dans lequel tous les objets sont placés par rapport à un point d'origine constant. Chaque objet, qu'il soit en 2D ou en 3D, a une position dans l'espace mondial.
zh_cn: 世界空间可以定义为:相对于恒定原点，放置所有对象的空间。 每个物体，无论是2D还是3D，都在世界空间中占有一席之地。

source: To put it another way: world space is the space in a universe where every object's position, rotation, and scale can be measured by a single, known, fixed point called the origin.
es: Para decirlo de otra manera: el espacio mundial es el espacio en un universo donde la posición, rotación y escala de cada objeto puede ser medida por un único punto fijo conocido llamado el origen.
fr: En d'autres termes, l'espace mondial est l'espace dans un univers où la position, la rotation et l'échelle de chaque objet peuvent être mesurées par un seul point fixe connu, appelé origine.
zh_cn: 换句话说:世界空间是宇宙中的空间，每个物体的位置，旋转和比例都可以通过称为原点的单个已知固定点来测量。

source: In Godot, the origin is at position ``(0, 0, 0)`` with a rotation of ``(0, 0, 0)`` and a scale of ``(1, 1, 1)``.
es: En Godot, el origen está en la posición ``(0, 0, 0)`` con una rotación de ``(0, 0, 0)`` y una escala de ``(1, 1, 1)``.
fr: Dans Godot, l’origine est à la position ``(0, 0, 0)`` avec une rotation de ``(0, 0, 0)`` et une échelle de``(1, 1, 1)``.
zh_cn: 在Godot中，原点位于``(0,0,0)``，旋转为``(0,0,0)``，标度为``(1,1,1)``。

source: When you open up the Godot editor and select a :ref:`Spatial <class_Spatial>` based node, a gizmo pops up. Each of the arrows points using world space directions by default.
es: Cuando abres el editor de Godot y seleccionas un nodo basado en :ref:`Spatial <class_Spatial>`, aparece un gizmo. Cada una de las flechas usando las direcciones del espacio mundial por defecto.
fr: Lorsque vous ouvrez l'éditeur Godot et sélectionnez un nœud basé sur :ref:`Spatial <class_Spatial>`, un gadget apparaît. Chacune des flèches pointe en utilisant les directions de l'espace mondial par défaut.
zh_cn: 当您打开Godot编辑器并选择一个 :ref:`Spatial <class_Spatial>` 基于节点时，会弹出一个Gizmo。 默认情况下，每个箭头都使用世界空间方向指向。

source: If you want to move using the world space directional vectors, you'd do something like this:
es: Si quieres moverte usando los vectores direccionales espaciales del mundo, haz algo como esto:
fr: Si vous voulez vous déplacer en utilisant les vecteurs directionnels de l'espace mondial, vous feriez quelque chose comme ceci :
zh_cn: 如果您想使用世界空间方向向量移动，您会做这样的事情:

source: Notice how we do not need to do any calculations to get world space directional vectors. We can define a few :ref:`Vector3 <class_Vector3>` variables and input the values pointing in each direction.
es: Fíjense que no necesitamos hacer ningún cálculo para obtener los vectores direccionales del espacio mundial. Podemos definir unas pocas variables :ref:`Vector3 <class_Vector3>` e introducir los valores que apuntan en cada dirección.
fr: Remarquez que nous n'avons pas besoin de faire de calculs pour obtenir des vecteurs directionnels de l'espace mondial. On peut définir quelques variables :ref:`Vector3 <class_Vector3_Vector3>` et entrer les valeurs pointant dans chaque direction.
zh_cn: 请注意我们如何不需要进行任何计算来获得世界空间方向向量。 我们可以定义一些 :ref:`Vector3 <class_Vector3>` 变量并输入指向每个方向的值。

source: Here is what world space looks like in 2D:
es: Así es como se ve el espacio mundial en 2D:
fr: Voici à quoi ressemble l'espace mondial en 2D :
zh_cn: 以下是2D中的世界空间:

source: The following images are just examples. Each arrow/rectangle represents a directional vector
es: Las siguientes imágenes son sólo ejemplos. Cada flecha/rectángulo representa un vector direccional
fr: Les images suivantes ne sont que des exemples. Chaque flèche/rectangle représente un vecteur directionnel
zh_cn: 以下图片仅为示例。 每个箭头/矩形表示方向向量

source: And here is what it looks like for 3D:
es: Y esto es lo que parece en 3D:
fr: Et voici à quoi cela ressemble pour la 3D :
zh_cn: 这就是3D的样子:

source: Notice how in both examples, the rotation of the node does not change the directional arrows. This is because world space is a constant. No matter how you translate, rotate, or scale an object, world space will *always point in the same direction*.
es: Observa cómo en ambos ejemplos, la rotación del nodo no cambia las flechas direccionales. Esto se debe a que el espacio del mundo es una constante. No importa cómo se traslade, rote o escale un objeto, el espacio mundial *siempre apuntará en la misma dirección*.
fr: Notez que dans les deux exemples, la rotation du nœud ne change pas les flèches directionnelles. C'est parce que l'espace mondial est une constante. Quelle que soit la façon dont vous bougez, faites pivoter ou mettez à l'échelle un objet, l'espace du monde *indiquera toujours la même direction*.
zh_cn: 请注意，在两个示例中，节点的旋转不会更改方向箭头。 这是因为世界空间是一个常数。 无论您如何平移，旋转或缩放对象，世界空间都将*始终指向相同的方向*。

source: Local space is different, because it takes the rotation of the object into account.
es: El espacio local es diferente, porque tiene en cuenta la rotación del objeto.
fr: L'espace local est différent, car il prend en compte la rotation de l'objet.
zh_cn: 局部空间不同，因为它考虑了对象的旋转。

source: Local space can be defined as follows: The space in which an object's position is the origin of the universe. Because the position of the origin can be at ``N`` many locations, the values derived from local space change with the position of the origin.
es: El espacio local puede definirse de la siguiente manera: El espacio en el que la posición de un objeto es el origen del universo. Debido a que la posición del origen puede estar en ``N`` muchos lugares, los valores derivados del espacio local cambian con la posición del origen.
fr: L'espace local peut être défini comme il suit : L'espace dans lequel la position d'un objet est à l'origine de l'univers. Comme la position de l'origine peut se trouver à de nombreux endroits, les valeurs dérivées de l'espace local changent en fonction de la position de l'origine.

source: This stack overflow question has a much better explanation of world space and local space.
fr: Cette question sur stack overflow a une bien meilleure explication de l'espace mondial et de l'espace local.
zh_cn: 这个堆栈溢出问题对世界空间和局部空间有更好的解释。

source: https://gamedev.stackexchange.com/questions/65783/what-are-world-space-and-eye-space-in-game-development (Local space and eye space are essentially the same thing in this context)
es: https://gamedev.stackexchange.com/questions/65783/what-are-world-space-and-eye-space-in-game-development (El espacio local y el espacio ocular son esencialmente lo mismo en este contexto)
fr: https://gamedev.stackexchange.com/questions/65783/what-are-world-space-and-eye-space-in-game-development (L'espace local et l'espace oculaire sont essentiellement la même chose dans ce contexte)
zh_cn: https://gamedev.stackexchange.com/questions/65783/what-are-world-space-and-eye-space-in-game-development(在这种情况下，局部空间和眼睛空间基本相同)

source: To get a :ref:`Spatial <class_Spatial>` node's local space, we need to get its :ref:`Transform <class_Transform>`, so then we can get the :ref:`Basis <class_Basis>` from the :ref:`Transform <class_Transform>`.
es: Para obtener el espacio local de un nodo :ref:`Spatial <class_Spatial>`, necesitamos obtener su :ref:`Transform <class_Transform>`, así que podemos obtener el :ref:`Basis <class_Basis>` del :ref:`Transform <class_Transform>`.
fr: Pour obtenir l'espace local d'un nœud :ref:`Spatial <class_Spatial>`, nous devons obtenir son :ref:`Transform <class_Transform>>`, afin de pouvoir obtenir le :ref:`Basis <class_Basis>` depuis le :ref:`Transform <class_Transform>`.
zh_cn: 要获得 :ref:`Spatial <class_Spatial>` 节点的局部空间，我们需要得到它 :ref:`Transform <class_Transform>` ，这样我们就可以从 :ref:`Transform <class_Transform>` 得到 :ref:`Basis <class_Basis>` 。

source: Each :ref:`Basis <class_Basis>` has three vectors: ``X``, ``Y``, and ``Z``. Each of those vectors point towards each of the local space vectors coming from that object.
es: Cada :ref:`Base <clase_Base>` tiene tres vectores: ``X``, ``Y`` y ``Z``. Cada uno de esos vectores apunta hacia cada uno de los vectores espaciales locales que vienen de ese objeto.
fr: Chaque :ref:`Base <class_Basis>` a trois vecteurs: ``X``, ``Y`` et ``Z``. Chacun de ces vecteurs pointent vers chacun des vecteurs de l'espace local venant de cet objet.
zh_cn: 每个 :ref:`Basis <class_Basis>` 有三个向量: ``X`` ， ``Y`` 和 ``Z``。 这些向量中的每一个指向来自该对象的每个局部空间向量。
