Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_one.po
Languages: es, fr, zh_cn

source: Part 1
es: Parte 1
fr: Partie 1
zh_cn: 第1部分

source: Tutorial introduction
es: Introducción al tutorial
fr: Tutoriel d'introduction
zh_cn: 教程介绍

source: This tutorial series will show you how to make a single player FPS game.
es: Esta serie de tutoriales te mostrará cómo crear un juego FPS para un solo jugador.
fr: Cette série de tutoriels vous montrera comment créer un jeu FPS à un seul joueur.
zh_cn: 本教程系列将向您展示如何制作单人FPS游戏。

source: Throughout the course of this tutorial series, we will cover how:
es: A lo largo del curso de esta serie de tutoriales, cubriremos cómo:
fr: Tout au long de cette série de tutoriels, nous vous expliquerons comment :
zh_cn: 在本系列教程的整个过程中，我们将介绍如何:

source: To make a first person character that can move, sprint, and jump.
es: Hacer un personaje en primera persona que pueda moverse, correr y saltar.
fr: Faire un personnage à la première personne qui peut se déplacer, sprinter et sauter.
zh_cn: 制作可以移动，冲刺和跳跃的第一人称角色。

source: To make a simple animation state machine for handling animation transitions.
es: Hacer una máquina de estado de animación simple para manejar transiciones de animación.
fr: Pour faire une machine d'état d'animation simple pour gérer les transitions d'animation.
zh_cn: 制作一个简单的动画状态机来处理动画过渡。

source: To add three weapons to the first person character, each using a different way to handle bullet collisions:
es: Añadir tres armas al personaje en primera persona, cada una usando una forma diferente de manejar las colisiones de balas:
fr: Pour ajouter trois armes au personnage à la première personne, chacune utilisant une façon différente de gérer les collisions de balles :
zh_cn: 要向第一个人物角色添加三个武器，每个武器使用不同的方式来处理子弹碰撞:

source: A knife (using an :ref:`Area <class_Area>`)
es: Un cuchillo (usando un :ref:`Area <class_Area>`)
fr: Un couteau (en utilisant un :ref:`Area <class_Area>`)
zh_cn: 一把刀(使用 :ref:`Area <class_Area>` )

source: A pistol (Bullet scenes)
es: Una pistola (Escenas de bala)
fr: Un pistolet (scènes de balles)
zh_cn: 手枪(子弹场景)

source: A rifle (using a :ref:`Raycast <class_Raycast>`)
es: Un rifle (usando un :ref:`Raycast <class_Raycast>`)
fr: Un fusil (utilisant un :ref:`Raycast <class_Raycast>`)
zh_cn: 步枪(使用 :ref:`Raycast <class_Raycast>` )

source: To add two different types of grenades to the first person character:
es: Añadir dos tipos diferentes de granadas al personaje en primera persona:
fr: Ajouter deux types différents de grenades au personnage :
zh_cn: 要为第一个人角色添加两种不同类型的手榴弹:

source: A normal grenade
es: Una granada normal
fr: Une grenade normale
zh_cn: 正常的手榴弹

source: A sticky grenade
es: Una granada pegajosa
fr: Une grenade collante
zh_cn: 粘手榴弹

source: To add the ability to grab and throw :ref:`RigidBody <class_RigidBody>` nodes
es: Añadir la habilidad de agarrar y lanzar nodos :ref:`RigidBody <class_RigidBody>`
fr: Ajouter la possibilité de saisir et de lancer des nœuds :ref:`RigidBody <class_RigidBody>`
zh_cn: 添加抓取和抛出的能力 :ref:`RigidBody <class_RigidBody>` 节点

source: To add joypad input for the player
es: Añadir una entrada de mando (joypad) para el jugador
fr: Ajouter une entrée joypad pour le joueur
zh_cn: 为游戏角色添加游戏手柄输入

source: To add ammo and reloading for all weapons that consume ammo.
es: Añadir munición y recargar todas las armas que consumen munición.
fr: Ajouter des munitions et recharger toutes les armes qui consomment des munitions.
zh_cn: 为所有消耗弹药的武器添加弹药和重装。

source: To add ammo and health pick ups
es: Añadir munición y recuperadores de salud
fr: Ajouter le ramassage des munitions et de santé
zh_cn: 添加弹药和健康拾取

source: In two sizes: big and small
es: En dos tamaños: grande y pequeño
fr: En deux tailles : grande et petite
zh_cn: 有两种大小:大小

source: To add an automatic turret
es: Añadir una torreta automática
fr: Ajouter une tourelle automatique
zh_cn: 添加自动炮塔

source: That can fire using bullet objects or a :ref:`Raycast <class_Raycast>`
es: Que puede disparar usando objetos bala o un :ref:`Raycast <class_Raycast>
fr: Qui peut tirer en utilisant des objets bullet ou un :ref:`Raycast <class_Raycast>`
zh_cn: 这可以使用bullet对象或 :ref:`Raycast <class_Raycast>` 来触发

source: To add targets that break when they've taken enough damage
es: Añadir objetivos que se rompen cuando han recibido suficiente daño
fr: Ajouter des cibles qui se brisent quand elles ont subi suffisamment de dégâts
zh_cn: 添加在受到足够伤害时破坏的目标

source: To add sounds that play when the guns fire.
es: Añadir sonidos que suenan cuando las armas disparan.
fr: Ajouter des sons quand les armes à feu tirent.
zh_cn: 添加枪支发射时发出的声音。

source: To add a simple main menu:
es: Añadir un menú principal simple:
fr: Ajouter un menu principal simple :
zh_cn: 要添加简单的主菜单:

source: With an options menu for changing how the game runs
es: Con un menú de opciones para cambiar el funcionamiento del juego
fr: Avec un menu d'options pour changer le déroulement du jeu
zh_cn: 使用选项菜单更改游戏的运行方式

source: With a level select screen
es: Con una pantalla de selección de nivel
fr: Avec un écran de sélection de niveau
zh_cn: 使用级别选择屏幕

source: To add a universal pause menu we can access anywhere
es: Añadir un menú de pausa universal que podemos acceder desde cualquier lugar
fr: Ajouter un menu de pause universel, auquel nous pouvons accéder depuis n'importe quel endroit
zh_cn: 要添加通用暂停菜单，我们可以随时随地访问

source: While this tutorial can be completed by beginners, it is highly advised to complete :ref:`doc_your_first_game`, if you are new to Godot and/or game development **before** going through this tutorial series.
es: Aunque este tutorial puede ser completado por principiantes, es altamente aconsejable completar :ref:`doc_your_first_game`, si eres nuevo en Godot y/o en el desarrollo de juegos **antes de** pasar por esta serie de tutoriales.
fr: Bien que ce tutoriel puisse être complété par des débutants, il est fortement conseillé d'avoir fini :ref:`doc_your_first_game`, si vous êtes nouveau dans Godot et/ou dans le développement de jeu **avant** de suivre ce tutoriel.
zh_cn: 虽然这个教程可以由初学者完成，但强烈建议完成 :ref:`doc_your_first_game` ，如果您是新手Godot和/或游戏开发 **之前** 通过本教程系列。

source: Remember: Making 3D games is much harder than making 2D games. If you do not know how to make 2D games, you will likely struggle making 3D games.
es: Recuerda: Hacer juegos 3D es mucho más difícil que hacer juegos 2D. Si no sabes cómo crear juegos 2D es probable que tengas dificultades para desarrollar juegos 3D.
fr: Rappelez-vous: faire des jeux 3D est beaucoup plus difficile que de faire des jeux 2D. Si vous ne savez pas comment faire des jeux 2D, vous aurez probablement du mal à faire des jeux en 3D.

source: This tutorial assumes you have experience working with the Godot editor, basic programming experience in GDScript, and basic experience in game development.
es: Este tutorial asume que tienes experiencia trabajando con el editor de Godot, que tienes experiencia básica de programación en GDScript y experiencia básica en el desarrollo de juegos.
fr: Ce tutoriel suppose que vous avez de l'expérience avec l'éditeur Godot, une expérience de base en programmation GDScript, et une expérience de base en développement de jeux.

source: You can find the start assets for this tutorial here: :download:`Godot_FPS_Starter.zip <files/Godot_FPS_Starter.zip>`
es: Puedes encontrar los recursos de inicio para este tutorial aquí: :download:`Godot_FPS_Starter.zip <files/Godot_FPS_Starter.zip>`
fr: Vous pouvez trouver les assets pour débuter ce tutoriel ici : :download:`Godot_FPS_Starter.zip <files/Godot_FPS_Starter.zip>`
zh_cn: 您可以在这里找到本教程的起始资源: :download:`Godot_FPS_Starter.zip <files / Godot_FPS_Starter.zip>`

source: The provided starter assets contain an animated 3D model, a bunch of 3D models for making levels, and a few scenes already configured for this tutorial.
es: Los recursos de inicio proporcionados contienen un modelo 3D animado, un montón de modelos 3D para hacer niveles y algunas escenas ya configuradas para este tutorial.
fr: Les assets de démarrage fournis contiennent un modèle 3D animé, un ensemble de modèles 3D pour créer des niveaux et quelques scènes déjà configurées pour ce tutoriel.
zh_cn: 提供的初始化资源包含动画3D模型，一组用于制作关卡的3D模型，以及已为本教程配置的一些场景。

source: All assets provided (unless otherwise noted) were originally created by TwistedTwigleg, with changes/additions by the Godot community. All original assets provided for this tutorial are released under the ``MIT`` license.
es: Todos los recursos proporcionados (a menos que se indique lo contrario) fueron creados originalmente por TwistedTwigleg, con cambios/adiciones por la comunidad de Godot. Todos los activos originales proporcionados para este tutorial están liberados bajo la licencia ``MIT``.
fr: Toutes les assets fournis (sauf indication contraire) ont été créés à l'origine par TwistedTwigleg, avec des changements/ajouts par la communauté Godot. Toutes les assets originaux fournis pour ce tutoriel sont publiées sous la licence ``MIT``.
zh_cn: 提供的所有资源(除非另有说明)最初由TwistedTwigleg创建，由Godot社区进行更改/添加。 本教程提供的所有原始资源都在“MIT”许可下发布。

source: Feel free to use these assets however you want! All original assets belong to the Godot community, with the other assets belonging to those listed below:
es: ¡Siéntete libre de usar estos recursos como quieras! Todos los recursos originales pertenecen a la comunidad Godot, con los otros recursos pertenecientes a los enumerados a continuación:
fr: N'hésitez pas à utiliser ces assets comme vous le souhaitez ! Tous les assets originaux appartiennent à la communauté Godot, les autres assets appartenant à ceux énumérés ci-dessous :
zh_cn: 您可以随意使用这些资源！ 所有原始资源均属于Godot社区，其他资源属于以下列出的资源:

source: The skybox is created by **StumpyStrust** on OpenGameArt. The skybox used is licensed under ``CC0``.
es: El skybox es creado por **StumpyStrust** en OpenGameArt. El skybox utilizado está bajo licencia ``CC0``.
fr: La skybox est créée par **StumpyStrust** sur OpenGameArt. La skybox utilisée est sous licence ``CC0``.
zh_cn: 天空盒由OpenGameArt上的** StumpyStrust **创建。 使用的天空盒在``CC0``下获得许可。

source: The font used is **Titillium-Regular**, and is licensed under the ``SIL Open Font License, Version 1.1``.
es: La fuente utilizada es **Titillium-Regular**, y está licenciada bajo la ``SIL Open Font License, Version 1.1``.
fr: La police utilisée est **Titillium-Regular**, et est sous licence ``SIL Open Font License, Version 1.1``.
zh_cn: 使用的字体是** Titillium-Regular **，并根据``SIL Open Font License，Version 1.1`许可。

source: You can find the finished project for each part at the bottom of each part's page
es: Puedes encontrar el proyecto terminado para cada parte en la parte inferior de la página de cada parte
fr: Vous pouvez trouver le projet fini pour chaque pièce au bas de la page de chaque pièce
zh_cn: 您可以在每个零件页面底部找到每个零件的完成项目

source: Part overview
es: Resumen
fr: Aperçu cette partie

source: In this part we will be making a first person player that can move around the environment.
es: En esta parte vamos a hacer un jugador de primera persona que puede moverse alrededor del entorno.
fr: Dans cette partie, nous allons faire un personnage joueur à la première personne qui peut se déplacer dans l'environnement.
zh_cn: 在这一部分，我们将制作一个可以在环境中移动的第一人称游戏角色。

source: By the end of this part, you will have a working first-person character who can move around the game environment, sprint, look around with a mouse based first person camera, jump into the air, and turn a flash light on and off.
es: Al final de esta parte tendrás personaje en primera persona un funcional, que puede moverse por el entorno del juego, correr, mirar a su alrededor con una cámara en primera persona basada en el ratón, que puede saltar, encender y apagar una linterna.
fr: À la fin de cette partie, vous aurez un personnage à la première personne qui peut se déplacer dans l'environnement de jeu, courir, regarder autour de lui avec une caméra à la première personne, sauter dans les airs et allumer et éteindre une lampe flash.

source: Getting everything ready
es: Preparando todo
fr: Tout préparer
zh_cn: 准备好一切

source: Launch Godot and open up the project included in the starter assets.
es: Inicia Godot y abre el proyecto incluido en los recursos iniciales.
fr: Lancez Godot et ouvrez le projet inclus dans les assets de démarrage.
zh_cn: 启动Godot并打开启动资源中包含的项目。

source: While these assets are not necessarily required to use the scripts provided in this tutorial, they will make the tutorial much easier to follow, as there are several pre-setup scenes we will be using throughout the tutorial series.
es: Aunque estos recursos no son necesariamente requeridos para utilizar los scripts proporcionados en este tutorial, harán que el tutorial sea mucho más fácil de seguir ya que hay varias escenas preconfiguradas que utilizaremos a lo largo de la serie de tutoriales.
fr: Bien que ces assets ne soient pas nécessairement nécessaires pour utiliser les scripts fournis dans ce tutoriel, ils rendront le tutoriel beaucoup plus facile à suivre, car il y a plusieurs scènes pré-installées que nous utiliserons tout au long de la série de tutoriels.

source: First, open the project settings and go to the "Input Map" tab. You'll find several actions have already been defined. We will be using these actions for our player. Feel free to change the keys bound to these actions if you want.
es: En primer lugar, abre los ajustes del proyecto y ve a la pestaña "Mapa de Entradas". Encontrarás que ya se han definido varias acciones. Usaremos estas acciones para nuestro jugador. Siéntete libre de cambiar las teclas vinculadas a estas acciones si lo deseas.
fr: Ouvrez d'abord les paramètres du projet et allez dans l'onglet "Input Map". Vous constaterez que plusieurs actions ont déjà été définies. Nous utiliserons ces actions pour notre joueur. N'hésitez pas à changer les touches liées à ces actions si vous le souhaitez.

source: Let's take a second to see what we have in the starter assets.
es: Tomémonos un segundo para ver qué tenemos en los recursos iniciales.
fr: Prenons une seconde pour voir ce que nous avons dans les assets de démarrage.
zh_cn: 让我们花点时间看看我们在初始资源中的含义。

source: Included in the starter assets are several scenes. For example, in ``res://`` we have 14 scenes, most of which we will be visiting as we go through this tutorial series.
es: En los recursos iniciales se incluyen varias escenas. Por ejemplo, en ``res://`` tenemos 14 escenas, la mayoría de los cuales estaremos visitando a medida que avancemos en esta serie de tutoriales.
fr: Plusieurs scènes sont incluses dans les assets de départ. Par exemple, dans ``res://``, nous avons 14 scènes, dont la plupart seront visitées au cours de cette série de tutoriels.
zh_cn: 初始化资源中包含几个场景。 例如，在``res://``中我们有14个场景，我们将在本教程系列中访问其中的大多数场景。

source: For now let's open up ``Player.tscn``.
es: Por ahora abramos ``Player.tscn``.
fr: Pour l'instant, ouvrons ``Player.tscn``.
zh_cn: 现在让我们打开 ``Player.tscn`` 。

source: There are a bunch of scenes and a few textures in the ``Assets`` folder. You can look at these if you want, but we will not be exploring through ``Assets`` in this tutorial series. ``Assets`` contains all the models used for each of the levels, as well as some textures and materials.
es: Hay un montón de escenas y unas pocas texturas en la carpeta de ``Recursos``. Puedes mirarlas si quieres, pero no vamos a explorar ``Recursos`` en esta serie de tutoriales. Los ``Recursos`` contienen todos los modelos utilizados para cada uno de los niveles, así como algunas texturas y materiales.
fr: Il y a un tas de scènes et quelques textures dans le dossier ``Assets``. Vous pouvez y jeter un coup d’œil si vous voulez, mais nous ne parcourrons pas ``Assets`` dans cette série de tutoriels. ``Assets`` contient tous les modèles utilisés pour chacun des niveaux, ainsi que quelques textures et matériaux.

source: Making the FPS movement logic
es: Haciendo la lógica del movimiento FPS
fr: Faire la logique de mouvement FPS
zh_cn: 制作FPS运动逻辑

source: Once you have ``Player.tscn`` open, let's take a quick look at how it is set up
fr: Une fois que vous avez ``Player.tscn`` ouvert, jetons un coup d’œil rapide à la façon dont il est configuré
zh_cn: 打开“Player.tscn”后，让我们快速了解它是如何设置的

source: First, notice how the player's collision shapes are set up. Using a vertical pointing capsule as the collision shape for the player is fairly common in most first person games.
es: Primero, fíjate en cómo se configuran las formas de colisión del jugador. El uso de una cápsula de apunte vertical como forma de colisión para el jugador es bastante común en la mayoría de los juegos en primera persona.
fr: Tout d'abord, remarquez comment les formes de collision du joueur sont configurées. L'utilisation d'une capsule à pointe verticale comme forme de collision pour le joueur est assez courante dans la plupart des jeux à la première personne.
zh_cn: 首先，注意如何设置游戏角色的碰撞形状。 在大多数第一人称游戏中，使用垂直指向胶囊作为游戏角色的碰撞形状是相当普遍的。

source: We are adding a small square to the 'feet' of the player so the player does not feel like they are balancing on a single point.
es: Añadimos un pequeño cuadrado a los "pies" del jugador para que éste no sienta que se está equilibrando en un solo punto.
fr: Nous ajoutons un petit carré aux " pieds " du joueur pour qu'il n'ait pas l'impression d'être en équilibre sur un seul point.
zh_cn: 我们在游戏角色的``脚``上添加一个小方块，这样游戏角色就不会觉得他们在单点上保持平衡。

source: We do want the 'feet' slightly higher than the bottom of the capsule so we can roll over slight edges. Where to place the 'feet' is dependent on your levels and how you want your player to feel.
es: Queremos los "pies" ligeramente más altos que el fondo de la cápsula para poder rodar sobre los bordes leves. Dónde colocar los "pies" depende de tus niveles y de cómo quieras que se sienta tu jugador.
fr: Nous voulons que les 'pieds' soient légèrement plus hauts que le fond de la capsule afin de pouvoir rouler sur de légers bords. L'endroit où placer les 'pieds' dépend de votre niveau et de la façon dont vous voulez que votre joueur se sente.
zh_cn: 我们确实希望“脚”略高于胶囊的底部，因此我们可以翻过轻微的边缘。 放置“脚”的位置取决于您的水平以及您希望游戏角色的感受。

source: Many times the player will notice the collision shape being circular when they walk to an edge and slide off. We are adding the small square at the bottom of the capsule to reduce sliding on, and around, edges.
es: Muchas veces el jugador notará que la forma de la colisión es circular cuando camina hacia un borde y se desliza. Añadimos el pequeño cuadrado en la parte inferior de la cápsula para reducir el deslizamiento en los bordes y alrededor de ellos.
fr: Souvent, le joueur remarquera que la forme de la collision est circulaire lorsqu'il marche jusqu'à un bord et qu'il glisse. Nous ajoutons le petit carré au bas de la capsule pour réduire le glissement sur et autour des bords.

source: Another thing to notice is how many nodes are children of ``Rotation_Helper``. This is because ``Rotation_Helper`` contains all the nodes we want to rotate on the ``X`` axis (up and down). The reason behind this is so we can rotate ``Player`` on the ``Y`` axis, and ``Rotation_helper`` on the ``X`` axis.
es: Otra cosa que hay que notar es cuántos nodos son hijos de ``Rotation_Helper``. Esto es porque ``Rotation_Helper`` contiene todos los nodos que queremos rotar en el eje "X" (arriba y abajo). La razón de esto es para que podamos rotar ``Player`` en el eje ``Y``, y ``Rotation_helper`` en el eje ``X``.
fr: Une autre chose à remarquer est combien de nœuds sont des enfants de ``Rotation_Helper``. C'est parce que ``Rotation_Helper`` contient tous les nœuds que nous voulons faire tourner sur l'axe ``X`` (haut et bas). La raison en est que nous pouvons faire pivoter le ``Joueur'' sur l'axe ``Y'' et ``Rotation_Helper`` sur l'axe ``X''.

source: Had we not used ``Rotation_helper``, we would've likely had cases of rotating on both the ``X`` and ``Y`` axes simultaneously, potentially further degenerating into a state of rotation on all three axes in some cases.
es: Otra cosa que hay que notar es cuántos nodos son hijos de ``Rotation_Helper``. Esto es porque ``Rotation_Helper`` contiene todos los nodos que queremos rotar en el eje "X" (arriba y abajo). La razón de esto es para que podamos rotar ``Player`` en el eje ``Y``, y ``Rotation_helper`` en el eje ``X``.
fr: Si nous n'avions pas utilisé ``Rotation_helper``, nous aurions probablement eu des cas de rotation simultanée sur les axes ``X`` et ``Y``, qui auraient pu dégénérer en un état de rotation sur les trois axes dans certains cas.

source: See :ref:`using transforms <doc_using_transforms>` for more information
es: Ver :ref:`using transforms <doc_using_transforms>` para más información
fr: Voir :ref:`using transforms <doc_using_transforms>` pour plus d'informations
zh_cn: 有关更多信息，请参阅 :ref:`使用转换<doc_using_transforms>`

source: Attach a new script to the ``Player`` node and call it ``Player.gd``.
es: Adjunta un nuevo script al nodo ``Player`` y llámalo ``Player.gd``.
fr: Attachez un nouveau script au nœud ``Player`` et appelez-le ``Player.gd``.
zh_cn: 将一个新脚本附加到 ``Player`` 节点并将其命名为 ``Player.gd`` 。

source: Let's program our player by adding the ability to move around, look around with the mouse, and jump. Add the following code to ``Player.gd``:
es: Programemos nuestro reproductor añadiendo la capacidad de moverse, mirar con el ratón y saltar. Añade el siguiente código a ``Player.gd``:
fr: Programmons notre joueur en ajoutant la possibilité de se déplacer, de regarder autour de lui avec la souris et de sauter. Ajoutez le code suivant à ``Player.gd`` :
zh_cn: 让我们通过添加移动能力，用鼠标环顾四周并跳跃来编程我们的游戏角色。 将以下代码添加到``Player.gd``:

source: This is a lot of code, so let's break it down function by function:
es: Esto es un montón de código, así que vamos a desglosarlo función por función:
fr: C'est beaucoup de code, alors décomposons-le fonction par fonction :
zh_cn: 这是很多代码，所以让我们按功能分解它:

source: While copy and pasting code is ill advised, as you can learn a lot from manually typing the code in, you can copy and paste the code from this page directly into the script editor.
es: Aunque copiar y pegar código no es aconsejable, ya que se puede aprender mucho escribiendo el código manualmente, puedes copiar y pegar el código de esta página directamente en el editor de scripts.
fr: Bien qu'il soit déconseillé de copier et coller du code, car vous pouvez apprendre beaucoup en tapant le code manuellement, vous pouvez copier et coller le code de cette page directement dans l'éditeur de script.
zh_cn: 虽然不建议复制和粘贴代码，因为您可以通过手动输入代码来学习很多东西，但您可以将此页面中的代码直接复制并粘贴到脚本编辑器中。

source: If you do this, all of the code copied will be using spaces instead of tabs.
fr: Si vous faites cela, tout le code copié utilisera des espaces au lieu de tabulations.
zh_cn: 如果这样做，所有复制的代码将使用空格而不是制表符。

source: To convert the spaces to tabs in the script editor, click the "edit" menu and select "Convert Indent To Tabs". This will convert all the spaces into tabs. You can select "Convert Indent To Spaces" to convert tabs back into spaces.
es: Para convertir los espacios en pestañas en el editor de scripts, haz clic en el menú "Editar" y selecciona "Convertir indentados en tabuladores". Esto convertirá todos los espacios en tabuladores. Puedes seleccionar "Convertir indentados en tabuladores" para convertir los tabuladores de nuevo en espacios.
fr: Pour convertir les espaces en tabulations dans l'éditeur de script, cliquez sur le menu "edit" et sélectionnez "Convert Indent To Tabs". Ceci convertira tous les espaces en tabulations. Vous pouvez sélectionner "Convert Indent To Spaces" pour convertir les tabulations en espaces.
zh_cn: 要在脚本编辑器中将空格转换为制表符（Tab），请单击“编辑”菜单并选择“将缩进转换为选项卡”。 这会将所有空格转换为制表符。 您也可以选择“将缩进转换为空格”以将制表符转换回空格。
