Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_two.po
Languages: es, fr, ja, zh_cn

source: Since we know ``Pistol_equip`` will transition to ``Pistol_idle``, we do not need to do any more additional processing for equipping weapons, but since we were not able to equip the pistol yet, we return ``false``.
es: Como sabemos que ``Pistol_equip`` pasará a ``Pistol_idle``, no necesitamos hacer más procesamiento adicional para equipar las armas, pero como no pudimos equipar la pistola todavía, volvemos ``false``.
fr: Puisque nous savons que ``Pistol_equip`` passera à ``Pistol_idle``, nous n'avons pas besoin de faire d'autres traitements supplémentaires pour équiper les armes, mais comme nous n'avons pas encore pu équiper le pistolet, nous retournons "faux".
ja: ``Pistol_equip`` が ``Pistol_idle`` に移行することがわかっているため、武器を装備するために追加の処理を行う必要はありませんが、まだピストルを装備できていないので、\ `` false`` を返します。
zh_cn: 既然我们知道 ``Pistol_equip`` 将转换为 ``Pistol_idle`` ，我们不需要再为武器配备额外的处理，但由于我们还没能装备手枪，我们返回 ``false``。

source: Finally, let's look at ``unequip_weapon``:
es: Finalmente, veamos el ``unequip_weapon``:
fr: Enfin, jetons un coup d’œil à ``unequip_weapon`` :
ja: 最後に、 ``unequip_weapon`` を見てみましょう:
zh_cn: 最后，让我们看看 ``unequip_weapon``:

source: ``unequip_weapon`` is similar to ``equip_weapon``, but instead we're checking things in reverse.
es: ``unequip_weapon`` es similar a ``equip_weapon``, pero en cambio estamos revisando las cosas al revés.
fr: ``unequip_weapon`` est semblable à ``equip_weapon``, mais nous vérifions les choses à l'inverse.
ja: ``unequip_weapon`` は ``equip_weapon`` に似ていますが、代わりに逆順にチェックしています。
zh_cn: ``unequip_weapon``类似于``equip_weapon``，但我们却反过来检查。

source: First we check to see whether the player is in the idle animation state. Then we check to make sure the player is not in the ``Pistol_unequip`` animation. If the player is not in the ``Pistol_unequip`` animation, we want to play the ``pistol_unequip`` animation.
es: Primero comprobamos si el jugador está en el estado de animación inactivo. Luego nos aseguramos de que el jugador no esté en la animación ``Pistol_unequip``. Si el jugador no está en la animación ``Pistol_unequip``, queremos reproducir la animación ``Pistol_unequip``.
fr: Tout d'abord, nous vérifions si le joueur est dans l'état d'animation d'inactivité. Ensuite, nous vérifions que le joueur n'est pas dans l'animation ``Pistol_unequip``. Si le joueur n'est pas dans l'animation ``Pistol_unequip``, nous voulons jouer l'animation ``pistol_unequip``.
ja: 最初に、プレイヤーがアイドルアニメーション状態になっているかどうかを確認します。次に、プレイヤーが ``Pistol_unequip`` アニメーションになっていないことを確認します。プレイヤーが ``Pistol_unequip`` アニメーションになっていない場合、\ ``pistol_unequip`` アニメーションを再生します。

source: You may be wondering why we are checking to see whether the player is in the pistol's idle animation, and then making sure the player is not unequipping right after. The reason behind the additional check is because we could (in rare cases) call ``unequip_weapon`` twice before we've had a chance to process ``set_animation``, so we add this additional check to make sure the unequip animation plays.
es: Primero comprobamos si el jugador está en el estado de animación inactivo. Luego nos aseguramos de que el jugador no esté en la animación ``Pistol_unequip``. Si el jugador no está en la animación ``Pistol_unequip``, queremos reproducir la animación ``Pistol_unequip``.
fr: Vous vous demandez peut-être pourquoi nous vérifions si le joueur est dans l'animation d'inactivité du pistolet, puis nous nous assurons que le joueur n'est pas en train de se déséquiper juste après. La raison de cette vérification supplémentaire est que nous pourrions (dans de rares cas) appeler ``unequip_weapon`` deux fois avant d'avoir eu la chance de traiter ``set_animation``, alors nous ajoutons cette vérification supplémentaire pour nous assurer que l'animation déséquipée est jouée.
ja: プレイヤーがピストルのアイドルアニメーションにあるかどうかを確認し、その直後にプレイヤーが装備を解除していないことを確認する理由に疑問を抱くかもしれません。追加のチェックの背後にある理由は、(まれに) ``set_animation`` を処理する前に ``unequip_weapon`` を2回呼び出すことができるためです。

source: Next we check to see whether the player is in ``Idle_unarmed``, which is the animation state we will transition into from ``Pistol_unequip``. If the player is in ``Idle_unarmed``, then we set ``is_weapon_enabled`` to ``false`` since we are no longer using this weapon, and return ``true`` because we have successfully unequipped the pistol.
es: A continuación comprobamos si el jugador está en "Idle_unarmed", que es el estado de animación al que pasaremos de "Pistol_unequip". Si el jugador está en "Idle_unarmed", entonces ponemos "is_weapon_enabled" en ``false`` ya que ya no estamos usando esta arma, y devolvemos ``true`` porque hemos desarmado exitosamente la pistola.
fr: Ensuite, nous vérifions si le joueur est dans ``Idle_unarmed``, qui est l'état de l'animation dans lequel nous allons passer depuis ``Pistol_unequip``. Si le joueur se trouve dans ``Idle_unarmed``, nous réglons alors ``is_weapon_enabled`` sur ``false`` puisque nous n'utilisons plus cette arme, et nous retournons ``true`` parce que nous avons réussi à déséquiper le pistolet.
ja: 次に、プレイヤーが ``Idle_unarmed`` にあるかどうかを確認します。これは、\ ``Pistol_unequip`` から遷移するアニメーション状態です。プレイヤーが ``Idle_unarmed`` にいる場合、この武器を使用しなくなったため ``is_weapon_enabled`` を ``false`` に設定し、ピストルを正常に装備解除したため ``true`` を返します。

source: If the player is not in ``Idle_unarmed``, we return ``false`` because we have not yet successfully unequipped the pistol.
es: Si el jugador no está en ``Idle_unarmed``, devolvemos ``false`` porque aún no hemos desarmado la pistola con éxito.
fr: Si le joueur n'est pas dans "Idle_unarmed", nous retournons ``false`` parce que nous n'avons pas encore réussi à déséquiper le pistolet.
ja: プレイヤーが ``Idle_unarmed`` にない場合、ピストルの装備をまだ解除していないため ``false`` を返します。
zh_cn: 如果游戏角色不在“Idle_unarmed”中，我们会返回“false”，因为我们尚未成功装备手枪。

source: Creating the other two weapons
es: Creando las otras dos armas
fr: Création des deux autres armes
ja: 他の2つの武器を作成する
zh_cn: 制造另外两种武器

source: Now that we have all the code we'll need for the pistol, let's add the code for the rifle and knife next.
es: Ahora que tenemos todo el código que necesitamos para la pistola, añadamos el código del rifle y el cuchillo.
fr: Maintenant que nous avons tout le code nécessaire pour le pistolet, ajoutons le code pour le fusil et le couteau.
ja: ピストルに必要なコードがすべて揃ったので、次にライフルとナイフのコードを追加しましょう。

source: Select ``Rifle_Point`` (``Player`` -> ``Rotation_Helper`` -> ``Gun_Fire_Points`` -> ``Rifle_Point``) and create a new script called ``Weapon_Rifle.gd``, then add the following:
es: Selecciona ``Rifle_Point`` (``Player`` -> ``Rotation_Helper`` -> ``Gun_Fire_Points`` -> ``Rifle_Point``) y crea un nuevo script llamado ``Weapon_Rifle.gd``, y añade lo siguiente:
fr: Sélectionnez ``Rifle_Point`` (``Player`` -> ``Rotation_Helper`` -> ``Gun_Fire_Points`` -> ``Rifle_Point``) et créez un nouveau script appelé ``Weapon_Rifle.gd``, puis ajoutez ce qui suit :
ja: ``Rifle_Point``(``Player`` -> ``Rotation_Helper`` -> ``Gun_Fire_Points`` -> ``Rifle_Point``)を選択し、\ ``Weapon_Rifle.gd`` という新しいスクリプトを作成して、次のように追加します:
zh_cn: 选择 ``Rifle_Point`` (``Player`` ->` `Rotation_Helper`` ->` `Gun_Fire_Points`` ->` `Rifle_Point``)并创建一个名为``Weapon_Rifle.gd``的新脚本，然后添加 下列:

source: Most of this is exactly the same as ``Weapon_Pistol.gd``, so we're only going to look at what's changed: ``fire_weapon``.
es: La mayor parte de esto es exactamente lo mismo que ``Weapon_Pistol.gd``, así que sólo vamos a ver lo que ha cambiado: ``fire_weapon``.
fr: C'est exactement la même chose que ``Weapon_Pistol.gd``, alors nous allons seulement regarder ce qui a changé : ``fire_weapon``.
ja: このほとんどは ``Weapon_Pistol.gd`` とまったく同じであるため、変更点のみを見ていきます: ``fire_weapon``\ 。
zh_cn: 其中大部分与 ``Weapon_Pistol.gd`` 完全相同，所以我们只会看看改变了什么: ``fire_weapon`` 。

source: The first thing we do is get the :ref:`Raycast <class_Raycast>` node, which is a child of ``Rifle_Point``.
es: Lo primero que hacemos es obtener el nodo :ref:`Raycast <class_Raycast>`, que es un hijo de ``Rifle_Point``.
fr: La première chose que nous faisons est d'obtenir le nœud :ref:`Raycast <class_Raycast>`, qui est un enfant de ``Rifle_Point``.
ja: 最初に行うことは、\ :ref:`Raycast <class_Raycast>` ノードを取得することです。これは ``Rifle_Point`` の子です。
zh_cn: 我们要做的第一件事是获取 :ref:`Raycast <class_Raycast>` 节点，它是 ``Rifle_Point`` 的子节点。

source: Next we force the :ref:`Raycast <class_Raycast>` to update using ``force_raycast_update``. This will force the :ref:`Raycast <class_Raycast>` to detect collisions when we call it, meaning we get a frame perfect collision check with the 3D physics world.
es: A continuación forzamos el :ref:`Raycast <class_Raycast>` a actualizarse usando ``force_raycast_update``. Esto forzará a :ref:`Raycast <class_Raycast>` a detectar colisiones cuando lo llamemos, lo que significa que obtenemos una comprobación de colisión perfecta con el mundo de la física 3D.
fr: Ensuite, nous forçons le :ref:`Raycast <class_Raycast>` à se mettre à jour en utilisant ``force_raycast_update``. Cela forcera le :ref:`Raycast <class_Raycast>` à détecter les collisions lorsque nous l'appelons, ce qui signifie que nous obtenons un contrôle parfait des collisions avec le monde physique 3D.
ja: 次に、\ ``force_raycast_update`` を使用して :ref:`Raycast <class_Raycast>` を強制的に更新します。これにより :ref:`Raycast <class_Raycast>` が呼び出されたときに衝突を検出し、フレームパーフェクトな3D物理世界とのコリジョンチェックを取得します。
zh_cn: 接下来我们使用 ``force_raycast_update`` 强制执行 :ref:`Raycast <class_Raycast>` 更新。 这将迫使 :ref:`Raycast <class_Raycast>` 在我们调用它时检测碰撞，这意味着我们可以与3D物理世界进行帧完美碰撞检查。

source: Then we check to see if the :ref:`Raycast <class_Raycast>` collided with something.
es: Entonces comprobamos si el :ref:`Raycast <class_Raycast>` colisionó con algo.
fr: Ensuite, nous vérifions si le :ref:`Raycast <class_Raycast>` est entré en collision avec quelque chose.
ja: 次に、\ :ref:`Raycast <class_Raycast>` が何かと衝突したかどうかを確認します。
zh_cn: 然后我们检查 :ref:`Raycast <class_Raycast>` 是否与某些东西相撞。

source: If the :ref:`Raycast <class_Raycast>` has collided with something, we first get the collision body it collided with. This can be a :ref:`StaticBody <class_StaticBody>`, :ref:`RigidBody <class_RigidBody>`, or a :ref:`KinematicBody <class_KinematicBody>`.
es: Si el :ref:`Raycast <clase_Raycast>` ha colisionado con algo, primero obtenemos el cuerpo de la colisión con el que ha colisionado. Este puede ser un :ref:`StaticBody <class_StaticBody>`, :ref:`RigidBody <class_RigidBody>`, o un :ref:`KinematicBody <class_KinematicBody>`.
fr: Si le :ref:`Raycast <class_Raycast>` est entré en collision avec quelque chose, on obtient d'abord le corps de collision avec lequel il est entré en collision. Cela peut être un :ref:`StaticBody <class_StaticBody>`, :ref:`RigidBody <class_RigidBody>`, ou un :ref:`KinematicBody <class_KinematicBody>`.
ja: :ref:`Raycast <class_Raycast>` が何かと衝突した場合、最初に衝突したコリジョンbodyを取得します。これは、\ :ref`StaticBody <class_StaticBody>`\ 、\ :ref:`RigidBody <class_RigidBody>`\ 、または :ref:`KinematicBody <class_KinematicBody>`\ です。
zh_cn: 如果 :ref:`Raycast <class_Raycast>` 与某些东西相撞，我们首先得到它碰撞的碰撞体。 这可以是 :ref:`StaticBody <class_StaticBody>`， :ref:`RigidBody <class_RigidBody>`，或者a :ref:`KinematicBody <class_KinematicBody>`。

source: Next we want to make sure the body we've collided with is not the player, since we (probably) do not want to give the player the ability to shoot themselves in the foot.
es: A continuación queremos asegurarnos de que el cuerpo con el que hemos chocado no es el jugador, ya que (probablemente) no queremos darle al jugador la posibilidad de dispararse en el pie.
fr: Ensuite, nous voulons nous assurer que le corps avec lequel nous sommes entrés en collision n'est pas le joueur, puisque nous ne voulons (probablement) pas lui donner la possibilité de se tirer dans le pied.
ja: 次に、私たちは(おそらく)プレイヤーに自分自身の足を撃つ能力を与えたくないので、衝突したボディがプレイヤーではないことを確認したいと思います。
zh_cn: 接下来我们要确保我们碰到的物体不是游戏角色，因为我们(可能)不想让游戏角色有能力在脚下射击。

source: If the body is not the player, we then check to see if it has a function/method called ``bullet_hit``. If it does, we call it and pass in the amount of damage this bullet does (``DAMAGE``), and the global transform of the :ref:`Raycast <class_Raycast>` so we can tell from which direction the bullet came.
es: Si el cuerpo no es el jugador, entonces comprobamos si tiene una función/método llamado ``bullet_hit``. Si la tiene, la llamamos y le pasamos la cantidad de daño que hace esta bala (``DAMAGE``), y la transformación global del :ref:`Raycast <class_Raycast>` para que podamos saber de qué dirección vino la bala.
fr: Si le corps n’est pas le joueur, nous vérifions ensuite s’il a une fonction/méthode appelée ``bullet_hit``. Si c’est le cas, nous l’appelons et passons le montant des dégâts que cette balle fait (``DAMAGE``), et la transformation globale de la :ref:`Raycast <class_Raycast>` afin que nous puissions dire de quelle direction la balle est venue.
ja: ボディがプレイヤーではない場合、\ ``bullet_hit`` という関数/メソッドがあるかどうかを確認します。もしそうなら、私たちはそれを呼び出して、この弾丸が与えるダメージの量(``DAMAGE``)、および :ref:`Raycast <class_Raycast>` のグローバルtransformを渡すので、どの方向から弾丸が来たかを知ることができます。

source: Now all we need to do is write the code for the knife.
es: Ahora todo lo que tenemos que hacer es escribir el código del cuchillo.
fr: Il ne nous reste plus qu'à écrire le code du couteau.
ja: 今、必要があるのはナイフのコードを書くことだけです。
zh_cn: 现在我们需要做的就是为刀编写代码。

source: Select ``Knife_Point`` (``Player`` -> ``Rotation_Helper`` -> ``Gun_Fire_Points`` -> ``Knife_Point``) and create a new script called ``Weapon_Knife.gd``, then add the following:
es: Selecciona ``Knife_Point`` (``Player`` -> ``Rotation_Helper`` -> ``Gun_Fire_Points`` -> ``Knife_Point``) y crea un nuevo script llamado ``Weapon_Knife.gd``, y añade lo siguiente:
fr: Sélectionnez ``Rifle_Point`` (``Player`` -> ``Rotation_Helper`` -> ``Gun_Fire_Points`` -> ``Rifle_Point``) et créez un nouveau script appelé ``Weapon_Rifle.gd``, puis ajoutez ce qui suit :
ja: ``Knife_Point``( ``Player`` -> ``Rotation_Helper`` -> ``Gun_Fire_Points`` -> ``Knife_Point``)を選択し、\ ``Weapon_Knife.gd`` という新しいスクリプトを作成し、次のように追加します:
zh_cn: 选择 ``Knife_Point`` (``Player`` ->` `Rotation_Helper`` ->` `Gun_Fire_Points`` ->` `Knife_Point``)并创建一个名为``Weapon_Knife.gd``的新脚本，然后添加 下列:

source: As with ``Weapon_Rifle.gd``, the only differences are in ``fire_weapon``, so let's look at that:
es: Como con ``Weapon_Rifle.gd``, las únicas diferencias están en ``fire_weapon``, así que veamos eso:
fr: Comme dans le cas de ``Weapon_Rifle.gd``, les seules différences se situent au niveau de ``fire_weapon``, alors regardons cela :
ja: ``Weapon_Rifle.gd`` と同様に、唯一の違いは ``fire_weapon`` にあるため、それを見てみましょう:
zh_cn: 与 ``Weapon_Rifle.gd`` 一样，唯一的区别在于 ``fire_weapon`` ，所以让我们看一下:

source: The first thing we do is get the :ref:`Area <class_Area>` child node of ``Knife_Point``.
es: Lo primero que hacemos es obtener el nodo :ref:``Area <class_Area>` hijo de ``Knife_Point``.
fr: La première chose que nous faisons est d'obtenir le :ref:`Area <class_Area>` nœud enfant de ``Knife_Point``.
ja: 最初に行うことは、\ ``Knife_Point`` の :ref:`Area <class_Area>` 子ノードを取得することです。
zh_cn: 我们要做的第一件事就是得到 ``Knife_Point`` 的 :ref:`Area <class_Area>` 子节点。

source: Next we want to get all the collision bodies inside the :ref:`Area <class_Area>` using ``get_overlapping_bodies``. This will return a list of every body that touches the :ref:`Area <class_Area>`.
es: A continuación, queremos tener todos los cuerpos de colisión dentro de la :ref:``Area <class_Area>` usando ``get_overlapping_bodies``. Esto devolverá una lista de cada cuerpo que toque el :ref:`Area <class_Area>`.
fr: Ensuite, nous voulons obtenir tous les corps de collision à l'intérieur de la :ref:`Area <class_Area>` en utilisant ``get_overlapping_bodies``. Ceci retournera une liste de tous les corps qui touchent le :ref:`Area <class_Area>`.
ja: 次に、\ ``get_overlapping_bodies`` を使用して :ref:`Area <class_Area>` 内のすべてのコリジョンボディを取得します。これは :ref:`Area <class_Area>` に触れるすべてのボディのリストを返します。

source: We next want to go through each of those bodies.
es: Lo siguiente que queremos hacer es revisar cada uno de esos cuerpos.
fr: Nous voulons ensuite passer en revue chacun de ces corps.
ja: 次に、これらの各ボディを確認します。
zh_cn: 我们接下来想要浏览每一个机构。

source: First we check to make sure the body is not the player, because we do not want to let the player be able to stab themselves. If the body is the player, we use ``continue`` so we jump and look at the next body in ``bodies``.
es: Primero revisamos para asegurarnos que el cuerpo no es el jugador, porque no queremos que el jugador sea capaz de apuñalarse a sí mismo. Si el cuerpo es el jugador, usamos ``continue``, así que saltamos y miramos el siguiente cuerpo en ``bodies``.
fr: Tout d'abord, nous vérifions que le corps n'est pas le joueur, parce que nous ne voulons pas que le joueur soit capable de se poignarder. Si le corps est le joueur, nous utilisons ``continue`` pour sauter et regarder le corps suivant dans ``bodies``.
ja: まず、プレイヤーが自分自身を刺すことができないようにするために、体がプレイヤーではないことを確認します。ボディがプレイヤーの場合は、\ ``continue`` を使用するため、ジャンプして ``bodys`` の次のボディを確認します。
zh_cn: 首先我们检查以确保物体不是游戏角色，因为我们不想让游戏角色能够刺伤自己。 如果物体是游戏角色，我们使用 ``continue`` ，所以我们跳过并看着 ``bodies`` 中的下一个物体。

source: If we have not jumped to the next body, we then check to see if the body has the ``bullet_hit`` function/method. If it does, we call it, passing in the amount of damage a single knife swipe does (``DAMAGE``) and the global transform of the :ref:`Area <class_Area>`.
es: Si no hemos saltado al siguiente cuerpo, entonces comprobamos si el cuerpo tiene la función/método "bullet_hit". Si la tiene, la llamamos, pasando la cantidad de daño que hace un solo golpe de cuchillo (``DAMAGE``) y la transformación global de la :ref:`Area <class_Area>`.
fr: Si nous n'avons pas sauté au corps suivant, nous vérifions alors si le corps a la fonction/méthode ``bullet_hit``. Si c'est le cas, nous l'appelons, en passant par le montant des dommages causés par un simple coup de couteau (``DAMAGE``) et la transformation globale de la:ref:`Area <class_Area>`.
ja: 次のボディにジャンプしていない場合、ボディに ``bullet_hit`` 関数/メソッドがあるかどうかを確認します。もしそうなら、私たちはそれを呼び出し、1回のナイフスワイプが与えるダメージの量(``DAMAGE``)と :ref:`Area <class_Area>` のグローバルtransfomを渡します。
zh_cn: 如果我们没有跳到下一个物体，我们检查物体是否有 ``bullet_hit`` 函数/方法。 如果确实如此，我们称之为，传递单刀划动所造成的伤害量(``DAMAGE``)和全局变换 :ref:`Area <class_Area>`。

source: While we could attempt to calculate a rough location for where the knife hit exactly, we are not going to because using the :ref:`Area <class_Area>`'s position works well enough and the extra time needed to calculate a rough position for each body is not worth the effort.
es: Aunque podríamos intentar calcular una posición aproximada para el lugar exacto donde el cuchillo golpeó, no lo haremos porque usar la posición de :ref:`Area <class_Area>` funciona bastante bien y el tiempo extra necesario para calcular una posición aproximada para cada cuerpo no vale la pena el esfuerzo.
fr: Bien que nous puissions essayer de calculer un emplacement approximatif pour l'endroit exact où le couteau a frappé, nous n'allons pas le faire parce que l'utilisation de la position de :ref:`Area <class_Area>` fonctionne assez bien et le temps supplémentaire nécessaire pour calculer une position approximative pour chaque corps ne vaut pas la peine.
ja: ナイフが正確に当たった場所の大まかな位置を計算することはできますが、\ :ref:`Area <class_Area>` の位置を使用するとそれで十分に機能するので、大まかな位置を計算するのに必要な余分な時間をかけてまで、 各ボディが努力する価値はありません。
zh_cn: 虽然我们可以尝试计算刀准确击中的粗略位置，但我们不会这样做，因为使用 :ref:`Area <class_Area>` 的位置运行良好，并且计算粗略位置所需的额外时间 每个人都不值得努力。

source: Making the weapons work
es: Hacer que las armas funcionen
fr: Faire fonctionner les armes
ja: 武器を機能させる
zh_cn: 制造武器

source: Let's start making the weapons work in ``Player.gd``.
es: Empecemos a hacer que las armas funcionen en ``Player.gd``.
fr: Commençons à faire fonctionner les armes dans ``Player.gd``.
ja: ``Player.gd`` で武器を機能させましょう。

source: First let's start by adding some class variables we'll need for the weapons:
es: Primero empecemos por añadir algunas variables de clase que necesitaremos para las armas:
fr: Commençons d'abord par ajouter quelques variables de classe dont nous aurons besoin pour les armes :
ja: まず、武器に必要ないくつかのクラス変数を追加することから始めましょう:

source: Let's go over what these new variables will do:
es: Veamos lo que harán las nuevas variables:
fr: Voyons ce que ces nouvelles variables vont faire :
ja: これらの新しい変数が何をするかを見てみましょう:

source: ``animation_manager``: This will hold the :ref:`AnimationPlayer <class_AnimationPlayer>` node and its script, which we wrote previously.
es: ``animation_manager``: Esto contendrá el nodo :ref:`AnimationPlayer <class_AnimationPlayer>` y su script, que hemos escrito previamente.
fr: ``animation_manager`` : Cela va contenir le nœud :ref:`AnimationPlayer <class_AnimationPlayer>` et son script, que nous avons écrit précédemment.
ja: ``animation_manager``: これは :ref:`AnimationPlayer <class_AnimationPlayer>` ノードと以前に書いたそのスクリプトを保持します。
zh_cn: ``animation_manager``:这将保存 :ref:`AnimationPlayer <class_AnimationPlayer>` 节点及其脚本，我们之前写过。

source: ``current_weapon_name``: The name of the weapon we are currently using. It has four possible values: ``UNARMED``, ``KNIFE``, ``PISTOL``, and ``RIFLE``.
es: ``current_weapon_name``: El nombre del arma que estamos usando actualmente. Tiene cuatro valores posibles: ``UNARMED``, ``KNIFE``, ``PISTOL``, and ``RIFLE``.
fr: ``current_weapon_name`` : Le nom de l'arme que nous utilisons actuellement. Il a quatre valeurs possibles : ``UNARMED``, ``KNIFE``, ``PISTOL`` et ``RIFLE``.
ja: ``current_weapon_name``: 現在使用している武器の名前。可能な値は4つあります: ``UNARMED``\ 、\ ``KNIFE``\ 、\ ``PISTOL``\ 、および ``RIFLE``\ 。
zh_cn: ``current_weapon_name``:我们当前使用的武器的名称。 它有四个可能的值: ``UNARMED`` ， ``KNIFE`` ， ``PISTOL`` 和 ``RIFLE`` 。

source: ``weapons``: A dictionary that will hold all the weapon nodes.
es: ``weapons``: Un diccionario que contiene todos los nodos de las armas.
fr: ``weapons`` : Un dictionnaire qui contiendra tous les nœuds de l'arme.
ja: ``weapons``: すべての武器ノードを保持するdictionary。

source: ``WEAPON_NUMBER_TO_NAME``: A dictionary allowing us to convert from a weapon's number to its name. We'll use this for changing weapons.
es: ``WEAPON_NUMBER_TO_NAME``: Un diccionario que nos permite convertir el número de un arma en su nombre. Usaremos esto para cambiar las armas.
fr: ``WEAPON_NUMBER_TO_NAME`` : Un dictionnaire permettant de convertir le numéro d'une arme en son nom. On s'en servira pour changer d'armes.
ja: ``WEAPON_NUMBER_TO_NAME``: 武器の番号から名前に変換できるdictionary。これを武器の変更に使用します。
zh_cn: ``WEAPON_NUMBER_TO_NAME``:允许我们从武器编号转换为其名称的字典。 我们将用它来换武器。

source: ``WEAPON_NAME_TO_NUMBER``: A dictionary allowing us to convert from a weapon's name to its number. We'll use this for changing weapons.
es: ``WEAPON_NAME_TO_NUMBER``: Un diccionario que nos permite convertir el nombre de un arma en su número. Usaremos esto para cambiar las armas.
fr: ``WEAPON_NAME_TO_NUMBER`` : Un dictionnaire permettant de convertir le nom d'une arme en son numéro. On s'en servira pour changer d'armes.
ja: ``WEAPON_NAME_TO_NUMBER``: 武器の名前からその番号に変換できるdictionary。これを武器の変更に使用します。
zh_cn: ``WEAPON_NAME_TO_NUMBER``:一个字典，允许我们从武器的名称转换为它的号码。 我们将用它来换武器。

source: ``changing_weapon``: A boolean to track whether or not we are changing guns/weapons.
es: ``changing_weapon``: Un booleano para saber si estamos cambiando o no las armas.
fr: ``changing_weapon`` : Un booléen pour savoir si oui ou non nous changeons d'armes.
ja: ``changing_weapon``: 銃/武器を変更しているかどうかを追跡するブール値。
zh_cn: ``changing_weapon``:一个布尔值，用于跟踪我们是否正在改变枪支/武器。

source: ``changing_weapon_name``: The name of the weapon we want to change to.
es: ``changing_weapon_name``: El nombre del arma a la que queremos cambiar.
fr: ``changing_weapon_name`` : Le nom de l'arme que nous voulons changer.
ja: ``changing_weapon_name``: 変更したい武器の名前。
zh_cn: ``changing_weapon_name``:我们想要改变的武器的名称。
