Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_three.po
Languages: es, fr, ja, zh_cn

source: Part 3
es: Parte 3
fr: Partie 3
ja: パート3
zh_cn: 第3部分

source: Part overview
es: Resumen
fr: Aperçu cette partie
ja: パートの概要
zh_cn: 部分概述

source: In this part, we will be limiting the player's weapons by giving them ammo. We will also be giving the player the ability to reload, and we will be adding sounds when the weapons fire.
es: En esta parte, limitaremos las armas del jugador dándoles munición. También le daremos al jugador la capacidad de recargar, y añadiremos sonidos cuando las armas disparen.
fr: Dans cette partie, nous allons limité les armes du joueur en lui ajoutant un nombre de munitions. Nous allons également donner a notre joueur l'aptitude de recharger, et nous allons ajouter les bruitages des tirs quand l'arme est utilisée.
ja: このパートでは、弾薬数を与えることでプレイヤーの武器を制限します。また、プレイヤーにリロード機能を提供し、武器が発砲したときにサウンドを追加します。
zh_cn: 在这个部分,我们将通过给玩家的武器提供弹药来限制他们.还将赋予玩家重新装填的能力,并且将添加武器开火时的声音.

source: You are assumed to have finished :ref:`doc_fps_tutorial_part_two` before moving on to this part of the tutorial. The finished project from :ref:`doc_fps_tutorial_part_two` will be the starting project for part 3
es: Se supone que has terminado :ref:`doc_fps_tutorial_part_two` antes de pasar a esta parte del tutorial. El proyecto terminado de :ref:`doc_fps_tutorial_part_two` será el proyecto inicial de la parte 3
fr: Vous êtes supposez avoir fini :ref:`doc_fps_tutorial_part_two` avant de commencer cette partie du tutoriel. Le projet final de :ref:`doc_fps_tutorial_part_two` sera le projet de départ pour la troisième partie
ja: チュートリアルのこの部分に進む前に、\ :ref:`doc_fps_tutorial_part_two` を終了していると想定しています。\ :ref:`doc_fps_tutorial_part_two` の完成したプロジェクトは、パート3の開始プロジェクトになります
zh_cn: 在继续本教程的这一部分之前,我们假设您已经完成了 :ref:`doc_fps_tutorial_part_two`. 完成的项目来自 :ref:`doc_fps_tutorial_part_two`将成为第3部分的起始项目

source: Let's get started!
es: ¡Vamos a empezar!
fr: Commençons tout de suite !
ja: では、始めましょう！
zh_cn: 让我们开始吧！

source: Changing levels
es: Cambiando los niveles
fr: Changement des niveaux
ja: レベル(舞台)の変更
zh_cn: 改变水平

source: Now that we have a fully working FPS, let's move to a more FPS-like level.
es: Ahora que tenemos un FPS completamente funcional, pasemos a un nivel más parecido al FPS.
fr: Maintenant que nous avons un FPS qui fonctionne totalement, passons à un niveau ressemblant plus a un FPS (FPS-like).
ja: FPSが完全に機能するようになったので、FPSのようなレベルに移行しましょう。
zh_cn: 现在我们已经有了一个完全可以运作的FPS,让我们进入一个更像FPS的级别.

source: Open up ``Space_Level.tscn`` (``assets/Space_Level_Objects/Space_Level.tscn``) and/or ``Ruins_Level.tscn`` (``assets/Ruin_Level_Objects/Ruins_Level.tscn``).
es: Abre ``Space_Level.tscn`` (``assets/Space_Level_Objects/Space_Level.tscn``) y/o ``Ruins_Level.tscn`` (``assets/Ruin_Level_Objects/Ruins_Level.tscn``).
fr: Ouvrez ``Space_Level.tscn`` (``assets/Space_Level_Objects/Space_Level.tscn``) et/ou ``Ruins_Level.tscn`` (``assets/Ruin_Level_Objects/Ruins_Level.tscn``).
ja: ``Space_Level.tscn``(``assets/Space_Level_Objects/Space_Level.tscn``) および/または ``Ruins_Level.tscn``( ``assets/Ruin_Level_Objects/Ruins_Level.tscn``)を開きます。
zh_cn: 打开 ``Space_Level.tscn`` (``assets / Space_Level_Objects / Space_Level.tscn``)和/或 ``Ruins_Level.tscn`` (``assets / Ruin_Level_Objects / Ruins_Level.tscn``).

source: ``Space_Level.tscn`` and ``Ruins_Level.tscn`` are complete custom FPS levels created for the purpose of this tutorial. Press ``Play Current Scene`` button, or :kbd:`F6` on keyboard, and give each a try.
es: ``Space_Level.tscn`` y ``Ruins_Level.tscn`` son niveles FPS completos y personalizados creados para el propósito de este tutorial. Presiona el botón ``Play Current Scene``, o :kbd:`F6` en el teclado, y prueba cada uno.
fr: ``Space_Level.tscn`` et ``Ruins_Level.tscn`` sont des niveaux FPS complètement customisés créés pour les besoins de ce tutoriel. Appuyez sur ``Lancer la scène`` ou :kbd:`F6` sur votre clavier, et essayez chacune des deux.
zh_cn: ``Space_Level.tscn`` 和 ``Ruins_Level.tscn`` 是为了本教程而制作的完整的自定义FPS关卡.按 ``Play Current Scene`` 按钮,或按键盘上的 :kbd:`F6`,分别尝试一下.

source: ``Space_Level.tscn`` is more graphically demanding of the GPU than ``Ruins_Level.tscn``. If your computer is struggling to render ``Space_Level.tscn``, try using ``Ruins_Level.tscn`` instead.
es: "Space_Level.tscn" es más exigente gráficamente con la GPU que "Ruins_Level.tscn". Si tu ordenador tiene problemas para renderizar ``Space_Level.tscn``, intenta usar ``Ruins_Level.tscn`` en su lugar.
fr: ``Space_Level.tscn`` est plus demandant graphiquement sur le GPU que ``Ruins_Level.tscn``. Si votre PC n'arrive pas à donner un rendu stable, essayez ``Ruins_Level.tscn`` à la place.
ja: ``Space_Level.tscn`` は ``Ruins_Level.tscn`` よりもグラフィカルにGPUを要求します。コンピューターが ``Space_Level.tscn`` のレンダリングに苦労している場合は、代わりに ``Ruins_Level.tscn`` を使用してみてください。
zh_cn: ``Space_Level.tscn``对于GPU的图形要求比``Ruins_Level.tscn``更高. 如果您的计算机正在努力渲染 ``Space_Level.tscn`` ,请尝试使用 ``Ruins_Level.tscn`` 代替.

source: Due to Godot updates since this tutorial was published, if you are using Godot 3.2 or later, you may need to apply the following changes to the Space Level and Ruins Level scenes:
es: Debido a las actualizaciones de Godot desde que este tutorial fue publicado, si está utilizando Godot 3.2 o una versión posterior, usted podría tener que aplicar los siguientes cambios a las escenas de Space Level y Ruins Level:
zh_cn: 由于本教程发布后Godot的更新,如果您使用的是Godot 3.2或更高版本,您可能需要对Space关卡和Ruins Level关卡场景进行以下更改:

source: Open ``res://assets/Space_Level_Objects/Space_Level.tscn``.
es: Abre ``res://assets/Space_Level_Objects/Space_Level.tscn``.
zh_cn: 打开 ``res://assets/Space_Level_Objects/Space_Level.tscn`` .

source: In the Scene tree dock, select the **Floor_and_Celing** node. In the Inspector dock, if the Mesh Library field under GridMap is ``[empty]``, set it to ``Space_Level_Mesh_Lib.tres`` by dragging the file ``res://assets/Space_Level_Objects/Space_Level_Mesh_Lib.tres`` from the FileSystem dock to that field.
es: En el dock del Scene Tree, seleccione el nodo ** Floor_and_Celing **. En el dock del Inspector, si el campo del Mesh Library debajo de GridMap está ``[empty]``, póngalo en ``Space_Level_Mesh_Lib.tres`` arrastrando el archivo ``res://assets/Space_Level_Objects/Space_Level_Mesh_Lib.tres`` desde el dock FileSystem a ese campo.
zh_cn: 在场景树面板中,选择 **Floor_and_Celing** 节点.在(属性)检查器面板中,如果GridMap下的Mesh Library字段为``[空]``,则将其设置为``Space_Level_Mesh_Lib.tres``,将文件``res://assets/Space_Level_Objects/Space_Level_Mesh_Lib.tres``从文件系统面板拖放到该字段.

source: Do the same for the **Walls** node.
es: Haga lo mismo para el nodo **Walls**.
zh_cn: 对 **Walls** 节点做同样的操作.

source: Open ``res://assets/Ruin_Level_Objects/Ruins_Level.tscn``.
es: Abra ``res://assets/Ruin_Level_Objects/Ruins_Level.tscn``.
zh_cn: 打开 ``res://assets/Ruin_Level_Objects/Ruins_Level.tscn`` .

source: In the Scene tree dock, select the **Floor** node. In the Inspector dock, if the Mesh Library field under GridMap is ``[empty]``, set it to ``Ruin_Level_Mesh_Lib.tres`` by dragging the file ``res://assets/Ruin_Level_Objects/Ruin_Level_Mesh_Lib.tres`` from the FileSystem dock into that field.
es: En el dock del árbol de escenas, seleccione el nodo **Floor**. En el dock del Inspector, si el campo del Mesh Library debajo del GridMap es ``[empty]``, póngalo en ``Ruin_Level_Mesh_Lib.tres`` arrastrando el archivo ``res://assets/Ruin_Level_Objects/Ruin_Level_Mesh_Lib.tres`` desde el dock FileSystem en ese campo.
zh_cn: 在场景树面板中,选择**Floor**节点.在(属性)检查器面板中,如果GridMap下的Mesh Library字段是 ``[空]`` ,则将其设置为 ``Ruin_Level_Mesh_Lib.tres`` ,将文件 ``res://assets/Ruin_Level_Objects/Ruin_Level_Mesh_Lib.tres`` 从文件系统拖放到该字段.

source: You might have noticed there are several :ref:`RigidBody <class_RigidBody>` nodes placed throughout the level. We can place ``RigidBody_hit_test.gd`` on them and then they will react to being hit with bullets, so let's do that!
es: Habrás notado que hay varios nodos :ref:`RigidBody <class_RigidBody>` colocados a lo largo del nivel. Podemos colocar ``RigidBody_hit_test.gd`` en ellos y entonces reaccionarán al ser golpeados con balas, así que hagámoslo!
fr: Vous avez peut-être remarqué qu'il y a plusieurs nœuds :ref:`RigidBody <class_RigidBody>` placés à travers tout le niveau. Nous pouvons placer des ``RigidBody_hit_test.gd`` au sein du niveau afin qu'ils puissent réagissent au fait d'être touché par des balles, c'est parti !
ja: レベル全体にいくつかの :ref:`RigidBody <class_RigidBody>` ノードが配置されていることに気づいたかもしれません。それらに ``RigidBody_hit_test.gd`` を配置すると、弾丸が当たったことに反応するので、そうしてみましょう！
zh_cn: 您可能已经注意到有几个 :ref:`RigidBody <class_RigidBody>` 节点放在整个关卡中. 我们可以在它们上面放置 ``RigidBody_hit_test.gd`` 然后它们会对被子弹击中做出反应,所以让我们这样做吧！

source: Follow the instructions below for either (or both) of the scenes you want to use
es: Siga las siguientes instrucciones para cualquiera (o ambas) de las escenas que quiera usar
fr: Suivez l'instruction en dessous pour une (ou les deux) des scènes que vous voulez utiliser
ja: 使用するシーンのいずれか(または両方)について、以下の指示に従ってください
zh_cn: 按照以下说明选择您要使用的场景中的任何一个(或两个)

source: Now you can fire at all the rigid bodies in either level and they will react to bullets hitting them!
es: ¡Ahora puedes disparar a todos los cuerpos rígidos en cualquier nivel y reaccionarán a las balas que los alcancen!
fr: Maintenant vous pouvez tirer sur tout les "rigid bodies" dans n'importe quel niveau et ils réagiront aux balles les touchant !
ja: これで、いずれかのレベルのすべての剛体に発射でき、弾丸がそれらに衝突したときに反応します！
zh_cn: 现在你可以向任一关卡中的所有刚体开火,它们会对子弹击中而做出反应!

source: Adding ammo
es: Añadiendo munición
fr: Ajout des munitions
ja: 弾薬数を追加する
zh_cn: 添加弹药

source: Now that the player has working guns, let's give them a limited amount of ammo.
es: Ahora que el jugador tiene armas de trabajo, démosle una cantidad limitada de munición.
fr: Maintenant que notre joueur possède des armes à feu, donnons leurs un nombre de munitions limité.
ja: プレイヤーに有効な銃があるので、弾薬の量を制限してみましょう。
zh_cn: 现在游戏角色有枪,让我们给他们一些有限的弹药.

source: Firstly, we need to define a few variables in each of our weapon scripts.
es: En primer lugar, necesitamos definir unas pocas variables en cada uno de nuestros scripts de armas.
fr: Tout d'abord, nous devons définir quelques variables dans chacun de nos scripts d'armes à feu.
ja: まず、各武器スクリプトでいくつかの変数を定義する必要があります。
zh_cn: 首先,我们需要在每个武器脚本中定义一些变量.

source: Open up ``Weapon_Pistol.gd`` and add the following class variables:
es: Abre ``Weapon_Pistol.gd`` y añade las siguientes variables de clase:
fr: Ouvrez ``Weapon_Pistol.gd`` et ajoutez les variables de classe suivantes :
ja: ``Weapon_Pistol.gd`` を開き、次のクラス変数を追加します:
zh_cn: 打开 ``Weapon_Pistol.gd`` 并添加以下类变量:

source: ``ammo_in_weapon``: The amount of ammo currently in the pistol
es: ``ammo_in_weapon``: La cantidad de munición que hay actualmente en la pistola
fr: ``ammo_in_weapon`` : Le nombre de munitions actuellement dans le pistolet
ja: ``ammo_in_weapon``: 現在ピストルにある弾薬の量
zh_cn: ``ammo_in_weapon``:手枪中弹药的数量

source: ``spare_ammo``: The amount of ammo we have left in reserve for the pistol
es: "Spare_ammo": La cantidad de munición que nos queda en reserva para la pistola
fr: ``spare_ammo`` : Le nombre de munitions que nous avons en réserve (disponible pour le rechargement de l'arme) pour le pistolet
ja: ``spare_ammo``: ピストル用に残しておいた弾薬の量
zh_cn: ``spare_ammo``:我们为手枪留下的弹药量

source: ``AMMO_IN_MAG``: The amount of ammo in a fully reloaded weapon/magazine
es: ``AMMO_IN_MAG``: La cantidad de munición en un recarga de arma/cargador
fr: ``AMMO_IN_MAG`` : Le nombre de munitions dans une arme ou un chargeur, quand il/elle est entièrement chargé de munitions
ja: ``AMMO_IN_MAG``: 完全にリロードされた武器/マガジンの弾薬の量
zh_cn: ``AMMO_IN_MAG``:武器或弹仓完全重装后所容纳的弹药数量

source: Now all we need to do is add a single line of code to ``fire_weapon``.
es: Ahora todo lo que tenemos que hacer es añadir una sola línea de código a ``fire_weapon``.
fr: Tout ce qu'il reste à faire est d'ajouter une ligne de code à ``fire_weapon``.
ja: あとは、1行のコードを ``fire_weapon`` に追加するだけです。
zh_cn: 现在我们需要做的就是在 ``fire_weapon`` 中添加一行代码.

source: Add the following right under ``Clone.BULLET_DAMAGE = DAMAGE``: ``ammo_in_weapon -= 1``
es: Añade el siguiente texto justo debajo ``Clone.BULLET_DAMAGE = DAMAGE``: ``ammo_in_weapon -= 1``
fr: Ajoutez ce qui suit juste en dessous : ``Clone.BULLET_DAMAGE = DAMAGE`` : ``ammo_in_weapon -= 1``
ja: ``Clone.BULLET_DAMAGE = DAMAGE`` の下に次を追加します ``ammo_in_weapon-= 1``
zh_cn: 在``Clone.BULLET_DAMAGE = DAMAGE``下添加以下内容:``ammo_in_weapon - = 1``

source: This will remove one from ``ammo_in_weapon`` every time the player fires. Notice we're not checking to see if the player has enough ammo or not in ``fire_weapon``. Instead, we're going to check to see if the player has enough ammo in ``Player.gd``.
es: Esto eliminará a uno de ``ammo_in_weapon`` cada vez que el jugador dispare. Nota que no estamos revisando si el jugador tiene suficiente munición o no en ``fire_weapon``. En su lugar, vamos a comprobar si el jugador tiene suficiente munición en ``Player.gd``.
fr: Cela va décrémenter de un la variable ``ammo_in_weapon`` à chaque fois que le joueur tire. Notez que nous ne vérifions pas si le joueur a assez de munitions ou non dans ``fire_weapon``. Nous allons plutôt vérifier si le joueur a assez de munitions dans ``Player.gd``.
ja: これにより、プレイヤーが発砲するたびに ``ammo_in_weapon`` から1つ削除されます。プレイヤーが ``fire_weapon`` に十分な弾薬があるかどうかを確認していないことに注意してください。代わりに、プレイヤーの ``Player.gd`` で十分な弾薬があるかどうかを確認します。
zh_cn: 这将在玩家每次开火时从 ``ammo_in_weapon`` 中删除一个.请注意,我们不是在 ``fire_weapon`` 中检查玩家是否有足够的弹药,而是在 ``Player.gd`` 中检查玩家是否有足够的弹药.

source: Now we need to add ammo for both the rifle and the knife.
es: Ahora tenemos que añadir munición para el rifle y el cuchillo.
fr: Maintenant nous allons devoir ajouter des munitions pour le fusil et le couteau.
ja: 次に、ライフルとナイフの両方に弾薬数を追加する必要があります。
zh_cn: 现在我们需要为步枪和刀子添加弹药.

source: You may be wondering why we are adding ammo for the knife given it does not consume any ammunition. The reason we want to add ammo to the knife is so we have a consistent interface for all our weapons.
es: Se preguntarán por qué añadimos munición para el cuchillo, ya que no consume ninguna munición. La razón por la que queremos añadir munición al cuchillo es para tener una interfaz consistente para todas nuestras armas.
fr: Vous vous demandez peut-être pourquoi nous ajoutons des munitions pour le couteau étant donné qu'il ne consomme pas de munitions. Nous voulons en ajouter pour avoir une interface consistante pour toutes nos armes.
ja: ナイフは弾薬を消費しないのに、なぜナイフに弾薬数を追加するのか疑問に思われるかもしれません。ナイフに弾薬を追加したい理由は、すべての武器に一貫したインターフェースを持たせるためです。
zh_cn: 你可能想知道为什么我们要为小刀添加弹药,它不消耗任何弹药,之所以要给小刀添加弹药,是为了让我们的所有武器有一个一致的界面.

source: If we did not add ammo variables for the knife, we would have to add checks for the knife. By adding the ammo variables to the knife, we don't need to worry about whether or not all our weapons have the same variables.
es: Si no añadimos variables de munición para el cuchillo, tendríamos que añadir controles para el cuchillo. Al agregar las variables de munición al cuchillo, no tenemos que preocuparnos de si todas nuestras armas tienen las mismas variables.
fr: Si nous n'ajoutons pas de munitions au couteau, nous allons devoir ajouter des vérifications pour le couteau. En ajoutant une variable munitions pour le couteau, nous n'aurons pas à nous préoccuper de si oui ou non toute nos armes ont les mêmes variables.
ja: ナイフの弾薬変数を追加しなかった場合、ナイフのチェックを追加する必要があります。弾薬変数をナイフに追加することにより、すべての武器が同じ変数を持っているかどうかを心配する必要がなくなります。
zh_cn: 如果我们不为刀子添加弹药变量,就必须为刀子添加检查.通过给刀子添加弹药变量,就不用担心武器是否都有相同的变量.

source: Add the following class variables to ``Weapon_Rifle.gd``:
es: Añade las siguientes variables de clase a ``Weapon_Rifle.gd``:
fr: Ajoutez la variable de classe suivante à "Weapon_Rifle.gd" :
ja: 次のクラス変数を ``Weapon_Rifle.gd`` に追加します:
zh_cn: 将以下类变量添加到``Weapon_Rifle.gd``:

source: And then add the following to ``fire_weapon``: ``ammo_in_weapon -= 1``. Make sure that ``ammo_in_weapon -= 1`` is outside of the ``if ray.is_colliding()`` check so the player loses ammo regardless of whether the player hit something or not.
es: Y luego agrega lo siguiente a ``fire_weapon``: ``ammo_in_weapon``. Asegúrate de que ``ammo_in_weapon -= 1`` está fuera de la condición ``if ray.is_colliding()`` para que el jugador pierda munición sin importar si el jugador golpeó algo o no.
fr: Puis ajoutez la ligne suivante à ``fire_weapon`` : ``ammo_in_weapon -= 1``. Assurez-vous que ``ammo_in_weapon -= 1`` soit hors de la vérification``if ray.is_colliding()`` pour que le joueur perdent des munitions qu'importe si il touche quelque chose ou non.
ja: そして、次を ``fire_weapon``に追加します: ``ammo_in_weapon -= 1``。プレイヤーが何かを打ったかどうかに関係なくプレイヤーが弾薬を失うように、\ ``ammo_in_weapon -= 1`` が ``if ray.is_colliding()`` チェックの外にあることを確認してください。
zh_cn: 然后将以下内容添加到``fire_weapon``:``ammo_in_weapon - = 1``. 确保``ammo_in_weapon - = 1``在``if ray.is_colliding()``之后检查,这样无论游戏角色是否击中某个东西,游戏角色都会失去弹药.

source: Now all that's left is the knife. Add the following to ``Weapon_Knife.gd``:
es: Ahora sólo queda el cuchillo. Añade lo siguiente a ``Weapon_Knife.gd``:
fr: Maintenant il ne nous reste que le couteau. Ajoutez l'élément suivant à ``Weapon_Knife.gd`` :
ja: 今残っているのはナイフだけです。 以下を ``Weapon_Knife.gd`` に追加します:
zh_cn: 现在剩下的就是刀. 将以下内容添加到``Weapon_Knife.gd``:

source: Because the knife does not consume ammo, that is all we need to add.
es: Debido a que el cuchillo no consume municiones, eso es todo lo que tenemos que añadir.
fr: Comme le couteau ne consomme pas de munitions c'est tout ce que nous avons besoin d'ajouter.
ja: ナイフは弾薬を消費しないため、追加する必要があるのはこれだけです。
zh_cn: 因为这把刀不消耗弹药,所以我们只需要添加.

source: Now we need to change one thing in ``Player.gd``, that is to say,
es: Ahora tenemos que cambiar una cosa en ``Player.gd``, que es,
fr: Maintenant nous avons besoin de changer une chose dans ``Player.gd``, c'est-à-dire,
ja: ここで、\ ``Player.gd`` の一点を変更する必要があります。つまり、
zh_cn: 现在我们需要在" Player.gd"中更改一件事,也就是说,

source: how we're firing the weapons in ``process_input``. Change the code for firing weapons to the following:
es: cómo estamos disparando las armas en ``process_input``. Cambia el código para disparar las armas a lo siguiente:
fr: comment nous faisons feu avec les armes dans ``process_input`` . Changez le code pour faire feu avec des armes par le suivant :
ja: ``process_input`` で武器を発射する方法です。 武器を発射するためのコードを次のように変更します:
zh_cn: 如何在 ``process_input`` 中发射武器.将发射武器的代码改为:

source: Now the weapons have a limited amount of ammo, and will stop firing when the player runs out.
es: Ahora las armas tienen una cantidad limitada de munición, y dejarán de disparar cuando al jugador se le termine.
fr: Maintenant, les armes ont une quantité limitée de munitions et celles-ci arrêterons de faire feu lorsque le joueur n'en aura plus.
ja: これで武器の弾薬量が制限され、プレイヤーが使い果たすと発砲が停止します。
zh_cn: 现在武器的弹药数量有限,并且当游戏角色用尽时将停止射击.

source: Ideally, we'd like to let the player be able to see how much ammo is left. Let's make a new function called ``process_UI``.
es: Lo ideal sería que el jugador pudiera ver cuánta munición le queda. Hagamos una nueva función llamada ``process_UI``.
fr: Idéalement, nous aimerions que le joueur puisse savoir combien de munitions il lui reste. Faisons une nouvelle fonction appelé ``process_UI``.
ja: プレイヤーが弾薬の残量を確認できると理想的です。\ ``process_UI`` という新しい関数を作成しましょう。
zh_cn: 理想情况下,我们希望让玩家能够看到还剩多少弹药.让我们做一个新的函数,叫做 ``process_UI`` .

source: First, add ``process_UI(delta)`` to ``_physics_process``.
es: Primero, agrega ``process_UI(delta)`` al ``_physics_process``.
fr: Premièrement, ajoutez ``process_UI(delta)`` à ``_physics_process``.
ja: 最初に、\ ``process_UI(delta)`` を ``_physics_process`` に追加します。
zh_cn: 首先,将 ``process_UI(delta)`` 添加到 ``_physics_process``.

source: Now add the following to ``Player.gd``:
es: Ahora agrega lo siguiente a ``Player.gd``:
fr: Maintenant ajoutez ce qui suit à ``Player.gd`` :
ja: 以下を ``Player.gd`` に追加します:
zh_cn: 现在将以下内容添加到 ``Player.gd``:

source: Let's go over what's happening:
es: Repasemos lo que está pasando:
fr: Regardons ce qui ce passe :
ja: 何が起こっているのか見てみましょう:
zh_cn: 让我们回顾一下发生的事情:

source: Firstly, we check to see if the current weapon is either ``UNARMED`` or ``KNIFE``. If it is, we change the ``UI_status_label``'s text to only show the player's health since ``UNARMED`` and ``KNIFE`` do not consume ammo.
es: En primer lugar, comprobamos si el arma actual está ``UNARMED`` o ``KNIFE``. Si lo es, cambiamos el texto de la etiqueta "UI_status_label" para que sólo muestre la salud del jugador ya que ``UNARMED`` y ``KNIFE`` no consumen munición.
fr: Premièrement, nous vérifions si l'arme actuelle est soit ``UNARMED`` ou ``KNIFE``. Si c'est le cas, nous changeons le texte de ``UI_status_label`` pour afficher uniquement la vie du joueur étant donné que ``UNARMED`` et ``KNIFE`` ne consomment pas de munitions.
ja: まず、現在の武器が ``UNARMED`` または ``KNIFE`` であるかどうかを確認します。 そうであれば、\ ``UNARMED`` と ``KNIFE`` は弾薬を消費しないため、\ ``UI_status_label`` のテキストを変更してプレイヤーの健康状態のみを表示します。
zh_cn: 首先,我们检查当前的武器是 ``UNARMED`` 还是 ``KNIFE`` .如果是,我们改变 ``UI_status_label`` 的文字,只显示玩家的健康状况,因为 ``UNARMED`` 和 ``KNIFE`` 不消耗弹药.

source: If the player is using a weapon that consumes ammo, we first get the weapon node.
es: Si el jugador usa un arma que consume municiones, primero obtenemos el nodo de armas.
fr: Si le joueur utilise une arme qui consomme des munitions, nous allons d'abord récupérer le nœud de l'arme.
ja: プレイヤーが弾薬を消費する武器を使用している場合、最初に武器ノードを取得します。
zh_cn: 如果游戏角色正在使用消耗弹药的武器,我们首先获得武器节点.

source: Then we change ``UI_status_label``'s text to show the player's health, along with how much ammo the player has in the weapon and how much spare ammo the player has for that weapon.
es: Luego cambiamos el texto de "UI_status_label" para mostrar la salud del jugador, junto con la cantidad de munición que tiene en el arma y la munición de sobra que tiene para esa arma.
fr: Puis nous changeons le texte ``UI_status_label`` pour afficher la vie du joueur, tout en affichant combien de munitions il reste au joueur dans son arme et combien de munitions il possède dans son inventaire pour cette arme.
ja: 次に、プレイヤーの健康状態と、プレイヤーが武器に持っている弾薬の量と、プレイヤーがその武器のために持っている予備弾薬の量を表示するために ``UI_status_label`` のテキストを変更します。
zh_cn: 然后我们将 ``UI_status_label`` 的文字改为显示玩家的健康状况,以及玩家在武器中的弹药数量和该武器的备用弹药数量.

source: Now we can see how much ammo the player has through the HUD.
es: Ahora podemos ver cuanta munición tiene el jugador a través del HUD.
fr: Maintenant nous pouvons voir combien de munitions le joueur possède au travers du HUD.
ja: これで、プレイヤーがHUDを通じてどれだけの弾薬を持っているかを確認できます。
zh_cn: 现在我们可以看到游戏角色通过HUD获得了多少弹药.

source: Adding reloading to the weapons
es: Añadiendo la recarga a las armas
fr: Ajout du rechargement des armes
ja: 武器へのリロードの追加
zh_cn: 添加重装到武器

source: Now that the player can run out of ammo, we need a way to let the player fill them back up. Let's add reloading next!
es: Ahora que el jugador se puede quedar sin municiones, necesitamos una forma de dejar que el jugador las llene de nuevo. ¡Añadamos la recarga a continuación!
fr: Maintenant que le joueur peut arriver à court de munitions, nous devons lui donner un moyen de recharger. Ajoutons le rechargement maintenant !
ja: プレイヤーが弾薬を使い果たすことができるようになったので、プレイヤーにそれらを補充させる方法が必要です。 次にリロードを追加しましょう！
zh_cn: 现在游戏角色可以用尽弹药,我们需要一种方法让游戏角色填补它们. 我们接下来再添加重装！

source: For reloading, we need to add a few more variables and a function to every weapon.
es: Para recargar, necesitamos añadir unas cuantas variables más y una función a cada arma.
fr: Pour recharger, nous avons besoin d'ajouter quelque variables en plus et une fonction pour chaque arme.
ja: リロードのために、すべての武器にいくつかの変数と関数を追加する必要があります。
zh_cn: 对于重装,我们需要给每把武器增加一些变量和一个函数.

source: ``CAN_RELOAD``: A boolean to track whether this weapon has the ability to reload
es: ``CAN_RELOAD``: Un booleano para rastrear si esta arma tiene la capacidad de recargar
fr: "CAN_RELOAD" : Un booléen pour savoir si oui ou non l'arme à la capacité de recharger
ja: ``CAN_RELOAD``: この武器にリロード機能があるかどうかを追跡するブール値
zh_cn: ``CAN_RELOAD``:一个布尔值,用于跟踪此武器是否具有重新加载的能力
