Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_four.po
Languages: es, fr, ja, zh_cn

source: Part 4
es: Parte 4
fr: Partie 4
ja: パート4
zh_cn: 第4部分

source: Part overview
es: Resumen
fr: Aperçu cette partie
ja: パートの概要

source: In this part, we will be adding health pickups, ammo pickups, targets the player can destroy, support for joypads, and add the ability to change weapons with the scroll wheel.
es: En esta parte, añadiremos las recogidas de salud, las recogidas de munición, los objetivos que el jugador puede destruir, el soporte para los joypads, y añadiremos la capacidad de cambiar las armas con la rueda de desplazamiento.
fr: Dans cette partie, nous allons ajouter des bonus de santé, des bonus de munitions, des cibles que le joueur peut détruire, le support des manettes ainsi que la possibilité de changer d'arme avec la molette de la souris.
ja: このパートでは、回復アイテムピックアップ、弾薬ピックアップ、プレイヤーが破壊できるターゲット、ジョイパッドのサポート、スクロールホイールで武器を変更する機能を追加します。

source: You are assumed to have finished :ref:`doc_fps_tutorial_part_three` before moving on to this part of the tutorial. The finished project from :ref:`doc_fps_tutorial_part_three` will be the starting project for part 4
es: Se supone que has terminado :ref:`doc_fps_tutorial_part_three` antes de pasar a esta parte del tutorial. El proyecto terminado de :ref:`doc_fps_tutorial_part_three` será el proyecto inicial de la parte 4
fr: Vous êtes supposés avoir terminé la :ref:`doc_fps_tutorial_part_three` avant de pouvoir continuer sur cette partie du tutoriel. Le projet fini de :ref:`doc_fps_tutorial_part_three` sera le projet de départ de la partie 4
ja: チュートリアルのこの部分に進む前に、\ :ref:`doc_fps_tutorial_part_three` を終了していることが前提となります。\ :ref:`doc_fps_tutorial_part_three` の完成したプロジェクトは、パート4の開始プロジェクトになります
zh_cn: 在继续本教程的这一部分之前，假设您已完成 :ref:`doc_fps_tutorial_part_three`。 完成的项目来自 :ref:`doc_fps_tutorial_part_three`将成为第4部分的起始项目

source: Let's get started!
es: ¡Vamos a empezar!
fr: Commençons tout de suite !
ja: では、始めましょう！
zh_cn: 让我们开始吧！

source: Adding joypad input
es: Añadiendo la entrada del joypad
fr: Ajout des contrôles de manette
ja: ジョイパッド入力を追加する
zh_cn: 添加游戏手柄输入

source: In Godot, any game controller is referred to as a joypad. This includes: Console controllers, Joysticks (like for flight simulators), Wheels (like for driving simulators), VR Controllers, and more!
es: En Godot, cualquier controlador de juego se conoce como un joypad. Esto incluye: ¡Controladores de consola, Joysticks (como los de los simuladores de vuelo), Ruedas (como los de los simuladores de conducción), Controladores VR, y más!
fr: Dans Godot, n'importe quelle manette est appelée joypad. Cela inclut : manettes de console, Joysticks (venant de simulateurs de vol), volants (venant de simulateurs de conduite automobile), manettes VR, et plus encore !
ja: Godotでは、ゲームコントローラーはジョイパッドと呼ばれます。これには、コンソールコントローラー、ジョイスティック(フライトシミュレーターなど)、ホイール(ドライビングシミュレーターなど)、VRコントローラーなどが含まれます！

source: Firstly, we need to change a few things in our project's input map. Open up the project settings and select the ``Input Map`` tab.
es: En primer lugar, necesitamos cambiar algunas cosas en el mapa de entrada de nuestro proyecto. Abre la configuración del proyecto y selecciona la pestaña ``Input Map``.
fr: Premièrement, nous devons changer certaines choses dans nos paramètres d'entrée de projet. Ouvrez les paramètres de projet et sélectionnez l'onglet ``Input Map``.
ja: まず、プロジェクトの入力マップでいくつかのことを変更する必要があります。プロジェクト設定を開き、[インプットマップ]タブを選択します。

source: Now we need to add some joypad buttons to our various actions. Click the plus icon and select ``Joy Button``.
es: Ahora tenemos que añadir algunos botones del joypad a nuestras diversas acciones. Haz clic en el icono más y selecciona ``Joy Button``.
fr: Nous devons maintenant associer des boutons de contrôleurs à nos différentes actions. Cliquez sur l'icône plus et sélectionnez ``Joy Button``.
ja: 次に、さまざまなアクションにいくつかのジョイパッドボタンを追加する必要があります。プラスアイコンをクリックして、\ ``ゲームパッドのボタン`` を選択します。
zh_cn: 现在我们需要为我们的各种动作添加一些游戏手柄按钮。 单击加号图标，然后选择``欢乐按钮``。

source: Feel free to use whatever button layout you want. Make sure that the device selected is set to ``0``. In the finished project, we will be using the following:
es: Siéntete libre de usar la disposición de los botones que quieras. Asegúrate de que el dispositivo seleccionado esté puesto en ``0``. En el proyecto terminado, usaremos lo siguiente:
fr: N'hésitez pas à utiliser la disposition de bouton que vous préférez. Faites attention à ce que l'appareil sélectionné est réglé sur ``0``. Dans le projet terminé, nous utiliserons ce qui suit :
ja: 任意のボタンレイアウトを自由に使用できます。選択したデバイスが ``0`` に設定されていることを確認してください。完成したプロジェクトでは、次のものを使用します:
zh_cn: 随意使用您想要的任何按钮布局。 确保所选设备设置为``0``。 在完成的项目中，我们将使用以下内容:

source: These are already set up for you if you downloaded the starter assets
es: Estos ya están configurados para ti si descargaste los activos de recursos
fr: Ceux-ci sont déjà configurés pour vous si vous avez téléchargé les ressources de démarrage
ja: スターターアセットをダウンロードした場合、これらは既に設定されています
zh_cn: 如果您下载了启动资源，则已为您设置了这些内容

source: Once you are happy with the input, close the project settings and save.
es: Una vez que esté satisfecho con la entrada, cierre la configuración del proyecto y guárdela.
fr: Lorsque vous êtes satisfaits de vos entrées, fermez les paramètres de projet et sauvegardez.
ja: 入力に満足したら、プロジェクト設定を閉じて保存します。
zh_cn: 对输入感到满意后，关闭项目设置并保存。

source: Now let's open up ``Player.gd`` and add joypad input.
es: Ahora abramos ``Player.gd`` y agreguemos la entrada del joypad.
fr: Ouvrez maintenant ``Player.gd`` et ajoutez une entrée de contrôleur.
ja: ``Player.gd`` を開いて、ジョイパッド入力を追加しましょう。
zh_cn: 现在让我们打开 ``Player.gd`` 并添加joypad输入。

source: First, we need to define a few new class variables. Add the following class variables to ``Player.gd``:
es: Primero, necesitamos definir algunas nuevas variables de clase. Añade las siguientes variables de clase a ``Player.gd``:
fr: D'abord, nous devons définir de nouvelles variables de classe. Ajoutez les suivantes dans ``Player.gd`` :
ja: まず、いくつかの新しいクラス変数を定義する必要があります。 以下のクラス変数を ``Player.gd`` に追加してください:
zh_cn: 首先，我们需要定义一些新的类变量。 将以下类变量添加到``Player.gd``:

source: Let's go over what each of these does:
es: Veamos lo que hace cada uno de estos:
fr: Parcourons les rôles de chacun d'entre eux :
ja: これらのそれぞれが何をするかを見てみましょう:

source: ``JOYPAD_SENSITIVITY``: This is how fast the joypad's joysticks will move the camera.
es: ``JOYPAD_SENSITIVITY``: Esta es la rapidez con la que los joysticks del Joypad moverán la cámara.
fr: ``JOYPAD_SENSITIVITY`` : C'est la vitesse à laquelle les joysticks du contrôleur vont bouger la caméra.
ja: ``JOYPAD_SENSITIVITY``: これは、ジョイパッドのジョイスティックがカメラを動かす速度です。
zh_cn: ``JOYPAD SENSITIVITY``:这是游戏手柄操纵杆移动相机的速度。

source: ``JOYPAD_DEADZONE``: The dead zone for the joypad. You may need to adjust depending on your joypad.
es: ``JOYPAD_DEADZONE``: La zona muerta para el joypad. Puede que tengas que ajustarlo dependiendo de tu joypad.
fr: ``JOYPAD_DEADZONE`` : Les zones mortes du contrôleur. Vous pouvez les ajuster en fonction de son type.
ja: ``JOYPAD_DEADZONE``: ジョイパッドのデッドゾーン。ジョイパッドに応じて調整が必要な場合があります。
zh_cn: ``JOYPAD DEADZONE``:游戏手柄的死区。 您可能需要根据您的游戏手柄进行调整。

source: Many joypads jitter around a certain point. To counter this, we ignore any movement within a radius of JOYPAD_DEADZONE. If we did not ignore said movement, the camera would jitter.
es: Muchos mandos se mueven alrededor de un cierto punto. Para contrarrestar esto, ignoramos cualquier movimiento dentro de un radio de JOYPAD_DEADZONE. Si no ignoráramos dicho movimiento, la cámara se podría temblar.
fr: Beaucoup de contrôleurs tremblent à un moment donné. Pour contrer cela, nous ignorons le mouvement dans un certain rayon du JOYPAD_DEADZONE. Si nous n’ignorions pas ce mouvement, la caméra tremblerait.
ja: 多くのジョイパッドは、特定のポイントを中心にジッタを起こします。これに対抗するために、半径JOYPAD_DEADZONE内の動きは無視します。この動きを無視しないと、カメラが揺れます。

source: Also, we are defining ``JOYPAD_SENSITIVITY`` as a variable instead of a constant because we'll later be changing it.
es: Además, estamos definiendo ``JOYPAD_SENSITIVITY`` como una variable en lugar de una constante porque más tarde la cambiaremos.
fr: De plus, nous définissons ``JOYPAD_SENSITIVITY`` comme une variable plutôt que comme une constante car nous allons la changer un peu plus tard.
ja: また、\ ``JOYPAD_SENSITIVITY`` は定数ではなく変数として定義しています。これは後で変更するためです。
zh_cn: 此外，我们将 ``JOYPAD_SENSITIVITY`` 定义为变量而不是常量，因为我们稍后会更改它。

source: Now we are ready to start handling joypad input!
es: ¡Ahora estamos listos para empezar a manejar la entrada del joypad!
fr: Nous sommes maintenant prêts à manipuler les entrées de contrôleur !
ja: これで、ジョイパッド入力の処理を開始する準備ができました！
zh_cn: 现在我们准备开始处理游戏手柄输入了！

source: In ``process_input``, add the following code just before ``input_movement_vector = input_movement_vector.normalized()``:
es: En ``process_input``, añade el siguiente código justo antes de ``input_movement_vector = input_movement_vector.normalized()``:
fr: Dans ``process_input``, ajoutez le code suivant juste avant ``input_movement_vector = input_movement_vector.normalized()`` :
ja: ``process_input`` で、\ ``input_movement_vector = input_movement_vector.normalized()`` の直前に次のコードを追加します:

source: Let's go over what we're doing.
es: Repasemos lo que estamos haciendo.
fr: Détaillons ce que nous faisons.
ja: 私たちがやっていることを見てみましょう。
zh_cn: 让我们回顾一下我们正在做的事情。

source: Firstly, we check to see if there is a connected joypad.
es: En primer lugar, comprobamos si hay un Joypad conectado.
fr: Tout d'abord, nous vérifions si un contrôleur est connecté.
ja: まず、接続されたジョイパッドがあるかどうかを確認します。

source: If there is a joypad connected, we then get its left stick axes for right/left and up/down. Because a wired Xbox 360 controller has different joystick axis mapping based on OS, we will use different axes based on the OS.
es: Si hay un joypad conectado, entonces tenemos sus ejes de palo izquierdo para derecha/izquierda y arriba/abajo. Debido a que un controlador Xbox 360 con cable tiene diferentes mapeos de ejes de joystick basados en el sistema operativo, usaremos diferentes ejes basados en el sistema operativo.
fr: Si un contrôleur est connecté, nous récupérons alors les axes droite/gauche et haut/bas pour le stick gauche. Étant donné qu'une manette de Xbox 360 a un mapping de ses axes basé sur l'OS, nous utiliserons différents axes en fonction de l'OS.
ja: ジョイパッドが接続されている場合は、左スティックの軸を上/下/左/右に取得します。有線のXbox 360コントローラーにはOSによって異なるジョイスティック軸のマッピングがあるため、OSに基づいた異なる軸を使用します。
zh_cn: 如果连接了一个游戏手柄，我们就可以获得左/右和左/上的左摇杆轴。 由于有线Xbox 360控制器具有基于OS的不同操纵杆轴映射，因此我们将基于OS使用不同的轴。

source: This tutorial assumes you are using a XBox 360 or a PlayStation wired controller. Also, I do not (currently) have access to a Mac computer, so the joystick axes may need changing. If they do, please open a GitHub issue on the Godot documentation repository! Thanks!
es: Este tutorial asume que estás usando un XBox 360 o un controlador con cable de PlayStation. Además, no tengo (actualmente) acceso a un ordenador Mac, así que puede que haya que cambiar los ejes del joystick. Si es así, por favor, abre un problema de GitHub en el repositorio de documentación de Godot! ¡Gracias!
fr: Nous supposons dans ce tutoriel que vous utilisez une manette de Xbox 360 ou une manette Playstation filaire. Je n'ai également (pour le moment) pas accès à un Mac donc les axes de joystick peuvent changer. Si c'est le cas, ouvrez un ticket Github sur le dépôt de la documentation Godot ! Merci !

source: Next, we check to see if the joypad vector length is within the ``JOYPAD_DEADZONE`` radius. If it is, we set ``joypad_vec`` to an empty Vector2. If it is not, we use a scaled Radial Dead zone for precise dead zone calculation.
es: A continuación, comprobamos si la longitud del vector del joypad está dentro del radio ``JOYPAD_DEADZONE``. Si es así, ponemos ``joypad_vec`` en un Vector2 vacío. Si no lo está, usamos una zona Muerta Radial escalada para un cálculo preciso de la zona muerta.
fr: Nous devons ensuite vérifier si la norme du vecteur du contrôleur est comprise dans le rayon ``JOYPAD_DEADZONE``. Si c'est le cas, on affecte un Vector2 vide à ``joypad_vec``. Si ce n'est pas le cas, on utilise une zone morte radiale à l'échelle pour des calculs précis de zone morte.
ja: 次に、ジョイパッドのベクトルの長さが ``JOYPAD_DEADZONE`` 半径内にあるかどうかを確認します。もしそうなら、 ``joypad_vec`` を空のVector2に設定します。そうでない場合は、正確なデッドゾーンの計算にスケーリングされたラジアルデッドゾーンを使用します。

source: You can find a great article explaining all about how to handle joypad/controller dead zones `here <https://web.archive.org/web/20191208161810/http://www.third-helix.com/2013/04/12/doing-thumbstick-dead-zones-right.html>`__.
es: Puedes encontrar un gran artículo explicando todo sobre cómo manejar las zonas muertas del joypad/controlador `aquí <https://web.archive.org/web/20191208161810/http://www.third-helix.com/2013/04/12/doing-thumbstick-dead-zones-right.html>`__.
fr: Vous pouvez trouver un bon article qui explique tout sur la façon de gérer les zones mortes des contrôleurs : `ici <https://web.archive.org/web/20191208161810/http://www.third-helix.com/2013/04/12/doing-thumbstick-dead-zones-right.html>`__.
ja: ジョイパッド / コントローラーのデッドゾーンの処理方法について、すべてを説明する素晴らしい記事が\ `ここにあります <https://web.archive.org/web/20191208161810/http://www.third-helix.com/2013/04/12/doing-thumbstick-dead-zones-right.html>`_ (英語)。

source: We're using a translated version of the scaled radial dead zone code provided in that article. The article is a great read, and I highly suggest giving it a look!
es: Estamos usando una versión traducida del código de la zona muerta radial escalada que se proporciona en ese artículo. El artículo es una gran lectura, ¡y sugiero encarecidamente que le echen un vistazo!
fr: Nous utilisons une translation du vecteur radial de zone morte mis à l'échelle fourni dans cet article. Celui-ci est très intéressant et je vous suggère d'aller y jeter un œil !
ja: この記事で提供されているスケーリングされた放射状デッドゾーンコードの翻訳バージョンを使用しています。この記事は素晴らしい読み物です。ぜひご覧ください！
zh_cn: 我们正在使用该文章中提供的缩放径向死区代码的翻译版本。 这篇文章很精彩，我强烈建议您看看！

source: Finally, we add ``joypad_vec`` to ``input_movement_vector``.
es: Finalmente, añadimos ``joypad_vec`` a ``input_movement_vector``.
fr: Enfin, nous ajoutons ``joypad_vec`` à ``input_movement_vector``.
ja: 最後に、\ ``joypad_vec`` を ``input_movement_vector`` に追加します。
zh_cn: 最后，我们将 ``joypad_vec`` 添加到 ``input_movement_vector`` 。

source: Remember how we normalize ``input_movement_vector``? This is why! If we did not normalize ``input_movement_vector``, the player could move faster if they pushed in the same direction with both the keyboard and the joypad!
es: ¿Recuerdas cómo normalizamos el ``input_movement_vector``? ¡Esto es el porqué! !Si no normalizamos el ``input_movement_vector``, el jugador puede moverse más rápido si empuja en la misma dirección con el teclado y el joypad!
fr: Vous vous souvenez que nous avons normalisé ``input_movement_vector`` ? Voilà pourquoi ! Si nous n'avions pas normalisé ``input_movement_vector``, le joueur pourrait se déplacer plus vite s'il bougeait dans la même direction avec un clavier et un contrôleur !
ja: ``input_movement_vector`` を正規化する方法を覚えていますか？これがその理由です！ ``input_movement_vector`` を正規化しない場合、キーボードとジョイパッドの両方で同じ方向に押した場合、プレイヤーはより速く動いてしまいます！

source: Make a new function called ``process_view_input`` and add the following:
es: Haz una nueva función llamada ``process_view_input`` y añade lo siguiente:
fr: Écrivez une nouvelle fonction appelée ``process_view_input`` et ajoutez ce qui suit :
ja: ``process_view_input`` という新しい関数を作成し、次のように追加します:
zh_cn: 创建一个名为 ``process_view_input`` 的新函数并添加以下内容:

source: Let's go over what's happening:
es: Repasemos lo que está pasando:
fr: Regardons ce qui ce passe :
ja: 何が起こっているのか見てみましょう:
zh_cn: 让我们回顾一下发生的事情:

source: Firstly, we check the mouse mode. If the mouse mode is not ``MOUSE_MODE_CAPTURED``, we want to return, which will skip the code below.
es: En primer lugar, comprobamos el modo del ratón. Si el modo del ratón no es ``MOUSE_MODE_CAPTURED``, queremos volver, lo que hará que se salte el código de abajo.
fr: Nous allons tout d'abord vérifier le nœud de la souris. Si celui-ci n'est pas ``MOUSE_MODE_CAPTURED``, nous allons faire un return, ce qui va passer tout le code en dessous.
ja: まず、マウスモードを確認します。マウスモードが ``MOUSE_MODE_CAPTURED`` ではない場合、関数から戻りたいので、それ以降のコードをスキップします。

source: Next, we define a new :ref:`Vector2 <class_Vector2>` called ``joypad_vec``. This will hold the right joystick position. Based on the OS, we set its values so it is mapped to the proper axes for the right joystick.
es: A continuación, definimos un nuevo :ref:`Vector2 <class_Vector2>` llamado ``joypad_vec``. Esto mantendrá la posición correcta del joystick. Basándonos en el sistema operativo, fijamos sus valores para que se mapee a los ejes adecuados para el joystick derecho.
fr: Ensuite, nous définissons un nouveau :ref:`Vector2 <class_Vector2>` appelé ``joypad_vec``. Il va stocker la position du joystick droit. En se basant sur l'OS, nous allons définir sa valeur de façon à ce qu'il soit mappé aux bons axes du joystick droit.
ja: 次に、\ ``joypad_vec`` という新しい :ref:`Vector2 <class_Vector2>` を定義します。これにより、正しいジョイスティックの位置が保持されます。 OSに基づいて、適切なジョイスティックの適切な軸にマップされるように値を設定します。

source: As stated above, I do not (currently) have access to a Mac computer, so the joystick axes may need changing. If they do, please open a GitHub issue on the Godot documentation repository! Thanks!
es: Como ya se ha dicho, no tengo (actualmente) acceso a un ordenador Mac, así que puede que haya que cambiar los ejes de los joysticks. ¡Si lo hacen, por favor, abran un número de GitHub en el repositorio de documentación de Godot! ¡Gracias!
fr: Comme indiqué ci-dessus, je n'ai (actuellement) pas accès à un ordinateur Mac donc les axes de joystick peuvent changer. Si c'est le cas, veuillez ouvrir un ticket Github sur le dépôt de la documentation ! Merci !
ja: 上で述べたように、私は(現在)Macコンピューターにアクセスできないので、ジョイスティックの軸を変更する必要があるかもしれません。もしそうなら、GodotドキュメントリポジトリでGitHub issueを開いてください！よろしく！

source: We then account for the joypad's dead zone, exactly like in ``process_input``.
es: Entonces tenemos en cuenta la zona muerta del Joypad, exactamente como en ``process_input``.
fr: Nous tenons compte ensuite de la zone morte du contrôleur exactement comme dans ``process_input``.
ja: 次に、\ ``process_input`` とまったく同じように、ジョイパッドのデッドゾーンを考慮します。
zh_cn: 然后我们考虑了joypad的死区，就像在 ``process_input`` 中一样。

source: Then, we rotate ``rotation_helper`` and the player's :ref:`KinematicBody <class_KinematicBody>` using ``joypad_vec``.
es: Luego, rotamos ``rotation_helper`` y el jugador :ref:`KinematicBody <class_KinematicBody>` usando ``joypad_vec``.
fr: Ensuite, nous faisons tourner ``rotation_helper`` et le :ref:`KinematicBody <class_KinematicBody>` du joueur en utilisant ``joypad_vec``.
ja: 次に、\ ``rotation_helper`` とプレイヤーの :ref:`KinematicBody <class_KinematicBody>` を ``joypad_vec`` を使用して回転させます。

source: Notice how the code that handles rotating the player and ``rotation_helper`` is exactly the same as the code in ``_input``. All we've done is change the values to use ``joypad_vec`` and ``JOYPAD_SENSITIVITY``.
es: Fíjate en cómo el código que maneja la rotación del jugador y la ``rotation_helper`` es exactamente el mismo que el código en ``_input``. Todo lo que hemos hecho es cambiar los valores para usar ``joypad_vec`` y ``JOYPAD_SENSITIVITY``.
fr: Notez comment le code qui gère la rotation du joueur et de ``rotation_helper`` est exactement le même code que celui dans ``_input``. Tout ce que nous avons fait, c'est de changer les valeurs en utilisant ``joypad_vec`` et ``JOYPAD_SENSITIVITY``.
ja: プレイヤーと ``rotation_helper`` の回転を処理するコードが ``_input`` のコードとまったく同じであることに注意してください。行ったことは、\ ``joypad_vec`` と ``JOYPAD_SENSITIVITY`` を使用するように値を変更することだけです。
zh_cn: 注意处理旋转游戏角色和 ``rotation_helper`` 的代码与 ``_input`` 中的代码完全相同。 我们所做的就是更改值以使用 ``joypad_vec`` 和 ``JOYPAD_SENSITIVITY`` 。

source: Due to a few mouse-related bugs on Windows, we cannot put mouse rotation in ``process_view`` as well. Once these bugs are fixed, this will likely be updated to place the mouse rotation here in ``process_view_input`` as well.
es: Debido a algunos errores relacionados con el ratón en Windows, no podemos poner la rotación del ratón en ``process_view`` también. Una vez que estos errores sean corregidos, esto probablemente se actualizará para colocar la rotación del ratón aquí en ``process_view_input`` también.
fr: A cause de certains bugs de souris sur Windows, nous ne pouvons pas mettre le rotation de la souris dans ``process_view`` non plus. Une fois que ces bugs seront réglés, nous mettrons probablement à jour ce tutoriel pour placer la rotation de la souris dans ``process_view_input`` aussi.
ja: Windows上ではマウス関連のバグがいくつかあるため、\ ``process_view`` にマウスの回転をプットできません。 これらのバグが修正されると、これもおそらく ``process_view_input`` にマウスの回転をプットするように更新されます。

source: Finally, we clamp the camera's rotation so the player cannot look upside down.
es: Finalmente, fijamos la rotación de la cámara para que el jugador no pueda mirar al revés.
fr: Enfin, nous limitons la valeur de rotation de la caméra de façon à ce que le joueur ne puisse pas regarder à l'envers.
ja: 最後に、プレイヤーが逆さまに見えないようにカメラの回転を固定します。
zh_cn: 最后，我们夹住相机的旋转，这样游戏角色就不会颠倒过来。

source: The last thing we need to do is add ``process_view_input`` to ``_physics_process``.
es: La última cosa que necesitamos hacer es añadir ``process_view_input`` a ``_physics_process``.
fr: La dernière chose que nous devons faire, c'est d'ajouter ``process_view_input`` à ``_physics_process``.
ja: 最後に、\ ``_physics_process`` に ``process_view_input`` を追加します。
zh_cn: 我们需要做的最后一件事是将 ``process_view_input`` 添加到 ``_physics_process`` 中。

source: Once ``process_view_input`` is added to ``_physics_process``, you should be able to play using a joypad!
es: Una vez que ``process_view_input`` sea añadido a ``physics_process``, deberías ser capaz de jugar usando un joypad!
fr: Une fois que ``process_view_input`` est inclus dans ``_physics_process``, nous devrions être en mesure de jouer avec un contrôleur !
ja: ``process_view_input`` が ``_physics_process`` に追加されると、ジョイパッドを使用してプレイできるようになります！
zh_cn: 一旦 ``process_view_input`` 被添加到 ``_physics_process`` ，您应该能够使用游戏手柄玩！

source: I decided not to use the joypad triggers for firing because we'd then have to do some more axis managing, and because I prefer to use a shoulder buttons to fire.
es: Decidí no usar los disparadores del joypad para disparar porque entonces tendríamos que hacer un poco más de manejo del eje, y porque prefiero usar los botones del hombro para disparar.
fr: J'ai décidé de ne pas utiliser de déclencheurs de contrôleurs car nous aurions alors à gérer plus de choses avec les axes et aussi car je préfère utiliser un bumper pour tirer.
ja: ジョイパッドのトリガーを使用しないことにしたのは、軸の管理をもう少し行う必要があるのと、ショルダーボタンを使用して発砲することが好まれるからです。
zh_cn: 我决定不使用游戏手柄来触发，因为我们必须做更多的轴管理，因为我更喜欢使用肩部按钮来开火。
