Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_one.po
Languages: es, fr, zh_cn

source: To use the :ref:`Spatial <class_Spatial>` node's local directional vectors, we use this code:
es: Para usar los vectores direccionales locales del nodo :ref:`Spatial <class_Spatial>`, usaremos este código:
fr: Pour utiliser les vecteurs directionnels locaux du nœud :ref:`Spatial <class_Spatial>`, nous utilisons ce code :
zh_cn: 要使用 :ref:`Spatial <class_Spatial>` 节点的本地方向向量，我们使用以下代码:

source: Here is what local space looks like in 2D:
es: Así es como se ve el espacio local en 2D:
fr: Voici à quoi ressemble l'espace local en 2D :
zh_cn: 以下是2D中的局部空间:

source: Here is what the :ref:`Spatial <class_Spatial>` gizmo shows when you are using local space mode. Notice how the arrows follow the rotation of the object on the left, which looks exactly the same as the 3D example for local space.
es: Esto es lo que el gizmo :ref:`Spatial <class_Spatial>` muestra cuando usas el modo de espacio local. Fíjate en cómo las flechas siguen la rotación del objeto de la izquierda, que se ve exactamente igual que el ejemplo 3D para el espacio local.
fr: Voici ce que le gadget :ref:`Spatial <class_Spatial>` affiche lorsque vous utilisez le mode espace local. Remarquez comment les flèches suivent la rotation de l'objet à gauche, qui ressemble exactement à l'exemple 3D pour l'espace local.
zh_cn: 以下是 :ref:`Spatial <class_Spatial>` 装置在您使用本地空间模式时显示。 注意箭头如何跟随左侧对象的旋转，这看起来与局部空间的3D示例完全相同。

source: You can change between local and world space modes by pressing T or the little cube button when you have a :ref:`Spatial <class_Spatial>` based node selected.
fr: Vous pouvez passer du mode espace local au mode espace mondial en appuyant sur T ou sur le petit bouton cube lorsque vous avez sélectionné un nœud basé sur :ref:`Spatial <class_Spatial>`.

source: Local vectors are confusing even for more experienced game developers, so do not worry if this all doesn't make a lot of sense. The key thing to remember about local vectors is that we are using local coordinates to get direction from the object's point of view, as opposed to using world vectors, which give direction from the world's point of view.
es: Los vectores locales son confusos incluso para los desarrolladores de juegos más experimentados, así que no te preocupes si todo esto no tiene mucho sentido. Lo que hay que recordar sobre los vectores locales es que estamos usando coordenadas locales para obtener la dirección desde el punto de vista del objeto, en contraposición a usar vectores mundiales, que dan la dirección desde el punto de vista del mundo.
fr: Les vecteurs locaux sont déroutants même pour les développeurs de jeux plus expérimentés, donc ne vous inquiétez pas si tout cela n'a pas beaucoup de sens. La chose clé à retenir au sujet des vecteurs locaux est que nous utilisons des coordonnées locales pour obtenir la direction du point de vue de l'objet, par opposition à l'utilisation de vecteurs mondiaux, qui donnent la direction du point de vue du monde.

source: Okay, back to ``process_input``:
es: Bien, volvamos al ``process_input``:
fr: Bon, revenons à ``process_input`` :
zh_cn: 好的，回到``process_input``:

source: Next we make a new variable called ``input_movement_vector`` and assign it to an empty :ref:`Vector2 <class_Vector2>`. We will use this to make a virtual axis of sorts, to map the player's input to movement.
es: A continuación hacemos una nueva variable llamada ``input_movement_vector`` y la asignamos a un empty :ref:`Vector2 <class_Vector2>`. Usaremos esto para hacer una especie de eje virtual, para mapear la entrada del jugador al movimiento.
fr: Ensuite, nous créons une nouvelle variable appelée ``input_movement_vector`` et l'assignons à un :ref:`Vector2 <class_Vector2>`. Nous l'utiliserons pour faire une sorte d'axe virtuel, pour représenter l'entrée joueur pour le mouvement.

source: This may seem overkill for just the keyboard, but this will make sense later when we add joypad input.
es: Esto puede parecer exagerado sólo para el teclado, pero tendrá sentido más tarde cuando agreguemos la entrada del joypad.
fr: Cela peut sembler exagéré pour un simple clavier, mais cela aura un sens plus tard, lorsque nous ajouterons des entrées de joypad.
zh_cn: 这对于键盘来说似乎有些过分，但是当我们添加游戏手柄输入时，这将有意义。

source: Based on which directional movement action is pressed, we add to or subtract from ``input_movement_vector``.
es: Basándonos en la acción de movimiento direccional que se presiona, añadimos o restamos a "input_movement_vector".
fr: En fonction de l'action directionnelle de mouvement pressée, on ajoute ou on soustrait à ``input_movement_vector``.

source: After we've checked each of the directional movement actions, we normalize ``input_movement_vector``. This makes it where ``input_movement_vector``'s values are within a ``1`` radius unit circle.
es: Después de comprobar cada una de las acciones de movimiento direccional, normalizamos el ``input_movement_vector``. Esto hace que los valores de ``input_movement_vector`` estén dentro de un círculo de unidad de radio de ``1``.
fr: Après avoir vérifié chacune des actions de mouvement directionnel, nous normalisons ``input_movement_vector``. Cela fait que les valeurs de ``input_inmovement_vector`` sont à l'intérieur d'un cercle d'unité de rayon ``1``.
zh_cn: 在我们检查了每个定向运动动作之后，我们将 ``input_movement_vector`` 归一化。 这使得 ``input_movement_vector`` 的值在“1”半径单位圆内。

source: Next we add the camera's local ``Z`` vector times ``input_movement_vector.y`` to ``dir``. This is so when the player presses forward or backwards, we add the camera's local ``Z`` axis so the player moves forward or backwards in relation to the camera.
es: A continuación, añadimos el vector ``Z`` local de la cámara a los tiempos ``input_movement_vector.y`` a ``dir``. Esto es así, cuando el jugador presiona hacia adelante o hacia atrás, añadimos el eje local ``Z`` de la cámara para que el jugador se mueva hacia adelante o hacia atrás en relación con la cámara.
fr: Ensuite, nous ajoutons le vecteur local de la caméra ``Z`` multiplié par ``input_movement_vector.y`` à ``dir``. C'est ainsi que lorsque le joueur avance ou recule, nous ajoutons l'axe local ``Z'' de la caméra pour que le lecteur avance ou recule par rapport à la caméra.
zh_cn: 接下来，我们将摄像机的本地 ``Z`` 向量时间 ``input_movement_vector.y`` 添加到 ``dir`` 。 这是当游戏角色向前或向后按下时，我们添加相机的本地“Z”轴，以便游戏角色相对于相机向前或向后移动。

source: Because the camera is rotated by ``-180`` degrees, we have to flip the ``Z`` directional vector. Normally forward would be the positive Z axis, so using ``basis.z.normalized()`` would work, but we are using ``-basis.z.normalized()`` because our camera's Z axis faces backwards in relation to the rest of the player.
es: Debido a que la cámara está rotada por ``-180`` grados, tenemos que voltear el vector direccional de la ``Z``. Normalmente hacia adelante sería el eje Z positivo, así que usar ``basis.z.normalized()`` funcionaría, pero estamos usando ``-basis.z.normalized()`` porque el eje Z de nuestra cámara está orientado hacia atrás en relación con el resto del jugador.
fr: Parce que la caméra est tournée de ``-180`` degrés, nous devons retourner le vecteur directionnel ``Z``. Normalement en avant serait l'axe Z positif, donc utiliser ``basis.z.normalisé()`` fonctionnerait, mais nous utilisons ``-basis.z.normalisé()`` parce que l'axe Z de notre caméra est orienté vers l'arrière par rapport au reste du joueur.
zh_cn: 因为相机旋转了“-180”度，我们必须翻转“Z`”方向向量。 通常向前是正Z轴，所以使用 ``basis.z.normalized()`` 会起作用，但是我们使用 ``-basis.z.normalized()`` 因为我们的相机的Z轴面向后方 对其余的游戏角色。

source: We do the same thing for the camera's local ``X`` vector, and instead of using ``input_movement_vector.y`` we instead use ``input_movement_vector.x``. This makes it where the player moves left/right in relation to the camera when the player presses left/right.
es: Hacemos lo mismo para el vector ``X`` local de la cámara, y en lugar de usar ``input_movement_vector.y`` usamos en su lugar ``input_movement_vector.x``. Esto hace que el jugador se mueva a la izquierda/derecha en relación con la cámara cuando el jugador presiona izquierda/derecha.
fr: Nous faisons la même chose pour le vecteur local ``X`` de la caméra, et au lieu d'utiliser ``input_movement_vector.y`` nous utilisons plutôt ``input_movement_vector.x``. Cela signifie que le lecteur se déplace vers la gauche/droite par rapport à la caméra lorsque le joueur appuie vers la gauche/droite.
zh_cn: 我们对相机的本地 ``X`` 向量做同样的事情，而不是使用 ``input_movement_vector.y`` 我们改为使用 ``input_movement_vector.x`` 。 当游戏角色向左/向右按下时，这使得游戏角色相对于相机向左/向右移动。

source: Next we check if the player is on the floor using :ref:`KinematicBody <class_KinematicBody>`'s ``is_on_floor`` function. If it is, then we check to see if the "movement_jump" action has just been pressed. If it has, then we set the player's ``Y`` velocity to ``JUMP_SPEED``.
es: A continuación comprobamos si el jugador está en el suelo usando la función :ref:`KinematicBody <class_KinematicBody>`'s ``is_on_floor``. Si lo está, entonces comprobamos si la acción "movement_jump" acaba de ser pulsada. Si lo ha hecho, entonces ponemos la velocidad ``Y`` del jugador en ``JUMP_SPEED``.
fr: Ensuite, nous vérifions si le joueur est sur le sol en utilisant la fonction :ref:`KinematicBody <class_KinematicBody>`s ``is_on_floor``. Si c'est le cas, alors on vérifie si l'action "movement_jump" vient d'être appuyée. Si c'est le cas, alors nous réglons la vélocité ``Y`` du joueur sur ``JUMP_SPEED``.
zh_cn: 接下来我们使用 :ref:`KinematicBody <class_KinematicBody>` 的 ``is_on_floor`` 函数检查游戏角色是否在场上。 如果是，那么我们检查是否刚刚按下了“movement_jump”动作。 如果有，那么我们将游戏角色的“Y”速度设置为“JUMP_SPEED”。

source: Because we're setting the Y velocity, the player will jump into the air.
es: Debido a que estamos ajustando la velocidad Y, el jugador saltará en el aire.
fr: Parce que nous réglons la vélocité Y, le joueur va sauter dans les airs.
zh_cn: 因为我们正在设置Y速度，所以游戏角色将跳到空中。

source: Then we check for the ``ui_cancel`` action. This is so we can free/capture the mouse cursor when the ``escape`` button is pressed. We do this because otherwise we'd have no way to free the cursor, meaning it would be stuck until you terminate the runtime.
es: Entonces comprobamos la acción de ``ui_cancel``. Esto es para que podamos liberar/capturar el cursor del ratón cuando el botón ``escape`` sea presionado. Hacemos esto porque de otra manera no tendríamos forma de liberar el cursor, lo que significa que estaría atascado hasta que termines el tiempo de ejecución.
fr: Ensuite, nous vérifions l'action ``ui_cancel``. C'est ainsi que nous pouvons libérer/capturer le curseur de la souris quand le bouton ``escape`` est pressé. Nous faisons cela parce que sinon nous n'aurions aucun moyen de libérer le curseur, ce qui signifie qu'il serait bloqué jusqu'à ce que vous terminiez le runtime.
zh_cn: 然后我们检查 ``ui_cancel`` 动作。 这样我们就可以在按下 ``escape`` 按钮时释放/捕获鼠标光标。 如果我们不这样做将无法释放光标，这意味着它（光标）在您终止运行之前会一直受困（无法显示以及正常使用）。

source: To free/capture the cursor, we check to see if the mouse is visible (freed) or not. If it is, we capture it, and if it's not, we make it visible (free it).
es: Para liberar/capturar el cursor, comprobamos si el ratón está visible (liberado) o no. Si lo está, lo capturamos, y si no lo está, lo hacemos visible (lo liberamos).
fr: Pour libérer/capturer le curseur, nous vérifions si la souris est visible (libérée) ou non. Si c'est le cas, nous le capturons, et si ce n'est pas le cas, nous le rendons visible (nous le libérons).

source: That's all we're doing right now for ``process_input``. We'll come back several times to this function as we add more complexities to our player.
es: Eso es todo lo que estamos haciendo ahora mismo para la ``process_input``. Volveremos varias veces a esta función a medida que agreguemos más complejidades a nuestro jugador.
fr: C'est tout ce que nous faisons pour l'instant pour "process_input". Nous reviendrons plusieurs fois sur cette fonction au fur et à mesure que nous ajouterons de la complexité à notre joueur.
zh_cn: 这就是我们现在为 ``process_input`` 所做的一切。 我们会多次回到此功能，因为我们会为游戏角色增加更多复杂性。

source: Now let's look at ``process_movement``:
es: Ahora veamos el ``process_movement``:
fr: Regardons maintenant le ``process_movement`` :
zh_cn: 现在让我们看一下``process_movement``:

source: First we ensure that ``dir`` does not have any movement on the ``Y`` axis by setting its ``Y`` value to zero.
es: Primero nos aseguramos de que ``dir`` no tenga ningún movimiento en el eje ``Y`` poniendo su valor ``Y`` a cero.
fr: Premièrement, nous nous assurons que ``dir`` ne bouge pas sur l'axe ``Y`` en réglant sa valeur ``Y`` sur zéro.

source: Next we normalize ``dir`` to ensure we're within a ``1`` radius unit circle. This makes it where we're moving at a constant speed regardless of whether the player is moving straight or diagonally. If we did not normalize, the player would move faster on the diagonal than when going straight.
es: Luego normalizamos ``dir`` para asegurarnos de que estamos dentro de un círculo de unidad de radio de ``1``. Esto hace que nos movamos a una velocidad constante sin importar si el jugador se mueve recto o en diagonal. Si no normalizamos, el jugador se moverá más rápido en la diagonal que cuando vaya en línea recta.
fr: Ensuite, nous normalisons ``dir`` pour nous assurer que nous sommes à l'intérieur d'un cercle d'unité de rayon de ``1``. C'est ce qui fait que nous nous déplaçons à une vitesse constante, que le joueur se déplace en ligne droite ou en diagonale. Si nous ne nous normalisions pas, le joueur se déplacerait plus rapidement sur la diagonale qu'en allant tout droit.

source: Next we add gravity to the player by adding ``GRAVITY * delta`` to the player's ``Y`` velocity.
es: A continuación, añadimos la gravedad al jugador añadiendo ``GRAVITY * delta`` a la velocidad ``Y`` del jugador.
fr: Ensuite, nous ajoutons la gravité au joueur en ajoutant ``GRAVITY * delta`` à la vitesse ``Y`` du joueur.
zh_cn: 接下来，我们通过将“GRAVITY * delta”添加到游戏角色的“Y”速度来为游戏角色增加重力。

source: After that we assign the player's velocity to a new variable (called ``hvel``) and remove any movement on the ``Y`` axis.
es: Después de eso asignamos la velocidad del jugador a una nueva variable (llamada ``hvel``) y eliminamos cualquier movimiento en el eje ``Y``.
fr: Ensuite, nous assignons la vitesse du joueur à une nouvelle variable (appelée ``hvel``) et supprimons tout mouvement sur l'axe ``Y``.
zh_cn: 之后我们将游戏角色的速度分配给一个新的变量(称为“hvel”)，并移除“Y”轴上的任何移动。

source: Next we set a new variable (``target``) to the player's direction vector. Then we multiply that by the player's max speed so we know how far the player will move in the direction provided by ``dir``.
es: A continuación establecemos una nueva variable (``target``) en el vector de dirección del jugador. Luego la multiplicamos por la velocidad máxima del jugador para saber cuán lejos se moverá el jugador en la dirección proporcionada por ``dir``.
fr: Ensuite, nous définissons une nouvelle variable (``cible``) dans le vecteur de direction du joueur. Ensuite, nous multiplions cela par la vitesse maximale du joueur pour savoir jusqu'où le joueur se déplacera dans la direction fournie par ``dir``.
zh_cn: 接下来，我们为游戏角色的方向向量设置一个新变量(``target``)。 然后我们将其乘以游戏角色的最大速度，以便我们知道游戏角色将在“dir”提供的方向上移动多远。

source: After that we make a new variable for acceleration, named ``accel``.
es: Después de eso hacemos una nueva variable para la aceleración, llamada ``accel``.
fr: Ensuite, nous créons une nouvelle variable pour l'accélération, appelée ``accel``.
zh_cn: 之后我们为加速创建一个新变量，名为 ``accel`` 。

source: We then take the dot product of ``hvel`` to see if the player is moving according to ``hvel``. Remember, ``hvel`` does not have any ``Y`` velocity, meaning we are only checking if the player is moving forwards, backwards, left, or right.
es: Luego tomamos el producto escalar de ``hvel`` para ver si el jugador se mueve según ``hvel``. Recuerda, el ``hvel`` no tiene ninguna velocidad ``Y``, lo que significa que sólo estamos comprobando si el jugador se mueve hacia adelante, hacia atrás, a la izquierda o a la derecha.
fr: Nous prenons ensuite le produit scalaire du ``hvel`` pour voir si le joueur se déplace selon ``hvel``. Rappelez-vous que le ``hvel`` n'a pas de vitesse ``Y``, ce qui signifie que nous vérifions seulement si le joueur avance, recule, va à gauche ou va à droite.
zh_cn: 然后我们采用 ``hvel`` 的点积来看看游戏角色是否按照 ``hvel`` 移动。 记住， ``hvel`` 没有任何“Y”速度，这意味着我们只检查游戏角色是向前，向后，向左还是向右移动。

source: If the player is moving according to ``hvel``, then we set ``accel`` to the ``ACCEL`` constant so the player will accelerate, otherwise we set ``accel`` to our ``DEACCEL`` constant so the player will decelerate.
es: Luego tomamos el producto escalar de ``hvel`` para ver si el jugador se mueve según ``hvel``. Recuerda, el ``hvel`` no tiene ninguna velocidad ``Y``, lo que significa que sólo estamos comprobando si el jugador se mueve hacia adelante, hacia atrás, a la izquierda o a la derecha.
fr: Si le joueur se déplace selon ``hvel``, alors nous réglons ``accel`` sur la constante ``ACCEL`` pour que le joueur accélère, sinon nous réglons ``accel`` sur notre constante ``DEACCEL`` pour que le joueur ralentisse.

source: Then we interpolate the horizontal velocity, set the player's ``X`` and ``Z`` velocity to the interpolated horizontal velocity, and call ``move_and_slide`` to let the :ref:`KinematicBody <class_KinematicBody>` handle moving the player through the physics world.
es: Luego interpolamos la velocidad horizontal, ponemos la velocidad ``X`` y ``Z`` del jugador a la velocidad horizontal interpolada, y llamamos a ``move_and_slide`` para que el :ref:`KinematicBody <class_KinematicBody>` se encargue de mover al jugador por el mundo de la física.
fr: Ensuite, nous interpolons la vitesse horizontale, réglons la vitesse ``X`` et ``Z`` du joueur sur la vitesse horizontale interpolée, et appelons ``move_and_slide`` pour laisser le :ref:`KinematicBody <class_KinematicBody>` gérer le déplacement du lecteur dans le monde physique.
zh_cn: 然后我们插入水平速度，将游戏角色的“X”和“Z”速度设置为插值水平速度，并调用“move_and_slide”以让 :ref:`KinematicBody <class_KinematicBody>` 处理移动 游戏角色通过物理世界。

source: All of the code in ``process_movement`` is exactly the same as the movement code from the Kinematic Character demo!
fr: Tout le code dans ``process_movement`` est exactement le même que le code de mouvement de la démo de Kinematic Character !
zh_cn: ``process_movement``中的所有代码都与运动角色演示中的移动代码完全相同！

source: The final function we have is the ``_input`` function, and thankfully it's fairly short:
es: La función final que tenemos es la función ``_input``, y afortunadamente es bastante corta:
fr: La dernière fonction que nous avons est la fonction ``_input``, et heureusement elle est assez courte :
zh_cn: 我们的最后一个函数是 ``_input`` 函数，谢天谢地它很简短:

source: First we make sure that the event we are dealing with is an :ref:`InputEventMouseMotion <class_InputEventMouseMotion>` event. We also want to check if the cursor is captured, as we do not want to rotate if it is not.
es: Primero nos aseguramos de que el evento que estamos tratando es un :ref:`InputEventMouseMotion <class_InputEventMouseMotion>` evento. También queremos comprobar si el cursor es capturado, ya que no queremos rotar si no lo es.
fr: Tout d'abord, nous nous assurons que l'événement auquel nous avons affaire est un événement :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`. Nous voulons aussi vérifier si le curseur est capturé, car nous ne voulons pas tourner s'il ne l'est pas.

source: See :ref:`Mouse and input coordinates <doc_mouse_and_input_coordinates>` for a list of possible input events.
es: Ver :ref:`Mouse and input coordinates <doc_mouse_and_input_coordinates>` para una lista de posibles eventos de entrada.
fr: Voir :ref:`Les coordonnées de la souris et de l'entrée <doc_mouse_and_input_coordinates>` pour une liste des événements d'entrée possibles.
zh_cn: 请参阅 :ref:`鼠标和输入坐标<doc_mouse_and_input_coordinates>` 以获取可能的输入事件列表。

source: If the event is indeed a mouse motion event and the cursor is captured, we rotate based on the relative mouse motion provided by :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`.
es: Si el evento es de hecho un evento de movimiento de ratón y el cursor es capturado, rotamos basándonos en el movimiento relativo del ratón proporcionado por :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`.
fr: Si l'événement est bien un événement de mouvement de souris et que le curseur est capturé, nous tournons en fonction du mouvement relatif de la souris fourni par :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`.
zh_cn: 如果事件确实是鼠标移动事件并且捕获了光标，我们将根据以下提供的相对鼠标移动进行旋转 :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`。

source: First we rotate the ``rotation_helper`` node on the ``X`` axis, using the relative mouse motion's ``Y`` value, provided by :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`.
es: Primero rotamos el nodo ``rotation_helper`` en el eje ``X``, usando el valor ``Y`` del movimiento relativo del ratón, proporcionado por :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`.
fr: Tout d'abord, nous tournons le nœud ``rotation_helper`` sur l'axe ``X``, en utilisant la valeur ``Y`` du mouvement relatif de la souris, fournie par :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`.
zh_cn: 首先，我们使用相对鼠标运动的 ``Y`` 值旋转 ``X`` 轴上的``rotation_helper`` 节点，提供者 :ref:`InputEventMouseMotion <class_InputEventMouseMotion>`。

source: Then we rotate the entire :ref:`KinematicBody <class_KinematicBody>` on the ``Y`` axis by the relative mouse motion's ``X`` value.
es: Luego rotamos todo el :ref:`KinematicBody <class_KinematicBody>` en el eje ``Y`` por el valor ``X`` del movimiento relativo del ratón.
fr: Ensuite, nous faisons pivoter le :ref:``KinematicBody <class_KinematicBody>` sur l'axe ``Y`` par la valeur ``X`` du mouvement relatif de la souris.
zh_cn: 然后我们通过相对鼠标运动的``X``值旋转整个 :ref:`KinematicBody <class_KinematicBody>` 在 ``Y`` 轴上。

source: Godot converts relative mouse motion into a :ref:`Vector2 <class_Vector2>` where mouse movement going up and down is ``1`` and ``-1`` respectively. Right and Left movement is ``1`` and ``-1`` respectively.
es: Godot convierte el movimiento relativo del ratón en un :ref:`Vector2 <clase_Vector2>` donde el movimiento del ratón al subir y bajar es ``1`` y ``-1`` respectivamente. El movimiento de la derecha y la izquierda es ``1`` y ``-1`` respectivamente.
fr: Godot convertit le mouvement relatif de la souris en un :ref:`Vector2 <class_Vector2>` où le mouvement de la souris qui monte et descend est ``1`` et ``-1`` respectivement. Le mouvement vers la droite et vers la gauche est ``1`` et ``-1`` respectivement.
zh_cn: Godot将相对鼠标运动转换为 :ref:`Vector2 <class_Vector2>` 其中鼠标上下移动分别为``1``和``-1``。 左右移动分别是``1``和``-1``。

source: Because of how we are rotating the player, we multiply the relative mouse motion's ``X`` value by ``-1`` so mouse motion going left and right rotates the player left and right in the same direction.
es: Debido a la forma en que estamos rotando el jugador, multiplicamos el valor ``X`` del movimiento relativo del ratón por ``-1`` para que el movimiento del ratón que va a la izquierda y a la derecha rote el jugador a la izquierda y a la derecha en la misma dirección.
fr: En raison de la façon dont nous faisons tourner le lecteur, nous multiplions la valeur ``X`` du mouvement relatif de la souris par ``-1`` pour que le mouvement de la souris tournant à gauche et à droite fasse tourner le lecteur à gauche et à droite dans la même direction.
zh_cn: 由于我们如何旋转游戏角色，我们将相对鼠标移动的``X``值乘以``-1``，因此鼠标左右移动会使游戏角色左右向同一方向旋转。
