Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_two.po
Languages: es, fr, ja, zh_cn

source: Create a new script called ``Bullet_script.gd`` and attach it to the ``Bullet`` :ref:`Spatial <class_Spatial>`.
es: Crea un nuevo script llamado ``Bullet_script.gd`` y adjúntalo al ``Bullet`` :ref:`Spatial <class_Spatial>`.
fr: Créez un nouveau script appelé ``Bullet_script.gd`` et joignez-le au ``Bullet``` :ref:`Spatial <class_Spatial>`.
ja: ``Bullet_script.gd`` という新しいスクリプトを作成し、それを ``Bullet`` :ref:`Spatial <class_Spatial>` にアタッチします。
zh_cn: 创建一个名为 ``Bullet_script.gd`` 的新脚本并将其附加到``Bullet`` :ref:`Spatial <class_Spatial>`。

source: We are going to move the entire bullet object at the root (``Bullet``). We will be using the :ref:`Area <class_Area>` to check whether or not we've collided with something
es: Vamos a mover todo el objeto bala en la raíz (``Bullet``). Usaremos el :ref:`Area <class_Area>` para comprobar si hemos chocado o no con algo
fr: Nous allons déplacer tout l'objet balle à la racine ("Bullet"). Nous utiliserons le :ref:`Area <class_Area>` pour vérifier si nous avons ou non heurté quelque chose
ja: ルート(``Bullet``) でbulletオブジェクト全体を移動します。\ :ref:`Area <class_Area>` を使用して、何かと衝突したかどうかを確認します
zh_cn: 我们将在根部移动整个子弹对象(``Bullet``)。 我们将使用 :ref:`Area <class_Area>` 来检查我们是否与某些东西相撞

source: Why are we using an :ref:`Area <class_Area>` and not a :ref:`RigidBody <class_RigidBody>`? The main reason we're not using a :ref:`RigidBody <class_RigidBody>` is because we do not want the bullet to interact with other :ref:`RigidBody <class_RigidBody>` nodes. By using an :ref:`Area <class_Area>` we are ensuring that none of the other :ref:`RigidBody <class_RigidBody>` nodes, including other bullets, will be effected.
es: ¿Por qué usamos un :ref:`Area <clase_Area>` y no un :ref:`RigidBody <class_RigidBody>`? La razón principal por la que no estamos usando un :ref:`RigidBody <class_RigidBody>` es porque no queremos que la bala interactúe con otros nodos :ref:`RigidBody <class_RigidBody>`. Usando un :ref:`Area <class_Area>` nos aseguramos de que ninguno de los otros nodos :ref:`RigidBody <class_RigidBody>`, incluyendo las otras balas, se vean afectados.
fr: Pourquoi utilisons-nous un :ref:`Area <class_Area>` et non un :ref:`RigidBody <class_RigidBody>` ? La raison principale pour laquelle nous n'utilisons pas un :ref:`RigidBody <class_RigidBody>` est que nous ne voulons pas que la balle interagisse avec d'autres nœuds :ref:`RigidBody <class_RigidBody>`. En utilisant un :ref:`Area <class_Area>` nous nous assurons qu'aucun des autres nœuds :ref:`RigidBody <class_RigidBody>`, y compris les autres balles, ne sera affecté.
ja: :ref:`RigidBody <class_RigidBody>` ではなく :ref:`Area <class_Area>` を使用するのはなぜですか？ :ref:`RigidBody <class_RigidBody>` を使用しない主な理由は、他の :ref:`RigidBody <class_RigidBody>` ノードと弾丸が相互作用しないようにするためです。\ :ref:`Area <class_Area>` を使用することにより、他の弾丸含む他の :ref:`RigidBody <class_RigidBody>` ノードが影響を受けないようにします。

source: Another reason is simply because it is easier to detect collisions with an :ref:`Area <class_Area>`!
es: !Otra razón es simplemente porque es más fácil detectar colisiones con un :ref:`Area <class_Area>`!
fr: Une autre raison est simplement qu'il est plus facile de détecter les collisions avec un :ref:`Area <class_Area>` !
ja: もう一つの理由は、単に :ref:`Area <class_Area>`との衝突を検出する方が簡単だからです！
zh_cn: 另一个原因很简单，因为用以下方法检测碰撞更容易 :ref:`Area <class_Area>`！

source: Here's the script that will control our bullet:
es: Aquí está el script que controlará nuestra bala:
fr: Voici le script qui va contrôler notre balle :
ja: 弾丸を制御するスクリプトは次のとおりです:
zh_cn: 这是控制我们子弹的脚本:

source: Let's go through the script:
es: Analicemos el script:
fr: Parcourons le script :
ja: スクリプトを見てみましょう:

source: First we define a few class variables:
es: Primero, declaramos unas cuantas clases variables:
fr: Nous définissons d'abord quelques variables de classe :
ja: 最初に、いくつかのクラス変数を定義します:
zh_cn: 首先我们定义一些类变量:

source: ``BULLET_SPEED``: The speed at which the bullet travels.
es: ``BULLET_SPEED``: La velocidad a la que la bala viaja.
fr: ``BULLET_SPEED`` : La vitesse à laquelle la balle se déplace.
ja: ``BULLET_SPEED``: 弾丸が移動する速度。

source: ``BULLET_DAMAGE``: The damage the bullet will cause to anything with which it collides.
es: ``BULLET_DAMAGE``: El daño que causa una bala cuando colisiona con algo.
fr: ``BULLET_DAMAGE`` : Les dommages que la balle causera à tout ce avec quoi elle entre en collision.
ja: ``BULLET_DAMAGE``: 弾丸が衝突するあらゆるものに与えるダメージ。

source: ``KILL_TIMER``: How long the bullet can last without hitting anything.
es: ``KILL_TIMER``: El tiempo que la bala puede viajar sin colisionar con algo.
fr: ``KILL_TIMER`` : Combien de temps la balle existe sans toucher quoi que ce soit.
ja: ``KILL_TIMER``: 何もヒットせずに弾丸が持続できる時間。
zh_cn: ``KILL_TIMER``:子弹可以持续多久而不击中任何东西。

source: ``timer``: A float for tracking how long the bullet has been alive.
es: Un float para saber cuanto tiempo la bala ha estado viva.
fr: ``timer`` : Un flottant pour savoir depuis combien de temps la balle existe.
ja: ``timer``: 弾丸が生きている時間を追跡するためのfloat。
zh_cn: ``timer``:一个用于跟踪子弹活着多久的浮子。

source: ``hit_something``: A boolean for tracking whether or not we've hit something.
es: ``hit_something``: Un boolean para saber si hemos colisionado con algo o no.
fr: ``hit_something`` : Un booléen pour savoir si on a touché quelque chose ou non.
ja: ``hit_something``: 何かをヒットしたかどうかを追跡するためのブール値。
zh_cn: ``hit_something``:一个布尔值，用于跟踪我们是否击中了某些东西。

source: With the exception of ``timer`` and ``hit_something``, all of these variables change how the bullet interacts with the world.
es: Salvo las excepciones de ``timer``y ``hit_something``, todas estas variables cambian como la bala interactua con su ambiente.
fr: À l'exception de ``timer`` et ``hit_something``, toutes ces variables changent la façon dont la balle interagit avec le monde.
ja: ``timer`` と ``hit_something`` を除き、これらの変数はすべて、弾丸が世界と相互作用する方法を変更します。
zh_cn: 除了 ``timer`` 和 ``hit_something`` 之外，所有这些变量都会改变子弹与世界的交互方式。

source: The reason we are using a kill timer is so we do not have a case where we get a bullet travelling forever. By using a kill timer, we can ensure that no bullets will travel forever and consume resources.
es: La razon por la cual utilizamos un contador es para que no ocurra el caso en el que la bala viaja infinitamente. Al utilizar un contador, nos aseguramos que ninguna bala viajara infinitamente ni consumira recursos.
fr: La raison pour laquelle nous utilisons un kill timer est qu'il n'y a pas de cas où une balle se déplace indéfiniment. En utilisant un kill timer, nous pouvons nous assurer qu'aucune balle ne voyagera éternellement,consommant des ressources.
ja: キルタイマーを使用しているのは、弾丸が永遠に移動するケースがないためです。キルタイマーを使用することで、弾丸が永遠に移動してリソースを消費しないようにすることができます。

source: As in :ref:`doc_fps_tutorial_part_one`, we have a couple all uppercase class variables. The reason behind this is the same as the reason given in :ref:`doc_fps_tutorial_part_one`: We want to treat these variables like constants, but we want to be able to change them. In this case we will later need to change the damage and speed of these bullets, so we need them to be variables and not constants.
es: Tal cual es presentado en:ref:`doc_fps_tutorial_part_one`, hay dos variables con solo mayusculas. La razon por esto es la misma a la razon presentadada en :ref:`doc_fps_tutorial_part_one`: queremos tratar estas variables como constantes, pero queremos poder cambiarlas. En este caso necesitaremos cambiar el daño y la velocidad de las balas mas tarde, por lo tanto, necesitaremos que sean variables y no constantes.
fr: Comme dans :ref:`doc_fps_tutorial_part_one`, nous avons quelques variables de classe en majuscules. La raison derrière ceci est la même que celle donnée dans :ref:`doc_fps_tutorial_part_one` : Nous voulons traiter ces variables comme des constantes, mais nous voulons pouvoir les modifier. Dans ce cas, nous devrons plus tard modifier les dommages et la vitesse des balles, nous avons donc besoin qu'elles soient des variables et non des constantes.
ja: :ref:`doc_fps_tutorial_part_one` のように、すべて大文字のクラス変数がいくつかあります。この背後にある理由は :ref:`doc_fps_tutorial_part_one` で与えられた理由と同じです: これらの変数を定数のように扱いたいが、変更できるようにしたいのです。この場合、後でこれらの弾丸のダメージと速度を変更する必要があるため、定数ではなく変数にする必要があります。
zh_cn: 如 :ref:`doc_fps_tutorial_part_one`，我们有几个全部大写的类变量。 这背后的原因与下面给出的原因相同 :ref:`doc_fps_tutorial_part_one`:我们希望将这些变量视为常量，但我们希望能够更改它们。 在这种情况下，我们稍后需要更改这些子弹的损坏和速度，因此我们需要它们是变量而不是常量。

source: In ``_ready`` we set the area's ``body_entered`` signal to ourself so that it calls the ``collided`` function when a body enters the area.
es: En ``_ready`` nos ponemos la señal de ``body_entered`` del área para que llame a la función de ``collided`` cuando un cuerpo entra en el área.
fr: Dans ``_ready`` nous réglons le signal ``body_entered`` de la zone pour qu'il appelle la fonction ``collided`` quand un corps entre dans la zone.
ja: ``_ready`` では、ボディがエリアに入ったときに ``collided`` 関数を呼び出すように、エリアの ``body_entered`` シグナルを自分自身に設定します。
zh_cn: 在 ``_ready`` 中，我们将区域的 ``body_entered`` 信号设置为我们自己，以便在物体进入该区域时调用 ``collided`` 函数。

source: ``_physics_process`` gets the bullet's local ``Z`` axis. If you look at the scene in local mode, you will find that the bullet faces the positive local ``Z`` axis.
es: ``_physics_process`` obtiene el eje ``Z`` local de la bala. Si miras la escena en modo local, encontrarás que la bala se enfrenta al eje ``Z`` local positivo.
fr: ``_physics_process`` obtient l'axe ``Z`` local de la balle. Si vous regardez la scène en mode local, vous verrez que la balle fait face à l'axe local positif ``Z``.
ja: ``_physics_process`` は弾丸のローカル ``Z`` 軸を取得します。ローカルモードでシーンを見ると、弾丸がローカル ``Z`` 軸の正の方向に向かっていることがわかります。

source: Next we translate the entire bullet by that forward direction, multiplying in our speed and delta time.
es: Luego trasladamos la bala en esa dirección de avance, multiplicando por nuestra velocidad y tiempo delta.
fr: Ensuite, nous faisons se déplacer la balle entière dans cette direction, en multipliant notre vitesse et notre temps delta.
ja: 次に、その方向に向けて弾丸全体を変換し、速度とデルタ時間を乗算します。
zh_cn: 接下来，我们按照前进方向翻译整个项目符号，乘以我们的速度和增量时间。

source: After that we add delta time to our timer and check whether the timer has reached a value as big or greater than our ``KILL_TIME`` constant. If it has, we use ``queue_free`` to free the bullet.
es: Después de eso añadimos tiempo delta a nuestro temporizador y comprobamos si el temporizador ha alcanzado un valor tan grande o mayor que nuestra constante``KILL_TIME``. Si lo ha hecho, usamos ``queue_free`` para liberar la bala.
fr: Ensuite, nous ajoutons le temps delta à notre timer et vérifions si le timer a atteint une valeur aussi grande ou plus grande que notre constante ``KILL_TIME``. Si c'est le cas, nous utilisons ``queue_free`` pour libérer la balle.
ja: その後、タイマーにデルタ時間を追加し、タイマーが ``KILL_TIME`` 定数以上の値に達したかどうかを確認します。達している場合は、\ ``queue_free`` を使用して弾丸を解放します。

source: In ``collided`` we check whether we've hit something yet.
es: En ``collided`` comprobamos si hemos golpeado algo todavía.
fr: Dans ``collided``, nous vérifions si nous avons déjà touché quelque chose.
ja: ``collided`` では、まだ何かにヒットしているかどうかを確認します。

source: Remember that ``collided`` is only called when a body has entered the :ref:`Area <class_Area>` node. If the bullet has not already collided with something, we then proceed to check if the body the bullet has collided with has a function/method called ``bullet_hit``. If it does, we call it and pass in the bullet's damage and the bullet's global transform so we can get the bullet's rotation and position.
es: Recuerda que ``collided`` sólo se llama cuando un cuerpo ha entrado en el nodo :ref:`Area <class_Area>`. Si la bala no ha colisionado ya con algo, entonces procedemos a comprobar si el cuerpo con el que ha colisionado la bala tiene una función/método llamado ``bullet_hit``. Si es así, la llamamos y pasamos el daño de la bala y la transformación global de la bala para que podamos obtener la rotación y la posición de la bala.
fr: Rappelez-vous que ``collided`` n'est appelé que lorsqu'un corps est entré dans le nœud :ref:`Area <class_Area>`. Si la balle n'est pas déjà entrée en collision avec quelque chose, nous vérifions ensuite si le corps avec lequel la balle est entrée en collision a une fonction/méthode appelée ``bullet_hit``. Si c'est le cas, nous l'appelons et nous passons les dommages de la balle et la transformation globale de la balle afin que nous puissions obtenir la rotation et la position de la balle.
ja: ``collided`` は、ボディが :ref:`Area <class_Area>` ノードに入ったときにのみ呼び出されることに注意してください。弾丸がまだ何かに衝突していない場合、弾丸が衝突した本体に ``bullet_hit`` という関数/メソッドがあるかどうかを確認します。もしそうなら、それを呼び出して、弾丸のダーメジと弾丸のグローバル変換を渡し、弾丸の方向と位置を取得します。
zh_cn: 请记住，只有当一个实体进入 :ref:`Area <class_Area>` 节点时才会调用 ``collided`` 。 如果子弹尚未与某些东西发生碰撞，我们将继续检查子弹发生碰撞的物体是否具有名为“bullet_hit”的功能/方法。 如果是这样，我们称之为并传递子弹的伤害和子弹的全局变换，这样我们就可以获得子弹的旋转和位置。

source: in ``collided``, the passed in body can be a :ref:`StaticBody <class_StaticBody>`, :ref:`RigidBody <class_RigidBody>`, or :ref:`KinematicBody <class_KinematicBody>`
es: en ``collided``, el cuerpo pasado puede ser un :ref:`StaticBody <class_StaticBody>`, :ref:`RigidBody <class_RigidBody>`, o :ref:`KinematicBody <class_KinematicBody>`
fr: Dans ``collided``, le passé dans le corps peut être un :ref:`StaticBody <class_StaticBody>`, :ref:`RigidBody <class_RigidBody>`, ou :ref:`KinematicBody <class_KinematicBody>`
ja: ``collided`` では、渡されるbodyは :ref:`StaticBody <class_StaticBody>`\ 、\ :ref:`RigidBody <class_RigidBody>`\ 、または :ref:`KinematicBody <class_KinematicBody>` になります
zh_cn: 在 ``collided`` 中，传入的物体可以是 :ref:`StaticBody <class_StaticBody>`， :ref:`RigidBody <class_RigidBody>`，或者 :ref:`KinematicBody <class_KinematicBody>`

source: We set the Bullet's ``hit_something`` variable to ``true`` because regardless of whether or not the body that the bullet collided with has the ``bullet_hit`` function/method, it has hit something and so we need to make sure the bullet does not hit anything else.
es: Ponemos la variable ``hit_something`` de la bala en ``true`` porque independientemente de si el cuerpo con el que chocó la bala tiene la función/método ``bullet_hit``, ha golpeado algo y por lo tanto tenemos que asegurarnos de que la bala no golpee nada más.
fr: Nous avons réglé la variable ``hit_something`` de Bullet sur ``true`` parce que, que le corps avec lequel la balle est entrée en collision ait ou non la fonction/méthode ``bullet_hit``, elle a touché quelque chose et nous devons donc nous assurer que la balle ne touche pas autre chose.
ja: 弾丸の ``hit_something`` 変数を ``true`` に設定したのは、弾丸が衝突したボディが `` bullet_hit`` 関数/メソッドを持っているかどうかに関係なく、弾丸はすでに何かに当たっているので、もう他の何かに当たらないようにする必要があるからです。
zh_cn: 我们将子弹的 ``hit_something`` 变量设置为 ``true`` ，因为无论子弹碰撞的物体是否具有 ``bullet_hit`` 函数/方法，它都会击中某些东西，所以我们需要制作 确定子弹没有击中任何其他东西。

source: Then we free the bullet using ``queue_free``.
es: Entonces liberamos la bala usando ``queue_free``.
fr: Ensuite, nous libérons la balle en utilisant ``queue_free``.
ja: その後、\ ``queue_free`` を使用して弾丸を解放します。
zh_cn: 然后我们使用 ``queue_free`` 释放子弹。

source: You may be wondering why we even have a ``hit_something`` variable if we free the bullet using ``queue_free`` as soon as it hits something.
es: Tal vez te preguntes por qué tenemos una variable ``hit_something`` si liberamos la bala usando ``queue_free`` tan pronto como golpea algo.
fr: Vous vous demandez peut-être pourquoi nous avons une variable ``hit_something`` si nous libérons la balle en utilisant ``queue_free`` dès qu'elle frappe quelque chose.
ja: 何かにヒットしたらすぐに ``queue_free`` を使用して弾丸を解放するのに、なぜ ``hit_something`` 変数があるのか疑問に思うかもしれません。
zh_cn: 您可能想知道为什么我们甚至有一个 ``hit_something`` 变量，如果我们在命中某事时立即使用 ``queue_free`` 释放子弹。

source: The reason we need to track whether we've hit something or not is because ``queue_free`` does not immediately free the node, so the bullet could collide with another body before Godot has a chance to free it. By tracking whether the bullet has hit something, we can make sure that the bullet will only hit one object.
es: La razón por la que necesitamos rastrear si hemos golpeado algo o no, es porque ``queue_free`` no libera inmediatamente el nodo, por lo que la bala podría chocar con otro cuerpo antes de que Godot tenga la oportunidad de liberarla. Al rastrear si la bala ha golpeado algo, podemos asegurarnos de que la bala sólo golpeará un objeto.
fr: La raison pour laquelle nous devons savoir si nous avons touché quelque chose ou non est que ``queue_free`` ne libère pas immédiatement le nœud, de sorte que la balle pourrait entrer en collision avec un autre corps avant que Godot ait une chance de la libérer. En vérifiant si la balle a touché quelque chose, nous pouvons nous assurer qu'elle ne touchera qu'un seul objet.
ja: 何かをヒットしたかどうかを追跡する必要があるのは、\ ``queue_free`` がすぐにノードを解放しないため、Godotが解放する前に弾丸が別のボディと衝突する可能性があるためです。弾丸が何かに当たったかどうかを追跡することにより、弾丸が1つのオブジェクトにしか当たらないようにすることができます。

source: Before we start programming the player again, let's take a quick look at ``Player.tscn``. Open up ``Player.tscn`` again.
es: Antes de empezar a programar el jugador de nuevo, echemos un vistazo rápido a ``Player.tscn``. Abre ``Player.tscn`` de nuevo.
fr: Avant de recommencer à programmer le joueur, jetons un coup d’œil rapide sur ``Player.tscn``. Ouvrez à nouveau ``Player.tscn``.
ja: プレイヤーのプログラミングを再開する前に、\ ``Player.tscn`` を簡単に見てみましょう。再び ``Player.tscn`` を開きます。
zh_cn: 在我们再次开始编程游戏角色之前，让我们快速看一下 ``Player.tscn`` 。 再次打开 ``Player.tscn`` 。

source: Expand ``Rotation_Helper`` and notice how it has two nodes: ``Gun_Fire_Points`` and ``Gun_Aim_Point``.
es: Expande ``Rotation_Helper`` y observa como tiene dos nodos: ``Gun_Fire_Points`` y ``Gun_Aim_Point``.
fr: Développez ``Rotation_Helper`` et remarquez comment il a deux nœuds : ``Gun_Fire_Points`` et ``Gun_Aim_Point``.
ja: ``Rotation_Helper`` を展開し、\ ``Gun_Fire_Points`` と ``Gun_Aim_Point`` の2つのノードがあることに注目してください。
zh_cn: 展开 ``Rotation_Helper`` 并注意它有两个节点: ``Gun_Fire_Points`` 和 ``Gun_Aim_Point`` 。

source: ``Gun_aim_point`` is the point that the bullets will be aiming at. Notice how it is lined up with the center of the screen and pulled a distance forward on the Z axis. ``Gun_aim_point`` will serve as the point where the bullets will for sure collide with as it goes along.
es: ``Gun_aim_point`` es el punto al que apuntarán las balas. Fíjate en cómo se alinea con el centro de la pantalla y se desplaza una distancia hacia adelante en el eje Z. ``Gun_aim_point`` servirá como el punto con el que las balas seguro chocarán a medida que avanza.
fr: ``Gun_aim_point`` est le point sur lequel les balles viseront. Remarquez comment il est aligné avec le centre de l'écran et tiré à une certaine distance vers l'avant sur l'axe Z. ``Gun_aim_point`` servira de point de collision avec les balles au fur et à mesure qu'elles entreront en collision.
ja: ``Gun_aim_point`` は、弾丸が狙うポイントです。画面の中心とどのように並んでおり、Z軸上で前方に一定距離引っ張られていることに注目してください。\ ``Gun_aim_point`` は、弾丸が進むにつれて確実に衝突するポイントとして機能します。
zh_cn: ``Gun_aim_point``是子弹瞄准的点。 注意它是如何与屏幕中心对齐并在Z轴上向前拉一段距离。 ``Gun_aim_point``将作为子弹在进行时肯定会碰撞的点。

source: There is a invisible mesh instance for debugging purposes. The mesh is a small sphere that visually shows at which target the bullets will be aiming.
es: Hay una instancia de malla invisible para propósitos de depuración. La malla es una pequeña esfera que muestra visualmente a qué objetivo apuntarán las balas.
fr: Il y a un maillage invisible à des fins de débogage. Le maillage est une petite sphère qui indique visuellement vers qu'elle cible les balles vont être dirigées.
ja: デバッグ用に非表示のメッシュインスタンスがあります。メッシュは、弾丸がどのターゲットを狙うかを視覚的に示す小さな球体です。

source: Open up ``Gun_Fire_Points`` and you'll find three more :ref:`Spatial <class_Spatial>` nodes, one for each weapon.
es: Abre los ``Gun_Fire_Points`` y encontrarás tres nodos más, :ref:`Spatial <class_Spatial>`uno para cada arma.
fr: Ouvrez ``Gun_Fire_Points`` et vous trouverez trois autres nœuds :ref:`Spatial <class_Spatial>`, un pour chaque arme.
ja: ``Gun_Fire_Points`` を開くと、武器ごとにさらに1つずつ、計3つの :ref:`Spatial <class_Spatial>` ノードがあります。
zh_cn: 打开 ``Gun_Fire_Points`` ，您会发现另外三个 :ref:`Spatial <class_Spatial>` 节点，每个武器一个。

source: Open up ``Rifle_Point`` and you'll find a :ref:`Raycast <class_Raycast>` node. This is where we will be sending the raycasts for our rifle's bullets. The length of the raycast will dictate how far our bullets will travel.
es: Abre el ``Rifle_Point`` y encontrarás un nodo :ref:`Raycast <class_Raycast>`. Aquí es donde enviaremos los "raycasts" para las balas de nuestro rifle. La longitud del raycast dictará cuán lejos viajarán nuestras balas.
fr: Ouvrez ``Rifle_Point`` et vous trouverez un nœud :ref:`Raycast <class_Raycast>`. C'est ici que nous enverrons les raycast pour les balles de notre fusil. La longueur du raycast dictera la distance à laquelle nos balles voyageront.
ja: ``Rifle_Point`` を開くと :ref:`Raycast <class_Raycast>` ノードが見つかります。ここで、ライフルの弾丸のレイキャストを送り出します。レイキャストの長さは、弾丸の移動距離を決定します。
zh_cn: 打开 ``Rifle_Point`` 您会找到一个 :ref:`Raycast <class_Raycast>` 节点。 这是我们将为我们的步枪的子弹发送光线投射的地方。 光线投射的长度将决定我们的子弹将走多远。

source: We are using a :ref:`Raycast <class_Raycast>` node to handle the rifle's bullet because we want to fire lots of bullets quickly. If we use bullet objects, it is quite possible we could run into performance issues on older machines.
es: Estamos usando un nodo :ref:`Raycast <class_Raycast>` para manejar la bala del rifle porque queremos disparar muchas balas rápidamente. Si usamos objetos con balas, es muy posible que nos encontremos con problemas de rendimiento en máquinas antiguas.
fr: Nous utilisons un nœud :ref:`Raycast <class_Raycast>` pour manipuler la balle du fusil car nous voulons tirer beaucoup de balles rapidement. Si nous utilisons des objets Balle, il est fort possible que nous rencontrions des problèmes de performance sur des machines plus anciennes.
ja: :ref:`Raycast <class_Raycast>` ノードを使用してライフルの弾丸を処理します。これは、大量の弾丸をすばやく発射するためです。(レイキャストの代わりに)弾丸オブジェクトを使用すると、古いマシンでパフォーマンスの問題が発生する可能性が非常に高くなります。
zh_cn: 我们使用 :ref:`Raycast <class_Raycast>` 节点来处理步枪的子弹，因为我们想要快速发射大量子弹。 如果我们使用bullet对象，很可能会在旧机器上遇到性能问题。

source: If you are wondering from where the positions of the points came, they are the rough positions of the ends of each weapon. You can see this by going to ``AnimationPlayer``, selecting one of the firing animations and scrubbing through the timeline. The point for each weapon should mostly line up with the end of each weapon.
es: Si te preguntas de dónde vinieron las posiciones de los puntos, son las posiciones aproximadas de los extremos de cada arma. Puedes verlo yendo a ``AnimationPlayer``, seleccionando una de las animaciones de disparo y recorriendo la línea de tiempo. El punto de cada arma debería alinearse con el extremo de cada arma.
fr: Si vous vous demandez d'où viennent les positions des pointes, ce sont les positions brutes des extrémités de chaque arme. Vous pouvez le voir en allant dans ``AnimationPlayer``, en sélectionnant l'une des animations de tir et en parcourant la ligne de temps. La pointe de chaque arme doit être alignée avec l'extrémité de chaque arme.
ja: ポイントの位置がどこから来たのか疑問に思っているかも知れませんが、それらは各武器の先端の大まかな位置です。これは、\ ``AnimationPlayer`` に移動して、発砲アニメーションの1つを選択し、タイムラインをスクラブすることで確認できます。各武器のポイントは、ほとんどの場合、各武器の先端と一致する必要があります。
