Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_four.po
Languages: es, fr, ja, zh_cn

source: With that done, you should now be able to get additional ammo! Go place some ammo pickups in one/both/all of the scenes and give it a try!
es: ¡Con eso hecho, ahora deberías ser capaz de conseguir munición adicional! ¡Ve a colocar algunas recogidas de munición en una/ambas/todas las escenas y pruébalas!
fr: Ceci fait, vous devriez pouvoir obtenir de nouvelles munitions ! Placez quelques bonus de munition dans une/deux/toutes les scènes et essayez par vous même !
ja: これで、追加の弾薬を入手できるはずです！ 1つ/両方/すべてのシーンに弾薬箱をいくつか置いて、試してみてください！

source: Notice how we're not limiting the amount of ammo you can carry. To limit the amount of ammo each weapon can carry, you need to add an additional variable to each weapon's script, and then clamp the weapon's ``spare_ammo`` variable after adding ammo in ``add_ammo``.
es: Fíjate en cómo no limitamos la cantidad de munición que puedes llevar. Para limitar la cantidad de munición que cada arma puede llevar, necesitas añadir una variable adicional al script de cada arma, y luego fijar la variable ``spare_ammo`` del arma después de añadir la munición en ``add_ammo``.
fr: Notez que nous ne limitons pas le nombre de munitions que nous pouvons porter. Pour limiter le nombre de munition que vous pouvez porter pour chaque arme, vous devrez ajouter une variable supplémentaire dans chaque script d'arme et limiter la variable ``spare_ammo`` après avoir ajouté des munitions dans ``add_ammo``.
ja: 携行できる弾薬の量が制限されていないことに注意してください。 各武器が持ち込める弾薬の量を制限するには、各武器のスクリプトに追加の変数を追加し、\ ``add_ammo`` で弾薬を追加した後に武器の ``spare_ammo`` 変数をクランプする必要があります。
zh_cn: 要注意的是，我们并没有对你携带弹药的数量进行限制。如果想要限制每件武器可携带的弹药数量，您需要在每件武器的脚本内添加一个额外变量，然后限定武器的“备用弹药”（spare_ammo）变量后，在“添加弹药”（add_ammo）变量内添加弹药。

source: Adding breakable targets
es: Añadiendo objetivos destruibles
fr: Ajouter des cibles destructibles
ja: 破壊可能なターゲットの追加
zh_cn: 添加易碎目标

source: Before we end this part, let's add some targets.
es: Antes de terminar esta parte, añadamos algunos objetivos.
fr: Avant de terminer cette partie, ajoutons quelques cibles.
ja: このパートを終了する前に、いくつかのターゲットを追加してみましょう。
zh_cn: 在我们结束这一部分之前，让我们添加一些目标。

source: Open up ``Target.tscn`` and take a look at the scenes in the scene tree.
es: Abre ``Target.tscn`` y echa un vistazo a las escenas en el árbol de escenas.
fr: Ouvrez ``Target.tscn`` et jetez un œil aux scènes dans l'arborescence des scènes.
ja: ``Target.tscn`` を開き、シーンツリーのシーンを見てみます。
zh_cn: 打开 ``Target.tscn`` 并查看场景树中的场景。

source: Firstly, notice how we're not using a :ref:`RigidBody <class_RigidBody>` node, but a :ref:`StaticBody <class_StaticBody>` one. The reason behind this is our non-broken targets will not be moving anywhere; using a :ref:`RigidBody <class_RigidBody>` would be more hassle than it's worth since all it has to do is stay still.
es: En primer lugar, fíjate en que no estamos usando un nodo :ref:`RigidBody <class_RigidBody>`, sino un :ref:`StaticBody <class_StaticBody>` uno. La razón de esto es que nuestros objetivos no rotos no se moverán a ninguna parte; usar un :ref:`RigidBody <class_RigidBody>` sería más problemático de lo que vale ya que todo lo que tiene que hacer es quedarse quieto.
fr: Tout d'abord, remarquez que nous n'utilisons pas un nœud :ref:`RigidBody <class_RigidBody>`, mais un :ref:`StaticBody <class_StaticBody>`. La raison derrière ce choix est que nos cibles pas encore détruites ne vont bouger nul part ; utiliser un :ref:`RigidBody <class_RigidBody>` n'en voudrait pas la peine puisque que tout ce que cette cible va faire c'est rester immobile.
ja: まず、\ :ref:`RigidBody <class_RigidBody>` ノードではなく :ref:`StaticBody <class_StaticBody>` ノードを使用していることに注意してください。 この背後にある理由は、壊れていないターゲットがどこにも移動しないことです。\ :ref:`RigidBody <class_RigidBody>` を使用すると、静止している必要があるため、価値よりも面倒が勝っています。

source: We also save a tiny bit of performance using a :ref:`StaticBody <class_StaticBody>` over a :ref:`RigidBody <class_RigidBody>`.
es: También ahorramos un poco de rendimiento usando un :ref:`StaticBody <class_StaticBody>` sobre un :ref:`RigidBody <class_RigidBody>`.
fr: Nous gagnons également un tout petit peu de performances en utilisant un :ref:`StaticBody <class_StaticBody>` à la place d'un :ref:`RigidBody <class_RigidBody>`.
ja: また、\ :ref:`StaticBody <class_StaticBody>` を :ref:`RigidBody <class_RigidBody>` に重ねて使用することにより、パフォーマンスを少し改善できます。

source: The other thing to note is we have a node called ``Broken_Target_Holder``. This node is going to hold a spawned/instanced scene called ``Broken_Target.tscn``. Open up ``Broken_Target.tscn``.
es: La otra cosa a tener en cuenta es que tenemos un nodo llamado ``Broken_Target_Holder``. Este nodo va a albergar una escena creada/iniciada llamada ``Broken_Target.tscn``. Abre ``Broken_Target.tscn``.
fr: L'autre chose à noter c'est que nous utilisons un nœud appelé ``Broken_Target_Holder``. Ce nœud va contenir une scène instancié appelée ``Broken_Target.tscn``. Ouvrez ``Broken_Target.tscn``.
ja: もう1つ注意すべきことは、\ ``Broken_Target_Holder`` というノードがあることです。 このノードは、\ ``Broken_Target.tscn`` と呼ばれる生成/インスタンス化されたシーンを保持します。\ ``Broken_Target.tscn`` を開きます。
zh_cn: 另外需要注意的是我们有一个名为 ``Broken_Target_Holder`` 的节点。 该节点将保存一个名为 ``Broken_Target.tscn`` 的衍生/实例化场景。 打开 ``Broken_Target.tscn`` 。

source: Notice how the target is broken up into five pieces, each a :ref:`RigidBody <class_RigidBody>` node. We're going to spawn/instance this scene when the target takes too much damage and needs to be destroyed. Then, we're going to hide the non-broken target, so it looks like the target shattered rather than a shattered target was spawned/instanced.
es: Fíjate en cómo el objetivo se divide en cinco piezas, cada una de ellas un nodo :ref:`RigidBody <class_RigidBody>`. Vamos a generar/instanciar esta escena cuando el objetivo reciba demasiado daño y necesite ser destruido. Entonces, vamos a esconder el objetivo no roto, para que parezca que el objetivo destrozado en lugar de un objetivo destrozado fue generado/instanciado.
fr: Remarquez comme la cible se détruit en 5 morceaux distincts, chacun étant un nœud :ref:`RigidBody <class_RigidBody>`. Nous allons faire apparaître cette scène quand la cible prend trop de dégâts et doit être détruite. Ensuite, nous cacherons les cibles pas encore détruites de façon à avoir une cible qui se détruise plutôt qu'une cible qui apparaît détruite.
ja: ターゲットが5つの部分に分割されていることに注目してください。各部分は :ref:`RigidBody <class_RigidBody>` ノードです。 ターゲットがあまりにも多くのダメージを受け、破壊する必要がある場合、このシーンを産出/インスタンスします。 次に、壊れていないターゲットを非表示にします。そのため、粉々になったターゲットが産出/インスタンス化されたのではなく、粉々になったターゲットのように見えます。

source: While you still have ``Broken_Target.tscn`` open, attach ``RigidBody_hit_test.gd`` to all of the :ref:`RigidBody <class_RigidBody>` nodes. This will make it so the player can shoot at the broken pieces and they will react to the bullets.
es: Mientras aún tengas abierto ``Broken_Target.tscn``, adjunta ``RigidBody_hit_test.gd`` a todos los nodos :ref:`RigdBody <class_RigidBody>`. Esto hará que el jugador pueda disparar a las piezas rotas y que reaccionen a las balas.
fr: Tant que vous avez encore ``Broken_Target.tscn`` ouvert, ajoutez ``RigidBody_hit_test.gd`` à tous les nœuds :ref:`RigidBody <class_RigidBody>`. Cela va faire en sorte que le joueur puisse tirer sur les pièces détruites et qu'elles réagissent aux balles.
ja: ``Broken_Target.tscn`` を開いたまま、すべての :ref:`RigidBody <class_RigidBody>` ノードに ``RigidBody_hit_test.gd`` をアタッチします。これにより、プレイヤーは壊れた破片を撃つことができ、それは弾丸に反応します。

source: Alright, now switch back to ``Target.tscn``, select the ``Target`` :ref:`StaticBody <class_StaticBody>` node and create a new script called ``Target.gd``.
es: Bien, ahora vuelve a ``Target.tscn``, selecciona el nodo ``Target`` :ref: "StaticBody" <class_StaticBody> y crea un nuevo script llamado ``Target.gd``.
fr: Très bien, maintenant repassez à ``Target.tscn``, sélectionnez le nœud :ref:`StaticBody <class_StaticBody>` ``Target`` et créez un nouveau script appelé ``Target.gd``.
ja: さて、\ ``Target.tscn`` に戻り、\ ``Target`` :ref:`StaticBody <class_StaticBody>` ノードを選択して、\ ``Target.gd`` という新しいスクリプトを作成します。
zh_cn: 好吧，现在切换回 ``Target.tscn`` ，选择``Target`` :ref:`StaticBody <class_StaticBody>` 节点并创建一个名为 ``Target.gd`` 的新脚本。

source: Add the following code to ``Target.gd``:
es: Añade el siguiente código a ``Target.gd``:
fr: Ajoutez le code suivant à ``Target.gd`` :
ja: 次のコードを ``Target.gd`` に追加します:
zh_cn: 将以下代码添加到``Target.gd``:

source: Let's go over what this script does, starting with the class variables:
es: Repasemos lo que hace este script, empezando por las variables de clase:
fr: Passons en revue ce que fait ce script, en commençant par les variables de classe :
ja: このスクリプトの動作について、クラス変数から説明します:
zh_cn: 让我们回顾一下这个脚本的作用，从类变量开始:

source: ``TARGET_HEALTH``: The amount of damage needed to break a fully healed target.
es: ``TARGET_HEALTH``: La cantidad de daño necesaria para romper un objetivo con su salud completa.
fr: ``TARGET_HEALTH`` : Le montant de dégâts nécessaires afin de détruire une cible intacte.
ja: ``TARGET_HEALTH``: 完全に回復したターゲットを破壊するために必要なダメージの量。
zh_cn: ``TARGET_HEALTH``:打破完全治疗目标所需的伤害量。

source: ``current_health``: The amount of health this target currently has.
es: ``current_health``: La cantidad de salud que este objetivo tiene actualmente.
fr: ``current_health`` : La santé actuelle de la cible.
ja: ``current_health``: このターゲットが現在持っている体力の量。
zh_cn: ``current_health``:此目标目前的健康状况。

source: ``broken_target_holder``: A variable to hold the ``Broken_Target_Holder`` node so we can use it easily.
es: ``broken_target_holder``: Una variable para mantener el nodo ``Broken_Target_Holder`` para que podamos usarla fácilmente.
fr: ``broken_target_holder`` : Une variable pour stocker le nœud ``Broken_Target_Holder`` afin de pouvoir l'utiliser facilement.
ja: ``broken_target_holder``: 簡単に使用できるように ``Broken_Target_Holder`` ノードを保持する変数。
zh_cn: ``broken_target_holder``:一个变量，用于保存 ``Broken_Target_Holder`` 节点，以便我们可以轻松使用它。

source: ``target_collision_shape``: A variable to hold the :ref:`CollisionShape <class_CollisionShape>` for the non-broken target.
es: ``target_collision_shape``: Una variable para mantener la :ref:`CollisionShape <clase_CollisionShape>` para el objetivo no roto.
fr: ``target_collision_shape`` : Une variable pour stocker la :ref:`CollisionShape <class_CollisionShape>` pour les cibles non détruites.
ja: ``target_collision_shape``: 壊れていないターゲットの :ref:`CollisionShape <class_CollisionShape>` を保持する変数。
zh_cn: ``target_collision_shape``:一个变量，用于保存 :ref:`CollisionShape <class_CollisionShape>` 用于未破坏的目标。

source: ``TARGET_RESPAWN_TIME``: The length of time, in seconds, it takes for a target to respawn.
es: ``TARGET_RESPAWN_TIME``: El tiempo, en segundos, que tarda un objetivo en reaparecer.
fr: ``TARGET_RESPAWN_TIME`` : La durée en seconde correspondante au temps nécessaire pour que la cible réapparaisse.
ja: ``TARGET_RESPAWN_TIME``: ターゲットが再出現するのにかかる時間の長さ(秒単位)。
zh_cn: ``TARGET_RESPAWN_TIME``:目标重生的时间长度(以秒为单位)。

source: ``target_respawn_timer``: A variable to track how long a target has been broken.
es: ``target_respawn_timer``: Una variable para rastrear cuánto tiempo un objetivo ha sido roto.
fr: ``target_respawn_timer`` : Une variable utilisée pour suivre la durée durant laquelle la cible a été détruite.
ja: ``target_respawn_timer``: ターゲットが壊れている時間を追跡する変数。
zh_cn: ``target_respawn_timer``:一个跟踪目标被破坏时间的变量。

source: ``destroyed_target``: A :ref:`PackedScene <class_PackedScene>` to hold the broken target scene.
es: ``destroyed_target``: A :ref:`PackedScene <class_PackedScene>` para mantener la escena del objetivo roto.
fr: ``destroyed_target`` : Une :ref:`PackedScene <class_PackedScene>` Pour sauvegarder la scène de cible cassée.
ja: ``destroyed_target``: 壊れたターゲットシーンを保持するための :ref:`PackedScene <class_PackedScene>`\ 。
zh_cn: ``destroyed_target``:A :ref:`PackedScene <class_PackedScene>` 来保存破碎的目标场景。

source: Notice how we're using an exported variable (a :ref:`PackedScene <class_PackedScene>`) to get the broken target scene instead of using ``preload``. By using an exported variable, we can choose the scene from the editor, and if we need to use a different scene, it's as easy as selecting a different scene in the editor; we don't need to go to the code to change the scene we're using.
es: Fíjate en cómo usamos una variable exportada (a :ref:`PackedScene <class_PackedScene>`) para obtener la escena objetivo rota en lugar de usar la ``preload``. Usando una variable exportada, podemos elegir la escena desde el editor, y si necesitamos usar una escena diferente, es tan fácil como seleccionar una escena diferente en el editor; no necesitamos ir al código para cambiar la escena que estamos usando.
fr: Remarque que nous utilisons une variable exporté (une :ref:`PackedScene <class_PackedScene>`) pour récupérer la scène de cible détruite au lieu d'utiliser ``preload``. En utilisant une variable exporté, nous pouvons choisir la scène depuis l'éditeur et si nous avons besoin de sélectionner une autre scène, il suffit de sélectionner une autre scène dans l'éditeur ; nous n'avons pas besoin d'aller dans le code pour changer la scène à utiliser.
ja: ``preload`` を使用する代わりに、エクスポートされた変数(:ref:`PackedScene <class_PackedScene>`)を使用して破損したターゲットシーンを取得する方法に注意してください。エクスポートされた変数を使用すると、エディタからシーンを選択できます。別のシーンを使用する必要がある場合は、エディタで別のシーンを選択するのと同じくらい簡単です。 使用しているシーンを変更するためにコードに移動する必要はありません。

source: Let's look at ``_ready``.
es: Veamos el ``_ready``.
fr: Regardons maintenant ``_ready``.
ja: ``_ready`` を見てみましょう。
zh_cn: 让我们看看`_ready``。

source: The first thing we do is get the broken target holder and assign it to ``broken_target_holder``. Notice how we're using ``get_parent().get_node()`` here, instead of ``$``. If you wanted to use ``$``, then you'd need to change ``get_parent().get_node()`` to ``$"../Broken_Target_Holder"``.
es: Lo primero que hacemos es conseguir el broken target holder y asignarlo a ``broken_target_holder``. Fíjate en cómo usamos ``get_parent().get_node()`` aquí, en lugar de ``$``. Si quisieras usar ``$``, entonces necesitarías cambiar ``get_parent().get_node()`` a ``$"../Broken_Target_Holder"``.
fr: La première chose que nous devons faire, c'est récupérer le conteneur de cible cassé et l'assigner à ``broken_target_holder``. Notez que nous utilisons ``get_parent().get_node()`` ici au lieu de ``$``. Si vous vouliez utiliser ``$``, vous devriez changer ``get_parent().get_node()`` en ``$"../Broken_Target_Holder"``.
ja: 最初に行うことは、壊れたターゲットホルダーを取得し、それを ``broken_target_holder`` に割り当てることです。 ここでは、\ ``$`` ではなく ``get_parent().get_node()`` を使用していることに注意してください。\ ``$ `` を使用する場合は、\ ``get_parent().get_node()`` を ``$"../Broken_Target_Holder"`` に変更する必要があります。

source: At the time of when this was written, I did not realize you can use ``$"../NodeName"`` to get the parent nodes using ``$``, which is why ``get_parent().get_node()`` is used instead.
es: Cuando esto fue escrito, no me di cuenta de que se puede usar ``$"../NodeName"`` para obtener los nodos padres usando ``$``, por lo que se usa ``get_parent().get_node()`` en su lugar.
fr: Au moment où cela a été écrit, je n'ai pas réalisé que l'on pouvait utiliser ``$"../NomDuNoeud"`` pour récupérer le nœud parent en utilisant ``$``, c'est pourquoi ``get_parent().get_node()`` est utilisé à la place.
ja: これが書かれた時点では、親ノードを取得するために ``$`` を使った ``$"../ NodeName"`` が使用できることに気づきませんでした。これが、\ ``get_parent().get_node()`` が代わりに使用されている理由です。
zh_cn: 在写这篇文章时，我没有意识到您可以使用``$“../ NodeName”``来使用``$``来获取父节点，这就是为什么``get_parent()。get_node( )``用来代替。

source: Next, we get the collision shape and assign it to ``target_collision_shape``. The reason we need the collision shape is because even when the mesh is invisible, the collision shape will still exist in the physics world. This makes it so the player could interact with a non-broken target even though it's invisible, which is not what we want. To get around this, we will disable/enable the collision shape as we make the mesh visible/invisible.
es: A continuación, obtenemos la forma de la colisión y la asignamos a "target_collision_shape". La razón por la que necesitamos la forma de colisión es porque incluso cuando la malla es invisible, la forma de colisión seguirá existiendo en el mundo de la física. Esto hace que el jugador pueda interactuar con un objetivo no roto aunque sea invisible, que no es lo que queremos. Para evitar esto, desactivaremos/habilitaremos la forma de colisión mientras hacemos la malla visible/invisible.
fr: Ensuite, nous récupérons la collision shape et nous lui assignons ``target_collision_shape``. La raison pour laquelle nous avons besoin de la collision shape est parce que même si le mesh est invisible, la collision shape existe toujours dans le monde physique. Cela permettrait au joueur de pouvoir interagir avec une cible non cassée même si celle-ci est invisible ce qui n'est pas souhaitable. Pour contourner ce soucis, désactivons/réactivons la collision shape et nous rendons le mesh visible/invisible.
ja: 次に、コリジョンシェイプを取得し、\ ``target_collision_shape`` に割り当てます。 コリジョンシェイプが必要な理由は、メッシュが見えなくても、コリジョンシェイプが物理世界に存在するためです。 これにより、プレイヤーは見えないにもかかわらず、壊れていないターゲットとやり取りできるようになります。 これを回避するには、メッシュを表示/非表示にするときにコリジョンシェイプを無効/有効にします。

source: Next let's look at ``_physics_process``.
es: A continuación, veamos el ``_physics_process``.
fr: Ensuite, regardons ``_physics_process``.
ja: 次に、\ ``_physics_process`` を見てみましょう。
zh_cn: 接下来让我们看一下 ``_physics_process`` 。

source: We're only going to be using ``_physics_process`` for respawning, and so the first thing we do is check to see if ``target_respawn_timer`` is greater than ``0``.
es: Sólo vamos a usar el ``_physics_process`` para la reaparición, y lo primero que hacemos es comprobar si el ``target_respawn_timer`` es mayor que ``0``.
fr: Nous n'utiliserons que ``_physics_process`` pour faire apparaître et par conséquent, la première chose à vérifier est si ``target_respawn_timer`` est supérieur à ``0``.
ja: 再産出には ``_physics_process`` のみを使用するため、最初に行うことは、\ ``target_respawn_timer`` が ``0`` より大きいかどうかを確認することです。

source: If it is, we then subtract ``delta`` from it.
es: Si lo es, entonces le restamos ``delta``.
fr: Si c'est le cas, nous soustrayons ``delta`` de celui-ci.
ja: もしそうなら、それから ``delta`` を減算します。

source: Then we check to see if ``target_respawn_timer`` is ``0`` or less. The reason behind this is since we just removed ``delta`` from ``target_respawn_timer``, if it's ``0`` or less, then the target just got here, effectively allowing us to do whatever we need to do when the timer is finished.
es: Entonces comprobamos si ``target_respawn_timer`` es ``0`` o menos. La razón detrás de esto es que acabamos de eliminar ``delta`` de ``target_respawn_timer``, si es ``0`` o menos, entonces el objetivo acaba de llegar aquí, permitiéndonos hacer lo que necesitemos hacer cuando el temporizador esté terminado.
fr: Nous vérifions ensuite si ``target_respawn_timer`` est ``0`` ou moins. La raison derrière cela est qu'étant donné que nous avons retiré ``delta`` de ``target_respawn_timer``, si c'est égal à ``0`` ou moins, alors la cible vient d'arriver, ce qui nous permet de faire ce que l'on doit faire une fois le timer terminé.
ja: 次に、\ ``target_respawn_timer`` が ``0`` 以下かどうかを確認します。 この背後にある理由は、\ ``target_respawn_timer`` から ``delta`` を削除し、それが ``0`` 以下の場合は、ターゲットがここに到着したので、タイマーが終了したときに行うべきことは何でも効果的に実行できます。

source: In this case, we want to respawn the target.
es: En este caso, queremos volver a generar nuestro objetivo.
fr: Dans ce cas, nous voulons faire réapparaître la cible.
ja: この場合、ターゲットを再産出します。
zh_cn: 在这种情况下，我们想重新生成目标。

source: The first thing we do is remove all children in the broken target holder. We do this by iterating over all of the children in ``broken_target_holder`` and free them using ``queue_free``.
es: Lo primero que hacemos es sacar a todos los hijos del contenedor de objetivo roto. Lo hacemos iterando sobre todos los hijos en ``broken_target_holder`` y los liberamos usando ``queue_free``.
fr: La première chose que nous faisons, c'est retirer tous les enfants du conteneur de cible cassé. On fait ça en parcourant tous les fils de ``broken_target_holder`` et en les supprimant en utilisant ``queue_free``.
ja: 最初に行うことは、壊れたターゲットホルダーのすべての子を削除することです。 これを行うには、\ ``broken_target_holder`` 内のすべての子を反復処理し、\ ``queue_free`` を使用してそれらを解放します。
zh_cn: 我们要做的第一件事是移除破碎的目标持有者中的所有儿童。 我们通过遍历 ``broken_target_holder`` 中的所有子节点并使用 ``queue_free`` 释放它们来完成此操作。

source: Next, we enable the collision shape by setting its ``disabled`` boolean to ``false``.
es: Luego, habilitamos la forma de colisión poniendo su ``disabled`` booleano a ``false``.
fr: Puis, nous activons les collision shape en mettant leur booléen ``disabled`` à ``false``.
ja: 次に、\ ``disabled`` ブール値を ``false`` に設定してコリジョンシェイプを有効にします。

source: Then we make the target, and all of its children nodes, visible again.
es: Entonces hacemos que el objetivo, y todos sus nodos hijos, sean visibles de nuevo.
fr: Nous rendons alors la cible ainsi que tous ces enfants visibles à nouveau.
ja: 次に、ターゲットとそのすべての子ノードを再び表示します。
zh_cn: 然后我们再次使目标及其所有子节点可见。

source: Finally, we reset the target's health (``current_health``) to ``TARGET_HEALTH``.
es: Finalmente, reajustamos la salud del objetivo (``current_health``) a ``TARGET_HEALTH``.
fr: Enfin, nous réinitialisons la santé de la cible (``current_health``) en ``TARGET_HEALTH``.
ja: 最後に、ターゲットの体力(``current_health``)を ``TARGET_HEALTH`` にリセットします。
zh_cn: 最后，我们将目标的健康状况(``current_health``)重置为``TARGET_HEALTH``。

source: Finally, let's look at ``bullet_hit``.
es: Por último, veamos el ``bullet_hit``.
fr: Terminons par un coup d’œil à ``bullet_hit``.
ja: 最後に、\ ``bullet_hit`` を見てみましょう。
zh_cn: 最后，让我们看一下 ``bullet_hit`` 。

source: The first thing we do is subtract however much damage the bullet does from the target's health.
es: Lo primero que hacemos es restar todo el daño que la bala hace a la salud del objetivo.
fr: La première chose que nous faisons est de soustraire le nombre de dégâts de la balle a fait à la santé de la cible.
ja: 最初に行うことは、ターゲットの体力から弾丸が与えるダメージを差し引くことです。

source: Next we check to see if the target is at ``0`` health or lower. If it is, the target has just died and we need to spawn a broken target.
es: A continuación, comprobamos si el objetivo está en ``0`` de salud o más bajo. Si lo está, el objetivo acaba de morir y necesitamos crear un objetivo roto.
fr: Ensuite, nous vérifions si la santé de la cible est à ``0`` ou moins. Si c'est le cas, la cible vient d'être détruite et nous devons faire apparaître une cible détruite.
ja: 次に、ターゲットの体力が ``0`` 以下であるかどうかを確認します。 もしそうなら、ターゲットは死んだばかりで、壊れたターゲットを生成する必要があります。
zh_cn: 接下来我们检查目标是否处于“0”健康状态或更低。 如果是，目标刚刚死亡，我们需要产生一个破碎的目标。

source: We first instance a new destroyed target scene, and assign it to a new variable, a ``clone``.
es: Primero, damos un ejemplo de una nueva escena destruida, y la asignamos a una nueva variable, un ``clone``.
fr: Nous commençons par instancier une nouvelle scène de cible détruite et on lui assigne une nouvelle variable, un ``clone``.
ja: まず、破壊された新しいターゲットシーンをインスタンス化し、それを新しい変数 ``clone`` に割り当てます。
zh_cn: 我们首先实例化一个新的被破坏的目标场景，并将其分配给一个新变量，即 ``clone`` 。

source: Next we add the ``clone`` as a child of the broken target holder.
es: A continuación añadimos el ``clone`` como un hijo del portador del objetivo roto.
fr: Nous ajoutons le ``clone`` en tant que fils du conteneur de cible détruite.
ja: 次に、壊れたターゲットホルダーの子として ``clone`` を追加します。
zh_cn: 接下来，我们将 ``clone`` 添加为已损坏目标持有者的子项。

source: For bonus effect, we want to make all the target pieces explode outwards. To do this, we iterate over all the children in ``clone``.
es: Para un efecto adicional, queremos hacer que todas las piezas del objetivo exploten hacia afuera. Para hacer esto, iteramos sobre todos los niños en ``clone``.
fr: Pour un effet bonus, nous voulons que toutes les pièces de cibles explosent vers l'extérieur. Pour faire cela, nous parcourons tous les enfants dans ``clone``.
ja: ボーナス効果のために、すべてのターゲットピースを外側に爆発させます。 これを行うために、\ ``clone`` のすべての子を反復処理します。
