Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_five.po
Languages: de, es, fr, ja, zh_cn

source: ``GRENADE_AMOUNTS``: The amount of grenades each pickup contains.
de: ``GRENADE_AMOUNTS``: Die Anzahl der Granaten, die jeder Pickup enthält.
es: ``GRENADE_AMOUNTS``: La cantidad de granadas que contiene cada recogida.
fr: ``GRENADE_AMOUNTS`` : Le montant de grenades que chaque bonus contient.
ja: ``GRENADE_AMOUNTS``: 各ピックアップに含まれる手榴弾の量。

source: Notice how the second element in ``GRENADE_AMOUNTS`` is ``0``. This is so the small ammo pickup does not give the player any additional grenades.
es: Fíjate en cómo el segundo elemento en ``GRENADE_AMOUNTS`` es ``0``. Esto es así para que la pequeña recogida de municiones no le dé al jugador ninguna granada adicional.
fr: Remarquez que le second élément dans ``GRENADE_AMOUNTS`` est ``0``. Nous avons fait cela afin que le plus petit bonus de munitions ne donne pas de grenades additionnelles au joueur.
ja: ``GRENADE_AMOUNTS`` の2番目の要素が ``0`` であることに注意してください。これは、小さな弾薬ピックアップがプレイヤーに追加の手榴弾を与えないようにするためです。

source: Now you should be able to throw grenades! Go give it a try!
de: Jetzt sollten Sie in der Lage sein, Granaten zu werfen! Versuchen Sie es doch mal!
es: ¡Ahora deberías ser capaz de lanzar granadas! ¡Inténtalo!
fr: Vous devriez être en mesure de lancer des grenades ! Faites un essai !
ja: これで手榴弾を投げることができるはずです！試してみてください！
zh_cn: 现在您应该可以投掷手榴弹了！ 去尝试吧！

source: Adding the ability to grab and throw RigidBody nodes to the player
de: Hinzufügen der Fähigkeit zum Greifen und Werfen von RigidBody-Nodes für den Spieler
es: Añadiendo la capacidad de agarrar y lanzar los nodos de RigidBody al jugador
fr: Ajout de la capacité d'attraper et lancer des nœuds RigidBody au joueur
ja: RigidBodyノードを取得してプレイヤーに投げる機能を追加する
zh_cn: 添加抓取并将RigidBody节点投射到游戏角色的功能

source: Next, let's give the player the ability to pick up and throw :ref:`RigidBody <class_RigidBody>` nodes.
de: Als nächstes geben wir dem Spieler die Möglichkeit, :ref:`RigidBody <class_RigidBody>`-Nodes aufzunehmen und zu werfen.
es: En el siguiente paso, demos al jugador la habilidad de agarrar y lanzar nodos :ref:`RigidBody <class_RigidBody>`.
fr: Ensuite, donnons au joueur la capacité de ramasser et lancer des nœuds :ref:`RigidBody <class_RigidBody>`.
ja: 次に、プレイヤーに :ref:`RigidBody <class_RigidBody>` ノードをピックアップしてスローする機能を与えましょう。

source: Open up ``Player.gd`` and add the following class variables:
de: Öffnen Sie ``Player.gd`` und fügen Sie die folgenden Klassenvariablen hinzu:
es: Abre ``Player.gd`` y añade las siguientes variables de clase:
fr: Ouvrez ``Player.gd`` et ajouter les variables de classe suivantes :
ja: ``Player.gd`` を開き、以下のクラス変数を追加してください:
zh_cn: 打开 ``Player.gd`` 并添加以下类变量:

source: ``grabbed_object``: A variable to hold the grabbed :ref:`RigidBody <class_RigidBody>` node.
de: ``grabbed_object``: Eine Variable zum Halten des ergriffenen :ref:`RigidBody <class_RigidBody>` Nodes.
es: ``grabbed_object``: Una variable para mantener el nodo agarrado :ref:`RigidBody <class_RigidBody>`.
fr: ``grabbed_object`` : Une variable pour stocker le nœud :ref:`RigidBody <class_RigidBody>` attrapé.
ja: ``grabbed_object``: つかんだ :ref:`RigidBody <class_RigidBody>` ノードを保持する変数。
zh_cn: ``grabbed_object``:一个用于保存抓取的变量 :ref:`RigidBody <class_RigidBody>` 节点。

source: ``OBJECT_THROW_FORCE``: The force with which the player throws the grabbed object.
de: ``OBJECT_THROW_FORCE``: Die Kraft mit der der Spieler das ergriffene Objekt wirft.
es: ``OBJECT_THROW_FORCE``: La fuerza con la que el jugador lanza el objeto agarrado.
fr: ``OBJECT_THROW_FORCE`` : La force avec laquelle le joueur va lancer l'objet attrapé.
ja: ``OBJECT_THROW_FORCE``: プレイヤーがつかんだオブジェクトを投げる力。

source: ``OBJECT_GRAB_DISTANCE``: The distance away from the camera at which the player holds the grabbed object.
de: ``OBJECT_GRAB_DISTANCE``: Der Abstand von der Kamera, in dem der Spieler das ergriffene Objekt hält.
es: ``OBJECT_GRAB_DISTANCE``: La distancia de la cámara a la que el jugador sostiene el objeto agarrado.
fr: ``OBJECT_GRAB_DISTANCE`` : La distance entre la caméra et l'objet attrapé par le joueur.
ja: ``OBJECT_GRAB_DISTANCE``: プレイヤーがつかんだオブジェクトを保持するカメラからの距離。

source: ``OBJECT_GRAB_RAY_DISTANCE``: The distance the :ref:`Raycast <class_Raycast>` goes. This is the player's grab distance.
de: ``OBJECT_GRAB_RAY_DISTANCE``: Die Entfernung, die der :ref:`Raycast <class_Raycast>` zurücklegt. Dies ist die Reichweite des Spielers.
es: ``OBJECT_GRAB_RAY_DISTANCE``: La distancia a la que va el :ref:`Raycast <clasñ_Raycast>`. Esta es la distancia de agarre del jugador.
fr: ``OBJECT_GRAB_RAY_DISTANCE`` : La distance parcourue par le :ref:`Raycast <class_Raycast>`. C'est la distance à laquelle le joueur peut attraper des objets.
ja: ``OBJECT_GRAB_RAY_DISTANCE``: :ref:`Raycast <class_Raycast>` が進む距離。これはプレイヤーのつかむ距離です。
zh_cn: ``OBJECT_GRAB_RAY_DISTANCE``:距离 :ref:`Raycast <class_Raycast>` 去了。 这是游戏角色的抓地距离。

source: With that done, all we need to do is add some code to ``process_input``:
de: Wenn das erledigt ist, müssen wir nur noch etwas Code zu ``process_input`` hinzufügen:
es: Una vez hecho esto, todo lo que tenemos que hacer es añadir algún código a ``process_input``':
fr: Ceci fait, tout ce que nous devons ajouter, c'est un peu de code dans ``process_input`` :
ja: これが完了したら、必要なのは ``process_input`` にコードを追加することだけです:
zh_cn: 完成后，我们需要做的就是在 ``process_input`` 中添加一些代码:

source: Let's go over what's happening.
de: Lassen Sie uns noch einmal durchgehen, was geschieht.
es: Repasemos lo que está pasando.
fr: Voyons ce qui se passe.
ja: 何が起こっているのか見ていきましょう。
zh_cn: 让我们回顾一下正在发生的事情。

source: Firstly, we check to see if the action pressed is the ``fire`` action, and that the player is using the ``UNARMED`` 'weapon'. This is because we only want the player to be able to pick up and throw objects when the player is not using any weapons. This is a design choice, but I feel it gives ``UNARMED`` a use.
es: En primer lugar, comprobamos si la acción presionada es la de ``fire``, y que el jugador está usando el ``UNARMED`` arma. Esto se debe a que sólo queremos que el jugador sea capaz de recoger y lanzar objetos cuando el jugador no está usando ningún arma. Esta es una elección de diseño, pero creo que le da a ``UNARMED`` un uso.
fr: Premièrement, nous devons vérifier si l'action déclenchée est l'action ``fire`` et que le joueur utilise « l'arme » ``UNARMED``. Nous vérifions cela, car nous voulons que le joueur puisse récupérer et lancer des objets seulement quand il n'utilise aucune arme. C'est un choix de design et cela donne du sens à ``UNARMED``.
ja: 最初に、押されたアクションが ``fire`` アクションであるかどうか、およびプレイヤーが使用中の 'weapon' が ``UNARMED`` かどうかを確認します。これは、プレイヤーが武器を使用していないときにのみ、プレイヤーがオブジェクトを拾い上げて投げることができるようにするためです。これは設計上の選択ですが、私はそれが ``UNARMED`` の使い道だと思っています。

source: Next we check to see whether or not ``grabbed_object`` is ``null``.
de: Als nächstes prüfen wir, ob ``Grabbed_object`` `Null`` ist oder nicht.
es: A continuación comprobamos si el ``grabbed_object`` es ``null`` o no.
fr: Vérifions ensuite si ``grabbed_object`` est ``null``.
ja: 次に、\ ``grabbed_object`` が ``null`` かどうかを確認します。
zh_cn: 接下来我们检查 ``grabbed_object`` 是否为 ``null``。

source: If ``grabbed_object`` is ``null``, we want to see if we can pick up a :ref:`RigidBody <class_RigidBody>`.
es: Si ``grabbed_object`` es ``null``, queremos ver si podemos coger un :ref:`RigidBody <class_RigidBody>`.
fr: Si ``grabbed_object`` est ``null``, nous voulons voir si nous pouvons ramasser un :ref:`RigidBody <class_RigidBody>`.
ja: ``grabbed_object`` が ``null`` の場合、\ :ref:`RigidBody <class_RigidBody>` を取得できるかどうかを確認します。
zh_cn: 如果 ``grabbed_object`` 是 ``null`` ，我们想看看我们是否可以选择 :ref:`RigidBody <class_RigidBody>`。

source: We first get the direct space state from the current :ref:`World <class_World>`. This is so we can cast a ray entirely from code, instead of having to use a :ref:`Raycast <class_Raycast>` node.
es: Primero obtenemos el estado espacial directo de la actual :ref:`World <class_World>`. Esto es para que podamos lanzar un rayo completamente desde el código, en lugar de tener que usar un nodo :ref:`Raycast <class_Raycast>`.
fr: Nous récupérons d'abord l'état spatial direct du :ref:`World <class_World>` actuel. Cela nous permettra de lancer un rayon entièrement depuis le code, au lieu d'avoir à utiliser un nœud :ref:`Raycast <class_Raycast>`.
ja: まず、現在の :ref:`World <class_World>` から直接space state(空間の情報)を取得します。これにより、\ :ref:`Raycast <class_Raycast>` ノードを使用する代わりに、コードから完全にレイをキャストできます。
zh_cn: 我们首先从当前获得直接空间状态 :ref:`World <class_World>`。 这样我们就可以完全从代码中投射光线，而不必使用 :ref:`Raycast <class_Raycast>` 节点。

source: See :ref:`Ray-casting <doc_ray-casting>` for more information on raycasting in Godot.
de: Siehe :ref:`Raycasting <doc_ray-casting>` für weitere Informationen über Raycasting in Godot.
es: Consulte :ref:`Ray-casting <doc_ray-casting>` para obtener más información sobre raycasting en Godot.
fr: Voir :ref:`Ray-casting <doc_ray-casting>` pour plus d'informations sur le raycasting dans Godot.

source: Then we get the center of the screen by dividing the current :ref:`Viewport <class_Viewport>` size in half. We then get the ray's origin point and end point using ``project_ray_origin`` and ``project_ray_normal`` from the camera. If you want to know more about how these functions work, see :ref:`Ray-casting <doc_ray-casting>`.
es: Entonces obtenemos el centro de la pantalla dividiendo el tamaño actual :ref:`Viewport <class_Viewport>` por la mitad. Luego obtenemos el punto de origen y el punto final del rayo usando ``project_ray_origin`` y ``project_ray_normal`` de la cámara. Si quieres saber más sobre cómo funcionan estas funciones, mira :ref:`Ray-casting <doc_ray-casting>`.
fr: Ensuite, nous récupérons le centre de l'écran en divisant la taille de la :ref:`Viewport <class_Viewport>` par deux. Nous obtenons ensuite le point d'origine et d'arrivée du rayon en utilisant ``project_ray_origin`` et ``project_ray_normal`` de la caméra. Si vous voulez en savoir plus sur le fonctionnement de ces fonctions, regardez :ref:`Ray-casting <doc_ray-casting>`.
ja: 次に、現在の :ref:`Viewport <class_Viewport>` サイズを半分に分割して、画面の中心を取得します。次に、カメラから ``project_ray_origin`` と ``project_ray_normal`` を使用してレイの始点と終点を取得します。これらの関数がどのように機能するかについてもっと知りたい場合は、\ :ref:`レイキャスティング <doc_ray-casting>` を参照してください。
zh_cn: 然后我们通过将当前 :ref:`Viewport <class_Viewport>` 大小分成两半来得到屏幕的中心。 然后我们使用摄像机的 ``project_ray_origin`` 和 ``project_ray_normal`` 获取射线的原点和终点。 如果您想了解有关这些函数如何工作的更多信息，请参阅 :ref:`Ray-casting <doc_ray-casting>`。

source: Next we send the ray into the space state and see if it gets a result. We add the player and the knife's :ref:`Area <class_Area>` as two exceptions so the player cannot carry themselves or the knife's collision :ref:`Area <class_Area>`.
es: A continuación enviamos el rayo al estado espacial y vemos si obtiene un resultado. Añadimos el jugador y el cuchillo :ref:`Area <class_Area>` como dos excepciones para que el jugador no se pueda llevar a sí mismo o la colisión del cuchillo :ref:`Area <class_Area>`.
fr: Nous envoyons ensuite le rayon dans l'espace 3D et nous vérifions si nous avons un résultat. Nous ajoutons la :ref:`Area <class_Area>` du couteau et du joueur comme exception de façon à ce que le joueur ne puisse pas se porter lui même ou la :ref:`Area <class_Area>` du couteau.
ja: 次に、レイをspace state(空間の情報)に送り、結果が得られるかどうかを確認します。プレイヤーとナイフの :ref:`Area <class_Area>` を2つの例外として追加し、プレイヤーが自分自身やナイフのコリジョン :ref:`Area <class_Area>` を運べないようにします。
zh_cn: 接下来，我们将光线发送到空间状态，看看它是否得到了结果。 我们添加了游戏角色和刀子 :ref:`Area <class_Area>` 作为两个例外，因此游戏角色无法携带自己或刀的碰撞 :ref:`Area <class_Area>`。

source: Then we check to see if we got a result back from the ray. If no object has collided with the ray, an empty Dictionary will be returned. If the Dictionary is not empty (i.e. at least one object has collided), we then see if the collider the ray collided with is a :ref:`RigidBody <class_RigidBody>`.
es: Luego comprobamos si tenemos un resultado del rayo. Si ningún objeto ha colisionado con el rayo, se devolverá un Diccionario vacío. Si el Diccionario no está vacío (es decir, si al menos un objeto ha colisionado), entonces veremos si el colisionador con el rayo es un :ref:`RigidBody <class_RigidBody>`.
fr: Ensuite, nous vérifions si nous avons obtenu un résultat du rayon. Si aucun objet n'est entré en collision avec le rayon, un dictionnaire vide sera renvoyé. Si le dictionnaire n’est pas vide (c’est-à-dire qu’au moins un objet est entré en collision), nous voyons alors si le collisionneur avec lequel le rayon est entré en collision est un :ref:`RigidBody <class_RigidBody>`.
ja: 次に、レイから結果が返されたかどうかを確認します。オブジェクトがレイと衝突していない場合、空のDictionaryが返されます。Dictionaryが空でない場合(つまり、少なくとも1つのオブジェクトが衝突した場合)、レイが衝突したコライダーが :ref:`RigidBody <class_RigidBody>` であるかどうかを確認します。

source: If the ray collided with a :ref:`RigidBody <class_RigidBody>`, we set ``grabbed_object`` to the collider the ray collided with. We then set the mode on the :ref:`RigidBody <class_RigidBody>` we collided with to ``MODE_STATIC`` so it doesn't move in our hands.
es: Si el rayo chocó con un :ref:`RigidBody <class_RigidBody>`, ponemos ``grabbed_object`` al colisionador con el que chocó el rayo. Luego ponemos el modo en el :ref:`RigidBody <class_RigidBody>` con el que chocamos a ``MODE_STATIC`` para que no se mueva en nuestras manos.
fr: Si le rayon est rentré en contact avec un :ref:`RigidBody <class_RigidBody>`, on l'assigne au ``grabbed_object``. On met ensuite le mode du :ref:`RigidBody <class_RigidBody>` avec lequel nous sommes rentré en contact en ``MODE_STATIC`` de façon à ce qu'il ne bouge pas dans nos mains.
ja: レイが :ref:`RigidBody <class_RigidBody>` と衝突した場合、レイが衝突したコライダーに ``grabbed_object`` を設定します。次に、衝突した :ref:`RigidBody <class_RigidBody>` のモードを ``MODE_STATIC`` に設定し、手の中で動かないようにします。
zh_cn: 如果光线与 :ref:`RigidBody <class_RigidBody>相撞，我们将 ``grabbed_object`` 设置为光线与光线相撞的对撞机。 然后我们将模式设置为 :ref:`RigidBody <class_RigidBody>` 我们与 ``MODE_STATIC`` 相撞，所以它不会在我们手中移动。

source: Finally, we set the grabbed :ref:`RigidBody <class_RigidBody>`'s collision layer and collision mask to ``0``. This will make the grabbed :ref:`RigidBody <class_RigidBody>` have no collision layer or mask, which means it will not be able to collide with anything as long as we are holding it.
es: Por último, ponemos la capa de colisión y la máscara de colisión del :ref:`RigidBody <class_RigidBody>` agarrador a ``0``. Esto hará que el agarrado :ref:`RigidBody <class_RigidBody>` no tenga capa o máscara de colisión, lo que significa que no podrá colisionar con nada mientras lo mantengamos.
fr: Enfin, nous assignons au collision layer et au collision mask du :ref:`RigidBody <class_RigidBody>` attrapé à ``0``. Cela fera en sorte que le :ref:`RigidBody <class_RigidBody>` n'ait pas de collision layer ou mask, ce qui veut dire qu'il ne pourra pas rentrer en collision tant qu'on le tiendra.
ja: 最後に、取得した :ref:`RigidBody <class_RigidBody>` のコリジョンレイヤーとコリジョンマスクを ``0`` に設定します。これにより、つかまれた :ref:`RigidBody <class_RigidBody>` にコリジョンレイヤーやマスクがなくなります。つまり、保持している限り、衝突することはありません。
zh_cn: 最后，我们将抓取的 :ref:`RigidBody <class_RigidBody>的碰撞层和碰撞掩码设置为“0”。 这将使得抓住 :ref:`RigidBody <class_RigidBody>` 没有碰撞层或掩码，这意味着只要我们拿着它就不会碰到任何东西。

source: See :ref:`Physics introduction <doc_physics_introduction_collision_layer_code_example>` for more information on Godot collision masks.
de: Siehe :ref:`Physik-Einleitung <doc_physics_introduction_collision_layer_collision_example>` für weitere Informationen über Godots Kollisionsmasken.
es: Vea :ref:`Physics introduction <doc_physics_introduction_collision_layer_code_example> para más información sobre las máscaras de colisión de Godot.
fr: Voir :ref:`Physics introduction <doc_physics_introduction_collision_layer_code_example>` pour plus d'informations sur les masques de collision de Godot.

source: If ``grabbed_object`` is not ``null``, then we need to throw the :ref:`RigidBody <class_RigidBody>` the player is holding.
es: Si ``grabbed_object" no es ``null``, entonces tenemos que tirar el :ref:`RigidBody <class_RigidBody>` que el jugador está sosteniendo.
fr: Si ``grabbed_object`` n'est pas ``null``, nous devons alors lancer le :ref:`RigidBody <class_RigidBody>` que le joueur tient.
ja: ``grabbed_object`` が ``null`` でない場合、プレイヤーが保持している :ref:`RigidBody <class_RigidBody>` を投げる必要があります。
zh_cn: 如果 ``grabbed_object`` 不是 ``null`` ，那么我们需要抛出游戏角色持有的 :ref:`RigidBody <class_RigidBody>。

source: We first set the mode of the :ref:`RigidBody <class_RigidBody>` we are holding to ``MODE_RIGID``.
de: Zuerst setzen wir den Modus des :ref:``RigidBody <class_RigidBody>`, den wir auf ``MODE_RIGID`` halten.
es: Primero establecemos el mode del :ref:`RigidBody <class_RigidBody>` que estamos agarrando en ``MODE_RIGID``.
fr: Nous définissons d'abord le mode du :ref:`RigidBody <class_RigidBody>` que nous mettons sur ``MODE_RIGID``.
ja: まず、保持している :ref:`RigidBody <class_RigidBody>` のモードを ``MODE_RIGID`` に設定します。

source: This is making a rather large assumption that all the rigid bodies will be using ``MODE_RIGID``. While that is the case for this tutorial series, that may not be the case in other projects.
es: Esto es hacer una suposición bastante grande que todos los cuerpos rígidos estarán usando ``MODE_RIGID``. Mientras que ese es el caso de esta serie de tutoriales, puede que no sea el caso en otros proyectos.
fr: Nous faisons une plutôt grande hypothèse que tous les rigidbodies utilisent ``MODE_RIGID``. Bien que ce soit le cas pour cette série de tutoriels, cela ne sera pas forcément le cas dans d'autres projets.
ja: これは、すべてのリジッドボディが ``MODE_RIGID`` を使用するというかなり大きな仮定を行っています。このチュートリアルシリーズの場合はそれでいいのですが、他のプロジェクトではそうではないかもしれません。
zh_cn: 这是一个相当大的假设，即所有刚体都将使用“MODE_RIGID”。 虽然本教程系列就是这种情况，但在其他项目中可能并非如此。

source: If you have rigid bodies with different modes, you may need to store the mode of the :ref:`RigidBody <class_RigidBody>` you have picked up into a class variable so you can change it back to the mode it was in before you picked it up.
es: Si tienes cuerpos rígidos con diferentes modos, puede que necesites almacenar el modo del :ref:`RigidBody <class_RigidBody>` que has recogido en una variable de clase para que puedas cambiarlo de nuevo al modo en que estaba antes de recogerlo.
fr: Si vous avez des rigidbodies avec différents modes, vous devrez peut-être stocker le mode du :ref:`RigidBody <class_RigidBody>` que vous avez ramassé dans une variable de classe afin de lui rétablir son mode au moment où vous l'avez ramassé.
ja: 異なるモードのリジッドボディがある場合、選択した :ref:`RigidBody <class_RigidBody>` のモードをクラス変数に保存して、、それを拾う前のモードに戻すことができるようにする必要があります。

source: Then we apply an impulse to send it flying forward. We send it flying in the direction the camera is facing, using the force we set in the ``OBJECT_THROW_FORCE`` variable.
es: Luego aplicamos un impulso para que vuele hacia delante. Lo mandamos en la dirección en la cual la cámara esta mirando, usando la fuerza que introducimos en la variable ``OBJECT_THROW_FORCE``.
fr: Nous lui appliquons ensuite une impulsion pour le propulser devant. Nous le faisons voelr dans la direction où la caméra fait face, en utilisant la force que nous avons assigné à la variable ``OBJECT_THROW_FORCE``.
ja: 次に、衝撃を適用(apply_impulse)して前方に飛行させます。\ ``OBJECT_THROW_FORCE`` 変数で設定した力を使用して、カメラが向いている方向に飛行します。
zh_cn: 然后我们施加冲动将它向前飞。 我们使用我们在 ``OBJECT_THROW_FORCE`` 变量中设置的力将它发送到相机朝向的方向。

source: We then set the grabbed :ref:`RigidBody <class_RigidBody>`'s collision layer and mask to ``1``, so it can collide with anything on layer ``1`` again.
es: Luego ponemos la capa y la máscara de colisión de :ref:`RigidBody <class_RigidBody>` en ``1``, para que pueda colisionar con cualquier cosa en la capa ``1`` de nuevo.
fr: Nous assignons alors ``1`` au collision et layer mask du :ref:`RigidBody <class_RigidBody>` attrapé, afin qu'il puisse rentre en collision avec d'autres objets à nouveau.
ja: 次に、取得した :ref:`RigidBody <class_RigidBody>` のコリジョンレイヤーとマスクを ``1`` に設定します。これにより、レイヤー ``1`` 上のすべてのものと再び衝突できるようになります。
zh_cn: 然后我们将抓取的 :ref:`RigidBody <class_RigidBody>的碰撞层和掩码设置为 ``1`` ，这样它就可以再次与层“1”上的任何东西碰撞。

source: This is, once again, making a rather large assumption that all the rigid bodies will be only on collision layer ``1``, and all collision masks will be on layer ``1``. If you are using this script in other projects, you may need to store the collision layer/mask of the :ref:`RigidBody <class_RigidBody>` in a variable before you change them to ``0``, so you would have the original collision layer/mask to set for them when you are reversing the process.
es: Esto, una vez más, supone una suposición bastante grande de que todos los cuerpos rígidos estarán solo en la capa de colisión ``1``, y todas las máscaras de colisión estarán en la capa ``1``. Si está utilizando este script en otros proyectos, es posible que deba almacenar la capa / máscara de colisión de :ref:`RigidBody <class_RigidBody>` en una variable antes de cambiarlos a ``0``, por lo que tendría la capa / máscara de colisión original para configurarlos cuando está invirtiendo el proceso.
fr: Nous faisons, encore une fois, une plutôt grande hypothèse en partant du principe que tous les rigidbodies auront leur collisions mask et layer sur ``1``. Si vous utilisez ce script sur d'autres projets, vous devrez peut-être stocker les collision layer/mask des :ref:`RigidBody <class_RigidBody>` attrapés dans une variables avant de les changer à ``0``, de façon à leur rendre leur valeur initiale une fois lâchés.
ja: これもまた、すべてのリジッドボディがコリジョンレイヤー ``1`` にのみ存在し、すべてのコリジョンマスクがレイヤー ``1`` に存在するというかなり大きな仮定をしています。このスクリプトを他のプロジェクトで使用する場合、\ ``0`` に変更する前に、変数に :ref:`RigidBody <class_RigidBody>` のコリジョンレイヤー/マスクを保存する必要がある場合があります。プロセスを反転するときにそれらを元のコリジョンレイヤー/マスクに設定します。
zh_cn: 这又是一个相当大的假设，即所有刚体都只在碰撞层“1”上，所有碰撞掩模都在层“1”上。 如果您在其他项目中使用此脚本，您可能需要在变量中存储 :ref:`RigidBody <class_RigidBody>` 的碰撞图层/掩码，然后将它们更改为“0”，这样您就可以 在您反转过程时为其设置的原始碰撞图层/蒙版。

source: Finally, we set ``grabbed_object`` to ``null`` since the player has successfully thrown the held object.
de: Schließlich setzen wir ``grabbed_object`` auf ``null``, da der Spieler das gehaltene Objekt erfolgreich geworfen hat.
es: Finalmente, cambiamos ``grabbed_object`` a ``null``ya que el jugador ha lanzado satisfactoriamente el objeto que estaba sujetando.
fr: Enfin, on assigne ``null`` au ``grabbed_object`` car le joueur a lancé avec succès l'objet.
ja: 最後に、プレイヤーが保持していたオブジェクトを正常に投げたので、\ ``grabbed_object`` を ``null`` に設定します。
zh_cn: 最后，我们将 ``grabbed_object`` 设置为 ``null`` ，因为游戏角色已经成功抛出了被保持的对象。

source: The last thing we do is check to see whether or not ``grabbed_object`` is equal to ``null``, outside all of the grabbing/throwing related code.
es: Lo último que hacemos es comprobar si ``grabbed_object`` es igual a ``null``, fuera de todo el código relacionado con agarrar/tirar.
fr: La dernière chose que nous devons faire, c'est de vérifier si oui ou non ``grabbed_object`` est égal à ``null`` en dehors du code relatif à attraper/jeter un objet.
ja: 最後に行うことは、\ ``grabbed_object`` が ``null`` に等しいかどうかを確認することです。これは、すべての つかむ/投げる 関連コードの外側で行います。
zh_cn: 我们做的最后一件事是在所有抓取/投掷相关代码之外检查 ``grabbed_object`` 是否等于 ``null`` 。

source: While technically not input related, it's easy enough to place the code moving the grabbed object here because it's only two lines, and then all of the grabbing/throwing code is in one place
es: Aunque técnicamente no está relacionado con la entrada, es bastante fácil mover el objeto agarrado aquí porque son sólo dos líneas, y entonces todo el código de agarre/lanzamiento está en un lugar
fr: Bien que techniquement ce n'est pas relié aux entrées, il est assez facile de placer le code de déplacement des objets attrapés ici car ce n'est que deux lignes et que tout le code pour attraper/lancer un objet se trouve au même endroit
ja: 技術的には入力関連ではありませんが、つかんだオブジェクトを移動するコードをここに配置するのは簡単です。2行しかないため、つかむ/投げるコードはすべて1か所にあるからです
zh_cn: 虽然技术上没有输入相关，但是将代码移动到此处的代码很容易，因为它只有两行，然后所有的抓取/抛出代码都在一个地方
