Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_two.po
Languages: es, fr, ja, zh_cn

source: ``animation_ended`` is the function that will be called by :ref:`AnimationPlayer <class_AnimationPlayer>` when it's done playing an animation.
es: ``animation_ended`` es la función que será llamada por :ref:`AnimationPlayer <class_AnimationPlayer>` cuando termine de reproducir una animación.
fr: ``animation_ended`` est la fonction qui sera appelée par :ref:`AnimationPlayer <class_AnimationPlayer>` quand la lecture d'une animation est terminée.
ja: ``animation_ended`` は、アニメーションの再生が終了したときに :ref:`AnimationPlayer <class_AnimationPlayer>` によって呼び出される関数です。
zh_cn: ``animation_ended``是一个函数，它将被调用 :ref:`AnimationPlayer <class_AnimationPlayer>` 当它完成播放动画时。

source: For certain animation states, we may need to transition into another state when it's finished. To handle this, we check for every possible animation state. If we need to, we will transition into another state.
es: Para ciertos estados de animación, puede que necesitemos hacer la transición a otro estado cuando haya terminado. Para manejar esto, comprobamos todos los estados de animación posibles. Si es necesario, haremos la transición a otro estado.
fr: Pour certains états d'animation, il se peut que nous ayons besoin de passer à un autre état quand il sera terminé. Pour cela, nous vérifions chaque état d'animation possible. S'il le faut, nous ferons la transition vers un autre État.
ja: 特定のアニメーションの状態については、終了時に別の状態に移行する必要がある場合があります。これを処理するために、可能なすべてのアニメーション状態をチェックします。必要に応じて、別の状態に移行します。

source: If you are using your own animated models, make sure that none of the animations are set to loop. Looping animations do not send the ``animation_finished`` signal when they reach the end of the animation and are about to loop again.
es: Si estás usando tus propios modelos animados, asegúrate de que ninguna de las animaciones esté configurada para hacer un bucle. Las animaciones en bucle no envían la señal de ``animation_finished`` cuando llegan al final de la animación y están a punto de repetirse en bucle.
fr: Si vous utilisez vos propres modèles animés, assurez-vous qu'aucune des animations n'est réglée sur boucle. Les animations en boucle n'envoient pas le signal ``animation_finished`` lorsqu'elles arrivent à la fin de l'animation et sont sur le point de boucler à nouveau.
ja: 独自のアニメーションモデルを使用している場合は、アニメーションがループするように設定されていないことを確認してください。アニメーションのループは、アニメーションの最後に到達して再びループしようとしているときに、\ ``animation_finished`` シグナルを送信しません。
zh_cn: 如果您使用自己的动画模型，请确保没有动画设置为循环。 循环动画在到达动画结束时不会发送 ``animation_finished`` 信号，并且即将再循环。

source: The transitions in ``animation_ended`` would ideally be part of the data in ``states``, but in an effort to make the tutorial easier to understand, we'll hard code each state transition in ``animation_ended``.
es: Las transiciones en ``animation_ended`` idealmente serían parte de los datos de los ``states``, pero en un esfuerzo por hacer el tutorial más fácil de entender, codificaremos cada transición de estado en ``animation_ended``.
fr: Les transitions dans ``animation_ended`` feraient idéalement partie des données dans ``states``, mais dans un effort pour rendre le tutoriel plus facile à comprendre, nous allons coder chaque transition d'état dans ``animation_ended```.
ja: ``animation_ended`` の遷移は理想的には ``states`` のデータの一部になりますが、チュートリアルを理解しやすくするために、各状態遷移を ``animation_ended`` でハードコーディングします。

source: Finally, there is ``animation_callback``. This function will be called by a call method track in our animations. If we have a :ref:`FuncRef <class_FuncRef>` assigned to ``callback_function``, then we call that passed in function. If we do not have a :ref:`FuncRef <class_FuncRef>` assigned to ``callback_function``, we print out a warning to the console.
es: Finalmente, está la ``animation_callback``. Esta función será llamada por un método de llamada de pistas en nuestras animaciones. Si tenemos un :ref:`FuncRef <class_FuncRef>` asignado a ``callback_function``, entonces llamamos a esa función pasada. Si no tenemos un :ref:`FuncRef <class_FuncRef>` asignado a ``callback_function``, imprimimos una advertencia a la consola.
fr: Enfin, il y a le ``animation_callback``. Cette fonction sera appelée par une piste de méthode d'appel dans nos animations. Si nous avons un :ref:`FuncRef <class_FuncRef>` assigné à ``callback_function``, alors nous appelons cela passé en fonction. Si nous n'avons pas de :ref:`FuncRef <class_FuncRef>` assigné à ``callback_function``, nous imprimons un avertissement sur la console.
ja: 最後に、\ ``animation_callback`` があります。この関数は、アニメーションの呼び出しメソッドトラックによって呼び出されます。\ ``callback_function`` に割り当てられた :ref:`FuncRef <class_FuncRef>` がある場合、関数で渡されたものを呼び出します。\ ``callback_function`` に割り当てられた :ref:`FuncRef <class_FuncRef>` がない場合、コンソールに警告を出力します。

source: Try running ``Testing_Area.tscn`` to make sure there are no runtime issues. If the game runs but nothing seems to have changed, then everything is working correctly.
es: Intenta ejecutar ``Testing_Area.tscn`` para asegurarte de que no hay problemas de tiempo de ejecución. Si el juego funciona pero nada parece haber cambiado, entonces todo funciona correctamente.
fr: Essayez d'exécuter ``Testing_Area.tscn`` pour vous assurer qu'il n'y a pas de problème d'exécution. Si le jeu fonctionne mais que rien ne semble avoir changé, alors tout fonctionne correctement.
ja: ``Testing_Area.tscn`` を実行して、実行時の問題がないことを確認してください。ゲームが実行されているが、何も変わっていないように見える場合は、すべてが正常に動作しています。
zh_cn: 尝试运行 ``Testing_Area.tscn`` 以确保没有运行时问题。 如果游戏运行但似乎没有任何改变，那么一切都正常。

source: Getting the animations ready
es: Preparando las animaciones
fr: Préparation des animations
ja: アニメーションを準備する
zh_cn: 准备好动画

source: Now that we have a working animation manager, we need to call it from our player script. Before that, though, we need to set some animation callback tracks in our firing animations.
es: Ahora que tenemos un gerente de animación trabajando, necesitamos llamarlo desde nuestro script de jugador. Antes de eso, sin embargo, tenemos que establecer algunas pistas de llamada de animación en nuestras animaciones de disparo.
fr: Maintenant que nous avons un gestionnaire d'animation fonctionnel, nous devons l'appeler à partir de notre script joueur. Avant cela, cependant, nous avons besoin de définir quelques pistes de rappel d'animation dans nos animations de tir.
ja: アニメーションマネージャーが機能するようになったので、それをプレイヤースクリプトから呼び出す必要があります。ただし、その前に、発砲アニメーションにアニメーションコールバックトラックを設定する必要があります。

source: Open up ``Player.tscn`` if you don't have it open and navigate to the :ref:`AnimationPlayer <class_AnimationPlayer>` node (``Player`` -> ``Rotation_Helper`` -> ``Model`` -> ``Animation_Player``).
es: Abre ``Player.tscn`` si no lo tienes abierto y navega al nodo :ref:`AnimationPlayer <class_AnimationPlayer>` (``Player`` -> ``Rotation_Helper`` -> ``Model`` -> ``Animation_Player``).
fr: Ouvrez ``Player.tscn`` si vous ne l'avez pas ouvert et naviguez jusqu'au nœud :ref:`AnimationPlayer <class_AnimationPlayer>` (``Player`` -> ``Rotation_Helper`` -> ``Model`` -> ``Animation_Player``).
ja: まだ開いていない場合は ``Player.tscn`` を開き、\ :ref:`AnimationPlayer <class_AnimationPlayer>` ノードに移動します(``Player`` -> ``Rotation_Helper`` -> ``Model`` -> ``Animation_Player``)。
zh_cn: 打开 ``Player.tscn`` 如果您没有打开并导航到 :ref:`AnimationPlayer <class_AnimationPlayer>` node(``Player`` ->` `Rotation_Helper`` ->` `Model` ` ->` `Animation_Player``)。

source: We need to attach a call method track to three of our animations: The firing animation for the pistol, rifle, and knife. Let's start with the pistol. Click the animation drop down list and select "Pistol_fire".
es: Necesitamos adjuntar un método de llamada de seguimiento a tres de nuestras animaciones: La animación de disparo de la pistola, el rifle y el cuchillo. Empecemos con la pistola. Haz clic en la lista desplegable de la animación y selecciona "Pistol_fire".
fr: Nous avons besoin d'attacher une piste de méthode d'appel à trois de nos animations : L'animation de tir pour le pistolet, le fusil et le couteau. Commençons par le pistolet. Cliquez sur la liste déroulante de l'animation et sélectionnez "Pistol_fire".
ja: 3つのアニメーションにメソッド呼出しトラックをアタッチする必要があります: ピストル、ライフル、ナイフの発射アニメーションです。まずピストルから始めましょう。アニメーションドロップダウンリストをクリックし、"Pistol_fire"を選択します。

source: Now scroll down to the bottom of the list of animation tracks. The final item in the list should read ``Armature/Skeleton:Left_UpperPointer``. Now above the list, click the "Add track" button, to the left of the time line
es: Ahora desplácese hacia abajo hasta la parte inferior de la lista de pistas de animación. El último ítem de la lista debe decir ``Armature/Skeleton:Left_UpperPointer``. Ahora, arriba de la lista, haz clic en el botón "Add track", a la izquierda de la línea de tiempo
fr: Faites maintenant défiler vers le bas de la liste des pistes d'animation. Le dernier élément de la liste devrait s'appeler ``Armature/Skeleton:Left_UpperPointer``. Maintenant au-dessus de la liste, cliquez sur le bouton "Add track", à gauche de la ligne de temps
ja: アニメーショントラックのリストの一番下までスクロールします。リストの最後の項目は ``Armature/Skeleton:Left_UpperPointer`` である必要があります。リストの上で、タイムラインの左側にある[トラックを追加]ボタンをクリックします

source: This will bring up a window with a few choices. We want to add a call method track, so click the option that reads "Call Method Track". This will open a window showing the entire node tree. Navigate to the :ref:`AnimationPlayer <class_AnimationPlayer>` node, select it, and press OK.
es: Esto abrirá una ventana con algunas opciones. Queremos añadir un método de llamada, así que haz clic en la opción que dice "Call Method Track". Esto abrirá una ventana que muestra el árbol de nodos completo. Navega al nodo :ref:`AnimationPlayer <class_AnimationPlayer>`, selecciónalo y pulsa OK.
fr: Ceci ouvrira une fenêtre avec quelques choix. Nous voulons ajouter une piste de méthode d'appel, alors cliquez sur l'option qui s'appelle "Call Method Track". Cela ouvrira une fenêtre montrant l'arborescence de nœud en entier. Naviguez jusqu'au nœud :ref:`AnimationPlayer <class_AnimationPlayer>`, sélectionnez-le et appuyez sur OK.
ja: これにより、いくつかの選択肢があるウィンドウが表示されます。メソッド呼出しトラックを追加するため、「メソッド呼出しトラック」というオプションをクリックします。これにより、ノードツリー全体を表示するウィンドウが開きます。\ :ref:`AnimationPlayer <class_AnimationPlayer>` ノードに移動して選択し、[OK]を押します。

source: Now at the bottom of list of animation tracks you will have a green track that reads "AnimationPlayer". Now we need to add the point where we want to call our callback function. Scrub the timeline until you reach the point where the muzzle starts to flash.
es: Ahora en la parte inferior de la lista de pistas de animación tendrás una pista verde que dice "AnimationPlayer". Ahora tenemos que añadir el punto donde queremos llamar a nuestra función de devolución de llamada. Limpia la línea de tiempo hasta que llegues al punto en que el pico empiece a parpadear.
fr: Maintenant au bas de la liste des pistes d'animation, vous aurez une voie verte qui s'appelle "AnimationPlayer". Maintenant, nous devons ajouter le point où nous voulons appeler notre fonction de rappel. Faites défiler la ligne de temps jusqu'à ce que vous atteignez le point où le museau de l'arme commence à clignoter.
ja: これで、アニメーショントラックのリストの下部に、"AnimationPlayer"いう緑色のトラックが表示されます。次に、コールバック関数を呼び出すポイントを追加する必要があります。銃口が点滅し始めるポイントに達するまで、タイムラインをスクラブ(訳注:左右にごしごしするというニュアンスです)します。
zh_cn: 现在位于动画轨道列表的底部，您将看到一个绿色轨道，其中显示“AnimationPlayer”。 现在我们需要添加我们想要调用回调函数的点。 擦洗时间线，直到到达枪口开始闪烁的点。

source: The timeline is the window where all the points in our animation are stored. Each of the little points represents a point of animation data.
es: La línea de tiempo es la ventana donde se almacenan todos los puntos de nuestra animación. Cada uno de los pequeños puntos representa un punto de datos de animación.
fr: La ligne de temps est la fenêtre dans laquelle tous les points de notre animation sont stockés. Chacun des petits points représente un point de données d'animation.
ja: タイムラインは、アニメーションのすべてのポイントが保存されるウィンドウです。小さなポイントのそれぞれは、アニメーションデータのポイントを表します。

source: To actually preview the "Pistol_fire" animation, select the :ref:`Camera <class_Camera>` node underneath Rotation Helper and check the "Preview" box underneath Perspective in the top-left corner.
es: Para ver la animación "Pistol_fire", selecciona el nodo debajo del Ayudante de Rotación :ref:`Camera <class_Camera>` y marca la casilla "Preview" debajo de "Perspective" en la esquina superior izquierda.
fr: Pour prévisualiser l'animation "Pistol_fire", sélectionnez le nœud :ref:`Camera <class_Camera>` sous "Rotation Helper" et cochez la case "Previsualiser" sous "Perspective" dans le coin supérieur gauche.

source: Scrubbing the timeline means moving ourselves through the animation. So when we say "scrub the timeline until you reach a point", what we mean is move through the animation window until you reach the point on the timeline.
es: Dezplazando la línea de tiempo significa moverse a través de la animación. Así que cuando decimos "desplaza la línea de tiempo hasta llegar a un punto", lo que queremos decir es moverse a través de la ventana de animación hasta llegar al punto de la línea de tiempo.
fr: Faire défiler la ligne de temps signifie se déplacer à travers l'animation. Ainsi, lorsque nous disons "Faites défiler la ligne de temps jusqu'à ce que vous atteigniez un point", ce que nous voulons dire c'est se déplacer dans la fenêtre d'animation jusqu'à ce que vous atteigniez le point sur la ligne de temps.
ja: タイムラインをスクラブするということは、アニメーションの中で自分自身を動かすことを意味します。したがって、「ポイントに到達するまでタイムラインをスクラブする」と言うときは、タイムライン上のポイントに到達するまでアニメーションウィンドウを移動します。
zh_cn: 擦洗时间轴意味着让我们自己完成动画。 因此，当我们说“擦洗时间线直到达到某个点”时，我们的意思是在动画窗口中移动，直到到达时间轴上的点。

source: Also, the muzzle of a gun is the end point where the bullet comes out. The muzzle flash is the flash of light that escapes the muzzle when a bullet is fired. The muzzle is also sometimes referred to as the barrel of the gun.
es: Además, la boca del arma es el punto final por donde sale la bala. El destello de la boca es el destello de luz que escapa de la boca cuando se dispara una bala. La boca del cañón también se conoce como el cañón del arma.
fr: En outre, le museau d'une arme à feu est le point final où la balle sort. Le flash du museau est le flash de lumière qui s'échappe du museau lorsqu'une balle est tirée. Le museau est aussi parfois appelé le canon de l'arme à feu.
ja: また、銃の銃口は弾丸が出る端点です。銃口のフラッシュは、弾丸が発射されたときに銃口から漏れる光のフラッシュです。銃口は、銃身とも呼ばれます。
zh_cn: 而且，枪口是枪弹出来的终点。 枪口闪光是当子弹射击时逃离枪口的闪光。 枪口有时也被称为枪管。

source: For finer control when scrubbing the timeline, press :kbd:`Ctrl` and scroll forward with the mouse wheel to zoom in. Scrolling backwards will zoom out.
es: Para tener un control más fino al desplazar la línea de tiempo, presione :kbd:`Ctrl` y desplácese hacia adelante con la rueda del ratón para hacer zoom. Si se desplaza hacia atrás, se alejará el zoom.
fr: Pour un contrôle plus précis lors du défilement de la ligne de temps, appuyez sur :kbd:`Ctrl` et faites défiler vers l'avant avec la molette de la souris pour effectuer un zoom avant. Le défilement vers l'arrière permet d'effectuer un zoom arrière.
ja: タイムラインをスクラブするとき、より細かく制御するには、\ :kbd:`Ctrl` を押しながら、マウスホイールで前方にスクロールしてズームインします。後方にスクロールするとズームアウトします。

source: You can also change how the timeline scrubbing snaps by changing the value in ``Step (s)`` to a lower/higher value.
es: También puedes cambiar la forma en que se ajusta el scrubbing de la línea de tiempo cambiando el valor en ``Paso(s)`` a un valor más bajo/alto.
fr: Vous pouvez également changer la façon dont le défilement de la ligne de temps s'effectue en changeant la valeur dans ``Step(s)`` à une valeur inférieure/supérieure.
ja: ``Step(s)`` の値をより低い/より高い値に変更することで、タイムラインのスクラブのスナップ方法を変更することもできます。
zh_cn: 您还可以通过将``Step(s)```中的值更改为更低/更高的值来更改时间线清理捕捉的方式。

source: Once you get to a point you like, right click on the row for "Animation Player" and press ``Insert Key``. In the empty name field, enter ``animation_callback`` and press :kbd:`Enter`.
es: Una vez que llegues a un punto que te guste, haz clic con el botón derecho del ratón en la fila de "Reproductor de animación" y pulsa ``Insert Key``. En el campo de nombre vacío, ingresa ``animation_callback`` y presiona :kbd:`Enter`.
fr: Une fois que vous arrivez à un point que vous aimez, cliquez avec le bouton droit de la souris sur la ligne pour "Animation Player" et appuyez sur l' ``Insert Key``. Dans le champ de nom vide, entrez ``animation_callback`` et appuyez sur :kbd:`Enter`.
ja: 好きなポイントに到達したら、\ ``Animation Player`` の行を右クリックし、[キーを挿入]を押します。空の名前フィールドに\ ``animation_callback`` と入力し、\ :kbd:`Enter` を押します。

source: Now when we are playing this animation the call method track will be triggered at that specific point of the animation.
es: Ahora, cuando estamos reproduciendo esta animación, la pista del método de llamada se disparará en ese punto específico de la animación.
fr: Maintenant, lorsque nous jouons cette animation, la piste de la méthode d'appel sera déclenchée à ce point spécifique de l'animation.
ja: このアニメーションを再生しているとき、メソッド呼出しトラックはアニメーションの特定のポイントでトリガーされます。

source: Let's repeat the process for the rifle and knife firing animations!
es: ¡Repitamos el proceso para las animaciones de disparo de rifles y cuchillos!
fr: Répétons le processus pour les animations de tir au fusil et au couteau !
ja: ライフルとナイフの発射アニメーションでこのプロセスを繰り返しましょう！
zh_cn: 让我们重复步枪和刀射击动画的过程！

source: Because the process is exactly the same as the pistol, the process is going to explained in a little less depth. Follow the steps from above if you get lost! It is exactly the same, just on a different animation.
es: Debido a que el proceso es exactamente el mismo que el de la pistola, el proceso se va a explicar con un poco menos de profundidad. ¡Sigue los pasos desde arriba si te pierdes! Es exactamente lo mismo, sólo que en una animación diferente.
fr: Parce que le processus est exactement le même que le pistolet, le processus va être expliqué un peu moins en profondeur. Suivez les étapes d'au-dessus si vous vous perdez ! C'est exactement la même chose, juste sur une animation différente.
ja: このプロセスはピストルとまったく同じですが、もう少し詳しく説明します。迷った場合は、上記の手順に従ってください！別のアニメーションに対して行うだけで、内容はまったく同じです。
zh_cn: 因为这个过程与手枪完全相同，所以这个过程的解释会稍微深入一点。 如果您迷路，请按照上面的步骤！ 它完全相同，只是在不同的动画上。

source: Go to the "Rifle_fire" animation from the animation drop down. Add the call method track once you reach the bottom of the animation track list by clicking the "Add Track" button above the list. Find the point where the muzzle starts to flash and right click and press ``Insert Key`` to add a call method track point at that position on the track.
es: Ve a la animación "Rifle_fire" desde el desplegable de animación. Añade la pista del método de llamada una vez que llegues a la parte inferior de la lista de pistas de la animación haciendo clic en el botón "Add Track" que está encima de la lista. Encuentra el punto donde la boca del cañón comienza a parpadear y haz clic con el botón derecho del ratón y presiona ``Insert Key`` para agregar un punto de pista del método de llamada en esa posición de la pista.
fr: Allez dans l'animation "Rifle_fire" à partir du menu déroulant de l'animation. Ajoutez la piste de la méthode d'appel une fois que vous atteignez le bas de la liste des pistes d'animation en cliquant sur le bouton "Add Track" au-dessus de la liste. Trouvez le point où le museau de l'arme commence à clignoter et faites un clic droit et appuyez sur ``Insert Key`` pour ajouter un point de piste de la méthode d'appel à cet endroit sur la piste.
ja: アニメーションドロップダウンから"Rifle_fire"アニメーションに移動します。リストの上にある[トラックを追加]ボタンをクリックして、アニメーショントラックリストの一番下に到達したら、メソッド呼出しトラックを追加します。銃口が点滅し始めるポイントを見つけて右クリックし、\ ``キーを挿入`` を押して、トラック上のその位置にメソッド呼出しトラックポイントを追加します。

source: Type "animation_callback" into the name field of the pop up which opened and press :kbd:`Enter`.
es: Escriba "animation_callback" en el campo del nombre del pop up que se abrió y presione :kbd:`Enter`.
fr: Tapez "animation_callback" dans le champ du nom de la fenêtre pop up qui s'est ouverte et appuyez sur :kbd:`Enter`.
ja: 開いたポップアップの名前フィールドに”animation_callback”と入力し、\ :kbd:`Enter` を押します。

source: Now we need to apply the callback method track to the knife animation. Select the "Knife_fire" animation and scroll to the bottom of the animation tracks. Click the "Add Track" button above the list and add a method track. Next find a point around the first third of the animation to place the animation callback method point at.
es: Ahora tenemos que aplicar el método de devolución de llamada a la animación del cuchillo. Selecciona la animación "Knife_fire" y desplázate hasta la parte inferior de las pistas de animación. Haz clic en el botón "Add Track" que está encima de la lista y añade una pista de método. A continuación, busca un punto alrededor del primer tercio de la animación para colocar el punto del método de devolución de llamada de la animación.
fr: Nous devons maintenant appliquer la piste de la méthode callback à l'animation du couteau. Sélectionnez l'animation "Knife_fire" et faites défiler jusqu'en bas des pistes d'animation. Cliquez sur le bouton "Add Track" au-dessus de la liste et ajoutez une piste de méthode. Trouvez ensuite un point autour du premier tiers de l'animation pour placer le point de la méthode de rappel de l'animation.
ja: 次に、メソッド呼出しトラックをナイフアニメーションに適用する必要があります。"Knife_fire" アニメーションを選択し、アニメーショントラックの下部までスクロールします。リストの上にある[トラックを追加]ボタンをクリックして、メソッドトラックを追加します。次に、アニメーションコールバックメソッドポイントを配置するアニメーションの最初の3分の1あたりのポイントを見つけます。

source: We will not actually be firing the knife, and the animation is a stabbing animation rather than a firing one. For this tutorial we are reusing the gun firing logic for our knife, so the animation has been named in a style that is consistent with the other animations.
es: No dispararemos el cuchillo, y la animación es una animación de apuñalamiento más que de disparo. En este tutorial estamos reutilizando la lógica de disparo del arma para nuestro cuchillo, por lo que la animación ha sido nombrada en un estilo que es consistente con las otras animaciones.
fr: Nous n'allons pas vraiment tirer au couteau, et l'animation est une animation poignardante plutôt qu'une animation de tir. Pour ce tutoriel, nous réutilisons la logique de tir au fusil pour notre couteau, donc l'animation a été nommée dans un style qui est cohérent avec les autres animations.
ja: 実際にナイフを発射することはありません。アニメーションは、発射するというよりも刺すようなアニメーションです。このチュートリアルでは、銃の発射ロジックをナイフで再利用するため、アニメーションは他のアニメーションと一貫したスタイルで名前が付けられています。
zh_cn: 我们实际上不会开枪，动画是一个刺伤动画而不是射击动画。 在本教程中，我们重复使用枪械射击逻辑，因此动画的命名风格与其他动画一致。

source: From there right click on the timeline and click "Insert Key". Put "animation_callback" into the name field and press :kbd:`Enter`.
es: A partir de ahí, haz clic con el botón derecho del ratón en la línea de tiempo y haz clic en "Insert Key". Ponga "animation_callback" en el campo de nombre y presione :kbd:`Enter`.
fr: De là, cliquez avec le bouton droit de la souris sur la ligne de temps et cliquez sur "Insert Key". Mettez "animation_callback" dans le champ de nom et appuyez sur :kbd:`Enter`.
ja: そこからタイムラインを右クリックし、[キーを挿入]をクリックします。"animation_callback"を名前フィールドに入力し、\ :kbd:`Enter` を押します。

source: Be sure to save your work!
es: ¡Asegúrate de guardar tu trabajo!
fr: Assurez-vous de sauvegarder votre travail !
ja: 必ず作業内容を保存してください！
zh_cn: 一定要保存您的工作！

source: With that done, we are almost ready to start adding the ability to fire to our player script! We need to set up one last scene: The scene for our bullet object.
es: Con esto hecho, estamos casi listos para empezar a añadir la habilidad de disparar a nuestro script de jugador! Necesitamos preparar una última escena: La escena para nuestro objeto bala.
fr: Cela fait, nous sommes presque prêts à ajouter la possibilité de tirer à notre script de joueur ! On doit monter une dernière scène : La scène de l'objet balle.
ja: これで、プレイヤースクリプトに発砲する機能を追加する準備がほぼ整いました。最後のシーンを設定する必要があります。それは、弾丸オブジェクトのシーンです。
