Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_three.po
Languages: es, fr, ja, zh_cn

source: ``CAN_REFILL``: A boolean to track whether we can refill this weapon's spare ammo. We will not be using ``CAN_REFILL`` in this part, but we will in the next part!
es: ``CAN_REFILL``: Una booleana para saber si podemos rellenar la munición de repuesto de esta arma. ¡No usaremos "CAN_REFILL" en esta parte, pero lo haremos en la siguiente!
fr: "CAN_REFILL" : Un booléen pour savoir si oui ou non nous pouvons recharger l'arme avec des munitions de l'inventaire. Nous n'utiliserons pas "CAN_REFILL" dans cette partie, mais nous le ferons dans la prochaine partie !
ja: ``CAN_REFILL``: この武器の予備弾薬を補充できるかどうかを追跡するブール値。 このパートでは ``CAN_REFILL`` を使用しませんが、次のパートでは使用します！
zh_cn: ``CAN_REFILL``:一个布尔值,用于跟踪我们是否可以重新填充此武器的备用弹药. 我们不会在这部分使用 ``CAN_REFILL`` ,但我们将在下一部分中使用！

source: ``RELOADING_ANIM_NAME``: The name of the reloading animation for this weapon.
es: ``RELOADING_ANIM_NAME``: El nombre de la animación de recarga para esta arma.
fr: "RELOADING_ANIM_NAME" : Le nom de l'animation de chargement pour cette arme.
ja: ``RELOADING_ANIM_NAME``: この武器のリロードアニメーションの名前。
zh_cn: ``RELOADING_ANIM_NAME``:此武器的重新加载动画的名称.

source: Now we need to add a function for handling reloading. Add the following function to ``Weapon_Pistol.gd``:
es: Ahora necesitamos añadir una función para manejar la recarga. Añade la siguiente función a ``Weapon_Pistol.gd``:
fr: Maintenant nous devons ajouter une fonction pour gérer le rechargement de l'arme. Ajoutez la fonction suivante à "Weapon_Pistol.gd" :
ja: 次に、リロードを処理するための関数を追加する必要があります。 次の関数を ``Weapon_Pistol.gd`` に追加します:
zh_cn: 现在我们需要添加一个处理重载的函数. 将以下函数添加到``Weapon_Pistol.gd``:

source: First we define a variable to see whether or not this weapon can reload.
es: Primero definimos una variable para ver si esta arma puede recargarse o no.
fr: Premièrement nous définissons une variable pour voir si on peut recharger notre arme ou non.
ja: 最初に変数を定義して、この武器がリロードできるかどうかを確認します。
zh_cn: 首先,我们定义一个变量,以查看此武器是否可以重新加载.

source: Then we check to see if the player is in this weapon's idle animation state because we only want to be able to reload when the player is not firing, equipping, or unequipping.
es: Luego comprobamos si el jugador está en el estado de animación en inactividad de esta arma porque sólo queremos poder recargar cuando el jugador no este disparando, equipando o desarmando.
fr: Puis nous vérifions si l'arme du joueur est dans "idle" animation car on ne veut pouvoir recharger que si le joueur ne tire pas, ne l'équipe pas et ne la déséquipe pas.
ja: 次に、プレイヤーがこの武器のアイドルアニメーション状態にあるかどうかを確認します。これは、プレイヤーが発砲、装備、または装備解除していないときにのみリロードできるようにするためです。
zh_cn: 然后我们检查游戏角色是否处于这个武器的空闲动画状态,因为我们只希望能够在游戏角色没有开火,装备或无装备时重新加载.

source: Next we check to see if the player has spare ammo, and if the ammo already in the weapon is equal to a fully reloaded weapon. This way we can ensure the player cannot reload when the player has no ammo or when the weapon is already full of ammo.
es: A continuación comprobamos si el jugador tiene munición de repuesto, y si la munición que ya está en el arma es igual a un arma completamente recargada. De esta manera podemos asegurarnos de que el jugador no puede recargar cuando no tiene municiones o cuando el arma ya está llena de municiones.
fr: Ensuite nous vérifions si le joueur a assez de munitions dans l'inventaire, et si les munitions présente dans l'arme sont égales à l'arme rechargée au maximum. De cette façon nous nous assurons que le joueur ne peut pas recharger si il n'a plus de munitions ou si il est déjà au maximum.
ja: 次に、プレイヤーに予備の弾薬があるかどうか、そしてすでに武器にある弾薬が完全にリロードされた武器に等しいかどうかを確認します。 このようにして、プレイヤーに弾薬がない場合、または武器がすでに弾薬でいっぱいになっている場合に、プレイヤーがリロードできないようにすることができます。
zh_cn: 接下来我们检查一下玩家是否有备用弹药,以及武器中已有的弹药是否等于满载的武器.这样我们就可以保证在玩家没有弹药或者武器已经装满弹药的情况下,不能重新装填.

source: If we can still reload, then we calculate the amount of ammo needed to reload the weapon.
es: Si todavía podemos recargar, entonces calculamos la cantidad de munición necesaria para recargar el arma.
fr: Si nous pouvons encore recharger, alors nous calculons la quantité de munitions nécessaire pour recharger l'arme.
ja: もしもリロードできる場合は、武器のリロードに必要な弾薬の量を計算します。
zh_cn: 如果还能重装,那么我们就计算一下重装武器所需要的弹药数量.

source: If the player has enough ammo to fill the weapon, we remove the ammo needed from ``spare_ammo`` and then set ``ammo_in_weapon`` to a full weapon/magazine.
es: Si el jugador tiene suficiente munición para llenar el arma, quitamos la munición necesaria de ``spare_ammo`` y luego ponemos ``ammo_in_weapon`` al maximo del arma/cargador.
fr: Si le joueur a assez de munitions pour remplir l'arme, nous enlevons les munitions nécessaires de ``spare_ammo`` et ensuite nous réglons ``ammo_in_weapon`` sur un chargeur d'arme complet.
ja: プレイヤーが武器を満たすのに十分な弾薬を持っている場合、必要な弾薬を ``spare_ammo`` から削除し、\ ``ammo_in_weapon`` を完全な武器/弾倉に設定します。
zh_cn: 如果游戏角色有足够的弹药来填充武器,我们从 ``spare_ammo`` 中移除所需的弹药,然后将 ``ammo_in_weapon`` 设置为武器/弹仓的满载值.

source: If the player does not have enough ammo, we add all the ammo left in ``spare_ammo``, and then set ``spare_ammo`` to ``0``.
es: Si el jugador no tiene suficiente munición, añadimos toda la munición que queda en ``spare_ammo``, y luego ponemos ``spare_ammo`` en ``0``.
fr: Si le joueur n'a pas assez de munitions, nous ajoutons toutes les munitions restantes dans ``spare_ammo``, puis réglons ``spare_ammo`` sur ``0``.
ja: プレイヤーに十分な弾薬がない場合は、\ ``spare_ammo`` に残っているすべての弾薬を追加し、\ ``spare_ammo`` を ``0`` に設定します。
zh_cn: 如果玩家没有足够的弹药,我们就把 ``spare_ammo`` 中剩余的弹药全部加进去,然后把 ``spare_ammo`` 设为 ``0`` .

source: Next we play the reloading animation for this weapon, and then return ``true``.
es: A continuación reproducimos la animación de recarga de esta arma, y luego devolvemos ``true``.
fr: Ensuite nous jouons l'animation de rechargement pour cette arme et nous retournons ``true``.
ja: 次に、この武器のリロードアニメーションを再生し、\ ``true`` を返します。
zh_cn: 接下来我们播放这个武器的重新加载动画,然后返回 ``true`` .

source: If the player could not reload, we return ``false``.
es: Si el jugador no puede recargar, devolvemos el ``false``.
fr: Si le joueur ne peut pas recharger, nous retournons ``false``.
ja: プレイヤーがリロードできなかった場合は、\ ``false`` を返します。
zh_cn: 如果游戏角色无法重新加载,我们会返回"false".

source: Now we need to add reloading to the rifle. Open up ``Weapon_Rifle.gd`` and add the following class variables:
es: Ahora tenemos que añadir recarga al rifle. Abre ``Weapon_Rifle.gd`` y añade las siguientes variables de clase:
fr: Maintenant nous avons besoin d'ajouter le rechargement du fusil. Ouvrez ``Weapon_Rifle.gd`` et ajouter les variables de classe suivantes :
ja: 次に、ライフルにリロードを追加する必要があります。\ ``Weapon_Rifle.gd`` を開き、次のクラス変数を追加します:
zh_cn: 现在我们需要为步枪添加重装. 打开 ``Weapon_Rifle.gd`` 并添加以下类变量:

source: These variables are exactly the same as the pistol, just with ``RELOADING_ANIM_NAME`` changed to the rifle's reloading animation.
es: Estas variables son exactamente las mismas que las de la pistola, sólo que con ``RELOADING_ANIM_NAME`` cambiado a la animación de recarga del rifle.
fr: Ces variables sont exactement les mêmes que celles du pistolet, seul ``RELOADING_ANIM_NAME`` change pour l'animation de rechargement du fusil.
ja: これらの変数はピストルとまったく同じですが、 ``RELOADING_ANIM_NAME`` がライフルのリロードアニメーションに変更されているだけです。
zh_cn: 这些变量与手枪完全相同,只是将"RELOADING_ANIM_NAME"改为步枪的重装动画.

source: Now we need to add ``reload_weapon`` to ``Weapon_Rifle.gd``:
es: Ahora tenemos que añadir ``reload_weapon`` a ``Weapon_Rifle.gd``:
fr: Maintenant nous avons besoin d'ajouter ``reload_weapon`` à ``Weapon_Riffle.gd`` :
ja: 次に、\ ``reload_weapon`` を ``Weapon_Rifle.gd`` に追加する必要があります:
zh_cn: 现在我们需要将 ``reload_weapon`` 添加到``Weapon_Rifle.gd``:

source: This code is exactly the same as the one for the pistol.
es: Este código es exactamente el mismo que el de la pistola.
fr: Ce code est exactement le même que celui pour le pistolet.
ja: このコードは、ピストルのコードとまったく同じです。
zh_cn: 这个代码和手枪的代码完全一样.

source: The last bit we need to do for the weapons is add 'reloading' to the knife. Add the following class variables to ``Weapon_Knife.gd``:
es: Lo último que tenemos que hacer con las armas es añadir 'reloading' al cuchillo. Añade las siguientes variables de clase a ``Weapon_Knife.gd``:
fr: Le dernier morceau que nous devons faire pour les armes est d'ajouter le 'rechargement' du couteau. Ajoutez les variables de classe suivantes à ``Weapon_Knife.gd`` :
ja: 武器のために必要な最後の部分は、ナイフに「リロード」を追加することです。 次のクラス変数を ``Weapon_Knife.gd`` に追加します:
zh_cn: 我们需要为武器做的最后一点是向刀子添加"重装". 将以下类变量添加到``Weapon_Knife.gd``:

source: Since we both cannot reload or refill a knife, we set both constants to ``false``. We also define ``RELOADING_ANIM_NAME`` as an empty string, since the knife has no reloading animation.
es: Ya que ambos no podemos recargar o rellenar un cuchillo, fijamos ambas constantes en ``false``. También definimos "RELOADING_ANIM_NAME" como una string vacía, ya que el cuchillo no tiene animación de recarga.
fr: Comme nous ne pouvons recharger ou remplir un couteau, nous mettons à ``false`` les deux constantes. On définit aussi ``RELOADING_ANIM_NAME`` comme une chaîne vide, vu que le couteau n'a pas d'animation de rechargement.
ja: 私たちはナイフをリロードも補充もできないため、両方の定数を ``false`` に設定します。 また、ナイフにはリロードアニメーションがないため、\ ``RELOADING_ANIM_NAME`` を空の文字列として定義します。
zh_cn: 由于我们都无法重新加载或重新填充刀,我们将两个常量都设置为"false". 我们还将 ``RELOADING_ANIM_NAME`` 定义为空字符串,因为该刀没有重新加载动画.

source: Now we need to add ``reloading_weapon``:
es: Ahora necesitamos añadir ``reloading_weapon``:
fr: Maintenant nous devons ajouter ``reloading_weapon`` :
ja: 次に ``reloading_weapon`` を追加する必要があります:
zh_cn: 现在我们需要添加``reloading_weapon``:

source: Since we cannot reload a knife, we always return ``false``.
es: Ya que no podemos recargar un cuchillo, siempre regresamos ``false``.
fr: Comme nous ne pouvons pas recharger un couteau, nous retournons toujours ``false``.
ja: ナイフをリロードすることはできないので、常に ``false`` を返します。
zh_cn: 由于我们无法重装刀,我们总是返回 ``false`` .

source: Adding reloading to the player
es: Añadiendo la recarga al jugador
fr: Ajout du rechargement au joueur
ja: プレイヤーにリロードを追加する
zh_cn: 添加重新加载到游戏角色

source: Now we need to add a few things to ``Player.gd``. First we need to define a new class variable:
es: Ahora necesitamos añadir algunas cosas a ``Player.gd``. Primero necesitamos definir una nueva variable de clase:
fr: Maintenant nous devons ajouter quelques choses à ``Player.gd``. D'abord nous devons définir une nouvelle variable de classe :
ja: ここで、\ ``Player.gd`` にいくつかの項目を追加する必要があります。 まず、新しいクラス変数を定義する必要があります:
zh_cn: 现在我们需要在 ``Player.gd`` 中添加一些内容. 首先,我们需要定义一个新的类变量:

source: ``reloading_weapon``: A variable to track whether or not the player is currently trying to reload.
es: ``reloading_weapon``: Una variable para rastrear si el jugador está tratando de recargar el arma o no.
fr: ``reloading_weapon`` : Une variable pour traquer si le joueur essaie de recharger ou non.
ja: ``reloading_weapon``: プレイヤーが現在リロードを試みているかどうかを追跡する変数。
zh_cn: ``reloading_weapon``:一个变量,用于跟踪游戏角色当前是否正在尝试重新加载.

source: Next we need to add another function call to ``_physics_process``.
es: A continuación, tenemos que añadir otra llamada a la función ``_physics_process``.
fr: Ensuite nous devons ajouter un nouvel appel de fonction à ``_physics_process``.
ja: 次に、別の関数呼び出しを ``_physics_process`` に追加する必要があります。
zh_cn: 接下来我们需要为 ``_physics_process`` 添加另一个函数调用.

source: Add ``process_reloading(delta)`` to ``_physics_process``. Now ``_physics_process`` should look something like this:
es: Añade ``process_reloading(delta)`` a ``_physics_process``. Ahora ``_physics_process`` debería verse algo como esto:
fr: Ajoutez ``process_reloading(delta)`` à ``_physics_process``. Maintenant ``_physics_process`` devrait ressembler à ça :
ja: ``process_reloading(delta)`` を ``_physics_process`` に追加します。\ ``_physics_process`` は次のようになります:
zh_cn: 将 ``process_reloading(delta)`` 添加到 ``_physics_process`` . 现在 ``_physics_process`` 应该是这样的:

source: Now we need to add ``process_reloading``. Add the following function to ``Player.gd``:
es: Ahora tenemos que añadir ``process_reloading``. Añade la siguiente función a ``Player.gd``:
fr: Maintenant nous devons ajouter ``process_reloading``. Ajoutez la fonction suivante à ``Player.gd`` :
ja: ここで ``process_reloading`` を追加する必要があります。次の関数を ``Player.gd`` に追加します:
zh_cn: 现在我们需要添加 ``process_reloading`` . 将以下函数添加到``Player.gd``:

source: Let's go over what's happening here.
es: Repasemos lo que está pasando aquí.
fr: Voyons ce qui s'y passe.
ja: ここで何が起こっているのか見ていきましょう。
zh_cn: 让我们回顾一下这里发生的事情.

source: Firstly, we check to make sure the player is trying to reload.
es: Primero, comprobamos que el jugador no está tratando de recargar.
fr: D'abord, on s'assure que le joueur essaie de recharger.
ja: まず、プレイヤーがリロードを試みていることを確認します。
zh_cn: 首先,我们检查一下玩家是否在尝试重装.

source: If the player is trying to reload, we then get the current weapon. If the current weapon does not equal ``null``, we call its ``reload_weapon`` function.
es: Si el jugador está tratando de recargar, entonces obtenemos el arma actual. Si el arma actual no es igual a ``null``, llamamos a su función de ``reload_weapon``.
fr: Si le joueur essaie de recharger, on récupère ensuite l'arme actuelle. Si l'arme actuelle n'est pas à égale à ``null``, on appelle sa fonction ``reload_weapon``.
ja: プレイヤーがリロードしようとしている場合、現在の武器を取得します。現在の武器が ``null`` ではない場合、その ``reload_weapon`` 関数を呼び出します。
zh_cn: 如果游戏角色正在尝试重新加载,我们将获得当前的武器. 如果当前武器不等于 ``null`` ,我们称之为 ``reload_weapon`` 函数.

source: If the current weapon is equal to ``null``, then the current weapon is ``UNARMED``.
es: Si el arma actual es igual a ``null``, entonces el arma actual está ``UNARMED``.
fr: Si l'arme actuelle est égale à ``null``, alors l'arme actuelle est ``UNARMED``.
ja: 現在の武器が ``null`` の場合、現在の武器は ``UNARMED`` です。
zh_cn: 如果当前武器等于"null",则当前武器为"UNARMED".

source: Finally, we set ``reloading_weapon`` to ``false`` because, regardless of whether the player successfully reloaded, we've tried reloading and no longer need to keep trying.
es: Finalmente, colocamos ``reloading_weapon`` a ``false`` porque, independientemente de si el jugador recargó con éxito, hemos intentado recargar y ya no necesitamos seguir intentándolo.
fr: Enfin, nous définissons ``reloading_weapon`` à ``false`` car, sans tenir compte du fait que le joueur aie correctement rechargé, nous avons essayé de recharger et nous n'avons plus besoin de continuer d'essayer.
ja: 最後に、プレイヤーが正常にリロードされたかどうかに関係なく、リロードを試み、もう試みる必要がないため、\ ``reloading_weapon`` を ``false`` に設定します。
zh_cn: 最后,我们把 ``reloading_weapon`` 设置为 ``false`` ,因为无论玩家是否成功重装,都已经尝试过重装,不再需要继续尝试.

source: Before we can let the player reload, we need to change a few things in ``process_input``.
es: Antes de que podamos dejar que el jugador se recargue, necesitamos cambiar algunas cosas en ``process_input``.
fr: Avant que l'on puisse laisser le joueur recharger, nous devons changer quelques choses dans ``process_input``.
ja: プレイヤーがリロードできるようにする前に、\ ``process_input`` のいくつかの項目を変更する必要があります。
zh_cn: 在我们让游戏角色重新加载之前,我们需要在 ``process_input`` 中更改一些内容.

source: The first thing we need to change is in the code for changing weapons. We need to add an additional check (``if reloading_weapon == false:``) to see if the player is reloading:
es: Lo primero que tenemos que cambiar es el código para cambiar las armas. Necesitamos agregar un chequeo adicional (``if reloading_weapon == false:``) para ver si el jugador está recargando:
fr: La première chose que nous devons modifier est dans le code pour changer d'armes. Nous avons besoin d'ajouter un autre test (``if reloading_weapon == false:``) pour voir si le joueur est en train de recharger :
ja: 最初に変更する必要があるのは、武器を変更するためのコードです。プレイヤーがリロードしているかどうかを確認するために、追加のチェック(``if reloading_weapon == false:``) を追加する必要があります:
zh_cn: 我们首先需要修改的是更换武器的代码.需要增加一个额外的检查( ``if reloading_weapon == false:`` )来查看玩家是否在重装:

source: This makes it so the player cannot change weapons if the player is reloading.
es: Esto hace que el jugador no pueda cambiar de armas si está recargando.
fr: Cela permet d'empêcher le joueur de changer d'arme lorsqu'il recharge.
ja: これにより、プレイヤーのリロード中に、プレイヤーは武器を変更できなくなります。
zh_cn: 这使得如果游戏角色重新加载,游戏角色无法改变武器.

source: Now we need to add the code to trigger a reload when the player pushes the ``reload`` action. Add the following code to ``process_input``:
es: Ahora tenemos que añadir el código para activar una recarga cuando el jugador presione la acción de ``reload``. Añade el siguiente código a ``process_input``:
fr: Maintenant nous devons ajouter le code pour déclencher un rechargement lorsque le joueur appuie sur le bouton d'action ``reload``. Ajoutez le code suivant à ``process_input`` :
ja: ここで、プレイヤーが ``reload`` アクションをプッシュしたときにリロードをトリガーするコードを追加する必要があります。次のコードを ``process_input`` に追加します:
zh_cn: 现在我们需要添加代码以在游戏角色按下"reload"动作时触发重新加载. 将以下代码添加到``process_input``:

source: First we make sure the player is not reloading already, nor is the player trying to change weapons.
es: Primero nos aseguramos de que el jugador no esté recargando ya, ni esté tratando de cambiar de armas.
fr: D'abord on s'assure que le joueur n'est pas déjà en train de recharger, ou que le joueur essaie de changer d'arme.
ja: まず、プレイヤーが既にリロードしていないこと、またプレイヤーが武器を変更しようとしていないことを確認します。
zh_cn: 首先,我们确保游戏角色没有重新加载,游戏角色也不会尝试更换武器.

source: Then we check to see if the ``reload`` action has been pressed.
es: Luego comprobamos si la acción de ``reload`` ha sido presionada.
fr: Ensuite on vérifie si l'action ``reload`` à été pressée.
ja: 次に、\ ``reload`` アクションが押されたかどうかを確認します。
zh_cn: 然后我们检查是否按下了 ``reload`` 动作.

source: If the player has pressed ``reload``, we then get the current weapon and check to make sure it is not ``null``. Then we check to see whether the weapon can reload or not using its ``CAN_RELOAD`` constant.
es: Si el jugador ha presionado ``reload``$, entonces obtenemos el arma actual y revisamos para asegurarnos de que no es ``null``. Luego comprobamos si el arma puede recargarse o no usando su constante ``CAN_RELOAD``.
fr: Si le joueur a appuyé sur ``reload``, on regarde quel est l'arme courante et on vérifie qu'elle n'est pas ``null``. Ensuite on utilise la constante ``CAN_RELOAD`` de l'arme pour savoir si celle-ci peut recharger ou non.
ja: プレイヤーが ``reload`` を押した場合、現在の武器を取得し、それが ``null`` でないことを確認します。次に、\ ``CAN_RELOAD`` 定数を使用して、武器がリロードできるかどうかを確認します。
zh_cn: 如果玩家按了 ``reload`` ,我们就会得到当前的武器,并检查它是否是 ``null`` .然后使用常量 ``CAN_RELOAD`` 检查武器是否可以重装.

source: If the weapon can reload, we then get the current animation state, and make a variable for tracking whether the player is already reloading or not.
es: Si el arma puede recargarse, entonces obtenemos el estado actual de la animación, y hacemos una variable para rastrear si el jugador ya está recargando o no.
fr: Si l'arme peut être rechargée, on récupère alors l'état d'animation courant, et faisons une variable pour traquer si le joueur est déjà en train de recharger ou pas.
ja: 武器がリロードできる場合、現在のアニメーション状態を取得し、プレイヤーがすでにリロードしているかどうかを追跡するための変数を作成します。
zh_cn: 如果武器可以重新加载,我们将获得当前动画状态,并创建一个变量来跟踪游戏角色是否已经重新加载.

source: We then go through every weapon to make sure the player is not already playing that weapon's reloading animation.
es: Luego revisamos cada arma para asegurarnos de que el jugador no esté ya jugando la animación de recarga de esa arma.
fr: On fait ensuite le tour de chaque arme pour s'assurer que le joueur n'est pas déjà en train de jouer l'animation de recharge de l'arme.
ja: 次に、すべての武器を調べて、プレイヤーがその武器のリロードアニメーションをまだプレイしていないことを確認します。
zh_cn: 然后我们通过每一件武器来确保游戏角色还没有玩过那个武器的重装动画.

source: If the player is not reloading any weapon, we set ``reloading_weapon`` to ``true``.
es: Si el jugador no está recargando ningúna arma, ponemos ``reloading_weapon`` a ``true``.
fr: Si le joueur n'est pas en train de recharger une arme, nous assignons ``reloading_weapon`` à ``true``.
ja: プレイヤーが武器をリロードしていない場合、\ ``reloading_weapon`` を ``true`` に設定します。
zh_cn: 如果玩家没有重新装填任何武器,我们将 ``reloading_weapon`` 设置为 ``true`` .

source: One thing I like to add is where the weapon will reload itself if you try to fire it and it's out of ammo.
es: Una cosa que me gusta añadir es que el arma se recargará sola si intentas dispararla y se queda sin munición.
fr: Une chose que j'aime ajouter est le rechargement automatique de l'arme lorsque l'on essaye de tirer alors qu'elle est déchargée.
ja: 私が追加したいことの1つは、発射しようとしたときに弾薬がなくなった場合に武器がリロードされる場所です。
zh_cn: 我想补充的一件事是,如果您试图发射武器并且没有弹药,那么武器会自动重装.

source: We also need to add an additional if check (``is_reloading_weapon == false:``) so the player cannot fire the current weapon while reloading.
es: También necesitamos agregar una condición adicional de "if" (``is_reloading_weapon == false:``) para que el jugador no pueda disparar el arma actual mientras la recarga.
fr: On a besoin d'ajouter une nouvelle condition (``is_reloading_weapon == false:``) pour que le joueur ne puisse pas tirer avec son arme actuelle lorsqu'il recharge.
ja: また、プレイヤーがリロード中に現在の武器を発砲できないように、ifチェック(``is_reloading_weapon == false:``)を追加する必要があります。
zh_cn: 我们还需要增加一个额外的if检查( ``is_reloading_weapon == false:`` ),这样玩家在重装时当前的武器就不能发射.

source: Let's change our firing code in ``process_input`` so it reloads when trying to fire an empty weapon:
es: Cambiemos nuestro código de disparo en ``process_input`` para que se recargue al intentar disparar un arma vacía:
fr: Transformons notre code de tir en ``process_input`` afin que l'arme se recharge quand on essaye de tirer sans munitions dans le chargeur :
ja: 空の武器を発射しようとするとリロードされるように、\ ``process_input`` の発射コードを変更しましょう:
zh_cn: 让我们在 ``process_input`` 中更改我们的触发代码,以便在尝试触发空武器时重新加载:

source: Now we check to make sure the player is not reloading before we fire the weapon, and when we have ``0`` or less ammo in the current weapon, we set ``reloading_weapon`` to ``true`` if the player tries to fire.
es: Ahora verificamos que el jugador no esté recargando antes de disparar el arma, y cuando tengamos ``0`` o menos munición en el arma actual, ponemos ``reloading_weapon`` a ``true`` si el jugador intenta disparar.
fr: Maintenant, nous allons nous assurer que le joueur n'est pas en train de recharger au moment de tirer. Lorsque nous avons ``0`` munitions ou moins dans l'arme actuelle, nous assignons ``true`` à la variable ``reloading_weapon`` si le joueur essaye de tirer.
ja: 次に、武器を発射する前にプレイヤーがリロードしていないことを確認し、現在の武器に ``0`` 以下の弾薬がある場合、プレイヤーが ``reloading_weapon`` を ``true`` に設定します発射しようとします。
zh_cn: 现在我们在发射武器之前,先检查一下玩家是否有重新装填弹药,当前武器中的弹药为 ``0`` 或更少时,如果玩家试图发射,就将 ``reloading_weapon`` 设置为 ``true`` .

source: This will make it so the player will try to reload when attempting to fire an empty weapon.
es: Esto hará que el jugador intente recargar cuando intente disparar un arma vacía.
fr: De cette manière, le joueur va recharger lorsqu'il tentera de tirer avec une arme vide.
ja: これにより、プレイヤーは空の武器を発射しようとするときにリロードを試みます。
zh_cn: 这将使玩家在试图发射空武器时,会尝试重新装填.

source: With that done, the player can now reload! Give it a try! Now you can fire all the spare ammo for each weapon.
es: Con eso hecho, ¡el jugador puede ahora recargar! ¡Inténtalo! Ahora puedes disparar toda la munición de sobra para cada arma.
fr: Ceci fait, le joueur peut maintenant recharger ! Essayez ! Maintenant, vous pouvez tirer toutes les munitions de rechange de l'arme.
ja: これが完了すると、プレイヤーはリロードできます！試してみましょう！これで、各武器の予備弾薬をすべて発射できます。
zh_cn: 做好了这些,玩家现在就可以重装了!试试吧!现在你可以把每把武器的备用弹药全部发射出去.

source: Adding sounds
es: Añadiendo sonidos
fr: Ajouter des sons
ja: 音を追加する
zh_cn: 添加声音

source: Finally, let's add some sounds that accompany the player firing, reloading and changing weapons.
es: Por último, añadamos algunos sonidos que acompañan al jugador disparando, recargando y cambiando armas.
fr: Enfin, ajoutons quelques sons qui vont accompagner le rechargement, le tir et le changement d'arme.
ja: 最後に、武器の発射、リロード、交換に伴うサウンドを追加しましょう。
zh_cn: 最后,让我们添加一些伴随玩家射击、重装和更换武器的声音.
