Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_four.po
Languages: es, fr, ja, zh_cn

source: If you want to use the triggers for firing, you will need to change how firing works in ``process_input``. You need to get the axis values for the triggers, and check if it's over a certain value, say ``0.8`` for example. If it is, you add the same code as when the ``fire`` action was pressed.
es: Si quieres usar los disparadores para disparar, tendrás que cambiar cómo funciona el disparo en ``process_input``. Necesitas obtener los valores de los ejes para los disparadores, y comprobar si está por encima de un cierto valor, digamos ``0.8`` por ejemplo. Si es así, agregas el mismo código que cuando se presionó la acción ``fire``.
fr: Si vous souhaitez utiliser les déclencheurs pour tirer, vous aurez besoin de changer le fonctionnement du tir dans ``process_input``. Vous devez récupérer la valeur des axes pour les déclencheurs et vérifier si ceux-ci sont au-dessus d'une certaine valeur telle que ``0.8``par exemple. Si c'est le cas, ajoutez le même code que quand la touche ``fire``a été actionnée.
ja: トリガーを使って発砲したい場合は、\ ``process_input`` で発砲方法を変更する必要があります。トリガーの軸の値を取得し、それが特定の値(例えば ``0.8``)を超えているかどうかをチェックする必要があります。もしそうなら、\ ``fire`` アクションが押された時と同じコードを追加します。
zh_cn: 如果您想使用触发器进行触发，您需要在 ``process_input`` 中改变触发的工作方式。 您需要获取触发器的轴值，并检查它是否超过某个值，例如“0.8”。 如果是，则添加与按下 ``fire`` 动作时相同的代码。

source: Adding mouse scroll wheel input
es: Añadir la entrada de la rueda de desplazamiento del ratón
fr: Ajouter une entrée pour la molette de la souris
ja: マウススクロールホイール入力の追加
zh_cn: 添加鼠标滚轮输入

source: Let's add one more input related feature before we start working on the pickups and the target. Let's add the ability to change weapons using the scroll wheel on the mouse.
es: Añadamos otra característica relacionada con la entrada antes de empezar a trabajar en las recogidas y el objetivo. Añadamos la posibilidad de cambiar de arma con la rueda de desplazamiento del ratón.
fr: Ajoutons une dernière fonctionnalité liée eux touches avant de commencer à travailler sur les bonus et les cibles. Ajoutons la possibilité de changer d'arme en utilisant la molette de la souris.
ja: ピックアップとターゲットの作業を開始する前に、もう1つの入力関連処理を追加しましょう。 マウスのスクロールホイールを使用して武器を変更する機能を追加しましょう。

source: Open up ``Player.gd`` and add the following class variables:
es: Abre ``Player.gd`` y añade las siguientes variables de clase:
fr: Ouvrez ``Player.gd`` et ajouter les variables de classe suivantes :
ja: ``Player.gd`` を開き、以下のクラス変数を追加してください:
zh_cn: 打开 ``Player.gd`` 并添加以下类变量:

source: Let's go over what each of these new variables will be doing:
es: Repasemos lo que hará cada una de estas nuevas variables:
fr: Passons en revue l'utilité de chaque variable :
ja: これらの新しい変数のそれぞれが何をしているのかを見てみましょう:
zh_cn: 让我们回顾一下这些新变量将要做的事情:

source: ``mouse_scroll_value``: The value of the mouse scroll wheel.
es: ``mouse_scroll_value``: El valor de la rueda de desplazamiento del ratón.
fr: ``mouse_scroll_value`` : La valeur de la molette de la souris.
ja: ``mouse_scroll_value``: マウスのスクロールホイールの値。
zh_cn: ``mouse_scroll_value``:鼠标滚轮的值。

source: ``MOUSE_SENSITIVITY_SCROLL_WHEEL``: How much a single scroll action increases mouse_scroll_value
es: ``MOUSE_SENSITIVITY_SCROLL_WHEEL``: Cuánto aumenta el valor de mouse_scroll_value con una sola acción de scroll
fr: ``MOUSE_SENSITIVITY_SCROLL_WHEEL`` : De combien une seule action de défilement augmente ``mouse_scroll_value``
ja: ``MOUSE_SENSITIVITY_SCROLL_WHEEL``: 単一のスクロールアクションがmouse_scroll_valueをどれだけ増加させるか。
zh_cn: ``MOUSE_SENSITIVITY_SCROLL_WHEEL``:单个滚动操作增加了多少mouse_scroll_value

source: Now let's add the following to ``_input``:
es: Ahora agreguemos lo siguiente a ``_input``:
fr: Maintenant, ajoutons ce qui suit à ``_input`` :
ja: では、次を ``_input`` に追加しましょう:
zh_cn: 现在让我们将以下内容添加到 ``_input`` 中:

source: Let's go over what's happening here:
es: Repasemos lo que está pasando aquí:
fr: Voyons ce qui se passe ici :
ja: ここで何が起こっているのかを見てみましょう:
zh_cn: 让我们回顾一下这里发生的事情:

source: Firstly, we check if the event is an ``InputEventMouseButton`` event and that the mouse mode is ``MOUSE_MODE_CAPTURED``. Then, we check to see if the button index is either a ``BUTTON_WHEEL_UP`` or ``BUTTON_WHEEL_DOWN`` index.
es: En primer lugar, comprobamos si el evento es un evento ``InputEventMouseButton`` y que el modo del ratón es ``MOUSE_MODE_CAPTURED``. Luego, comprobamos si el índice del botón es un índice ``BUTTON_WHEEL_UP`` o ``BUTTON_WHEEL_DOWN``.
fr: Tout d'abord, nous devons vérifier si l'événement est un événement de type ``InputEventMouseButton`` et si le mode de la souris est ``MOUSE_MODE_CAPTURED``. Ensuite, nous vérifions que l'index du bouton est soit ``BUTTON_WHEEL_UP``, soit ``BUTTON_WHEEL_DOWN``.
ja: まず、イベントが ``InputEventMouseButton`` イベントであり、マウスモードが ``MOUSE_MODE_CAPTURED`` であるかどうかを確認します。 次に、ボタンのインデックスが ``BUTTON_WHEEL_UP`` インデックスなのか ``BUTTON_WHEEL_DOWN``インデックスなのかを確認します。

source: If the event's index is indeed a button wheel index, we then check to see if it is a ``BUTTON_WHEEL_UP`` or ``BUTTON_WHEEL_DOWN`` index. Based on whether it is up or down, we add or subtract ``MOUSE_SENSITIVITY_SCROLL_WHEEL`` to/from ``mouse_scroll_value``.
es: Si el índice del evento es de hecho un índice de rueda de botones, entonces comprobamos si es un índice de ``BUTTON_WHEEL_UP`` o ``BUTTON_WHEEL_DOWN``. Basándonos en si está arriba o abajo, sumamos o restamos ``MOUSE_SENSITIVITY_SCROLL_WHEEL`` a/desde ``mouse_scroll_value``.
fr: Si l'index de l'événement est bien un index de bouton de la molette, alors nous vérifions qu'il est de type ``BUTTON_WHEEL_UP`` ou ``BUTTON_WHEEL_DOWN``. En fonction de si c'est un déplacement vers le haut ou vers le bas, on ajoute ou soustrait ``MOUSE_SENSITIVITY_SCROLL_WHEEL`` à ``mouse_scroll_value`` ou inversement.
ja: イベントのインデックスが実際にボタンホイールインデックスである場合、それが ``BUTTON_WHEEL_UP`` または ``BUTTON_WHEEL_DOWN`` インデックスであるかどうかを確認します。 アップまたはダウンに基づいて、\ ``mouse_scroll_value`` に ``MOUSE_SENSITIVITY_SCROLL_WHEEL`` を加算または減算します。

source: Next, we clamp mouse scroll value to ensure it is inside the range of selectable weapons.
es: A continuación, fijamos el valor de desplazamiento del ratón para asegurarnos de que está dentro del rango de armas seleccionables.
fr: Nous limitons ensuite les valeurs du défilement de la souris afin de s'assurer qu'il se situe dans la plage des armes sélectionnables.
ja: 次に、マウススクロール値を固定して、選択可能な武器の範囲内に収まるようにします。

source: We then check to see if the player is changing weapons or reloading. If the player is doing neither, we round ``mouse_scroll_value`` and cast it to an ``int``.
es: Luego comprobamos si el jugador está cambiando de armas o recargando. Si el jugador no hace ninguna de las dos cosas, redondeamos el ``mouse_scroll_value`` y lo ponemos en ``int``.
fr: Nous vérifions ensuite si le joueur est en train de changer d'arme ou de recharger. Si celui-ci ne fait ni l'une ni l'autre, on arrondi ``mouse_scroll_value`` et on le transforme en ``int``.
ja: 次に、プレイヤーが武器を変更しているか、リロードしているかを確認します。 プレイヤーがどちらも実行していない場合、\ ``mouse_scroll_value`` を丸めて ``int`` にキャストします。
zh_cn: 然后我们检查游戏角色是在换武器还是重装。 如果游戏角色两者都没做，我们将 ``mouse_scroll_value`` 舍入并将其转换为 ``int`` 。

source: We are casting ``mouse_scroll_value`` to an ``int`` so we can use it as a key in our dictionary. If we left it as a float, we would get an error when we tried to run the project.
es: Estamos asignando ``mouse_scroll_value`` a un ``int`` para poder usarla como clave en nuestro diccionario. Si lo dejamos como un real, obtendríamos un error al intentar ejecutar el proyecto.
fr: Nous convertissons ``mouse_scroll_value`` en ``int`` de façon à pouvoir l'utiliser comme clef dans notre dictionnaire. Si nous le laissons en float, nous aurions une erreur en tentant de lancer le projet.
ja: ``mouse_scroll_value`` を ``int`` にキャストしているので、dictionaryのキーとして使用できます。 floatのままにしておくと、プロジェクトを実行しようとしたときにエラーが発生します。

source: Next, we check to see if the weapon name at ``round_mouse_scroll_value`` is not equal to the current weapon name using ``WEAPON_NUMBER_TO_NAME``. If the weapon is different from the player's current weapon, we assign ``changing_weapon_name``, set ``changing_weapon`` to ``true`` so the player will change weapons in ``process_changing_weapon``, and set ``mouse_scroll_value`` to ``round_mouse_scroll_value``.
es: A continuación, comprobamos si el nombre del arma en ``round_mouse_scroll_value`` no es igual al nombre actual del arma usando ``WEAPON_NUMBER_TO_NAME``. Si el arma es diferente al arma actual del jugador, asignamos ``changing_weapon_name``, ponemos ``changing_weapon`` en ``true`` para que el jugador cambie las armas en ``process_changing_weapon``, y ponemos ``mouse_scroll_value`` a ``round_mouse_scroll_value``.
fr: Nous vérifions ensuite si le nom de l'arme à ``round_mouse_scroll_value`` n'est pas égale au nom courant de l'arme en utilisant ``WEAPON_NUMBER_TO_NAME``. Si l'arme est différence de celle que le joueur utilise, on assigne ``changing_weapon_name``, on attribue ``true`` à ``changing_weapon`` afin que le joueur change d'arme dans ``process_changing_weapon`` et on attribue ``mouse_scroll_value`` à ``round_mouse_scroll_value``.

source: The reason we are setting ``mouse_scroll_value`` to the rounded scroll value is because we do not want the player to keep their mouse scroll wheel just in between values, giving them the ability to switch almost extremely fast. By assigning ``mouse_scroll_value`` to ``round_mouse_scroll_value``, we ensure that each weapon takes exactly the same amount of scrolling to change.
es: La razón por la que estamos ajustando ``mouse_scroll_value`` al valor de desplazamiento redondeado es porque no queremos que el jugador mantenga su rueda de desplazamiento del ratón justo entre los valores, dándole la posibilidad de cambiar casi extremadamente rápido. Al asignar ``mouse_scroll_value`` al ``round_mouse_scroll_value``, nos aseguramos de que cada arma necesite exactamente la misma cantidad de desplazamiento para cambiar.
fr: La raison pour laquelle on règle ``mouse_scroll_value`` à la valeur arrondie du défilement est parce que nous ne voulons pas que le joueur garde sa molette de souris entre deux valeurs, ce qui lui donnerai l'opportunité de changer d'arme extrêmement rapidement. En assignant ``mouse_scroll_value`` à ``round_mouse_scroll_value``, on s'assure que chaque arme a besoin du même montant de défilement que les autre pour en changer.
ja: ``mouse_scroll_value`` を丸められたスクロール値に設定しているのは、プレイヤーがマウススクロールホイールを値のちょうど中間に置いておくのを望まないためです。 ``mouse_scroll_value`` を ``round_mouse_scroll_value`` に割り当てることにより、各武器が正確に同じ量のスクロールを行って変更されるようにします。

source: One more thing we need to change is in ``process_input``. In the code for changing weapons, add the following right after the line ``changing_weapon = true``:
es: Una cosa más que necesitamos cambiar es en ``process_input``. En el código para cambiar las armas, añade lo siguiente justo después de la línea ``changing_weapon = true``:
fr: Nous devons changer une toute dernière chose dans ``process_input``. Dans le code pour changer d'arme, ajoutez ce qui suit juste après la ligne ``changing_weapon = true`` :
ja: 変更する必要があるもう1つは ``process_input``です。 武器を変更するためのコードで、\ ``changing_weapon = true`` 行 の直後に以下を追加します:
zh_cn: 我们需要改变的另一件事是 ``process_input`` 。 在更改武器的代码中，在“changing_weapon = true”行之后添加以下内容:

source: Now the scroll value will be changed with the keyboard input. If we did not change this, the scroll value would be out of sync. If the scroll wheel were out of sync, scrolling forwards or backwards would not transition to the next/last weapon, but rather the next/last weapon the scroll wheel changed to.
es: Ahora el valor de desplazamiento se cambiará con la entrada del teclado. Si no cambiamos esto, el valor de desplazamiento estaría fuera de sincronía. Si la rueda de desplazamiento estuviera desincronizada, el desplazamiento hacia adelante o hacia atrás no pasaría a la siguiente/última arma, sino a la siguiente/última arma a la que cambió la rueda de desplazamiento.
fr: Maintenant, la valeur de défilement va changer avec les entrées du clavier. Si nous ne changions pas ça, la valeur de défilement serait désynchronisée. Si c'était le cas, faire défiler en bas ou en haut ne ferais pas la transition vers la prochaine/dernière arme mais plutôt à la prochaine/dernière arme du défilement à la souris.
ja: これで、キーボード入力でもスクロール値が変更されます。 この変更をしなかった場合、スクロール値が同期しなくなります。 スクロールホイールが同期していない場合、前方または後方へのスクロールは次/最後の武器に移行せず、スクロールホイールで変更された次/最後の武器に移行します。

source: Now you can change weapons using the scroll wheel! Go give it a whirl!
es: ¡Ahora puedes cambiar de armas usando la rueda de desplazamiento! ¡Ve a probarlo!
fr: Vous pouvez maintenant changer d'arme en utilisant la molette de la souris ! Essayez !
ja: スクロールホイールを使用して武器を変更できるようになりました！ それを旋回させてみてください！
zh_cn: 现在您可以使用滚轮更换武器了！ 去试试吧！

source: Adding the health pickups
es: Agregando los items de salud
fr: Ajouter des vies ramassables
ja: 回復アイテムピックアップの追加

source: Now that the player has health and ammo, we ideally need a way to replenish those resources.
es: Ahora que el jugador tiene salud y munición, idealmente necesitamos una forma de reponer esos recursos.
fr: Maintenant que le joueur a de la santé et des munitions, nous voudrions idéalement un moyen de regagner ces ressources.
ja: プレイヤーは体力と弾薬を手に入れたので、理想としてこれらのリソースを補充する方法が必要です。
zh_cn: 既然游戏角色拥有健康和弹药，我们理想情况下需要一种补充这些资源的方法。

source: Open up ``Health_Pickup.tscn``.
es: Abre ``Health_Pickup.tscn``.
fr: Ouvrez ``Health_Pickup.tscn``.
ja: ``Health_Pickup.tscn`` を開きます。
zh_cn: 打开 ``Health_Pickup.tscn`` 。

source: Expand ``Holder`` if it's not already expanded. Notice how we have two Spatial nodes, one called ``Health_Kit`` and another called ``Health_Kit_Small``.
es: Expande el ``Holder`` si no está ya expandido. Fíjate en que tenemos dos nodos espaciales, uno llamado ``Health_Kit`` y otro llamado ``Health_Kit_Small``.
fr: Développez ``Holder`` si ce n'est pas déjà fait. Remarquez le fait que nous avons deux nœuds Spatial. Le premier est appelé ``Health_Kit`` et l'autre ``Health_Kit_Small``.
ja: まだ展開されていない場合は、\ ``Holder`` を展開します。 2つのSpatialノードがあることに注目してください。1つは ``Health_Kit``\ 、もう1つは ``Health_Kit_Small`` と呼ばれます。
zh_cn: 如果尚未展开，请展开 ``Holder`` 。 注意我们如何有两个Spatial节点，一个叫做 ``Health_Kit`` ，另一个称为 ``Health_Kit_Small`` 。

source: This is because we're actually going to be making two sizes of health pickups, one small and one large/normal. ``Health_Kit`` and ``Health_Kit_Small`` only have a single :ref:`MeshInstance <class_MeshInstance>` as their children.
es: Esto es porque en realidad vamos a hacer dos tamaños de recipientes para la salud, uno pequeño y otro grande/normal. ``Health_Kit`` y ``Health_Kit_Small`` sólo tienen un único :ref:`MeshInstance <class_MeshInstance>` como sus hijos.
fr: C'est parce que nous allons en fait faire deux tailles de bonus de santé : une petite et une grande/normale. ``Health_Kit`` et ``Health_Kit_Small`` ont seulement un simple :ref:`MeshInstance <class_MeshInstance>` comme enfant.
ja: これは、実際には2つのサイズの回復アイテムピックアップを作成するためです。\ ``Health_Kit`` および ``Health_Kit_Small`` には、子として単一の :ref:`MeshInstance <class_MeshInstance>` のみがあります。

source: Next expand ``Health_Pickup_Trigger``. This is an :ref:`Area <class_Area>` node we're going to use to check if the player has walked close enough to pick up the health kit. If you expand it, you'll find two collision shapes, one for each size. We will be using a different collision shape size based on the size of the health pickup, so the smaller health pickup has a trigger collision shape closer to its size.
es: A continuación, amplia ``Health_Pickup_Trigger``. Este es un nodo :ref:`Area <class_Area>` que vamos a usar para comprobar si el jugador ha caminado lo suficientemente cerca para recoger el kit de salud. Si lo expandes, encontrarás dos formas de colisión, una para cada tamaño. Usaremos un tamaño diferente de forma de colisión basado en el tamaño del recipiente de salud, así que el recipiente de salud más pequeña tiene una forma de colisión de disparo más cercana a su tamaño.
fr: Développez ensuite ``Health_Pickup_Trigger``. Il s'agit d'un nœud :ref:`Area <class_Area>` que nous allons utiliser pour vérifier si le joueur a marché suffisamment près pour récupérer le kit de santé. Si vous le développez, vous trouverez deux collision shapes, une pour chaque taille. Nous utiliserons une taille de collision shape différente en fonction de la taille du bonus de santé, de sorte que le plus petit kit de santé a une collision shape plus proche de sa taille.
ja: 次に、\ ``Health_Pickup_Trigger`` を展開します。 これは :ref:`Area <class_Area>` ノードであり、プレイヤーが回復キットを拾うのに十分な距離を歩いたかどうかを確認するために使用します。 展開すると、サイズごとに1つずつ、2つのコリジョンシェイプが見つかります。回復アイテムピックアップのサイズに応じて異なるコリジョンシェイプサイズを使用するので、小さい回復アイテムピックアップの方が、そのサイズに近いトリガーコリジョンシェイプを持っています。

source: The last thing to note is how we have an :ref:`AnimationPlayer <class_AnimationPlayer>` node so the health kit bobs and spins around slowly.
es: Lo primero que notamos es que tenemos un nodo :ref:`AnimationPlayer <class_AnimationPlayer>` para que el kit de salud se mueva y rote lentamente.
fr: La dernière chose à noter est la façon dont nous avons un nœud :ref:`AnimationPlayer <class_AnimationPlayer>` de sorte que la trousse de soin ballote et tourne lentement.
ja: 最後に注意することは、\ :ref:`AnimationPlayer <class_AnimationPlayer>` ノードを使用して、回復キットがゆっくりと動き回るようにすることです。

source: Select ``Health_Pickup`` and add a new script called ``Health_Pickup.gd``. Add the following:
es: Selecciona ``Health_Pickup`` y añade un nuevo script llamado ``Health_Pickup.gd``. Añade lo siguiente:
fr: Sélectionnez ``Health_Pickup`` et ajoutez un nouveau script appelé ``Health_Pickup.gd``. Ajoutez ce qui suit :
ja: ``Health_Pickup`` を選択し、\ ``Health_Pickup.gd`` という新しいスクリプトを追加します。 次のように追加します:
zh_cn: 选择 ``Health_Pickup`` 并添加一个名为 ``Health_Pickup.gd`` 的新脚本。 添加以下内容:

source: Let's go over what this script is doing, starting with its class variables:
es: Vamos a repasar lo que está haciendo este script, empezando por sus variables de clase:
fr: Passons en revue ce que fait ce script, en commençant par ses variables de classe :
ja: このスクリプトの実行内容をクラス変数から見ていきましょう:
zh_cn: 让我们回顾一下这个脚本正在做什么，从它的类变量开始:

source: ``kit_size``: The size of the health pickup. Notice how we're using a ``setget`` function to tell if it's changed.
es: ``kit_size``: El tamaño del recipiente de salud. Fíjate en cómo usamos la función ``setget`` para saber si ha cambiado.
fr: ``kit_size`` : La taille du bonus de santé. Remarquez comment nous utilisons une fonction ``setget`` pour savoir s'il a changé.
ja: ``kit_size``: 回復アイテムピックアップのサイズ。\ ``setget`` 関数を使用して、変更されたかどうかを確認していることに注目してください。

source: ``HEALTH_AMMOUNTS``: The amount of health each pickup in each size contains.
es: ``HEALTH_AMMOUNTS``: La cantidad de salud que contiene cada recipiente de cada tamaño.
fr: ``HEALTH_AMMOUNTS`` : Le montant de santé de donne chaque kit par rapport à leur taille.
ja: ``HEALTH_AMMOUNTS``: 各サイズの各ピックアップに含まれる回復量。

source: ``RESPAWN_TIME``: The amount of time, in seconds, it takes for the health pickup to respawn
es: ``RESPAWN_TIME``: La cantidad de tiempo, en segundos, que le toma al recipiente de salud reaparecer
fr: ``RESPAWN_TIME`` : La durée, en seconde, qu'il faut pour que le bonus réapparaisse
ja: ``RESPAWN_TIME``:回復アイテムピックアップが再産出するのにかかる時間(秒単位)

source: ``respawn_timer``: A variable used to track how long the health pickup has been waiting to respawn.
es: ``respawn_timer``: Una variable usada para rastrear cuánto tiempo ha estado el recipiente de salud esperando para reaparecer.
fr: ``respawn_timer`` : Une variable utilisé pour suivre le temps qu'a mis le bonus de santé pour réapparaître.
ja: ``respawn_timer``回復アイテムピックアップが再産出を待機している時間を追跡するために使用される変数。

source: ``is_ready``: A variable to track whether the ``_ready`` function has been called or not.
es: ``is_ready``: Una variable para rastrear si la función ``_ready`` ha sido llamada o no.
fr: ``is_ready`` : Une variable pour suivre si la fonction ``_ready`` a été appelée ou non.
ja: ``is_ready``: ``_ready`` 関数が呼び出されたかどうかを追跡する変数。
zh_cn: ``is_ready``:一个变量，用于跟踪是否已调用 ``_ready`` 函数。

source: We're using ``is_ready`` because ``setget`` functions are called before ``_ready``; we need to ignore the first kit_size_change call, because we cannot access child nodes until ``_ready`` is called. If we did not ignore the first ``setget`` call, we would get several errors in the debugger.
es: Estamos usando ``is_ready`` porque las funciones ``setget`` son llamadas antes de ``_ready``; necesitamos ignorar la primera llamada de cambio de tamaño de kit, porque no podemos acceder a los nodos hijos hasta que ``_ready`` sea llamado. Si no ignoramos la primera llamada a ``setget``, obtendríamos varios errores en el depurador.
fr: Nous utilisons ``is_ready`` car les fonctions ``setget`` sont appelées avant ``_ready``. Nous devons ignorer le premier appel de kit_size_change car nous ne pouvons pas accéder aux nœuds enfants tant que ``_ready`` n'a pas été appelé. Si nous n'ignorions pas le premier appel ``setget``, nous obtiendrons plusieurs erreurs dans le débogueur.
ja: ``setget`` 関数は ``_ready`` の前に呼び出されるため、\ ``is_ready`` を使用しています。\ ``_ready`` が呼び出されるまで子ノードにアクセスできないため、最初のkit_size_change呼び出しを無視する必要があります。 最初の ``setget`` 呼び出しを無視しないと、デバッガでいくつかのエラーが発生します。

source: Also, notice how we are using an exported variable. This is so we can change the size of the health pickups in the editor. This makes it so we do not have to make two scenes for the two sizes, since we can easily change sizes in the editor using the exported variable.
es: Además, fíjate en cómo estamos usando una variable exportada. Esto es para que podamos cambiar el tamaño de las capturas de salud en el editor. Esto es para que no tengamos que hacer dos escenas para los dos tamaños, ya que podemos cambiar fácilmente los tamaños en el editor usando la variable exportada.
fr: Notez également comment nous utilisons une variable exporté. Nous faisons cela de façon à pouvoir changer la taille des bonus de santé dans l'éditeur. Cela nous permet de ne pas avoir à créer deux scènes pour les deux tailles, étant donné que nous pouvons facilement changer les tailles dans l'éditeur en utilisant la variable exportée.
ja: また、エクスポートされた変数の使用方法にも注目してください。 これは、エディタで回復アイテムピックアップのサイズを変更できるようにするためです。 これにより、エクスポートされた変数を使用してエディタでサイズを簡単に変更できるため、2つのサイズに対して2つのシーンを作成する必要がなくなります。

source: See :ref:`doc_GDScript` and scroll down to the Exports section for a list of export hints you can use.
es: Vea :ref:`doc_GDScript` y desplácese hacia abajo hasta la sección de Exportaciones para ver una lista de sugerencias de exportación que puede usar.
fr: Pour plus de détails, regardez :ref:`doc_GDScript` et descendez à la section Exports pour avoir une liste de tous les indices d'export que vous pouvez utiliser.
ja: :ref:`doc_GDScript` を参照し、使用可能なエクスポートヒントのリストについては、GDScriptエクスポートセクションまでスクロールします。
zh_cn: 请参阅 :ref:`doc_GDScript`并向下滚动到Exports部分，以获取可以使用的导出提示列表。

source: Let's look at ``_ready``:
es: Veamos el ``_ready``:
fr: Regardons maintenant ``_ready`` :
ja: ``_ready`` を見てみましょう:
zh_cn: 让我们来看看``_ready``:

source: Firstly, we connect the ``body_entered`` signal from the ``Health_Pickup_Trigger`` to the ``trigger_body_entered`` function. This makes it so any body that enters the :ref:`Area <class_Area>` triggers the ``trigger_body_entered`` function.
es: En primer lugar, conectamos la señal de ``body_entered`` de la ``Health_Pickup_Trigger`` con la función de ``trigger_body_entered``. Esto hace que cualquier cuerpo que entre en la función :ref:`Area<class_Area>`` de ``trigger_body_entered``.
fr: Premièrement , nous connectons le signal ``body_entered`` provenant de ``Health_Pickup_Trigger`` à la fonction ``trigger_body_entered``. Cela permet que n'importe quel corps qui permettre :ref:`Area <class_Area>` déclenche la fonction ``trigger_body_entered``.
ja: まず、\ ``Health_Pickup_Trigger`` からの ``body_entered`` シグナルを ``trigger_body_entered`` 関数に接続します。 これにより、\ :ref:`Area <class_Area>` に入るボディが ``trigger_body_entered`` 関数をトリガーします。
