Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_two.po
Languages: es, fr, ja, zh_cn

source: ``health``: How much health our player has. In this part of the tutorial we will not be using it.
es: ``health``: Cuánta salud tiene nuestro jugador. En esta parte del tutorial no la usaremos.
fr: ``health`` : Quel quantité vie a notre joueur. Dans cette partie du tutoriel, nous ne l'utiliserons pas.
ja: ``health``: プレイヤーの健康状態。チュートリアルのこの部分では、使用しません。
zh_cn: ``health``:我们的球员有多少健康。 在本教程的这一部分中，我们将不会使用它。

source: ``UI_status_label``: A label to show how much health we have, and how much ammo we have both in our gun and in reserve.
es: ``UI_status_label``: Una etiqueta para mostrar cuánta salud tenemos, y cuánta munición tenemos tanto en nuestra arma como en la reserva.
fr: ``UI_status_label`` : Une étiquette pour montrer combien nous avons de vie et combien de munitions nous avons dans notre fusil et en réserve.
ja: ``UI_status_label``: 私たちがどれだけのhealthを持っているか、そして私たちの銃と予備の両方にどのくらいの弾薬を持っているかを示すラベル。

source: Next we need to add a few things in ``_ready``. Here's the new ``_ready`` function:
es: A continuación necesitamos añadir algunas cosas en ``_ready``. Aquí está la nueva función ``_ready``:
fr: Ensuite, nous devons ajouter quelques choses dans le ``_ready``. Voici le nouveau ``_ready`` de la fonction :
ja: 次に、\ ``_ready`` にいくつかの項目を追加する必要があります。新しい ``_ready`` 関数は次のとおりです:
zh_cn: 接下来我们需要在 ``_ready`` 中添加一些东西。 这是新的 ``_ready`` 函数:

source: Let's go over what's changed.
es: Repasemos lo que ha cambiado.
fr: Voyons ce qui a changé.
ja: 変更点を調べてみましょう。
zh_cn: 让我们回顾一下改变了什么。

source: First we get the :ref:`AnimationPlayer <class_AnimationPlayer>` node and assign it to the ``animation_manager`` variable. Then we set the callback function to a :ref:`FuncRef <class_FuncRef>` that will call the player's ``fire_bullet`` function. Right now we haven't written the ``fire_bullet`` function, but we'll get there soon.
es: Primero obtenemos el nodo :ref:`AnimationPlayer <class_AnimationPlayer>` y lo asignamos a la variable ``animation_manager``. Luego ponemos la función de devolución de llamada en un :ref:`FuncRef <class_FuncRef>` que llamará a la función ``fire_bullet`` del jugador. Por ahora no hemos escrito la función ``fire_bullet``, pero llegaremos pronto.
fr: On obtient d'abord le nœud :ref:`AnimationPlayer <class_AnimationPlayer>` et on l'affecte à la variable ``animation_manager``. Ensuite, nous réglons la fonction de rappel sur :ref:`FuncRef <class_FuncRef>` qui appellera la fonction ``fire_bullet`` du joueur. Pour l'instant, nous n'avons pas encore écrit la fonction ``fire_bullet``, mais nous y arriverons bientôt.
ja: 最初に :ref:`AnimationPlayer <class_AnimationPlayer>` ノードを取得し、それを ``animation_manager`` 変数に割り当てます。次に、コールバック関数を :ref:`FuncRef <class_FuncRef>` に設定し、プレイヤーの ``fire_bullet`` 関数を呼び出します。現時点では ``fire_bullet`` 関数を書いていませんが、すぐにそこへ到着します。
zh_cn: 首先我们得到 :ref:`AnimationPlayer <class_AnimationPlayer>` 节点并将其分配给 ``animation_manager`` 变量。 然后我们将回调函数设置为 :ref:`FuncRef <class_FuncRef>` ，它将调用游戏角色的 ``fire_bullet`` 函数。 现在我们还没有编写 ``fire_bullet`` 函数，但我们很快就会到达那里。

source: Next we get all the weapon nodes and assign them to ``weapons``. This will allow us to access the weapon nodes only with their name (``KNIFE``, ``PISTOL``, or ``RIFLE``).
es: A continuación, obtenemos todos los nodos de armas y los asignamos a ``armas``. Esto nos permitirá acceder a los nodos de armas sólo con su nombre (``KNIFE``, ``PISTOL``, or ``RIFLE``).
fr: Ensuite, nous obtenons tous les nœuds d'armes et nous les assignons à ``weapons``. Cela nous permettra d'accéder aux nœuds d'armes uniquement avec leur nom (``KNIFE``, ``PISTOL``, or ``RIFLE``).
ja: 次に、すべての武器ノードを取得し、それらを ``weapons`` に割り当てます。これにより、名前(``KNIFE``\ 、\ ``PISTOL``\ 、または ``RIFLE``)でのみ武器ノードにアクセスできます。

source: We then get ``Gun_Aim_Point``'s global position so we can rotate the player's weapons to aim at it.
es: Luego obtenemos la posición global de ``Gun_Aim_Point`` para poder rotar las armas del jugador para apuntar.
fr: Nous obtenons alors la position globale de ``Gun_Aim_Point`` pour que nous puissions faire pivoter les armes du joueur pour viser.
ja: 次に ``Gun_Aim_Point`` のグローバルな位置を取得し、プレイヤーの武器を回転させて照準を合わせます。
zh_cn: 然后我们得到 ``Gun_Aim_Point`` 的全球位置，这样我们就可以旋转游戏角色的武器来瞄准它。

source: Then we go through each weapon in ``weapons``.
es: Luego revisamos cada arma en ``weapons``.
fr: Ensuite, nous passons en revue chaque arme dans ``weapons``.
ja: 次に、\ ``weapons`` の各武器を通過します。
zh_cn: 然后我们通过“武器”中的每一件武器。

source: We first get the weapon node. If the weapon node is not ``null``, we then set its ``player_node`` variable to this script (``Player.gd``). Then we have it look at ``gun_aim_point_pos`` using the ``look_at`` function, and then rotate it by ``180`` degrees on the ``Y`` axis.
es: Primero tenemos el nodo de armas. Si el nodo del arma no es ``null``, entonces ponemos su variable ``Player_node`` en este script (``Player.gd``). Luego hacemos que mire a ``gun_aim_point_pos`` usando la función ``look_at``, y luego lo rotamos por ``180`` grados en el eje ``Y``.
fr: On prend d'abord le nœud de l'arme. Si le nœud de l'arme n'est pas ``null``, on met alors sa variable ``player_node``` à ce script (``Player.gd``). Ensuite, nous l'observons à l'aide de la fonction ``look_at``, puis nous la faisons tourner de ``180`` degrés sur l'axe ``Y``.
ja: 最初に武器ノードを取得します。武器ノードが ``null`` でない場合、その ``player_node`` 変数をこのスクリプト(``Player.gd``)に設定します。次に、\ ``look_at`` 関数を使用して ``gun_aim_point_pos`` を調べ、\ ``Y`` 軸上で ``180`` 度回転させます。
zh_cn: 我们首先得到武器节点。 如果武器节点不是“null”，那么我们将它的 ``player_node`` 变量设置为这个脚本(``Player.gd``)。 然后我们使用 ``look_at`` 函数查看 ``gun_aim_point_pos`` ，然后在 ``Y`` 轴上旋转 ``180`` 度。

source: We rotate all of those weapon points by ``180`` degrees on their ``Y`` axis because our camera is pointing backwards. If we did not rotate all of these weapon points by ``180`` degrees, all of the weapons would fire backwards.
es: Giramos todos los puntos de las armas en ``180`` grados sobre su eje ``Y`` porque nuestra cámara está apuntando hacia atrás. Si no rotamos todos estos puntos de armas en ``180`` grados, todas las armas dispararían al revés.
fr: Nous faisons pivoter tous ces points d'arme de ``180`` degrés sur leur axe ``Y`` parce que notre caméra est dirigée vers l'arrière. Si nous ne faisions pas pivoter tous ces points d'arme de ``180`` degrés, toutes les armes tireraient à l'envers.
ja: カメラが後方を向いているため、これらすべての武器ポイントを ``Y`` 軸上で ``180`` 度回転させます。これらのすべての武器ポイントを ``180`` 度回転させなかった場合、すべての武器が後方に発砲します。
zh_cn: 我们将所有这些武器点在它们的“Y”轴上旋转“180”度，因为我们的相机指向后方。 如果我们没有将所有这些武器点旋转“180”度，那么所有武器都会向后射击。

source: Then we set ``current_weapon_name`` and ``changing_weapon_name`` to ``UNARMED``.
es: Luego ponemos ``current_weapon_name`` y ``changing_weapon_name`` en ``UNARMED``.
fr: Ensuite, nous réglons ``current_weapon_name`` et ``changing_weapon_name`` sur ``UNARMED``.
ja: 次に、\ ``current_weapon_name`` と ``changing_weapon_name`` を ``UNARMED`` に設定します。
zh_cn: 然后我们将 ``current_weapon_name`` 和 ``changing_weapon_name`` 设置为 ``UNARMED`` 。

source: Finally, we get the UI :ref:`Label <class_Label>` from our HUD.
es: Finalmente, conseguimos la UI :ref:`Label <class_Label>` de nuestro HUD.
fr: Enfin, nous obtenons le UI :ref:`Label <class_Label>` de notre HUD.
ja: 最後に、HUDからUI :ref:`Label <class_Label>` を取得します。
zh_cn: 最后，我们从我们的HUD获取UI :ref:`Label <class_Label>` 。

source: Let's add a new function call to ``_physics_process`` so we can change weapons. Here's the new code:
es: Añadamos una nueva llamada a la función ``_physics_process`` para poder cambiar de arma. Aquí está el nuevo código:
fr: Ajoutons un nouvel appel de fonction à ``_physics_process`` pour pouvoir changer d'arme. Voici le nouveau code :
ja: 新しい関数呼び出しを ``_physics_process`` に追加して、武器を変更できるようにします。新しいコードは次のとおりです:

source: Now we will call ``process_changing_weapons``.
es: Ahora llamaremos ``process_changing_weapons``.
fr: Maintenant, nous allons appeler ``process_changing_weapons``.
ja: ここで ``process_changing_weapons`` を呼び出します。
zh_cn: 现在我们将调用 ``process_changing_weapons`` 。

source: Now let's add all the player input code for the weapons in ``process_input``. Add the following code:
es: Ahora agreguemos todo el código de entrada del jugador para las armas en ``process input``. Añade el siguiente código:
fr: Ajoutons maintenant tout le code d'entrée joueur pour les armes dans ``process_input``. Ajouter le code suivant :
ja: それでは、\ ``process_input`` に武器のすべてのプレイヤー入力コードを追加してみましょう。次のコードを追加します:

source: Let's go over the additions, starting with how we're changing weapons.
es: Repasemos lo agregado, comenzando sobre cómo cambiamos las armas.
fr: Passons en revue les ajouts, en commençant par la façon dont nous changeons les armes.
ja: 武器を変更する方法から始めて、追加について見ていきましょう。

source: First we get the current weapon's number and assign it to ``weapon_change_number``.
es: Primero obtenemos el número del arma actual y lo asignamos al ``weapon_change_number``.
fr: On obtient d'abord le numéro de l'arme courante et on l'assigne à ``weapon_change_number``.
ja: まず、現在の武器の番号を取得し、それを ``weapon_change_number`` に割り当てます。
zh_cn: 首先，我们得到当前武器的数字并将其分配给 ``weapon_change_number`` 。

source: Then we check to see if any of the number keys (keys 1-4) are pressed. If they are, we set ``weapon_change_number`` to the value mapped at that key.
es: Luego comprobamos si alguna de las teclas numéricas (teclas 1-4) está pulsada. Si lo están, ponemos "weapon_change_number" al valor asignado a esa tecla.
fr: Ensuite, nous vérifions si l'une des touches numériques (touches 1 à 4) est activée. Si c'est le cas, nous réglons ``weapon_change_number`` sur la valeur mappée à cette clé.
ja: 次に、数字キー(キー1〜4)のいずれかが押されているかどうかを確認します。もしそうであれば、\ ``weapon_change_number`` をそのキーにマッピングされた値に設定します。
zh_cn: 然后我们检查是否按下了任何数字键(键1-4)。 如果是，我们将 ``weapon_change_number`` 设置为该键映射的值。

source: The reason key 1 is mapped to ``0`` is because the first element in a list is mapped to zero, not one. Most list/array accessors in most programming languages start at ``0`` instead of ``1``. See https://en.wikipedia.org/wiki/Zero-based_numbering for more information.
es: La razón por la que la clave 1 está asignada a ``0`` es porque el primer elemento de la lista está asignado a cero, no a uno. La mayoría de los accesos a las listas/arrays en la mayoría de los lenguajes de programación empiezan en ``0`` en lugar de ``1``. Ver https://en.wikipedia.org/wiki/Zero-based_numbering para más información.
fr: La raison pour laquelle la clé 1 est mappée à ``0`` est que le premier élément d'une liste est mappé à zéro, pas à un. La plupart des accesseurs de listes/tableaux dans la plupart des langages de programmation commencent à ``0`` au lieu de ``1``. Voir https://en.wikipedia.org/wiki/Zero-based_numbering pour plus d'informations.
ja: キー1が ``0`` にマッピングされる理由は、リストの最初の要素が1ではなくゼロにマッピングされるためです。ほとんどのプログラミング言語のほとんどのリスト/配列の添字(インデックス)は、\ ``1`` ではなく ``0`` で始まります。詳細については、\ https://en.wikipedia.org/wiki/Zero-based_numbering を参照してください。
zh_cn: 键1被映射到“0”的原因是因为列表中的第一个元素被映射到零而不是一个。 大多数编程语言中的大多数列表/数组访问器都以 ``0`` 而不是 ``1`` 开头。 有关详细信息，请参阅https://en.wikipedia.org/wiki/Zero-based_numbering。

source: Next we check to see if ``shift_weapon_positive`` or ``shift_weapon_negative`` is pressed. If one of them is, we add/subtract ``1`` from ``weapon_change_number``.
es: A continuación comprobamos si ``shift_weapon_positive`` o ``shift_weapon_negative`` está presionado. Si uno de ellos lo está, añadimos/restamos ``1`` de ``weapon_change_number``.
fr: Ensuite, nous vérifions si ``shift_weapon_positive`` ou ``shift_weapon_negative`` est pressé. Si l'un d'eux l'est, on ajoute/soustrait ``1`` au ``numéro_de_changement_d'arme``.
ja: 次に、\ ``shift_weapon_positive`` または ``shift_weapon_negative`` が押されているかどうかを確認します。それらの1つがあれば、\ ``weapon_change_number`` から ``1`` を加算/減算します。

source: Because the player may have shifted ``weapon_change_number`` outside of the number of weapons the player has, we clamp it so it cannot exceed the maximum number of weapons the player has and it ensures ``weapon_change_number`` is ``0`` or more.
es: Debido a que el jugador puede haber cambiado el ``weapon_change_number`` fuera del número de armas que tiene, lo fijamos para que no pueda exceder el número máximo de armas que tiene y se asegura de que el ``weapon_change_number`` sea ``0`` o más.
fr: Parce que le joueur a peut-être changé ``weapon_change_number`` en dehors du nombre d’armes que le joueur possède, nous le fixons de sorte qu’il ne peut pas dépasser le nombre maximum d’armes que le joueur a et il assure que ``weapon_change_number`` vaut ``0`` ou plus.
ja: プレイヤーが保有している武器数の外側に ``weapon_change_number`` をシフトした可能性があるため、プレイヤーが持つ武器の最大数を超えないようにクランプし、\ ``weapon_change_number`` が ``0`` もしくはそれ以上であることを保証します。
zh_cn: 因为游戏角色可能已经在游戏角色拥有的武器数量之外移动了 ``weapon_change_number`` ，我们将其钳制，使其不能超过游戏角色拥有的最大武器数量，并确保 ``weapon_change_number`` 为“0”。 或者更多。

source: Then we check to make sure the player is not already changing weapons. If the player is not, we then check to see if the weapon the player wants to change to is a new weapon and not the weapon the player is currently using. If the weapon the player is wanting to change to is a new weapon, we then set ``changing_weapon_name`` to the weapon at ``weapon_change_number`` and set ``changing_weapon`` to ``true``.
es: Luego revisamos para asegurarnos de que el jugador no esté ya cambiando de armas. Si el jugador no lo está, entonces comprobamos si el arma a la que el jugador quiere cambiar es una nueva arma y no el arma que el jugador está usando actualmente. Si el arma a la que el jugador quiere cambiarse es una nueva arma, entonces ponemos ``changing_weapon_name`` al arma en ``weapon_change_number`` y ponemos ``changing_weapon`` en ``true``.
fr: Ensuite, nous vérifions que le joueur ne change pas déjà d'arme. Si ce n'est pas le cas, nous vérifions si l'arme pour laquelle le joueur veut changer est une nouvelle arme et non celle qu'il utilise actuellement. Si l'arme pour laquelle le joueur changer est une nouvelle arme, nous réglons alors ``changing_weapon_name`` sur l'arme à ``weapon_change_number`` et réglons ``changing_weapon`` sur ``vrai``.
ja: 次に、プレイヤーが既に武器を変更していないことを確認します。プレイヤーが変更していない場合、プレイヤーが変更したい武器が新しい武器であり、プレイヤーが現在使用している武器ではないかどうかを確認します。プレイヤーが変更したい武器が新しい武器である場合は、\ ``weapon_change_number`` で ``changing_weapon_name`` を武器に設定し、\ ``changing_weapon`` を ``true`` に設定します。

source: For firing the weapon we first check to see if the ``fire`` action is pressed. Then we check to make sure the player is not changing weapons. Next we get the weapon node for the current weapon.
es: Para disparar el arma, primero revisamos si la acción ``fire`` está presionada. Luego comprobamos que el jugador no esté cambiando de arma. Luego obtenemos el nodo del arma para el arma actual.
fr: Pour tirer, nous vérifions d'abord si l'action ``fire`` est pressée. Ensuite, nous vérifions que le joueur ne change pas d'arme. Ensuite, nous obtenons le nœud d'arme pour l'arme actuelle.
ja: 武器を発射するには、まず ``fire`` アクションが押されているかどうかを確認します。次に、プレイヤーが武器を変更していないことを確認します。次に、現在の武器の武器ノードを取得します。
zh_cn: 为了发射武器，我们首先检查是否按下了 ``fire`` 动作。 然后我们检查确保游戏角色没有更换武器。 接下来，我们获得当前武器的武器节点。

source: If the current weapon node does not equal ``null``, and the player is in its ``IDLE_ANIM_NAME`` state, we set the player's animation to the current weapon's ``FIRE_ANIM_NAME``.
es: Si el nodo del arma actual no es igual a ``null``, y el jugador está en su estado de ``IDLE_ANIM_NAME``, ponemos la animación del jugador en el estado de ``FIRE_ANIM_NAME`` del arma actual.
fr: Si le nœud d'arme courant n'est pas ``null``, et que le joueur est dans son état ``IDLE_ANIM_NAME``, l'animation du joueur est définie sur ``FIRE_ANIM_NAME`` de l'arme courante.
ja: 現在の武器ノードが ``null`` ではなく、プレイヤーが ``IDLE_ANIM_NAME`` 状態にある場合、プレイヤーのアニメーションを現在の武器の ``FIRE_ANIM_NAME`` に設定します。

source: Let's add ``process_changing_weapons`` next.
es: Añadamos ``process_changing_weapons`` a continuación.
fr: Ajoutons ``process_changing_weapons`` suivant.
ja: 次に ``process_changing_weapons`` を追加しましょう。

source: Add the following code:
es: Añade el siguiente código:
fr: Ajoutez le code suivant :
ja: 次のコードを追加します:
zh_cn: 添加以下代码：

source: Let's go over what's happening here:
es: Repasemos lo que está pasando aquí:
fr: Voyons ce qui se passe ici :
ja: ここで何が起こっているのかを見てみましょう:
zh_cn: 让我们回顾一下这里发生的事情:

source: The first thing we do is make sure we've received input to change weapons. We do this by making sure ``changing_weapons`` is ``true``.
fr: La première chose que nous faisons est de nous assurer que nous avons reçu les informations pour changer les armes. Pour ce faire, nous nous assurons que le ``changing_weapons`` est ``true``.
ja: 最初に行うことは、武器を変更するための入力を受け取ったことを確認することです。これを行うには、\ ``changing_weapons`` が ``true`` であることを確認します。
zh_cn: 我们要做的第一件事就是确保我们收到改变武器的投入。 我们通过确保 ``changing_weapons`` 是 ``true`` 来做到这一点。

source: Next we define a variable (``weapon_unequipped``) so we can check whether the current weapon has been successfully unequipped or not.
es: A continuación definimos una variable (``weapon_unequipped``) para que podamos comprobar si el arma actual ha sido desequipada con éxito o no.
fr: Ensuite, nous définissons une variable (``weapon_unequipped``) pour pouvoir vérifier si l'arme courante a été correctement déséquipée ou non.
ja: 次に、変数(``weapon_unequipped``)を定義して、現在の武器が正常に装備解除されたかどうかを確認できるようにします。
zh_cn: 接下来我们定义一个变量(``weapon_unequipped``)，这样我们就可以检查当前的武器是否已成功装备。

source: Then we get the current weapon from ``weapons``.
es: Entonces obtenemos el arma actual de ``weapons``.
fr: Ensuite, nous obtenons l’arme actuelle depuis ``weapons``.
ja: 次に、\ ``weapons`` から現在の武器を取得します。
zh_cn: 然后我们从“武器”中获取当前的武器。

source: If the current weapon is not ``null``, then we need to check whether the weapon is enabled. If the weapon is enabled, we call its ``unequip_weapon`` function so it will start the unequip animation. If the weapon is not enabled, we set ``weapon_unequipped`` to ``true`` because the weapon has successfully been unequipped.
es: Si el arma actual no es ``null``, entonces tenemos que comprobar si el arma está habilitada. Si el arma está habilitada, llamamos a su función ``unequip_weapon`` para que inicie la animación del desequipar. Si el arma no está habilitada, ponemos ``weapon_unequipped`` en ``true`` porque el arma ha sido exitosamente desequipada.
fr: Si l'arme actuelle n'est pas ``null``, il faut alors vérifier si l'arme est activée. Si l'arme est activée, nous appelons sa fonction ``unequip_weapon`` pour qu'elle lance l'animation de déséquipement. Si l'arme n'est pas activée, nous réglons "arme_non_équipée" sur "vrai" parce que l'arme n'a pas été correctement équipée.
ja: 現在の武器が ``null`` でない場合、武器が有効になっているかどうかを確認する必要があります。武器が有効になっている場合、\ ``unequip_weapon`` 関数を呼び出して、武装解除アニメーションを開始します。武器が有効になっていない場合、武器が正常に装備解除されたため、\ ``weapon_unequipped`` を ``true`` に設定します。

source: If the current weapon is ``null``, then we can simply set ``weapon_unequipped`` to ``true``. The reason we do this check is because there is no weapon script/node for ``UNARMED``, but there is also no animations for ``UNARMED``, so we can just start equipping the weapon the player wants to change to.
es: Si el arma actual es ``null``, entonces podemos simplemente establecer ``weapon_unequipped`` como ``true``. La razón por la que hacemos esta comprobación es porque no hay ningún script/nodo de arma para ``UNARMED``, pero tampoco hay animaciones para ``UNARMED``, así que podemos empezar a equipar el arma a la que el jugador quiere cambiar.
fr: Si l'arme actuelle est ``null``, nous pouvons simplement régler ``weapon_unequipped`` sur ``true``. La raison pour laquelle nous faisons cette vérification est qu'il n'y a pas de script/nœud d'arme pour ``UNARMED``, mais il n'y a pas non plus d'animations pour ``UNARMED``, donc nous pouvons juste commencer à équiper l'arme pour laquelle le joueur veut changer.
ja: 現在の武器が ``null`` の場合、単純に ``weapon_unequipped`` を ``true`` に設定できます。このチェックを行う理由は、\ ``UNARMED`` 用の武器スクリプト/ノードがないためですが、\ ``UNARMED`` 用のアニメーションも存在しないため、プレイヤーが変更したい武器の装備をすぐに開始できるからです。
zh_cn: 如果当前武器是“null”，那么我们可以简单地将 ``weapon_unequipped`` 设置为 ``true`` 。 我们做这个检查的原因是因为 ``UNARMED`` 没有武器脚本/节点，但是 ``UNARMED`` 也没有动画，所以我们可以开始装备游戏角色想要改变的武器。

source: If the player has successfully unequipped the current weapon (``weapon_unequipped == true``), we need to equip the new weapon.
es: Si el jugador ha logrado desarmar el arma actual (``weapon_unequipped == true``), necesitamos equipar la nueva arma.
fr: Si le joueur a réussi à déséquiper l'arme actuelle (``weapon_unequipped == true``), nous devons équiper la nouvelle arme.
ja: プレイヤーが現在の武器の装備解除に成功した場合(``weapon_unequipped == true``)、新しい武器を装備する必要があります。
zh_cn: 如果游戏角色已成功装备当前武器(``weapon_unequipped == true``)，我们需要装备新武器。

source: First we define a new variable (``weapon_equipped``) for tracking whether the player has successfully equipped the new weapon or not.
es: Primero definimos una nueva variable (``weapon_equipped``) para rastrear si el jugador ha equipado exitosamente la nueva arma o no.
fr: Tout d'abord, nous définissons une nouvelle variable (``weapon_equipped``) pour savoir si le joueur a réussi à équiper la nouvelle arme ou non.
ja: 最初に、プレイヤーが新しい武器を正常に装備したかどうかを追跡するための新しい変数(``weapon_equipped``)を定義します。
zh_cn: 首先，我们定义一个新变量(``weapon_equipped``)，用于跟踪游戏角色是否成功装备了新武器。

source: Then we get the weapon the player wants to change to. If the weapon the player wants to change to is not ``null``, we then check to see whether it's enabled or not. If it is not enabled, we call its ``equip_weapon`` function so it starts to equip the weapon. If the weapon is enabled, we set ``weapon_equipped`` to ``true``.
es: Entonces conseguimos el arma que el jugador quiere cambiar. Si el arma a la que el jugador quiere cambiar no es ``null``, entonces comprobamos si está activada o no. Si no está activada, llamamos a su función ``equip_weapon`` para que empiece a equipar el arma. Si el arma está habilitada, ponemos ``weapon_equipped``a ``true``.
fr: Ensuite, nous obtenons l'arme pour laquelle le joueur veut changer. Si l'arme pour laquelle le joueur veut changer n'est pas ``null``, nous vérifions alors si elle est activée ou non. S'il n'est pas activé, on appelle sa fonction ``equip_weapon`` pour qu'il commence à équiper l'arme. Si l'arme est activée, nous réglons ``weapon_equipped`` sur ``true``.
ja: 次に、プレイヤーが変更したい武器を取得します。プレイヤーが変更したい武器が ``null`` ではない場合、それが有効になっているかどうかを確認します。有効になっていない場合は、\ ``equip_weapon`` 関数を呼び出して、武器の装備を開始します。武器が有効になっている場合、\ ``weapon_equipped`` を ``true`` に設定します。
zh_cn: 然后我们得到游戏角色想要改变的武器。 如果游戏角色想要改变的武器不是“空”，那么我们检查它是否被启用。 如果它没有启用，我们称其为 ``equip_weapon`` 函数，因此它开始装备武器。 如果武器已启用，我们将 ``weapon_equipped`` 设置为 ``true`` 。

source: If the weapon the player wants to change to is ``null``, we simply set ``weapon_equipped`` to ``true`` because we do not have any node/script for ``UNARMED``, nor do we have any animations.
es: Si el arma que el jugador quiere cambiar es ``null``, simplemente ponemos ``weapon_equipped`` en ``true`` porque no tenemos ningún nodo/script para ``UNARMED``, ni tenemos ninguna animación.
fr: Si l'arme pour laquel le joueur veut changer est ``null``, nous réglons simplement ``weapon_equipped`` sur ``true`` parce que nous n'avons pas de nœud/script pour ``UNARMED``, ni d'animations.
ja: プレイヤーが変更したい武器が ``null`` の場合、\ ``wearmon_equipped`` を ``true`` に設定します。これは、\ ``UNARMED`` のノード/スクリプトがなく、アニメーションもないためです。
zh_cn: 如果游戏角色想要改变的武器是“null”，我们只需将 ``weapon_equipped`` 设置为 ``true`` ，因为我们没有“UNARMED”的任何节点/脚本，我们也没有 任何动画。
