Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_two.po
Languages: es, fr, ja, zh_cn

source: Part 2
es: Parte 2
fr: Partie 2
ja: パート2
zh_cn: 第2部分

source: Part overview
es: Resumen
fr: Aperçu cette partie
ja: パートの概要

source: In this part we will be giving our player weapons to play with.
es: En esta parte le daremos a nuestro personaje armas para usar.
fr: Dans cette partie, nous donnerons à notre joueur des armes avec lesquelles jouer.
ja: このパートでは、操作できる武器をプレイヤーに提供します。
zh_cn: 在这部分中，我们将为游戏角色提供武器。

source: By the end of this part, you will have a player that can fire a pistol, rifle, and attack using a knife. The player will also now have animations with transitions, and the weapons will interact with objects in the environment.
es: Al final de esta parte, tu tendras un personaje que podra disparar una pistola, un rifle y atacar usando un cuchillo. El jugador tambien podra tener animaciones con transiciones, y las armas podran interactuar con objetos del entorno.
fr: À la fin de cette partie, vous aurez un joueur qui pourra tirer avec un pistolet, un fusil et attaquer avec un couteau. Le joueur aura aussi maintenant des animations avec des transitions, et les armes interagiront avec les objets dans l'environnement.
ja: このパートの終わりまでに、あなたはピストルを発射し、ライフルを持ち、ナイフを使用して攻撃できるプレイヤーになります。また、プレイヤーにはトランジションを含むアニメーションがあり、武器は環境内のオブジェクトと相互作用します。
zh_cn: 到这部分结束时，您将拥有一个可以使用小刀发射手枪，步枪和攻击的游戏角色。 游戏角色现在还将拥有过渡动画，并且武器将与环境中的对象进行交互。

source: You are assumed to have finished :ref:`doc_fps_tutorial_part_one` before moving on to this part of the tutorial. The finished project from :ref:`doc_fps_tutorial_part_one` will be the starting project for part 2
es: Se supone que has terminado :ref:`doc_fps_tutorial_part_one` antes de llegar a esta parte del tutorial. La parte final de :ref:`doc_fps_tutorial_part_one` sera el inicio del poryecto de la parte 2
fr: Vous êtes supposé avoir terminé :ref:`doc_fps_tutorial_part_one` avant de passer à cette partie du tutoriel. Le projet fini de :ref:`doc_fps_tutorial_part_one` sera le projet de départ de la partie 2
ja: チュートリアルのこの部分に進む前に、\ :ref:`doc_fps_tutorial_part_one` を終了していることが前提となります。\ :ref:`doc_fps_tutorial_part_one` で完成したプロジェクトは、パート2の開始プロジェクトになります
zh_cn: 在继续本教程的这一部分之前，我们假设您已经完成了 :ref:`doc_fps_tutorial_part_one`。 完成的项目来自 :ref:`doc_fps_tutorial_part_one`将成为第2部分的起始项目

source: Let's get started!
es: ¡Vamos a empezar!
fr: Commençons tout de suite !
ja: では、始めましょう！
zh_cn: 让我们开始吧！

source: Making a system to handle animations
es: Hacer un sistema que maneje las animaciones
fr: Réalisation d'un système de traitement des animations
ja: アニメーションを処理するシステムを作成する
zh_cn: 制作系统来处理动画

source: First we need a way to handle changing animations. Open up ``Player.tscn`` and select the :ref:`AnimationPlayer <class_AnimationPlayer>` Node (``Player`` -> ``Rotation_Helper`` -> ``Model`` -> ``Animation_Player``).
es: Primero necesitamos una forma de manejar las animaciones cambiantes. Abre el ``Player.tscn`` y selecciona el nodo :ref:`AnimationPlayer <class_AnimationPlayer>` (``Player`` -> ``Rotation_Helper`` -> ``Model`` -> ``Animation_Player``).
fr: Tout d'abord, nous avons besoin d'un moyen de gérer les animations changeantes. Ouvrez ``Player.tscn`` et sélectionnez le Node :ref:`AnimationPlayer <class_AnimationPlayer>` (``Player`` -> ``Rotation_Helper`` -> ``Model`` -> ``Animation_Player``).
ja: 最初に、変化するアニメーションを処理する方法が必要です。\ ``Player.tscn`` を開き、\ :ref:`AnimationPlayer <class_AnimationPlayer>` ノードを選択します(``Player`` -> ``Rotation_Helper`` -> ``Model``-> ``Animation_Player``)。
zh_cn: 首先，我们需要一种方法来处理不断变化的动画。 打开 ``Player.tscn`` 并选择 :ref:`AnimationPlayer <class_AnimationPlayer>` Node(``Player`` ->` `Rotation_Helper`` ->` `Model`` ->` `Animation_Player``)。

source: Create a new script called ``AnimationPlayer_Manager.gd`` and attach that to the :ref:`AnimationPlayer <class_AnimationPlayer>`.
es: Crea un nuevo script llamado ``AnimationPlayer_Manager.gd`` y adjuntalo a :ref:`AnimationPlayer <class_AnimationPlayer>`.
fr: Créez un nouveau script appelé ``AnimationPlayer_Manager.gd`` et attachez-le au :ref:`AnimationPlayer <class_AnimationPlayer>`.
ja: ``AnimationPlayer_Manager.gd`` という新しいスクリプトを作成し、それを :ref:`AnimationPlayer <class_AnimationPlayer>` にアタッチします。
zh_cn: 创建一个名为 ``AnimationPlayer_Manager.gd`` 的新脚本，并将其附加到 :ref:`AnimationPlayer <class_AnimationPlayer>`。

source: Add the following code to ``AnimationPlayer_Manager.gd``:
es: Añade el código siguiente a ``AnimationPlayer_Manager.gd``:
fr: Ajoutez le code suivant dans ``AnimationPlayer_Manager.gd`` :
ja: 次のコードを ``AnimationPlayer_Manager.gd`` に追加します:
zh_cn: 将以下代码添加到``AnimationPlayer_Manager.gd``:

source: Lets go over what this script is doing:
es: Repasemos lo que hace este script:
fr: Revoyons ce que fait ce script :
ja: このスクリプトが何をしているのかを見てみましょう:
zh_cn: 让我们来看看这个脚本正在做什么:

source: Lets start with this script's class variables:
es: Empecemos con las variables de clase de este script:
fr: Commençons par les variables de classe de ce script :
ja: このスクリプトのクラス変数から始めましょう:
zh_cn: 让我们从这个脚本的类变量开始:

source: ``states``: A dictionary for holding our animation states. (Further explanation below)
es: ``states``: Un diccionario para contener nuestros estados de animación. (Explanación más extensa abajo)
fr: ``states`` : Un dictionnaire pour tenir nos états d'animation. (Plus d'explications ci-dessous)
ja: ``states``: アニメーションの状態を保持するためのdictionary(辞書)。(詳細な説明は後ほど)
zh_cn: ``states``:用于保存动画状态的字典。 (以下进一步说明)

source: ``animation_speeds``: A dictionary for holding all the speeds at which we want to play our animations.
es: ``animation_speeds``: Un diccionario para contener todas las velocidades a las que ejecutaremos nuestras animaciones.
fr: ``animation_speeds`` : Un dictionnaire pour contenir toutes les vitesses auxquelles nous voulons jouer nos animations.
ja: ``animation_speeds``: アニメーションを再生したいすべての速度を保持するためのdictionary。

source: ``current_state``: A variable for holding the name of the animation state we are currently in.
es: ``current_state``: Un variable para contener el nombre del estado de animación en que estamos actualmente.
fr: ``current_state`` : Une variable pour contenir le nom de l'état de l'animation dans lequel nous nous trouvons actuellement.
ja: ``current_state``: 現在のアニメーション状態の名前を保持する変数。
zh_cn: ``current_state``:一个变量，用于保存我们当前所处的动画状态的名称。

source: ``callback_function``: A variable for holding the callback function. (Further explanation below)
es: ``callback_function``: Una variable para mantener una función (Explicación más abajo)
fr: ``callback_function`` : Variable de maintien de la fonction de rappel. (Plus d'explications ci-dessous)
ja: ``callback_function``: コールバック関数を保持する変数。(詳細な説明は後ほど)
zh_cn: ``callback_function``:用于保存回调函数的变量。 (以下进一步说明)

source: If you are familiar with state machines, then you may have noticed that ``states`` is structured like a basic state machine. Here is roughly how ``states`` is set up:
es: Si estás familiarizado con las máquinas de estados, entonces habrás notado que ``states`` está estructurado como una máquina de estados básica. Aquí está más o menos cómo se configura el ``states``:
fr: Si vous êtes familier avec les machines à états, vous avez peut-être remarqué que ``states`` est structuré comme une machine à états de base. Voici en gros comment les ``states`` sont établis :
ja: ステートマシンに精通している場合、\ ``states`` は基本的なステートマシンのように構成されていることに気付いているかもしれません。大まかに ``states`` を設定する方法は次のとおりです:
zh_cn: 如果您熟悉状态机，那么您可能已经注意到 ``states`` 的结构类似于基本状态机。 这里大致是如何设置``states``:

source: ``states`` is a dictionary with the key being the name of the current state, and the value being an array holding all the animations (states) we can transition to. For example, if we are currently in the ``Idle_unarmed`` state, we can only transition to ``Knife_equip``, ``Pistol_equip``, ``Rifle_equip``, and ``Idle_unarmed``.
es: ``states`` es un diccionario cuya clave es el nombre del estado actual, y el valor es un array que contiene todas las animaciones (estados) a las que podemos pasar. Por ejemplo, si estamos actualmente en el estado ``Idle_unarmed``, sólo podemos pasar a ``Knife_equip``, ``Pistol_equip``, ``Rifle_equip``, y ``Idle_unarmed``.
fr: ``states`` est un dictionnaire dont la clé est le nom de l'état courant, et la valeur est un tableau contenant toutes les animations (états) vers lesquelles nous pouvons faire la transition. Par exemple, si nous sommes actuellement dans l'état ``Idle_unarmed``, nous ne pouvons passer qu'à ``Knife_equip``, ``Pistol_equip``, ``Rifle_equip`` et ``Idle_unsarmed``.
ja: ``states`` は、キーが現在の状態の名前であり、値が遷移可能なすべてのアニメーション(states)を保持する配列である辞書です。たとえば、現在 ``Idle_unarmed`` 状態にある場合、\ ``Knife_equip``\ 、\ ``Pistol_equip``\ 、\ ``Rifle_equip``\ 、および ``Idle_unarmed`` にのみ移行できます。

source: If we try to transition to a state that is not included in the possible transitions states for the state we are in, then we get a warning message and the animation does not change. We can also automatically transition from some states into others, as will be explained further below in ``animation_ended``
fr: Si nous essayons de passer à un état qui n'est pas inclus dans les états de transition possibles pour l'état dans lequel nous nous trouvons, alors nous recevons un message d'avertissement et l'animation ne change pas. Nous pouvons aussi passer automatiquement de certains états à d'autres, comme nous l'expliquerons plus loin dans ``animation_ended``
ja: 現在の状態の可能な遷移状態に含まれていない状態に遷移しようとすると、警告メッセージが表示され、アニメーションは変更されません。以下の ``animation_ended`` でさらに説明するように、いくつかの状態から他の状態に自動的に移行することもできます。
zh_cn: 如果我们尝试转换到未包含在我们所处状态的可能转换状态中的状态，那么我们会收到警告消息并且动画不会更改。 我们也可以自动从一些状态转换到其他状态，这将在下面的“animation_ended”中进一步解释

source: For the sake of keeping this tutorial simple, we are not using a 'proper' state machine. If you are interested to know more about state machines, see the following articles:
es: Para mantener este tutorial simple, no estamos usando una máquina de estado `adecuada`. Si está interesado en saber más sobre las máquinas de estado, vea los siguientes artículos:
fr: Pour que ce tutoriel reste simple, nous n'utilisons pas une machine d'état 'correcte'. Si vous souhaitez en savoir plus sur les machines d'état, consultez les articles suivants :
ja: このチュートリアルをシンプルにするために、「適切な」状態マシンを使用していません。ステートマシンについて詳しく知りたい場合は、次の記事を参照してください:

source: (Python example) https://dev.to/karn/building-a-simple-state-machine-in-python
es: (Ejemplo de Python) https://dev.to/karn/building-a-simple-state-machine-in-python
fr: (exemple Python) https://dev.to/karn/building-a-simple-state-machine-in-python
ja: (Pythonの例) https://dev.to/karn/building-a-simple-state-machine-in-python
zh_cn: (Python示例)https://dev.to/karn/building-a-simple-state-machine-in-python

source: (C# example) https://www.codeproject.com/Articles/489136/UnderstandingplusandplusImplementingplusStateplusP
es: (C# ejemplo) https://www.codeproject.com/Articles/489136/UnderstandingplusandplusImplementingplusStateplusP
fr: (exemple C#) https://www.codeproject.com/Articles/489136/UnderstandingplusandplusImplementingplusStateplusP
ja: (C#の例) https://www.codeproject.com/Articles/489136/UnderstandingplusandplusImplementingplusStateplusP
zh_cn: (C#示例)https://www.codeproject.com/Articles/489136/UnderstandingplusandplusImplementingplusStateplusP

source: (Wiki article) https://en.wikipedia.org/wiki/Finite-state_machine
es: (Artículo de Wiki) https://es.wikipedia.org/wiki/Aut%C3%B3mata_finito
fr: (Article Wiki) https://en.wikipedia.org/wiki/Finite-state_machine
ja: (wikipediaの記事) https://en.wikipedia.org/wiki/Finite-state_machine
zh_cn: (维基文章)https://en.wikipedia.org/wiki/Finite-state_machine

source: ``animation_speeds`` is how fast each animation will play. Some of the animations are a little slow and in an effort to make everything look smooth, we need to play them at faster speeds.
es: ``animation_speeds`` es la velocidad a la que se reproducirá cada animación. Algunas de las animaciones son un poco lentas y en un esfuerzo por hacer que todo se vea suave, tenemos que jugarlos a velocidades más rápidas.
fr: ``animation_speeds`` est la vitesse à laquelle chaque animation sera lue. Certaines animations sont un peu lentes et dans un effort pour que tout ait l'air lisse, nous avons besoin de les jouer à des vitesses plus rapides.
ja: ``animation_speeds`` は、各アニメーションの再生速度です。一部のアニメーションは少し遅く、すべてをスムーズに見せるために、より速い速度で再生する必要があります。
zh_cn: ``animation_speeds``是每个动画播放的速度。 有些动画有点慢，为了让一切看起来都很流畅，我们需要以更快的速度播放它们。

source: Notice that all of the firing animations are faster than their normal speed. Remember this for later!
es: Nota que todas las animaciones de disparo son más rápidas que su velocidad normal. ¡Recuerda esto para después!
fr: Notez que toutes les animations de tir sont plus rapides que leur vitesse normale. Souvenez-vous de ça pour plus tard !
ja: すべての発射アニメーションが通常の速度よりも速いことに注意してください。後のためにこれを覚えておいてください！
zh_cn: 请注意，所有触发动画都比正常速度快。 请记住以后再说！

source: ``current_state`` will hold the name of the animation state we are currently in.
es: ``current_state`` tendrá el nombre del estado de animación en el que estamos.
fr: ``current_state`` contiendra le nom de l'état de l'animation dans lequel nous sommes actuellement.
ja: ``current_state`` は、現在のアニメーション状態の名前を保持します。
zh_cn: ``current_state``将保存我们当前所处的动画状态的名称。

source: Finally, ``callback_function`` will be a :ref:`FuncRef <class_FuncRef>` passed in by the player for spawning bullets at the proper frame of animation. A :ref:`FuncRef <class_FuncRef>` allows us to pass in a function as an argument, effectively allowing us to call a function from another script, which is how we will use it later.
es: Finalmente, ``callback_function`` será un :ref:`FuncRef <class_FuncRef>` pasado por el jugador para generar balas en el marco apropiado de la animación. Un :ref:`FuncRef <class_FuncRef>` nos permite pasar una función como un argumento, permitiéndonos efectivamente llamar a una función desde otro script, que es como la usaremos más tarde.
fr: Enfin, ``callback_function`` sera un :ref:`FuncRef <class_FuncRef>` passé par le joueur pour générer des balles à la bonne image de l'animation. Un :ref:`FuncRef <class_FuncRef>` nous permet de passer une fonction en argument, nous permettant effectivement d'appeler une fonction depuis un autre script, ce que nous utiliserons plus tard.
ja: 最後に、\ ``callback_function`` は、アニメーションの適切なフレームで弾丸を産出するためにプレイヤーによって渡される :ref:`FuncRef <class_FuncRef>` になります。\ :ref:`FuncRef <class_FuncRef>` を使用すると、関数を引数として渡すことができ、他のスクリプトから関数を呼び出すことができます。これは後で使用する方法です。
zh_cn: 最后， ``callback_function`` 将是一个 :ref:`FuncRef <class_FuncRef>` 由游戏角色传入，用于在适当的动画帧中生成子弹。 答 :ref:`FuncRef <class_FuncRef>` 允许我们传递一个函数作为参数，有效地允许我们从另一个脚本调用一个函数，这是我们以后使用它的方式。

source: Now let's look at ``_ready``.
es: Ahora veamos el ``_ready``.
fr: Regardons maintenant ``_ready``.
ja: ``_ready`` を見てみましょう。

source: First we are setting our animation to ``Idle_unarmed`` using the ``set_animation`` function, so we for sure start in that animation.
es: Primero ponemos nuestra animación en ``Idle_unarmed`` usando la función ``set_animation``, así que seguro que empezamos en esa animación.
fr: Tout d'abord, nous réglons notre animation sur ``Idle_unarmed`` à l'aide de la fonction ``set_animation`` ; nous commençons donc avec cette animation.
ja: 最初に、\ ``set_animation`` 関数を使用してアニメーションを ``Idle_unarmed`` に設定しているので、必ずそのアニメーションから始めてください。
zh_cn: 首先，我们使用 ``set_animation`` 函数将动画设置为 ``Idle_unarmed`` ，所以我们肯定会从那个动画开始。

source: Next we connect the ``animation_finished`` signal to this script and assign it to call ``animation_ended``. This means whenever an animation is finished, ``animation_ended`` will be called.
es: A continuación conectamos la señal de ``animation_finished`` a este script y la asignamos a la llamada ``animation_ended``. Esto significa que cuando una animación esté terminada, se llamará ``animation_ended``.
fr: Ensuite, nous connectons le signal ``animation_finished`` à ce script et l'assignons à appeler ``animation_ended``. Cela signifie que chaque fois qu'une animation est terminée, ``animation_ended`` sera appelé.
ja: 次に、\ ``animation_finished`` シグナルをこのスクリプトに接続し、\ ``animation_ended`` を呼び出すように割り当てます。これは、アニメーションが終了するたびに ``animation_ended`` が呼び出されることを意味します。
zh_cn: 接下来，我们将 ``animation_finished`` 信号连接到此脚本并将其指定为调用 ``animation_ended`` 。 这意味着每当动画完成时，都会调用 ``animation_ended`` 。

source: Lets look at ``set_animation`` next.
fr: Regardons ``set_animation`` suivant.
ja: 次に ``set_animation`` を見てみましょう。
zh_cn: 让我们看看下面的 ``set_animation`` 。

source: ``set_animation`` changes the animation to the animation named ``animation_name`` *if* we can transition to it. In other words, if the animation state we are currently in has the passed in animation state name in ``states``, then we will change to that animation.
es: ``set_animation`` cambia la animación a la animación llamada ``animation_name``,*si* podemos hacer la transición a ella. En otras palabras, si el estado de animación en el que estamos actualmente tiene el nombre del estado de animación pasado en ``states``, entonces cambiaremos a esa animación.
fr: ``set_animation`` change l'animation par l'animation nommée ``animation_name`` *si* on la transition est possible. En d'autres termes, si l'état de l'animation dans lequel nous nous trouvons a le nom de l'état de l'animation passé dans ``states``, alors nous allons passer à cette animation.
ja: ``set_animation`` は\ *可能*\ な場合は、アニメーションを ``animation_name`` という名前のアニメーションに変更します。言い換えると、現在のアニメーション状態が ``states`` で渡されたアニメーション状態名を持っている場合、そのアニメーションに変更します。
zh_cn: ``set_animation``将动画更改为名为``animation_name`` *的动画*如果*我们可以转换到它。 换句话说，如果我们当前所处的动画状态在“states”中有传递的动画状态名称，那么我们将更改为该动画。

source: Firstly, we check if the passed in animation name is the same name as the animation currently playing. If they are the same, then we write a warning to the console and return ``true``.
es: En primer lugar, comprobamos si el nombre de la animación pasada es el mismo que el de la animación que se está reproduciendo. Si son iguales, entonces escribimos una advertencia a la consola y devolvemos ``true``.
fr: Tout d'abord, nous vérifions si le nom de l'animation passée dans l'animation est le même que celui de l'animation en cours de lecture. Si ce sont les mêmes, alors nous écrivons un avertissement à la console et nous retournons "true".
ja: まず、渡されたアニメーション名が現在再生中のアニメーションと同じ名前であるかどうかを確認します。それらが同じ場合、コンソールに警告を書き込み、\ ``true`` を返します。

source: Secondly, we see if :ref:`AnimationPlayer <class_AnimationPlayer>` has the animation with the name ``animation_name`` using ``has_animation``. If it does not, we return ``false``.
es: Segundo, vemos si :ref:`AnimationPlayer <class_AnimationPlayer>` tiene la animación con el nombre ``animation_name`` usando ``has_animation``. Si no es así, devolvemos ``false``.
fr: Deuxièmement, nous voyons si :ref:`AnimationPlayer <class_AnimationPlayer>` a l'animation avec le nom ``animation_name`` en utilisant ``has_animation``. Si ce n'est pas le cas, nous retournons ``false``.
ja: 次に、\ :ref:`AnimationPlayer <class_AnimationPlayer>` が ``has_animation`` を使用して ``animation_name`` という名前のアニメーションを持っているかどうかを確認します。そうでない場合、\ ``false`` を返します。

source: Thirdly, we check whether ``current_state`` is set. If we have a state in ``current_state``, then we get all the possible states we can transition to.
es: En tercer lugar, comprobamos si el ``current_state`` está establecido. Si tenemos un estado en ``current_state``, entonces tenemos todos los estados posibles a los que podemos pasar.
fr: Troisièmement, nous vérifions si ``current_state`` est défini. Si nous avons un état dans ``current_state``, alors nous obtenons tous les états possibles vers lesquels nous pouvons passer.

source: If the animation name is in the list of possible transitions, we set ``current_state`` to the passed in animation (``animation_name``), tell :ref:`AnimationPlayer <class_AnimationPlayer>` to play the animation with a blend time of ``-1`` at the speed set in ``animation_speeds`` and return ``true``.
es: Si el nombre de la animación está en la lista de transiciones posibles, ponemos ``current_state`` al pasado en la animación (``animation_name``), le decimos :ref:`AnimationPlayer <class_AnimationPlayer>` para reproducir la animación con un tiempo de mezcla de ``-1`` a la velocidad establecida en ``animation_speeds`` y devolver ``true``.
fr: Si le nom de l'animation se trouve dans la liste des transitions possibles, nous réglons ``current_state`` sur l'animation passée en animation (``animation_name``), :ref:`AnimationPlayer <class_AnimationPlayer>` pour lire l'animation avec un temps de mélange ``-1`` à la vitesse définie dans ``animation_speeds`` et retourner ``true``.
ja: アニメーション名が、使用可能なトランジションのリストにある場合、``current_state`` に渡されたアニメーション(``animation_name``)を設定し\ :ref:`AnimationPlayer <class_AnimationPlayer>` に blend timeを\ ``-1``、speedをanimation_speedsで設定した速度で、そのアニメーションを再生するように指示し、``true`` を返します。
zh_cn: 如果动画名称在可能的转换列表中，我们将 ``current_state`` 设置为传入的动画(``animation_name``)，告诉 :ref:`AnimationPlayer <class_AnimationPlayer>` 以混合时间播放动画 在 ``animation_speeds`` 中设置的速度为`-1 -1`并返回 ``true`` 。

source: Blend time is how long to blend/mix the two animations together.
es: El tiempo de mezcla es el tiempo de mezcla de las dos animaciones.
fr: Le temps de mélange est la durée pendant laquelle les deux animations doivent être mélangées ensemble.
ja: Blend timeは、2つのアニメーションをブレンド/ミックスする時間です。
zh_cn: 混合时间是将两个动画混合/混合多长时间。

source: By putting in a value of ``-1``, the new animation instantly plays, overriding whatever animation is already playing.
es: Poniendo un valor de ``-1``, la nueva animación se reproduce instantáneamente, reemplazando cualquier animación que ya se esté reproduciendo.
fr: En mettant une valeur de ``-1``, la nouvelle animation joue instantanément, remplaçant toute animation déjà en cours de lecture.
ja: ``-1`` の値を入力すると、新しいアニメーションが即座に再生され、既に再生されているアニメーションはすべて上書きされます。
zh_cn: 通过输入值“-1”，新动画立即播放，覆盖已播放的任何动画。

source: If you put in a value of ``1``, for one second the new animation will play with increasing strength, blending the two animations together for one second before playing only the new animation. This leads to a smooth transition between animations, which looks great when you are changing from a walking animation to a running animation.
es: Si pones un valor de ``1``, durante un segundo la nueva animación se reproducirá con mayor fuerza, mezclando las dos animaciones durante un segundo antes de reproducir sólo la nueva animación. Esto lleva a una transición suave entre las animaciones, que se ve muy bien cuando estás cambiando de una animación caminando a una animación corriendo.
fr: Si vous mettez une valeur de ``1``, pendant une seconde la nouvelle animation jouera avec une force croissante, mélangeant les deux animations ensemble pendant une seconde avant de jouer uniquement la nouvelle animation. Il en résulte une transition en douceur entre les animations, ce qui est parfait lorsque vous passez d'une animation de marche à une animation de course.
ja: ``1`` の値を入力すると、1秒の間、新しいアニメーションが強さを増しつつ再生、つまり新しいアニメーションのみを再生する前に、2つのアニメーションを1秒間ブレンドします。これにより、アニメーション間のスムーズな移行が可能になります。これは、ウォーキングアニメーションからランニングアニメーションに変更する場合に最適です。
zh_cn: 如果您输入一个“1”的值，一秒钟后新动画将以增加的力量播放，将两个动画混合在一起一秒钟，然后再播放新动画。 这导致动画之间的平滑过渡，当您从步行动画更改为正在运行的动画时，这看起来很棒。

source: We set the blend time to ``-1`` because we want to instantly change animations.
es: Fijamos el tiempo de mezcla en ``-1`` porque queremos cambiar las animaciones al instante.
fr: Nous réglons le temps de mélange sur ``-1`` parce que nous voulons changer instantanément les animations.
ja: アニメーションを即座に変更するため、ブレンド時間を ``-1`` に設定します。
zh_cn: 我们将混合时间设置为“-1”，因为我们想立即更改动画。

source: Now lets look at ``animation_ended``.
fr: Regardons maintenant ``animation_ended``.
ja: ``animation_ended`` を見てみましょう。
zh_cn: 现在让我们来看看 ``animation_ended`` 。
