Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_five.po
Languages: de, es, fr, ja, zh_cn

source: If the player is holding an object, we set its global position to the camera's position plus ``OBJECT_GRAB_DISTANCE`` in the direction the camera is facing.
es: Si el jugador está sujetando un objeto, cambiamos su posición global a la de la cámara más ``OBJECT_GRAB_DISTANCE`` en la dirección en la que mira la cámara.
fr: Si le joueur tient un objet, on lui assigne sa position globale à la position de la caméra + ``OBJECT_GRAB_DISTANCE`` dans la direction où la caméra fait face.
ja: プレイヤーがオブジェクトを保持している場合、そのグローバルポジションをカメラのポジションとカメラが向いている方向の ``OBJECT_GRAB_DISTANCE`` に設定します。
zh_cn: 如果游戏角色持有一个物体，我们将其全局位置设置为相机的位置以及相机朝向的方向上的“OBJECT_GRAB_DISTANCE”。

source: Before we test this, we need to change something in ``_physics_process``. While the player is holding an object, we do not want the player to be able to change weapons or reload, so change ``_physics_process`` to the following:
es: Antes de comprobar esto, tenemos que cambiar algo en ``_physics_process``. Mientras que el jugador está sujetando un objeto, no queremos que el jugador pueda cambiar de armas o recargar, entonces cambiamos ``_physics_process`` a lo siguiente:
fr: Avant de tester cela, nous devons changer quelque chose dans ``_physics_process``. Quand le joueur tient un objet, nous ne voulons pas que le joueur puisse changer d'armes ou recharger. Changez ``_physics_process`` à ce qui suit :
ja: これをテストする前に、\ ``_physics_process`` で何かを変更する必要があります。プレイヤーがオブジェクトを保持している間は、プレイヤーが武器を変更したりリロードしたりできないようにするため、\ ``_ physics_process`` を次のように変更します:
zh_cn: 在我们测试之前，我们需要在 ``_physics_process`` 中改变一些东西。 当游戏角色持有一个物体时，我们不希望游戏角色能够更换武器或重装，所以将 ``_physics_process`` 改为:

source: Now the player cannot change weapons or reload while holding an object.
de: Jetzt kann der Spieler die Waffe nicht mehr wechseln oder nachladen, während er einen Gegenstand hält.
es: Ahora el jugador no puede cambiar de arma o recargar mientras sujeta un objeto.
fr: Maintenant, le joueur ne peut pas changer d'arme ou recharger tant qu'il tient un objet.
ja: これで、プレイヤーはオブジェクトを保持している間、武器を変更したりリロードしたりできなくなります。
zh_cn: 现在游戏角色在拿着物体时无法改变武器或重装。

source: Now you can grab and throw RigidBody nodes while you're in the ``UNARMED`` state! Go give it a try!
es: Ahora puedes agarrar y lanzar nodos de RigidBody mientas que estas en el estado ``UNARMED``. ¡Inténtalo tú!
fr: Vous êtes désormais capable d'attraper et lancer des nœuds RigidBody tant que vous êtes dans l'état ``UNARMED`` ! Faites un essai !
ja: これで、\ ``UNARMED`` 状態にあるときにRigidBodyノードをつかんで投げることができます！試してみてください！
zh_cn: 现在，当您处于“UNARMED”状态时，您可以抓住并抛出RigidBody节点！ 去尝试吧！

source: Adding a turret
de: Einen Geschützturm hinzufügen
es: Añadir una torreta
fr: Ajouter une tourelle
ja: 砲塔の追加
zh_cn: 添加一个炮塔

source: Next, let's make a turret to shoot the player!
de: Als nächstes bauen wir einen Geschützturm, der auf den Spieler schießt!
es: Ahora,¡ hagamos que la torreta dispare al jugador!
fr: Créons une tourelle capable de tirer sur le joueur !
ja: 次に、プレイヤーを撃つための砲塔を作りましょう！
zh_cn: 接下来，让我们制作一个炮塔射击游戏角色！

source: Open up ``Turret.tscn``. Expand ``Turret`` if it's not already expanded.
de: Öffnen Sie ``Turret.tscn``. Erweitern Sie ``Turret``, wenn es nicht bereits erweitert ist.
es: Abre ``Turret.tscn``. Expande ``Turret`` si no estaba ya expandido.
fr: Ouvrez ``Turret.tscn``. Développez ``Turret`` si ce n'est pas encore le cas.
ja: ``Turret.tscn`` を開きます。まだ展開されていない場合は、\ ``Turret`` を展開します。
zh_cn: 打开 ``Turret.tscn`` 。 如果尚未展开，请展开 ``Turret`` 。

source: Notice how the turret is broken up into several parts: ``Base``, ``Head``, ``Vision_Area``, and a ``Smoke`` :ref:`Particles <class_Particles>` node.
es: Date cuenta de que la torreta esta dividida en varias partes: ``Base``, ``Head``, ``Vision_Area``, y un nodo ``Smoke`` :ref:`Particles <class_Particles>`.
fr: Remarquez comme la tourelle se décompose en plusieurs parties : ``Base``, ``Head``, ``Vision_Area``, et un nœud de :ref:`Particles <class_Particles>` ``Smoke``.
ja: 砲塔が複数の部分に分割されていることに注目してください : ``Base``\ 、\ ``Head``\ 、\ ``Vision_Area``\ 、および `` Smoke`` :ref:`Particles <class_Particles>` ノードです。

source: Open up ``Base`` and you'll find it's a :ref:`StaticBody <class_StaticBody>` and a mesh. Open up ``Head`` and you'll find there are several meshes, a :ref:`StaticBody <class_StaticBody>` and a :ref:`Raycast <class_Raycast>` node.
es: Abre ``Base`` y encontrarás que es un :ref:`StaticBody <class_StaticBody>` y una maya. Abre ``Head`` y encontrarás que son varias mayas, un :ref:`StaticBody <class_StaticBody>` y un nodo :ref:`Raycast <class_Raycast>`.
fr: Ouvrez ``Base`` et vous y trouverez son :ref:`StaticBody <class_StaticBody>` et son mesh. Ouvrez ``Head`` et vous y trouverez plusieurs mesh, un :ref:`StaticBody <class_StaticBody>` et un nœud :ref:`Raycast <class_Raycast>`.
ja: ``Base`` を開くと、\ :ref:`StaticBody <class_StaticBody>` とメッシュであることがわかります。\ ``Head`` を開くと、複数のメッシュ、\ :ref:`StaticBody <class_StaticBody>` と :ref:`Raycast <class_Raycast>` ノードがあります。

source: One thing to note with the ``Head`` is that the raycast will be where the turret's bullets will fire from if we are using raycasting. We also have two meshes called ``Flash`` and ``Flash_2``. These will be the muzzle flash that briefly shows when the turret fires.
es: Una cosa a tener en cuenta con el "Head" es que el raycast será desde donde las balas de la torreta dispararán si usamos el raycasting. También tenemos dos mallas llamadas ``Flash`` y ``Flash_2``. Estos serán los destellos del cañón que muestra brevemente cuando la torreta dispara.
fr: Une chose à noter avec ``Head``, c'est que le raycast correspond à l'endroit où les balles seront tirées si nous utilisons du raycast. Nous avons également deux mesh appelés ``Flash`` et ``Flash_2``. Il y aura un effet de lumière sur le bout du canon qui va apparaître lorsque la tourelle tire.
ja: ``Head`` で注意すべきことの1つは、レイキャスティングを使用している場合、レイキャストが砲塔が弾丸を発砲する場所になることです。また、\ ``Flash`` と ``Flash_2`` という2つのメッシュがあります。これらは、砲塔が発砲したときに簡単に表示される銃口フラッシュになります。
zh_cn: “头部”的一个注意事项是，如果我们使用光线投射，光线投射将是炮塔射击的地方。 我们还有两个网格叫做 ``Flash`` 和 ``Flash_2`` 。 这些将是枪口闪光，简要显示炮塔开火时。

source: ``Vision_Area`` is an :ref:`Area <class_Area>` we'll use as the turret's ability to see. When something enters ``Vision_Area``, we'll assume the turret can see it.
es: ``Vision_Area`` es un :ref:`Area <class_Area>` que usaremos como la habilidad de la torreta para ver. Cuando algo entra en ``Vision_Area``, asumiremos que la torreta lo puede ver.
fr: ``Vision_Area`` est une :ref:`Area <class_Area>` que nous allons utiliser pour donner une vision à la tourelle. Quand quelque chose entre la ``Vision_Area``, on suppose que la tourelle pourra le voir.
ja: ``Vision_Area`` は :ref:`Area <class_Area>` であり、砲塔の視認能力として使用します。何かが ``Vision_Area`` に入ると、砲塔がそれを見ることができると仮定します。
zh_cn: ``Vision_Area``是 :ref:`Area <class_Area>` 我们将用作炮塔的能力。 当某些东西进入“Vision_Area”时，我们会认为炮塔可以看到它。

source: ``Smoke`` is a :ref:`Particles <class_Particles>` node that will play when the turret is destroyed and repairing.
es: ``Smoke`` es un nodo :ref:`Particles <class_Particles>` que se activará cuando la torreta esté destruida o reparándose.
fr: ``Smoke`` est un nœud :ref:`Particles <class_Particles>` qui va se jouer quand la tourelle est détruite et en cours de réparation.
ja: ``Smoke`` は :ref:`Particles <class_Particles>` ノードで、砲塔が破壊されて修復されたときに再生されます。
zh_cn: ``Smoke``是一个 :ref:`Particles <class_Particles>` 节点将在炮塔被摧毁和修复时播放。

source: Now that we've looked at how the scene is set up, lets start writing the code for the turret. Select ``Turret`` and create a new script called ``Turret.gd``. Add the following to ``Turret.gd``:
es: Ahora que hemos visto como se compone una escena, podemos empezar a escribir el código para la torreta. Selecciona ``Turret`` y crea un fichero llamado ``Turret.gd``. Añade lo siguiente a ``Turret.gd``:
fr: Maintenant que nous avons vu comment la scène est mise en place, commençons à écrire le code pour la tourelle. Sélectionnez ``Turret`` et créez un nouveau script appelé ``Turret.gd``. Ajoutez ce qui suit dans ce script :
ja: シーンのセットアップ方法を確認したので、砲塔のコードの記述を始めましょう。\ ``Turret`` を選択し、\ ``Turret.gd`` という新しいスクリプトを作成します。以下を ``Turret.gd`` に追加します:
zh_cn: 现在我们已经了解了如何设置场景，让我们开始编写炮塔的代码。 选择 ``Turret`` 并创建一个名为 ``Turret.gd`` 的新脚本。 将以下内容添加到``Turret.gd``:

source: This is quite a bit of code, so let's break it down function by function. Let's first look at the class variables:
es: Esto es un código un poco largo, así que vamos a dividirlo por funciones. Primero echemos un vistazo a la variables de la clase:
fr: C'est pas mal de code, alors nous allons décomposer le script fonction par fonction. Jetons d'abord un œil aux variables de classe :
ja: これはかなり量のコードなので、機能ごとに分解してみましょう。最初にクラス変数を見てみましょう:
zh_cn: 这是相当多的代码，所以让我们按功能分解它。 我们先来看一下类变量:

source: ``use_raycast``: An exported boolean so we can change whether the turret uses objects or raycasting for bullets.
de: ``use_raycast``: Ein exportierter Boolescher Wert, mit dem wir ändern können, ob der Geschützturm Objekte oder Raycasting für Geschosse verwendet.
es: ``use_raycast``: Un booleano exportado para que podamos cambiar si la torreta usa objetos o raycasting para las balas.
fr: ``use_raycast`` : Un booléen exporté que nous allons pouvoir changer quand la tourelle utilise des objets ou tire des rayons pour des balles.
ja: ``use_raycast``: 砲塔が弾丸にオブジェクトを使用するかレイキャスティングを使用するかを変更できるように、エクスポートされたブール値。

source: ``TURRET_DAMAGE_BULLET``: The amount of damage a single bullet scene does.
de: ``TURRET_DAMAGE_BULLET``: Die Menge an Schaden, die eine einzelne Geschoss-Szene anrichtet.
es: ``TURRET_DAMAGE_BULLET``: La cantidad de daño que hace una sola escena de una bala.
fr: ``TURRET_DAMAGE_BULLET`` : Le montant de dégâts d'une seule scène de balle.
ja: ``TURRET_DAMAGE_BULLET``: 1つの弾丸シーンが与えるダメージの量。
zh_cn: ``TURRET_DAMAGE_BULLET``:单个子弹场景造成的伤害量。

source: ``TURRET_DAMAGE_RAYCAST``: The amount of damage a single :ref:`Raycast <class_Raycast>` bullet does.
de: ``TURRET_DAMAGE_RAYCAST``: Die Schadenshöhe, den ein einzelnes :ref:``Raycast <class_Raycast>` Geschoss anrichtet.
es: ``TURRET_DAMAGE_RAYCAST``:La cantidad de daño que hace una sola bala :ref:`Raycast <clase_Raycast>`.
fr: ``TURRET_DAMAGE_RAYCAST`` : Le montant de dégâts qu'une seule balle :ref:`Raycast <class_Raycast>` fait.
ja: ``TURRET_DAMAGE_RAYCAST``: 単一の :ref:`Raycast <class_Raycast>` 弾丸が与えるダメージの量。
zh_cn: ``TURRET_DAMAGE_RAYCAST``:单个损坏的数量 :ref:`Raycast <class_Raycast>` bullet。

source: ``FLASH_TIME``: The amount of time (in seconds) the muzzle flash meshes are visible.
de: ``FLASH_TIME``: Die Zeitspanne (in Sekunden), in der die Mündungsblitze sichtbar sind.
es: ``FLASH_TIME``: La cantidad de tiempo (en segundos) que las mallas de flash del cañón son visibles.
fr: ``FLASH_TIME`` : La durée (en seconde) pendant laquelle le flash sur le canon est visible.
ja: ``FLASH_TIME``: 銃口フラッシュメッシュが表示される時間(秒単位)。
zh_cn: ``FLASH_TIME``:枪口闪光网格的可见时间(以秒为单位)。

source: ``flash_timer``: A variable for tracking how long the muzzle flash meshes have been visible.
de: ``flash_timer``: Eine Variable zum Verfolgen wie lange die Meshes der Mündungsblitze sichtbar waren.
es: ``flash_timer``: Una variable para rastrear cuánto tiempo han sido visibles las mallas de flash del cañón.
fr: ``flash_timer`` : Une variable utilisée pour savoir combien de temps a passé depuis qu'on a rendu visible le flash du canon.
ja: ``flash_timer``: 銃口のフラッシュメッシュが表示されている時間を追跡するための変数。
zh_cn: ``flash_timer``:一个变量，用于跟踪枪口闪光网格的可见时间。

source: ``FIRE_TIME``: The amount of time (in seconds) needed to fire a bullet.
de: ``FIRE_TIME``: Die Zeit (in Sekunden) die benötigt wird, um ein Geschoss abzufeuern.
es: ``FIRE_TIME``: El tiempo(en segundos) necesitados para disparar una bala.
fr: ``FIRE_TIME`` : Le temps nécessaire (en secondes) pour tirer une balle.
ja: ``FIRE_TIME``: 弾丸を発射するのに必要な時間(秒単位)。
zh_cn: ``FIRE_TIME``:发射子弹所需的时间(以秒为单位)。

source: ``fire_timer``: A variable for tracking how much time has passed since the turret last fired.
de: ``fire_timer``: Eine Variable zur Verfolgung, wie viel Zeit seit dem letzten Schuss des Geschützturms vergangen ist.
es: ``fire_timer``: Una variable para traquear cuanto tiempo ha pasado desde el ultimo disparo de la torreta.
fr: ``fire_timer`` : Une variable utilisée pour savoir combien de temps a passé depuis qu'une balle a été tirée.
ja: ``fire_timer``: 砲塔が最後に発射してから経過した時間を追跡するための変数。
zh_cn: ``fire_timer``:一个变量，用于跟踪炮塔上次射击后经过的时间。

source: ``node_turret_head``: A variable to hold the ``Head`` node.
de: ``node_turret_head``: Eine Variable, die den ``Head``-Node enthält.
es: ``node_turret_head``: Una variable para mantener el nodo``Head``.
fr: ``node_turret_head`` : Une variable utilisée pour stocker le nœud ``Head``.
ja: ``node_turret_head``: ``Head`` ノードを保持する変数。
zh_cn: ``node_turret_head``:一个用于保存 ``Head`` 节点的变量。

source: ``node_raycast``: A variable to hold the :ref:`Raycast <class_Raycast>` node attached to the turret's head.
de: ``node_raycast``: Eine Variable, die den Node :ref:``Raycast <class_Raycast>` am Kopf des Geschützturms hält.
es: ``node_raycast``: Una variable para mantener el nodo :ref:`Raycast <class_Raycast>` junto a la cabeza de la torreta.
fr: ``node_raycast`` : Une variable nous permettant de stocker le nœud :ref:`Raycast <class_Raycast>` attaché à la tête de la tourelle.
ja: ``node_raycast``: 砲塔の頭部に接続された :ref:`Raycast <class_Raycast>` ノードを保持する変数。
zh_cn: ``node_raycast``:一个变量，用于保存附加到炮塔头部的 :ref:`Raycast <class_Raycast>` 节点。

source: ``node_flash_one``: A variable to hold the first muzzle flash :ref:`MeshInstance <class_MeshInstance>`.
de: ``node_flash_one``: Eine Variable, die den ersten Mündungsblitz enthält :ref:`MeshInstance <class_MeshInstance>`.
es: ``node_flash_one``: Una variable para mantener el primer flash de disparo:ref:`MeshInstance <class_MeshInstance>`.
fr: ``node_flash_one`` : Une variable utilisée pour stocker le premier :ref:`MeshInstance <class_MeshInstance>` du flash du canon.
ja: ``node_flash_one``: 最初の銃口フラッシュ :ref:`MeshInstance <class_MeshInstance>` を保持する変数。
zh_cn: ``node_flash_one``:一个用于保存第一个枪口flash的变量 :ref:`MeshInstance <class_MeshInstance>`。

source: ``node_flash_two``: A variable to hold the second muzzle flash :ref:`MeshInstance <class_MeshInstance>`.
de: ``node_flash_two``: Eine Variable, die den zweiten Mündungsblitz enthält :ref:`MeshInstance <class_MeshInstance>`.
es: ``node_flash_two``: Una variable para mentener el segundo flash de disparo :ref:`MeshInstance <class_MeshInstance>`.
fr: ``node_flash_two`` : Une variable utilisée pour stocker le second :ref:`MeshInstance <class_MeshInstance>` du flash du canon.
ja: ``node_flash_two``: 2番目の銃口フラッシュ :ref:`MeshInstance <class_MeshInstance>` を保持する変数。
zh_cn: ``node_flash_two``:一个用于保存第二个枪口flash的变量 :ref:`MeshInstance <class_MeshInstance>`。

source: ``ammo_in_turret``: The amount of ammo currently in the turret.
de: ``ammo_in_turret``: Die Menge an Munition, die sich derzeit im Geschützturm befindet.
es: ``ammo_in_turret``: Cuanta municion hay en la torreta en el momento.
fr: ``ammo_in_turret`` : Le nombre de balles dont la tourelle dispose actuellement.
ja: ``ammo_in_turret``: 現在砲塔にある弾薬の量。
zh_cn: ``ammo_in_turret``:目前炮塔中的弹药数量。

source: ``AMMO_IN_FULL_TURRET``: The amount of ammo in a full turret.
de: ``AMMO_IN_FULL_TURRET``: Die Menge an Munition in einem vollen Geschützturm.
es: ``AMMO_IN_FULL_TURRET``: La cantidad de municion en una torreta llena.
fr: ``AMMO_IN_FULL_TURRET`` : Le nombre de balle dont une tourelle pleine dispose.
ja: ``AMMO_IN_FULL_TURRET``: 砲塔の全弾薬量。
zh_cn: ``AMMO_IN_FULL_TURRET``:完整炮塔中的弹药数量。

source: ``AMMO_RELOAD_TIME``: The amount of time it takes the turret to reload.
de: ``AMMO_RELOAD_TIME``: Die Zeit, die der Geschützturm zum Nachladen benötigt.
es: ``AMMO_RELOAD_TIME``: La cantidad de tiempo necesaria para recargar la torreta.
fr: ``AMMO_RELOAD_TIME`` : Le temps qu'il faut pour qu'une tourelle recharge.
ja: ``AMMO_RELOAD_TIME``: 砲塔のリロードにかかる時間。
zh_cn: ``AMMO_RELOAD_TIME``:炮塔重装的时间。

source: ``ammo_reload_timer``: A variable for tracking how long the turret has been reloading.
de: ``ammo_reload_timer``: Eine Variable zum Verfolgen, wie lange der Geschützturm neu geladen wurde.
es: ``ammo_reload_timer``: Una variable para traquear cuanto tiempo la torreta ha estado recargando.
fr: ``ammo_reload_timer`` : Une variable utilisée pour le temps qu'a passer une tourelle a recharger.
ja: ``ammo_reload_timer``: 砲塔がリロードされている時間を追跡するための変数。
zh_cn: ``ammo_reload_timer``:一个变量，用于跟踪炮塔重装的时间。

source: ``current_target``: The turret's current target.
de: ``current_target``: Das aktuelle Ziel des Turms.
es: ``current_target``: El objetivo de la torreta en el momento.
fr: ``current_target`` : La cible courante de la tourelle.
ja: ``current_target``: 砲塔の現在のターゲット。
zh_cn: ``current_target``:炮塔的当前目标。

source: ``is_active``: A variable for tracking whether the turret is able to fire at the target.
de: ``is_active``: Eine Variable zum Verfolgen, ob der Geschützturm auf das Ziel schießen kann.
es: ``is_active``: Una variable para traquear si la torreta tiene la posibilidad de disparar a su objetivo.
fr: ``is_active`` : Une variable pour savoir si la tourelle peut tirer sur la cible ou non.
ja: ``is_active``: 砲塔が目標を射撃できるかどうかを追跡するための変数。
zh_cn: ``is_active``:用于跟踪炮塔是否能够射向目标的变量。

source: ``PLAYER_HEIGHT``: The amount of height we're adding to the target so we're not shooting at its feet.
de: ``PLAYER_HEIGHT``: Die Höhe die wir dem Ziel hinzufügen, damit wir nicht auf seine Füße schießen.
es: ``PLAYER_HEIGHT``: La altura que le añadimos al objetivo para que no estemos disparandole a sus pies.
fr: ``PLAYER_HEIGHT`` : La hauteur que nous ajoutons afin que la tourelle ne tire pas sur les pieds de la cible.
ja: ``PLAYER_HEIGHT``: 足元を狙らわないようにターゲットに加算する高さの量。
zh_cn: ``PLAYER_HEIGHT``:我们添加到目标的高度，所以我们不会在它的脚下射击。

source: ``smoke_particles``: A variable to hold the smoke particles node.
de: ``smoke_particles``: Eine Variable zum Halten des Rauchpartikel-Nodes.
es: ``smoke_particles``: Una variable para mantener el nodo de particulas de humo.
fr: ``smoke_particles`` : Une variable pour stocker les nœuds de particule de fumée.
ja: ``smoke_particles``: 煙のパーティクルノードを保持する変数。
zh_cn: ``smoke_particles``:用于保存烟雾粒子节点的变量。

source: ``turret_health``: The amount of health the turret currently has.
de: ``turret_health``: Die Menge an Gesundheit, die der Geschützturm derzeit hat.
es: ``turret_health``: La cantidad de vida que tiene la torreta en el momento.
fr: ``turret_health`` : La santé actuelle de la tourelle.
ja: ``turret_health``: 砲塔が現在持っている体力の量。
zh_cn: ``turret_health``:炮塔目前的健康状况。

source: ``MAX_TURRET_HEALTH``: The amount of health a fully healed turret has.
de: ``MAX_TURRET_HEALTH``: Die Menge an Gesundheit, die ein vollständig geheilter Geschützturm hat.
es: ``MAX_TURRET_HEALTH``: La cantidad de vida que una torreta al maximo de vida tiene.
fr: ``MAX_TURRET_HEALTH`` : La quantité de santé dont une tourelle intacte dispose.
ja: ``MAX_TURRET_HEALTH``: 完全に回復した状態の砲塔の体力の量。
zh_cn: ``MAX_TURRET_HEALTH``:完全愈合的炮塔的健康量。

source: ``DESTROYED_TIME``: The amount of time (in seconds) it takes for a destroyed turret to repair itself.
de: ``DESTROYED_TIME``: Die Zeit (in Sekunden) die ein zerstörter Geschützturm benötigt, um sich selbst zu reparieren.
es: ``DESTROYED_TIME``: La cantidad de tiempo (en segundos) que son necesarios para que una torreta destrozada se repare.
fr: ``DESTROYED_TIME`` : Le temps qu'il faut (en seconde) pour une tourelle détruite pour se réparer elle-même.
ja: ``DESTROYED_TIME``: 破壊された砲塔が自己修復するのにかかる時間(秒単位)。
zh_cn: ``DESTROYED_TIME``:被毁坏的炮塔修复自己所花费的时间(以秒为单位)。

source: ``destroyed_timer``: A variable for tracking the amount of time a turret has been destroyed.
de: ``destroyed_timer``: Eine Variable zum Verfolgen der Zeit, in der ein Geschützturm zerstört wurde.
es: ``destroyed_timer``: Una variable para monitorear la cantidad de tiempo en el que una torreta ha sido destruida.
fr: ``destroyed_timer`` : Une variable pour suivre le temps pendant lequel une tourelle a été détruite.
ja: ``destroyed_timer``: 砲塔が破壊された時間を追跡するための変数。
zh_cn: ``destroyed_timer``:一个变量，用于跟踪炮塔被摧毁的时间。

source: ``bullet_scene``: The bullet scene the turret fires (same scene as the player's pistol)
de: ``bullet_scene``: Die Geschoss-Szene, die der Geschützturm abfeuert (dieselbe Szene wie die Pistole des Spielers)
es: ``bullet_scene``: La escena de la bala que la torreta dispara (misma escena que la de la pistola del jugador)
fr: ``bullet_scene`` : La scène de la balle que doit tirer la tourelle (même scène que celle pour le pistolet du joueur)
ja: ``bullet_scene``: 砲塔が発射する弾丸のシーン(プレイヤーのピストルと同じシーン)
zh_cn: ``bullet_scene``:炮塔射击的子弹场景(与游戏角色的手枪相同的场景)

source: Whew, that's quite a few class variables!
de: Puh, das sind ganz schön viele Klassenvariablen!
es: Esas son unas cuantas variables!
fr: Hé bien, ça fait pas mal de variables de classes !
ja: ふう、これはかなりの数のクラス変数です！

source: Let's go through ``_ready`` next.
de: Lassen Sie uns als nächstes ``_ready`` durchgehen.
es: Pasemos al siguiente ``_ready``.
fr: Passons en revue ``_ready`` maintenant.
ja: 次に ``_ready`` を見ていきましょう。
zh_cn: 接下来我们来看看`_ready``。

source: Firstly, we get the vision area and connect the ``body_entered`` and ``body_exited`` signals to ``body_entered_vision`` and ``body_exited_vision``, respectively.
es: En primer lugar, obtenemos el área de visión y conectamos las señales de ``body_entered`` y ``body_exited`` a ``body_entered_vision`` y ``body_exited_vision``, respectivamente.
fr: Premièrement, nous allons récupérer la zone de vision et connecter les signaux ``body_entered`` et ``body_exited`` à ``body_entered_vision`` et ``body_exited_vision``, respectivement.
ja: まず、ビジョンエリアを取得し、\ ``body_entered`` および ``body_exited`` シグナルをそれぞれ ``body_entered_vision`` および ``body_exited_vision`` に接続します。

source: We then get all the nodes and assign them to their respective variables.
de: Wir erhalten dann alle Nodes und ordnen sie ihren jeweiligen Variablen zu.
es: Luego obtenemos todos los nodos y los asignamos a las respectivas variables.
fr: Nous récupérons ensuite tous les nœuds et nous les assignons à leur variables respectives.
ja: 次に、すべてのノードを取得し、それぞれの変数に割り当てます。

source: Next, we add some exceptions to the :ref:`Raycast <class_Raycast>` so the turret cannot hurt itself.
de: Als nächstes fügen wir einige Ausnahmen zu :ref:`Raycast <class_Raycast>` hinzu, damit sich der Turm nicht selbst verletzen kann.
es: A continuación, añadimos algunas excepciones a la :ref:`Raycast <clase_Raycast>` para que la torreta no pueda hacerse daño.
fr: Ensuite, nous ajoutons quelques exceptions au :ref:`Raycast <class_Raycast>` de façon à ce que la tourelle ne puisse pas se faire de dégâts.
ja: 次に、\ :ref:`Raycast <class_Raycast>` にいくつかの例外を追加して、砲塔がそれ自体を傷つけないようにします。

source: Then we make both flash meshes invisible at start, since we are not going to be firing during ``_ready``.
es: Entonces hacemos que ambas mallas de flash sean invisibles al principio, ya que no vamos a disparar durante el ``_ready``.
fr: Nous rendons ensuite les deux mesh de flash invisible au début car nous n'allons pas tirer pendant ``_ready``.
ja: 次に、\ ``_ ready`` の間は発射しないため、両方のフラッシュメッシュを開始時に非表示にします。
zh_cn: 然后我们在开始时使两个闪存网格都不可见，因为我们不会在“_ready”期间触发。
