Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/fps_tutorial/part_five.po
Languages: de, es, fr, ja, zh_cn

source: Part 5
de: Teil 5
es: Parte 5
fr: Partie 5
ja: パート5
zh_cn: 第5部分

source: Part overview
de: Teilübersicht
es: Resumen
fr: Aperçu cette partie
ja: パートの概要

source: In this part, we're going to add grenades to the player, give the player the ability to grab and throw objects, and add turrets!
de: In diesem Teil fügen wir dem Spieler Granaten hinzu, geben ihm die Möglichkeit, Objekte zu greifen und zu werfen, und fügen Geschütztürme hinzu!
es: ¡En esta parte, vamos a añadir granadas al jugador, darle la posibilidad de agarrar y lanzar objetos, y añadir torretas!
fr: Dans cette partie, nous allons ajouter des grenades au joueur, lui donner la capacité de lancer et attraper des objets et pour finir ajouter des tourelles !
ja: このパートでは、プレイヤーに手榴弾を追加し、プレイヤーにオブジェクトをつかんで投げる能力を与え、砲塔を追加します！

source: You are assumed to have finished :ref:`doc_fps_tutorial_part_four` before moving on to this part of the tutorial. The finished project from :ref:`doc_fps_tutorial_part_four` will be the starting project for part 5
de: Es wird davon ausgegangen, dass Sie :ref:`doc_fps_tutorial_part_four` beendet haben, bevor Sie mit diesem Teil der Anleitung fortfahren. Das fertige Projekt aus :ref:`doc_fps_tutorial_part_four` wird das Startprojekt für Teil 5 sein.
es: Se supone que has terminado :ref:`doc_fps_tutorial_part_four` antes de pasar a esta parte del tutorial. El proyecto terminado de :ref:`doc_fps_tutorial_part_four` será el proyecto inicial de la parte 5
fr: Vous êtes supposé avoir terminé :ref:`doc_fps_tutorial_part_four` avant de passer à cette partie du tutoriel. Le projet fini de :ref:`doc_fps_tutorial_part_four` sera le projet de départ de la partie 5
ja: チュートリアルのこの部分に進む前に、\ :ref:`doc_fps_tutorial_part_four` を終了していることが前提となります。\ :ref:`doc_fps_tutorial_part_four` からの完成したプロジェクトは、パート5の開始プロジェクトになります
zh_cn: 在继续本教程的这一部分之前，我们假设您已经完成了 :ref:`doc_fps_tutorial_part_four`。 完成的项目来自 :ref:`doc_fps_tutorial_part_four`将成为第5部分的起始项目

source: Let's get started!
de: Lassen Sie uns anfangen!
es: ¡Vamos a empezar!
fr: Commençons tout de suite !
ja: では、始めましょう！
zh_cn: 让我们开始吧！

source: Adding grenades
de: Hinzufügen von Granaten
es: Añadir granadas
fr: Ajouter les grenades
ja: 手榴弾の追加
zh_cn: 添加手榴弹

source: Firstly, let's give the player some grenades to play with. Open up ``Grenade.tscn``.
de: Zuerst geben wir dem Spieler ein paar Granaten zum Spielen. Öffnen Sie ``Grenade.tscn``.
es: En primer lugar, démosle al jugador algunas granadas para jugar. Abre ``Grenada.tscn``.
fr: Tout d'abord, donnons au joueur quelques grenades avec lesquelles jouer. Ouvrez ``Grenade.tscn``.
ja: まず、プレイヤーに手榴弾をいくつか与えてみましょう。\ ``Grenade.tscn`` を開きます。

source: There are a few things to note here, the first and foremost being that the grenades are going to use :ref:`RigidBody <class_RigidBody>` nodes. We're going to use :ref:`RigidBody <class_RigidBody>` nodes for our grenades so they bounce around the world in a (somewhat) realistic manner.
de: Es gibt hier ein paar Dinge zu beachten, wobei das erste und wichtigste ist, dass die Granaten :ref:`RigidBody <class_RigidBody>` Nodes verwenden werden. Wir werden :ref:`RigidBody <class_RigidBody>` Nodes für unsere Granaten verwenden, damit sie auf eine (etwas) realistische Art und Weise durch die Welt hüpfen.
es: Hay algunas cosas a tener en cuenta aquí, la primera y más importante es que las granadas van a usar nodos :ref:`RigidBody <class_RigidBody>`. Vamos a usar nodos :ref:`RigidBody <class_RigidBody>` para nuestras granadas para que reboten alrededor del mundo de una manera (algo) realista.
fr: Il y a quelques points à noter ici, le premier et le plus important étant que les grenades vont utiliser des nœuds :ref:`RigidBody <class_RigidBody>`. Nous allons utiliser des nœuds :ref:`RigidBody <class_RigidBody>` pour nos grenades de façon à ce qu'elles rebondissent dans le monde de façon (à peu près) réaliste.
ja: ここで注意すべき点がいくつかあります。何よりもまず、手榴弾が :ref:`RigidBody <class_RigidBody>` ノードを使用することです。 手榴弾に :ref:`RigidBody <class_RigidBody>` ノードを使用して、(やや)現実的な方法で世界中をバウンドさせます。

source: The second thing to note is ``Blast_Area``. This is an :ref:`Area <class_Area>` node that will represent the blast radius of the grenade.
de: Die zweite Sache, die man beachten muss, ist ``Blast_Area``. Dies ist ein :ref:``Area <class_Area>` Node, der den Sprengradius der Granate darstellt.
es: La segunda cosa que hay que tener en cuenta es ``Blast_Area``. Este es un nodo :ref:`Area <class_Area>` que representará el radio de la explosión de la granada.
fr: La seconde chose à noter est ``Blast_Area``. C'est un nœud :ref:`Area <class_Area>` qui va représenter le rayon d'explosion de la grenade.
ja: 2番目に注意することは ``Blast_Area`` です。 これは :ref:`Area <class_Area>` ノードで、手榴弾の爆発半径を表します。
zh_cn: 第二点需要注意的是 ``Blast_Area``。 这是一个 :ref:`Area <class_Area>` 节点，它代表手榴弹的爆炸半径。

source: Finally, the last thing to note is ``Explosion``. This is the :ref:`Particles <class_Particles>` node that will emit an explosion effect when the grenade explodes. One thing to note here is that we have ``One shot`` enabled. This is so we emit all the particles at once. The particles are also emitted using world coordinates instead of local coordinates, so we have ``Local Coords`` unchecked as well.
de: Schließlich ist als letztes die ``Explosion`` zu erwähnen. Dies ist der :ref:`Partikel <class_Particles>`-Node, der einen Explosionseffekt emittiert, wenn die Granate explodiert. Eine Sache die man hier erwähnen sollte ist, dass wir ``One shot`` aktiviert haben. Damit emittieren wir alle Partikel auf einmal. Die Partikel werden auch unter Verwendung von Weltkoordinaten anstelle von lokalen Koordinaten emittiert, daher haben wir die ``Local Coords`` nicht angekreuzt.
es: Finalmente, lo último que hay que notar es ``Explosion``. Este es el nodo :ref:`Particles <class_Particles>` que emitirá un efecto de explosión cuando la granada explote. Una cosa a tener en cuenta aquí es que tenemos ``One shot`` activado. Esto es para que emitamos todas las partículas a la vez. Las partículas también se emiten usando coordenadas mundiales en lugar de locales, así que también tenemos las ``Local Coords`` desmarcadas.
fr: Enfin, la dernière chose à explorer est ``Explosion``. C'est un nœud :ref:`Particles <class_Particles>` qui va émettre un effet d'explosion quand la grenade va exploser. One chose à noter ici, c'est que nous avons activé ``One shot``. Cela fait en sorte que nous émettions toutes les particules à fois. Les particules sont émises en utilisant les coordonnées du monde et non pas des coordonées locales, c'est pour cela que nous avons décoché ``Local Coords``.
ja: 最後に、最終的に注意することは ``爆発`` です。 これは :ref:`Particles <class_Particles>` ノードで、手榴弾が爆発すると爆発効果を発します。ここで注意すべきことは、\ ``One shot`` が有効になっていることです。 これは、すべてのパーティクルを一度に放出するためです。 パーティクルは、ローカル座標の代わりにワールド座標を使用して放出されるため、\ ``Local Coords`` もチェックされていません。

source: If you want, you can see how the particles are set up by looking through the particle's ``Process Material`` and ``Draw Passes``.
de: Wenn Sie wollen können Sie sich anschauen, wie die Partikel aufgebaut sind, indem Sie durch die ``Process Material`` und ``Draw Passes`` des Partikels schauen.
es: Si quieres, puedes ver como las partículas están organizadas mirando a través del ``Process Material`` y ``Draw Passes`` de las partículas.
fr: Si vous le voulez, vous pouvez voir comment les particules sont paramétrés en regardant dans ``Process Material`` et ``Draw Passes`` des particules.
ja: 必要に応じて、パーティクルの ``Process Material`` と ``Draw Passes`` を調べることで、パーティクルの設定方法を確認できます。
zh_cn: 如果需要，您可以通过查看粒子的“过程材质”和“绘制过程”来查看粒子是如何设置的。

source: Let's write the code needed for the grenade. Select ``Grenade`` and make a new script called ``Grenade.gd``. Add the following:
de: Lassen Sie uns den für die Granate benötigten Code schreiben. Wählen Sie ``Grenade`` aus und erstellen ein neues Skript namens ``Grenade.gd``. Fügen Sie das Folgende hinzu:
es: Escribamos el código necesario para la granada. Selecciona ``Grenade`` y haz un nuevo script llamado ``Grenade.gd``. Añade lo siguiente:
fr: Écrivons le code nécessaire pour les grenades. Sélectionnez ``Grenade`` et créez un nouveau script appelé ``Grenade.gd``. Ajoutez ce qui suit :
ja: 手榴弾に必要なコードを書きましょう。\ ``Grenade`` を選択し、\ ``Grenade.gd`` という新しいスクリプトを作成します。次のように追加します:
zh_cn: 让我们编写手榴弹所需的代码。 选择 ``Grenade`` 并制作一个名为 ``Grenade.gd`` 的新脚本。 添加以下内容:

source: Let's go over what's happening, starting with the class variables:
de: Gehen wir das Geschehene durch, beginnend mit den Klassenvariablen:
es: Repasemos lo que está pasando, comenzando con las variables de clase:
fr: Faisons le point sur ce qui se passe, en commençant par les variables de classe :
ja: クラス変数から始めて、何が起こっているのかを見てみましょう:
zh_cn: 让我们回顾一下正在发生的事情，从类变量开始:

source: ``GRENADE_DAMAGE``: The amount of damage the grenade causes when it explodes.
de: ``GRENADE_DAMAGE``: Die Höhe des Schadens, den die Granate verursacht, wenn sie explodiert.
es: ``GRENADE_DAMAGE``: La cantidad de daño que la granada causa cuando explota.
fr: ``GRENADE_DAMAGE`` : Le montant de dégâts qu'inflige les grenades quand elles explosent.
ja: ``GRENADE_DAMAGE``: 手榴弾が爆発したときに与えるダメージの量。
zh_cn: ``GRENADE DAMAGE``:手榴弹爆炸时造成的伤害量。

source: ``GRENADE_TIME``: The amount of time the grenade takes (in seconds) to explode once it's created/thrown.
de: ``GRENADE_TIME``: Die Zeitspanne (in Sekunden), welche die Granate braucht, um zu explodieren, sobald sie gespawned/geworfen wurde.
es: ``GRENADE_TIME``: La cantidad de tiempo que la granada tarda (en segundos) en explotar una vez que es creada/tirada.
fr: ``GRENADE_TIME`` : Le temps que la grenade met (en secondes) pour exploser une fois qu'elle est créée/jetée.
ja: ``GRENADE_TIME``: 手榴弾が作成/投擲されてから爆発するまでにかかる時間(秒単位)。
zh_cn: ``GRENADE_TIME``:手榴弹在创建/抛出后爆炸所需的时间(以秒为单位)。

source: ``grenade_timer``: A variable for tracking how long the grenade has been created/thrown.
de: ``grenade_timer``: Eine Variable zur Verfolgung, wie lange die Granate schon erstellt bzw. geworfen wurde.
es: ``grenade_timer``: Una variable para rastrear cuánto tiempo la granada ha sido creada/tirada.
fr: ``grenade_timer`` : Une variable utilisée pour savoir depuis combien de temps la grenade a été créée/jetée.
ja: ``grenade_timer``: 手榴弾が作成/投擲された時間を追跡する変数。
zh_cn: ``grenade_timer``:一个变量，用于跟踪手榴弹被创建/抛出的时间。

source: ``EXPLOSION_WAIT_TIME``: The amount of time needed (in seconds) to wait before we destroy the grenade scene after the explosion
de: ``EXPLOSION_WAIT_TIME``: Die Zeitspanne (in Sekunden), die wir warten müssen, bevor wir die Granatenszene nach der Explosion zerstören
es: ``EXPLOSION_WAIT_TIME``: La cantidad de tiempo necesario (en segundos) para esperar antes de destruir la escena de la granada después de la explosión
fr: ``EXPLOSION_WAIT_TIME`` : Le temps nécessaire (en seconde) d'attente avant que nous détruisions la scène de la grenade après l'explosion
ja: ``EXPLOSION_WAIT_TIME``: 爆発後に手榴弾シーンを破棄する前に待機するために必要な時間(秒単位)
zh_cn: ``EXPLOSION_WAIT_TIME``:爆炸后我们摧毁手榴弹场景所需的等待时间(以秒为单位)

source: ``explosion_wait_timer``: A variable for tracking how much time has passed since the grenade exploded.
de: ``explosion_wait_timer``: Eine Variable zur Verfolgung, wie viel Zeit seit der Explosion der Granate vergangen ist.
es: ``explosion_wait_timer``: Una variable para rastrear cuánto tiempo ha pasado desde que la granada explotó.
fr: ``explosion_wait_timer`` : Une variable utilisée pour suivre le temps passé après que l'explosion soit arrivée.
ja: ``explosion_wait_timer``: 手榴弾が爆発してから経過した時間を追跡する変数。
zh_cn: ``explosion_wait_timer``:一个变量，用于跟踪自手榴弹爆炸以来已经过了多少时间。

source: ``rigid_shape``: The :ref:`CollisionShape <class_CollisionShape>` for the grenade's :ref:`RigidBody <class_RigidBody>`.
de: ``rigid_shape``: Die :ref:`CollisionShape <class_CollisionShape>` für den :ref:`RigidBody <class_RigidBody>` der Granate.
es: ``rigid_shape``: La :ref:`CollisionShape <clase_CollisionShape>` para la granada :ref:`RigidBody <clase_RigidBody>`.
fr: ``rigid_shape`` : La :ref:`CollisionShape <class_CollisionShape>` pour le :ref:`RigidBody <class_RigidBody>` de la grenade.
ja: ``rigid_shape``: 手榴弾の :ref:`RigidBody <class_RigidBody>` の :ref:`CollisionShape <class_CollisionShape>`\ 。
zh_cn: ``rigid_shape``: :ref:`CollisionShape <class_CollisionShape>` 用于手榴弹 :ref:`RigidBody <class_RigidBody>`。

source: ``grenade_mesh``: The :ref:`MeshInstance <class_MeshInstance>` for the grenade.
de: ``grenade_mesh``: Die :ref:`MeshInstanz <class_MeshInstanz>` für die Granate.
es: ``grenade_mesh``: La :ref:``MeshInstance <class_MeshInstance>` para la granada.
fr: ``grenade_mesh`` : La :ref:`MeshInstance <class_MeshInstance>` pour la grenade.
ja: ``grenade_mesh``: 手榴弾の :ref:`MeshInstance <class_MeshInstance>`\ 。
zh_cn: ``grenade_mesh``:手榴弹的参考 :ref:`MeshInstance <class_MeshInstance>` 。

source: ``blast_area``: The blast :ref:`Area <class_Area>` used to damage things when the grenade explodes.
de: ``blast_area``: Die :ref:`Area <class_Area>`, also der genutzte Bereich um Dinge zu beschädigen, wenn die Granate explodiert.
es: ``blast_area``: La explosión :ref:``Area <class_Area>` usada para dañar cosas cuando la granada explota.
fr: ``blast_area`` : La :ref:`Area <class_Area>` de l'explosion utilisée pour faire des dégâts aux objets quand la grenade explose.
ja: ``blast_area``: blast :ref:`Area <class_Area>`は、手榴弾が爆発したときに物を損傷するために使用されます。
zh_cn: ``blast_area``:爆炸 :ref:`Area <class_Area>` 用于在手榴弹爆炸时损坏东西。

source: ``explosion_particles``: The :ref:`Particles <class_Particles>` that come out when the grenade explodes.
de: ``explosion_particles``: Die :ref:``Particles <class_Particles>`, die herauskommen, wenn die Granate explodiert.
es: ``explosion_particles``: Las :ref:``Particles <class_Particles>` que salen cuando la granada explota.
fr: ``explosion_particles`` : Les :ref:`Particles <class_Particles>` qui sortent quand les grenades explosent.
ja: ``explosion_particles``: 手榴弾が爆発したときに出てくる :ref:`Particles <class_Particles>`\ 。

source: Notice how ``EXPLOSION_WAIT_TIME`` is a rather strange number (``0.48``). This is because we want ``EXPLOSION_WAIT_TIME`` to be equal to the length of time the explosion particles are emitting, so when the particles are done we destroy/free the grenade. We calculate ``EXPLOSION_WAIT_TIME`` by taking the particle's life time and dividing it by the particle's speed scale. This gets us the exact time the explosion particles will last.
de: Beachte, dass ``EXPLOSION_WAIT_TIME`` eine ziemlich seltsame Zahl ist (``0.48``). Das liegt daran, dass wir wollen, dass ``EXPLOSION_WAIT_TIME`` gleich der Zeitspanne ist, in der die Explosionspartikel emittiert werden, so dass wir die Granate zerstören/befreien, wenn die Partikel fertig sind. Wir berechnen die ``EXPLOSION_WAIT_TIME``, indem wir die Lebensdauer des Partikels nehmen und sie durch die Geschwindigkeitsgröße des Partikels teilen. Dadurch erhalten wir die genaue Zeit, die die Explosionspartikel dauern werden.
es: Fíjate en cómo ``EXPLOSION_WAIT_TIME`` es un número bastante extraño (``0.48``). Esto se debe a que queremos que ``EXPLOSION_WAIT_TIME`` sea igual al tiempo que las partículas de la explosión están emitiendo, así que cuando las partículas terminen, destruimos/liberamos la granada. Calculamos el ``EXPLOSION_WAIT_TIME`` tomando el tiempo de vida de la partícula y dividiéndolo por la escala de velocidad de la partícula. Esto nos da el tiempo exacto que durarán las partículas de la explosión.
fr: Remarquez comme ``EXPLOSION_WAIT_TIME`` est un nombre assez atypique (``0.48``). C'est parce que nous voulons que ``EXPLOSION_WAIT_TIME`` soit égal à la durée d'émission des particules d'explosion, donc quand les particules disparaissent, nous détruisons les grenades. On calcule ``EXPLOSION_WAIT_TIME`` en prenant la durée de vie de la particule et en la divisant par l'échelle de vitesse de la particule. Cela nous donnera la durée de vie exacte des particules.
ja: ``EXPLOSION_WAIT_TIME`` がかなり奇妙な数字(``0.48``)であることに注意してください。 これは、\ ``EXPLOSION_WAIT_TIME`` を爆発パーティクルが放出される時間の長さに等しくしたいため、パーティクルが完了すると手榴弾を破棄/解放するためです。 パーティクルの寿命を取得し、それをパーティクルの速度スケールで割ることにより、\ ``EXPLOSION_WAIT_TIME`` を計算します。 これにより、爆発パーティクルが持続する正確な時間がわかります。
zh_cn: 注意 ``EXPLOSION_WAIT_TIME`` 是一个相当奇怪的数字(``0.48``)。 这是因为我们希望 ``EXPLOSION_WAIT_TIME`` 等于爆炸粒子发射的时间长度，所以当粒子完成时我们会摧毁/释放手榴弹。 我们通过获取粒子的生命时间并将其除以粒子的速度刻度来计算“EXPLOSION_WAIT_TIME”。 这让我们得到了爆炸粒子持续的确切时间。

source: Now let's turn our attention to ``_ready``.
de: Wenden wir nun unsere Aufmerksamkeit auf ``_ready``.
es: Ahora pongamos nuestra atención en ``_ready``.
fr: Concentrons maintenant notre attention sur ``_ready``.
ja: それでは、\ ``_ ready`` に注目しましょう。
zh_cn: 现在让我们把注意力转向 ``_ready`` 。

source: First we get all the nodes we'll need and assign them to the proper class variables.
de: Zuerst besorgen wir uns alle Nodes, die wir benötigen, und weisen sie den richtigen Klassenvariablen zu.
es: Primero obtenemos todos los nodos que necesitaremos y los asignamos a las variables de clase apropiadas.
fr: Tout d'abord, nous récupérons tous les nœuds dont nous avons besoin et nous les assignons aux bonnes variables de classe.
ja: まず、必要なすべてのノードを取得し、適切なクラス変数に割り当てます。

source: We need to get the :ref:`CollisionShape <class_CollisionShape>` and :ref:`MeshInstance <class_MeshInstance>` because similarly to the target in :ref:`doc_fps_tutorial_part_four`, we will be hiding the grenade's mesh and disabling the collision shape when the grenade explodes.
es: Necesitamos obtener la :ref:`CollisionShape <class_CollisionShape>` y :ref:`MeshInstance <class_MeshInstance>` porque de manera similar al objetivo en :ref:`doc_fps_tutorial_part_four`, estaremos ocultando la malla de la granada y desactivando la forma de colisión cuando la granada explote.
fr: Nous avons besoin de récupérer la :ref:`CollisionShape <class_CollisionShape>` et la :ref:`MeshInstance <class_MeshInstance>` car de la même façon que dans la :ref:`doc_fps_tutorial_part_four`, nous aurons besoin de cacher la mesh des grenades et de désactiver les collision shapes quand les grenades vont exploser.
ja: :ref:`CollisionShape <class_CollisionShape>` と:ref:`MeshInstance <class_MeshInstance>` を取得する必要があります。\ :ref:`doc_fps_tutorial_part_four` のターゲットと同様に、手榴弾の爆発時に手榴弾のメッシュを非表示にし、コリジョンシェイプを無効にするためです。
zh_cn: 我们需要得到 :ref:`CollisionShape <class_CollisionShape>` 和 :ref:`MeshInstance <class_MeshInstance>` 因为类似于 :ref:`doc_fps_tutorial_part_four`中的目标，我们将隐藏手榴弹的网格并禁用碰撞形状 手榴弹爆炸了。

source: The reason we need to get the blast :ref:`Area <class_Area>` is so we can damage everything inside it when the grenade explodes. We'll be using code similar to the knife code in the player. We need the :ref:`Particles <class_Particles>` so we can emit particles when the grenade explodes.
es: La razón por la que necesitamos la explosión :ref:`Area <class_Area>` es para que podamos dañar todo lo que hay dentro cuando la granada explote. Usaremos un código similar al código de los cuchillos del jugador. Necesitamos el :ref:`Particles <class_Particles>` para poder emitir partículas cuando la granada explote.
fr: La raison pour laquelle nous devons récupérer la :ref:`Area <class_Area>` de l'explosion est parce que nous allons faire des dégâts à tous les éléments présents dans la zone quand la grenade va exploser. Nous allons utiliser un code similaire à celui du couteau dans le joueur. Nous avons besoin des :ref:`Particles <class_Particles>` de façon à pouvoir émettre des particules quand les grenades vont exploser.
ja: blast :ref:`Area <class_Area>` を取得する必要があるのは、手榴弾が爆発したときにその内部のすべてを破損できるようにするためです。 プレイヤーのナイフコードに似たコードを使用します。手榴弾が爆発したときにパーティクルを放出できるように、\ :ref:`Particles <class_Particles>` が必要です。
zh_cn: 我们需要获得爆炸的原因 :ref:`Area <class_Area>` 这样我们可以在手榴弹爆炸时损坏其内部的一切。 我们将使用与游戏角色中的刀代码类似的代码。 我们需要 :ref:`Particles <class_Particles>` 所以我们可以在手榴弹爆炸时发射粒子。

source: After we get all the nodes and assign them to their class variables, we then make sure the explosion particles are not emitting, and that they are set to emit in one shot. This is to be extra sure the particles will behave the way we expect them to.
es: Después de obtener todos los nodos y asignarlos a sus variables de clase, nos aseguramos de que las partículas de la explosión no emitan, y que estén preparadas para emitir una sola vez. Esto es para estar más seguros de que las partículas se comportarán como esperamos que lo hagan.
fr: après avoir récupéré tous les nœuds et les avoir assignés à leur variables de classe, on s'assure alors que les particules d'explosions ne sont pas émises et qu'elles sont paramétrés sur ``One shot``. C'est une précaution pour s'assurer qu'elles se comporte comme elles le devrait.
ja: すべてのノードを取得し、それらをクラス変数に割り当てた後、爆発パーティクルが放出されていないこと、およびそれらがワンショットで放出されるように設定されていることを確認します。 これは、パーティクルが期待どおりに動作することをさらに確実にするためです。

source: Now let's look at ``_process``.
de: Lassen Sie uns jetzt ``_process`` anschauen.
es: Ahora veamos el ``_process``.
fr: Regardons maintenant ``_process``.
ja: それでは、\ ``_process`` を見てみましょう。
zh_cn: 现在让我们来看看`_process``。

source: Firstly, we check to see if the ``grenade_timer`` is less than ``GRENADE_TIME``. If it is, we add ``delta`` and return. This is so the grenade has to wait ``GRENADE_TIME`` seconds before exploding, allowing the :ref:`RigidBody <class_RigidBody>` to move around.
es: Primero, comprobamos si el ``grenade_timer`` es menor que el ``GRENADE_TIME``. Si lo es, añadimos ``delta`` y volvemos. Esto es para que la granada tenga que esperar ``GRENADE_TIME`` segundos antes de explotar, permitiendo que el :ref:`RigidBody <class_RigidBody>` se mueva.
fr: Premièrement, nous vérifions que ``grenade_timer`` est inférieur à ``GRENADE_TIME``. Si c'est le cas, on ajoute ``delta`` et on le renvoi. De cette façon, les grenades vont devoir attendre ``GRENADE_TIME`` secondes avant d'exploser, permettant au :ref:`RigidBody <class_RigidBody>` de pouvoir se déplacer autour.
ja: まず、\ ``grenade_timer`` が ``GRENADE_TIME`` よりも小さいかどうかを確認します。もしそうなら、\ ``delta`` を加算して戻ります。 これは、手榴弾が爆発する前に ``GRENADE_TIME`` 秒待たなければならず、\ :ref:`RigidBody <class_RigidBody>` が動き回れるようにするためです。

source: If ``grenade_timer`` is at ``GRENADE_TIMER`` or higher, we then need to check if the grenade has waited long enough and needs to explode. We do this by checking to see if ``explosion_wait_timer`` is equal to ``0`` or less. Since we will be adding ``delta`` to ``explosion_wait_timer`` right after, whatever code under the check will only be called once, right when the grenade has waited long enough and needs to explode.
es: Si ``grenade_timer`` está at ``GRENADE_TIMER`` o más alto, tenemos que comprobar si la granada ha esperado lo suficiente y necesita explotar. Lo hacemos comprobando si ``explosion_wait_timer`` es igual a ``0`` o menos. Como añadiremos ``Delta`` a ``explosion_wait_timer`` justo después, cualquier código que se compruebe sólo se llamará una vez, justo cuando la granada haya esperado lo suficiente y necesite explotar.
fr: Si ``grenade_timer`` est supérieur ou égal à ``GRENADE_TIMER``, nous vérifions alors si la grenade a attendu suffisamment longtemps pour exploser. On fait cela en vérifiant si ``explosion_wait_timer`` est égal à ``0`` ou moins. Étant donné que nous allons ajouter ``delta`` à ``explosion_wait_timer`` juste après, le code juste en dessous de cette vérification va être appelé une fois uniquement, juste quand la grenade a attendu suffisamment longtemps et doit exploser.
ja: ``grenade_timer`` が ``GRENADE_TIMER`` 以上の場合、手榴弾が十分に長く待機していて爆発する必要があるかどうかを確認する必要があります。 これを行うには、\ ``explosion_wait_timer`` が ``0`` 以下であるかどうかを確認します。 直後に ``delta`` を ``explosion_wait_timer`` に追加するため、チェック対象のコードは、手榴弾が十分に長く待機して爆発する必要があるときに1回だけ呼び出されます。
zh_cn: 如果 ``grenade_timer`` 位于 ``GRENADE_TIMER`` 或更高，那么我们需要检查手榴弹是否等待了足够长的时间并且需要爆炸。 我们通过检查 ``explosion_wait_timer`` 是否等于 ``0`` 或更少来做到这一点。 因为我们将立即将 ``delta`` 添加到 ``explosion_wait_timer`` ，所以检查下的任何代码只会被调用一次，就在手榴弹等待足够长并且需要爆炸时。
