Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/development/cpp/configuring_an_ide/kdevelop.po
Languages: de

source: `KDevelop <https://www.kdevelop.org>`_ is a free, open source IDE for all desktop platforms.
de: `KDevelop <https://www.kdevelop.org>`_ ist eine freie, quelloffene IDE für alle Desktop-Plattformen.

source: Importing the project
de: Projekt importieren

source: From the KDevelop's main screen select **Open Project**.
de: Wählen Sie auf dem Hauptbildschirm von KDevelop **Projekt öffnen**.

source: KDevelop's main screen.
de: KDevelop's Hauptbildschirm.

source: Navigate to the Godot root folder and select it.
de: Navigieren Sie zum Godot-Wurzelordner und wählen Sie ihn aus.

source: On the next screen, choose **Custom Build System** for the **Project Manager**.
de: Wählen Sie im nächsten Bildschirm **Benutzerdefiniertes Build-System** für den **Projektmanager**.

source: After the project has been imported, open the project configuration by right-clicking on it in the **Projects** panel and selecting **Open Configuration..** option.
de: Öffnen Sie nach dem Importieren des Projekts die Projektkonfiguration, indem Sie im Bereich ** Projekte ** rechtsklicken und die Option ** Konfiguration öffnen .. ** auswählen.

source: Under **Language Support** open the **Includes/Imports** tab and add the following paths:
de: Öffnen Sie unter **Sprachunterstützung** die Registerkarte **Includes/Imports** und fügen Sie die folgenden Pfade hinzu:

source: Apply the changes.
de: Übernehmen Sie die Änderungen.

source: Under **Custom Build System** add a new build configuration with the following settings:
de: Fügen Sie unter **Benutzerdefiniertes Build-System** eine neue Build-Konfiguration mit den folgenden Einstellungen hinzu:

source: Build Directory
de: Build-Verzeichnis

source: *blank*
de: *leer*

source: Enable
de: Aktivieren

source: **True**
de: **Wahr**

source: Executable
de: ausführbar

source: Arguments
de: Argumente

source: See :ref:`doc_introduction_to_the_buildsystem` for a full list of arguments.
de: Siehe :ref:`doc_introduction_to_the_buildsystem` für eine komplette Liste aller Argumente.

source: Apply the changes and close the configuration window.
de: Übernehmen Sie die Änderungen und schließen Sie das Konfigurationsfenster.

source: Debugging the project
de: Debuggen des Projekts

source: Select **Run > Configure Launches...** from the top menu.
de: Wählen Sie **Ausführen > Starts konfigurieren...** aus dem oberen Menü.

source: Click **Add** to create a new launch configuration.
de: Klicken Sie auf **Hinzufügen**, um eine neue Startkonfiguration zu erstellen.

source: Select **Executable** option and specify the path to your executable located in the ``<Godot root directory>/bin`` folder. The name depends on your build configuration, e.g. ``godot.x11.tools.64`` for 64-bit X11 platform with ``tools`` enabled.
de: Wählen Sie die Option ** Ausführbare Datei ** und geben Sie den Pfad zu Ihrer ausführbaren Datei im Ordner `` <Godot-Stammverzeichnis> / bin`` an. Der Name hängt von Ihrer Build-Konfiguration ab, z. `` godot.x11.tools.64`` für 64-Bit-X11-Plattform mit aktivierten `` tools``.

source: If you run into any issues, ask for help in one of `Godot's community channels <https://godotengine.org/community>`__.
de: Wenn Sie auf Probleme stoßen, bitten Sie um Hilfe in einem von `Godots Community-Kanälen <https://godotengine.org/community>`__.
