Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/development/cpp/configuring_an_ide/visual_studio.po
Languages: fr

source: Setup
fr: Configuration

source: To start developing with Visual Studio, follow these steps:
fr: Pour commencer à développer avec Visual Studio, suivez ces étapes :

source: Open the Visual Studio Installer and install the C++ package:
fr: Ouvrez l'installeur Visual Studio et installez le paquet C++ :

source: Open a Command Prompt or PowerShell window, use ``cd`` to reach the Godot source directory and run ``scons platform=windows vsproj=yes``.
fr: Ouvrez une invite de commande ou une fenêtre PowerShell et utilisez la commande ``cd`` pour atteindre le répertoire source de Godot et lancer la commande ``scons platform=windows vsproj=yes``.

source: Now open the Godot folder by clicking **Open a project or solution** and choose ``godot.sln``. - You can also double-click the ``godot.sln`` file in Explorer.
fr: Maintenant, ouvrez le dossier Godot en cliquant sur **Ouvrir un projet ou une solution** et choisissez ``godot.sln``. - Vous pouvez également double-cliquer sur le fichier ``godot.sln`` dans l'explorateur.

source: You can now start developing with Visual Studio.
fr: Vous pouvez maintenant commencer à développer avec Visual Studio.

source: Debugging
fr: Débogage

source: Visual Studio features a powerful debugger. This allows the user to examine Godot's source code, stop at specific points in the code, make changes, and view them on the run.
fr: Visual Studio dispose d'un puissant débogueur. Il permet à l'utilisateur d'examiner le code source de Godot, de s'arrêter à des points précis du code, de faire des modifications et de les visualiser en cours de route.

source: Debugging the Godot Engine inside the editor will require an extra setup step.
fr: Le déboguer Godot dans l'éditeur nécessitera une étape de configuration supplémentaire.

source: Because opening Godot opens the Project Manager at first instead of the project you're working on, the debugger will detach as soon as you open a project. This means that the debugger will stop, even though Godot is still running in another process.
fr: Comme l'ouverture de Godot ouvre d'abord le gestionnaire de projet au lieu du projet sur lequel vous travaillez, le débogueur se détache dès que vous ouvrez un projet. Cela signifie que le débogueur s'arrêtera, même si Godot est encore en cours d'exécution dans un autre processus.

source: To overcome this, you need to edit the debugging command line arguments in VS. In your project, click **Project > Project Properties**:
fr: Pour modifier ce comportement, vous devez modifier les arguments de la ligne de commande de débogage dans VisualStudio. Dans votre projet, cliquez sur **Projet > Propriétés du projet** :

source: Then add this to the command arguments:
fr: Ensuite, ajoutez ceci aux arguments de la commande :

source: The ``-e`` flag is for entering the editor directly (which skips the Project Manager).
fr: Le drapeau ``-e`` permet d'entrer directement dans l'éditeur (sans passer par le manager de projet).

source: The ``--path`` argument should be an *absolute* path to a project directory (not a `project.godot` file).
fr: L'argument ``--path`` doit être un chemin *absolu* vers un répertoire du projet (et non un fichier `project.godot`).

source: To learn more about command line arguments, refer to the :ref:`command line tutorial <doc_command_line_tutorial>`.
fr: Pour en savoir plus sur les arguments de la ligne de commande, reportez-vous au :ref:`tutoriel de la ligne de commande <doc_command_line_tutorial>`.

source: To check that everything is working, put a breakpoint in ``main.cpp`` and press F5 to start debugging.
fr: Pour vérifier que tout fonctionne, mettez un breakpoint dans ``main.cpp`` et appuyez sur F5 pour commencer le débogage.
