Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_advanced.po
Languages: es, fr, ko, pl, pt_br, ru, uk

source: This way, everything that can be smashed by a rock would have to inherit Smashable. If a character, enemy, piece of furniture, small rock were all smashable, they would need to inherit from the class Smashable, possibly requiring multiple inheritance. If multiple inheritance was undesired, then they would have to inherit a common class like Entity. Yet, it would not be very elegant to add a virtual method ``smash()`` to Entity only if a few of them can be smashed.
es: De esta manera, todo lo que pueda ser aplastado por una roca tendrá que heredar Smashable. Si un personaje, un enemigo, un mueble o una pequeña roca se pudieran destruir, tendrían que heredar de la clase Smashable, lo que posiblemente requeriría una herencia múltiple. Si la herencia múltiple no era deseada, entonces tendrían que heredar una clase común como Entity. Sin embargo, no sería muy elegante añadir un método virtual ``smash()`` a Entity sólo si unos pocos de ellos pueden ser aplastados.
fr: De cette façon, tout ce qui peut être brisé par une pierre devrait hériter de Smashable. Si un personnage, un ennemi, un meuble, un meuble, une petite pierre étaient tous écrasables, ils auraient besoin d'hériter de la classe Smashable, ce qui pourrait nécessiter un héritage multiple. Si l'héritage multiple n'était pas désiré, alors ils devraient hériter d'une classe commune comme Entity. Pourtant, il ne serait pas très élégant d'ajouter une méthode virtuelle ``smash()``à Entity seulement si quelques-uns d'entre eux peuvent être écrasés.
ko: 이 방법은, 바위에 의해 박살날 수 있는 모든 것들은 Smashable(박살날 수 있음)을 상속해야 합니다. 캐릭터, 적, 가구의 일부, 작은 돌들은 모두 박살날 수 있고, 그들은 클래스 Smashable로 부터 상속해야 하고, 거기에 다중 상속이 필요할 수도 있습니다. 다중 상속이 바람직하지 않은 경우, 그들은 Entity와 같은 일반 클래스에 상속해야 합니다. 그러나 Entity들 중 일부만이 박살날 수 있다고 해서 가상 메서드 ``smash()`` 를 추가하는 것은 그리 우아하지 않을 것입니다.
pt_br: Desta forma, tudo o que pode ser esmagado por uma rocha teria que herdar Smashable. Se um personagem, um inimigo, uma peça de mobília, uma pequena pedra fossem todos quebráveis, eles precisariam herdar da classe Smashable, possivelmente exigindo herança múltipla. Se herança múltipla fosse indesejada, eles teriam que herdar uma classe comum como Entity. No entanto, não seria muito elegante adicionar um método virtual ``smash ()`` à Entity apenas se alguns deles puderem ser destruídos.
ru: Таким образом, все, что может быть разбито камнем, должно наследовать Smashable. Если персонаж, враг, предмет мебели, маленький камень - все это можно разбить, им будет необходимо наследовать от класса Smashable, возможно, требуя множественного наследования. Если множественное наследование нежелательно, им придется наследовать общий класс, такой как Entity. Тем не менее, было бы не очень элегантно добавить виртуальный метод ``smash()`` в Entity, только если некоторые из них могут быть разбиты.
uk: Таким чином, все, що може бути розтрощене каменем, повинно було б успадкувати Smashable. Якщо персонаж, ворог, предмет інтер'єру, маленький камінь можуть бути зруйновані, їм потрібно успадкувати від клас Smashable, можливо, вимагаючи багаторазове успадкування. Якщо багаторазове успадкування небажане, вони повинні успадкувати такий клас, як Entity. Однак додавати віртуальний метод ``smash()`` до Entity було б не дуже елегантно, якщо тільки декілька з них можна розбити.

source: With dynamically typed languages, this is not a problem. Duck typing makes sure you only have to define a ``smash()`` function where required and that's it. No need to consider inheritance, base classes, etc.
es: Con lenguajes de tipado dinámico, esto no es un problema. Duck typing asegura de que sólo tengas que definir una función ``smash()`` donde sea necesario y nada más. No hay necesidad de considerar la herencia, clases base, etc.
fr: Avec les langages de typage dynamique, ce n'est pas un problème. Le typage canard permet de s'assurer que vous n'avez qu'à définir une fonction ``smash()`` là où c'est nécessaire et c'est tout. Pas besoin de considérer l'héritage, les classes de base, etc.
ko: 동적 타입 언어에서는, 문제없습니다. 덕 타이핑이 ``smash()`` 함수가 필요한 곳에만 정의하도록 만듭니다. 상속, 기본 클래스 등등을 고려할 필요가 없습니다.
pl: W przypadku języków dynamicznie typowanych nie stanowi to problemu. Duck typing upewnia się że zdefiniowałeś jedynie funkcję ``smash()`` tam, gdzie jest to wymagane i to tyle. Nie trzeba brać pod uwagę dziedziczenia, klas podstawowych itp.
pt_br: Com linguagens dinamicamente tipadas, isso não é um problema. O tipo Duck garante que você só precisa definir uma função ``smash ()`` onde for necessário e pronto. Não há necessidade de considerar herança, classes base, etc.
ru: С динамически типизированными языками это не проблема. Утиная типизация гарантирует, что вам нужно только определить функцию ``smash()`` там, где требуется, и все. Не нужно учитывать наследование, базовые классы и т.д.
uk: З динамічно набраними мовами це не проблема. Качина типізація гарантує, що вам потрібно визначити функцію smash() лише там, де це потрібно, і все. Не потрібно враховувати спадщину, базові класи тощо.

source: And that's it. If the object that hit the big rock has a smash() method, it will be called. No need for inheritance or polymorphism. Dynamically typed languages only care about the instance having the desired method or member, not what it inherits or the class type. The definition of Duck Typing should make this clearer:
es: Y eso es todo. Si el objeto que golpea a la roca grande tiene un método smash(), entonces será llamado. No se necesita herencia ni polimorfismo. Los lenguajes de tipado dinámico solo se preocupan de que la instancia tenga los métodos o miembros deseados, no que hereda ni el tipo de clase. La definición de Duck Typing debería hacer esto más claro:
fr: Et c'est tout. Si l'objet qui a frappé le gros rocher a une méthode smash(), il sera appelé. Pas besoin d'héritage ou de polymorphisme. Les langues typées dynamiquement ne se soucient que de l'instance ayant la méthode ou le membre désiré, et non de ce dont elle hérite ou du type de classe. La définition du Duck Typing devrait rendre cela plus clair :
ko: 그리고 됐습니다. 큰 오리를 치는 물체가 smash() 메서드를 갖고 있다면, 호출될 것입니다. 상속이나 폴리모피즘이 필요 없습니다. 동적 타입 언어는 상속된 인스턴스나 클래스 타입이 아니라, 바람직한 메서드나 멤버를 가진 인스턴스가 맞는지 관리하시면 됩니다. 덕 타이핑의 정의는 이를 명확하게 만듭니다:
pt_br: E é isso. Se o objeto que atingiu a pedra grande tiver um método smash (), ele será chamado. Não há necessidade de herança ou polimorfismo. Linguagens dinamicamente tipadas só se preocupam com a instância que possui o método ou membro desejado, não o que ele herda ou o tipo de classe. A definição de Duck Typing deve tornar isso mais claro:
ru: И это все. Если объект, столкнувшийся с камнем, имеет метод smash(), он будет вызван. Нет необходимости наследования или полиморфизма. Языки с динамической типизацией заботятся только о том, чтобы экземпляр имел нужный метод или член, а не о том, что он наследует, или о типе класса. Определение Утиной типизации должно прояснить это:
uk: І це все. Якщо об'єкт, який потрапив під великий камінь, має метод smash(), він буде викликаний. Немає потреби у спадщині, чи поліморфізмі. Динамічні мови, дбають лише про те, щоб екземпляр мав потрібний метод, або член, а не про те, що він успадковує, або про тип класу. Визначення Качина Типізація має зробити зрозумілішим наступне:

source: *"When I see a bird that walks like a duck and swims like a duck and quacks like a duck, I call that bird a duck"*
es: *"Cuando veo un ave que camina como un pato, nada como un pato y grazna como un pato, entonces llamo al ave pato"*
fr: *"Quand je vois un oiseau qui marche comme un canard et nage comme un canard et cancane comme un canard, j'appelle cet oiseau un canard."*
ko: *"내가 오리처럼 걷고 오리처럼 수영하고 오리처럼 우는 새를 볼 때, 나는 그 새를 오리라고 부른다"*
pl: *"Kiedy widzę ptaka, który spaceruje jak kaczka i pływa jak kaczka i kwacze jak kaczka, nazywam go kaczką"*
pt_br: *"Quando eu vejo um pássaro que anda como um pato e nada como um pato e grasna como um pato, eu chamo esse pássaro de pato"*
ru: *"Когда Я вижу птицу, которая ходит как утка и плавает как утка, и крякает как утка, Я называю эту птицу уткой"*
uk: *"Коли я бачу птицю, яка ходить, як качка, плаває, як качка, і крякає, як качка, я називаю цю птицю качкою"*

source: In this case, it translates to:
es: En este caso, se traduce como:
fr: Dans ce cas, cela se traduit par :
ko: 우리의 경우에는, 다음과 같이 번역됩니다:
pl: W tym przypadku można przetłumaczyć to na:
pt_br: Neste caso, traduz para:
ru: В этом случае это переводится как:
uk: У цьому випадку це означає:

source: *"If the object can be smashed, don't care what it is, just smash it."*
es: *"Si el objeto puede ser golpeado, no me importa lo que es, solo golpéalo."*
fr: *"Si l'objet peut être écrasé, peu importe ce que c'est, écrasez-le juste."*
ko: *"물체를 박살낼 수 있다면, 무엇이든 상관없이, 그냥 박살낸다."*
pl: *"Jeśli obiekt może zostać rozbity, nie przejmuj się tym, czym jest, po prostu go rozbij."*
pt_br: *"Se o objeto pode ser esmagado, não importa o que seja, apenas esmague-o."*
ru: *"Если объект может быть разбит, все равно, что это, просто разбейте его."*

source: Yes, we should call it Hulk typing instead.
es: Sí, en su lugar deberíamos llamarlo Hulk Typing.
fr: Oui, on devrait plutôt l'appeler le typage à la Hulk.
ko: 예, 우리는 이를 대신 헐크 타이핑이라 불러야겠네요.
pt_br: Sim, nós deveríamos chamar isso de tipo Hulk ao invés disso.
ru: Да, возможно нам следует называть это типизацией Халка.
uk: Так, можливо нам слід було назвати це типізацією Халка.

source: It's possible that the object being hit doesn't have a smash() function. Some dynamically typed languages simply ignore a method call when it doesn't exist (like Objective C), but GDScript is stricter, so checking if the function exists is desirable:
es: Es posible que el objeto que recibe el impacto no tenga una función smash(). Algunos lenguajes escritos dinámicamente simplemente ignoran una llamada a un método cuando no existe (como Objective C), pero GDScript es más estricto, por lo que es deseable comprobar si la función existe:
fr: Il est possible que l'objet touché n'ait pas de fonction smash(). Certains langages à typage dynamique ignorent simplement un appel de méthode lorsqu'il n'existe pas (comme Objective C), mais GDScript est plus strict, il est donc souhaitable de vérifier si la fonction existe :
ko: 맞은 물체가 smash() 함수를 갖지 않을 수 있습니다. 일부 동적 타입 언어는 존재하지 않는 메서드 호출은 간단히 무시합니다 (Objective C 처럼 말이죠), 하지만 GDScript는 더 엄격합니다, 그래서 함수가 존재하는 지 확인하는 것이 바람직합니다:
ru: Возможно, что объект, по которому ударили, не имеет функции smash(). Некоторые динамически типизированные языки просто игнорируют вызов метода, когда он не существует (например, Objective C), но GDScript более строгий, поэтому желательно проверить, существует ли функция:
uk: Можливо, що об'єкт, який отримав удар, не має функції smash(). Деякі динамічно набрані мови просто ігнорують виклик методу, коли його не існує (наприклад, Objective C), але GDScript є більш суворим, тому бажано перевірити, чи функція існує:

source: Then, simply define that method and anything the rock touches can be smashed.
es: Entonces, simplemente define el método y todo lo que la roca toca puede ser aplastado.
fr: Ensuite, il suffit de définir cette méthode et tout ce que la roche touche peut être écrasé.
ko: 그런 다음, 간단히 바위에 닿는 모든 것들을 메서드로 정의하여 박살날 수 있도록 합니다.
pl: Następnie po prostu zdefiniuj tę metodę i zdefiniuj wszystko, co może zostać rozbite przez skałę.
pt_br: Então, simplesmente defina esse método e qualquer coisa que a rocha tocar pode ser destruída.
ru: Затем просто определите этот метод, и все, к чему прикасается камень, может быть разбито.
uk: Потім просто визначте цей метод і все, до чого торкатиметься камінь, може бути розбито.
