Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_advanced.po
Languages: es, fr, ko, pl, pt_br, ru, uk

source: GDScript: An introduction to dynamic languages
es: GDScript: Introducción a los lenguajes dinámicos
fr: GDScript : Une introduction aux langages dynamiques
ko: GDScript: 동적 언어 소개
pl: GDScript: Wprowadzenie do języków dynamicznych
pt_br: GDScript: Uma introdução às linguagens dinâmicas
ru: GDScript: Введение в динамически типизированные языки
uk: GDScript: Вступ до мов динамічного типу

source: About
es: Acerca de
fr: À propos
ko: 정보
pl: O silniku
pt_br: Sobre
ru: О движке
uk: Про

source: This tutorial aims to be a quick reference for how to use GDScript more efficiently. It focuses on common cases specific to the language, but also covers a lot of information on dynamically typed languages.
es: Este tutorial pretende ser una referencia rápida para aprender a usar GDScript de forma más eficiente. Está enfocado a casos específicos del lenguaje, pero también cubre bastante información sobre lenguajes dinámicamente tipados.
fr: Ce tutoriel a pour but d'être une référence rapide pour savoir comment utiliser GDScript plus efficacement. Il se concentre sur les cas communs spécifiques au langage, mais couvre aussi beaucoup d'informations sur les langues à typage dynamique.
ko: 이 튜토리얼은 GDScript를 더 효과적으로 사용하는 방법에 대한 빠른 참고 문헌입니다. 언어와 관련된 일반적인 사례 뿐만 아니라, 동적 타입 언어의 많은 정보도 다루고 있습니다.
pl: Ten samouczek ma być szybkim punktem odniesienia dla efektywniejszego korzystania z GDScript. Koncentruje się on na specyficznych przypadkach języka, ale obejmuje również wiele informacji na temat dynamicznie pisanych języków.
pt_br: Este tutorial pretende ser uma referência rápida de como usar GDScript de forma mais eficiente. Focando, assim, em casos mais comuns específicos da linguagem, mas também contém informações sobre linguagens dinâmicamente tipadas.
ru: Это руководство призвано стать кратким руководством по более эффективному использованию GDScript. Он фокусируется на общих случаях, характерных для языка, но также охватывает много информации о динамически типизированных языках.
uk: Цей підручник має стати короткою довідкою з ефективнішого використання GDScript. Він зосереджений, в основному, на випадках, характерних для цієї мови, але також охоплює багато інформації про динамічні мови в загальному.

source: It's meant to be especially useful for programmers with little or no previous experience with dynamically typed languages.
es: Está pensada para ser especialmente útil para programadores con poca o ninguna experiencia con lenguajes de tipado dinámico.
fr: Il est destiné à être particulièrement utile pour les programmeurs ayant peu ou pas d'expérience préalable avec les langages à typage dynamique.
ko: 이전까지 동적 타입 언어에 대한 경험이 없던 프로그래머에게 이 문서는 특히 더 유용합니다.
pl: Ma to być szczególnie przydatne dla programistów, którzy nie mają doświadczenia z dynamicznie typowanymi językami lub mają niewielkie doświadczenie w posługiwaniu się nimi.
pt_br: É destinado a ser especialmente útil para programadores com pouca ou nenhuma experiência com linguagens dinâmicamente tipadas.
ru: Она должна быть особенно полезна для программистов с небольшим опытом работы с динамически типизированными языками или вообще без него.
uk: Ця довідка може бути особливо корисною для програмістів, у яких мало, або нема взагалі, досвіду роботи з динамічними мовами.

source: Dynamic nature
es: Naturaleza dinámica
fr: Nature dynamique
ko: 동적 성격
pl: Dynamiczna natura
pt_br: Natureza dinâmica
ru: Динамический характер
uk: Динамічна природа

source: Pros & cons of dynamic typing
es: Pros y contras del tipado dinámico
fr: Avantages et inconvénients du typage dynamique
ko: 동적 타이핑의 장단점
pl: Zalety i wady dynamicznie typowanego języka
pt_br: Prós e contras da tipagem dinâmica
ru: Плюсы и минусы динамической типизации
uk: Плюси і мінуси динамічного типу

source: GDScript is a Dynamically Typed language. As such, its main advantages are that:
es: GDScript es un lenguaje de tipado dinámico. Como tal, sus grandes ventajas son:
fr: GDScript est un langage à typage dynamique. En tant que tel, ses principaux avantages sont que :
ko: GDScript는 동적 타입 언어입니다. 따라서, 주요 이점은 다음과 같습니다:
pl: GDScript jest dynamicznie typowanym językiem. Jego głównymi zaletami są:
pt_br: GDScript é uma linguagem Dinamicamente Tipada. Como tal, suas maiores vantagens são:
ru: GDScript-это динамически типизированный язык. Его главным преимуществом является то, что:
uk: GDScript - це мова динамічного типу. Основними її перевагами є:

source: The language is simple and easy to learn.
es: El idioma es simple y fácil de aprender.
fr: Le langage est simple et facile à apprendre.
ko: 언어가 간결하고 배우기 쉽습니다.
pl: Jest to prosty język i łatwy do nauki.
pt_br: A linguagem é muito simples de aprender.
ru: Язык прост и легок в изучении.
uk: Мова проста і легка для вивчення.

source: Most code can be written and changed quickly and without hassle.
es: La mayoría del código puede ser escrito y cambiado rápidamente sin complicaciones.
fr: La plupart du code peut être écrit et modifié rapidement et sans tracas.
ko: 대부분의 코드를 쉽고 빠르게 작성하고 변경할 수 있습니다.
pl: Większość kodu można zapisywane i zmieniane, szybko i bez kłopotów.
pt_br: A maioria do código pode ser escrito e modificado rapidamente sem complicações.
ru: Большую часть кода можно написать и изменить быстро и без лишних хлопот.
uk: Більшість коду можна записати і змінити швидко та без клопоту.

source: Less code written means less errors & mistakes to fix.
es: Escribir menos código significa tener menos errores y fallos que corregir.
fr: Moins de code écrit signifie moins d'erreurs à corriger.
ko: 적은 코드 작성으로 오류와 실수를 줄일 수 있습니다.
pl: Mniej kodu do napisania oznacza mniej błędów i pomyłek do naprawy.
pt_br: Menos código escrito significa menos erros e enganos a serem corrigidos.
uk: Менше коду означає менше помилок.

source: Easier to read the code (less clutter).
es: Código más sencillo de leer (menos desorganizado).
fr: Plus grande facilité à lire le code (moins d'encombrement).
ko: 코드를 읽기 더 쉽습니다 (덜 혼란스러움).
pl: Łatwiejszy do czytania kod.
pt_br: Mais fácil de ler o código (menos bagunça).
ru: Упрощает чтение кода (меньше беспорядка).
uk: Простіше читати код (менше безладдя).

source: No compilation is required to test.
es: No es necesario compilar para probarlo.
fr: Aucune compilation n'est nécessaire pour tester.
ko: 테스트하기 위한 컴파일 작업이 필요 없습니다.
pl: Nie potrzeba kompilacji do testowania.
pt_br: Nenhuma compilação é necessária para testar.
ru: Для проверки не требуется компиляция.
uk: Не потрібна компіляція для тестування.

source: Runtime is tiny.
es: El código en ejecución es pequeño.
fr: Le temps d'exécution est minuscule.
ko: 런타임이 작습니다.
pl: Jest niewielki.
pt_br: Tempo de execução é bem pequeno.
ru: Время выполнения очень мало.
uk: Час виконання крихітний.

source: Duck-typing and polymorphism by nature.
es: Duck-typing y polimorfismo por naturaleza.
fr: Typage ad hoc et polymorphisme par nature.
ko: 덕 타이핑(Duck-typing)과 폴리모피즘(polymorphism).
pt_br: Polimorfismo e tipagem pato naturalmente.
uk: Качина типізація і поліморфізм від природи.

source: While the main disadvantages are:
es: Siendo las principales desventajas:
fr: Alors que les principaux inconvénients sont :
ko: 반면 주요 단점은 다음과 같습니다:
pl: Podczas gdy głównymi wadami są:
pt_br: Enquanto as maiores desvantagens são:
ru: В то время как основными недостатками являются:
uk: Хоча основними недоліками є:

source: Less performance than statically typed languages.
es: Menor rendimiento que los lenguajes de tipado estático.
fr: Moindre performance que les langages statiquement typés.
ko: 정적 타입 언어보다 낮은 퍼포먼스.
pl: Mniejsza wydajność niż statycznie typowane języki.
pt_br: Menor performance que linguagens com tipagem estática.
ru: Менее высокая производительность по сравнению со статически типизированными языками.
uk: Менша продуктивність, ніж у статичних мов.

source: More difficult to refactor (symbols can't be traced)
es: Mayor dificultad para refactorizar (no se pueden trazar los símbolos)
fr: Plus difficile à refactoriser (les symboles ne peuvent pas être tracés)
ko: refactor하기 더 어려움(기호를 추적할 수 없음)
pl: Trudnejsze do sprawdzania (symbole nie mogą być śledzone)
pt_br: Mais difícil de refatorar (símbolos não podem ser rastreados)
uk: Складніше переробляти (символи не простежуються)

source: Some errors that would typically be detected at compile time in statically typed languages only appear while running the code (because expression parsing is more strict).
es: Algunos errores que se detectarían en el tiempo de compilación en lenguajes de tipado estático, solo aparecen cuando se ejecuta el código (porque el análisis gramatical es más estricto).
fr: Certaines erreurs qui seraient typiquement détectées au moment de la compilation dans des langues typées statiquement n'apparaissent que lors de l'exécution du code (parce que l'analyse des expressions est plus stricte).
ko: 정적 타입 언어에서 컴파일 시간에 감지되는 오류가 오직 코드를 실행할 때만 나타납니다 (표현 문법 분석이 더 엄격하기 때문입니다).
pl: Niektóre błędy, które zwykle są wykrywane w czasie kompilacji w statycznie wpisanych językach, pojawiają się tylko podczas uruchamiania kodu (ponieważ parsowanie wyrażeń jest bardziej rygorystyczne).
pt_br: Alguns erros que, tipicamente, seriam detectados em tempo de compilação em linguagens tipadas estaticamente aparecem apenas rodando o código (porque a análise de expressões é mais estrita).
ru: Некоторые ошибки, которые обычно обнаруживаются во время компиляции на статически напечатанных языках, появляются только при запуске кода (поскольку происходит более строгая синтаксическая проверка).
uk: Деякі помилки, які, як правило, виявляються під час компіляції в статично набраних мовах, з’являються лише під час виконання коду (оскільки синтаксичний аналіз виразів є більш суворим).

source: Less flexibility for code-completion (some variable types are only known at run-time).
es: Menos flexibilidad para el auto completado de código (los tipos de algunas variables solo se conocen en tiempo de ejecución).
fr: Moins de flexibilité pour la complétion de code (certains types de variables ne sont connus qu'au moment de l'exécution).
ko: 코드 완성에 덜 유연함 (일부 변수 타입은 런타임에만 알려짐).
pl: Mniejsza elastyczność przy kodowaniu (niektóre typy zmiennych są znane tylko w czasie pracy programu).
pt_br: Menos flexibilidade para preenchimento de código (alguns tipos de variáveis só são reconhecidos na execução).
uk: Менша гнучкість для заповнення коду (деякі типи змінних стають відомі лише під час виконання).

source: This, translated to reality, means that Godot+GDScript are a combination designed to create games quickly and efficiently. For games that are very computationally intensive and can't benefit from the engine built-in tools (such as the Vector types, Physics Engine, Math library, etc), the possibility of using C++ is present too. This allows you to still create most of the game in GDScript and add small bits of C++ in the areas that need a performance boost.
es: Esto, si lo traducimos a la realidad, significa que Godot+GDScript son una combinación diseñada para crear juegos de forma rápida y eficiente. Para juegos que son muy exigentes desde el punto de vista computacional y que no pueden beneficiarse de las herramientas incorporadas en el motor (como los tipos de Vector, el Motor de Física, la biblioteca de Matemáticas, etc.), existe la posibilidad de usar C++. Esto permite crear todo el juego en GDScript y añadir pequeños trozos de C++ en las áreas que necesitan un aumento de rendimiento.
fr: Ceci, traduit dans la réalité, signifie que Godot+GDScript sont une combinaison conçue pour créer des jeux très rapidement et efficacement. Pour les jeux qui sont très intensifs en calcul et qui ne peuvent pas bénéficier des outils intégrés au moteur (tels que les types vectoriels, le moteur physique, la librairie mathématique, etc), la possibilité d'utiliser C++ est également présente. Cela permet de créer le jeu entier en GDScript et d'ajouter des petits morceaux de C++ dans les zones qui ont besoin d'un gain de performance.
ko: 현실로 번역된 이 말은 Godot+GDScript가 게임을 빠르고 효율적으로 만들 수 있는 조합임을 의미합니다. 매우 계산 집약적이고 엔진 내장 도구 (벡터 타입, 물리 엔진, 수학 라이브러리 등)의 이점을 누릴 수 없는 게임의 경우, C++를 사용하는 경우의 수도 존재합니다. 이걸로 GDScript에서 전체적인 게임을, 그리고 퍼포먼스 가속이 필요한 영역에 약간의 C++를 첨가하는 것이 가능합니다.
ru: Это означает, что Godot+GDScript - это комбинация, разработанная для быстрого и эффективного создания игр. Для игр, требующих большой вычислительной мощности и не использующих встроенные инструменты движка (такие как Vector type, Physics Engine, Math library и т.д.), также предусмотрена возможность использования языка Си++. Это позволяет вам создавать большую часть игры в GDScript и добавлять небольшие кусочки C++ в области, которые нуждаются в повышении производительности.
uk: Це, в перекладі на реальність, означає, що Godot + GDScript - це комбінація, призначена для швидкого та ефективного створення ігор. Для ігор, які потребують інтенсивних обчислень і не можуть отримати користь від вбудованих в движок інструментів (таких як векторні типи, фізичний движок, бібліотека математики тощо), також є можливість використання C++. Це дозволяє все-таки створювати більшу частину гри в GDScript і додавати невеликі шматочки C++ у тих областях, які потребують підвищення продуктивності.

source: Variables & assignment
es: Variables y asignaciones
fr: Variables et affectation
ko: 변수 & 지정
pl: Zmienne i przypisania
pt_br: Variáveis & atribuição
ru: Переменные и присваивание
uk: Змінні та призначення

source: All variables in a dynamically typed language are "variant"-like. This means that their type is not fixed, and is only modified through assignment. Example:
es: Todas las variables en lenguajes de tipado dinámico son del tipo "variant". Esto significa que su tipo no es fijo, y solo se puede modificar mediante la asignación. Ejemplo:
fr: Toutes les variables d'un langage typé dynamiquement sont de type "variant". Cela signifie que leur type n'est pas fixe et n'est modifié que par l'affectation. Exemple :
ko: 동적 타입 언어의 모든 변수는 "변형"과 유사합니다. 즉, 그들의 타입은 고정되어 있지 않고, 오직 지정을 통해 수정됩니다. 예제:
pt_br: Todas as variáveis em uma linguagem dinamicamente tipada são tipo-"variante". Isto significa que seus tipos não são fixos, e é modificado apenas na atribuição. Exemplos:
ru: Все переменные в динамически типизированном языке являются "вариантными" типами. Это означает, что их тип не является фиксированным, а модифицируется только через присваивание. Пример:
uk: Усі змінні в динамічних мовах мають "невизначений" тип. Це означає, що їх тип не є фіксованим, а змінюється в момент призначення. Приклад:

source: Static:
es: Estático:
fr: Statique :
ko: 정적 언어:
pl: Statyczny:
pt_br: Estático:
ru: Статическая типизация:
uk: Статичний:

source: Dynamic:
es: Dinámico:
fr: Dynamique :
ko: 동적 언어:
pl: Dynamiczny:
pt_br: Dinâmico:
ru: Динамическая типизация:
uk: Динамічний:

source: As function arguments:
es: Como argumentos de funciones:
fr: En tant qu'arguments de fonctions :
ko: 함수 인수로:
pl: Jako argumenty funkcji:
pt_br: Como argumentos da função:
ru: В качестве аргументов функции:
uk: Як аргументи функції:

source: Functions are of dynamic nature too, which means they can be called with different arguments, for example:
es: Las funciones también tienen una naturaleza dinámica, lo que significa que pueden ser invocadas con diferentes argumentos, por ejemplo:
fr: Les fonctions sont également de nature dynamique, ce qui signifie qu'elles peuvent être appelées avec différents arguments, par exemple :
ko: 함수도 동적인 특성을 지닙니다, 그래서 함수를 다른 인수로 호출할 수 있습니다, 예를 들어:
pl: Funkcje mają również charakter dynamiczny, co oznacza, że można je wywoływać za pomocą różnych argumentów, przykład użycia:
pt_br: Funções também têm natureza dinâmica, o que significa que elas podem ser invocadas com argumentos diferentes, por exemplo:
ru: Функции носят динамичный характер, что означает, что их можно вызывать, например, с помощью различных аргументов:
uk: Функції теж мають динамічний характер, а це означає, що їх можна викликати з різними аргументами, наприклад:

source: Pointers & referencing:
es: Punteros y referencia:
fr: Pointeurs et référencement :
ko: 포인터(Pointer) & 참조:
pl: Wskaźniki i odniesienia:
pt_br: Ponteiros & referência:
ru: Указатели и ссылки:
uk: Вказівники та посилання:

source: In static languages, such as C or C++ (and to some extent Java and C#), there is a distinction between a variable and a pointer/reference to a variable. The latter allows the object to be modified by other functions by passing a reference to the original one.
es: En lenguajes estáticos como C o C++ (y hasta cierto punto Java y C#), hay una distinción entre una variable y un puntero/referencia a una variable. Este último permite al objeto ser modificado por otras funciones pasando una referencia del original.
fr: Dans les langages statiques tels que C ou C++ (et dans une certaine mesure Java et C#), il y a une distinction entre une variable et un pointeur/référence à une variable. Ce dernier permet à l'objet d'être modifié par d'autres fonctions en passant une référence de l'objet original.
ko: C 나 C++ (그리고 어느 정도는 Java와 C#) 같은 정적 언어에서, 변수와 변수에 대한 포인터/참조는 구별됩니다. 후자는 원래의 참조를 전달하여 다른 함수에 의해 객체가 수정되도록 할 수 있습니다.
ru: В статически типизированных языках, таких как C или C++ (а также в некоторых расширениях Java и C#), различают переменные и указатели/ссылки на переменные. Последние позволяют модифицировать исходный объект по ссылке, передаваемой в другие функции.
uk: У статичних мовах, таких як C, або C ++ (і певною мірою Java та C#), існує різниця між змінною та вказівником/посиланням на змінну. Останнє дозволяє змінювати об'єкт іншими функціями, передаючи посилання на оригінал.

source: In C# or Java, everything not a built-in type (int, float, sometimes String) is always a pointer or a reference. References are also garbage-collected automatically, which means they are erased when no longer used. Dynamically typed languages tend to use this memory model, too. Some Examples:
es: En C# o Java, todo lo que no es un tipo integrado (*int*, *float*, y algunas veces *string*) es siempre un puntero o una referencia. Las referencias son recogidas por el recolector de basura automáticamente, lo que significa que se borran cuando no se están usando. Los lenguajes dinámicos tienden a usar este modelo de memoria también. Algunos ejemplos:
fr: En C# ou Java, tout ce qui n'est pas un type intégré (int, float, parfois String) est toujours un pointeur ou une référence. Les références sont également collectées par le ramasse-miette automatiquement, ce qui signifie qu'elles sont effacées lorsqu'elles ne sont plus utilisées. Les langages à typage dynamique ont aussi tendance à utiliser ce modèle de mémoire. Quelques exemples :
ko: C#이나 Java에서, 모든 것이 내장 타입 (정수, 실수, 때때로 문자열)이 아닌 포인터나 참조입니다. 참조는 또한 자동으로 가비지를 모으는데, 더 이상 사용되지 않으면 삭제됩니다. 동적 타입 언어 역시 이런 메모리 모델을 사용하는 경향이 있습니다. 몇 가지 예제:
ru: В C# или Java все типы, кроме встроенных (int, float, частично String), всегда являются указателями или ссылками. Ссылки автоматически удаляются сборщиком мусора, когда они становятся больше ненужными. Динамически типизированные языки также стремятся использовать эту модель. Несколько примеров:
uk: У C#, або Java, все, що не є вбудованим типом (int, float, іноді String), завжди є вказівником, або посиланням. Посилання також збираються сміттям автоматично, що означає, що вони видаляються, коли більше не використовуються. Динамічно набрані мови, як правило, використовують і цю модель пам'яті. Деякі приклади:

source: In GDScript, only base types (int, float, string and the vector types) are passed by value to functions (value is copied). Everything else (instances, arrays, dictionaries, etc) is passed as reference. Classes that inherit :ref:`class_Reference` (the default if nothing is specified) will be freed when not used, but manual memory management is allowed too if inheriting manually from :ref:`class_Object`.
es: En GDScript, solo los tipos básicos (int, float, string y los tipos vector) se pasan por valor a las funciones (el valor es copiado). Todo lo demás (instancias, arrays, diccionarios, etc) se pasa como referencia. Las clases que heredan :ref:`class_Reference` (Herencia por defecto si no se especifica otra) serán liberadas cuando no estén en uso, pero se permite el manejo manual de la memoria también si se hereda específicamente de :ref:`class_Object`.
fr: Dans GDScript, seuls les types de base (int, float, string et les types vectoriels) sont transmis par valeur aux fonctions (la valeur est copiée). Tout le reste (instances, tableaux, dictionnaires, etc.) est passé par référence. Les classes qui héritent de :ref:`class_Reference` (par défaut si rien n'est spécifié) seront libérées lorsqu'elles ne sont pas utilisées, mais la gestion manuelle de la mémoire est également autorisée si elles héritent manuellement de :ref:`class_Object`.
ko: GDScript에서 기본 타입 (정수, 실수, 문자열 그리고 벡터 타입)만이 함수에 값으로 보낼 수 있습니다 (값은 복사됩니다). 나머지 (인스턴스, 배열, 딕셔너리 등)는 참조로 보내집니다. :ref:`class_Reference` 를 상속한 클래스 (지정한 것이 없으면 기본 값)는 사용되지 않을 때 해제되지만, :ref:`class_Object` 로 부터 수동으로 상속하는 경우 수동 메모리 관리가 가능합니다.
pl: W GDScript tylko typy bazowe (int, float, string i typy wektorowe) są przekazywane przez wartość do funkcji (wartość jest kopiowana). Wszystko inne (instancje, tablice, słowniki itp.) jest przekazywane jako odniesienie. Klasy odziedziczone :ref:`class_Reference` (domyślne, jeśli nie podano nic) zostaną zwolnione, jeśli nie są używane, ale ręczne zarządzanie pamięcią jest również dozwolone, jeśli dziedziczenie odbywa się ręcznie po :ref:`class_Object`.
pt_br: No GDScript, somente os tipos básicos (int, float, string e os tipos vetores) são passados por valor para funções (o valor é copiado). Todo o resto (instances, arrays, dictionaries, etc) é passado como referência. As classes que herdam: ref: `class_Reference` (o padrão se nada for especificado) serão liberadas quando não usadas, mas o gerenciamento de memória manual também é permitido se herdar manualmente de: ref:` class_Object`.
ru: В GDScript только базовые типы (int, float, string и vector) передаются в аргументы в виде значений (данные копируются). Во всех других случаях (экземпляры объектов, массивы, словари и т.д.) передаются лишь ссылки. Объекты классов, которые наследуются от :ref:`class_Reference` (устанавливается по-умолчанию) будут автоматически удалены сборщиком мусора при отсутствии ссылок. Ручное управление памятью также возможно, если класс будет наследоваться от :ref:`class_Object`.
uk: У GDScript лише базові типи (int, float, string та векторні типи) передаються функціям, як значення (значення копіюється). Все інше (екземпляри, масиви, словники тощо) передається як посилання. Класи, які успадковують :ref:`class_Reference` (за замовчуванням, якщо нічого не вказано), будуть звільнені, коли вони не використовуються, але можливе також керування пам'яттю вручну, якщо успадковувати вручну від :ref:`class_Object`.

source: Arrays
es: Arreglos
fr: Les tableaux
ko: 배열
pl: Tablice
ru: Массивы
uk: Масиви
