Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_exports.po
Languages: fr, ja, ko, pt_br, ru, uk, zh_cn

source: every successive property added after the group property will be collapsed and shortened as determined by the prefix defined via the ``hint_string`` key. For instance, ``rotate_speed`` is going to be shortened to ``speed`` in this case.
fr: chaque propriété successive ajoutée après la propriété de groupe sera réduite et raccourcie comme déterminé par le préfixe défini via la clé ``hint_string``. Par exemple, ``rotate_speed`` va être raccourci en ``speed`` dans ce cas.
pt_br: cada propriedade sucessiva adicionada após a propriedade do grupo será recolhida e encurtada conforme determinado pelo prefixo definido por meio da chave ``hint_string``. Por exemplo, ``rotate_speed`` será encurtado para ``speed`` neste caso.
ru: каждое последующее свойство, добавленное после свойства группы, будет свернуто и сокращено в соответствии с префиксом, определенным с помощью ключа ``hint_string``. Например, в этом случае``rotate_speed`` будет сокращен до ``speed``.
uk: кожна наступна властивість додана після властивості групи, буде згорнуто та скорочено відповідно до префікса, визначеного за допомогою ключа ``hint_string``. Наприклад, у цьому випадку ``rotate_speed`` буде скорочено до ``speed``.
zh_cn: 接下来所有新增的属性都会被放在该群组中, 通过 ``hint_string`` 字典键定义为可折叠, 并以其为前缀缩写名称. 例如, 本例中的 ``rotate_speed`` 将会被缩写为 ``speed``.

source: ``PROPERTY_USAGE_GROUP`` indicates that the property should be treated as a script group specifically, so the type ``TYPE_NIL`` can be ignored as it won't be actually used for the scripting logic, yet it must be defined anyway.
fr: ``PROPERTY_USAGE_GROUP`` indique que la propriété doit être traitée comme un groupe de script spécifique, donc le type ``TYPE_NIL`` peut être ignoré car il ne sera pas réellement utilisé pour la logique de script, mais il doit quand même être défini.
pt_br: ``PROPERTY_USAGE_GROUP`` indica que a propriedade deve ser tratada como um grupo de script especificamente, então o tipo ``TYPE_NIL`` pode ser ignorado, pois não será realmente usado para a lógica de script, mas deve ser definido de qualquer forma.
ru: ``PROPERTY_USAGE_GROUP`` указывает, что свойство должно рассматриваться именно как группа сценариев, поэтому тип ``TYPE_NIL`` можно игнорировать, поскольку он фактически не будет использоваться для логики сценариев, но он все равно должен быть определен.
uk: ``PROPERTY_USAGE_GROUP`` вказує на те, що властивість слід розглядати як групу скриптів, тому тип ``TYPE_NIL`` можна ігнорувати, оскільки він фактично не використовуватиметься для логіки скрипта, але його все одно потрібно визначити.
zh_cn: ``PROPERTY_USAGE_GROUP`` 表明了该属性应被视为一个脚本分类, 因此可以忽略 ``TYPE_NIL`` 这个类型, 因为它其实并没有被脚本逻辑所处理. 但无论如何, 你还是要在这儿定义它.

source: Integers used as bit flags can store multiple ``true``/``false`` (boolean) values in one property. By using the export hint ``int, FLAGS, ...``, they can be set from the editor::
pt_br: Inteiros usados como sinalizadores podem armazenar múltiplos valores ``true``/``false`` (booleanos) em uma propriedade. Usando a inferência de exportação ``int, FLAGS, ...``, eles podem ser configurados a partir do editor::
ru: Целые числа, используемые в качестве битовых флагов, могут хранить несколько ``true``/``false`` (булевых) значений в одном свойстве. Используя подсказку экспорта ``int, FLAGS``, их можно настроить в редакторе:
uk: Цілі числа, що використовуються як бітові позначки, можуть зберігати декілька ``true``/``false`` (булевих) значень в одній властивості. За допомогою підказки щодо експорту ``int, FLAGS, ...``, їх можна встановити з редактора:
zh_cn: 用作位标志的整数可以在一个属性中存储多个 ``true``/ ``false`` (布尔值)值. 通过使用导出提示 ``int, FLAGS`` , 可以从属性检查器中设置它们:

source: You must provide a string description for each flag. In this example, ``Fire`` has value 1, ``Water`` has value 2, ``Earth`` has value 4 and ``Wind`` corresponds to value 8. Usually, constants should be defined accordingly (e.g. ``const ELEMENT_WIND = 8`` and so on).
pt_br: Você deve fornecer uma descrição em string para cada sinalizador. Neste exemplo, ``Fire`` tem valor 1, ``Water`` tem valor 2, ``Earth`` tem valor 4 e ``Wind`` corresponde ao valor 8. Normalmente, constantes deveriam ser definidas em conformidade (por exemplo, ``const ELEMENT_WIND = 8`` e assim por diante).
ru: Вы должны предоставить строчное описание каждому флагу. В этом примере у ``Fire`` значение 1, у ``Water`` - 2, у ``Earth`` - 4 и у ``Wind`` - 8. Обычно константы должны быть определены соответствующим образом (например, ``const ELEMENT_WIND = 8`` и так далее).
uk: Ви повинні надати опис рядка для кожної позначки. У цьому прикладі ``Fire`` має значення 1, ``Water`` - 2, ``Earth`` - 4 і ``Wind`` відповідає значенню 8. Зазвичай константи слід визначати відповідно (наприклад ``const ELEMENT_WIND = 8`` тощо).
zh_cn: 你必须为每个标志提供一个字符串描述. 在这个例子中, ``火(Fire)`` 的值是1, ``水(Water)`` 的值是2, ``土(Earth)`` 的值是4, ``风(Wind)`` 对应的值是8. 通常, 应相应地定义常量(例如 ``const ELEMENT_WIND = 8`` 等等).

source: Export hints are also provided for the physics and render layers defined in the project settings::
pt_br: Inferências de exportação também são fornecidas para as camadas de física e de renderização definidas nas configurações do projeto::
ru: Подсказки по экспорту также предоставляются для слоев физики и визуализации, определенных в настройках проекта::
uk: Також передбачені підказки щодо експорту для фізики та шарів візуалізації, визначених у параметрах проекту:
zh_cn: 也可以为项目设置中定义的物理层和渲染层提供导出提示:

source: Using bit flags requires some understanding of bitwise operations. If in doubt, use boolean variables instead.
pt_br: O uso de sinalizadores de bit exige certo conhecimento de operações bit a bit. Na dúvida, exporte variáveis booleanas.
ru: Использование бинарных флагов требует некоторого понимания побитовых операций. Если вы сомневаетесь, вместо этого следует экспортировать логические переменные.
uk: Використання бітових значень вимагає певного розуміння побітових операцій. Якщо ви сумніваєтесь, використовуйте замість них логічні змінні.
zh_cn: 使用位标志需要对位操作有一定的了解. 如果有疑问, 请使用布尔变量代替.

source: Exported arrays can have initializers, but they must be constant expressions.
pt_br: Arrays exportados podem ter inicializadores, mas devem ser expressões constantes.
ru: Экспортируемые массивы могут иметь инициализаторы, но они должны быть постоянными выражениями.
uk: Експортовані масиви можуть мати ініціалізатори, але вони повинні бути постійними виразами.
zh_cn: 导出的数组可以具有初始化器, 但是它们必须是常量表达式.
