Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_basics.po
Languages: de, es, ko, pt_br, zh_cn

source: If a class inherits from :ref:`class_Reference`, then instances will be freed when no longer in use. No garbage collector exists, just reference counting. By default, all classes that don't define inheritance extend **Reference**. If this is not desired, then a class must inherit :ref:`class_Object` manually and must call ``instance.free()``. To avoid reference cycles that can't be freed, a :ref:`class_WeakRef` function is provided for creating weak references. Here is an example:
de: Wenn eine Klasse von :ref:`class_Reference` erbt, werden nicht mehr verwendete Instanzen freigegeben. Es gibt keinen Garbage Collector, nur Referenzzählung. Standardmäßig erweitern alle Klassen **Referenz**, die keine Vererbung definieren. Wenn dies nicht erwünscht ist, muss eine Klasse :ref:`class_Object` manuell erben und ``instance.free()`` aufrufen. Um Referenzzyklen zu vermeiden, die nicht freigegeben werden können, wird eine Funktion ``weakref`` zum Erstellen schwacher Referenzen bereitgestellt. Hier ist ein Beispiel:

source: Alternatively, when not using references, the ``is_instance_valid(instance)`` can be used to check if an object has been freed.
de: Wenn keine Referenzen verwendet werden, kann alternativ mit ``is_instance_valid(instance)`` überprüft werden, ob ein Objekt freigegeben wurde.
es: Por otra parte, cuando no se utilizan referencias, el ``is_instance_valid(instance)`` puede usarse para comprobar si un objeto ha sido liberado.
ko: 또는, 참조를 사용하지 않을 때, ``is_instance_valid(instance)`` 가 객체가 해제되었는 지를 확인하는데 사용될 수 있습니다.
pt_br: Alternativamente, quando não estiver usando referências, o `` is_instance_valid (instance) `` pode ser usado para verificar se um objeto foi liberado.
zh_cn: 或者，当不使用引用时，可以使用 ``is_instance_valid(instance)`` 来检查对象是否已被释放。

source: Signals
de: Signale
es: Señales
ko: 시그널
pt_br: Sinais
zh_cn: 信号

source: Signals are a tool to emit messages from an object that other objects can react to. To create custom signals for a class, use the ``signal`` keyword.
de: Signale sind ein Werkzeug zum Senden von Nachrichten von einem Objekt, auf die andere Objekte reagieren können. Verwenden Sie das Schlüsselwort ``signal``, um benutzerdefinierte Signale für eine Klasse zu erstellen.
ko: 시그널은 한 객체에서 메시지를 방출해서 메시지를 받을 수 있는 다른 객체가 받는 도구입니다. 클래스에서 맞춤 시그널을 만들려면, ``signal`` 키워드를 사용하세요.
pt_br: Sinais são um modo de enviar mensagens de um objeto para que outros objetos possam reagir. Crie sinais customizados para uma classe usando a palavra-chave ``signal``.
zh_cn: 信号是从对象发出消息的工具，其他对象也可以对此做出反应。要为一个类创建自定义信号，请使用 ``signal`` 关键字。

source: Signals are a `Callback <https://en.wikipedia.org/wiki/Callback_(computer_programming)>`_ mechanism. They also fill the role of Observers, a common programming pattern. For more information, read the `Observer tutorial <https://gameprogrammingpatterns.com/observer.html>`_ in the Game Programming Patterns ebook.
de: Signale sind eine `Rückruffunktion <https://de.wikipedia.org/wiki/R%C3%BCckruffunktion>` _ Mechanismus. Sie übernehmen auch die Rolle der Beobachter, ein gängiges Programmiermuster. Weitere Informationen finden Sie im `Observer-Tutorial (in englischer Sprache)<https://gameprogrammingpatterns.com/observer.html>` _ im eBook Spielprogrammiermuster.
ko: 시그널은 `콜백 <https://ko.wikipedia.org/wiki/%EC%BD%9C%EB%B0%B1>`_ 메커니즘입니다. 그리고 일반적인 프로그래밍 패턴인 옵저버(Observer) 규칙도 있습니다. 자세한 정보는 Game Programming Patterns의 전자책, `Observer tutorial <https://gameprogrammingpatterns.com/observer.html>`_\ 을 참고해주세요.
pt_br: Sinais são um mecanismo de `Callback <https://pt.wikipedia.org/wiki/Callback>`_. Eles também preenchem o papel de observadores, um padrão de programação comum. Para mais informações, leia o tutorial `Observer tutorial <https://gameprogrammingpatterns.com/observer.html>`_ no ebook Game Programming Patterns.
zh_cn: 信号是一种 `回调 <https://en.wikipedia.org/wiki/Callback_(computer_programming)>`_ 机制。它们还充当观察者（一种常见的编程模式）的角色。有关更多信息，请阅读《游戏编程模式》电子书中的 `观察者教程 <https://gameprogrammingpatterns.com/observer.html>`_。

source: You can connect these signals to methods the same way you connect built-in signals of nodes like :ref:`class_Button` or :ref:`class_RigidBody`.
de: Sie können diese Signale auf dieselbe Weise mit Methoden verbinden, wie Sie integrierte Signale von Nodes wie :ref:`class_Button` oder :ref:` class_RigidBody` verbinden.
ko: 맞춤 시그널도 :ref:`class_Button`\ 나 :ref:`class_RigidBody`\ 와 같은 노드에 내장된 시그널을 연결하는 방법과 같은 방식으로 메서드에 연결할 수 있습니다.
pt_br: Esses sinais podem ser conectados a métodos da mesma forma com que você conecta sinais embutidos de nós como :ref:`botões <class_Button>` ou :ref:`RigidBodies <class_RigidBody>`.
zh_cn: 您可以将这些信号连接到方法，方式与连接节点的内置信号（例如 :ref:`class_Button` 或 :ref:`class_RigidBody`）的方式相同。

source: In the example below, we connect the ``health_depleted`` signal from a ``Character`` node to a ``Game`` node. When the ``Character`` node emits the signal, the game node's ``_on_Character_health_depleted`` is called::
de: Im folgenden Beispiel verbinden wir das Signal "health_depleted" von einem "Character" -Node mit einem "Game" -Node. Wenn der ``Character``-Node das Signal aussendet, wird des Game nodes``_on_Character_health_depleted``genannt :
ko: 아래의 예제에서, ``Character`` 노드의 ``health_depleted`` 시그널을 ``Game`` 노드에 연결했습니다. ``Character`` 노드가 시그널을 방출하면, Game 노드의 ``_on_Character_health_depleted``\ 가 호출됩니다::
pt_br: No exemplo abaixo, conectamos o sinal ``health_depleted`` de um nó ``Character`` a um nó ``Game``. Quando o nó ``Character`` emite o sinal, a função ``_on_Character_health_depleted`` é chamada no nó ``Game``::
zh_cn: 在下面的示例中，我们将 ``Character`` 节点的 ``health_depleted`` 信号连接到 ``Game`` 节点。当 ``Character`` 节点发出信号时，游戏节点的 ``_on_Character_health_depleted`` 会被调用：

source: You can emit as many arguments as you want along with a signal.
de: Sie können so viele Argumente wie Sie möchten zusammen mit einem Signal ausgeben.
ko: 하나의 시그널에 원하는 만큼 많은 인수를 함께 방출할 수 있습니다.
pt_br: Você pode emitir quantos argumentos desejar com um sinal.
zh_cn: 您可以发出任意数量的参数附带一个信号。

source: Here is an example where this is useful. Let's say we want a life bar on screen to react to health changes with an animation, but we want to keep the user interface separate from the player in our scene tree.
de: Hier ist ein Beispiel, wo dies nützlich ist. Angenommen, wir möchten, dass eine Lebensleiste auf dem Bildschirm mit einer Animation auf Gesundheitsänderungen reagiert, aber wir möchten in unserem Szenenbaum die Benutzeroberfläche vom Spieler getrennt halten.
ko: 어디서 이 점이 유용하게 쓰이는 지 예제와 함께 알아봅시다. 한 번 상상해봅시다. 체력 막대가 필요합니다. 체력이 변하면 체력 막대도 따라서 변합니다. 하지만 씬 트리에서 플레이어와 사용자 인터페이스는 분리되어 있어야 합니다.
pt_br: Aqui está um exemplo em que isso é útil. Digamos que queremos que uma barra de vida na tela reaja às mudanças de saúde com uma animação, mas queremos manter a interface do usuário separada do player em nossa árvore de cenas.
zh_cn: 这是一个有用的示例。假设我们希望屏幕上的生命条能够通过动画对健康值做出反应，但我们希望在场景树中将用户界面与游戏角色保持独立。

source: In our ``Character.gd`` script, we define a ``health_changed`` signal and emit it with :ref:`Object.emit_signal() <class_Object_method_emit_signal>`, and from a ``Game`` node higher up our scene tree, we connect it to the ``Lifebar`` using the :ref:`Object.connect() <class_Object_method_connect>` method::
de: In unserem ``Character.gd`` -Skript definieren wir ein ``health_changed`` Signal und senden es mit :ref:`Object.emit_signal() <class_Object_method_emit_signal>` und von einem ``Game`` Node weiter oben im Szenenbaum, wir verbinden ihn mit der ``Lebensleiste`` mit der :ref:`Object.connect() <class_Object_method_connect>` Methode:
ko: ``Character.gd`` 스크립트에서 ``health_changed`` 시그널을 정의했습니다. 그리고 :ref:`Object.emit_signal() <class_Object_method_emit_signal>`\ 로 방출합니다. 그리고 앁 트리에서 가장 높이 있는 ``Game`` 노드에서 :ref:`Object.connect() <class_Object_method_connect>` 메서드를 사용해 시그널을 ``Lifebar``\ 에 연결합니다::
pt_br: Em nosso script `` Character.gd``, definimos um sinal `` health_changed`` e o emitimos com: ref: `Object.emit_signal () <class_Object_method_emit_signal>` e no nó `` Game`` acima na árvore de cenas, nós a conectamos à `` Lifebar`` usando o método: ref: `Object.connect () <class_Object_method_connect>` ::
zh_cn: 在我们的 ``Character.gd`` 脚本中，我们定义一个 ``health_changed`` 信号并使用 :ref:`Object.emit_signal() <class_Object_method_emit_signal>` 发出该信号，然后从场景树上方的 ``Game`` 节点，使用 :ref:`Object.connect() <class_Object_method_connect>` 方法将其连接到 ``Lifebar``：

source: To use signals, your class has to extend the ``Object`` class or any type extending it like ``Node``, ``KinematicBody``, ``Control``...
de: Um Signale zu verwenden, muss Ihre Klasse die ``Objekt``-Klasse oder einen beliebigen Typ erweitern, wie zum Beispiel ``Node``, ``KinematicBody``, ``Control`` ...
ko: 시그널을 쓰려면, 클래스가 ``Object`` 클래스나 다른 확장하는 클래스, ``Node``, ``KinematicBody``, ``Control`` 등을 확장(extend)해야 합니다.
pt_br: Para usar sinais, sua classe precisa estender a classe do``Object`` ou alguma classe como``Node``, ``KinematicBody``, ``Control``...
zh_cn: 要使用信号，您的类必须扩展 ``Object`` 类或任何扩展它的类型，例如 ``Node``、 ``KinematicBody``、 ``Control``…

source: In the ``Game`` node, we get both the ``Character`` and ``Lifebar`` nodes, then connect the character, that emits the signal, to the receiver, the ``Lifebar`` node in this case.
de: Im ``Game``-Node erhalten wir sowohl den ``Charakter`` als auch den ``Lebensleiste``-Node und verbinden dann den Charakter, der das Signal aussendet, mit dem Empfänger, in diesem Fall dem ``Lebensleiste``-Node .
ko: ``Game`` 노드에는 ``Character``\ 와 ``Lifebar`` 노드 둘 다 갖고 있습니다. Character를 연결(Connect)하고 시그널을 리시버로 방출합니다. 이 경우는 ``Lifebar``\ 가 해당하겠죠.
pt_br: No nó `` Game``, obtemos os nós `` Character`` e `` Lifebar``, em seguida, conectamos o personagem, que emite o sinal ao receptor`` Lifebar`` nesse caso.
zh_cn: 在 ``Game`` 节点中，我们同时获得 ``Character`` 和 ``Lifebar`` 节点，然后将发出信号的 ``Character`` 连接到接收器，在本例中为 ``Lifebar`` 节点 。

source: This allows the ``Lifebar`` to react to health changes without coupling it to the ``Character`` node.
de: Dies ermöglicht es der ``Lifebar``, auf Gesundheitsänderungen zu reagieren, ohne sie mit dem ``Character``-Knoten zu koppeln.
ko: 이렇게 하면 ``Lifebar``\ 는 ``Character`` 노드와 묶지 않고도 체력 변화에 반응할 수 있습니다.
pt_br: Isso permite que a ``Lifebar`` reaja às alterações de saúde sem acoplá-la ao nó `` Character``.
zh_cn: 这允许 ``Lifebar`` 能够对健康值做出反应，而无需将其耦合到 ``Character`` 节点。

source: You can write optional argument names in parentheses after the signal's definition::
de: Sie können optionale Argumentnamen in Klammern nach der Definition des Signals schreiben:
ko: 시그널을 정의한 후에, 개별적으로 괄호 안에 인수 이름을 적을 수 있습니다::
pt_br: Você pode escrever nomes de argumento opcionais entre parênteses após a definição do sinal::
zh_cn: 您可以在信号的定义后的括号中写上可选的参数名称：

source: These arguments show up in the editor's node dock, and Godot can use them to generate callback functions for you. However, you can still emit any number of arguments when you emit signals; it's up to you to emit the correct values.
de: Diese Argumente werden im Node-Dock des Editors angezeigt und Godot kann sie verwenden um Rückruffunktionen für Sie zu generieren. Sie können jedoch immer noch eine beliebige Anzahl von Argumenten angeben, wenn Sie Signale ausgeben. Es liegt an Ihnen die richtigen Werte auszugeben.
ko: 인수는 편집기의 노드(Node) 독에 보입니다. 그리고 Godot는 이 인수로 콜백 함수를 생성할 수 있습니다. 하지만 시그널을 방출할 때 여전히 많은 수의 인수를 방출할 수 있습니다. 다시 말해 올바른 값을 방출하는 일은 당신에게 달린 것입니다.
pt_br: Estes argumentos aparecem na aba Nó do editor, e o Godot pode usá-los para criar funções para você. Entretanto, você ainda pode emitir qualquer número de argumento quando você emite sinais; é você quem tem que emitir os valores corretos.
zh_cn: 这些参数显示在编辑器的节点停靠面板中，Godot可以使用它们为您生成回调函数。但是，发出信号时仍然可以发出任意数量的参数；由您来发出正确的值。

source: GDScript can bind an array of values to connections between a signal and a method. When the signal is emitted, the callback method receives the bound values. These bound arguments are unique to each connection, and the values will stay the same.
de: GDScript kann ein Array von Werten an Verbindungen zwischen einem Signal und einer Methode binden. Wenn das Signal ausgegeben wird, empfängt die Rückrufmethode die gebundenen Werte. Diese gebundenen Argumente sind für jede Verbindung einzigartig aber die Werte bleiben gleich.
ko: GDScript는 시그널과 메서드 간 연결을 위해 배열의 값에 바인딩할 수 있습니다. 시그널을 방출할 때, 콜백 메서드는 바운드 값을 받습니다. 이 바운드 인수는 각 연결에서 유일하며, 값도 똑같이 유지됩니다.
pt_br: GDScript pode passar uma matriz de argumentos a conexões entre um sinal e um método. Quando o sinal é emitido, chamando o método conectado, os argumentos são dados ao método. Esses argumentos são específicos a cada conexão, e os valores ficarão iguais.
zh_cn: GDScript可以将值数组绑定到信号和方法之间的连接。发出信号时，回调方法将接收绑定值。这些绑定参数对于每个连接都是唯一的，并且值将保持不变。

source: You can use this array of values to add extra constant information to the connection if the emitted signal itself doesn't give you access to all the data that you need.
de: Mit diesem Wertearray können Sie der Verbindung zusätzliche konstante Informationen hinzufügen, wenn das ausgegebene Signal selbst Ihnen keinen Zugriff auf alle benötigten Daten bietet.
ko: 이 배열의 값으로 연결에 여분의 상수 정보를 추가할 수 있습니다. 시그널이 방출됐지만 필요한 데이터로 접근하지 못할 수도 있으니까요.
pt_br: Você pode usar essa matriz de valores para adicionar informações extras constantes à conexão, se o próprio sinal emitido não der acesso a todos os dados necessários.
zh_cn: 如果发出的信号本身不能使您访问所需的所有数据，则可以使用此值数组将额外的常量信息添加到连接。

source: Building on the example above, let's say we want to display a log of the damage taken by each character on the screen, like ``Player1 took 22 damage.``. The ``health_changed`` signal doesn't give us the name of the character that took damage. So when we connect the signal to the in-game console, we can add the character's name in the binds array argument::
de: Aufbauend auf dem obigen Beispiel möchten wir ein Protokoll des von jedem Charakter erlittenen Schadens auf dem Bildschirm anzeigen, z.B. ``Spieler1 hat 22 Schaden erlitten``. Das ``health_changed`` Signal gibt uns nicht den Namen des Charakters, der Schaden genommen hat. Wenn wir also das Signal mit der In-Game-Konsole verbinden, können wir den Namen des Charakters in das Argument binds array einfügen:
ko: 위의 예제를 바탕으로, 화면에서 각 캐릭터가 받은 대미지의 로그를 표시해봅시다. 예를 들면 ``Player1은 22의 대미지를 받았다.``\ 같이 말이죠. ``health_changed`` 시그널은 대미지를 받는 Character의 이름을 주고 있지 않습니다. 따라서 시그널을 게임 내 콘솔에 연결하면, 바인딩 배열 인수에 Character의 이름을 추가할 수 있습니다::
pt_br: Com base no exemplo acima, vamos dizer que queremos exibir um log dos danos recebidos por cada personagem na tela, como ``Player1 levou 22 de dano.``. O sinal ``health_changed`` não fornece o nome do personagem que levou dano. Então quando conectamos o sinal ao console in-game, podemos adicionar o nome do personagem no argumento da matriz de ligações::
zh_cn: 以上面的示例为基础，假设我们要在屏幕上显示每个角色遭受伤害的日志，例如 ``Player1遭受了22伤害。``。``health_changed`` 信号没有给我们提供受到伤害的角色的名称。因此，当我们将信号连接到游戏终端中时，可以在绑定数组参数中添加角色的名称：

source: Our ``BattleLog`` node receives each element in the binds array as an extra argument::
de: Unser ``BattleLog`` -Node empfängt jedes Element im Binds-Array als zusätzliches Argument :
ko: ``BattleLog`` 노드는 바인딩 배열의 각 요소를 추가 인수로 받습니다::
pt_br: Nosso nó ``BattleLog `` recebe cada elemento na matriz de vínculos como um argumento extra::
zh_cn: 我们的 ``BattleLog`` 节点接收绑定数组中的每个元素作为一个额外的参数：

source: Coroutines with yield
de: Co-Routinen mit yield
es: Corrutinas con yield
ko: yield를 가진 코루틴(Coroutine)
pt_br: Corrotinas com yield
zh_cn: 协程使用yield

source: GDScript offers support for `coroutines <https://en.wikipedia.org/wiki/Coroutine>`_ via the :ref:`yield<class_@GDScript_method_yield>` built-in function. Calling ``yield()`` will immediately return from the current function, with the current frozen state of the same function as the return value. Calling ``resume()`` on this resulting object will continue execution and return whatever the function returns. Once resumed, the state object becomes invalid. Here is an example::
de: GDScript bietet Unterstützung für die integrierte Funktion `Coroutinen<https://en.wikipedia.org/wiki/Coroutine>` _ über die integrierte Funktion :ref:`yield <class_ @ GDScript_method_yield>`. Das Aufrufen von ``Yield()`` kehrt sofort von der aktuellen Funktion zurück, wobei der aktuelle eingefrorene Zustand dieselbe Funktion wie der Rückgabewert hat. Wenn Sie für dieses resultierende Objekt ``resume()`` aufrufen, wird die Ausführung fortgesetzt und alles zurückgegeben, was die Funktion zurückgibt. Nach der Wiederaufnahme wird das Statusobjekt ungültig. Hier ist ein Beispiel:
ko: GDScript는 :ref:`yield<class_@GDScript_method_yield>` 내장 함수를 통해 `코루틴(Coroutines) <https://en.wikipedia.org/wiki/Coroutine>`_\ 을 지원합니다. ``yield()``\ 를 호출하면 즉시 현재 함수에서 같은 함수의 현재 상태를 반환합니다. 그리고 ``resume``\ 을 결과 객체에 호출하면 실행이 계속되고 함수가 반환하는 값을 반환합니다. 다시 시작하면 상태 객체는 무효화됩니다. 여기 예제가 있습니다::
pt_br: GDScript oferece suporte para `corrotinas <https://pt.wikipedia.org/wiki/Corotina>`_ através do comando embutido :ref:`yield<class_@GDScript_method_yield>`. Chamar ``yield()`` irá sair imediatamente da função atual, com o estado atual congelado desta mesma função como valor de retorno. Chamar ``resume()`` neste objeto resultante irá continuar a execução da função original do ponto que parou e retornar o que quer que a função retorne. Assim que retomada a execução da função suspensa, o objeto de estado se torna inválido. Aqui está um exemplo::
zh_cn: GDScript通过内置的 :ref:`yield<class_@GDScript_method_yield>` 提供对 `协程 <https://en.wikipedia.org/wiki/Coroutine>`_ 的支持。调用 ``yield()`` 将立即从当前函数返回，并且相同函数的当前冻结状态作为返回值。在此结果对象上调用 ``resume()`` 将继续执行并返回函数返回的任何内容。恢复后，状态对象将无效。这是一个例子：

source: Will print::
de: Ausgabe:
ko: 이렇게 프린트됩니다::
pt_br: Imprimirá::
zh_cn: 将打印：

source: It is also possible to pass values between ``yield()`` and ``resume()``, for example::
de: Es ist auch möglich Werte zwischen ``yield()`` und ``resume()`` zu übergeben, zum Beispiel:
ko: ``yield()``\ 와 ``resume()`` 사이에 값을 전달할 수도 있습니다. 예를 들면::
pt_br: Também é possível passar valores entre ``yield()`` e ``resume()``, por exemplo::
zh_cn: 还可以在 ``yield()`` 和 ``resume()`` 之间传递值，例如：

source: Remember to save the new function state, when using multiple ``yield``\s::
de: Denken Sie daran, den neuen Funktionsstatus zu speichern, wenn Sie mehrere ``yield``\s verwenden:
pt_br: Lembre-se de salvar o estado da nova função, ao utilizar múltiplos ``yield``\s::
zh_cn: 当多次使用``yield``时，记住保存新的函数状态：

source: Coroutines & signals
de: Co-Routinen & Signale
es: Corrutinas y Señales
ko: 코루틴 & 시그널
pt_br: Corrotinas e sinais
zh_cn: 协程&信号

source: The real strength of using ``yield`` is when combined with signals. ``yield`` can accept two arguments, an object and a signal. When the signal is received, execution will recommence. Here are some examples::
de: Die wahre Stärke der Verwendung von ``yield`` liegt in der Kombination mit Signalen. ``yield`` kann zwei Argumente akzeptieren, ein Objekt und ein Signal. Wenn das Signal empfangen wird, beginnt die Ausführung erneut. Hier sind einige Beispiele:
ko: ``yield``\ 의 진정한 힘은 시그널과 결합할 때 나타납니다. ``yield``\ 는 두 개의 인수를 받을 수 있습니다.하나는 객체, 다른 하나는 시그널이죠. 시그널을 받으면 실행이 다시 시작됩니다. 여기 몇 가지 예제가 있습니다::
pt_br: O verdadeiro poder de utilizar ``yield`` é quando combinado com sinais. ``yield`` pode aceitar até dois parâmetros, um objeto e um sinal. Quando o sinal é recebido, a execução irá recomeçar. Abaixo temos alguns exemplos::
zh_cn: 使用 ``yield`` 的真正优势在于与信号结合使用。``yield`` 可以接受两个参数，一个对象和一个信号。收到信号后，将重新开始执行。这里有些例子：

source: Coroutines themselves use the ``completed`` signal when they transition into an invalid state, for example::
de: Koroutinen selbst verwenden das Signal ``completed``, wenn sie in einen ungültigen Zustand übergehen, zum Beispiel:
ko: 코루틴은 무효 상태로 전환할 때 ``complated`` 시그널을 사용합니다. 예를 들어::
pt_br: As próprias corrotinas usam o sinal `` completed`` quando fazem a transição para um estado inválido, por exemplo::
zh_cn: 协程自身转换为无效状态时会使用 ``completed`` 信号，例如：

source: ``my_func`` will only continue execution once both buttons have been pressed.
de: ``my_func`` wird erst weiter ausgeführt, sobald beide Buttons gedrückt wurden.
es: ``my_func`` sólo continuará la ejecución una vez que se hayan presionado ambos botones.
ko: ``my_func``\ 은 오직 두 버튼이 한번에 눌릴 때 계속 실행됩니다.
pt_br: `` my_func`` somente continuará a execução assim que ambos os botões forem pressionados.
zh_cn: ``my_func`` 仅在按下两个按钮后继续执行。

source: You can also get the signal's argument once it's emitted by an object:
de: Sie können das Argument des Signals auch abfragen, sobald es von einem Objekt ausgegeben wird:
zh_cn: 一旦一个信号被某个对象发出，你还可以获取该信号的参数：

source: If there is more than one argument, ``yield`` returns an array containing the arguments::
de: Wenn es mehr als ein Argument gibt, gibt ``yield`` ein Array zurück, das diese Argumente enthält:

source: If you're unsure whether a function may yield or not, or whether it may yield multiple times, you can yield to the ``completed`` signal conditionally:
de: Sollten Sie sich unsicher sein, ob eine Funktion nachgibt oder nicht, oder ob sie mehrfach nachgeben kann, können Sie bedingt bis zum ``completed`` Signal nachgeben:
zh_cn: 如果你不确定一个函数是否还会继续yield，可以使用信号量completed，来作为判断依据:

source: This ensures that the function returns whatever it was supposed to return regardless of whether coroutines were used internally. Note that using ``while`` would be redundant here as the ``completed`` signal is only emitted when the function didn't yield anymore.
de: Dies stellt sicher, dass die Funktion alles zurückgibt, was sie zurückgeben sollte, unabhängig davon, ob Coroutinen intern verwendet wurden. Beachten Sie, dass die Verwendung von ``während`` hier redundant wäre, da das Signal ``abgeschlossen`` nur ausgegeben wird, wenn die Funktion nicht mehr nachgibt.

source: `onready` keyword
de: `onready` Schlüsselwort

source: When using nodes, it's common to desire to keep references to parts of the scene in a variable. As scenes are only warranted to be configured when entering the active scene tree, the sub-nodes can only be obtained when a call to ``Node._ready()`` is made.
de: Bei der Verwendung von Nodes ist es üblich, Verweise auf Teile der Szene in einer Variablen zu behalten. Da Szenen nur beim Aufrufen des aktiven Szenenbaums konfiguriert werden müssen, können die Unterknoten nur abgerufen werden, wenn ein Aufruf von "Node._ready()" erfolgt.
ko: 노드를 쓸 때, 씬의 일부를 변수로 참조하는 것이 일반적입니다. 씬은 활성 씬 트리에 들어갈 때만 구성하기 때문에, 하위 노드는 ``Node._ready()``\ 로의 호출이 있을 때만 가져올 수 있습니다.
pt_br: Ao usar nós, é comum desejar manter referências a partes da cena em uma variável. Como as cenas só podem ser configuradas ao entrar na árvore da cena ativa, os subnós só podem ser obtidos quando uma chamada para ``Node._ready()`` é feita.
zh_cn: 使用节点时，通常希望将对场景部分的引用保留在变量中。由于仅在进入活动场景树时才保证要配置场景，因此只有在调用 ``Node._ready()`` 时才能获得子节点。

source: This can get a little cumbersome, especially when nodes and external references pile up. For this, GDScript has the ``onready`` keyword, that defers initialization of a member variable until ``_ready()`` is called. It can replace the above code with a single line::
de: Dies kann etwas umständlich werden, insbesondere wenn sich Nodes und externe Referenzen häufen. Zu diesem Zweck hat GDScript das Schlüsselwort "onready", das die Initialisierung einer Mitgliedsvariablen verzögert, bis "_ready()" "aufgerufen wird. Es kann den obigen Code durch eine einzelne Zeile ersetzen :
ko: 이 작업은 특히, 노드와 외부 참조가 쌓이다 보면 번거로울 수 있습니다. 이를 위해 GDScript는 ``onready`` 키워드를 갖고 있습니다. 이 키워드로 멤버 변수의 초기화는 ``_ready()``\ 를 호출할 때까지 지연합니다. 위의 코드를 한 줄로 대체가 가능합니다::
pt_br: Isto pode ficar meio confuso, especialmente com muitos nós e referências externas. Para isso, GDScript tem a palavra-chave ``onready``, que atrasa a inicialização da variável de um membro até que ``_ready()`` seja chamado. Ela pode substituir o código acima por uma única linha::
zh_cn: 这可能会有些麻烦，尤其是当节点和外部引用堆积时。为此，GDScript具有关键字 ``onready``，将成员变量的初始化推迟到调用 ``_ready()``。它可以用一行替换上面的代码：
