Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_styleguide.po
Languages: de, ja, pl

source: To declare a variable's type, use ``<variable>: <type>``:
de: Verwenden Sie ``<Variable>: <Typ>`` um den Typ einer Variablen zu deklarieren:

source: To declare the return type of a function, use ``-> <type>``:
de: Um den Rückgabetyp einer Funktion zu deklarieren Verwenden Sie ``-> <type>``:
ja: 関数の戻り値の定義をするには、``-> <type>``を使ってください:

source: Inferred types
de: auf Typen rückschließen

source: In most cases you can let the compiler infer the type, using ``:=``:
de: In den meisten Fällen können Sie den Compiler auf den Typ schließen lassen (Compiler soll versuchen den Typ zu erkennen), indem Sie ``: =`` nutzen:

source: However, in a few cases when context is missing, the compiler falls back to the function's return type. For example, ``get_node()`` cannot infer a type unless the scene or file of the node is loaded in memory. In this case, you should set the type explicitly.
de: In einigen Fällen bei denen der Kontext fehlt, greift der Compiler jedoch auf den Rückgabetyp der Funktion zurück. Beispielsweise kann ``get_node()`` keine Rückschlüsse auf den Typ ziehen, es sei denn die Szene oder Datei des Nodes wird in den Speicher geladen. In diesem Fall sollten Sie den Typ explizit festlegen.

source: Description
pl: Opis

source: This styleguide lists conventions to write elegant GDScript. The goal is to encourage writing clean, readable code and promote consistency across projects, discussions, and tutorials. Hopefully, this will also encourage development of auto-formatting tools.
pl: Ten przewodnik po stylistyce eleganckiego pisania eleganckiego GDScriptu. Celem jest zachęcenie do pisania czystego i czytelnego kodu oraz promowanie spójności pomiędzy projektami, dyskusjami i samouczkami. Miejmy nadzieję, że zachęci to również do opracowania narzędzi do autoformatowania.

source: Since GDScript is close to Python, this guide is inspired by Python's `PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__ programming styleguide.
pl: Ponieważ GDScript jest związany z Pythonem, ten przewodnik jest inspirowany przez stylem pisania w Pythonie `PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__.

source: Indent type: Tabs *(editor default)*
pl: Typ wcięcia: Tabulator *(domyślne w edytorze) *

source: Indent size: 4 *(editor default)*
pl: Rozmiar wcięcia: 4 *(domyślne w edytorze)*

source: Never combine multiple statements on a single line. No, C programmers, not with a single line conditional statement (except with the ternary operator)!
pl: Nigdy nie należy łączyć wielu instrukcji w jednej linii. Programiści C i C++, nie piszcie instrukcji warunkowych w jednej linii (z wyjątkiem operatora trójargumentowego)!

source: Always use one space around operators and after commas. Avoid extra spaces in dictionary references and function calls, or to create "columns."
pl: Zawsze używaj odstęp jednego znaku(spacji) wokół operatorów i po przecinku. Unikaj dodatkowych spacji w odwołaniach do słowników i wywołań funkcji lub tworzenia "kolumn."

source: **NEVER**:
pl: **NIGDY**:

source: These naming conventions follow the Godot Engine style. Breaking these will make your code clash with the built-in naming conventions, which is ugly.
pl: Owe konwencje nazywania są zgodne ze stylem używanym Godot Engine. Ich złamanie spowoduje, że twój kod będzie sprzeczny z daną konwencją nazewniczą i jest po prostu brzydkie.

source: Use PascalCase: ``extends KinematicBody``
pl: Użyj PascalCase: ``extends KinematicBody``

source: Also when loading a class into a constant or variable:
pl: Również podczas ładowania klasy do stałej lub zmiennej:

source: Use snake\_case: ``get_node()``
pl: Użyj snake\_case: ``get_node()``

source: Prepend a single underscore (\_) to virtual methods (functions the user must override), private functions, and private variables: ``func _ready()``
pl: Stosuj pojedyncze podkreślenie (\_) do metod wirtualnych (funkcje, które użytkownik musi nadpisać), funkcji prywatnych i zmiennych prywatnych: ``func _ready()``

source: Use past tense:
pl: Używaj czasu przeszłego:

source: Constants
pl: Stałe

source: Use CONSTANT\_CASE, all caps, with an underscore (\_) to separate words: ``const MAX_SPEED = 200``
pl: Używaj CONSTANT\_CASE, wielkimi literami, z podkreśleniem (\_), aby oddzielić słowa: ``const ILOSC_DNI = 200``
