Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_advanced.po
Languages: es, fr, ko, pl, pt_br, ru, uk

source: Arrays in dynamically typed languages can contain many different mixed datatypes inside and are always dynamic (can be resized at any time). Compare for example arrays in statically typed languages:
es: Los arrays en lenguajes de tipado dinámico pueden contener mezclados muchos tipos diferentes de datos y son siempre dinámicos (pueden cambiar su tamaño en cualquier momento). Compara, por ejemplo, los arrays en lenguajes de tipado estático:
fr: Les tableaux en langages typées dynamiquement peuvent contenir de nombreux types de données mixtes différents à l'intérieur et sont toujours dynamiques (redimensionnables à tout moment). Comparez par exemple les tableaux dans des langages typées statiquement :
ko: 동적 타입 언어에서의 배열은 다양한 혼합 데이터 타입을 포함할 수 있으며 항상 동적입니다 (어느 때나 크기가 조절될 수 있습니다). 정적 타입 언어의 배열과 비교하는 예제:
pl: Tablice w dynamicznie typowanych językach mogą zawierać wiele różnych mieszanych typów danych i są zawsze dynamiczne (można je zmieniać w dowolnym momencie). Porównaj np. tablice w statycznie wpisanych językach:
pt_br: Arrays em linguagens dinamicamente tipadas podem conter muitos tipos de dados mistos diferentes e são sempre dinâmicos (podem ser redimensionados a qualquer momento). Compare, por exemplo, arrays em linguagens estaticamente tipadas:
ru: Массивы в динамически типизированных языках могут содержать элементы разных типов данных; массивы всегда являются динамическими (т. е. их размер может быть изменён в любой момент). Сравните с примерами массивов в статически типизированных языках:
uk: Масиви в динамічних мовах можуть містити багато різних змішаних типів даних всередині і завжди динамічні (їх можна змінити в будь-який час). Порівняйте, наприклад, масиви в статичних мовах:

source: And in GDScript:
es: Y en GDScript:
fr: Et en GDScript :
ko: 그리고 GDScript에서는:
pl: I w GDScript:
pt_br: E no GDScript:
ru: И в GDScript:
uk: І в GDScript:

source: In dynamically typed languages, arrays can also double as other datatypes, such as lists:
es: En lenguajes de tipado dinámico, los arrays pueden replicar otros tipos de datos, como listas:
fr: Dans les langages typées dynamiquement, les tableaux peuvent aussi servir comme autres types de données, comme les listes :
ko: 동적 타입 언어에서, 배열은 목록과 같이, 다른 데이터 타입으로 두 배가 될 수도 있습니다:
pt_br: Em linguagens dinamicamente tipadas, os arrays também podem ser usados como outros tipos de dados, como listas:
ru: В динамически типизированных языках массивы могут быть заменены другими типами, такими как списки:

source: Or unordered sets:
es: O conjuntos desordenados:
fr: Ou des ensembles non ordonnés :
ko: 또는 순서가 없는 세트가 될 수 있습니다:
pl: Lub nieuporządkowane zestawy:
pt_br: Ou conjuntos não ordenados:
ru: Или неупорядоченные множества:

source: Dictionaries
es: Diccionarios
fr: Les dictionnaires
ko: 딕셔너리
pl: Słowniki
ru: Словари (Dictionaries)
uk: Словники

source: Dictionaries are a powerful tool in dynamically typed languages. Most programmers that come from statically typed languages (such as C++ or C#) ignore their existence and make their life unnecessarily more difficult. This datatype is generally not present in such languages (or only in limited form).
es: Los diccionarios son una herramienta poderosa en lenguajes de tipado dinámico. La mayoría de los programadores que provienen de lenguajes de programación estáticos (como C++ o C#) ignoran su existencia y hacen su vida más difícil innecesariamente. Este tipo de datos generalmente no está presente en tales lenguajes (o sólo en forma limitada).
fr: Les dictionnaires sont un outil très puissant dans les langages dynamiquement typés. La plupart des programmeurs qui viennent de langages typés statiquement (comme C++ ou C#) ignorent leur existence et se rendent la vie inutilement plus difficile. Ce type de données n'est généralement pas présent dans ces langages (ou seulement sous une forme limitée).
ko: 딕셔너리는 동적 타입 언어에서 강력한 도구입니다. 정적 타입 언어 (C++나 C#)에서 온 대부분의 프로그래머들이 이 존재를 무시한 채 그들의 삶을 더 어렵게 만들고 있습니다. 이 데이터 타입은 일반적으로 그러한 언어 (또는 제한된 형태)로 존재하지 않습니다.
ru: Словари являются мощным инструментом в динамически типизированных языках. Большинство программистов из статически типизированных языков (таких как C++ или C#) игнорируют существование словарей и усложняют этим себе жизнь. Этот тип данных обычно отсутствует в таких языках (или присутствует лишь в ограниченной форме).
uk: Словники - це потужний інструмент у динамічних мовах. Більшість програмістів, які зі статистичних мов (наприклад C++, або C#), ігнорують їх існування та ускладнюють собі життя. Цей тип даних, як правило, відсутній в таких мовах (або існує в обмеженій формі).

source: Dictionaries can map any value to any other value with complete disregard for the datatype used as either key or value. Contrary to popular belief, they are efficient because they can be implemented with hash tables. They are, in fact, so efficient that some languages will go as far as implementing arrays as dictionaries.
es: Los diccionarios pueden asignar cualquier valor a cualquier otro valor sin tener en cuenta el tipo de datos utilizado como clave o valor. En contra de la creencia popular, son eficientes porque se pueden implementar con tablas de hash. De hecho, son tan eficientes que algunos idiomas llegan a implementar arrays como diccionarios.
fr: Les dictionnaires peuvent associer n'importe quelle valeur à n'importe quelle autre valeur sans tenir compte du type de données utilisé comme clé ou valeur. Contrairement à la croyance populaire, ils sont très efficaces car ils peuvent être implémentés avec des tables de hachage. Ils sont, en fait, si efficaces que certains langages iront jusqu'à implémenter les tableaux comme des dictionnaires.
ko: 딕셔너리는 키 또는 값으로 사용되는 데이터 타입을 무시하고 다른 값으로 매핑 할 수 있습니다. 대중적 신념과는 반대로, 그들은 해시 테이블로 구현될 수 있기 때문에 효과적입니다. 사실, 일부 언어는 배열을 딕셔너리로 구현하는 것이 더 효과적입니다.
pl: Słowniki mogą mapować dowolne wartości na dowolne inne wartości, bez względu na to, czy są one kluczem czy wartością. Wbrew powszechnemu przekonaniu są one efektywne, ponieważ można je realizować za pomocą haszowanych tablic. W rzeczywistości są one tak wydajne, że niektóre języki implementują tablice jako słowniki.
pt_br: Os dicionários podem mapear qualquer valor para qualquer outro valor com total desconsideração do tipo de dados usado como chave ou valor. Ao contrário da crença popular, eles são eficientes porque podem ser implementados com tabelas de hash. Eles são, de fato, tão eficientes que algumas linguagens vão tão longe quanto implementar matrizes como dicionários.
ru: Словари могут сопоставлять любое значение с любым другим значением, полностью игнорируя тип данных, используемый в качестве ключа или значения. Вопреки распространенному мнению, они эффективны, потому что могут быть реализованы с помощью хэш-таблиц. Они, фактически, настолько эффективны, что в некоторых языках массивы реализуют как словари.
uk: Словники можуть зіставляти будь-яке значення з будь-яким іншим значенням з повним ігноруванням типу даних, який використовується як ключ, або значення. Всупереч поширеній думці, вони ефективні, оскільки їх можна реалізувати за допомогою хеш-таблиць. Насправді вони настільки ефективні, що деякі мови реалізують масиви, як словники.

source: Example of Dictionary:
es: Ejemplo de Diccionario:
fr: Exemple de dictionnaire :
ko: 딕셔너리의 예제:
pl: Przykład słownika:
pt_br: Exemplo de Dictionary:
ru: Пример словаря:
uk: Приклад словника:

source: Dictionaries are also dynamic, keys can be added or removed at any point at little cost:
es: Los diccionarios también son dinámicos, las claves pueden ser agregadas y eliminadas en cualquier punto a muy bajo costo:
fr: Les dictionnaires sont également dynamiques, les clés peuvent être ajoutées ou supprimées à tout moment et à faible coût :
ko: 딕셔너리 또한 동적이기에, 적은 손해로 어디에나 키를 추가하고 삭제할 수 있습니다:
pl: Słowniki są również dynamiczne, klucze mogą być dodawane lub usuwane w dowolnym momencie niewielkim kosztem:
pt_br: Dictionaries também são dinâmicos, as chaves podem ser adicionadas ou removidas a qualquer momento a baixo custo:
ru: Словари также являются динамическими, ключи могут добавляться или удаляться в любой момент при небольших затратах:
uk: Словники також динамічні, ключі можна додавати, або видаляти, в будь-якій точці з малими затратами:

source: In most cases, two-dimensional arrays can often be implemented more easily with dictionaries. Here's a simple battleship game example:
es: En la mayoría de los caso, los arrays bidimensionales pueden frecuentemente ser implementados más fácilmente como diccionarios. Aquí hay un juego simple de batalla naval de ejemplo:
fr: Dans la plupart des cas, les tableaux bidimensionnels peuvent souvent être implémentés plus facilement avec des dictionnaires. Voici un exemple de jeu de bataille navale simple :
ko: 대부분의 경우, 2 차원 배열은 종종 딕셔너리로 더 쉽게 구현될 수 있습니다. 여기 간단한 전함 게임 예제가 있습니다:
pl: W większości przypadków za pomocą słowników można łatwiej zaimplementować tablice dwuwymiarowe. Oto prosty przykład gry w statki:
pt_br: Na maioria dos casos, arrays bidimensionais, muitas vezes podem ser implementados mais facilmente com dictionaries. Aqui está um exemplo de jogo de batalha naval simples:
ru: В большинстве случаев двумерные массивы могут быть реализованы с помощью словарей. Вот пример игры "морской бой":
uk: У більшості випадків двовимірні масиви часто можна легше реалізувати за допомогою словників. Ось простий приклад гри морський бій:

source: Dictionaries can also be used as data markup or quick structures. While GDScript's dictionaries resemble python dictionaries, it also supports Lua style syntax and indexing, which makes it useful for writing initial states and quick structs:
es: Los diccionarios también se pueden utilizar como marcadores de datos o estructuras rápidas. Mientras que los diccionarios GDScript se asemejan a los diccionarios python, también soportan sintaxis e indexación estilo Lua, lo que lo hace útil para escribir estados iniciales y estructuras rápidas:
fr: Les dictionnaires peuvent également être utilisés comme balises de données ou comme structures rapides. Bien que les dictionnaires GDScript ressemblent aux dictionnaires python, ils supportent également la syntaxe et l'indexation de style Lua, ce qui le rend très utile pour écrire des états initiaux et des structures rapides :
ko: 딕셔너리는 또한 데이터 마크업이나 빠른 구조에도 사용될 수 있습니다. GDScript 딕셔너리가 python 딕셔너리와 닮은 한편, GDScript는 초기 상태와 빠른 구조체를 작성하는 데 유용한 Lua 스타일 문법과 인덱싱도 지원합니다:
ru: Словари могут также использоваться как разметка данных или быстрые структуры. Хотя словари GDScript напоминают словари python, он также поддерживает синтаксис и индексацию в стиле Lua, что делает его полезным для написания начальных состояний и быстрых структур:
uk: Словники також можуть використовуватися як розмітка даних, або швидкі структури. Хоча словники GDScript нагадують словники python, вони також підтримують синтаксис та індексацію стилю Lua, що робить їх корисними для написання початкових станів та швидких структур:

source: For & while
es: For y While
fr: Boucles for et while
pl: For i while
pt_br: For e while
ru: Циклы for и while
uk: For та while

source: Iterating in some statically typed languages can be quite complex:
es: La iteración en lenguajes estáticamente tipados puede ser bastante compleja:
fr: L'itération dans certains langages typées statiquement peut être assez complexe :
ko: 일부 정적 타입 언어에서 반복은 꽤 복잡해질 수 있습니다:
pl: Iterowanie w niektórych językach statycznych może być złożone:
pt_br: Iterar em algumas linguagens estaticamente tipadas pode ser bastante complexo:
ru: Циклы в некоторых статически типизированных языках могут быть довольно сложными:
uk: Ітерація в деяких мовах статичного типу може бути досить складною:

source: This is usually greatly simplified in dynamically typed languages:
es: Esto es usualmente muy simplificado en lenguajes dinámicamente tipificados:
fr: Ceci est généralement grandement simplifié dans les langages dynamiquement typés :
ko: 보통 동적 타입 언어에서는 이것이 매우 단순화됩니다:
pl: Zazwyczaj jest to znacznie uproszczone w dynamicznie pisanych językach:
pt_br: Isto é geralmente bastante simplificado em linguagens tipificadas dinamicamente:
ru: В динамически типизированных языках это выглядит значительно проще:
uk: В динамічно набраних мовах вона зазвичай значно спрощена:

source: Container datatypes (arrays and dictionaries) are iterable. Dictionaries allow iterating the keys:
es: Los tipos de datos de los containers (matrices y diccionarios) son iterables. Los diccionarios permiten iterar entre las claves:
fr: Les types de données de conteneurs (tableaux et dictionnaires) sont itérables. Les dictionnaires permettent d'itérer les clés :
ko: 컨테이너 데이터 타입 (배열과 딕셔너리)도 반복 가능합니다. 딕셔너리는 키를 반복할 수 있습니다:
pl: Kontenerowe typy danych (tablice i słowniki) są iteracyjne. Słowniki umożliwiają iterowanie kluczy:
pt_br: Tipos de dados container (arrays e dictionaries) são iteráveis. Dictionaries permitem a iteração das chaves:
ru: Контейнеры (массивы и словари) являются итерируемыми. Словари позволяют перебирать ключи:
uk: Контейнерні типи даних (масиви та словники) піддаються ітерації. Словники дозволяють перебирати ключі:

source: Iterating with indices is also possible:
es: Iterar con índices también es posible:
fr: L'itération avec les indices est également possible :
ko: 인덱스로 반복하기도 가능합니다:
pt_br: Também é possível iterar com índices:
ru: Итерация с индексами также возможна:
uk: Можлива ітерація з індексами:

source: The range() function can take 3 arguments:
es: La función range() puede tomar 3 argumentos:
fr: La fonction range() peut prendre 3 arguments :
ko: range() 함수는 3개의 인수를 가질 수 있습니다:
pl: Funkcja range() może przyjmować 3 argumenty:
pt_br: A função range() pode ter 3 argumentos:
ru: Функция range() может принимать 3 аргумента:
uk: Функція range() може приймати 3 аргументи:

source: Some statically typed programming language examples:
es: Algunos ejemplos de lenguajes estáticamente tipados:
fr: Quelques exemples de langage de programmation typés statiquement :
ko: 일부 정적 타입 프로그래밍 언어 예제:
ru: Примеры в статически типизированных языках:
uk: Деякі приклади зі статистичних мов:

source: Translate to:
es: Traducir a:
fr: Se traduire en :
ko: 번역:
pl: Przetłumacz na:
pt_br: Traduzir para:
ru: Транслируется в:
uk: Переведені в динамічні:

source: And backwards looping is done through a negative counter:
es: Y el loop invertido se realiza a través de un contador negativo:
fr: Et l'itération à rebours se fait à l'aide d'un compteur négatif :
ko: 그리고 음수 카운터를 통해 역방향 루프가 됩니다:
pl: Odliczanie od tyłu jest realizowane poprzez używanie ujemnego indeksu:
pt_br: E a repetição inversa é feita através de um contador negativo:
ru: И обратный цикл выполняется через отрицательный счётчик цикла:
uk: А зворотній цикл здійснюється за допомогою негативного лічильника:

source: Becomes:
es: Se vuelve:
fr: devient :
ko: 이렇게 됩니다:
pl: Staje się:
pt_br: Torna-se:
ru: Становится:
uk: Стає:

source: While
fr: Tant que
pl: Podczas
ru: Пока

source: while() loops are the same everywhere:
es: Los bucles while() son los mismos en todas partes:
fr: les boucles while() sont les mêmes partout :
ko: while() 루프는 모든 곳에서 동일합니다:
pl: Pętle while() są wszędzie takie same:
pt_br: Loops while() são os mesmos em todos os lugares:
ru: Циклы while() везде одинаковые:
uk: while() цикли всюди однакові:

source: Custom iterators
es: Itineradores personalizados
fr: Itérateurs personnalisés
ko: 맞춤 반복자(Iterator)
pl: Niestandardowe iteratory
pt_br: Iteradores personalizados
ru: Пользовательские итераторы
uk: Власні ітератори

source: You can create custom iterators in case the default ones don't quite meet your needs by overriding the Variant class's ``_iter_init``, ``_iter_next``, and ``_iter_get`` functions in your script. An example implementation of a forward iterator follows:
es: Puedes crear iteradores personalizados en caso de que los predeterminados no cumplan con tus necesidades anulando las funciones ``_iter_init``, ``_iter_next``, e ``_iter_get`` de la clase Variant en su script. A continuación se muestra un ejemplo de implementación de un iterador avanzado:
fr: Vous pouvez créer des itérateurs personnalisés dans le cas où ceux par défaut ne répondent pas tout à fait à vos besoins, en redéfinissant les fonctions de la classe Variant ``_iter_init``, ``_iter_next``, et ``_iter_get`` dans votre script. Voici un exemple d'implémentation d'un tel itérateur :
ko: 기본 반복자가 필요에 맞지 않는다면 변수 클래스의 스크립트의 ``_iter_init``, ``_iter_next``, 그리고 ``_iter_get`` 함수를 오버라이딩하여 맞춤 반복자를 생성하실 수 있습니다. forward 반복자의 예제 구현은 다음과 같습니다:
pt_br: Você pode criar iteradores personalizados caso os existentes não satisfaçam suas necessidades, sobrescrevendo as funções `` _iter_init``, `` _iter_next`` e `` _iter_get`` da classe Variant em seu script. Aqui está um exemplo de implementação de um iterador avançado:
ru: Вы можете создавать собственные итераторы в случае, если стандартные по умолчанию не вполне соответствуют вашим потребностям, переопределив функции ``_iter_init``, ``_iter_next`` и ``_iter_get`` класса Variant в вашем скрипте. Ниже приведен пример реализации итератора прямого действия:
uk: Ви можете створювати власні ітератори, якщо стандартні не відповідають всім вашим потребам, перевизначивши функції ``_iter_init``, ``_iter_next``, і ``_iter_get``класу Variant в вашому скрипті. Приклад реалізації ітератора:

source: And it can be used like any other iterator:
es: Y se puede utilizar como cualquier otro iterador:
fr: Et il peut être utilisé comme n'importe quel autre itérateur :
ko: 그리고 모든 다른 반복자처럼 사용될 수 있습니다:
pl: I może być używany jak każdy inny iterator:
pt_br: E pode ser usado como qualquer outro iterador:
ru: И его можно использовать, как и любой другой итератор:
uk: І його можна використовувати, як і будь-який інший ітератор:

source: Make sure to reset the state of the iterator in ``_iter_init``, otherwise nested for-loops that use custom iterators will not work as expected.
es: Asegúrate de restablecer el estado del iterador en ``_iter_init``, de lo contrario, los bucles for que utilizan iteradores personalizados no funcionarán como se espera.
fr: Assurez-vous de réinitialiser l'état de l'itérateur dans ``_iter_init``, sinon les boucles imbriquées qui utilisent des itérateurs personnalisés ne fonctionneront pas comme prévu.
ko: ``_iter_init`` 에서 반복자의 상태를 리셋해야 합니다, 그렇지 않으면 맞춤 반복자에 사용하는 중첩된 for 루프가 예상대로 작동하지 않을 것입니다.
pl: Upewnić się, że w ``_iter_init`` zresetowany został stan iteratora, w przeciwnym razie, zagnieżdżone pętle, w których używane są niestandardowe iteratory, nie będą działać zgodnie z oczekiwaniami.
pt_br: Certifique-se de redefinir o estado do iterador em `` _iter_init``, caso contrário, loops for aninhados que usam iteradores personalizados não funcionarão como esperado.
ru: Обязательно сбросьте состояние итератора в ``_iter_init``, иначе вложенные for-циклы, использующие пользовательские итераторы не будут работать, как ожидалось.
uk: Переконайтеся, що скинули стан ітератора ``_iter_init``, інакше вкладені for-цикли, які використовують спеціальні ітератори, не працюватимуть як очікувалося.

source: Duck typing
es: Tipado dinámico (duck typing)
fr: Le typage canard (duck typing)
ko: 덕 타이핑(Duck typing)
ru: Утиная типизация
uk: Качина типізація

source: One of the most difficult concepts to grasp when moving from a statically typed language to a dynamic one is duck typing. Duck typing makes overall code design much simpler and straightforward to write, but it's not obvious how it works.
es: Uno de los conceptos más difíciles de entender a la hora de pasar de un lenguaje de tipado estático a otro dinámico es el duck typing. Duck typing hace que el diseño general del código sea mucho más simple y sencillo de escribir, pero no es obvio cómo funciona.
fr: L'un des concepts les plus difficiles à saisir lorsqu'on passe d'un langage typé statiquement à un langage dynamique est le duck typing. Ce typage ad hoc rend la conception globale du code beaucoup plus simple et directe à écrire, mais il n'est pas évident de savoir comment cela fonctionne.
ko: 정적 타입 언어에서 동적 타입 언어로 바꿀 때 이해하기 어려운 개념들 중 하나가 덕 타이핑입니다. 덕 타이핑은 전체 코드 설계를 더 간단하고 쓰기 쉽게 만들어주지만, 어떻게 작동하는지 분명하지 않습니다.
pt_br: Um dos conceitos mais difíceis de entender quando passa de uma linguagem estaticamente tipada para uma dinâmica é duck typing. Duck typing faz com que o design geral do código seja mais simples e direto de escrever, mas não é óbvio como ele funciona.
ru: Одной из самых сложных концепций, которую нужно понять при переходе от языка со статической типизацией к динамической, является Утиная типизация. Утиная типизация делает общий дизайн кода намного проще и понятнее для написания, но для новичка это может быть не так очевидно.
uk: Однією з найскладніших для розуміння концепцій при переході від статичної мови до динамічної, є качина типізація. Качина типізація робить загальний дизайн коду набагато простішим у написанні, але її робота не очевидна.

source: As an example, imagine a situation where a big rock is falling down a tunnel, smashing everything on its way. The code for the rock, in a statically typed language would be something like:
es: Por ejemplo, imagina una situación en la que una gran roca cae por un túnel, aplastando todo en su camino. El código para la roca, en un lenguaje de tipado estático sería algo así como:
fr: Par exemple, imaginez une situation où un gros rocher tombe dans un tunnel, détruisant tout sur son passage. Le code pour le rocher, dans un langage typé statiquement, serait quelque chose comme :
ko: 예제와 같이, 큰 바위가 터널로 떨어지고 있는 상황을 생각해보세요, 그 길의 모든 것들을 박살내 버립니다. 바위의 코드는, 정적 언어에서는 다음과 같이 될 것입니다:
pl: Jako przykład wyobraź sobie sytuację, w której duża skała opada w dół tunelu, rozbijając wszystko po drodze. Kod skały, w statycznie wpisanym języku, byłby czymś w rodzaju:
pt_br: Como exemplo, imagine uma situação onde uma grande rocha está caindo de um túnel, esmagando tudo em seu caminho. O código para a rocha, em uma linguagem estaticamente tipada seria algo como:
ru: В качестве примера представим ситуацию, когда большой камень падает по туннелю, разбивая все на своем пути. Код для камня на статически типизированном языке будет выглядеть примерно так:
uk: Як приклад, уявіть ситуацію, коли великий камінь котиться по тунелю, розбиваючи все на своєму шляху. Код для каменя, в статичній мові, був би таким:
