Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_basics.po
Languages: de, es, ko, pt_br, zh_cn

source: If the script is located in the ``res://addons/`` directory, ``class_name`` will only cause the node to show up in the **Create New Node** dialog if the script is part of an *enabled* editor plugin. See :ref:`doc_making_plugins` for more information.
de: Wenn sich das Skript im Verzeichnis ``res://addons/`` befindet, bewirkt ``class_name`` nur dann, dass das Node im Dialog **Neues Node erstellen** angezeigt wird, wenn das Skript Teil eines *aktivierten* Editor-Plugins ist. Siehe :ref:`doc_making_plugins` für weitere Informationen.

source: Here's a class file example:
de: Hier ist ein Beispiel für eine Klassendatei:
es: Aquí hay un ejemplo de archivo de clase:
ko: 클래스 파일 예제입니다:
pt_br: Aqui está um exemplo de um arquivo de classe:
zh_cn: 这是一个类文件示例：

source: Godot's class syntax is compact: it can only contain member variables or functions. You can use static functions, but not static member variables. In the same way, the engine initializes variables every time you create an instance, and this includes arrays and dictionaries. This is in the spirit of thread safety, since scripts can be initialized in separate threads without the user knowing.
de: Die Klassensyntax von Godot ist kompakt: Sie kann nur Mitgliedsvariablen oder Funktionen enthalten. Sie können statische Funktionen verwenden, jedoch keine statischen Mitgliedsvariablen. Auf die gleiche Weise initialisiert die Engine jedes Mal Variablen wenn Sie eine Instanz erstellen, einschließlich Arrays und Wörterbücher. Dies dient der Thread-Sicherheit, da Skripte in separaten Threads initialisiert werden können, ohne dass der Benutzer dies weiß.
es: La sintaxis de clase de Godot es compacta: solo puede contener variables o funciones miembro. Puede usar funciones estáticas, pero no variables miembro estáticas. De la misma manera, el motor inicializa las variables cada vez que creas una instancia, y esto incluye Arrays y Dictionaries. Esto está en el espíritu de seguridad de subprocesos, ya que los scripts pueden inicializarse en subprocesos separados sin que el usuario lo sepa.
ko: Godot의 클래스 문법은 간결합니다: 오직 멤버 변수 혹은 함수만 가질 수 있습니다. 정적 함수를 사용할 수 있지만, 정적 멤버 변수는 사용할 수 없습니다. 이처럼 엔진은 인스턴스를 만드는 매 시간마다 변수를 초기화합니다. 그리고 여기에는 배열과 딕셔너리가 포함됩니다. 스레드 안전의 정신이 비롯된 것입니다. 여러 스레드에서 스크립트가 사용자 모르게 초기화될 수 있기 때문입니다.
pt_br: A sintaxe da classe do Godot é compacta: ela só pode conter variáveis membros ou funções. Você pode utilizar funções estáticas, mas não membros variáveis não-estáticas. Do mesmo modo, o motor inicializará variáveis toda vez que você criar uma instância, e isso inclui arrays e dicionários. Isso serve para segurança de threads, já que scripts podem ser inicializados em threads separados sem que o usuário saiba.
zh_cn: Godot的类语法很紧凑：它只能包含成员变量或函数。可以使用静态函数，但不能使用静态成员变量。同样，每次创建实例时，引擎都会初始化变量，这包括数组和字典。这是线程安全的精神，因为脚本可以在用户不知情的情况下在单独的线程中初始化。

source: Inheritance
de: Vererbung
es: Herencia
ko: 상속(Inheritance)
pt_br: Herança
zh_cn: 继承

source: A class (stored as a file) can inherit from:
de: Eine Klasse (gespeichert als Datei) kann erben von:
ko: (파일로 저장한) 클래스는 여기서 상속될 수 있습니다:
pt_br: Uma classe (salva como um arquivo) pode herdar de:
zh_cn: 一个类（存储为文件）可以继承自：

source: A global class.
de: Einer globalen Klasse.
ko: 전역 클래스(Global class).
pt_br: Uma classe global.
zh_cn: 一个全局的类。

source: Another class file.
de: Einer anderen Klassendatei.
ko: 다른 클래스 파일.
pt_br: Um outro arquivo de classe.
zh_cn: 另一个类文件。

source: An inner class inside another class file.
de: Eine lokale Klasse innerhalb einer anderen Klassendatei.
es: Una clase interna situada dentro de otro archivo de clase.
ko: 다른 클래스 파일 안의 내부 클래스.
pt_br: Uma classe interna dentro de outro arquivo de classe.
zh_cn: 另一个类文件中的内部类。

source: Multiple inheritance is not allowed.
de: Mehrfache Vererbung ist nicht erlaubt.
es: La herencia múltiple no está permitida.
ko: 다중 상속은 허용되지 않습니다.
pt_br: Herança múltipla não é permitida.
zh_cn: 不允许多重继承。

source: Inheritance uses the ``extends`` keyword::
de: Vererbung benutzt das Schlüsselwort ``extends``:
ko: ``extends`` 키워드를 사용하여 상속합니다::
pt_br: Herança usa a palavra-chave ``extends``::
zh_cn: 继承使用 ``extends`` 关键字：

source: To check if a given instance inherits from a given class, the ``is`` keyword can be used::
de: Um zu prüfen, ob eine gegebene Instanz von einer gegebenen Klasse erbt, verwendet man das Schlüsselwort ``is``:
ko: 주어진 인스턴스가 주어진 클래스로부터 상속받았는지 확인하려면, ``is`` 키워드를 사용할 수 있습니다:
pt_br: Para verificar se uma certa instância herda de uma certa classe, a palavra-chave ``is`` (é) pode ser usada::
zh_cn: 要检查给定的实例是否从给定的类继承，可以使用 ``is`` 关键字：

source: To call a function in a *parent class* (i.e. one ``extend``-ed in your current class), prepend ``.`` to the function name::
de: Um eine Funktion in einer *übergeordneten Klasse* aufzurufen (d.h. eine ``extend``-ed in Ihrer aktuellen Klasse), stellen Sie dem Funktionsnamen ein ``.`` vor:
ko: *부모 클래스*\ 에서 (다시 말해, 현재 클래스에서 ``extend``\ 된 클래스에서) 함수를 호출하려면, 함수 이름 앞에 ``.``\ 을 입력하세요::
pt_br: Para chamar uma função em uma *classe base* (ex: um ``extend``-ido em sua classe atual), insira um ``.`` no início do nome da função::
zh_cn: 要调用 *基类* （即当前类 ``extend`` 后的类）中的函数，请在函数名前面加上 ``.``：

source: This is especially useful because functions in extending classes replace functions with the same name in their parent classes. If you still want to call them, you can prefix them with ``.`` (like the ``super`` keyword in other languages)::
de: Dies ist besonders nützlich, da Funktionen in erweiterten Klassen andere Funktionen mit demselben Namen in ihren übergeordneten Klassen ersetzen. Wenn Sie sie weiterhin aufrufen möchten, können Sie ihnen einen ``.`` voranstellen (wie das Schlüsselwort ``super`` in anderen Sprachen):
ko: 특히 확장하는 클래스의 함수는 부모 클래스에서 같은 이름의 함수로 교체한다는 점에서 유용합니다. 확장하는 클래스의 함수를 계속 호출하고 싶으면, 접두사로 ``.``\ 을 붙이면 됩니다 (다른 언어에서 ``super`` 키워드처럼 말이죠)::
pt_br: Isso é especialmente útil porque funções em classes extendidas substituem as funções com o mesmo nome em suas classes de base. Então se você ainda quiser chamá-los, você pode usar ``.`` no início (como a palavra-chave ``super`` em outras linguagens)::
zh_cn: 这特别有用，因为扩展类中的函数会替换基类中同名的函数。所以如果您仍然想调用它们，您可以使用 ``.`` （这就像其他语言中的 ``super`` 关键字一样）：

source: Default functions like ``_init``, and most notifications such as ``_enter_tree``, ``_exit_tree``, ``_process``, ``_physics_process``, etc. are called in all parent classes automatically. There is no need to call them explicitly when overloading them.
de: Standardfunktionen wie ``_init``, und die meisten Benachrichtigungen wie ``_enter_tree``, ``_exit_tree``, ``_process``, ``_physics_process``, etc. werden in allen Elternklassen automatisch aufgerufen. Es besteht keine Notwendigkeit, sie beim Überladen explizit aufzurufen.
ko: ``_init``\ 과 같은 기본 함수와 대부분의 알림, ``_enter_tree``, ``_exit_tree``, ``_process``, ``_physics_process``\ 등은 모든 부모 클래스에서 자동으로 호출할 수 있습니다. 함수를 오버로드(Overload)할 때 명시척으로 호출하지 않아도 됩니다.
pt_br: Funções padrão como ``_init``, e a maioria das notificações como ``_enter_tree``, ``_exit_tree``, ``_process``, ``_physics_process``, etc. são chamadas em todas as classes base automaticamente. Não é necessário chamá-las explicitamente quando estiver sobrecarregando-as.
zh_cn: 默认函数像 ``_init`` 和大多数通知像 ``_enter_tree``、 ``_exit_tree``、 ``_process``、 ``_physics_process`` 等，将自动调用在所有父类中的函数。重载它们时无需显式调用它们。

source: Class constructor
de: Klassen-Konstruktor

source: The class constructor, called on class instantiation, is named ``_init``. As mentioned earlier, the constructors of parent classes are called automatically when inheriting a class. So, there is usually no need to call ``._init()`` explicitly.
de: Der Klassenkonstruktor, der bei der Klasseninstantiierung aufgerufen wird, heißt ``_init``. Wie bereits erwähnt, werden die Konstruktoren von Elternklassen bei der Vererbung einer Klasse automatisch aufgerufen. Es besteht also normalerweise keine Notwendigkeit, ``._init()`` explizit aufzurufen.
ko: 클래스 인스턴스화라고 부르는 클래스 생성자는 ``_init``\ 이라고 부릅니다. 앞에서 말했듯이, 부모 클래스의 생성자는 클래스를 상속할 때 자동으로 호출됩니다. 따라서 보통 명시적으로 ``_init()``\ 을 호출하지 않습니다.
pt_br: O construtor de classe, chamada ao criar uma instância da classe, é chamado de ``_init``. Como mencionado anteriormente, os construtores de classes-pai são chamados automaticamente ao herdar uma classe. Então não costuma haver necessidade de chamar ``._init()`` explicitamente.
zh_cn: 在类实例化时调用的类构造函数名为 ``_init``。如前所述，父类的构造函数在继承类时被自动调用。所以通常不需要显式调用 ``._init()``。

source: Unlike the call of a regular function, like in the above example with ``.some_func``, if the constructor from the inherited class takes arguments, they are passed like this::
de: Anders als beim Aufruf einer regulären Funktion, wie im obigen Beispiel mit ``.some_func``, werden Argumente, wenn der Konstruktor aus der geerbten Klasse Argumente entgegennimmt, wie folgt übergeben:
ko: 위의 ``.some_func`` 함수로 보여준 표준 함수의 호출과는 달리, 상속받은 클래스의 생성자가 인수를 갖는다면, 이와 같이 전달됩니다::
pt_br: Ao contrário da chamada de uma função normal, como no exemplo acima com ``.some_func``, se o construtor da classe herdada tiver argumentos, serão passados da seguinte forma::
zh_cn: 与常规函数的调用不同，就像在上面的示例中使用 ``.some_func`` 那样，如果被继承的类的构造函数接受参数，则将它们传递为：

source: This is better explained through examples. Consider this scenario::
de: Dies wird besser anhand von Beispielen erklärt. Betrachten Sie dieses Szenario:
ko: 예제를 통해서 더 쉽게 설명해 보겠습니다. 다음 시나리오를 생각해보세요::
pt_br: Isso é melhor explicado através de exemplos. Suponha que tenhamos tal cenário::
zh_cn: 通过示例可以更好地说明这一点。考虑这种情况：

source: There are a few things to keep in mind here:
de: Hier müssen ein paar Sachen berücksichtigt werden:
es: Hay algunas cosas a tener en cuenta aquí:
ko: 유의해야 할 몇 가지 사항이 있습니다:
pt_br: Têm algumas coisas para manter em mente aqui:
zh_cn: 这里有几件事要记住：

source: If the inherited class (``State.gd``) defines a ``_init`` constructor that takes arguments (``e`` in this case), then the inheriting class (``Idle.gd``) *must* define ``_init`` as well and pass appropriate parameters to ``_init`` from ``State.gd``.
de: Wenn die geerbte Klasse (``State.gd``) einen ``_init``-Konstruktor definiert, der Argumente übernimmt (``e`` in diesem Fall), dann *muss* die vererbende Klasse (``Idle.gd``) ebenfalls ``_init`` definieren und passende Parameter an ``_init`` von ``State.gd`` übergeben.
ko: 상속받은 클래스 (``State.gd``)가 인수를 갖는 ``_init`` 생성자를 정의한다면 (여기서 인수는 ``e``가 되겠죠), 상속하는 클래스 (``Idle.gd``)는 *반드시* ``_init``\ 을 정의해야 하고, ``State.gd``\ 에서 적절한 매개변수를 ``_init``\ 으로 전달해야 합니다.
pt_br: Se a classe herdada (``State.gd``) definir um construtor ``_init`` que precisa de argumentos (``e`` nesse caso) então a classe que herda (``Idle.gd``) *precisa* definir um ``_init`` também, e passar os parâmetros apropriados para o ``_init`` de ``State.gd``.
zh_cn: 如果被继承的类（``State.gd``）定义了一个带有参数（在这种情况下为 ``e``）的 ``_init`` 构造函数，然后，继承的类（``Idle.gd``）也 **必须** 定义 ``_init`` 并将适当的参数从 ``State.gd`` 传递给 ``_init``。

source: ``Idle.gd`` can have a different number of arguments than the parent class ``State.gd``.
de: ``Idle.gd`` kann eine andere Anzahl an Argumenten besitzen als die Basisklasse ``State.gd``.
ko: ``idle.gd``\ 는 부모 클래스 ``State.gd``\ 와는 다른 개수의 인수를 가질 수 있습니다.
pt_br: ``Idle.gd`` pode ter um número diferente de argumentos que a classe base ``State.gd``.
zh_cn: ``Idle.gd`` 可以有与基类 ``State.gd`` 不同数量的参数。

source: In the example above, ``e`` passed to the ``State.gd`` constructor is the same ``e`` passed in to ``Idle.gd``.
de: Im obigen Beispiel ist das ``e`` im Konstruktor von ``State.gd`` das gleiche wie das ``e`` in ``Idle.gd``.
ko: 위의 예제에서 State.gd`` 생성자로 전달된 ``e``\ 는 ``Idle.gd``\ 로 전달된 ``e``\ 와 같습니다.
pt_br: No exemplo acima, ``e`` passado para o construtor de ``State.gd`` é o mesmo ``e`` que foi passado para o ``Idle.gd``.
zh_cn: 在上面的示例中，传递到 ``State.gd`` 的构造函数的 ``e`` 与传递给 ``Idle.gd`` 的 ``e`` 是相同的。

source: If ``Idle.gd``'s ``_init`` constructor takes 0 arguments, it still needs to pass some value to the ``State.gd`` parent class, even if it does nothing. This brings us to the fact that you can pass literals in the base constructor as well, not just variables, e.g.::
de: Wenn der ``Idle.gd``'s ``_init`` Konstruktor 0 Argumente annimmt, muss er immer noch irgendeinen Wert an die ```State.gd`` Elternklasse übergeben, selbst wenn sie nichts tut. Das bringt uns zu der Tatsache, dass man auch im Basiskonstruktor Literale übergeben kann, nicht nur Variablen. z.B.:

source: Inner classes
de: Innere Klassen
es: Clases internas
ko: 내부 클래스(Inner Class)
pt_br: Classes internas
zh_cn: 内部类

source: A class file can contain inner classes. Inner classes are defined using the ``class`` keyword. They are instanced using the ``ClassName.new()`` function.
de: Eine Klassendatei kann lokale Klassen beinhalten. Lokale Klassen werden durch das ``class`` Schlüsselwort definiert. Sie werden mithilfe der ``Klassenname.new()``-Funktion instanziert.
es: Un archivo de clase puede contener otras clases internas. Las clases internas se definen usando la palabra clave ``class``. Para instanciarlas se usa la función ``ClassName.new()``.
ko: 클래스 파일은 내부 클래스를 가질 수 있습니다. 내부 클래스는 ``class`` 키워드로 정의할 수 있습니다. 내부 클래스는 ``ClassName.new()`` 함수로 인스턴스될 수 있습니다.
pt_br: Um arquivo de classe pode conter classes internas. Elas são definidas usando a palavra-chave ``class``. Instâncias podem ser criadas usando a função ``NomeDaClasse.new()``.
zh_cn: 类文件可以包含内部类。内部类使用 ``class`` 关键字定义。它们使用 ``ClassName.new()`` 函数实例化。

source: Classes as resources
de: Klassen als Ressourcen
es: Clases como recursos
ko: 리소스로 취급되는 클래스
pt_br: Classes como recursos
zh_cn: 类作为资源

source: Classes stored as files are treated as :ref:`resources <class_GDScript>`. They must be loaded from disk to access them in other classes. This is done using either the ``load`` or ``preload`` functions (see below). Instancing of a loaded class resource is done by calling the ``new`` function on the class object::
de: Klassen, die als Datei gespeichert sind, werden als :ref:`resources <class_GDScript>` behandelt. Sie müssen von der Festplatte geladen werden, um auf sie in anderen Klassen zuzugreifen. Dies macht man mit den Funktionen ``load`` oder ``preload`` (siehe weiter unten). Das Instanzieren einer geladenen Klassenressource erledigt man durch Aufruf der ``new``-Funktion auf dem Klassenobjekt:
es: Las clases guardadas como archivos se tratan como :ref:`recursos <class_GDScript>`. Estos recursos se deben de cargar desde disco para acceder a ellos desde otras clases. Esto se hace usando cualquiera de estas dos funciones: ``load`` o ``preload`` (ver abajo). Instanciar una clase cargada como recurso se hace llamando a la función ``new`` en el objeto de dicha clase::
ko: 파일로 저장된 클래스는 :ref:`리소스 <class_GDScript>`\ 로 취급됩니다. 다른 클래스에서 접근하려면 반드시 디스크에서 불러와야 합니다. 불러오려면 ``load``\ 나 ``preload`` 함수를 사용할 수 있습니다 (아래를 참고하세요). 불러온 클래스 리소스를 인스턴스하려면 클래스 객체에 ``new`` 함수를 호출해야 합니다::
pt_br: Classes armazenadas em arquivos são tratadas como :ref:`resources <class_GDScript>`. Elas podem ser carregadas do disco para acessá-las em outras classes. Isso é feito ou pela função ``load`` ou pela ``preload`` (veja abaixo). Instâncias de uma classe carregada como recurso são feitas chamando a função ``new`` no objeto da classe::
zh_cn: 存储为文件的类被视为 :ref:`Resource <class_Resource>`。必须从磁盘加载它们，才能在其他类中访问它们。这可以使用 ``load`` 或 ``preload`` 函数来完成（见下面）。一个加载的类资源的实例化是通过调用类对象上的 ``new`` 函数来完成的：

source: Exports
de: Exporte
ko: 내보내기(Export)
pt_br: Exportações
zh_cn: 导出

source: Documentation about exports has been moved to :ref:`doc_gdscript_exports`.
de: Die Dokumentation über Exportieren wurde nach :ref:`doc_gdscript_exports` verschoben.
ko: 내보내기에 관한 서술은 :ref:`doc_gdscript_exports`\ 로 옮겨졌습니다.
pt_br: A documentação sobre a exportação foi movida para :ref:`doc_gdscript_exports`.
zh_cn: 有关导出的文档已移至 :ref:`doc_gdscript_exports`。

source: Setters/getters
de: Setter/Getter
ko: Setter(세터)/Getter(게터)
pt_br: Setters (setadores) /getters (coletores)

source: It is often useful to know when a class' member variable changes for whatever reason. It may also be desired to encapsulate its access in some way.
de: Es ist oft hilfreich zu wissen, ob sich eine Variable einer Klasse verändert, aus welchen Gründen auch immer. Es ist vielleicht auch wünschenswert sie auf eine gewisse Art vor Zugriffen zu schützen.
es: A veces es útil saber cuando una variable de clase cambia por lo que sea. También se puede querer encapsular para restringir su acceso de determinada manera.
ko: 클래스 멤버 변수가 어떤 이유로든 언제 변경되는지를 아는 것은 종종 유용합니다. 어떤 방식으로 그것의 접근을 캡슐화 하는 것이 필요할 수도 있습니다.
pt_br: É muito comum ser útil saber quando uma variável membro de classe se altera por qualquer que seja o motivo. Também pode ser desejado encapsular seu acesso de alguma forma.
zh_cn: 知道类的成员变量何时出于任何原因更改通常是很有用的。也可能需要以某种方式封装其访问。

source: For this, GDScript provides a *setter/getter* syntax using the ``setget`` keyword. It is used directly after a variable definition:
de: Dafür bietet GDScript einen *setter/getter* Syntax mit dem ``setget`` Schlüsselwort. Es wird direkt nach der Definition einer Variable genutzt:
es: Para esto, GDScript proporciona una sintaxis de *setter/getter* usando la palabra clave ``setget``. Esta palabra se usa directamente después de la definición de una variable:
ko: 이를 위해, GDScript는 ``setget`` 키워드를 사용하는 *setter/getter* 문법을 제공합니다. 변수 정의 바로 뒤에 사용됩니다:
pt_br: Para isso, a GDScript provê uma sintaxe de *setter/getter* usando a palavra-chave ``setget``, usada diretamente depois de uma definição de variável:
zh_cn: 为此，GDScript使用 ``setget`` 关键字提供了一个 *setter/getter* 语法。在变量定义后可直接使用：

source: Whenever the value of ``variable`` is modified by an *external* source (i.e. not from local usage in the class), the *setter* function (``setterfunc`` above) will be called. This happens *before* the value is changed. The *setter* must decide what to do with the new value. Vice versa, when ``variable`` is accessed, the *getter* function (``getterfunc`` above) must ``return`` the desired value. Below is an example::
de: Wann immer der Wert von ``variable`` durch eine *externe* Quelle modifiziert wird (d.h. nicht aus dem lokalen Gebrauch in der Klasse), wird die *setter* Funktion (oben ``setterfunc``) aufgerufen. Dies geschieht *bevor* der Wert geändert wird. Der *setter* muß entscheiden, was mit dem neuen Wert geschehen soll. Umgekehrt, wenn auf ``variable`` zugegriffen wird, muß die *getter*-Funktion (``getterfunc`` oben) den gewünschten Wert zurückgeben. Unten ist ein Beispiel:
ko: ``변수``\ 의 값이 (클래스에서 지역 범위의 사용이 아닌) *외부* 소스에 의해 수정되었다면, (위 예시에서 ``setterfunc``\ 에 해당하는) *Setter* 함수가 호출됩니다. 호출은 값이 변하기 *전*\ 에 일어납니다. *Setter*\ 는 새 값으로 수행할 작업을 결정해야 합니다. 반대로, ``변수``\ 에 접근할 때, (위 예시에서 ``getterfunc``\ 에 해당하는) *Getter* 함수는 반드시 그에 맞는 값을 ``반환``\ 합니다. 아래는 예제입니다::
pt_br: Sempre que o valor da ``variável`` for modificado por uma fonte *externa* (não por uso local na classe), a função *setter* (``setterfunc`` acima) será chamada. Isso acontece *antes* do valor ser mudado. O *setter* precisa decidir o que fazer com o novo valor. Do mesmo modo, quando ``variable`` é acessado, a função *getter* (``getterfunc`` acima) precisa retornar (``return``) o valor desejado. A seguir um exemplo::
zh_cn: 每当 ``变量`` 的值被 *外部的* 源（即不是来自类中的本地用法）修改时，*setter* 函数（上面的 ``setterfunc``）将被调用。这发生在值改变 *之前* 。*setter* 必须决定如何处理新值。反之亦然，当访问 ``变量`` 时，必须用 *getter* 函数（上面的 ``getterfunc`` ） ``返回`` 所需的值。下面是一个示例：

source: Either of the *setter* or *getter* functions can be omitted::
de: Eine der Funktionen *setter* oder *getter* kann weggelassen werden :
ko: 정의할 때, *Setter* 혹은 *Getter* 함수, 둘 중 하나가 생략되어도도 됩니다::
pt_br: Qualquer uma das funções *setter* ou *getter* podem ser omitidas::
zh_cn: *setter* 或者 *getter* 函数都可省略：

source: Setters and getters are useful when :ref:`exporting variables <doc_gdscript_exports>` to the editor in tool scripts or plugins, for validating input.
de: Setter und Getter sind nützlich, wenn :ref:`Variablen <doc_gdscript_exports>` in Skripten oder Plugins zum Editor exportiert werden, um Eingaben zu validieren.
ko: Setter와 Getter는 tool 스크립트나 플러그인에서, 입력을 확인하기 위해 편집기로 :ref:`변수를 내보내기 <doc_gdscript_exports>`\ 에 유용합니다.
pt_br: Setters e getters são úteis especialmente ao :ref:`exportar variáveis <doc_gdscript_exports>` ao editor em scripts de ferramentas ou plugins, para validação de entrada.
zh_cn: 用于验证输入，在工具脚本或插件里 :ref:`导出变量 <doc_gdscript_exports>` 到编辑器时，Getters/Setters格外好用。

source: As said, *local* access will *not* trigger the setter and getter. Here is an illustration of this:
de: Wie gesagt, *lokaler* Zugriff wird *nicht* den Setter und Getter auslösen. Hier ist eine Veranschaulichung dafür:
es: Como se ha indicado previamente, los accesos *locales* *no* ejecutan setter ni getter. Aquí hay una ilustración de esto:
ko: 말했듯이 *지역(Local)* 접근은 Setter와 Getter를 작동하지 *않을* 것입니다. 이 예제로 설명하겠습니다:
pt_br: Como dito, acesso *local* *não* irá iniciar o setter e getter. Aqui temos uma ilustração disso:
zh_cn: 如上所述， *本地* 访问 *不* 触发setter和getter。这里有个说明：

source: Tool mode
de: Werkzeug-Modus
es: Modo Tool
ko: Tool mode(도구 모드)
pt_br: Modo de Ferramenta
zh_cn: 工具模式

source: By default, scripts don't run inside the editor and only the exported properties can be changed. In some cases, it is desired that they do run inside the editor (as long as they don't execute game code or manually avoid doing so). For this, the ``tool`` keyword exists and must be placed at the top of the file::
de: Standardmäßig werden Skripte nicht innerhalb des Editors ausgeführt und nur die exportierten Eigenschaften können geändert werden. In einigen Fällen ist es erwünscht, dass sie innerhalb des Editors ausgeführt werden (solange sie keinen Spielcode ausführen oder dies manuell vermeiden). Hierfür existiert das Schlüsselwort ``tool``, das an den Anfang der Datei gesetzt werden muss:
ko: 기본적으로 스크립트는 편집기 내에서 실행하지 않으며, 오직 내보낸 속성만 편집기에서 변경할 수 있습니다. 하지만 몇 몇 경우에는, 편집기 내에서 스크립트가 실행되는 것이 유용할 때가 있습니다 (스크립트가 게임 코드를 실행하지 않거나 수동으로 실행하지 않는 경우가 있죠). 이를 위한 ``tool`` 키워드가 있고, 파일의 최상단에 배치되어야 합니다::
pt_br: Scripts, por padrão, não executam dentro do editor e apenas as propriedades exportadas podem ser modificadas. Em alguns casos, é desejável que eles rodem dentro do editor (enquanto eles não executem código do jogo ou evitem manualmente de fazer isso). Para isso, a palavra ``tool`` existe e deve ser colocada no topo do arquivo::
zh_cn: 默认情况下，脚本不在编辑器内运行，并且只能更改导出的属性。在某些情况下，确实希望它们在编辑器中运行（只要它们不执行游戏代码或手动避免这样做）。为此，可以用 ``tool`` 关键字并将它放在文件的顶部：

source: See :ref:`doc_running_code_in_the_editor` for more information.
de: Siehe :ref:`doc_running_code_in_the_editor` für weitere Informationen.
ko: 자세한 설명은 :ref:`doc_running_code_in_the_editor`\ 를 참고하세요.
pt_br: Veja :ref:`Executando código no editor <doc_running_code_in_the_editor>` para mais informações.
zh_cn: 详情见 :ref:`doc_running_code_in_the_editor`。

source: Be cautious when freeing nodes with ``queue_free()`` or ``free()`` in a tool script (especially the script's owner itself). As tool scripts run their code in the editor, misusing them may lead to crashing the editor.
de: Seien Sie vorsichtig, wenn Sie Nodes mit ``queue_free()`` oder ``free()`` in einem tool Skript freigeben (insbesondere der Eigentümer des Skripts selbst). Da tool Skripte ihren Code im Editor ausführen, kann ihr Missbrauch zum Absturz des Editors führen.
ko: Tool 스크립트에서 ``queue_free()``\ 나 ``free()``\ 로 노드를 해제할 때는 조심하세요 (특히 스크립트의 소유권이 자기 자신일 때). Tool 스크립트는 편집기에서 코드를 실행하기 때문에, 잘못 해제하면 편집기가 튕길 수 있습니다.
pt_br: Seja cauteloso ao liberar nós com ``queue_free()`` ou ``free()`` em um script de ferramenta (especialmente o próprio dono do script). Como os scripts de ferramentas executam o seu código no editor, o seu uso indevido pode causar falhas no editor.
zh_cn: 在工具脚本（尤其是脚本的所有者本身）中使用 ``queue_free()`` 或 ``free()`` 释放节点时要谨慎。工具脚本在编辑器中运行代码时，滥用它们可能导致编辑器崩溃。

source: Memory management
de: Speicher-Management
es: Gestión de la memoria
ko: 메모리 관리
pt_br: Gerenciamento de memória
zh_cn: 内存管理
