Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_basics.po
Languages: de, es, ko, pt_br, zh_cn

source: matches an array. Every single element of the array pattern is a pattern itself, so you can nest them.
es: compara un arreglo. Cada elemento del arreglo es un patrón en si mismo, por lo tanto, puedes anidarlos.

source: **Open-ended array**: An array can be bigger than the pattern by making the last subpattern ``..``
es: **Array con final abierto**: Un array puede ser más grande que el patrón haciendo que el último sub-patrón sea ``..``

source: Every subpattern has to be comma separated. ::
es: Cada sub-patrón tiene que estar separado por comas. ::

source: dictionary pattern
es: patrón de diccionario

source: **Open-ended dictionary**: A dictionary can be bigger than the pattern by making the last subpattern ``..``
es: **Diccionario con final abierto**: Un diccionario puede ser más grande que el patrón haciendo que el último sub-patrón sea ``..``

source: A value pattern is separated from the key pattern with a ``:`` ::
es: El valor del patrón se separa de la clave del mismo con ``:`` ::

source: Multipatterns:
es: Multipatrones:

source: You can also specify multiple patterns separated by a comma. These patterns aren't allowed to have any bindings in them. ::
es: Puedes especificar múltiples patrones separándolos con una coma. En estos patrones no se permite ningún anidamiento. ::

source: By default, all script files are unnamed classes. In this case, you can only reference them using the file's path, using either a relative or an absolute path. For example, if you name a script file ``character.gd``
es: Por defecto, todos los archivos script son clases sin nombre. En este caso, usted puede hacer referencia a ellos usando la dirección del archivo, o bien usando una dirección absoluta o relativa. Por ejemplo, si nombra un archivo script ``character.gd``

source: Instead, you can give your class a name to register it as a new type in Godot's editor. For that, you use the 'class_name' keyword. You can add an optional comma followed by a path to an image, to use it as an icon. Your class will then appear with its new icon in the editor:
es: En su lugar, puede darle a su clase un nombre para registrarlo como un nuevo tipo en el editor de Godot. Para eso, usas la palabra clave 'class_name'. Puede agregar una coma opcional seguida de una ruta a una imagen para usarla como un icono. Tu clase aparecerá con su nuevo icono en el editor:

source: A class (stored as a file) can inherit from
es: Una clase (guardada como un archivo) puede heredar de

source: A global class
es: Una clase global

source: Another class file
es: Otro archivo de clase

source: Inheritance uses the ``extends`` keyword:
es: La herencia usa la palabra clave ``extends``:

source: To check if a given instance inherits from a given class, the ``is`` keyword can be used:
es: Para comprobar si una instancia dada hereda de una clase determinada, se puede usar la palabra clave ``is``:

source: To call a function in a *base class* (i.e. one ``extend``-ed in your current class), prepend ``.`` to the function name:
es: Para llamar a una función de una *clase base* (es decir, una ``extend``-dida por tu clase actual), precede el nombre de la función con un punto:

source: This is especially useful because functions in extending classes replace functions with the same name in their base classes. So if you still want to call them, you can use ``.`` like the ``super`` keyword in other languages:
es: Esto es especialmente útil porque extendiendo clases se reemplazan funciones con el mismo nombre en la clase base. Si se quiere llamar a estas, puedes utilizar ``.`` que es como la palabra clave ``super`` en otros lenguajes:

source: The class constructor, called on class instantiation, is named ``_init``. As mentioned earlier, the constructors of parent classes are called automatically when inheriting a class. So there is usually no need to call ``._init()`` explicitly.
es: El constructor de clase, ejecutado cuando se instancia la clase, se llama ``_init``. Como se ha mencionado antes, los constructores de las clases heredadas se ejecutan automáticamente cuando se heredan dichas clases. Por lo tanto no suele haber necesidad de llamar a ``._init()`` explícitamente.

source: Unlike the call of a regular function, like in the above example with ``.some_func``, if the constructor from the inherited class takes arguments, they are passed like this:
es: A diferencia de la llamada de una función normal como en el ejemplo anterior con `` .some_func``, si el constructor de la clase heredada toma argumentos, se pasan de este modo:

source: This is better explained through examples. Say we have this scenario:
es: Esto se explica mejor a través de ejemplos. Digamos que tenemos este escenario:

source: if the inherited class (``State.gd``) defines a ``_init`` constructor that takes arguments (``e`` in this case), then the inheriting class (``Idle.gd``) *has* to define ``_init`` as well and pass appropriate parameters to ``_init`` from ``State.gd``
es: si la clase heredada (`` State.gd``) define un constructor `` _init`` que toma argumentos (`` e`` en este caso), entonces la clase heredada (`` Idle.gd``) * debe * definir `` _init`` también y pasar los parámetros correspondientes a `` _init`` de `` State.gd``

source: ``Idle.gd`` can have a different number of arguments than the base class ``State.gd``
es: `` Idle.gd`` puede tener un número diferente de argumentos que la clase base `` State.gd``

source: in the example above, ``e`` passed to the ``State.gd`` constructor is the same ``e`` passed in to ``Idle.gd``
es: en el ejemplo anterior, el valor `` e`` pasado al constructor de `` State.gd`` es el mismo `` e`` pasado al de `` Idle.gd``

source: if ``Idle.gd``'s ``_init`` constructor takes 0 arguments, it still needs to pass some value to the ``State.gd`` base class even if it does nothing. Which brings us to the fact that you can pass literals in the base constructor as well, not just variables. Eg.:
es: si el constructor `` _init`` de `` Idle.gd`` toma 0 argumentos, aún necesita pasar algún valor a la clase base `` State.gd`` aunque no haga nada. Lo que nos lleva al hecho de que también se pueden pasar literales en el constructor base, no solo variables. Ejemplo:

source: Class members can be exported. This means their value gets saved along with the resource (e.g. the :ref:`scene <class_PackedScene>`) they're attached to. They will also be available for editing in the property editor. Exporting is done by using the ``export`` keyword::
es: Los miembros de clase se pueden exportar. Esto significa que su valor se guardará junto con el recurso (p. ej. :ref:`scene <class_PackedScene>`) al que están unidos. Estos también estarán disponibles para su edición en el editor de propiedades. La exportación se hace usando la palabra clave ``export``::

source: An exported variable must be initialized to a constant expression or have an export hint in the form of an argument to the export keyword (see below).
es: Una variable exportada debe de ser inicializada como una expresión constante o tener una indicación (hint) de exportación en forma de argumento para la palabra clave exportada (ver abajo).

source: One of the fundamental benefits of exporting member variables is to have them visible and editable in the editor. This way, artists and game designers can modify values that later influence how the program runs. For this, a special export syntax is provided.
es: Uno de los beneficios fundamentales de exportar (exponer) variables miembro es poder verlas y modificarlas en el editor. De este modo los artistas y los diseñadores de juegos pueden modificar estos valores, que luego influenciarán en cómo el programa se ejecuta. Para ésto, se proporciona una sintaxis especial.

source: It must be noted that even if the script is not being run while at the editor, the exported properties are still editable (see below for "tool").
es: Nótese que incluso si el script no se ejecuta junto con el editor, las propiedades exportadas siguen siendo editables (buscar abajo "tool").

source: Exporting bit flags
es: Exportando "bit flags"

source: Integers used as bit flags can store multiple ``true``/``false`` (boolean) values in one property. By using the export hint ``int, FLAGS``, they can be set from the editor:
es: Los enteros usados como indicadores de bit (o bit flags) pueden guardar varios valores booleanos ``true``/``false`` en una sola propiedad. Usando el indicador de exportación ``int, FLAGS``, se pueden establecer desde el editor:

source: Restricting the flags to a certain number of named flags is also possible. The syntax is similar to the enumeration syntax:
es: También es posible restringir los flags a un número determinado de flags con nombre. La sintaxis es similar a la sintaxis de enumeración:

source: In this example, ``Fire`` has value 1, ``Water`` has value 2, ``Earth`` has value 4 and ``Wind`` corresponds to value 8. Usually, constants should be defined accordingly (e.g. ``const ELEMENT_WIND = 8`` and so on).
es: En este ejemplo, ``Fire`` tiene valor 1, ``Water`` tiene valor 2, ``Earth`` tiene valor 4 y ``Wind`` corresponde al valor 8. Usualmente, las constantes deberían de definirse acorde a esto (p. ej. const ELEMENT_WIND = 8`` y así con el resto).

source: Using bit flags requires some understanding of bitwise operations. If in doubt, boolean variables should be exported instead.
es: Usar bit flags requiere ciertos conocimientos de las operaciones bit a bit. En caso de duda, se pueden exportar variables booleanas en su lugar.

source: Exporting arrays
es: Exportando arrays

source: Exporting arrays works, but with an important caveat: While regular arrays are created local to every class instance, exported arrays are *shared* between all instances. This means that editing them in one instance will cause them to change in all other instances. Exported arrays can have initializers, but they must be constant expressions.
es: Se pueden exportar arreglos pero hay que hacer una pequeña advertencia: Mientras que los arreglos regulares se crean localmente en cada instancia de clase, los arreglos exportados *se comparten* entre todas ellas. Esto significa que editar uno en una instancia hará que cambien los de las otras instancias. Los arreglos exportados pueden tener inicializadores, pero estos deben de ser expresiones constantes.

source: Whenever the value of ``variable`` is modified by an *external* source (i.e. not from local usage in the class), the *setter* function (``setterfunc`` above) will be called. This happens *before* the value is changed. The *setter* must decide what to do with the new value. Vice versa, when ``variable`` is accessed, the *getter* function (``getterfunc`` above) must ``return`` the desired value. Below is an example:
es: Siempre que el valor de la ``variable`` sea modificado por una fuente *externa* (es decir, no sea modificado localmente en la clase), la función *setter* será invocada (``setterfunc`` arriba). Esto pasa *antes* de que el valor sea cambiado. Entonces la función *setter* debe de decidir que hacer con el nuevo valor. Y al viceversa, cuando se accede a la ``variable``, la función *getter* (``getterfunc`` arriba) debe de retornar el valor deseado. A continuación tienes un ejemplo:

source: Either of the *setter* or *getter* functions can be omitted:
es: Cualquiera de las dos funciones, *setter* o *getter*, se pueden omitir:

source: Get/Setters are especially useful when exporting variables to editor in tool scripts or plugins, for validating input.
es: Los Get/Setter son especialmente útiles cuando se exportan variables al editor en scripts del editor o plugins, para validar la entrada de datos.

source: Scripts, by default, don't run inside the editor and only the exported properties can be changed. In some cases, it is desired that they do run inside the editor (as long as they don't execute game code or manually avoid doing so). For this, the ``tool`` keyword exists and must be placed at the top of the file:
es: Los scripts, por defecto, no se ejecutan dentro del editor y solo las propiedades exportadas pueden modificarse. En algunos casos se puede desear que se ejecuten dentro del propio editor (siempre que no ejecuten código del juego, o evitando que esto suceda de forma manual). Para esto, existe la palabra clave ``tool`` que se deberá escribir en la parte superior del archivo:

source: GDScript offers support for `coroutines <https://en.wikipedia.org/wiki/Coroutine>`_ via the ``yield`` built-in function. Calling ``yield()`` will immediately return from the current function, with the current frozen state of the same function as the return value. Calling ``resume`` on this resulting object will continue execution and return whatever the function returns. Once resumed, the state object becomes invalid. Here is an example:
es: GDScript ofrece soporte para `corrutinas <https://es.wikipedia.org/wiki/Corrutina>`_ a través de la función integrada ``yield``. Ejecutar ``yield()`` hará que se retorne de la función actual, con el estado congelado que esta función tenga como valor de retorno. Ejecutando ``resume`` en el objeto resultante, se continuará la ejecución y se retornará lo que sea que la función retorne. Una vez resumido, el estado del objeto se tornará inválido. Aquí hay un ejemplo:

source: Will print:
es: Imprimirá:

source: It is also possible to pass values between yield() and resume(), for example:
es: También es posible pasar valores entre yield() y resume(), por ejemplo:

source: The real strength of using ``yield`` is when combined with signals. ``yield`` can accept two arguments, an object and a signal. When the signal is received, execution will recommence. Here are some examples:
es: La fortaleza real del uso de ``yield`` aparece cuando se combina con señales. ``yield`` puede aceptar dos parámetros, un objeto y una señal. Cuando la señal se recibe, la ejecución continuará. Aquí hay algunos ejemplos:

source: Coroutines themselves use the ``completed`` signal when they transition into an invalid state, for example:
es: Las corrutinas mismas usan la señal ``completed`` cuando pasan a un estado inválido, por ejemplo:

source: When using nodes, it's common to desire to keep references to parts of the scene in a variable. As scenes are only warranted to be configured when entering the active scene tree, the sub-nodes can only be obtained when a call to Node._ready() is made.
es: Cuando se usan nodos, es muy común querer guardar referencias de partes de la escena en una variable. Las escenas sólo están garantizadas para ser configuradas al entrar en el árbol de escenas activo, por lo que los subnodos sólo se pueden obtener cuando se realiza la llamada a un Node._ready() se ha realizado.

source: This can get a little cumbersome, especially when nodes and external references pile up. For this, GDScript has the ``onready`` keyword, that defers initialization of a member variable until _ready is called. It can replace the above code with a single line:
es: Esto puede dar quebraderos de cabeza, especialmente cuando los nodos y las referencias externas se acumulan. Para esto, GDScript tiene la palabra clave ``onready``, que difiere la inicialización de una variable miembro hasta el momento en que _ready es ejecutado. Esta palabra reemplaza el código de abajo en una sola línea:

source: The ``assert`` keyword can be used to check conditions in debug builds. These assertions are ignored in non-debug builds.
es: La palabra clave ``assert`` se puede usar para comprobar condiciones en versiones de depuración. Son ignoradas en versiones no debug.
