Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_basics.po
Languages: de, es, ko, pt_br, zh_cn

source: Base 2 (binary) integer
de: Basis 2 (Binär) Ganzzahl
ko: 기본 2진법 정수
pt_br: Inteiro de base 2 (binário)
zh_cn: 基数2（二进制）整数

source: Floating-point number (real)
de: Fließkommazahl (reell)
ko: 부동 소수점 숫자 (실수)
pt_br: Número de ponto flutuante (real)
zh_cn: 浮点数（实数）

source: ``"Hello"``, ``"Hi"``
de: ``"Hallo"``, ``"Hey"``
ko: ``"안녕하세요"``, ``"안녕"``
pt_br: ``"Olá"``, ``"Oi"``

source: Strings
de: Zeichenketten
es: Cadenas de caracteres
ko: 문자열
zh_cn: 字符串

source: ``"""Hello"""``
de: ``"""Hallo"""``
es: ``"""Hola"""``
ko: ``"""안녕하세요"""``
pt_br: ``"""Olá"""``

source: Multiline string
de: Mehrzeilige Zeichenkette
es: Cadena de caracteres con múltiples líneas
ko: 여러 줄 문자열
pt_br: String com múltiplas linhas
zh_cn: 多行字符串

source: :ref:`class_NodePath` or StringName
de: :ref:`class_NodePath` oder StringName
ko: 노드 경로(:ref:`class_NodePath`) 혹은 문자열 이름(StringName)
pt_br: :ref:`class_NodePath` ou StringName
zh_cn: :ref:`class_NodePath` 或 ``StringName``

source: ``$NodePath``
de: ``$NodeWeg``

source: Shorthand for ``get_node("NodePath")``
de: Kurzform für ``get_node("NodePath")``
es: Abreviatura para ``get_node("NodePath")``
ko: ``get_node("NodePath")``\ 의 짧은 표현
pt_br: Forma abreviada para ``get_node("NodePath")``
zh_cn: ``get_node("NodePath")`` 的快捷方式

source: Integers and floats can have their numbers separated with ``_`` to make them more readable. The following ways to write numbers are all valid::
de: Ganzzahlen und Gleitkommazahlen können durch ``_`` getrennt werden um die Lesbarkeit zu verbessern. Die folgenden Möglichkeiten zum Schreiben von Zahlen sind alle gültig:

source: Comments
de: Kommentare
es: Comentarios
ko: 주석(Comment)
pt_br: Comentários
zh_cn: 注释

source: Anything from a ``#`` to the end of the line is ignored and is considered a comment.
de: Alles ab einem ``#`` bis zum Ende der Zeile wird ignoriert und als Kommentar aufgefasst.
es: Todo lo escrito después de ``#`` hasta terminar la linea, es ignorado y se interpretá como un comentario.
ko: ``#``\ 부터 줄 끝까지는 주석으로 간주되어 무시됩니다.
pt_br: Qualquer coisa desde um ``#`` até o fim da linha é ignorada e é considerada como um comentário.
zh_cn: 任何从 ``#`` 开始到行尾的内容都会被忽略，并被视为注释。

source: Built-in types
de: Eingebaute Typen
es: Tipos integrados
ko: 내장 유형(Built-in type)
pt_br: Tipos definidos por padrão
zh_cn: 内置类型

source: Built-in types are stack-allocated. They are passed as values. This means a copy is created on each assignment or when passing them as arguments to functions. The only exceptions are ``Array``\ s and ``Dictionaries``, which are passed by reference so they are shared. (Pooled arrays such as ``PoolByteArray`` are still passed as values.)
de: Eingebaute Typen werden stapelweise zugewiesen. Sie werden als Werte übergeben. Dies bedeutet, dass bei jeder Zuweisung oder bei der Übergabe als Argumente an Funktionen eine Kopie erstellt wird. Die einzigen Ausnahmen sind ``Array``\ s und ``Dictionaries``, die als Referenz übergeben werden, damit sie gemeinsam genutzt werden. (zusammengesetzte Arrays wie "PoolByteArray" werden weiterhin als Werte übergeben.)
ko: 내장 유형은 스택에 할당됩니다. 이 유형은 값으로 전달됩니다. 즉, 사본은 각 할당에서, 혹은 유형이 인수로서 함수로 전달될 때 만들어집니다. 유일한 예외 사항은 ``배열(Array)``\ 과 ``딕셔너리(Dictionary)``\ 로, 참조로 전달되기 때문에 공유됩니다. (``PoolByteArray``\ 와 같은 풀 형식의 배열은 여전히 값으로 전달됩니다.)
pt_br: Tipos embutidos são alocados em pilha. Eles são passados como valores. Isso significa que uma cópia é criada em cada atribuição ou quando passadas como argumentos para funções. As únicas exceções são ``Array``\ s e ``Dictionaries``, que são passados por referência e portanto são compartilhados. (Matrizes agrupadas como ``PoolByteArray`` ainda são passadas como valores.)
zh_cn: 内置类型是堆栈分配的。它们作为值传递。这意味着在每次赋值或将它们作为参数传递给函数时都会创建一个副本。唯一的例外是 ``数组（Array）`` 和 ``字典（Dictionaries）`` ，它们是通过引用传递的，所以它们是共享的。（池数组如 ``PoolByteArray`` 仍作为值传递。）

source: Basic built-in types
de: Einfache eingebaute Typen
es: Tipos integrados básicos
ko: 기본 내장 유형
pt_br: Tipos básicos definidos por padrão
zh_cn: 基本内置类型

source: A variable in GDScript can be assigned to several built-in types.
de: Eine Variable in GDScript kann mehreren eingebauten Typen zugewiesen werden.
es: Una variable en GDScript se puede asignar a varios tipos integrados.
ko: GDScript의 변수에는 여러 내장 유형을 할당할 수 있습니다.
pt_br: Uma variável no GDScript pode ser atribuída a vários tipos definidos por padrão.
zh_cn: GDScript中的变量可以分配给多个内置类型。

source: ``null`` is an empty data type that contains no information and can not be assigned any other value.
de: ``null`` ist ein leerer Datentyp, der keine Information enthält und dem kein anderer Wert zugewiesen werden kann.
es: ``null`` es un tipo de dato vacío que no contiene información y no se le puede asignar ningún otro valor.
ko: ``null``\ 은 빈 데이터 유형으로 정보를 갖고 있지 않습니다. 그리고 어떤 값이라도 할당할 수 없습니다.
pt_br: ``null`` é um tipo de dados vazio que não contém informação nenhuma e que não pode ser atribuído nenhum outro valor.
zh_cn: ``null`` 是一个空数据类型，不包含任何信息，不能分配任何其他值。

source: Short for "boolean", it can only contain ``true`` or ``false``.
de: Kurzform für Boolean-Datentyp, der nur ``true`` oder ``false`` enthalten kann.
ko: "불리언(Boolean)"의 약자로, 오직 ``true`` 또는 ``false``\ 만 갖습니다.
pt_br: Abreviação de "booleano", pode conter apenas ``true`` ou ``false``.
zh_cn: ``boolean`` 的缩写，只能包含 ``true`` 或 ``false``。

source: Short for "integer", it stores whole numbers (positive and negative). It is stored as a 64-bit value, equivalent to "int64_t" in C++.
de: Kurz für "Integer" (Ganzzahl): es kann eine Ganzzahl (positiv oder negativ) als 64-Bit Wert gespeichert werden, gleichbedeutend mit "int64_t" in C++.
ko: "정수(Integer)"의 약자로, 모든 숫자 (양수와 음수)를 저장합니다. 64비트 값으로 저장하며, 이는 C++에서 "int64_t"와 같습니다.
pt_br: Abreviação de "inteiro", armazena valores inteiros(positivos e negativos). Ele é armazenado como um valor de 64 bits, equivalente a "int64_t " em C++.
zh_cn: ``integer`` 的缩写，它存储整数（正数和负数）。它存储为64位值，等效于C++中的 `` int64_t``。

source: Stores real numbers, including decimals, using floating-point values. It is stored as a 64-bit value, equivalent to "double" in C++. Note: Currently, data structures such as Vector2, Vector3, and PoolRealArray store 32-bit single-precision "float" values.
de: Speichert eine reelle Zahl (Fließkommazahl) als 64-Bit Wert (doppelte Genauigkeit), gleichbedeutend mit "double" in C++. Anmerkung: Datenstrukturen wie Vector2, Vector3 und PoolRealArray speichern 32-Bit Fließkommazahlen (einfache Genauigkeit).
ko: 소수점을 사용한 소수를 포함하는 실수를 저장합니다. 64비트 값으로 저장되며, 이는 C++에서 "double"과 같습니다. 참고: 현재로서는 Vector2, Vector3, PoolRealArray와 같은 데이터 구조는 32비트 단정도(Single-precision) "float" 값을 저장합니다.
pt_br: Armazena números reais, incluindo decimais, usando valores de ponto flutuante. Ele é armazenado como um valor de 64 bits, equivalente a "Double " em C++. Observação: atualmente, estruturas de dados, como Vector2, Vector3 e PoolRealArray armazenam 32 bit de ponto flutuante, ou seja 32 números após a virgula.
zh_cn: 使用浮点值存储实数，包括小数。它存储为64位值，相当于C++中的 ``double``。注意：当前，``Vector2``、``Vector3`` 和 ``PoolRealArray`` 之类的数据结构存储32位单精度 ``浮点`` 值。

source: A sequence of characters in `Unicode format <https://en.wikipedia.org/wiki/Unicode>`_. Strings can contain the following escape sequences:
de: Eine Folge von Zeichen im `Unicode-Format <https://en.wikipedia.org/wiki/Unicode>`_. Zeichenketten können die folgenden Escape-Sequenzen enthalten:

source: **Escape sequence**
de: **Escape Sequenz**

source: **Expands to**
de: **wird zu**

source: Newline (line feed)
de: Zeilenumbruch (Line Feed)

source: Horizontal tab character
de: Horizontaler Tabulator

source: Carriage return
de: Wagenrücklauf (Carriage Return)

source: Alert (beep/bell)
de: Alarm (Piepton/Klingel)

source: Backspace
de: Backspace (Rückschritt)

source: Formfeed page break
de: neue Seite (Page Break)

source: Vertical tab character
de: Vertikaler Tabulator

source: Double quote
de: doppelte Anführungszeichen

source: Single quote
de: einfaches Anführungszeichen

source: Backslash
de: Backslash (Rückstrich oder umgekehrter Schrägstrich)

source: Unicode codepoint ``XXXX`` (hexadecimal, case-insensitive)
de: Unicode Codepoint ``XXXX`` (Hexadezimal, Case-Insensitive = Groß/Kleinschreibung ist egal)

source: GDScript also supports :ref:`doc_gdscript_printf`.
de: GDScript unterstützt auch :ref:`doc_gdscript_printf`.

source: Vector built-in types
de: eingebaute Vektor-Typen
es: Tipos de Vectores propios
ko: 벡터 내장 유형
pt_br: Tipos básicos de vetor
zh_cn: 内置向量类型

source: 2D vector type containing ``x`` and ``y`` fields. Can also be accessed as an array.
de: 2D Vektor-Typ bestehend aus ``x`` und ``y``. Zugriff kann auch als Feld erfolgen.
ko: 2D 벡터 유형으로, ``x``\ 와 ``y`` 영역을 갖고 있습니다. 배열로 접근할 수도 있습니다.
pt_br: O tipo vetor 2D contém os campos ``x`` e ``y``. Também pode ser acessado como uma matriz.
zh_cn: 2D vector(向量)类型包含 ``x`` 和 ``y`` 字段。也可以像数组一样访问。

source: 2D Rectangle type containing two vectors fields: ``position`` and ``size``. Also contains an ``end`` field which is ``position + size``.
de: 2D Rechteckstypen mit zwei Vektor Feldern: ``position`` und ``size``. Besitzt alternativ ein ``end`` Feld, welches ``position+size`` entspricht.
ko: 2D 사각형 유형으로 두 개의 벡터 영역을 갖고 있습니다: ``position``\ 과 ``size``. 또한 ``position + size``\ 를 의미하는 ``end`` 영역을 갖습니다.
pt_br: O tipo 2D Rectangle contém dois campos vetoriais: ``position`` e ``size``. Contém também um campo ``end`` que é ``position + size``.
zh_cn: 2D矩形类型包含两个向量字段： ``position`` 和 ``size``。还包含一个 ``end`` 字段，即 ``position + size``。

source: 3D vector type containing ``x``, ``y`` and ``z`` fields. This can also be accessed as an array.
de: 3D Vektor Typ besitzt ``x``, ``y`` und ``z`` Felder. Diese können auch als Array aufgerufen werden.
es: Tipo de vector 3D que contiene los campos ``x``, ``y`` y ``z``. También puede ser accedido como si fuera un arreglo.
ko: 3D 벡터 유형으로, ``x``, ``y``, ``z`` 영역을 갖고 있습니다. 배열로 접근할 수도 있습니다.
pt_br: O tipo de vetor 3D contém os campos ``x``, ``y`` e ``z``. Isso também pode ser acessado como um array.
zh_cn: 3D向量类型包含 ``x`` 、 ``y`` 与 ``z`` 字段。也能够像数组一样访问。

source: 3×2 matrix used for 2D transforms.
de: Eine 3x2 Matrix, welche für 2D Transformationen verwendet wird.
ko: 3x2 행렬(Matrix)로 2D 변형에 사용됩니다.
pt_br: Matrix de 3x2 usada para transformações em 2D.
zh_cn: 用于2D变换的3x2矩阵。

source: 3D Plane type in normalized form that contains a ``normal`` vector field and a ``d`` scalar distance.
de: 3D Ebenentyp in normalisierter Form, welcher ein ``normal`` Vektorfeld und eine skalare Distanz ``d`` besitzt.
es: Tipo Plano 3D en forma normalizada que contiene un vector ``normal`` y una distancia escalar ``d``.
ko: 표준화된 형태의 3D 평면(Plane) 유형으로 ``normal`` 벡터 영역과 ``d`` 스칼라 거리를 갖고 있습니다.
pt_br: Tipo Plano 3D em formato normalizado que contém um campo vetorial "normal" e uma distância escalar "d".
zh_cn: 3D平面类型的标准形式包含一个 ``normal`` 向量字段以及一个 ``d`` 标量距离。

source: Quaternion is a datatype used for representing a 3D rotation. It's useful for interpolating rotations.
de: Quaternion ist ein Datentyp, welcher für die Repräsentation von 3D-Rotationen verwendet wird. Er ist sehr nützlich für das Interpolieren von Rotationen.
es: Quaternion es un tipo de datos utilizado para representar una rotación 3D. Es útil para interpolar rotaciones.
ko: 사원수(Quaternion)는 3D 회전을 표현하기 위해 사용되는 데이터 유형입니다. 회전 값을 보간하는 용도로 사용됩니다.
pt_br: Quaternion é um tipo de dado utilizado para representar uma rotação 3D. Isto é útil para interporlar rotações.
zh_cn: 四元数是一种用于表示3D旋转的数据类型。它对于内插旋转很有用。

source: Axis-aligned bounding box (or 3D box) contains 2 vectors fields: ``position`` and ``size``. Also contains an ``end`` field which is ``position + size``.
de: Entlang der Achse ausgerichtete Begrenzungs-Box (oder 3D Box) besitzt 2 Vektorfelder: ``position`` und ``size``. Besitzt alternativ ein ``end``-Feld, welches ``position+size`` entspricht.
ko: 축이 정렬된 경계 사각형으로 (혹은 3D 상자) 2개의 벡터 영역을 갖습니다: ``position``\ 과 ``size``. 혹은 ``position + size``\ 를 의미하는 ``end`` 영역을 갖습니다.
pt_br: Caixa delimitadora alinhada por eixo (ou caixa 3D) contém 2 campos vetoriais: ``position`` e ``size``. Contém também um campo ``end`` que é ``position + size``.
zh_cn: 轴对齐边界框（或3D框）包含两个向量字段： ``position`` 和 ``size``。还包含一个 ``end`` 字段，即 ``position + size``。

source: 3x3 matrix used for 3D rotation and scale. It contains 3 vector fields (``x``, ``y`` and ``z``) and can also be accessed as an array of 3D vectors.
de: 3x3 Matrix, welche für 3D Rotationen und Sklarierung verwendet wird. Es besitzt drei Vektorfelder (``x``, ``y`` und ``z``) und kann auch als Array von 3D Vektoren aufgerufen werden.
es: Matríz de 3x3 usada para rotación 3D y escala. Contiene 3 campos para vectores (``x``, ``y`` y ``z``) y puede ser accesada como un array de vectores 3D.
ko: 3x3 행렬로 3D 회전과 크기 조정에 사용됩니다. 3개의 벡터 영역 (``x``, ``y``, ``z``)을 갖습니다. 3D 벡터의 배열로 접근할 수도 있습니다.
pt_br: Matrix 3x3 usada para rotação 3D e escala. Ela contem 3 campos vetoriais ("x", "y" e "z") e também pode ser acessada como um array de vetores 3D.
zh_cn: 3×3矩阵被用于3D旋转与缩放。其包含3个向量字段（``x``, ``y`` 和 ``z``） 并且可以像3D向量数组那样访问。

source: 3D Transform contains a Basis field ``basis`` and a Vector3 field ``origin``.
de: 3D Transform besitzen ein Basis Feld ``basis`` und ein Vector3 Feld ``origin``.
es: La clase Transform tiene un campo Basis, llamado ``basis`` y una campo Vector3 llamado ``origin``.
ko: 3D 변형(Transform)으로, Basis 영역 ``basis``\ 와 Vector3 영역 ``origin``\ 을 갖습니다.
pt_br: Transformadas 3D contem um campo Basis ``basis`` e um campo Vector3 ``origin``.
zh_cn: 3D变换包含一个 ``Basis`` 字段 ``basis`` 和一个 ``Vector3`` 字段 ``origin``。

source: Engine built-in types
de: In die Engine eingebaute Typen
es: Tipos integrados del motor
ko: 엔진 내장 타입
pt_br: Tipos definidos por padrão da Engine
zh_cn: 引擎内置类型

source: Color data type contains ``r``, ``g``, ``b``, and ``a`` fields. It can also be accessed as ``h``, ``s``, and ``v`` for hue/saturation/value.
de: Der Color Datentyp besitzt jeweils ein ``r``-, ``g``-, ``b``- und ``a``-Feld. Der Zugriff kann auch über ``h``, ``s`` und ``v`` erfolgen, was für hue (Farbwert)/saturation (Sättigung)/value (Dunkelstufe) steht.
es: El tipo de datos de color contiene los campos ``r``, ``g``, ``b`` y ``a``. También puede ser accedido como ``h``, ``s``, y ``v``, siendo estos tono/saturación/valor.
ko: 색상(Color) 데이터 유형으로 ``r``, ``g``, ``b``, ``a`` 영역을 갖습니다. 색조/채도/명도 용으로 ``h``, ``s``, ``v``\ 로 접근할 수도 있습니다.
pt_br: O tipo de dados Color contem campos ``r``, ``g``, ``b`` e ``a`` para vermelho, verde, azul e transparência respectivamente. E podem também ser acessados como ``h``, ``s``, e ``v`` para matiz, saturação e valor respectivamente.
zh_cn: 颜色数据类型包含 ``r``、 ``g``、 ``b``、和 ``a`` 字段。它也可以作为 ``h``、 ``s``、和 ``v`` 来访问色相/饱和度/值。

source: Compiled path to a node used mainly in the scene system. It can be easily assigned to, and from, a String.
de: Hauptsächlich im Szenen-System genutzter kompilierter Pfad zu einem Node. Zuweisung kann einfach zu und von einer Zeichenkette erfolgen.
es: Ruta compilada a un nodo usado principalmente en el sistema de escenas. Puede ser asignado de manera fácil a una cadena de caracteres y leído nuevamente.
ko: 노드로 컴파일된 경로로, 주로 씬 시스템에서 사용됩니다. 쉽게 문자열로 할당하거나 할당될 수 있습니다.
pt_br: O caminho compilado para um nodo usado principalmente no sistema de cenas. Ele pode ser facilmente atribuído para, e a partir de, uma String.
zh_cn: 编译路径，到一个主要用在场景系统中的节点。它可以很容易地从一个字符串获得，或获得一个字符串。

source: Resource ID (RID). Servers use generic RIDs to reference opaque data.
de: Ressourcen ID (RID). Server nutzen generische RIDs, um unklare Daten zu referenzieren.
es: ID de recurso (RID). Los servidores utilizan RID genéricos para referenciar datos opacos.
ko: 리소스 ID (RID). 서버는 불투명한 데이터를 참조하기 위해 제네릭 RID를 사용합니다.
pt_br: ID de Recurso (RID). Servidores usam RIDs genéricos para referenciar dados opacos.
zh_cn: 资源ID（RID）。服务使用通用的RID来引用不透明数据。

source: Base class for anything that is not a built-in type.
de: Basisklasse für alles, was kein eingebauter Typ ist.
es: Clase base para cualquier cosa que no sea un tipo incorporado.
ko: 내장 유형이 아닌 모든 것의 기본 클래스.
pt_br: Classe base para qualquer coisa que não seja um tipo básico.
zh_cn: 任何非内置类型的基类。

source: Container built-in types
de: Container eingebaute Typen
es: Tipos de Container integrados
ko: 컨테이너(Container) 내장 유형
pt_br: Tipos contêiner definidos por padrão
zh_cn: 容器内置类型

source: Generic sequence of arbitrary object types, including other arrays or dictionaries (see below). The array can resize dynamically. Arrays are indexed starting from index ``0``. Negative indices count from the end.
de: Generische Abfolge beliebiger Objekttypen, einschließlich anderer Arrays oder Wörterbücher (siehe unten). Die Größe des Arrays kann dynamisch geändert werden. Arrays werden ausgehend vom Index ``0`` indiziert. Negative Indizes zählen vom Ende an.
ko: 임의 객체 유형의 일반적인 시퀀스(Sequence)로, 다른 배열(Array)이나 딕셔너리(Dictionary)를 포함합니다 (아래를 참고하세요). 배열의 크기는 동적으로 조절할 수 있습니다. 배열은 인덱스 ``0``\ 부터 번호를 매깁니다. 번호를 음수로 하면 배열의 끝부터 셉니다.
pt_br: Sequência genérica de tipos de objeto arbitrária, incluindo outras matrizes ou dicionários (veja abaixo). A matriz pode redimensionar dinamicamente. Matrizes são indexados iniciando do índice ``0``. Índices negativos contam do final.
zh_cn: 任意对象类型的泛型序列，包括其他数组或字典（见下文）。数组可以动态调整大小。数组索引从 ``0`` 开始。从Godot 2.1开始，负索引表示从尾部开始计数。

source: GDScript arrays are allocated linearly in memory for speed. Large arrays (more than tens of thousands of elements) may however cause memory fragmentation. If this is a concern, special types of arrays are available. These only accept a single data type. They avoid memory fragmentation and use less memory, but are atomic and tend to run slower than generic arrays. They are therefore only recommended to use for large data sets:
de: GDScript-Arrays werden aus Geschwindigkeitsgründen linear im Speicher zugewiesen. Große Arrays (mehr als Zehntausende von Elementen) können jedoch eine Speicherfragmentierung verursachen. Wenn dies ein Problem darstellt, stehen spezielle Arten von Arrays zur Verfügung. Diese akzeptieren nur einen einzigen Datentyp. Sie vermeiden Speicherfragmentierung und verbrauchen weniger Speicher, sind jedoch atomar und laufen tendenziell langsamer als generische Arrays. Sie werden daher nur für große Datenmengen empfohlen:
ko: GDScript 배열은 속도를 위해 선형적으로 메모리에 할당됩니다. (수 만개보다 더) 많은 배열은 메모리 단편화를 발생할 수 있습니다. 이것이 염려된다면 특수 유형의 배열을 사용할 수 있습니다. 이 배열에는 하나의 데이터 유형만 들어갈 수 있습니다. 메모리 단편화를 방지할 뿐더러, 더 적은 메모리를 사용하지만 원자적이고 기본 배열보다 더 느리게 실행됩니다. 따라서 많은 데이터 집합을 사용할 때만 추천합니다:
pt_br: Matrizes em GDScript são alocadas linearmente na memória para aumentar sua velocidade. Matrizes muito grandes (mais de dezenas de milhares de elementos) podem, no entanto, causar fragmentação de memória. Se isso for uma preocupação, existem tipos especiais de matriz. Estas aceitam apenas um único tipo de dados. Elas evitam a fragmentação de memória e também usam menos memória, mas são atômicas e tendem a ser mais lentas que as matrizes genéricas. Portanto, elas são recomendadas somente para grandes conjuntos de dados:
zh_cn: GDScript数组在内存中线性分配以提高速度。但是，大型数组（包含数万个元素）可能会导致内存碎片。如果这是一个问题，则可以使用特定类型的数组。它们只接受单个数据类型。它们避免了内存碎片，并使用了更少的内存，但是它们是原子的，并且运行起来比通用数组要慢。因此，建议仅将它们用于大型数据集：

source: :ref:`PoolByteArray <class_PoolByteArray>`: An array of bytes (integers from 0 to 255).
de: :ref:`PoolByteArray <class_PoolByteArray>`: Ein Array aus Bytes (Integer von 0 bis 255).
es: ref:`PoolByteArray <class_PoolByteArray>`: Un array de bytes (enteros entre 0 y 255).
ko: :ref:`PoolByteArray <class_PoolByteArray>`: 바이트의 배열 (0부터 255까지의 정수).
pt_br: :ref:`PoolByteArray <class_PoolByteArray>`: Um array de bytes (inteiros com valor de 0 até 255).
zh_cn: :ref:`PoolByteArray <class_PoolByteArray>`：一个字节（从0到255的整数）数组。

source: :ref:`PoolIntArray <class_PoolIntArray>`: An array of integers.
de: :ref:`PoolIntArray <class_PoolIntArray>`: Ein Array aus ganzen Zahlen.
es: :ref:`PoolIntArray <class_PoolIntArray>`: Un array de números enteros.
ko: :ref:`PoolIntArray <class_PoolIntArray>`: 정수의 배열.
pt_br: :ref:`PoolIntArray <class_PoolIntArray>`: Um array de inteiros.
zh_cn: :ref:`PoolIntArray <class_PoolIntArray>`：一个整数数组。

source: :ref:`PoolRealArray <class_PoolRealArray>`: An array of floats.
de: :ref:`PoolRealArray <class_PoolRealArray>`: Ein Array aus Fließkommazahlen.
es: :ref:`PoolRealArray <class_PoolRealArray>`: Un array de números decimales.
ko: :ref:`PoolRealArray <class_PoolRealArray>`: 실수의 배열.
pt_br: :ref:`PoolRealArray <class_PoolRealArray>`: Um array de floats.
zh_cn: :ref:`PoolRealArray <class_PoolRealArray>`：一个浮点数数组。

source: :ref:`PoolStringArray <class_PoolStringArray>`: An array of strings.
de: :ref:`PoolStringArray <class_PoolStringArray>`: Ein Array aus Zeichenketten.
es: :ref:`PoolStringArray <class_PoolStringArray>`: Un array de cadenas de texto.
ko: :ref:`PoolStringArray <class_PoolStringArray>`: 문자열의 배열.
pt_br: :ref:`PoolStringArray <class_PoolStringArray>`: Um array de strings.
zh_cn: :ref:`PoolStringArray <class_PoolStringArray>`：一个字符串数组。

source: :ref:`PoolVector2Array <class_PoolVector2Array>`: An array of :ref:`Vector2 <class_Vector2>` objects.
de: :ref:`PoolVector2Array <class_PoolVector2Array>`: Ein Array aus :ref:`Vector2 <class_Vector2>` Objekten.
es: :ref:`PoolVector2Array <class_PoolVector2Array>`: Un array de objetos :ref:`Vector2 <class_Vector2>`.
ko: :ref:`PoolVector2Array <class_PoolVector2Array>`: :ref:`Vector2 <class_Vector2>` 객체의 배열.
pt_br: :ref:`PoolVector2Array <class_PoolVector2Array>`: Um array de objetos :ref:`Vector2 <class_Vector2>`.
zh_cn: :ref:`PoolVector2Array <class_PoolVector2Array>`：一个 :ref:`Vector2 <class_Vector2>` 对象的数组。

source: :ref:`PoolVector3Array <class_PoolVector3Array>`: An array of :ref:`Vector3 <class_Vector3>` objects.
de: :ref:`PoolVector3Array <class_PoolVector3Array>`: Ein Array aus :ref:`Vector3 <class_Vector3>` Objekten.
es: :ref:`PoolVector3Array <class_PoolVector3Array>`: Un array de objetos :ref:`Vector3 <class_Vector3>`.
ko: :ref:`PoolVector3Array <class_PoolVector3Array>`: :ref:`Vector3 <class_Vector3>` 객체의 배열.
pt_br: :ref:`PoolVector3Array <class_PoolVector3Array>`: Um array de objetos :ref:`Vector3 <class_Vector3>`.
zh_cn: :ref:`PoolVector3Array <class_PoolVector3Array>`：一个 :ref:`Vector3 <class_Vector3>` 对象数组。

source: :ref:`PoolColorArray <class_PoolColorArray>`: An array of :ref:`Color <class_Color>` objects.
de: :ref:`PoolColorArray <class_PoolColorArray>`: Ein Array aus :ref:`Color <class_Color>` Objekten.
es: :ref:`PoolColorArray <class_PoolColorArray>`: Un array de objetos :ref:`Color <class_Color>`.
ko: :ref:`PoolColorArray <class_PoolColorArray>`: :ref:`Color <class_Color>` 객체의 배열.
pt_br: :ref:`PoolColorArray <class_PoolColorArray>`: Um array de objetos :ref:`Color <class_Color>`.
zh_cn: :ref:`PoolColorArray <class_PoolColorArray>`：一个 :ref:`Color <class_Color>` 对象的数组。

source: Associative container which contains values referenced by unique keys.
de: Zugehöriger Container, der durch eindeutige Schlüssel referenzierte Werte enthält.
es: Container asociativo que contiene valores referenciados por claves únicas.
ko: 고유 키로 참조되는 값을 갖는 연관 컨테이너입니다.
pt_br: Contêiner associativo que armazena valores referenciados por chaves únicas.
zh_cn: 关联容器，其中包含唯一键引用的值。
