Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_exports.po
Languages: fr, ja, ko, pt_br, ru, uk, zh_cn

source: GDScript exports
fr: Exports GDScript
ja: GDScriptエクスポート
ko: GDScript 내보내기(Export)
pt_br: Exports no GDScript
ru: Экспортирование в GDScript
uk: Експорт в GDScript
zh_cn: GDScript 导出

source: Introduction to exports
fr: Introduction aux exports GDScript
ja: エクスポートの導入
ko: 내보내기 소개
pt_br: Introdução a exports
ru: Введение в экспорт
uk: Вступ до експорту
zh_cn: 导出简介

source: In Godot, class members can be exported. This means their value gets saved along with the resource (such as the :ref:`scene <class_PackedScene>`) they're attached to. They will also be available for editing in the property editor. Exporting is done by using the ``export`` keyword::
fr: Dans Godot, les membres de classe peuvent être exportés. Cela signifie que leur valeur est sauvegardée avec la ressource (par exemple la :ref:`scene <class_PackedScene>`) à laquelle ils sont attachés. Ils seront également disponibles pour l'édition dans l'éditeur de propriétés. L'exportation se fait en utilisant le mot clé ``export`` :
ja: クラスメンバーはエクスポートできます。つまりそれらの値は、それらが関連付けられているリソース( \ :ref:`scene <class_PackedScene>` など)と共に保存されます。プロパティエディタで編集することもできます。エクスポートは ``export`` キーワードを使用して行われます::
ko: Godot에서 클래스 멤버는 내보낼 수 있습니다. 즉, 멤버의 값은 (:ref:`씬 <class_PackedScene>`\ 처럼) 붙어있는 리소스와 함께 저장됩니다. 그리고 속성(Property) 편집기에서 편집할 수 있습니다. 내보내려면 ``export`` 키워드를 사용합니다::
pt_br: No Godot, membros de classe podem ser exportados. Isso significa que seus valores são salvos junto com o recurso (por exemplo, a :ref:`cena <class_PackedScene>`) a que estão anexados. Eles também ficarão disponíveis para edição no editor de propriedades. A exportação é feita pela palavra-chave ``export``::
ru: В Godot, члены класса (переменные и т.д.) могут быть экспортированы. Это означает, что их значение сохраняется вместе с ресурсом (например, :ref:`сцена <class_PackedScene>`), к которому они прикреплены. Они также будут доступны для редактирования редакторе свойств. Экспорт осуществляется с помощью ключевого слова ``export``::
uk: У Godot члени класу можуть експортуватися. Це означає, що їх значення зберігається разом із ресурсом (наприклад, :ref:`сценою <class_PackedScene>`), до якого вони приєднані. Вони також будуть доступні для редагування в редакторі властивостей. Експорт здійснюється за допомогою ключового слова ``export``::
zh_cn: 在Godot中, 可以导出类成员. 这意味着它们的值会与它们所附加的资源(例如 :ref:`scene <class_PackedScene>`)一起保存. 它们也可以在属性编辑器中进行编辑. 导出使用关键字 ``export`` 来完成:

source: An exported variable must be initialized to a constant expression or have an export hint in the form of an argument to the ``export`` keyword (see the *Examples* section below).
fr: Une variable exportée doit être initialisée à une expression constante ou avoir une indication d'exportation sous la forme d'un argument au mot-clé d'exportation (voir les exemples ci-dessous).
ja: エクスポートされた変数は、定数式で初期化するか、\ ``export`` キーワードの引数の形式でエクスポート・ヒントを持つ必要があります(下記の\ *例*\ 参照)。
ko: 내보낸 변수는 상수 표현식으로 초기화하거나, 인수의 형태에 ``export`` 키워드로 내보내기 힌트가 있어야 합니다 (아래의 *예제* 섹션을 참고하세요).
pt_br: Uma variável exportada deve inicializada por uma expressão constante ou ter uma inferência de exportação na forma de um argumento da palavra-chave ``export`` (veja abaixo a seção *Exemplos*).
ru: Экспортируемая переменная должна быть инициализирована в постоянное выражение (Константу) или иметь подсказку на экспорт в виде аргумента к ключевому слову ``export`` (см. ниже секцию *Примеры*).
uk: Експортована змінна повинна бути ініціалізована до постійного виразу, або мати підказку щодо експорту, у вигляді аргументу до ключового слова ``export`` (дивіться розділ *Приклади* нижче).
zh_cn: ``export`` 关键字后, 导出的变量必须初始化为常量表达式, 或者具有使用的参数形式的导出提示(请参见下面的 *示例* 部分).

source: One of the fundamental benefits of exporting member variables is to have them visible and editable in the editor. This way, artists and game designers can modify values that later influence how the program runs. For this, a special export syntax is provided.
fr: L'un des avantages fondamentaux de l'exportation des variables membres est de les rendre visibles et modifiables dans l'éditeur. De cette façon, les artistes et les game designers peuvent modifier les valeurs qui influenceront plus tard le fonctionnement du programme. Pour cela, une syntaxe spéciale d'exportation est fournie.
ja: メンバー変数をエクスポートする基本的な利点の1つは、エディタで表示および編集できることです。このようにして、アーティストやゲームデザイナーは後でプログラムの実行方法に影響する値を変更できます。このために特別なエクスポート構文が用意されています。
ko: 멤버 변수 내보내기의 기본적인 이점은 편집기에서 보이고 편집할 수 있는 것입니다. 이 방법으로 아티스트와 게임 디자이너가 프로그램이 실행 방법에 영향을 주는 값을 수정할 수 있습니다. 이를 위해, 특수 내보내기 문법이 제공됩니다.
pt_br: Um dos benefícios fundamentais de exportar variáveis membros é tê-las visíveis e editáveis no editor. Dessa forma, artistas e projetistas de jogos podem modificar valores que influenciam como o programa funciona. Para isso, há uma sintaxe especial para exportação.
ru: Одним из фундаментальных преимуществ экспорта переменных (членов класса) является то, что они видны и редактируются в редакторе. Таким образом, художники и гейм-дизайнеры могут изменять значения, которые впоследствии будут влиять на работу программы. Для этого предусмотрен специальный синтаксис экспорта.
uk: Однією з основних переваг експорту змінних є те, що їх можна побачити та редагувати у редакторі. Таким чином, художники та розробники ігор можуть змінювати значення, які згодом впливають на роботу програми. Для цього передбачений спеціальний синтаксис експорту.
zh_cn: 导出成员变量的基本好处之一是使它们在编辑器中可见并可编辑. 这样, 美术师和游戏设计师可以修改值, 这些值以后会影响程序的运行方式. 为此, 提供了一种特殊的导出语法.

source: Exporting properties can also be done in other languages such as C#. The syntax varies depending on the language.
fr: L'export de propriété fonctionne également dans d'autres langages comme le C#. La syntaxe varie en fonction du langage.
ja: プロパティのエクスポートは C#のような別の言語でも実行できます。構文の違いは言語に依存します。
ko: 속성 내보내기는 C#과 같은 다른 언어에서도 가능합니다. 문법은 언어에 따라 다릅니다.
uk: Експорт властивостей також можна виконати іншими мовами, такими як C#. Синтаксис змінюється залежно від мови.
zh_cn: 导出属性也可以使用其他语言(例如C#)来完成. 语法因语言而异.

source: Examples
fr: Exemples
ja: 例
ko: 예제
pt_br: Exemplos
ru: Примеры
uk: Приклади
zh_cn: 示例

source: It must be noted that even if the script is not being run while in the editor, the exported properties are still editable. This can be used in conjunction with a :ref:`script in "tool" mode <doc_gdscript_tool_mode>`.
fr: Il faut noter que même si le script n'est pas en cours d’exécution alors qu'il est en cours d'édition, les propriétés exportées sont toujours modifiables (voir ci-dessous pour "outil").
ja: スクリプトがエディタで実行されていない場合でも、エクスポートされたプロパティはまだ編集可能です。これは :ref:`script in "tool" mode <doc_gdscript_tool_mode>` と共に使うことが出来ます。
ko: 스크립트가 편집기에서 실행하지 않는다면, 내보낸 속성은 편집할 수 있다는 것은 꼭 알아두세요. 왜냐하면 :ref:`"Tool(도구) 모드에서 스크립트 <doc_gdscript_tool_mode>`\ 를 사용할 수 있기 때문입니다.
pt_br: Perceba que mesmo se o script não estiver em execução enquanto estiver no editor, as propriedades exportadas ainda são editáveis. Isso pode ser usado em conjunto com um :ref:`script em modo "tool" <doc_gdscript_tool_mode>`.
ru: Следует отметить, что даже если во время работы в редакторе скрипт не выполняется, экспортируемые свойства все равно можно редактировать. Это можно использовать в сочетании с :ref:`режимом "инструмента": <doc_gdscript_tool_mode>`.
uk: Слід зазначити, що навіть якщо скрипт не запущений в редакторі, експортовані властивості можна редагувати. Це може бути використано спільно зі :ref:`скриптом в режимі "інструмент" <doc_gdscript_tool_mode>`.
zh_cn: 必须注意, 即使在编辑器中未运行脚本, 导出的属性仍可编辑. 可以与 :ref:`使用工具模式的脚本 <doc_gdscript_tool_mode>` 结合使用.

source: Exporting bit flags
fr: Exportation des indicateurs binaires
ja: ビットフラグのエクスポート
ko: 비트 플래그(bit flags) 내보내기
pt_br: Exportando sinalizadores de bits
ru: Экспорт битовых флагов
uk: Експорт бітових прапорців
zh_cn: 导出位标志

source: Integers used as bit flags can store multiple ``true``/``false`` (boolean) values in one property. By using the export hint ``int, FLAGS``, they can be set from the editor::
fr: Les nombres entiers utilisés comme bits de drapeaux (bitflags) peuvent stocker plusieurs valeurs ``vrai``/``faux`` (booléen) en une propriété. En utilisant l'indication d'exportation ``int, FLAGS``, ils peuvent être changés dans l'éditeur :
ja: ビットフラグとして使用される整数は、1つのプロパティに複数の ``true``/``false`` (ブール値)値を格納できます。エクスポートヒント ``int, FLAGS`` を使用して、エディタから設定できます::
ko: 비트 플래그로 사용되는 정수는 한 속성에 여러 ``참``/``거짓`` (불리언) 값을 저장할 수 있습니다. 편집기에서 설정하도록 하려면 ``int, FLAGS`` 내보내기 힌트를 사용합니다::

source: Restricting the flags to a certain number of named flags is also possible. The syntax is similar to the enumeration syntax::
fr: Limiter les drapeaux à un certain nombre de drapeaux nommés est également possible. La syntaxe est très similaire à la syntaxe d'énumération :
ja: フラグを特定の数の名前付きフラグに制限することもできます。構文は列挙構文に似ています::
ko: 플래그를 특정 개수의 이름있는 플래그로 제한하는 것도 가능합니다. 문법은 열거형 문법과 유사합니다::

source: In this example, ``Fire`` has value 1, ``Water`` has value 2, ``Earth`` has value 4 and ``Wind`` corresponds to value 8. Usually, constants should be defined accordingly (e.g. ``const ELEMENT_WIND = 8`` and so on).
fr: Dans cet exemple, ``Feu`` a la valeur 1, ``Eau`` a la valeur 2, ``Terre`` a la valeur 4 et ``Vent`` correspond à la valeur 8. Généralement, les constantes doivent être définies en conséquence (p. ex. ``const ELEMENT_VENT = 8`` et ainsi de suite).
ja: この例では、 ``Fire`` の値は1、 ``Water`` の値は2、 ``Earth`` の値は4、 ``Wind`` は値8に対応します。通常、定数はそれに応じて定義する必要があります(例: ``const ELEMENT_WIND = 8`` など)。
ko: 이 예제에서, ``Fire`` 는 값 1, ``Water`` 는 값 2, ``Earth`` 는 값 4, 그리고 ``Wind`` 는 값 8에 해당합니다. 일반적으로, 상수는 이에 따라 정의되어야 합니다 (예 ``const ELEMENT_WIND = 8`` 등등).

source: Using bit flags requires some understanding of bitwise operations. If in doubt, boolean variables should be exported instead.
fr: L'utilisation de drapeaux de bits nécessite une certaine compréhension des opérations sur les bits. En cas de doute, les variables booléennes doivent être exportées à la place.
ja: ビットフラグを使用するには、ビット単位の操作についてある程度理解する必要があります。疑わしい場合は、代わりにブール変数をエクスポートしてください。
ko: 비트 플래그를 사용하려면 비트 연산에 대한 이해가 필요합니다. 의심스럽다면, 불 변수를 대신 내보내어야 합니다.

source: Exporting arrays
fr: Exportation de tableaux
ja: 配列のエクスポート
ko: 배열 내보내기
pt_br: Exportando arrays
ru: Экспорт массивов
uk: Експорт масивів
zh_cn: 导出数组

source: Exporting arrays works, but with an important caveat: while regular arrays are created local to every class instance, exported arrays are *shared* between all instances. This means that editing them in one instance will cause them to change in all other instances. Exported arrays can have initializers, but they must be constant expressions.
fr: L'exportation des tableaux fonctionne mais avec une mise en garde importante : alors que les tableaux normaux sont créés en local pour chaque instance de classe, les tableaux exportés sont *partagés* entre toutes les instances. Cela signifie que le fait de les éditer dans une instance les fera changer dans toutes les autres instances. Les tableaux exportés peuvent avoir des initialisateurs, mais ceux-ci doivent être des expressions constantes.
ja: 通常の配列はすべてのクラスインスタンスに対してローカルに作成されますが、エクスポートされた配列はすべてのインスタンス間で*共有* されます。つまり、1つのインスタンスで編集すると、他のすべてのインスタンスで変更されます。エクスポートされた配列は初期化子を持つことができますが、それらは定数式でなければなりません。
ko: 배열을 내보낼 수 있지만 중요한 주의 사항이 있습니다: 정규 배열은 모든 클래스 인스턴스에 지역(Local)으로 만들어지지만, 내보낸 배열은 모든 인스턴스 간에 *공유됩니다*. 즉, 한 인스턴스에서 배열을 편집하면 다른 인스턴스에서도 영향을 줍니다. 내보낸 배열은 이니셜라이저(Initializer)를 갖지만, 반드시 상수 표현식이 되어야 합니다.

source: If the exported array specifies a type which inherits from Resource, the array values can be set in the inspector by dragging and dropping multiple files from the FileSystem dock at once.
fr: Si le tableau exporté spécifie un type qui hérite de Resource, les valeurs du tableau peuvent être définies dans l'inspecteur en glissant et déposant plusieurs fichiers du dock système de fichiers en même temps.
pt_br: Se o array exportado especificar um tipo que herda de Resource, os valores do array podem ser definidos no inspetor arrastando e soltando vários arquivos da dock Arquivos de uma vez.
ru: Если экспортируемый массив указывает тип, который наследуется от Ресурса, значения массива можно задать в инспекторе (Inspector), перетаскивая несколько файлов из файловой системы (FileSystem) одновременно.
uk: Якщо експортований масив задає тип, який успадковується від Ресурса, значення масиву можна встановити в інспекторі, перетягуючи одночасно кілька файлів із панелі Файлова система.
zh_cn: 如果导出的数组指定了从Resource继承的类型, 则可以通过一次从FileSystem扩展坞中拖放多个文件来在检查器中设置数组值.

source: Setting exported variables from a tool script
fr: Définition des variables exportées à partir d'un script outil(tool)
pt_br: Definindo variáveis exportadas a partir de um script de ferramenta
ru: Установка экспортированных переменных из скрипта инструмента
uk: Встановлення експортованих змінних зі скрипту інструмента
zh_cn: 从工具脚本设置导出变量

source: When changing an exported variable's value from a script in :ref:`doc_gdscript_tool_mode`, the value in the inspector won't be updated automatically. To update it, call :ref:`property_list_changed_notify() <class_Object_method_property_list_changed_notify>` after setting the exported variable's value.
fr: Quand la valeur d'une variable exportée depuis un script :ref:`doc_gdscript_tool_mode` est modifiée, la valeur dans l'inspecteur ne sera pas mise-à-jour automatiquement. Pour la mettre-à-jour, appelez :ref:`property_list_changed_notify() <class_Object_method_property_list_changed_notify>` après avoir défini la valeur de la variable exportée.
pt_br: Ao alterar o valor de uma variável exportada de um script em :ref:`doc_gdscript_tool_mode`, o valor no inspetor não será atualizado automaticamente. Para atualizá-lo chame :ref:`property_list_changed_notify() <class_Object_method_property_list_changed_notify>` após definir o valor da variável exportada.
ru: При изменении значения экспортируемой переменной из скрипта в :ref:`doc_gdscript_tool_mode` значение в Инспекторе (Inspector) не будет обновляться автоматически. Чтобы обновить его, вызовите :ref:`property_list_changed_notify() <class_Object_method_property_list_changed_notify>` после установки значения экспортируемой переменной.
uk: При зміні значення експортованої змінної зі скрипту в :ref:`doc_gdscript_tool_mode`, значення в інспекторі не оновлюється автоматично. Щоб оновити його, викликайте :ref:`property_list_changed_notify() <class_Object_method_property_list_changed_notify>` після встановлення значення експортованої змінної.
zh_cn: 在 :ref:`doc_gdscript_tool_mode` 下的脚本中, 更改一个导出变量的值时, 属性检查器中对应的值不会自动更新. 要更新它, 请在设置导出变量的值之后, 调用 :ref:`property_list_changed_notify() <class_Object_method_property_list_changed_notify>` .

source: Advanced exports
fr: Exportations avancées
pt_br: Exports avançados
ru: Расширенный экспорт
uk: Розширений експорт
zh_cn: 导出进阶

source: Not every type of export can be provided on the level of the language itself to avoid unnecessary design complexity. The following describes some more or less common exporting features which can be implemented with a low-level API.
fr: Tous les types d'exportation ne peuvent pas être fournis au niveau du langage lui-même pour éviter une complexité de conception inutile. Ce qui suit décrit quelques fonctions d'exportation plus ou moins courantes qui peuvent être mises en œuvre avec une API de bas niveau.
pt_br: Nem todo tipo de export pode ser fornecido no nível da própria linguagem para evitar complexidade de design desnecessária. O seguinte descreve mais ou menos alguns recursos de exportação comuns que podem ser implementados com uma API de baixo nível.
ru: Не каждый тип экспорта может быть предоставлен на уровне самого языка, чтобы избежать ненужной сложности проектирования. Далее описаны некоторые более или менее распространенные функции экспорта, которые могут быть реализованы с помощью низкоуровневого API.
uk: Не кожен вид експорту можна забезпечити на рівні самої мови, щоб уникнути зайвої складності проектування. Далі описуються деякі більш-менш загальні функції експорту, які можна реалізувати за допомогою API низького рівня.
zh_cn: 为了避免不必要的复杂设计, 不是所有导出类型都在语言层面上提供. 下面将说明一些能用底层API实现的, 较为常见的导出方法.

source: Before reading further, you should get familiar with the way properties are handled and how they can be customized with :ref:`_set() <class_Object_method__get_property_list>`, :ref:`_get() <class_Object_method__get_property_list>`, and :ref:`_get_property_list() <class_Object_method__get_property_list>` methods as described in :ref:`doc_accessing_data_or_logic_from_object`.
fr: Avant de poursuivre la lecture, vous devriez vous familiariser avec la manière dont les propriétés sont gérées et comment elles peuvent être personnalisées avec les méthodes :ref:`_set() <class_Object_method__get_property_list>`, :ref :`_get() <class_Object_method__get_property_list>`, et :ref:`_get_property_list() <class_Object_method__get_property_list>` comme décrit dans :ref:`doc_accessing_data_or_logic_from_object`.
pt_br: Antes de continuar lendo, você deve se familiarizar com a forma como propriedades são tratadas e como elas podem ser personalizadas com os métodos :ref:`_set() <class_Object_method__get_property_list>`, :ref:`_get() <class_Object_method__get_property_list>`, e :ref:`_get_property_list() <class_Object_method__get_property_list>` como descrito em :ref:`doc_accessing_data_or_logic_from_object`.
ru: Прежде чем читать дальше, вы должны ознакомиться с тем, как свойства обрабатываются и как они могут быть настроены с помощью методов :ref:`_set() <class_Object_method__get_property_list>`, :ref:`_get() <class_Object_method__get_property_list>`, and :ref:`_get_property_list() <class_Object_method__get_property_list>`, описанных в разделе :ref:`doc_accessing_data_or_logic_from_object`.
uk: Перш ніж читати далі, ви повинні ознайомитися з тим, як обробляються властивості та як їх можна налаштувати за допомогою методів :ref:`_set() <class_Object_method__get_property_list>`, :ref:`_get() <class_Object_method__get_property_list>`, та :ref:`_get_property_list() <class_Object_method__get_property_list>`, як описано в :ref:`doc_accessing_data_or_logic_from_object`.
zh_cn: 在进一步阅读前, 你需要熟悉属性(properties)的运作方式和它们是如何通过 :ref:`_set() <class_Object_method__get_property_list>` , :ref:`_get() <class_Object_method__get_property_list>` 以及 :ref:`_get_property_list() <class_Object_method__get_property_list>` 方式进行定制的. 详情可参阅 :ref:`doc_accessing_data_or_logic_from_object` .

source: For binding properties using the above methods in C++, see :ref:`doc_binding_properties_using_set_get_property_list`.
fr: Pour les propriétés de liaison utilisant les méthodes ci-dessus en C++, voir :ref:`doc_binding_properties_using_set_get_property_list`.
pt_br: Para propriedades de ligação usando os métodos acima em C++, veja :ref:`doc_binding_properties_using_set_get_property_list`.
ru: Свойства привязки, использующие описанные выше методы в C++, см. в разделе :ref:`doc_binding_properties_using_set_get_property_list`.
uk: Для прив'язки властивостей, що використовуються в вищезгаданих методах в C++, дивіться :ref:`doc_binding_properties_using_set_get_property_list`.
zh_cn: 要用上述方法绑定属性, 参阅 :ref:`doc_binding_properties_using_set_get_property_list`.

source: The script must operate in the ``tool`` mode so the above methods can work from within the editor.
fr: Le script doit fonctionner en mode ``tool`` pour que les méthodes ci-dessus puissent fonctionner dans l'éditeur.
pt_br: O script deve operar no modo de ``ferramenta`` para que os métodos acima possam funcionar dentro do editor.
ru: Скрипт должен работать в режиме ``tool``, чтобы вышеперечисленные методы могли работать из редактора.
uk: Скрипт повинен працювати в режимі ``tool``, щоб вищезазначені методи могли працювати з редактора.
zh_cn: 脚本必须在 ``tool`` 模式运行, 上述方法才能在编辑器内运行.

source: Adding script categories
fr: Ajout de catégories de script
pt_br: Adicionando categorias de script
ru: Добавление категорий скриптов
uk: Додавання скрипту категорій
zh_cn: 对脚本中的属性添加类别

source: For better visual distinguishing of properties, a special script category can be embedded into the inspector to act as a separator. ``Script Variables`` is one example of a built-in category.
fr: Pour une meilleure distinction visuelle des propriétés, une catégorie d'écriture spéciale peut être intégrée à l'inspecteur pour servir de séparateur. ``Script Variables`` est un exemple de catégorie intégrée.
pt_br: Para uma melhor distinção visual das propriedades, uma categoria especial de script pode ser incorporada ao inspetor para atuar como um separador. ``Script Variables`` é um exemplo de categoria embutida.
ru: Для лучшего визуального различения свойств в Инспектор (Inspector) может быть встроена специальная категория скрипта, выполняющая роль разделителя. ``Script Variables`` - это один из примеров встроенной категории.
uk: Для кращого візуального розрізнення властивостей в інспектор може бути вбудована спеціальна категорія скрипту, щоб діяти як розділювач. ``Script Variables`` є одним із прикладів вбудованої категорії.
zh_cn: 为了在视觉上更好区分各个属性, 可以将特殊的脚本分类作为分割线嵌入属性检查器.``Script Variables`` 就是一种内建分类.

source: ``name`` is the name of a category to be added to the inspector;
fr: ``name`` est le nom d'une catégorie à ajouter à l'inspecteur ;
pt_br: ``name`` é o nome de uma categoria a ser adicionada ao inspetor;
ru: ``name`` это название категории, которая будет добавлена в инспектор;
uk: ``name`` це назва категорії, яка буде додана до інспектора;
zh_cn: ``name`` 是要加入属性面板中的分类的名字；

source: ``PROPERTY_USAGE_CATEGORY`` indicates that the property should be treated as a script category specifically, so the type ``TYPE_NIL`` can be ignored as it won't be actually used for the scripting logic, yet it must be defined anyway.
fr: La propriété ``PROPERTY_USAGE_CATEGORY`` indique que la propriété doit être traitée comme une catégorie de script spécifique, donc le type ``TYPE_NIL`` peut être ignoré car il ne sera pas réellement utilisé pour la logique de script, mais il doit quand même être défini.
pt_br: ``PROPERTY_USAGE_CATEGORY`` indica que a propriedade deve ser tratada como uma categoria de script especificamente, então o tipo ``TYPE_NIL`` pode ser ignorado pois não será realmente usado para a lógica de script, mas deve ser definido de qualquer forma.
ru: ``PROPERTY_USAGE_CATEGORY`` указывает, что свойство должно рассматриваться именно как категория скрипта, поэтому тип ``TYPE_NIL`` можно игнорировать, поскольку он фактически не будет использоваться для логики скрипта, но все равно должен быть определен.
uk: ``PROPERTY_USAGE_CATEGORY`` вказує на те, що властивість слід розглядати як категорію скрипта, тому тип ``TYPE_NIL`` можна ігнорувати, оскільки він фактично не використовуватиметься для логіки скрипта, але його все одно потрібно визначити.
zh_cn: ``PROPERTY_USAGE_CATEGORY`` 表明了该属性应被视为一个脚本分类, 因此可以忽略 ``TYPE_NIL`` 这个类型, 因为它其实并没有被脚本逻辑所处理. 但无论如何, 你还是要在这儿定义它.

source: Grouping properties
fr: Regroupement des propriétés
pt_br: Agrupando propriedades
ru: Свойства группировки
uk: Групування властивостей
zh_cn: 对属性进行分组

source: A list of properties with similar names can be grouped.
fr: Une liste de propriétés ayant des noms similaires peut être groupée.
pt_br: Uma lista de propriedades com nomes semelhantes pode ser agrupada.
ru: Список свойств с похожими именами можно сгруппировать.
uk: Список властивостей з подібними назвами можна згрупувати.
zh_cn: 名称类似的属性们可以添加为一组.

source: ``name`` is the name of a group which is going to be displayed as collapsible list of properties;
fr: ``name`` est le nom d'un groupe qui va s'afficher sous forme de liste pliable de propriétés ;
pt_br: ``name`` é o nome de um grupo que será exibido como uma lista de propriedades que pode ser recolhida;
ru: ``name`` - это имя группы, которая будет отображаться в виде складываемого списка свойств;
uk: ``name`` це назва групи, яка буде відображатися як розбірний список властивостей;
zh_cn: ``name`` 是包含了一组属性的可折叠群组的名称；
