Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_basics.po
Languages: de, es, ko, pt_br, zh_cn

source: Non-void functions must **always** return a value, so if your code has branching statements (such as an ``if``/``else`` construct), all the possible paths must have a return. E.g., if you have a ``return`` inside an ``if`` block but not after it, the editor will raise an error because if the block is not executed, the function won't have a valid value to return.
de: Nicht-void-Funktionen müssen **immer** einen Wert zurückgeben. Wenn Ihr Code also Verzweigungsanweisungen enthält (z.B. ein ``if``/``else``-Konstrukt), müssen alle möglichen Pfade eine Rückgabe haben. Wenn Sie beispielsweise ein ``return`` in einem ``if``-Block haben, aber nicht danach, gibt der Editor einen Fehler aus, da die Funktion keinen gültigen Wert für die Rückgabe hat, wenn der Block nicht ausgeführt wird.
es: Las funciones no nulas deben ** siempre ** devolver un valor, por lo que si su código tiene sentencias de bifurcación (como una construcción ``if``/``else``), todas las rutas posibles deben tener un retorno. Por ejemplo, si tiene un ``return`` dentro de un bloque ``if`` pero no después de él, el editor generará un error porque si el bloque no se ejecuta, la función no tendrá un valor válido para devolver.
ko: Void가 아닌 함수는 반드시 **항상** 값을 반환해야 합니다. 따라서 코드가 (``if``/``else`` 구조와 같은) 분기문을 갖고 있다면, 모든 가능한 경로에 반환이 필요합니다. 다시 말해 ``if`` 블록 안에 ``return``\ 을 넣어 줬지만, 그 이후에는 하지 않았다면, 편집기는 오류를 발생합니다. 조건에 맞지 않아 블록이 실행하지 않았다면, 함수는 올바른 값을 반환할 수 없기 때문이죠.
pt_br: Funções não void devem **sempre** retornar um valor, então se seu código possui instruções de ramificação (como um construtor ``if`` / ``else``), todos os caminhos possíveis devem ter um retorno. Por exemplo, se você tiver um ``return`` dentro de um bloco ``if``, mas não depois, o editor irá gerar um erro, porque se o bloco não for executado, a função não terá um valor válido para retornar.
zh_cn: 非void函数必须 **总是** 返回一个值，所以如果您的代码有分支语句（例如 ``if``/``else`` 构造），那么所有可能的路径都必须返回一个值。例如，如果在 ``if`` 块中有一个 ``return`` ，但在 ``if`` 块之后没有，编辑器就会抛出一个错误，因为如果没有执行这个块，该函数将没有有效值返回。

source: Referencing functions
de: Funktionen referenzieren
ko: 함수 참조하기(Referencing functions)
pt_br: Referenciando funções
zh_cn: 引用函数

source: Contrary to Python, functions are *not* first-class objects in GDScript. This means they cannot be stored in variables, passed as an argument to another function or be returned from other functions. This is for performance reasons.
de: Im Gegensatz zu Python sind Funktionen *keine* erste Klasse Objekte in GDScript. Das bedeutet, sie können nicht in Variablen gespeichert werden, als Argument für eine andere Funktion übergeben werden oder von anderen Funktionen zurückgegeben werden – aus Gründen der Geschwindigkeit.
ko: Python과 달리, 함수는 GDScript에서 최상위 클래스 객체가 *아닙니다*. 즉, 함수를 변수에 저장할 수 없고, 다른 함수에 인수로 전달되거나 다른 함수로부터 반환될 수 없습니다. 성능의 문제 때문입니다.
pt_br: Ao contrário do Python, funções *não* são objetos de primeira-classe em GDScript. Isso significa que elas não podem ser armazenadas em variáveis, passadas como argumento para outras funções ou retornadas de outras funções. Essas limitações são por motivos de performance.
zh_cn: 与Python相反，函数 *不是* GDScript中的第一类对象。这意味着它们不能存储在变量中，不能作为参数传递给另一个函数，也不能从其他函数返回。这是出于性能原因。

source: To reference a function by name at run-time, (e.g. to store it in a variable, or pass it to another function as an argument) one must use the ``call`` or ``funcref`` helpers::
de: Um eine Funktion zur Laufzeit namentlich zu referenzieren (z.B. um sie in einer Variablen zu speichern oder als Argument an eine andere Funktion zu übergeben), müssen die Helfer ``call`` oder ``funcref`` verwendet werden:
ko: 런타임에 함수를 이름으로 참조하려면 (예: 그것을 변수로 저장하거나, 다른 함수에 인수로 전달하는 경우), ``call``\ 이나 ``funcref`` 도우미를 사용해야 합니다::
pt_br: Para referenciar uma função pelo nome durante o tempo de execução, (ex: para armazenar em uma variável, ou passar para uma outra função como um argumento) você precisa usar os auxiliares ``call`` ou ``funcref``::
zh_cn: 若要在运行时按名称引用一个函数，（例如，将其存储在一个变量中，或将其作为参数传递给另一个函数），必须使用 ``call`` 或 ``funcref`` 帮助函数：

source: Static functions
de: Statische Funktionen
es: Funciones estáticas
ko: 정적 함수(Static functions)
pt_br: Funções estáticas
zh_cn: 静态函数

source: A function can be declared static. When a function is static, it has no access to the instance member variables or ``self``. This is mainly useful to make libraries of helper functions::
de: Eine Funktion kann als statisch deklariert werden. Wenn eine Funktion statisch ist, hat sie keinen Zugriff auf die Member der Instanz oder ``self``. Dies ist vor allem nützlich um Bibliotheken mit Hilfsfunktionen zu erzeugen:
ko: 함수를 정적으로 선언할 수 있습니다. 함수가 정적인 상태라면, 인스턴스 멤버 변수나 ``self``\ 로 접근할 수 없습니다. 주로 도우미 함수의 라이브러리를 만드는데 유용합니다::
pt_br: Uma função pode ser declarada como estática. Quando uma função é estática, ela não possui acesso as variáveis de instância ou ao ``self``. Isso é útil principalmente para a criação de bibliotecas de funções auxiliares::
zh_cn: 函数可以声明为静态的。当一个函数是静态的，它不能访问实例成员变量或 ``self`` 。这对于创建辅助函数库非常有用：

source: Statements and control flow
de: Anweisungen und Kontrollstrukturen
es: Declaraciones y estructuras de control
ko: 명령문(Statement)과 제어 흐름(Control Flow)
pt_br: Expressões e fluxo de controle
zh_cn: 语句和控制流程

source: Statements are standard and can be assignments, function calls, control flow structures, etc (see below). ``;`` as a statement separator is entirely optional.
de: Ausdrücke sind Standard und können Zuweisungen sein, Funktionsaufrufe, Flußkontrollstrukturen, usw. (siehe unten). ``;``als Trennzeichen zwischen Ausdrücken ist optional.
es: Las declaraciones son estándar y pueden ser asignaciones, llamadas a funciones, estructuras de control, etc (mirar abajo). Usar ``;`` como separador de las declaraciones es opcional.
ko: 명령문은 표준으로 할당(Assignment), 함수 호출(Function Call), 제어 흐름 (Control Flow) 구조 등이 될 수 있습니다. 명령문 구분 기호인 ``;``\ 의 사용은 자유입니다.
pt_br: Expressões são padrão e podem ser atribuições, chamadas de função, estruturas de controle, etc (veja abaixo). ``;`` como um separador de expressões é inteiramente opcional.
zh_cn: 语句是标准的，可以是赋值、函数调用、控制流结构等（见下面）。``;`` 作为语句分隔符是完全可选的。

source: Simple conditions are created by using the ``if``/``else``/``elif`` syntax. Parenthesis around conditions are allowed, but not required. Given the nature of the tab-based indentation, ``elif`` can be used instead of ``else``/``if`` to maintain a level of indentation.
de: Einfache Verzweigungen werden mit dem ``if``/``else``/``elif`` Syntax erstellt. Klammern um die Bedingungen zu setzten ist möglich, aber nicht zwingend notwendig. Angesichts der Tabulator basierten Einrückung kann ``elif`` anstelle von ``else``/``if`` verwendet werden, um auf dem selben Level der Einrückung zu bleiben.
es: Los condicionales básicos se crean usando la sintaxis ``if``/``else``/``elif``. Se permite el uso de paréntesis detrás de estos, pero no son obligatorios. Dada la naturaleza del código basado en tabulaciones, se puede usar ``elif`` en lugar de ``else``/``if`` para mantener la sangría al mismo nivel.
ko: 간단한 조건은 ``if``/``else``/``elif`` 문법을 사용해 만들 수 있습니다. 조건문 주변에 괄호를 씌워도 되지만, 필수는 아닙니다. 탭 기반 들여쓰기의 특성을 감안하여, ``elif`` 는 ``else``/``if`` 대신 사용하여 들여쓰기 높이를 유지할 수 있습니다.
pt_br: Condições simples são criadas usando a sintaxe ``if``/``else``/``elif``. Parênteses ao redor de condições são permitidos, mas não obrigatórios. Dada a natureza dos recuos baseados em tabs, ``elif`` pode ser usado ao invés de ``else``/``if`` para manter o nível de recuo.
zh_cn: 简单的条件是通过使用 ``if``/``else``/``elif`` 语法创建的。条件的括号是允许的，但不是必需的。考虑到基于制表符的缩进的性质，可以使用 ``elif`` 而不是 ``else``/``if`` 来维持缩进的级别。

source: Short statements can be written on the same line as the condition::
de: Kurze Befehle können auf die selbe Zeile wie die Bedingung geschrieben werden:
es: Las declaraciones cortas se pueden escribir en la misma línea que la condición::
ko: 간단한 명령문은 조건처럼 같은 줄에 적을 수 있습니다::
pt_br: Expressões curtas podem ser escritas na mesma linha da condição::
zh_cn: 短语句可以写在与条件相同的行上：

source: Sometimes, you might want to assign a different initial value based on a boolean expression. In this case, ternary-if expressions come in handy::
de: Manchmal möchte man vielleicht anfangs einen anderen Wert zuweisen, basierend auf einem booleschen Ausdruck. Hierfür ist der ternäre IF-Ausdruck nützlich:
ko: 때로는, 불리언(Boolean) 표현식을 기반으로 다른 초기 값을 지정해야 하는 경우가 있습니다. 이 경우에는 삼항 표현식을 쓰면 됩니다::
pt_br: Às vezes, você pode querer atribuir um valor inicial diferente baseado em uma expressão booleana. Nesse caso, expressões do tipo if-ternário são úteis::
zh_cn: 有时您可能希望基于布尔表达式分配不同的初始值。在这种情况下，三元表达式将派上用场：

source: Simple loops are created by using ``while`` syntax. Loops can be broken using ``break`` or continued using ``continue``:
de: Einfache Schleifen werden mit dem ``while`` Syntax erstellt. Schleifen kann man mit ``break`` abbrechen, oder mit ``continue`` in den nächsten Durchlauf springen lassen:
es: Los bucles primarios se pueden crear usando la sintaxis ``while``. De los bucles se puede salir usando ``break`` o se puede pasar a la siguiente iteración usando ``continue``:
ko: 간단한 루프는 ``while`` 문법으로 만들 수 있습니다. 루프는 ``break``\ 를 사용하여 끊거나 ``continue``\ 를 사용하여 계속 갈 수 있습니다:
pt_br: Laços simples são criados utilizando a sintaxe ``while``. Laços podem ser interrompidos utilizando ``break`` ou continuados utilizando ``continue``:
zh_cn: 简单的循环是使用 ``while`` 语法创建的。可以使用 ``break`` 来中断循环，或者使用 ``continue`` 来继续：

source: To iterate through a range, such as an array or table, a *for* loop is used. When iterating over an array, the current array element is stored in the loop variable. When iterating over a dictionary, the *key* is stored in the loop variable.
de: Um einen Bereich wie ein Array oder eine Tabelle zu durchlaufen, wird eine *for* -Schleife verwendet. Beim Iterieren über ein Array wird das aktuelle Array-Element in der Schleifenvariablen gespeichert. Beim Durchlaufen eines Wörterbuchs wird der *Schlüssel* in der Schleifenvariablen gespeichert.

source: A ``match`` statement is used to branch execution of a program. It's the equivalent of the ``switch`` statement found in many other languages, but offers some additional features.
de: Eine ``match``-Anweisung benutzt man, um die Ausführung des Programms zu verzweigen. Sie ist äquivalent zur ``switch``-Anweisung, wie sie aus vielen anderen Sprachen bekannt ist, aber bietet darüberhinaus zusätzliche Funktionalität.
es: La expresión ``match`` se usa para bifurcar la ejecución del programa. Es el equivalente de la expresión ``switch`` encontrada en otros lenguajes de programación, pero ofrece funcionalidades adicionales.
ko: ``match`` 명령문은 프로그램 실행을 분기화하는 데 사용됩니다. 이것은 많은 다른 언어에서 찾을 수 있는 ``switch`` 명령문과 유사하지만 몇 가지 추가 기능을 제공합니다.
pt_br: Uma expressão ``match`` é usada para ramificar a execução de um programa. É equivalente à expressão ``switch`` encontrada em muitas outras linguagens de programação, mas oferece algumas funcionalidades adicionais.
zh_cn: ``match`` 语句用于分支程序的执行。它相当于在许多其他语言中出现的 ``switch`` 语句，但提供了一些附加功能。

source: Basic syntax::
de: Grundlegende Syntax:
ko: 기본 문법::
pt_br: Sintaxe básica::
zh_cn: 基本语法：

source: **Crash-course for people who are familiar with switch statements**:
de: **Crashkurs für jene, die mit switch-Anweisungen vertraut sind**:
es: **Curso rápido para las personas familiarizadas con las expresiones switch**:
ko: **switch 명령문에 익숙한 사람들을 위한 집중 강좌**:
pt_br: **Curso rápido para pessoas familiarizadas com expressões switch**:
zh_cn: **熟悉switch语句的人的速成课程**：

source: Replace ``switch`` with ``match``.
de: Ersetze ``switch`` mit ``match``.
ko: ``switch``\ 를 ``match``\ 로 바꾸세요.
pt_br: Substitua ``switch`` por ``match``.
zh_cn: 将 ``switch`` 替换为 ``match``。

source: Remove ``case``.
de: Entferne ``case``.
ko: ``case``\ 를 제거하세요.
pt_br: Remova ``case``.
zh_cn: 删除 ``case``。

source: Remove any ``break``\ s. If you don't want to ``break`` by default, you can use ``continue`` for a fallthrough.
de: Entfernt jedes ``break``\ s. Sollte das standardmäßige ``break`` ungewünscht sein, so kann durch ``continue`` ein Fortfahren erzielt werden.
es: Elimina todos los ``break``. Si no quieres que la ejecución se detenga por defecto, puedes usar ``continue`` para continuar la ejecución en cascada.
ko: 모든 ``break``\ 를 제거하세요. 기본적으로 ``break``\ 가 되지 않도록 하고 싶다면, 다른 언어의 fallthrough 키워드처럼 ``continue``\ 를 사용할 수 있습니다.
pt_br: Remova todos os ``break``\ s. Se você não quer interromper (``break``) por padrão, você pode usar ``continue`` para contornar.
zh_cn: 删除任何 ``break`` 。如果默认情况下不想用 ``break`` ，可以使用 ``continue`` 作为下移。

source: Change ``default`` to a single underscore.
de: Ändere ``default`` zu einem einzelnen Unterstrich.
es: Cambia ``default`` por un guión bajo.
ko: ``default``\ 를 하나의 밑줄로 변경하세요.
pt_br: Troque ``default`` por um único sublinhado.
zh_cn: 将 ``default`` 更改为单个下划线。

source: **Control flow**:
de: **Kontrollfluss**:
es: **Control del flujo**:
ko: **제어 흐름(Control flow)**:
pt_br: **Controle de fluxo**:
zh_cn: **控制流**：

source: The patterns are matched from top to bottom. If a pattern matches, the first corresponding block will be executed. After that, the execution continues below the ``match`` statement. You can use ``continue`` to stop execution in the current block and check for an additional match in the patterns below it.
de: Die Muster werden von oben nach unten abgeglichen. Wenn ein Muster passt, wird der entsprechende Block ausgeführt. Danach setzt die Ausführung unter der ``match``-Anweisung fort. Wenn stattdessen ein Durchrutschen (Fallthrough) gewünscht ist, kann ein ``continue`` benutzt werden, um die Ausführung im aktuellen Block anzuhalten und in die Folgenden zu springen.

source: There are 6 pattern types:
de: Es gibt 6 Arten von Mustern:
es: Hay 6 tipos de patrones:
ko: 6 가지 패턴 유형이 있습니다:
pt_br: Há 6 tipos de padrões:
zh_cn: 有6种模式类型：

source: Constant pattern
de: Konstanten-Muster
ko: 상수 패턴(Constant pattern)
pt_br: Padrão de constante
zh_cn: 常量模式

source: Constant primitives, like numbers and strings::
de: Konstanten einfachen Typs, wie Zahlen und Zeichenketten:
ko: 숫자와 문자열과 같은 상수 원시값(Primitive)::
pt_br: Constantes primitivas, como números e textos::
zh_cn: 常量原语，例如数字和字符串：

source: Variable pattern
de: Variablen-Muster
ko: 변수 패턴(Variable pattern)
pt_br: Padrão de variável
zh_cn: 变量模式

source: Matches the contents of a variable/enum::
de: Vergleicht mit dem Inhalt einer Variable oder Aufzählung:
ko: 변수/열거형의 내용을 맞춰봅니다::
pt_br: Compara o conteúdo de uma variável/enumeração::
zh_cn: 匹配变量/枚举的内容：

source: Wildcard pattern
de: Platzhalter-Muster
ko: 임의 문자 기호 패턴(Wildcard pattern)
pt_br: Padrão coringa
zh_cn: 通配符模式

source: This pattern matches everything. It's written as a single underscore.
de: Dieses Schema passt auf alles. Es wird als einzelner Unterstrich geschrieben.
es: Este patrón busca emparejar cualquier cosa. Se escribe con un guión bajo.
ko: 이 패턴은 모든 것을 대조합니다. 하나의 밑줄로 쓸 수 있습니다.
pt_br: Este padrão compara/coincide com tudo. É escrito com uma única sublinha _ .
zh_cn: 这个模式匹配所有内容。它被写成一个下划线。

source: It can be used as the equivalent of the ``default`` in a ``switch`` statement in other languages::
de: Es kann als das Äquivalent genutzt werden von ``default`` in einer ``switch``-Anweisung in anderen Sprachen.:
ko: 다른 언어의 ``switch`` 명령문의 ``default``\ 와 같은 의미로 쓰입니다::
pt_br: Pode ser usado como equivalente ao ``default`` de uma expressão ``switch`` em outras linguagens::
zh_cn: 它可以与其他语言的 ``switch`` 语句中的 ``default`` 等效：

source: Binding pattern
de: Verbindungs-Muster
ko: 바인딩 패턴(Binding pattern)
pt_br: Padrão de ligação
zh_cn: 绑定模式

source: A binding pattern introduces a new variable. Like the wildcard pattern, it matches everything - and also gives that value a name. It's especially useful in array and dictionary patterns::
de: Ein Verbindungs-Muster erzeugt eine neue Variable. Wie das Platzhalter-Muster passt es auf alles und gibt diesem Wert einen Namen. Es ist besondern hilfreich beim Feld- und Wörterbuch-Muster:
ko: 바인딩 패턴은 새 변수를 도입합니다. 임의 문자 기호 패턴과 마찬가지로, 전부를 비교합니다. 그리고 값에 이름을 부여합니다. 이는 특히 배열 패턴과 딕셔너리 패턴에 유용합니다::
pt_br: Um padrão de ligação introduz uma nova variável. Como o padrão coringa, ele coincide com tudo – e ainda dá a esse valor um nome. É útil especialmente para padrões de matriz e de dicionário. ::
zh_cn: 绑定模式引入了一个新变量。与通配符模式类似，它匹配所有内容——并为该值提供一个名称。它在数组和字典模式中特别有用：

source: Array pattern
de: Array-Muster
ko: 배열 패턴(Array pattern)
pt_br: Padrão de matriz
zh_cn: 数组模式

source: Matches an array. Every single element of the array pattern is a pattern itself, so you can nest them.
de: Entspricht einem Array. Jedes einzelne Element des Array-Musters ist selbst ein Muster, sodass Sie es verschachteln können.
ko: 배열을 비교합니다. 배열 패턴의 각 단일 요소도 패턴이므로, 패턴을 중첩할 수 있습니다.
pt_br: Compara com um matriz. Cada elemento do padrão é um padrão por si só, para que você possa aninhá-los.
zh_cn: 匹配一个数组。数组模式的每个元素本身都是模式，因此您可以嵌套它们。

source: The length of the array is tested first, it has to be the same size as the pattern, otherwise the pattern doesn't match.
de: Die Länge des Arrays wird zuerst getestet. Sie muss dieselbe Größe wie das Muster haben, andernfalls stimmt das Muster nicht überein.
es: Se comprueba primero la longitud del arreglo, este tiene que tener el mismo tamaño que el patrón, de otra manera no habrá coincidencia.
ko: 배열의 길이가 먼저 테스트 되고, 그것이 패턴과 같은 크기이어야 합니다, 그렇지 않으면 패턴이 일치하지 않습니다.
pt_br: O comprimento da matriz é testado primeiro, ele tem que ter o mesmo tamanho do padrão, senão o padrão não coincide.
zh_cn: 首先测试数组的长度，它的大小必须与模式相同，否则模式不匹配。

source: **Open-ended array**: An array can be bigger than the pattern by making the last subpattern ``..``.
de: **Array mit offenem Ende**: Ein Array kann größer als das Muster sein, indem das letzte Untermuster mit ``..`` erstellt wird.
ko: **개방형 배열(Open-ended array)**: 배열의 마지막 하위 패턴을 ``..``\ 으로 만들어서 패턴보다 배열이 더 커질 수 있습니다.
pt_br: **Matriz sem término**: Uma matriz pode ser maior que o padrão deixando como último subpadrão ``..``.
zh_cn: **开放式数组**：通过使最后一个子模式为 ``..``，可以使数组大于模式。

source: Every subpattern has to be comma-separated.
de: Jedes Untermuster muss durch Kommas getrennt werden.
ko: 각 하위 패턴은 쉼표로 분리해야 합니다.
pt_br: Todo subpadrão precisa ser separado por vírgulas.
zh_cn: 每个子模式都必须用逗号分隔。

source: Dictionary pattern
de: Wörterbuch-Muster
ko: 딕셔너리 패턴(Dictionary pattern)
pt_br: Padrão de dicionário
zh_cn: 字典模式

source: Works in the same way as the array pattern. Every key has to be a constant pattern.
de: Funktioniert auf die gleiche Weise wie das Feld-Muster, jeder Schlüssel muss ein gleichbleibendes Muster haben.
es: Funciona de la misma manera que el patrón de array. Cada clave tiene que ser un patrón de constante.
ko: 배열 패턴과 같은 방식으로 작동합니다. 모든 키는 일정한 패턴이어야 합니다.
pt_br: Funciona da mesma forma que o padrão de array. Toda chave precisa ser um padrão constante.
zh_cn: 工作方式与数组模式相同。每个键必须是一个常量模式。

source: The size of the dictionary is tested first, it has to be the same size as the pattern, otherwise the pattern doesn't match.
de: Die Größe des Wörterbuchs wird zuerst getestet. Es muss dieselbe Größe wie das Muster haben, andernfalls stimmt das Muster nicht überein.
es: Se comprueba primero el tamaño del diccionario y tiene que ser igual al del patrón, de otro modo el patrón no coincidirá.
ko: 딕셔너리의 크기가 먼저 테스트 되고, 그것이 패턴과 같은 크기이어야 합니다, 그렇지 않으면 패턴이 일치하지 않습니다.
pt_br: O tamanho do dicionário é testado primeiro, ele tem que ser o mesmo tamanho do padrão, senão o padrão não coincide.
zh_cn: 首先要测试字典的大小，它的大小必须与模式相同，否则模式不匹配。

source: **Open-ended dictionary**: A dictionary can be bigger than the pattern by making the last subpattern ``..``.
de: **Wörterbuch mit offenem Ende**: Ein Wörterbuch kann größer als das Muster sein, indem das letzte Untermuster mit ``..`` erstellt wird.
ko: **개방형 딕셔너리**(Open-ended dictionary): 딕셔너리의 마지막 하위 패턴을 ``..``\ 으로 만들어서 패턴보다 딕셔너리가 더 커질 수 있습니다.
pt_br: **Dicionário sem término**: Um dicionário pode ser maior que o padrão deixando como último subpadrão ``..``.
zh_cn: **开放式字典**：通过使最后一个子模式为 ``..``，可以使字典大于模式。

source: Every subpattern has to be comma separated.
de: Jede Untermuster muss durch ein Komma getrennt werden.
es: Cada sub-patrón tiene que estar separado por comas.
ko: 모든 하위 패턴은 쉼표로 분리되어야 합니다.
pt_br: Qualquer subpadrão precisa ser separado por vírgulas.
zh_cn: 每个子模式都必须用逗号分隔。

source: If you don't specify a value, then only the existence of the key is checked.
de: Falls kein Wert angegeben wird, wird nur die Existenz des Schlüssels überprüft.
es: Si no especificas un valor, solo se comprobará la existencia de la clave.
ko: 값을 지정하지 않으면, 키의 존재 여부만 확인됩니다.
pt_br: Se você não especificar um valor, só a existência da chave é conferida.
zh_cn: 如果不指定值，则仅检查键的存在。

source: A value pattern is separated from the key pattern with a ``:``.
de: Ein Wertemuster wird durch ein ``:`` vom Schlüsselmuster getrennt.
ko: 값 패턴과 키 패턴은 ``:``\ 로 분리합니다.
pt_br: Um padrão de valor é separado do padrão de chave com ``:`` .
zh_cn: 值模式与键模式之间以 ``:`` 分隔。

source: Multiple patterns
de: Vielfach-Muster
ko: 여러 패턴(Multiple patterns)
pt_br: Multipadrões
zh_cn: 多重模式

source: You can also specify multiple patterns separated by a comma. These patterns aren't allowed to have any bindings in them.
de: Sie können auch mehrere durch Komma getrennte Muster angeben. Diese Muster dürfen keine Bindungen enthalten.
ko: 여러 패턴을 쉼표로 분리해서 지정할 수 있습니다. 이 패턴들 사이에서 바인딩은 허용되지 않습니다.
pt_br: Você pode especificar múltiplos padrões separando-os por uma vírgula. Esses padrões não são permitidos de ter quaisquer ligações.
zh_cn: 您还可以指定由逗号分隔的多重模式。这些模式不允许包含任何绑定。

source: Classes
de: Klassen
es: Clases
ko: 클래스(Class)
zh_cn: 类

source: By default, all script files are unnamed classes. In this case, you can only reference them using the file's path, using either a relative or an absolute path. For example, if you name a script file ``character.gd``::
de: Standardmäßig sind alle Skriptdateien namenlose Klassen. In diesem Fall können Sie sie nur über den Dateipfad referenzieren, entweder über einen relativen oder einen absoluten Pfad. Wenn Sie beispielsweise eine Skriptdatei ``character.gd`` benennen:
ko: 기본적으로 모든 스크립트 파일은 이름 없는 클래스입니다. 이 경우에는, 상대 경로나 절대 경로와 같은 파일의 경로를 사용해서 참조만 할 수 있습니다. 예를 들어, 스크립트 파일의 이름을 ``characrer.gd``\ 라고 지었다면 다음과 같이 참조합니다::
pt_br: Por padrão, todos os arquivos de scripts são classes sem nome. Neste caso, você só irá poder os referenciar usando o caminho do arquivo, usando tanto um caminho relativo como um absoluto. Por exemplo, se você nomear um arquivo de script ``character.gd``::
zh_cn: 默认情况下，所有脚本文件都是未命名的类。在这种情况下，只能使用文件的路径引用它们，使用相对路径或绝对路径。例如，如果您将脚本文件命名为 ``character.gd``：

source: Instead, you can give your class a name to register it as a new type in Godot's editor. For that, you use the ``class_name`` keyword. You can add an optional comma followed by a path to an image, to use it as an icon. Your class will then appear with its new icon in the editor::
de: Sie können ein Skript benennen und als Typ im Editor mit dem Schlüsselwort ``class_name``, gefolgt von dem Namen der Klasse, registrieren. Gefolgt von einem Komma können Sie optional einen Pfad zu einer Bilddatei hinzufügen. Sie finden Ihren neuen Typen dann im Dialogfeld "Nodes- oder Ressourcenerstellung".
ko: 대신 클래스에 이름을 붙여서 Godot 편집기의 새 유형으로 등록할 수 있습니다. 이를 위해, ``class_name`` 키워드를 사용합니다. 개별적으로 쉼표를 붙인 다음, 아이콘으로 사용할 이미지의 경로를 입력할 수 있습니다. 만든 클래스는 새 아이콘을 가진 채로 편집기에서 볼 수 있습니다::
pt_br: No entanto, você pode dar um nome a sua classe para registrá-la como um novo tipo no editor do Godot. Para isso, você pode usar a palavra chave ``class_name``. Você pode adicionar uma vírgula opcional seguida de um caminho para uma imagem, para utilizar como ícone. Sua classe, aparecerá, então, com seu novo ícone no editor::
zh_cn: 代替的是，可以为您的类命名，以在Godot的编辑器中将其注册为新类型。为此，请使用 ``class_name`` 关键字。您可以添加可选的逗号，后跟图像的路径，以将图像用作图标。然后您的类将在编辑器中显示其新图标：
