Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_styleguide.po
Languages: de, ja, pl

source: GDScript style guide
de: GDScript Stil-Richtlinien
ja: GDScriptスタイルガイド

source: This style guide lists conventions to write elegant GDScript. The goal is to encourage writing clean, readable code and promote consistency across projects, discussions, and tutorials. Hopefully, this will also support the development of auto-formatting tools.
de: Diese Stil-Richtlinien listen Konventionen zum Schreiben von elegantem GDScript auf. Das Ziel ist Sie dazu zu ermutigen, sauberen und lesbaren Code zu schreiben und die Konsistenz aller Projekte, Diskussionen und Anleitungen zu fördern. Hoffentlich wird dies auch die Entwicklung von Auto-Formatierungswerkzeugen ankurbeln.
ja: このスタイルガイドには、エレガントなGDScriptを作成するための規則が記載されています。目標は、クリーンで読みやすいコードの作成を奨励し、プロジェクト、ディスカッション、およびチュートリアル間の一貫性を促進することです。うまくいけば、これも自動フォーマットツールの開発を促進するでしょう。

source: Since GDScript is close to Python, this guide is inspired by Python's `PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__ programming style guide.
de: Da GDScript Python ähnelt, ist diese Anleitung inspiriert von Python's `PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__ Programmier-Stil-Richtlinien.
ja: GDScriptはPythonに近いので、このガイドはPythonの `PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__ プログラミングスタイルガイドに触発されています。

source: Style guides aren't meant as hard rulebooks. At times, you may not be able to apply some of the guidelines below. When that happens, use your best judgment, and ask fellow developers for insights.
de: Stil-Richtlinien sind nicht als harte Regelbücher gedacht. Manchmal können Sie einige der folgenden Richtlinien möglicherweise nicht anwenden. In diesem Fall urteilen Sie selbst was wohl am besten wäre und fragen Sie andere Entwickler nach Erkenntnissen.
ja: スタイルガイドは、厳密なルールブックを意味するものではありません。時には以下のガイドラインの一部を適用できない場合があります。その場合は、最善であるように判断を下すと共に、仲間の開発者に洞察を求めてください。

source: In general, keeping your code consistent in your projects and within your team is more important than following this guide to a tee.
de: Im Allgemeinen ist es wichtiger, Ihren Code in Ihren Projekten und in Ihrem Team konsistent zu halten, als diesem Leitfaden blind zu folgen.
ja: 一般に、プロジェクト内およびチーム内でコードの一貫性を保つことは、このガイドに完璧に従うよりも重要です。

source: Godot's built-in script editor uses a lot of these conventions by default. Let it help you.
de: Godot's integrierter Skripteditor verwendet standardmäßig einige dieser Konventionen.
ja: Godotのビルトインスクリプトエディタは、デフォルトでこれらの規則を多く使用します。それをあなたの役に立つようにしてください。
pl: Wbudowany edytor skryptów Godota domyślnie korzysta z wielu z tych konwencji. Pozwól mu, pomóc sobie.

source: Here is a complete class example based on these guidelines:
de: Hier ist ein vollständiges Klassenbeispiel basierend auf diesen Richtlinien:
ja: これらのガイドラインに基づいた完全なクラスの例を次に示します:

source: Formatting
de: Formatierung
ja: 書式設定

source: Encoding and special characters
de: Kodierung und Sonderzeichen
ja: エンコードと特殊文字

source: Use line feed (**LF**) characters to break lines, not CRLF or CR. *(editor default)*
de: Benutzen Sie Line Feed (**LF**) für Zeilenumbrüche, nicht CRLF oder CR. *(Standardeinstellung im Editor)*
ja: CRLFやCRではなく、改行(**LF**)文字を使用して改行します。\ *(エディタのデフォルト)*

source: Use one line feed character at the end of each file. *(editor default)*
de: Benutzen Sie ein Line Feed am Ende jeder Datei. *(Standardeinstellung im Editor)*
ja: 各ファイルの最後に1つの改行文字を使用します。\ *(エディタのデフォルト)*

source: Use **UTF-8** encoding without a `byte order mark <https://en.wikipedia.org/wiki/Byte_order_mark>`_. *(editor default)*
de: Verwenden Sie die **UTF-8**-Codierung ohne ein `byte order mark <https://en.wikipedia.org/wiki/Byte_order_mark>`_. *(Editor Standard)*
ja: `バイトオーダーマーク <https://ja.wikipedia.org/wiki/バイトオーダーマーク>`_\ なしで\ **UTF-8**\ エンコーディングを使用します。\ *(エディタのデフォルト)*

source: Use **Tabs** instead of spaces for indentation. *(editor default)*
de: Benutzen Sie **Tabs** anstelle von Leerzeichen für Einrückungen. *(Standardeinstellung im Editor)*
ja: インデントにはスペースの代わりに\ **タブ**\ を使用します。\ *(エディタのデフォルト)*

source: Indentation
de: Einrückungen
ja: インデント
pl: Wcięcia

source: Each indent level should be one greater than the block containing it.
de: Jede Einrückungsebene sollte um eins größer sein als die des umgebenden Blocks.
ja: 各インデントレベルは、それを含むブロックより1つ大きくなければなりません。
pl: Każdy poziom wcięcia powinien być o jeden większy niż w bloku, w którym się znajduje.

source: **Good**:
de: **Gut**:
ja: **良い例**:
pl: **Dobrze**:

source: **Bad**:
de: **Schlecht**:
ja: **悪い例**:
pl: **Źle**:

source: Use 2 indent levels to distinguish continuation lines from regular code blocks.
de: Rücke 2 Ebenen ein, um fortgesetzte Zeilen von regulären Codeblöcken zu unterscheiden.
ja: 継続行と通常のコードブロックを区別するには、2つのインデントレベルを使用します。
pl: Użyj dwóch poziomów wcięcia dla odróżnienia bloku kodu od kontynuacji poprzedniej linii.

source: Exceptions to this rule are arrays, dictionaries, and enums. Use a single indentation level to distinguish continuation lines:
de: Ausnahmen von dieser Regel sind Arrays, Wörterbücher und Aufzählungen. Verwenden Sie eine einzelne Einrückungsstufe, um fortgesetzte Zeilen zu unterscheiden:
ja: この規則の例外は、配列、辞書、および列挙型です。単一のインデントレベルを使用して、継続行を区別します。

source: Trailing comma
de: nachfolgendes Komma
ja: 末尾のコンマ

source: Use a trailing comma on the last line in arrays, dictionaries, and enums. This results in easier refactoring and better diffs in version control as the last line doesn't need to be modified when adding new elements.
de: Verwenden Sie in Arrays, Wörterbüchern und Aufzählungen in der letzten Zeile ein nachfolgendes Komma. Dies führt zu einem einfacheren Refactoring und besseren Unterschieden in der Versionskontrolle, da die letzte Zeile beim Hinzufügen neuer Elemente nicht geändert werden muss.
ja: 配列、辞書、および列挙型の最後の行に末尾のコンマを使用します。これにより、新しい要素を追加するときに最後の行を変更する必要がないため、リファクタリングが容易になり、バージョン管理の差分が改善されます。

source: Trailing commas are unnecessary in single-line lists, so don't add them in this case.
de: Nachfolgende Kommas sind in einzeiligen Listen nicht erforderlich. Fügen Sie sie in diesem Fall also nicht hinzu.
ja: 単一行リストでは末尾のコンマは不要なので、この場合は追加しないでください。

source: Blank lines
de: Leere Zeilen
ja: 空白行
pl: Puste wiersze

source: Surround functions and class definitions with two blank lines:
de: Vor und nach einer Funktion- bzw. Klassendefinition sollten zwei Leerzeilen sein:
ja: 関数とクラスの定義は2つの空白行で囲んで下さい:

source: Use one blank line inside functions to separate logical sections.
de: Verwende eine Leerzeile um logische Abschnitte innerhalb einer Funktion zu separieren.
ja: 論理セクションを区切るには、関数内で1行の空白行を使用します。
pl: Użyj jednego pustego wiersza wewnątrz funkcji, aby oddzielić sekcje logiczne.

source: Line length
de: Zeilenlänge
ja: 行の長さ

source: Keep individual lines of code under 100 characters.
de: Halten Sie einzelne Codezeilen unter 100 Zeichen.
ja: コードの個々の行を100文字以内に保ちます。

source: If you can, try to keep lines under 80 characters. This helps to read the code on small displays and with two scripts opened side-by-side in an external text editor. For example, when looking at a differential revision.
de: Wenn Sie können, versuchen Sie, Zeilen unter 80 Zeichen zu halten. Dies hilft beim Lesen des Codes auf kleinen Displays und mit zwei nebeneinander geöffneten Skripten in einem externen Texteditor. Zum Beispiel bei der Betrachtung einer Datei in unterschiedlichen Versionen (Differenzkontrolle).
ja: 可能であれば、行を80文字未満に保つようにしてください。これにより、小さなディスプレイでコードを読む場合や、2つのスクリプトを外部テキスト エディタで並べて開くときに役立ちます。たとえば、差分リビジョンを見る場合などです。

source: One statement per line
de: Eine Anweisung pro Zeile
ja: 1行につき1つのステートメント

source: Never combine multiple statements on a single line. No, C programmers, not even with a single line conditional statement.
de: Schreibe niemals mehrere Anweisungen in einer Zeile. Nein, liebe C Programmierer, auch keine einzeiligen bedingten Anweisungen.
ja: 複数のステートメントを1行にまとめないでください。Cプログラミングで可能な、1行での条件付きステートメントもありません。

source: The only exception to that rule is the ternary operator:
de: Die einzige Ausnahme dieser Regel ist der Tenär Operator:
ja: その規則の唯一の例外は三項演算子です:

source: Avoid unnecessary parentheses
de: Vermeide unnötige Klammern
ja: 不要なかっこ()を入れない

source: Avoid parentheses in expressions and conditional statements. Unless necessary for order of operations, they only reduce readability.
de: Vermeide Klammern in Ausdrücken und Bedingungen. Außer um logische Reihenfolgen zu bestimmen, sie verringern nur die Lesbarkeit.
pl: Unikaj nawiasów w wyrażeniach i instrukcjach warunkowych, o ile nie jest to konieczne ze względu na kolejność operacji. Ograniczają one jedynie czytelność.

source: Boolean operators
de: Boolesche Operatoren
ja: ブール演算子

source: Prefer the plain English versions of boolean operators, as they are the most accessible:
de: Benutze wenn möglich die englische Version der Booleschen Operatoren, da diese verständlicher sind:
ja: 最もアクセスしやすいように、ブール演算子のプレーンな英語バージョンを優先します:

source: Use ``and`` instead of ``&&``.
de: nutze ``and`` anstelle von ``&&``.
ja: ``&&`` の代わりに ``and`` を使用します。

source: Use ``or`` instead of ``||``.
de: nutze ``or`` anstelle von ``||``.
ja: ``||`` の代わりに ``or`` を使用します。

source: You may also use parentheses around boolean operators to clear any ambiguity. This can make long expressions easier to read.
de: Es können auch Klammern um Boolesche Operatoren gesetzt werden um Unklarheiten zu beseitigen. Hierdurch werden lange Ausdrücke lesbarer.
ja: また、ブール演算子をかっこで囲んであいまいさを解消することもできます。これにより、長い式が読みやすくなります。

source: Comment spacing
de: Leerzeichen bei Kommentaren
ja: コメントスペース

source: Regular comments should start with a space, but not code that you comment out. This helps differentiate text comments from disabled code.
de: Kommentare sollten mit einem Leerzeichen beginnen, aber kein Code der auskommentiert wird (inaktiv). Dies hilft Kommentare von inaktivem Code zu unterscheiden.
ja: 通常のコメントはスペースで始まる必要がありますが、コメントアウトしたコードにはスペースは付けません。これにより、テキストコメントと無効化したコードを区別できます。

source: In the script editor, to toggle the selected code commented, press :kbd:`Ctrl + K`. This feature adds a single # sign at the start of the selected lines.
de: Drücken Sie im Skripteditor :kbd:`Ctrl + K`, um den ausgewählten Code auszukommentieren. Diese Funktion fügt am Anfang der ausgewählten Zeilen ein einzelnes # Zeichen hinzu.
ja: スクリプトエディタで、選択したコードのコメントを切り替えるには、\ :kbd:`Ctrl + K` を押します。この機能は、選択した行の先頭に単一の#記号を追加します(#記号があれば逆に削除します)。

source: Whitespace
de: Leerzeichen
ja: スペース
pl: Biały znak

source: Always use one space around operators and after commas. Also, avoid extra spaces in dictionary references and function calls.
de: Setze immer ein Leerzeichen um Operatoren und nach Kommas. Vermeide zusätzliche Leerzeichen in Dictionary-Referenzen oder Funktionsaufrufen.
ja: 演算子の前後およびコンマの後には常に1つのスペースを使用します。また、辞書参照や関数呼び出しに余分なスペースを入れないでください。

source: Don't use spaces to align expressions vertically:
de: Benutzen Sie keine Leerzeichen um Ausdrücke vertikal auszurichten (um "Spalten" zu erzeugen.):
ja: 式を垂直方向に揃えるためにスペースを使用しないでください:

source: Quotes
de: Anführungszeichen
ja: 引用符

source: Use double quotes unless single quotes make it possible to escape fewer characters in a given string. See the examples below:
de: Benutze doppelte Anführungszeichen, es sei denn, einfache Anführungszeichen erzeugen eine kürzere Zeichenfolge (keine Escape-Sequenzen). Hier ein Beispiel:
ja: シングルクォートを使えばエスケープする文字数を減らせる場合以外は、なるべくダブルクォートを使用するようにします。下記の例を見てください。

source: Numbers
de: Nummern

source: Don't omit the leading or trailing zero in floating-point numbers. Otherwise, this makes them less readable and harder to distinguish from integers at a glance.
de: Lassen Sie die führende oder nachfolgende Null in Gleitkommazahlen nicht weg. Andernfalls sind sie schwerer lesbar und auf einen Blick schwerer von Ganzzahlen zu unterscheiden.

source: **Good**::
de: **Gut**:

source: **Bad**::
de: **Schlecht**:

source: Use lowercase for letters in hexadecimal numbers, as their lower height makes the number easier to read.
de: Verwenden Sie Kleinbuchstaben für Buchstaben in hexadezimalen Zahlen, da ihre geringere Höhe die Lesbarkeit der Zahl erleichtert.

source: Take advantage of GDScript's underscores in literals to make large numbers more readable.
de: Nutzen Sie die Unterstriche von GDScript in Literalen, damit große Zahlen lesbarer sind.

source: Naming conventions
de: Benennungsrichtlinien
ja: 命名規則

source: These naming conventions follow the Godot Engine style. Breaking these will make your code clash with the built-in naming conventions, leading to inconsistent code.
de: Diese Benennungsrichtlinien folgen dem Godot Engine Style. Bei Nichtbeachtung wird Ihr Code mit den eingebauten Bennennungsrichtlinien kollidieren, was zu inkonsistentem Code führt.
ja: これらの命名規則は、Godot Engineスタイルに従います。これらを壊すと、コードが組み込みの命名規則と衝突し、コードの一貫性が失われます。

source: File names
de: Dateinamen

source: Use snake_case for file names. For named classes, convert the PascalCase class name to snake_case::
de: Benutze einen Unterstrich für Dateinamen. Für Klassennamen (Wortanfänge groß) füge den Unterstrich ein (wandle PascalCase in Snake_Case):

source: This is consistent with how C++ files are named in Godot's source code. This also avoids case sensitivity issues that can crop up when exporting a project from Windows to other platforms.
de: Dies steht im Einklang mit der Benennung von C++ Dateien im Godots Quellcode. Dadurch werden auch Probleme mit der Groß- und Kleinschreibung vermieden, die beim Exportieren eines Projekts von Windows auf andere Plattformen auftreten können.

source: Classes and nodes
de: Klassen und Nodes
ja: クラスとノード

source: Use PascalCase for class and node names:
de: Verwenden Sie PascalCase für Klassen- und Node-Namen:
ja: クラス名とノード名には PascalCase を使用します:

source: Also use PascalCase when loading a class into a constant or a variable:
de: Außerdem beim abspeichern einer Klasse in eine Konstante oder Variable:
ja: クラスを定数または変数にロードするときにもPascalCaseを使用します:

source: Functions and variables
de: Funktionen und Variablen
ja: 関数と変数

source: Use snake\_case to name functions and variables:
de: Nutze snake\_case um Funktionen und Variablen zu benennen:
ja: 関数と変数に名前を付けるには、snake\ _caseを使用します:

source: Prepend a single underscore (\_) to virtual methods functions the user must override, private functions, and private variables:
de: Stellen Sie einen einzelnen Unterstrich (\ _) vor virtueller Methoden, Funktionen die der Benutzer überschreiben muss, privaten Funktionen und privaten Variablen:
ja: ユーザーがオーバーライドする必要がある仮想メソッド関数、プライベート関数、およびプライベート変数の前に単一のアンダースコア(\_)を追加します:

source: Signals
de: Signale
ja: シグナル
pl: Sygnały

source: Use the past tense to name signals:
de: Nutze die Vergangenheitsform um Signale zu benennen:
ja: 過去形を使用してシグナルに名前を付けます:

source: Constants and enums
de: Konstanten und Aufzählungen
ja: 定数と列挙型

source: Write constants with CONSTANT\_CASE, that is to say in all caps with an underscore (\_) to separate words:
de: Verwende CONSTANT\_CASE, alles in Großbuchstaben, mit einem Unterstrich zur Worttrennung: ``const MAX_SPEED = 200``:
ja: CONSTANT\ _CASEで定数を記述します。つまり、すべて大文字でアンダースコア(\_)を使用して単語を区切ります:

source: Use PascalCase for enum *names* and CONSTANT\_CASE for their members, as they are constants:
de: Verwenden Sie PascalCase für Aufzählungsnamen und CONSTANT \ _CASE für deren Mitglieder, da es sich um Konstanten handelt:
ja: 列挙型の\ *名前*\ にはPascalCaseを、そのメンバーには定数なのでCONSTANT\_CASEを使用します:

source: Code order
de: Code Reihenfolge
ja: コードの順序

source: This first section focuses on code order. For formatting, see :ref:`formatting`. For naming conventions, see :ref:`naming_conventions`.
de: Dieser erste Abschnitt geht auf die Reihenfolge der Befehle im Code ein. Bzgl. Formatierungen siehe :ref:`formatting`. For naming conventions, see :ref:`naming_conventions`.
ja: この最初のセクションでは、コードの順序に焦点を当てます。書式設定については、\ :ref:`formatting` を参照してください。命名規則については、\ :ref:`naming_conventions` を参照してください。

source: We suggest to organize GDScript code this way:
de: Wir empfehlen GDScript Code auf diese Art zu organisieren:
ja: 次のようにGDScriptコードを整理することをお勧めします:

source: We optimized the order to make it easy to read the code from top to bottom, to help developers reading the code for the first time understand how it works, and to avoid errors linked to the order of variable declarations.
de: Wir haben die Reihenfolge optimiert, um das Lesen des Codes von oben nach unten zu vereinfachen, Entwicklern das erste Lesen des Codes zu erleichtern und Fehler im Zusammenhang mit der Reihenfolge der Variablendeklarationen zu vermeiden.
ja: 順序を最適化して、コードを上から下に読みやすくし、コードを初めて読む開発者がどのように機能するかを理解しやすくし、変数宣言の順序に関連するエラーを回避します。

source: This code order follows four rules of thumb:
de: Diese Code-Reihenfolge folgt vier Faustregeln:
ja: このコードの順序は、次の4つの経験則に従います:

source: Properties and signals come first, followed by methods.
de: Eigenschaften und Signale stehen an erster Stelle, gefolgt von Methoden.
ja: プロパティとシグナルが最初に来て、メソッドがそれに続きます。

source: Public comes before private.
de: Public kommt vor Private.
ja: パブリックはプライベートの前に来ます。

source: Virtual callbacks come before the class's interface.
de: Virtuelle Rückrufe kommen vor der Schnittstelle der Klasse.
ja: 仮想コールバックは、クラスのインターフェースの前に来ます。

source: The object's construction and initialization functions, ``_init`` and ``_ready``, come before functions that modify the object at runtime.
de: Die Konstruktions- und Initialisierungsfunktionen des Objekts, `_init`` und` `_ready``, stehen vor Funktionen, die das Objekt zur Laufzeit ändern.
ja: オブジェクトの構築関数と初期化関数、\ ``_init`` と ``_ready`` は実行時にオブジェクトを変更する関数の前に来ます。

source: Class declaration
de: Klassen deklarieren
ja: クラス宣言

source: If the code is meant to run in the editor, place the ``tool`` keyword on the first line of the script.
de: Wenn der Code im Editor ausgeführt werden soll, platzieren Sie das Schlüsselwort ``tool`` in der ersten Zeile des Skripts.
ja: コードがエディタで実行されることを意図している場合、スクリプトの最初の行に ``tool`` キーワードを置きます。

source: Follow with the `class_name` if necessary. You can turn a GDScript file into a global type in your project using this feature. For more information, see :ref:`doc_gdscript`.
de: Geben Sie ggf. den Klassennamen ein. Mit dieser Funktion können Sie eine GDScript-Datei in Ihrem Projekt in einen globalen Typ umwandeln. Weitere Informationen finden Sie unter :ref:`doc_gdscript`.
ja: 必要に応じて、\ `class_name` を続けます。この機能を使用して、プロジェクト内でGDScriptファイルをグローバルタイプに変換できます。詳細については、\ :ref:`doc_gdscript` を参照してください。

source: Then, add the `extends` keyword if the class extends a built-in type.
de: Fügen Sie dann das Schlüsselwort `extens` hinzu, wenn die Klasse einen integrierten Typ erweitert.
ja: 次に、クラスが組み込み型を拡張する場合は、\ `extends` キーワードを追加します。

source: Following that, you should have the class's optional docstring as comments. You can use that to explain the role of your class to your teammates, how it works, and how other developers should use it, for example.
de: Anschließend sollten Sie die optionale Dokumentzeichenfolge der Klasse als Kommentar haben. Sie können dies verwenden, um Ihren Teamkollegen die Rolle Ihrer Klasse zu erklären, wie sie funktioniert und wie andere Entwickler sie beispielsweise verwenden sollten.
ja: それに続いて、クラスに関する追加ドキュメントをコメントとして指定する必要があります。これを使用して、クラスの役割をチームメイトに説明したり、それがどのように機能するか、他の開発者がどのように使用するかなどを説明したりできます。

source: Signals and properties
de: Signale und Eigenschaften
ja: シグナルとプロパティ

source: Write signal declarations, followed by properties, that is to say, member variables, after the docstring.
de: Schreiben Sie Signaldeklarationen, gefolgt von Eigenschaften, das heißt, Mitgliedsvariablen nach der Dokumentzeichenfolge.
ja: 追加ドキュメントの後に、シグナル宣言、続いてプロパティ、つまりメンバー変数を記述します。

source: Enums should come after signals, as you can use them as export hints for other properties.
de: Aufzählungen sollten nach Signalen kommen, da Sie sie als Exporthinweise für andere Eigenschaften verwenden können.
ja: 列挙型は、他のプロパティのエクスポートヒントとして使用できるため、シグナルの後に来る必要があります。

source: Then, write constants, exported variables, public, private, and onready variables, in that order.
de: Dann geht es in dieser Reihenfolge weiter: Konstanten schreiben , exportierte Variablen, public, private und onready Variablen.
ja: 次に、定数、エクスポートされた変数、public、private、およびonready変数をこの順序で記述します。

source: The GDScript compiler evaluates onready variables right before the ``_ready`` callback. You can use that to cache node dependencies, that is to say, to get child nodes in the scene that your class relies on. This is what the example above shows.
de: Der GDScript-Compiler wertet onready Variablen unmittelbar vor dem Rückruf ``_ready`` aus. Sie können dies verwenden, um Node-Abhängigkeiten zwischenzuspeichern, das heißt um untergeordnete Nodes in der Szene abzurufen, auf die sich Ihre Klasse bezieht. Dies zeigt das obige Beispiel.
ja: GDScriptコンパイラは、\ ``_ready`` コールバックの直前にonready変数を評価します。これを使用して、ノードの依存関係をキャッシュしたり、クラスが依存しているシーン内の子ノードを取得したりできます。これは上記の例が示すものです。

source: Member variables
de: Mitgliedsvariablen

source: Don't declare member variables if they are only used locally in a method, as it makes the code more difficult to follow. Instead, declare them as local variables in the method's body.
de: Deklarieren Sie keine Mitgliedsvariablen, wenn sie nur lokal in einer Methode verwendet werden, da dies das Lesen des Codes erschwert. Deklarieren Sie sie stattdessen als lokale Variablen in der Methode.

source: Local variables
de: Lokale Variablen

source: Declare local variables as close as possible to their first use. This makes it easier to follow the code, without having to scroll too much to find where the variable was declared.
de: Deklarieren Sie lokale Variablen so nah wie möglich am Platz ihrer ersten Verwendung. Dies erleichtert das Lesen des Codes, ohne zu viel scrollen zu müssen, um herauszufinden, wo die Variable deklariert wurde.

source: Methods and static functions
de: Methoden und statische Funktionen
ja: メソッドと静的関数

source: After the class's properties come the methods.
de: Nach den Klassen-Eigenschaften kommen die Methoden.
ja: クラスのプロパティの後にメソッドが続きます。

source: Start with the ``_init()`` callback method, that the engine will call upon creating the object in memory. Follow with the ``_ready()`` callback, that Godot calls when it adds a node to the scene tree.
de: Beginnen Sie mit der Rückrufmethode ``_init()``, die die Engine beim Erstellen des Objekts im Speicher aufruft. Folgen Sie dem Rückruf ``_ready()`` den Godot aufruft, wenn er dem Szenenbaum ein Node hinzufügt.
ja: エンジンがメモリ内にオブジェクトを作成するときに呼び出す ``_init()`` コールバックメソッドで開始します。 そしてGodotがノードをシーンツリーに追加するときに呼び出す ``_ready()`` コールバックを続けます。

source: These functions should come first because they show how the object is initialized.
de: Diese Funktionen sollten an erster Stelle stehen, da sie zeigen, wie das Objekt initialisiert wird.

source: Other built-in virtual callbacks, like ``_unhandled_input()`` and ``_physics_process``, should come next. These control the object's main loop and interactions with the game engine.
de: Andere integrierte virtuelle Rückrufe wie "_unhandled_input()" und "_physics_process" "sollten als nächstes folgen. Diese steuern die Hauptschleife des Objekts und die Interaktionen mit der Spiel-Engine.
ja: ``_unhandled_input()`` や ``_physics_process`` のような、その他の組み込みの仮想コールバックが次に来る必要があります。これらは、オブジェクトのメインループとゲームエンジンとの相互作用を制御します。

source: The rest of the class's interface, public and private methods, come after that, in that order.
de: Der Rest der Schnittstelle der Klasse, öffentliche und private Methoden, folgt danach in dieser Reihenfolge.
ja: クラスの残りのインターフェイスであるパブリックメソッドとプライベートメソッドは、この順序でその後に続きます。

source: Static typing
de: Statische Typisierung
ja: 静的型付け

source: Since Godot 3.1, GDScript supports :ref:`optional static typing<doc_gdscript_static_typing>`.
de: Seit Godot 3.1 unterstützt GDScript :ref:`optionale statische Typisierung <doc_gdscript_static_typing>`.
ja: Godot 3.1から、GDScriptはオプショナルな静的型付けをサポートしています。

source: Declared types
de: Deklarierte Typen
