Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_basics.po
Languages: de, es, ko, pt_br, zh_cn

source: GDScript basics
de: GDScript Grundlagen
es: Bases de GDScript
ko: GDScript 기초
pt_br: Básicos do GDScript
zh_cn: GDScript 基础

source: Introduction
de: Einführung
es: Introducción
ko: 소개
pt_br: Introdução
zh_cn: 简介

source: *GDScript* is a high-level, dynamically typed programming language used to create content. It uses a syntax similar to `Python <https://en.wikipedia.org/wiki/Python_%28programming_language%29>`_ (blocks are indent-based and many keywords are similar). Its goal is to be optimized for and tightly integrated with Godot Engine, allowing great flexibility for content creation and integration.
de: *GDScript* ist eine high-level, dynamisch typisierte Programmiersprache zum Erstellen von Inhalten. Es verwendet eine ähnliche Syntax wie `Python <https://de.wikipedia.org/wiki/Python_%28Programmiersprache%29>`_ (Blöcke basieren auf Einrückung und viele Schlüsselwörter sind ähnlich). Es zielt auf eine Optimierung und enge Integration mit der Godot Engine ab, um große Flexibilität bei der Erstellung von Inhalten und deren Integration zu ermöglichen.
ko: *GDScript*\ 는 하이 레벨의, 동적 타입 프로그래밍 언어입니다. 문법은 `Python <https://ko.wikipedia.org/wiki/%ED%8C%8C%EC%9D%B4%EC%8D%AC>`_\ 과 유사합니다 (블록이 들여쓰기 기반이고, 많은 키워드가 비슷합니다). 이 언어의 목적은 내용 만들기 및 통합에 좋은 유연성을 바탕으로, Godot 엔진과 강하게 통합되어 최적화하는 것입니다.
pt_br: *GDScript* é uma linguagem de auto nível, dinâmicamente tipada, usada para criar conteúdo. Utiliza uma sintaxe similar a do `Python <https://en.wikipedia.org/wiki/Python_%28programming_language%29>`_ (blocos são baseados em indentação e muitas palavras-chave são similares). Seu objetivo é ser otimizada para e firmemente integrada ao motor Godot, permitindo grande flexibilidade para a criação e integração de conteúdo.
zh_cn: *GDScript* 是一种用于创建内容的高级、动态类型的编程语言。它使用类似于 `Python <https://en.wikipedia.org/wiki/Python_%28programming_language%29>`_ 的语法（块基于缩进，许多关键字相似）。其目标是针对Godot引擎进行优化并与之紧密集成，从而为内容创建和集成提供极大的灵活性。

source: History
de: Geschichte
es: Historia
ko: 역사
pt_br: História
zh_cn: 历史

source: Documentation about GDScript's history has been moved to the :ref:`Frequently Asked Questions <doc_faq_what_is_gdscript>`.
de: Ältere Artikel über GDScript wurden nach :ref:`Frequently Asked Questions <doc_faq_what_is_gdscript>` verschoben.
pt_br: A documentação sobre a história do GDScript foi movida para o :ref:`Frequently Asked Questions <doc_faq_what_is_gdscript>`.

source: Example of GDScript
de: Beispiel von GDScript
es: Ejemplo de GDScript
ko: GDScript 예제
pt_br: Exemplo de GDScript
zh_cn: GDScript的示例

source: Some people can learn better by taking a look at the syntax, so here's a simple example of how GDScript looks.
de: Manche Leute lernen besser, indem sie einfach die Syntax betrachten, deshalb hier ein Beispiel wie GDScript aussieht.
es: Algunas personas pueden aprender mejor echando un vistazo a la sintaxis, así que aquí hay un ejemplo simple de cómo se ve GDScript.
ko: 몇 몇 사람은 문법을 보는 것으로 언어를 더 잘 이해합니다. 따라서 GDScript를 어떻게 사용하는 지 간단한 예제를 보여 드리겠습니다.
pt_br: Algumas pessoas conseguem aprender melhor observando a sintaxe, então aqui está um simples exemplo de como o GDScript parece.
zh_cn: 有些人可以通过查看语法来更好地学习，因此，这有GDScript外观的简单示例。

source: If you have previous experience with statically typed languages such as C, C++, or C# but never used a dynamically typed one before, it is advised you read this tutorial: :ref:`doc_gdscript_more_efficiently`.
de: Wenn Sie bereits Erfahrung mit statisch typisierten Sprachen wie C, C++ oder C# haben, aber bisher keine dynamisch typisierte verwendet haben, wird das Lesen dieser Anleitung empfohlen: :ref:`doc_gdscript_more_efficiently`.
es: Si tienes experiencia previa con lenguajes estáticamente tipados como C, C++ o C# pero nunca has utilizado uno dinámicamente tipado antes, es recomendable leer este tutorial: :ref:`doc_gdscript_more_efficiently`.
ko: 이전에 C, C++, C#과 같은 정적 타입 언어에 대한 경험이 있지만, 한 번도 동적 타입 언어를 써 본 적이 없다면, 이 튜토리얼을 읽는 것이 좋습니다: :ref:`doc_gdscript_more_efficiently`.
pt_br: Se você possui experiência prévia com linguagems estaticamente tipadas, como C, C++, ou C#, mas nunca utilizou uma linguagem dinamicamente tipada antes, é aconselhado que leia este tutorial: :ref:`doc_gdscript_more_efficiently`.
zh_cn: 如果您以前有使用C、C++或C#之类的静态类型语言的经验，但以前从未使用过动态类型的语言，建议您阅读此教程： :ref:`doc_gdscript_more_efficiently`。

source: Language
de: Sprache
es: Lenguaje
ko: 언어
pt_br: Linguagem
zh_cn: 语言

source: In the following, an overview is given to GDScript. Details, such as which methods are available to arrays or other objects, should be looked up in the linked class descriptions.
de: Im Folgenden sei ein Überblick über GDScript gegeben. Details, wie welche Methoden es für Arrays oder andere Objekte gibt, sollten in den verlinkten Klassenbeschreibungen nachgeschlagen werden.
es: A continuación, se presenta un resumen de GDScript. Detalles, como qué métodos están disponibles para arrays u otros objetos deberán verse en las descripciones de las clases.
ko: 여기서부터 GDScript의 개요입니다. 어떤 메서드가 배열 혹은 다른 객체에 이용할 수 있는지와 같은 세부 사항은 클래스 설명의 링크를 확인해주세요.
pt_br: A seguir, uma visão geral é dada sobre o GDScript. Detalhes, como quais métodos são disponíveis para arrays ou outros objetos, devem ser vistos nas descrições da classe relacionada.
zh_cn: 在下面，概述了GDScript。详细信息，例如哪些方法可用于数组或其他对象，应该在链接的类描述中查找。

source: Identifiers
de: Bezeichner
es: Identificadores
ko: 식별자(Identifier)
pt_br: Identificadores
zh_cn: 标识符

source: Any string that restricts itself to alphabetic characters (``a`` to ``z`` and ``A`` to ``Z``), digits (``0`` to ``9``) and ``_`` qualifies as an identifier. Additionally, identifiers must not begin with a digit. Identifiers are case-sensitive (``foo`` is different from ``FOO``).
de: Jede Zeichenkette, die beschränkt ist auf Zeichen des Alphabets (``a`` bis ``z`` und ``A`` bis ``Z``), Ziffern (``0`` bis ``9``) und ``_``, ist ein gültiger Bezeichner. Zusätzlich dürfen Bezeichner nicht mit einer Ziffer beginnen. Bei Bezeichner wird Groß- und Kleinschreibung beachtet (``foo`` unterscheidet sich von ``FOO``).
es: Cualquier cadena se restringe a caracteres del alfabeto (``a`` a ``z`` y ``A`` a ``Z``), dígitos (``0`` a ``9``) y ``_`` también califica como identificador. Adicionalmente, los identificadores no deben comenzar con un dígito. Los identificadores son sensibles a mayúsculas y minúsculas (case-sensitive, ``foo`` no es lo mismo que ``FOO``).
ko: 알파벳 문자로 제한되는 문자열 (``a``\ 부터 ``z``, ``A``\ 부터 ``Z``), 숫자 (``0``\ 부터 ``9``), ``_``\ 는 식별자입니다. 추가로 식별자는 숫자로 시작할 수 없습니다. 식별자는 대소문자를 구분합니다 (``foo``\ 는 ``FOO``\ 와 다릅니다).
pt_br: Qualquer string que se restringe a caracteres alfabéticos("a" à "z" e "A" à "Z"), dígitos ("0" a "9") e "_" se qualifica como um identificador. Além disso, identificadores não devem começar com um dígito. Identificadore são case-sensitive ("foo" é diferente de "FOO").
zh_cn: 任何限制自己为字母字符（ ``a`` 到 ``z`` 和 ``A`` 到 ``Z`` ）、数字（ ``0`` 到 ``9`` ）和 ``_`` 的字符串都可以作为标识符。此外，标识符不能以数字开头。标识符区分大小写（ ``foo`` 和 ``FOO`` 是不同的）。

source: Keywords
de: Schlüsselwörter
es: Palabras clave
ko: 키워드(Keyword)
pt_br: Palavras-chave
zh_cn: 关键词

source: The following is the list of keywords supported by the language. Since keywords are reserved words (tokens), they can't be used as identifiers. Operators (like ``in``, ``not``, ``and`` or ``or``) and names of built-in types as listed in the following sections are also reserved.
de: Das Folgende ist eine Auflistung Schlüsselwörter, die von der Sprache unterstützt werden. Da Schlüsselwörter reservierte Begriffe (Tokens) sind, können sie nicht als Bezeichner verwendet werden. Operatoren (wie ``in``, ``not``, ``and`` oder ``or``) und Namen eingebauter Typen, die in den folgenden Abschnitten aufgelistet werden, sind ebenfalls reserviert.
es: La siguiente lista de palabras clave soportadas por el lenguaje. Como las palabras claves son palabras reservadas (símbolos), no pueden ser utilizadas como identificadores. Operadores(como ``in``, ``not``, ``and`` or ``or``) y nombres de tipo integrados listados en la siguiente sección tambien son reservados.
ko: 다음은 언어에서 지원하는 키워드 목록입니다. 키워드는 예약된 단어(토큰)이기 때문에, 식별자로 사용할 수 없습니다. 다음 섹션에 나열된 (``in``, ``not``, ``and`` 혹은 ``or`` 와 같은) 연산자와 내장 타입 이름 역시 예약된 단어입니다.
pt_br: A seguir está a lista de palavras-chaves suportadas pela linguagem. Já que as palavras-chaves são palavras reservadas (código), elas não podem ser usadas como identificadores. Operadores (como ``in``, ``not``, ``and`` ou ``or``) e nomes de tipos embutidos como os listados nas seções seguintes são também palavras reservadas.
zh_cn: 以下是该语言支持的关键字列表。由于关键字是保留字（令牌），它们不能用作标识符。操作符（如 ``in``、 ``not``、 ``and``、或 ``or`` ）以及下面列出的内置类型的名称也是保留的。

source: Keywords are defined in the `GDScript tokenizer <https://github.com/godotengine/godot/blob/master/modules/gdscript/gdscript_tokenizer.cpp>`_ in case you want to take a look under the hood.
de: Schlüsselwörter werden im `GDSkript Tokenizer <https://github.com/godotengine/godot/blob/master/modules/gdscript/gdscript_tokenizer.cpp>`_ definiert, falls Sie einen Blick unter die Haube werfen möchten.
es: Las palabras clave están definidas en el `GDScript tokenizer <https://github.com/godotengine/godot/blob/master/modules/gdscript/gdscript_tokenizer.cpp>`_ en caso de que se desee ver en detalle su funcionamiento.
ko: 키워드는 `GDScript tokenizer <https://github.com/godotengine/godot/blob/master/modules/gdscript/gdscript_tokenizer.cpp>`_\ 에서 정의됩니다. 정체가 궁금하다면 확인해보세요.
pt_br: Palavras chaves são definidas no `tokenizador da GDScript <https://github.com/godotengine/godot/blob/master/modules/gdscript/gdscript_tokenizer.cpp>`_ no caso de você querer dar uma olhada nos bastidores.
zh_cn: 关键字定义在 `GDScript tokenizer <https://github.com/godotengine/godot/blob/master/modules/gdscript/gdscript_tokenizer.cpp>`_ 中，以防您想了解其中的内幕。

source: Keyword
de: Schlüsselwort
es: Palabras clave
ko: 키워드
pt_br: Palavra-chave
zh_cn: 关键字

source: Description
de: Beschreibung
es: Descripción
ko: 설명
pt_br: Descrição
zh_cn: 描述

source: See `if/else/elif`_.
de: Siehe `if/else/elif`_.
es: Ver `if/else/elif`_.
ko: `if/else/elif`_\ 를 참고하세요.
pt_br: Veja `if/else/elif`_.
zh_cn: 见 `if/else/elif`_。

source: See for_.
de: Siehe for_.
es: Ver for_.
ko: for_\ 를 참고하세요.
pt_br: Veja for_.
zh_cn: 见 for_。

source: See while_.
de: Siehe while_.
es: Ver while_.
ko: while_\ 을 참고하세요.
pt_br: Veja while_.
zh_cn: 见 while_。

source: See match_.
de: Siehe match_.
es: Ver match_.
ko: match_\ 를 참고하세요.
pt_br: Veja match_.
zh_cn: 见 match_。

source: Exits the execution of the current ``for`` or ``while`` loop.
de: Beendet die Ausführung der aktuellen ``for`` oder ``while`` Schleife.
es: Sale de la ejecución del bucle ``for`` o ``while`` actual.
ko: 현재의 ``for`` 또는 ``while`` 루프 실행을 끝냅니다.
pt_br: Sai da execução do atual laço ``for`` ou ``while``.
zh_cn: 退出当前 ``for`` 或 ``while`` 循环的执行。

source: Immediately skips to the next iteration of the ``for`` or ``while`` loop.
de: Springt sofort zur nächsten Iteration der ``for`` oder ``while`` Schleife.
es: Pasa inmediatamente a la siguiente iteración del bucle ``for`` o ``while``.
ko: 즉시 ``for`` 또는 ``while`` 루프의 다음 반복으로 건너 뜁니다.
pt_br: Pula imediatamente a próxima iteração do laço ``for`` ou ``while``.
zh_cn: 立即跳到 ``for`` 或 ``while`` 循环的下一个迭代。

source: Used where a statement is required syntactically but execution of code is undesired, e.g. in empty functions.
de: Benutzt man, wo eine Anweisung zwar syntaktisch benötigt wird, aber die Ausführung von Code eigentlich ungewünscht ist, z.B. in leeren Funktionen.
es: Utilizado cuando sintácticamente se requiere una declaración pero no se desea ejecución de código, por ejemplo, en funciones vacías.
ko: 명령문이 문법적으로는 필요하지만 실행할 만한 코드가 마땅치 않을 때 사용됩니다. 예: 빈 함수.
pt_br: Usado onde uma declaração é requerida sintaticamente, mas a execução do código é indesejada ,por exemplo em funções vazias.
zh_cn: 在语法上要求语句但不希望执行代码的地方使用，例如在空函数中。

source: Returns a value from a function.
de: Gibt einen Wert aus einer Funktion zurück.
es: Devuelve el valor de una función.
ko: 함수에서 값을 반환합니다.
pt_br: Retorna um valor de uma função.
zh_cn: 从函数返回一个值。

source: Defines an inner class.
de: Definiert eine innere Klasse.

source: Defines a class name and optional icon for your script.
de: Definiert einen Klassennamen und ein optionales Symbol für Ihr Skript.

source: Defines what class to extend with the current class.
de: Definiert die Basisklasse, von welcher diese Klasse abgeleitet werden soll.
es: Define de qué clase extiende la clase actual.
ko: 현재 클래스로 확장할 클래스를 정의합니다.
pt_br: Define qual classe estender com a classe atual.
zh_cn: 定义用当前类扩展什么类。

source: Tests whether a variable extends a given class, or is of a given built-in type.
de: Testet, ob eine Variable von einer gegeben Klasse abgeleitet ist oder einem gegebenen eingebauten Typen entspricht.
es: Prueba si una variable extiende de la clase dada o es de un tipo integrado.
ko: 변수가 주어진 클래스를 확장하는지, 혹은 변수가 주어진 내장 유형인지 여부를 테스트합니다.
pt_br: Testa se uma variável extende de uma classe dada, ou é de um certo tipo embutido.
zh_cn: 测试变量是否扩展给定的类，或者是否是给定的内置类型。

source: Cast the value to a given type if possible.
de: Versucht den Wert einem vorgegebenen Type zuzuweisen falls möglich.
es: Convertir el valor a un tipo dado si es posible.
ko: 가능하다면 주어진 유형으로 값을 캐스트합니다.
pt_br: Transmita o valor para um determinado tipo, se possível.
zh_cn: 如果可能，将值转换为给定类型。

source: Refers to current class instance.
de: Bezieht sich auf die aktuelle Klassen Instanz.
es: Se refiere a la instancia de clase actual.
ko: 현재 클래스 인스턴스를 참조합니다.
pt_br: Refere-se a instância atual da classe.
zh_cn: 引用当前类实例。

source: Executes the script in the editor.
de: Führt ein Skript im Editor aus.
es: Ejecuta el script en el editor.
ko: 편집기에서 스크립트를 실행합니다.
pt_br: Executa o script no editor.
zh_cn: 在编辑器中执行脚本。

source: Defines a signal.
de: Definiert ein Signal.
es: Define una señal.
ko: 시그널을 정의합니다.
pt_br: Define um sinal.
zh_cn: 定义一个信号。

source: Defines a function.
de: Definiert eine Funktion.
es: Define una función.
ko: 함수를 정의합니다.
pt_br: Define uma função.
zh_cn: 定义一个函数。

source: Defines a static function. Static member variables are not allowed.
de: Definiert eine statische Funktion. Statische Member-Variablen sind nicht erlaubt.
es: Define una función estática. Variables miembro estáticas no están permitidas.
ko: 정적 함수를 정의합니다. 정적 멤버 변수를 허용하지 않습니다.
pt_br: Define uma função estática. Variáveis membro estáticas não são permitidas.
zh_cn: 定义一个静态函数。静态成员变量是不允许的。

source: Defines a constant.
de: Definiert eine Konstante.
es: Define una constante.
ko: 상수를 정의합니다.
pt_br: Define uma constante.
zh_cn: 定义一个常量。

source: Defines an enum.
de: Definiert eine Aufzählung.
es: Define una enum.
ko: 열거형을 정의합니다.
pt_br: Define um enumerador.
zh_cn: 定义一个枚举。

source: Defines a variable.
de: Definiert eine Variable.
es: Define una variable.
ko: 변수를 정의합니다.
pt_br: Define uma variável.
zh_cn: 定义一个变量。

source: Initializes a variable once the Node the script is attached to and its children are part of the scene tree.
de: Initialisiert eine Variable sobald das Node, an dem das Skript angehängt wurde, und ihre Unterobjekte Teil des Szenenbaums sind.
es: Inicializa una variable cuando el Node al que el script está vinculado y todos sus hijos son parte del árbol de escenas.
ko: 스크립트가 붙은 노드이고 노드의 자식이 씬 트리의 일부분인 경우, 변수를 초기화합니다.
pt_br: Inicializa uma variável quando o Nó ao qual o script está anexado e os seus filhos fizerem parte da árvore da cena.
zh_cn: 一旦脚本附加到的节点及其子级成为场景树的一部分，就初始化变量。

source: Saves a variable along with the resource it's attached to and makes it visible and modifiable in the editor.
de: Speichert eine Variable zusammen mit der Ressource, an der sie hängt, und macht sie im Editor sicht- und modifizierbar.
es: Guarda una variable junto con los recursos a los que está vinculada y los hace visibles y modificables en el editor.
ko: 변수를 리소스와 함께 저장하고 편집기에서 보고 수정할 수 있게 만듭니다.
pt_br: Salva a variável junto com o recurso que ela está ligada e a torna visível e modificável no editor.
zh_cn: 保存一个变量及其附加的资源，并使其在编辑器中可见和可修改。

source: Defines setter and getter functions for a variable.
de: Definiert setter und getter Funktionen für eine Variable.
es: Define funciones setter y getter para una variable.
ko: 변수에 대한 setter(세터)와 getter(게터) 함수를 정의합니다.
pt_br: Define funções setter e getter para uma variável.
zh_cn: 为变量定义setter和getter函数。

source: Editor helper for debugger breakpoints.
de: Helfer für den Editor für Haltepunkte des Debuggers.
es: Editor helper para puntos de interrupción del depurador.
ko: 디버거 중단점 용 편집기 도우미.
pt_br: Ajudante do Editor para debugar pontos de parada.
zh_cn: 调试器断点的编辑器助手。

source: Preloads a class or variable. See `Classes as resources`_.
de: Lädt eine Variable oder Klasse im Voraus, siehe `Classes as resources`_.
es: Precarga una clase o variable. Ver `Clases como recursos`_.
ko: 클래스나 변수를 미리 불러옵니다(Preload). `리소스로 취급되는 클래스`_\ 를 참고하세요.
pt_br: Pré-carrega uma classe ou uma variável. Consulte 'Classes como recursos' _.
zh_cn: 预加载一个类或变量。请参见 `类作为资源`_。

source: Coroutine support. See `Coroutines with yield`_.
de: Coprogramm Unterstützung, siehe `Coroutines with yield`_.
es: Soporte de corrutinas. Ver `Corrutinas con yield`_.
ko: Coroutine(코루틴)을 지원합니다. `yield를 갖는 Coroutine(코루틴)`_\ 을 참고하세요.
pt_br: Co-rotina de suporte. Consulte " co-rotinas com o rendimento`_.
zh_cn: 协程支持。参见 `协程使用yield`_。

source: Asserts a condition, logs error on failure. Ignored in non-debug builds. See `Assert keyword`_.
de: Aktiviert eine Bedingung und protokolliert Fehler . Wird bei Nicht-Debug-Builds ignoriert. Siehe `Assert keyword`_.
es: Afirma una condición, registra un error si falla. Ignorado en builds que no son de depuración. Ver `Palabra clave Assert`_.
ko: 조건을 가정(Assert)하고 실패 시 오류를 기록합니다. 디버그가 아닌 빌드에서는 무시됩니다. `Assert 키워드`_\ 를 참고하세요.
pt_br: Declara uma condição, erro de logs em caso de falha. Ignorado em compilações de não-depuração. Consulte 'Afirmar a palavra-chave' _.
zh_cn: 断言一个条件，如果失败则记录错误。在非调试版本中被忽略。参见 `Assert关键字`_。

source: Networking RPC annotation. See :ref:`high-level multiplayer docs <doc_high_level_multiplayer>`.
de: Anmerkungen zu RPC Netzwerke, siehe :ref:`High-Level Mehrspieler Dokumentation <doc_high_level_multiplayer>`.
es: Anotación de Networking RPC. Ver :ref:`high-level multiplayer docs <doc_high_level_multiplayer>`.
ko: 네트워킹 RPC(Remote Procedure Call, 원격 프로시저 호출) 주석. :ref:`하이 레벨 멀티플레이어 문서 <doc_high_level_multiplayer>`\ 를 참고하세요.
pt_br: Anotação de RPC de redes. Consulte: ref: 'documentos de multijogador de alto nível <doc_high_level_multiplayer>'.
zh_cn: 网络RPC注解。参见 :ref:`高级多玩家文档 <doc_high_level_multiplayer>`。

source: PI constant.
de: Die π-Konstante.
es: Constante PI.
ko: PI 상수.
pt_br: A constante PI.
zh_cn: 圆周率常量。

source: TAU constant.
de: TAU-Konstante.
es: Constante TAU.
ko: TAU 상수.
pt_br: A constante TAU.
zh_cn: TAU 常量。

source: Infinity constant. Used for comparisons.
de: Konstante "Unendlichkeit". Wird für Vergleiche genutzt.
es: Constante de infinito. Utilizado para comparaciones.
ko: 무한대 상수. 비교로 사용됩니다.
pt_br: Constante de infinito. Usada para comparações.
zh_cn: 无穷大常数。用于比较。

source: NAN (not a number) constant. Used for comparisons.
de: Konstante "NAN" (not a number - Keine Zahl). Wird für Vergleiche genutzt.
es: Constante NAN (no es un número). Usada para comparaciones.
ko: NAN (Not A Number, 숫자 아님) 상수. 비교로 사용됩니다.
pt_br: Constante de NAN (não um número). Usada para comparações.
zh_cn: NAN（不是一个数字）常数。用于比较。

source: Operators
de: Operatoren
es: Operadores
ko: 연산자(Operator)
pt_br: Operadores
zh_cn: 运算符

source: The following is the list of supported operators and their precedence.
de: Das folgende ist einer Liste der unterstützen Operatoren und ihrer Auswertungsreihenfolge.
es: La siguiente lista muestra los operadores soportados y su precedencia.
ko: 다음은 지원하는 연산자 목록과 우선 순위입니다.
pt_br: A seguir, está a lista de operadores suportados e sua precedência.
zh_cn: 下面是支持的运算符的列表及其优先级。

source: **Description**
de: **Beschreibung**
es: **Descripción**
ko: **설명**
pt_br: **Descrição**
zh_cn: **描述**

source: Subscription (highest priority)
de: Indexierung (höchste Priorität)
ko: 구독(Subscription) (가장 높은 우선 순위)
pt_br: Inscrição (prioridade máxima)
zh_cn: 数组索引（最高优先级）

source: Attribute reference
de: Referenzierung eines Attributs
ko: 속성 참조
pt_br: Referência de atributo
zh_cn: 属性引用

source: Function call
de: Funktionsaufruf
ko: 함수 호출
pt_br: Chamada de função
zh_cn: 函数调用

source: Instance type checker
de: Prüfung des Instanztyps
ko: 인스턴스 유형 검사기
pt_br: Checagem de tipo de instância
zh_cn: 实例类型检查操作符

source: Bitwise NOT
de: Bitweise Negation
es: Negación lógica a nivel de bits (NOT)
ko: 비트 단위 NOT
pt_br: NÃO Binário
zh_cn: 按位取反

source: Negative / Unary negation
de: Negative / Unäre Negation
ko: 음수 / 단항 부정
pt_br: Negativo / Negação unária
zh_cn: 负/一元否定

source: Multiplication / Division / Remainder
de: Multiplikation / Division / Modulus (Restbetrag)
es: Multiplicación / División / Resto
ko: 곱하기 / 나누기 / 나머지
pt_br: Multiplicação / Divisão / Resto
zh_cn: 乘法/除法/余数

source: These operators have the same behavior as C++. Integer division is truncated rather than returning a fractional number, and the % operator is only available for ints ("fmod" for floats)
de: Diese Operatoren verhalten sich wie in C++. Eine Ganzzahl-Division wird abgeschnitten anstelle eine gebrochener Zahl zu liefern und der % Operator ist nur verfügbar für Ganzzahlen ("fmod" für Fließkomma)
es: Estos operadores tienen el mismo comportamiento que C++. La división de enteros se trunca en lugar de devolver un número fraccional, y el operador % solo está disponible para ints ("fmod" para floats)
ko: 이 연산자는 C++의 연산자와 같습니다. 정수 나누기는 소수점 부분을 잘라냅니다. 그리고 % 연산자는 정수에만 사용됩니다 (실수 용 연산자는 "fmod"입니다)
pt_br: Esses operadores têm o mesmo comportamento que o C ++. A divisão inteira é truncada em vez de retornar um número fracionário, e o operador% está disponível apenas para ints ("fmod" para floats)
zh_cn: 这些操作符与C++中的具有相同的行为。整数除法被截断，而不是返回一个小数，%运算符只对整数可用（浮点数用 ``fmod``）

source: Addition / Concatenation of arrays
de: Addition / Verkettung von Arrays
ko: 배열의 추가 / 연결
pt_br: Adição / Concatenação de matrizes
zh_cn: 加法/数组的串联

source: Subtraction
de: Subtraktion
es: Resta
ko: 빼기
pt_br: Subtração
zh_cn: 减法

source: Bit shifting
de: Bit-Schieben
ko: 비트 자리 옮김
pt_br: Deslocamento de bits
zh_cn: 位移位

source: Bitwise AND
de: Bitweises UND
es: Conjunción lógica a nivel de bits (AND)
ko: 비트 단위 AND
pt_br: E Binário
zh_cn: 按位与

source: Bitwise XOR
de: Bitweises exklusiv-ODER (XOR)
es: Disyunción exclusiva a nivel de bits (XOR)
ko: 비트 단위 XOR
pt_br: OU EXCLUSIVO Binário
zh_cn: 按位异或

source: Bitwise OR
de: Bitweises (inklusiv-) ODER
es: Disyunción lógica a nivel de bits (OR)
ko: 비트 단위 OR
pt_br: OU Binário
zh_cn: 按位或

source: Comparisons
de: Vergleiche
es: Comparaciones
ko: 비교
pt_br: Comparações
zh_cn: 比较

source: Content test
de: Inhalt prüfen
ko: 내용 테스트
pt_br: Teste de conteúdo
zh_cn: 内容测试

source: Boolean NOT
de: Boolesches NICHT
es: Negación booleana
ko: 불리언 NOT
pt_br: NÃO Booleano
zh_cn: 布尔非

source: Boolean AND
de: Boolesches UND
es: Conjunción booleana
ko: 불리언 AND
pt_br: E Booleano
zh_cn: 布尔与

source: Boolean OR
de: Boolesches ODER
es: Disyunción booleana
ko: 불리언 OR
pt_br: OU Booleano
zh_cn: 布尔或

source: Ternary if/else
de: Bedingte (ternäre) if/else Anweisung
es: if / else en una linea
ko: 삼항 if/else
pt_br: if/else Ternário
zh_cn: 三元 if/else

source: Type casting
de: Typumwandlung

source: Assignment (lowest priority)
de: Zuweisung (niedrigste Priorität)
ko: 할당 (가장 낮은 우선 순위)
pt_br: Atribuição (menor prioridade)
zh_cn: 赋值（最低优先级）

source: Literals
de: Literale
es: Literales
ko: 리터럴(Literal)
pt_br: Literais
zh_cn: 字面量

source: **Type**
de: **Typ**
es: **Tipo**
ko: **유형**
pt_br: **Tipo**
zh_cn: **类型**

source: Base 10 integer
de: Dezimale Ganzzahl (Basis 10)
es: Entero base 10
ko: 기본 10진법 정수
pt_br: Inteiro Base 10
zh_cn: 基数为10的整数

source: Base 16 (hexadecimal) integer
de: Basis 16 (Hexadezimal) Ganzzahl
ko: 기본 16진법 정수
pt_br: Inteiro de base 16 (hexadecimal)
zh_cn: 基数16（十六进制）整数
