Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_basics.po
Languages: de, es, ko, pt_br, zh_cn

source: Assert keyword
de: Assert Schlüsselwort
es: Palabra clave Assert
ko: Assert 키워드
pt_br: Palavra-chave assert
zh_cn: Assert关键字

source: The ``assert`` keyword can be used to check conditions in debug builds. These assertions are ignored in non-debug builds. This means that the expression passed as argument won't be evaluated in a project exported in release mode. Due to this, assertions must **not** contain expressions that have side effects. Otherwise, the behavior of the script would vary depending on whether the project is run in a debug build.
de: Das ``behaupten`` Schlüsselwort kann verwendet werden, um Bedingungen im Debug-Builds zu überprüfen. Diese Behauptungen werden in Nicht-Debug-Builds ignoriert. Dies bedeutet, dass der als Argument übergebene Ausdruck in einem Release-Modus exportierten Projekt nicht ausgewertet wird. Aus diesem Grund dürfen Behauptungen **keine** Ausdrücke enthalten, die Nebenwirkungen haben. Andernfalls hängt das Verhalten des Skripts davon ab, ob das Projekt in einem Debug-Build ausgeführt wird.
ko: ``assert`` 키워드는 디버그 빌드에서 상태를 확인할 때 사용할 수 있습니다. 디버그 빌드가 아니면 assert 키워드는 무시됩니다. 즉, 인수로 보낸 명령문은 출시 모드로 내보낸 프로젝트에서 평가하지 않습니다. 이 때문에, assert는 반드시 역효과를 일으킬 소지가 있는 표현식을 가질 수 **없습니다**. 그렇지 않으면, 스크립트는 프로젝트가 디버그 빌드인지 여부에 따라 매우 다르게 동작할 것입니다.
pt_br: A palavra-chave ``assert`` pode ser usada para checar detalhes de depuração de builds. Essas asserções são ignoradas em compilações sem depuração. Isso significa que a expressão passada como argumento não vai ser compilada no projeto final. Por esse motivo, elas ** não ** devem conter expressões que sejam importantes para o código funcionar. Caso contrário, o comportamento do script variará dependendo se está compilando em modo depuração ou não.
zh_cn: ``assert`` 关键字可用于检查调试版本中的条件。在非调试版本中，这些断言将被忽略。这意味着在发布模式下导出的项目中不会评估作为参数传递的表达式。因此，断言必须 **不能** 包含具有副作用的表达式。否则，脚本的行为将取决于项目是否在调试版本中运行。

source: When running a project from the editor, the project will be paused if an assertion error occurs.
de: Wenn Sie ein Projekt über den Editor ausführen, wird das Projekt angehalten, wenn ein Behauptung Fehler auftritt.
ko: 편집기에서 프로젝트를 실행할 때, assert 오류가 발생하면 프로젝트는 일시정지합니다.
pt_br: Se ocorrer um erro de asserção enquanto estiver no modo de edição, o projeto sera pausado.
zh_cn: 从编辑器运行项目时，如果发生断言错误，该项目将被暂停。

source: In the early days, the engine used the `Lua <https://www.lua.org>`__ scripting language. Lua is fast, but creating bindings to an object oriented system (by using fallbacks) was complex and slow and took an enormous amount of code. After some experiments with `Python <https://www.python.org>`__, it also proved difficult to embed.
ko: 처음에는 `Lua <https://www.lua.org>`__ 스크립팅 언어를 사용했습니다. Lua는 빠르지만, (Fallback을 사용해서) 객체 지향 시스템에 묶는 일은 복잡하고 느리면서도 엄청난 양의 코드가 필요했습니다. `Python <https://www.python.org>`__\ 을 몇 번 사용해봤지만, 포함하기는 어려웠습니다.

source: The last third party scripting language that was used for shipped games was `Squirrel <http://squirrel-lang.org>`__, but it was dropped as well. At that point, it became evident that a custom scripting language could more optimally make use of Godot's particular architecture:
es: El último lenguaje de scripting de terceros que fue utilizado para juegos lanzados fue `Squirrel <http://squirrel-lang.org>`__, pero fue descartado también. Hasta ese punto, se volvió evidente que un lenguaje de scripting personalizado haría un uso más optimo de la arquitectura particular de Godot:
ko: 게임을 배포하는데 사용한 마지막 외부 스크립팅 언어는 `Squirrel <http://squirrel-lang.org>`__\ 이었습니다, 하지만 역시 탈락했습니다. 이 시기에서, Godot의 특수한 구조에 최적화된 언어는 맞춤 스크립팅 언어라는 것을 확신했습니다:

source: Godot embeds scripts in nodes. Most languages are not designed with this in mind.
es: Godot embebe scripts en nodos. La mayoría de los lenguajes no está diseñado con eso en mente.
ko: Godot는 노드에 스크립트를 삽입합니다. 대부분의 언어는 이런 생각으로 설계되진 않죠.

source: Godot uses several built-in data types for 2D and 3D math. Script languages do not provide this, and binding them is inefficient.
es: Godot usa varios tipos de datos incorporados para matemática 2D y 3D. Los lenguajes de scripting no proveen esto y vincularlos es ineficiente.
ko: Godot는 2D와 3D 수학 용 내장 데이터 유형을 여러 개 사용합니다. 스크립트 언어는 이런 데이터 유형을 제공하지 않고, 바인딩하는 것은 비효율적입니다.

source: Godot uses threads heavily for lifting and initializing data from the net or disk. Script interpreters for common languages are not friendly to this.
es: Godot hace uso fuerte de hilos para obtener e inicializar datos desde la red o el disco. Intérpretes para lenguajes de scripting comunes no son amigables con ello.
ko: Godot는 넷 또는 디스크에서 데이터를 리프트하고 초기화하기 위해 스레드를 많이 사용합니다. 일반적인 언어 용 스크립트 인터프리터는 스레드 사용에 친절하지 않습니다.

source: Godot already has a memory management model for resources, most script languages provide their own, which results in duplicate effort and bugs.
es: Godot ya posee un modelo de manejo de memoria para recursos, la mayoría de los lenguajes de scripting tienen el suyo, lo que resulta en un esfuerzo duplicado y errores.
ko: Godot는 이미 리소스 용 메모리 관리 모델을 갖고 있지만, 대부분의 스크립트 언어는 자체적인 모델을 갖고 있어서, 노력이 배로 들면서 버그를 초래합니다.

source: Binding code is always messy and results in several failure points, unexpected bugs and generally low maintainability.
es: Vincular código siempre es desordenado y resulta en varios puntos de falla, errores inesperados y generalmente baja capacidad para mantenerlo.
ko: 코드를 바인딩 하는 것은 항상 엉망이면서 동시에 여러 실패 지점, 예기치 못한 버그, 그리고 일반적으로 낮은 유지 능력을 초래합니다.

source: The result of these considerations is *GDScript*. The language and interpreter for GDScript ended up being smaller than the binding code itself for Lua and Squirrel, while having equal functionality. With time, having a built-in language has proven to be a huge advantage.
es: El resultado de esas consideraciones es *GDScript*. El lenguaje e interprete para GDScript terminó siendo más pequeño que los vínculos de código mismos para Lua y Squirrel, manteniendo la funcionalidad. Con el tiempo, tener un lenguaje incorporado ha probado ser de gran ventaja.
ko: 이 고려 사항의 결과물이 *GDScript*\ 입니다. GDScript의 언어와 인터프리터는 Lua와 Squirrel의 바인딩 코드보다 작아졌으면서도 같은 기능을 갖습니다. 시간이 흐르면서 내장 언어를 갖는 것이 큰 장점이 된다는 것이 증명됐습니다.

source: Defines a class.
es: Define una clase.
ko: 클래스를 정의합니다.
zh_cn: 定义一个类。

source: **Operator**
es: **Operador**
ko: **연산자**
pt_br: **Operador**
zh_cn: **运算符**

source: **Literal**
ko: **리터럴**
zh_cn: **字面量**

source: A sequence of characters in `Unicode format <https://en.wikipedia.org/wiki/Unicode>`_. Strings can contain `standard C escape sequences <https://en.wikipedia.org/wiki/Escape_sequences_in_C>`_. GDScript also supports :ref:`doc_gdscript_printf`.
ko: `Unicode 형식 <https://ko.wikipedia.org/wiki/Unicode>`_\ 에 있는 일련의 문자. 문자열은 `표준 C 이스케이프 시퀀스 <https://en.wikipedia.org/wiki/Escape_sequences_in_C>`_\ 를 가질 수 있습니다. GDScript는 :ref:`doc_gdscript_printf`\ 도 지원합니다.

source: Lua-style table syntax is also supported. Lua-style uses ``=`` instead of ``:`` and doesn't use quotes to mark string keys (making for slightly less to write). Note however that like any GDScript identifier, keys written in this form cannot start with a digit.
es: El estilo de sintaxis de tabla en Lua también está soportado. Lua usa ``=`` en lugar de ``:`` y no usa comillas para marcar las claves de texto (haciendo que haya que escribir algo menos). Tenga en cuenta, no obstante, que como cualquier identificador en Gdscript, las claves escritas de esta forma no pueden empezar con un número.
ko: Lua 스타일의 테이블 문법 역시 지원합니다. Lua 스타일은 ``:`` 대신 ``=``\ 을 사용하고 (문자의 양을 줄이기 위해) 문자열 키를 표시하기 위한 따옴표를 사용하지 않습니다. 하지만 모든 GDScript 식별자와 마찬가지로, 이 양식에 맞더라도 키를 숫자로 시작할 수 없습니다.

source: Constants are similar to variables, but must be constants or constant expressions and must be assigned on initialization.
es: Las constantes son similares a las variables, pero deben de mantener su valor o expresión de forma constante y deben de ser asignadas en su inicialización.
ko: 상수는 변수와 비슷하지만, 상수 또는 상수 식이어야만 하며 초기화 시 값이 지정되어야 합니다.
zh_cn: 常量类似于变量，但必须是常量或常量表达式，并且必须在初始化时分配。

source: To iterate through a range, such as an array or table, a *for* loop is used. When iterating over an array, the current array element is stored in the loop variable. When iterating over a dictionary, the *index* is stored in the loop variable.
es: Para iterar a través de un rango, como un array o una tabla, se usa el bucle *for*. Cuando estás iterando sobre un array, el elemento actual se guarda en la variable especificada en el bucle. Cuando se itera sobre un diccionario, la *clave* es guardada en dicha variable.
ko: 배열이나 테이블과 같은 범위에서 반복을 시행하려면 *for* 루프를 사용합니다. 한 배열을 반복할 때, 현재 배열 요소는 루프 변수에 저장됩니다. 딕셔너리를 반복할 때, *인덱스*\ 는 루프 변수에 저장됩니다.

source: The patterns are matched from top to bottom. If a pattern matches, the corresponding block will be executed. After that, the execution continues below the ``match`` statement. If you want to have a fallthrough, you can use ``continue`` to stop execution in the current block and check the ones below it.
es: Los patrones se comparan desde arriba hacia abajo. Si el patrón coincide, el bloque correspondiente se ejecuta. Después de eso, la ejecución continua por debajo de la declaración ``match``. Si quieres seguir recorriendo hacia abajo la expresión, puedes usar ``continue`` para detener la ejecución del bloque actual y comprobar el siguiente.
ko: 패턴은 위에서 아래로 맞춰봅니다. 패턴이 맞으면, 해당 블록이 실행됩니다. 그런 다음 실행은 ``match`` 명령문에서 계속됩니다. fallthrough 키워드를 쓰고 싶다면, 대신 ``continue``\ 로 현재 블록의 실행을 멈추고 다음 블록을 확인하게 할 수 있습니다.

source: Class Constructor
es: Constructor de clase
ko: 클래스 생성자(Class Constructor)
pt_br: Construtor de Classe
zh_cn: 类构造器

source: If ``Idle.gd``'s ``_init`` constructor takes 0 arguments, it still needs to pass some value to the ``State.gd`` parent class, even if it does nothing. This brings us to the fact that you can pass literals in the base constructor as well, not just variables. eg.::
ko: ``Idle.gd``\ 의 ``_init`` 생성자가 0 개의 인수를 갖더라도, 어떤 값을 ``State.gd`` 부모 클래스로 전달해야 합니다. 그것이 쓸모가 없더라도 말이죠. 이것으로 알게된 것은 기본 생성자에서 변수 뿐만 아니라 리터럴도 전달할 수 있다는 것입니다. 예::
pt_br: Se o construtor ``_init`` de ``Idle.gd`` não precisa de argumentos, ele ainda precisa passar algum valor para a classe base ``State.gd``, mesmo que ele não faça nada. Isso nos leva ao fato que você pode passar valores literais ao construtor também, não só variáveis. ex::
zh_cn: 如果 ``Idle.gd`` 的 ``_init`` 构造函数接受0个参数，即使它什么也不做，它仍需要将一些值传递给 ``State.gd`` 父类。这带给我们一个事实，即您也可以在基本构造函数中传递文字，而不仅仅是变量。 例如：

source: If a class inherits from :ref:`class_Reference`, then instances will be freed when no longer in use. No garbage collector exists, just reference counting. By default, all classes that don't define inheritance extend **Reference**. If this is not desired, then a class must inherit :ref:`class_Object` manually and must call instance.free(). To avoid reference cycles that can't be freed, a ``weakref`` function is provided for creating weak references.
es: Si una clase hereda de :ref:`class_Reference`, entonces las instancias serán liberadas cuando ya no estén en uso. No existe ningún recolector de basura, sólo un conteo de referencia. Por defecto, todas las clases que no definan herencias se extienden **Reference**. Si esto no es lo deseado, entonces una clase debe heredar :ref:`class_Object` manualmente y debe llamar a instance.free(). Para evitar ciclos de referencia que no puedan ser liberados, se proporciona una función ``weakref`` para crear referencias débiles.
ko: 클래스가 :ref:`class_Reference` 에서 상속할 때, 더 이상 사용하지 않게 되면 인스턴스는 해제됩니다. 가비지 콜렉터 없이, 참조만 계산됩니다. 기본적으로, 상속을 정의하지 않는 모든 클래스는 **참조** 를 확장합니다. 바람직하지 않다면, 클래스는 :ref:`class_Object` 를 수동으로 상속해야만 하고 instance.free()를 호출해야만 합니다. 해제할 수 없는 참조 사이클을 피하기 위해, 약한 참조를 생성하는 ``weakref`` 함수가 제공됩니다.
zh_cn: 如果一个类继承自 :ref:`class_Reference` , 则实例将在不再使用时被释放。没有垃圾收集器，只有引用计数。默认情况下，所有未定义继承的类都会扩展 **Reference** 。如果不希望这样，那么一个类必须手动继承 :ref:`class_Object` 并且必须调用 ``instance.free()``。为了避免无法释放的引用循环，提供一个 ``weakref`` 函数用来来创建弱引用。

source: Onready keyword
es: Palabra clave Onready
ko: Onready 키워드
pt_br: Palavra-chave Onready
zh_cn: ``Onready`` 关键字

source: yield
pt_br: conceder

source: puppet
pt_br: fantoche

source: ``@"Node/Label"``
pt_br: ``@"Nodo/Rotulo"``

source: *GDScript* is a high level, dynamically typed programming language used to create content. It uses a syntax similar to `Python <https://en.wikipedia.org/wiki/Python_%28programming_language%29>`_ (blocks are indent-based and many keywords are similar). Its goal is to be optimized for and tightly integrated with Godot Engine, allowing great flexibility for content creation and integration.
es: *GDScript* es un lenguaje de programación de alto nivel y dinámicamente tipado, utilizado para crear contenido. Utiliza una sintaxis similar a `Python <https://es.wikipedia.org/wiki/Python>`_ (los bloques de código son basados en indentación y muchas palabras clave son similares). Su objetivo es ser optimizado y fuertemente integrado a Godot Engine, permitiendo gran flexibilidad para creación e integración de contenido .

source: In the early days, the engine used the `Lua <http://www.lua.org>`__ scripting language. Lua is fast, but creating bindings to an object oriented system (by using fallbacks) was complex and slow and took an enormous amount of code. After some experiments with `Python <https://www.python.org>`__, it also proved difficult to embed.
es: En los primeros tiempos, el motor utilizaba el lenguaje de scripting `Lua <http://www.lua.org>`__. Lua es rápido, pero la creación de enlaces a un sistema orientado a objetos (usando fallbacks) era compleja y lenta y requería una enorme cantidad de código. Después de algunos experimentos con `Python <https://www.python.org>`__, también resultó difícil de incrustar.

source: Subscription, Highest Priority
es: Suscripción, máxima prioridad

source: ``x.attribute``
es: ``x.atribute``

source: Attribute Reference
es: Referencia a un Atributo

source: Instance Type Checker
es: Verificador de tipo de instancia

source: Negative / Unary Negation
es: Negación Negativa / Unaria

source: Addition / Concatenation of Arrays
es: Suma / Concatenación de arreglos

source: Bit Shifting
es: Desplazamiento de bits

source: Content Test
es: Prueba de contenido

source: Assignment, Lowest Priority
es: Asignación, Menor Prioridad

source: Base 16 (hex) integer
es: Entero base 16 (hexadecimal)

source: Floating point number (real)
es: Número de coma flotante (real)

source: NodePath or StringName
es: Ruta del nodo o nombre

source: Multi-line comments can be created using """ (three quotes in a row) at the beginning and end of a block of text. Note that this creates a string, therefore, it will not be stripped away when the script is compiled.
es: Comentarios multilínea pueden ser creados usando """ (tres comillas seguidas) al principio y fin del bloque de texto. Tener en cuenta que esto crea una cadena (String), por lo tanto no será removido del script cuando es compilado.

source: Built-in types are stack-allocated. They are passed as values. This means a copy is created on each assignment or when passing them as arguments to functions. The only exceptions are ``Array``\ s and ``Dictionaries``, which are passed by reference so they are shared. (Not ``PoolArray``\ s like ``PoolByteArray`` though, those are passed as values too, so consider this when deciding which to use!)
es: Los tipos integrados se distribuyen en pilas. Se pasan como valores. Esto significa que se crea una copia en cada asignación o cuando se pasan como argumentos a las funciones. Las únicas excepciones son ``Array``\ s y ``Dictionaries``, que se pasan por referencia para que sean compartidos. (No los ``PoolArray`` como ``PoolByteArray`` aunque, estos también son pasados como valores, ¡así que considera esto cuando decidas cual usar!)

source: The Boolean data type can only contain ``true`` or ``false``.
es: El tipo de dato booleano solo puede contener ``true`` o ``false``.

source: The integer data type can only contain integer numbers, (both negative and positive).
es: El tipo de dato entero solo puede contener números enteros, tanto negativos como positivos.

source: Used to contain a floating point value (real numbers).
es: Se usa para los valores de coma flotante (números reales).

source: A sequence of characters in `Unicode format <https://en.wikipedia.org/wiki/Unicode>`_. Strings can contain the `standard C escape sequences <https://en.wikipedia.org/wiki/Escape_sequences_in_C>`_. GDScript supports :ref:`format strings aka printf functionality <doc_gdscript_printf>`.
es: Una secuencia de caracteres en `formato Unicode <https://es.wikipedia.org/wiki/Unicode>`_. Los Strings pueden contener `secuencias de escape estándar en C <https://en.wikipedia.org/wiki/Escape_sequences_in_C>`_. GDScript soporta :ref:`cadenas de formato, alias funcionalidad printf<doc_gdscript_printf>`.

source: 2D vector type containing ``x`` and ``y`` fields. Can also be accessed as array.
es: Tipo de vector 2D que contiene los campos ``x`` y ``y``. También puede ser accedido como un arreglo.

source: 2D Rectangle type containing two vectors fields: ``position`` and ``size``. Alternatively contains an ``end`` field which is ``position+size``.
es: Tipo de rectángulo 2D que contiene dos campos de vectores. ``position`` y ``size``. Alternativamente contiene un campo ``end`` el cual es `position+size``.

source: 3x2 matrix used for 2D transforms.
es: Matriz de 3x2 usada para transformaciones 2D.

source: Axis-aligned bounding box (or 3D box) contains 2 vectors fields: ``position`` and ``size``. Alternatively contains an ``end`` field which is ``position+size``.
es: El cuadro delimitador "Axis-aligned" (o 3D box) contiene 2 campos vectoriales: ``position`` y ``size``. Opcionalmente contiene un campo ```end`` que es ``position+size``.

source: Generic sequence of arbitrary object types, including other arrays or dictionaries (see below). The array can resize dynamically. Arrays are indexed starting from index ``0``. Starting with Godot 2.1, indices may be negative like in Python, to count from the end.
es: Secuencia genérica de tipos arbitrarios de objetos, incluyendo otros arrays o diccionarios (veáse más abajo). El Array puede cambiar de tamaño de manera dinámica. Los Arrays están indexados desde el ``0``. A partir de Godot 2.1, los índices pueden ser negativos como en Python, para contar desde el final.

source: GDScript arrays are allocated linearly in memory for speed. Large arrays (more than tens of thousands of elements) may however cause memory fragmentation. If this is a concern, special types of arrays are available. These only accept a single data type. They avoid memory fragmentation and also use less memory but are atomic and tend to run slower than generic arrays. They are therefore only recommended to use for large data sets:
es: Los arreglos(arrays) de GDScript son asignados linealmente en la memoria para aumentar la velocidad de acceso. Sin embargo, los arreglos grandes (más de decenas de miles de elementos) pueden causar fragmentación de la memoria. Si esto es un problema, existen tipos especiales de arreglo. Éstos sólo aceptan un único tipo de datos, evitan la fragmentación de la memoria y también utilizan menos memoria, pero son atómicos y tienden a funcionar más lentamente que los arreglos genéricos. Por lo tanto, sólo se recomienda su uso para grandes cantidades de datos:

source: :ref:`Dictionary <class_Dictionary>`
es: :ref:`Diccionario <class_Dictionary>`

source: Built-in types (Array, Vector2, int, String, etc.)
es: Tipos integrados (Array, Vector2, int, String, etc.)

source: Engine classes (Node, Resource, Reference, etc.)
es: Clases de motor (Node, Resource, Reference, etc.)

source: Other classes in the same script, respecting scope (``InnerClass.NestedClass`` if you declared ``class NestedClass`` inside the ``class InnerClass`` in the same scope)
es: Otras clases en el mismo script, respetando el alcance (``InnerClass.NestedClass`` si declaraste `class NestedClass`` dentro de ``class InnerClass`` en el mismo alcance)

source: Casting is also useful to have better type-safe variables when interacting with tree::
es: La conversión también es útil para tener mejores variables de tipo seguro al interactuar con el árbol:

source: Referencing Functions
es: Referencias a funciones

source: Contrary to Python, functions are *not* first class objects in GDScript. This means they cannot be stored in variables, passed as an argument to another function or be returned from other functions. This is for performance reasons.
es: Al contrario que en Python, las funciones *no* son objetos de primera clase en GDScript. Esto quiere decir que no pueden ser guardados en variables, pasados como argumentos a otras funciones o ser asignados como valor de retorno de las mismas. Esto es así por razones de rendimiento.

source: To reference a function by name at runtime, (e.g. to store it in a variable, or pass it to another function as an argument) one must use the ``call`` or ``funcref`` helpers::
es: Para hacer referencia a una función por su nombre en tiempo de ejecución, (por ejemplo para guardarla en una variable o pasarla a otra función como argumento) se deben de usar las palabras clave ``call`` o ``funcref``::

source: Remember that default functions, like ``_init``, and most notifications, such as ``_enter_tree``, ``_exit_tree``, ``_process``, ``_physics_process``, etc. are called in all base classes automatically. So there is only a need to call the function explicitly when overloading them in some way.
es: Recuerda que las funciones por defecto como ``_init``, y muchas de las notificaciones como ``_enter_tree``, ``_exit_tree``, ``_process``, ``_physics_process``, etc. son ejecutadas en todas las clases base de forma automática. Por lo tanto solo hay necesidad de hacer llamadas explicitas a estas funciones cuando se quieran sobrecargar de alguna manera.

source: A function can be declared static. When a function is static, it has no access to the instance member variables or ``self``. This is mainly useful to make libraries of helper functions:
es: Una función puede ser declarada como estática. Cuando una función es estática no tiene acceso a las variables de miembro de la instancia o a ``self``. Esto es útil principalmente para hacer bibliotecas de funciones de utilidad:

source: Sometimes you might want to assign a different initial value based on a boolean expression. In this case, ternary-if expressions come in handy::
es: Algunas veces podrías querer asignar un valor inicial diferente basándote en una expresión booleana. En este caso, te será práctica la expresión if-ternaria::

source: Basic syntax:
es: Sintaxis básica:

source: Replace ``switch`` with ``match``
es: Reemplaza ``switch`` por ``match``

source: Remove ``case``
es: Elimina ``case``

source: constant pattern
es: patrón constante

source: constant primitives, like numbers and strings ::
es: constantes primitivas, como números y cadenas de texto ::

source: variable pattern
es: patrón de variables

source: matches the contents of a variable/enum ::
es: busca la coincidencia del contenido de una variable/enumeración ::

source: wildcard pattern
es: patrón comodín

source: It can be used as the equivalent of the ``default`` in a ``switch`` statement in other languages. ::
es: Se puede usar como el equivalente a ``default`` en una expresión ``switch`` en otros lenguajes. ::

source: binding pattern
es: patrón de unión

source: A binding pattern introduces a new variable. Like the wildcard pattern, it matches everything - and also gives that value a name. It's especially useful in array and dictionary patterns. ::
es: Un patrón de unión introduce una nueva variable. Como el patrón comodín, intenta hacer coincidir cualquier cosa, pero también da un nombre al valor coincidente. Es especialmente útil en patrones de arrays y diccionarios. ::

source: array pattern
es: patrón de array
