Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_basics.po
Languages: de, es, ko, pt_br, zh_cn

source: Lua-style table syntax is also supported. Lua-style uses ``=`` instead of ``:`` and doesn't use quotes to mark string keys (making for slightly less to write). However, keys written in this form can't start with a digit (like any GDScript identifier).
de: Eine Tabellensyntax im Lua-Stil wird ebenfalls unterstützt. Der Lua-Stil verwendet ``=`` anstelle von ``:`` und benutzt keine Anführungszeichen, um Zeichenketten-Schlüssel zu markieren (was etwas weniger Schreibarbeit macht). Schlüssel, die in dieser Form geschrieben werden, können jedoch nicht mit einer Ziffer beginnen (wie jeder GDScript-Bezeichner).
pt_br: Sintaxe de tabela no estilo Lua também é suportada. O estilo Lua usa ``=`` ao invés de ``:`` e não usa aspas para marcar chaves que são strings (diminuindo a quantidade de escrita). Note, no entanto, que como qualquer identificador GDScript, chaves escritas desta forma não podem começar com dígitos.

source: To add a key to an existing dictionary, access it like an existing key and assign to it::
de: Um einen Schlüssel zu einem bestehenden Wörterbuch hinzuzufügen, greifen Sie wie ein vorhandener Schlüssel darauf zu und weisen Sie ihm einen zu:
es: Para añadir una clave a un diccionario ya existente, accede a ella como a cualquier clave ya existente y asígnala::
ko: 존재하는 딕셔너리에 키를 추가하려면, 기존 키와 같은 방식으로 접근한 뒤 할당해야 합니다::
pt_br: Para adicionar uma chave a um dicionário existente, acesse isso como uma chave existente e atribua a isso::
zh_cn: 若要向现有字典添加键，请像访问现有键一样访问它，并给它赋值：

source: The bracket syntax can be used to access properties of any :ref:`class_Object`, not just Dictionaries. Keep in mind it will cause a script error when attempting to index a non-existing property. To avoid this, use the :ref:`Object.get() <class_Object_method_get>` and :ref:`Object.set() <class_Object_method_set>` methods instead.
de: Die Klammer-Syntax kann verwendet werden, um auf die Eigenschaften von jedem :ref:`class_Object` zuzugreifen, nicht nur aus Wörterbüchern. Beachten Sie, dass beim Indizieren einer nicht vorhandenen Eigenschaft ein Skriptfehler auftritt. Um dies zu vermeiden, verwenden Sie stattdessen die Methoden :ref:`Object.get() <class_Object_method_get>` und :ref:`Object.set() <class_Object_method_set>`.
zh_cn: 方括号语法不仅可以用在Dictionary上，而且还可以用来存取任何 :ref:`class_Object` 的属性。记住，当尝试读取一个不存在的属性时，会引发脚本错误。为了避免这一点，用 :ref:`Object.get() <class_Object_method_get>` 和 :ref:`Object.set() <class_Object_method_set>` 方法作为替代。

source: Data
de: Daten
es: Datos
ko: 데이터(Data)
pt_br: Dados
zh_cn: 数据

source: Variables
de: Variablen
ko: 변수(Variable)
pt_br: Variáveis
zh_cn: 变量

source: Variables can exist as class members or local to functions. They are created with the ``var`` keyword and may, optionally, be assigned a value upon initialization.
de: Variablen können als Klassen-Member oder lokal in Funktionen existieren. Sie werden mit dem Schlüsselwort ``var`` erzeugt und können optional mit einem Wert initialisiert werden.
es: Las variables puede existir como miembros de una clase o de forma local en una función. Se crean con la palabra clave ``var`` y pueden, opcionalmente, ser asignadas a un valor en su inicialización.
ko: 변수는 클래스 멤버, 혹은 함수에 지역으로 존재할 수 잇습니다. 변수는 ``var`` 키워드 만들 수 있으며, 초기화에 값을 지정할 수 있습니다.
pt_br: Variáveis podem existir como membros de classe ou locais em funções. Elas são criadas com a palavra-chave ``var`` e podem, opcionalmente, ser atribuídas com um valor durante a inicialização.
zh_cn: 变量可以作为类成员存在，也可以作为函数的局部变量存在。它们是用 ``var`` 关键字创建的，并且可以在初始化时指定一个值。

source: Variables can optionally have a type specification. When a type is specified, the variable will be forced to have always that same type, and trying to assign an incompatible value will raise an error.
de: Variablen können optional eine Typspezifikation haben. Wenn ein Typ angegeben wird, muss die Variable immer denselben Typ haben, und der Versuch, einen inkompatiblen Wert zuzuweisen, führt zu einem Fehler.
es: Las variables pueden tener opcionalmente una especificación de tipo. Cuando se especifica un tipo, la variable se verá obligada a tener siempre el mismo tipo, y al intentar asignar un valor incompatible se generará un error.
ko: 변수는 선택적으로 유형을 지정할 수 있습니다. 유형을 지정하면, 그 변수는 항상 같은 유형으로 제한되며, 유형에 맞지 않는 값을 할당하려 하면 오류가 발생합니다.
pt_br: As variáveis podem, opcionalmente, ter uma especificação de tipo. Quando um tipo é especificado, a variável será forçada a ter sempre esse mesmo tipo, e tentar atribuir um valor incompatível gerará um erro.
zh_cn: 变量可以选择具有类型声明。指定类型时，变量将强制始终具有相同的类型，并且试图分配不兼容的值将引发错误。

source: Types are specified in the variable declaration using a ``:`` (colon) symbol after the variable name, followed by the type.
de: Typen werden in der Variablendeklaration mit einem ``:`` (Doppelpunkt) nach dem Variablennamen gefolgt vom Typ angegeben.
es: Los tipos se especifican en la declaración de la variable usando un símbolo ``:`` (dos puntos) después del nombre de la variable, seguido del tipo.
ko: 유형은 변수 선언에서 변수 이름 뒤에 ``:`` (쌍점) 기호를 붙인 다음, 유형 이름을 지정합니다.
pt_br: Os tipos são especificados na declaração da variável usando um símbolo ``: `` (dois-pontos) após o nome da variável, seguido pelo tipo.
zh_cn: 类型在变量声明中使用 ``:`` （冒号）符号在变量名后面指定，后面是类型。

source: If the variable is initialized within the declaration, the type can be inferred, so it's possible to omit the type name::
de: Wenn die Variable innerhalb der Deklaration initialisiert wird, kann der Typ abgeleitet werden, sodass der Typname weggelassen werden kann:
es: Si la variable se inicializa dentro de la declaración, se puede inferir el tipo, por lo que es posible omitir el nombre del tipo:
ko: 변수가 선언 내에서 초기화된다면, 유형은 유추할 수 있게 됩니다. 따라서 유형 이름을 생략하는 것이 가능합니다::
pt_br: Se a variável for inicializada dentro da declaração, o tipo pode ser inferido, então é possível omitir o nome do tipo::
zh_cn: 如果在声明中初始化变量，则可以推断类型，因此可以省略类型名称：

source: Type inference is only possible if the assigned value has a defined type, otherwise it will raise an error.
de: Ein Rückschluss auf den Typ ist nur möglich, wenn der zugewiesene Wert einen definierten Typ hat, andernfalls wird ein Fehler ausgelöst.
es: La inferencia del tipo solo es posible si el valor asignado tiene un tipo definido, de lo contrario generará un error.
ko: 유형 추론은 할당된 값이 정의된 유형이 있는 경우에만 가능합니다. 그렇지 않으면 오류가 발생합니다.
pt_br: A inferência de tipos só é possível se o valor atribuído tiver um tipo definido, caso contrário, irá gerar um erro.
zh_cn: 类型推断只有在指定的值具有定义的类型时才可能，否则将引发错误。

source: Valid types are:
de: gültige Typen sind:
es: Los tipos válidos son:
ko: 올바른 타입은 다음과 같습니다:
pt_br: Tipos válidos são:
zh_cn: 有效的类型有：

source: Built-in types (Array, Vector2, int, String, etc.).
de: eingebaute Typen (Array, Vector2, int, String, etc.).
ko: 내장 유형 (Array, Vector2, int, String 등).
pt_br: Tipos embutidos (Array, Vector2, int, String, etc.).
zh_cn: 内置类型（Array、Vector2、int、String、等）。

source: Engine classes (Node, Resource, Reference, etc.).
de: Engine-Klassen (Node, Ressource, Referenz, usw.).
ko: 엔진 클래스 (Node, Resource, Reference 등).
pt_br: Classes da engine (Node, Resource, Reference, etc.).
zh_cn: 引擎类（Node、Resource、Reference、等）。

source: Constant names if they contain a script resource (``MyScript`` if you declared ``const MyScript = preload("res://my_script.gd")``).
de: Konstante Namen, wenn sie eine Skript-Ressource enthalten (``MyScript``, wenn man ``const MyScript = preload("res://my_script.gd")`` deklariert hat).
es: Nombres constantes si contienen un recurso de script (``MyScript`` si declaró ``const MyScript = preload("res://my_script.gd")``).
ko: 스크립트 리소스가 포함된 상수 이름 (``const MyScript = preload("res://my_script.gd")``\ 를 선언했다면 ``MyScript``\ 가 이에 속합니다).
pt_br: Nomes constantes se eles contiverem um recurso de script (`` MyScript`` se você declarar `` const MyScript = preload ("res: //my_script.gd") ``).
zh_cn: 常量名，如果它们包含脚本资源（``MyScript`` 如果声明 ``const MyScript = preload("res://my_script.gd")``）。

source: Other classes in the same script, respecting scope (``InnerClass.NestedClass`` if you declared ``class NestedClass`` inside the ``class InnerClass`` in the same scope).
de: Andere Klassen im gleichen Skript, unter Berücksichtigung des Geltungsbereichs (``InnerClass.NestedClass``, wenn man ``class NestedClass`` innerhalb der ``class InnerClass`` im gleichen Geltungsbereich deklariert hat).
ko: 같은 스크립트에서 유효 범위를 준수하는 다른 클래스 (같은 유효 범위에서 ``class InnerClass`` 안에 ``class NestedClass``\ 를 선언했다면 ``InnerClass.NestedClass``\ 가 이에 속합니다).
pt_br: Outras classes no mesmo script, respeitando o escopo (``InnerClass.NestedClass`` se você declarou ``classNestedClass`` dentro da ``classInnerClass`` no mesmo escopo).
zh_cn: 在同一个脚本中的其他类，尊重作用域（如果在相同作用域内，在 ``class InnerClass`` 中声明 ``class NestedClass`` 得到 ``InnerClass.NestedClass`` ）。

source: Script classes declared with the ``class_name`` keyword.
de: Skriptklassen, die mit dem Schlüsselwort ``class_name`` deklariert wurden.
es: Clases de script declaradas con la palabra clave ``class_name``.
ko: ``class_name`` 키워드로 선언된 스크립트 클래스.
pt_br: Classes de script declaradas com a palavra-chave `` class_name``.
zh_cn: 脚本类使用 ``class_name`` 关键字声明。

source: Casting
de: Casting (Typumwandlung)
ko: 캐스팅(Casting)
pt_br: Conversão
zh_cn: 转换

source: Values assigned to typed variables must have a compatible type. If it's needed to coerce a value to be of a certain type, in particular for object types, you can use the casting operator ``as``.
de: Werte, die typisierten Variablen zugewiesen werden, müssen einen kompatiblen Typ haben. Wenn es erforderlich ist, einen Wert von einem bestimmten Typ zu erzwingen, insbesondere für Objekttypen, können Sie den Casting-Operator ``as`` verwenden.
es: Los valores asignados a las variables escritas deben tener un tipo compatible. Si es necesario forzar un valor para que sea de un determinado tipo, en particular para los tipos de objetos, puede usar el operador de conversión ``as``.
ko: 유형이 있는 변수에는 그에 맞는 유형을 지닌 값을 지정해야 합니다. 만약 값을 특정 유형으로, 특히 객체 유형으로 강제 변환해야 한다면, 캐스팅 연산자 ``as``\ 를 사용해야 합니다.
pt_br: Valores atribuídos a variáveis digitadas devem ter um tipo compatível. Se for necessário forçar um valor a ser de um determinado tipo, em particular para tipos de objetos, você pode usar o operador de conversão ``as``.
zh_cn: 分配给类型变量的值必须具有兼容的类型。如果需要将值强制转换为特定类型，特别是对于对象类型，则可以使用强制转换运算符 ``as``。

source: Casting between object types results in the same object if the value is of the same type or a subtype of the cast type.
de: Das Umwandeln zwischen Objekttypen führt zu demselben Objekt, wenn der Wert vom selben Typ oder einem Untertyp des Umwandlungstyps ist.
es: La conversión entre tipos de objetos da como resultado el mismo objeto si el valor es del mismo tipo o subtipo del tipo de conversión.
ko: 객체 유형 간 캐스팅에서 값이 캐스트 유형과 같은 유형이거나 하위 유형이라면 같은 객체를 만듭니다.
pt_br: A conversão entre tipos de objetos resulta no mesmo objeto se o valor for do mesmo tipo ou um subtipo do tipo de conversão.
zh_cn: 如果值是相同类型或转换类型的子类型，则在对象类型之间进行转换会导致相同的对象。

source: If the value is not a subtype, the casting operation will result in a ``null`` value.
de: Wenn der Wert kein Subtyp ist, führt die Casting-Operation zu einem ``null`` -Wert.
es: Si el valor no es un subtipo, la operación de conversión dará como resultado un valor ``null``.
ko: 값이 하위 유형이 아니라면 캐스팅 연산자는 ``null`` 값을 내보냅니다.
pt_br: Se o valor não for um subtipo, a operação de conversão resultará em um valor `` null``.
zh_cn: 如果该值不是子类型，则强制转换操作将产生 ``null`` 值。

source: For built-in types, they will be forcibly converted if possible, otherwise the engine will raise an error.
de: Bei eingebauten Typen werden sie nach Möglichkeit zwangsweise konvertiert, da sonst die Engine einen Fehler auslöst.
es: Para los tipos integrados, se convertirán a la fuerza si es posible, de lo contrario, el motor generará un error.
ko: 내장 유형의 경우, 가능하다면 강제로 유형을 변환하지만, 불가능하다면 오류를 발생합니다.
pt_br: Para tipos internos, eles serão convertidos à força, se possível, caso contrário, o mecanismo gerará um erro.
zh_cn: 对于内置类型，如果可能，将对其进行强制转换，否则引擎将引发错误。

source: Casting is also useful to have better type-safe variables when interacting with the scene tree::
de: Casting ist auch nützlich, um bei der Interaktion mit dem Szenenbaum bessere typsichere Variablen zu haben:
ko: 캐스팅은 더 유형에 안전한 변수를 만드는데 유용합니다. 씬 트리에서 상호작용하다 보면 변수의 유형에 불확실해질 수도 있기 때문이죠::
pt_br: Conversão também é útil para ter melhores variáveis de tipo seguro ao interagir com a árvore da cena::
zh_cn: 与场景树进行交互时，强制转换对于获得更好的类型安全变量也很有用：

source: Constants
de: Konstanten
es: Constantes
ko: 상수
pt_br: Constantes
zh_cn: 常量

source: Constants are values you cannot change when the game is running. Their value must be known at compile-time. Using the ``const`` keyword allows you to give a constant value a name. Trying to assign a value to a constant after it's declared will give you an error.
de: Konstanten sind Werte, die Sie nicht ändern können während das Spiel läuft, ihr Wert muss zur Kompilierungszeit bekannt sein. Mit dem Schlüsselwort ``const`` können Sie einem konstanten Wert einen Namen geben. Wenn Sie versuchen, einer Konstanten nach ihrer Deklaration einen Wert zuzuweisen, wird ein Fehler angezeigt.

source: We recommend using constants whenever a value is not meant to change.
de: Wir empfehlen die Verwendung von Konstanten, wenn sich ein Wert nicht ändern soll.

source: Although the type of constants is inferred from the assigned value, it's also possible to add explicit type specification::
de: Obwohl der Typ der Konstanten aus dem zugewiesenen Wert abgeleitet wird, ist es auch möglich, eine explizite Typspezifikation hinzuzufügen:
es: Aunque el tipo de constantes se deduce del valor asignado, también es posible agregar una especificación explícita:
ko: 상수의 유형은 지정된 값에서 유추할 수 있지만, 명시적인 유형 지정을 추가할 수도 있습니다::
pt_br: Embora o tipo de constantes seja inferido a partir do valor atribuído, também é possível adicionar especificação de tipo explícito:
zh_cn: 尽管可以从分配的值中推断出常量的类型，但是也可以添加显式的类型说明：

source: Assigning a value of an incompatible type will raise an error.
de: Das Zuweisen eines Werts eines inkompatiblen Typs führt zu einem Fehler.
es: Asignar un valor de un tipo incompatible generará un error.
ko: 맞지 않은 유형의 값을 지정하면 오류가 발생합니다.
pt_br: Atribuir um valor de um tipo incompatível gerará um erro.
zh_cn: 分配不兼容类型的值将引发错误。

source: Since arrays and dictionaries are passed by reference, constants are "flat". This means that if you declare a constant array or dictionary, it can still be modified afterwards. They can't be reassigned with another value though.
de: Da Arrays und Wörterbücher als Referenz übergeben werden, sind Konstanten "flach". Das heißt, wenn Sie ein konstantes Array oder Wörterbuch deklarieren, kann es danach noch geändert werden. Sie können jedoch keinem anderen Wert zugewiesen werden.
zh_cn: 由于数组和字典是通过引用的方式传递，常数们是“平坦的”。这代表，如果你声明了一个常数数组或字典，它依然可以被更改。虽然，你并不能将常数数组或字典重新赋值。

source: Enums
de: Enumeratoren (Aufzählungen)
es: Enumeraciones
ko: 열거형(Enum)
pt_br: Enumeradores
zh_cn: 枚举

source: Enums are basically a shorthand for constants, and are pretty useful if you want to assign consecutive integers to some constant.
de: Enumeratoren sind im Grunde ein Kürzel für Konstanten und sind nützlich, wenn aufeinanderfolgende Ganzzahlen Kontanten zugeordnet werden sollen.
es: Las enumeraciones básicamente son atajos para las constantes, son muy útiles si quieres asignar números consecutivos a alguna constante.
ko: 열거형은 기본적으로 상수의 축약형으로, 연속적인 정수를 일부 상수에 지정할 때 꽤 유용합니다.
pt_br: Enumeradores são basicamente alternativas para constantes, e são muito úteis se você quer atribuir inteiros consecutivos para alguma constante.
zh_cn: 枚举基本上是常量的简写，如果您想为某些常量分配连续整数，那么枚举非常有用。

source: If you pass a name to the enum, it will put all the keys inside a constant dictionary of that name.
de: Wenn Sie der Aufzählung einen Namen übergeben, werden alle Schlüssel in ein konstantes Wörterbuch dieses Namens aufgenommen.
es: Si le das un nombre al enum, todos los valores que este contenga se asignarán a un diccionario de constantes con ese nombre.
ko: 열거형에 이름을 전달하면, 열거형은 해당 이름의 상수 딕셔너리 안에 모든 키를 넣습니다.
pt_br: Se você passar um nome para um enum, ele irá colocar todas as chaves dentro de um dicionário constante com aquele nome.
zh_cn: 如果将名称传递给枚举，它将把所有键放入该名称的常量字典中。

source: In Godot 3.1 and later, keys in a named enum are not registered as global constants. They should be accessed prefixed by the enum's name (``Name.KEY``); see an example below.
de: In Godot 3.1 und höher werden Schlüssel in einer benannten Aufzählung nicht als globale Konstanten registriert. Auf sie sollte vor dem Namen der Aufzählung (``Name.KEY``) zugegriffen werden. siehe ein Beispiel unten.
ko: Godot 3.1부터는, 이름있는 열거형에서 키(Key)는 전역 상수로 등록할 수 없습니다. 키에 접근하려면 열거형의 이름이 앞에 있어야합니다 (``이름.KEY``). 아래의 예제를 참고하세요.
pt_br: A partir do Godot 3.1, chaves em um enum nomeado não são registradas como constantes globais. Elas devem ser acessadas com o prefixo do nome do enum (``Name.KEY``); veja no exemplo abaixo.
zh_cn: 从 Godot 3.1 开始，不会再将具名枚举的键注册为全局常量，应该通过前缀枚举的名字的形式来访问（``Name.KEY``）；见后面的例子。

source: Functions
de: Funktionen
es: Funciones
ko: 함수(Function)
pt_br: Funções
zh_cn: 函数

source: Functions always belong to a `class <Classes_>`_. The scope priority for variable look-up is: local → class member → global. The ``self`` variable is always available and is provided as an option for accessing class members, but is not always required (and should *not* be sent as the function's first argument, unlike Python).
de: Funktionen gehören immer zu einer `Klasse <Klassen_>`_. Die Priorität für die variable Suche ist: local → class member → global. Die Variable ``self`` ist immer verfügbar und wird als Option für den Zugriff auf Klassenmitglieder bereitgestellt, wird aber nicht immer benötigt (und sollte im Gegensatz zu Python *nicht* als erstes Argument der Funktion gesendet werden).
es: Las funciones siempre pertenecen a una `clase <Classes_>`_. El ámbito de prioridad de comprobación de variables es: local → miembro de clase → global. La variable ``self`` siempre está disponible y se proporciona como opción para el acceso a los miembros de la clase, pero no suele ser necesaria (y *no* se debe de enviar como primer parámetro a una función, al contrario que en Python).
ko: 함수는 항상 `클래스 <Classes_>`_\ 에 속합니다. 변수 조회 범위의 우선 순위는 다음과 같습니다: 지역(Local) → 클래스 멤버(Class Member) → 전역(Global). ``self`` 변수는 항상 사용할 수 있고, 클래스 멤버에 접근할 수 있는 설정으로 제공합니다. 하지만 항상 필요한 것은 아닙니다 (함수의 첫 번째 인수로 보내서는 *안* 됩니다. Python과는 다른 점이죠).
pt_br: Funções sempre pertencem a `class <Classes_>`_. A prioridade de escopo para a procura de variáveis é: local → membro da classe → global. A variável ``self`` é sempre disponível e é fornecida como uma opção para acessar membros da classe, mas não é sempre necessária (e , diferente do Python, *não* deve ser enviada como o primeiro argumento de uma função).
zh_cn: 函数总是属于一个 `类 <Classes_>`_ 。变量查找的作用域的优先级是：局部 → 类成员 → 全局。``self`` 变量总是可用的，并作为访问类成员的选项提供，但并不总是必需的（与Python不同， *不* 应该将其作为函数的第一个参数传递）。

source: A function can ``return`` at any point. The default return value is ``null``.
de: Eine Funktion kann jederzeit ``zurückkehren``. Der Standard-Rückgabewert ist ``null``.
es: Una función puede retornar, usando la palabra clave ``return``, en cualquier punto. El valor de retorno por defecto es ``null``.
ko: 함수는 언제든지 ``반환(return)``\ 할 수 있습니다. 기본 반환 값은 ``null``\ 입니다.
pt_br: Uma função pode ``retornar`` em qualquer ponto. O valor padrão de retorno é ``null``.
zh_cn: 函数可以在任何时候 ``return`` 。默认返回值是 ``null``。

source: Functions can also have type specification for the arguments and for the return value. Types for arguments can be added in a similar way to variables::
de: Funktionen können auch eine Typspezifikation für die Argumente und für den Rückgabewert haben. Typen für Argumente können auf ähnliche Weise wie Variablen hinzugefügt werden:
es: Las funciones también pueden tener una especificación de tipo para los argumentos y para el valor de retorno. Los tipos de argumentos se pueden agregar de manera similar a las variables:
ko: 그리고 함수는 인수와 반환 값의 유형 지정을 할 수 있습니다. 인수의 유형은 변수에서와 비슷한 방식으로 추가할 수 있습니다::
pt_br: Funções também podem ter especificação de tipo para os argumentos e para o valor de retorno. Tipos de argumentos podem ser adicionados de forma semelhante às variáveis:
zh_cn: 函数也可以具有参数和返回值的类型声明。可以使用与变量类似的方式添加参数的类型：

source: If a function argument has a default value, it's possible to infer the type::
de: Wenn ein Funktionsargument einen Standardwert hat, kann auf den Typ geschlossen werden:
es: Si un argumento de una función tiene un valor por defecto, es posible inferir el tipo:
ko: 함수 인수가 기본 값을 갖는다면, 유형을 추론할 수 있습니다::
pt_br: Se um argumento de função tiver um valor padrão, é possível inferir o tipo::
zh_cn: 如果函数参数具有默认值，则可以推断类型：

source: The return type of the function can be specified after the arguments list using the arrow token (``->``)::
de: Der Rückgabetyp der Funktion kann nach der Argumentliste mit dem Pfeiltoken (`` -> ``) angegeben werden:
es: El tipo de retorno de la función se puede especificar después de la lista de argumentos usando el token de flecha (``->``):
ko: 함수의 반환 유형은 화살표 토큰 (``->``)을 사용하여 인수 목록 뒤에 지정할 수 있습니다::
pt_br: O tipo de retorno da função pode ser especificado após a lista de argumentos usando o token de seta (``->``)::
zh_cn: 可以在参数列表之后使用箭头标记（``->``）指定函数的返回类型：

source: Functions that have a return type **must** return a proper value. Setting the type as ``void`` means the function doesn't return anything. Void functions can return early with the ``return`` keyword, but they can't return any value.
de: Funktionen mit einem Rückgabetyp **müssen** einen richtigen Wert zurückgeben. Wenn Sie den Typ auf ``void`` setzen, gibt die Funktion nichts zurück. Void-Funktionen können mit dem Schlüsselwort ``return`` frühzeitig beendet werden, sie können jedoch keinen Wert zurückgeben.
es: Las funciones que tienen un tipo de retorno ** deben ** devolver un valor adecuado. Establecer el tipo como ``void`` significa que la función no devuelve nada. Las funciones anuladas pueden regresar pronto con la palabra clave ``return``, pero no pueden devolver ningún valor.
ko: 반환 유형을 갖는 함수는 **반드시** 그에 맞는 값을 반환해야 합니다. 유형을 ``void``\ 로 설정하면 함수는 아무 것도 반환하면 안 됩니다. Void 함수는 ``return`` 키워드로 함수에서 일찍 반환할 수 있지만, 거기서 값을 반환하면 안 됩니다.
pt_br: Funções que possuem um tipo de retorno **devem** retornar um valor adequado. Definir o tipo como ``void`` significa que a função não retorna nada. As funções void podem retornar cedo com a palavra-chave ``return``, mas não podem retornar nenhum valor.
zh_cn: 有返回类型的函数 **必须** 返回正确的值。将类型设置为 ``void`` 意味着函数不返回任何内容。Void函数可以使用 ``return`` 关键字提前返回，但不能返回任何值。
