Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/static_typing.po
Languages: ja, ko, ru

source: Static typing in GDScript
ja: 静的型付けGDScript
ko: GDScript에서 정적 타이핑(Static typing)

source: In this guide, you will learn:
ja: このガイドでは、次の内容について学習します:
ko: 이 가이드에서 다음 내용을 배울 것입니다:
ru: В этом руководстве вы узнаете:

source: **How to use types in GDScript**
ja: **GDScriptで型を使用する方法**
ko: **GDScript에서 타입을 사용하는 방법**
ru: **Как использовать типы в GDScript**

source: That **static types can help you avoid bugs**
ja: 静的型は\ **バグの回避に役立ちます**
ko: 이 **정적 타입은 버그를 피하는데 도움을 줍니다**
ru: Что **статические типы могут помочь вам избежать ошибок**

source: Where and how you use this new language feature is entirely up to you: you can use it only in some sensitive GDScript files, use it everywhere, or write code like you always did!
ja: この新しい言語機能をどこで、どのように使うかは完全にあなた次第です！
ko: 새로운 언어 기능을 사용하는 위치와 방법은 당신에게 달렸습니다: 일부 민감한 GDScript 파일에서만 이것을 사용할 수 있고, 어디에든 사용할 수 있고, 항상 그래왔듯이 코드를 작성할 수 있습니다!
ru: Где и как вы используете эту новую функцию языка полностью зависит от Вас: вы можете использовать ее только в некоторых файлах GDScript, использовать везде или писать код, как вы всегда делали!

source: Static types can be used on variables, constants, functions, parameters, and return types.
ja: 静的型は、変数、定数、関数、パラメータ、戻り値の型に使用できます。
ko: 정적 타입은 변수, 상수, 함수, 매개 변수, 그리고 반환 타입에 사용될 수 있습니다.
ru: Статические типы могут использоваться для переменных, констант, функций, параметров и возвращаемых типов.

source: Typed GDScript is available since Godot 3.1.
ja: 型付きGDScriptはGodot 3.1から使用できます。
ko: 타입 GDScript는 Godot 3.1부터 사용할 수 있습니다.
ru: Типизированный GDScript доступен начиная с Godot 3.1.

source: A brief look at static typing
ja: 静的型付けの概要
ko: 정적 타이핑에 대한 간단한 설명
ru: Краткий обзор статической типизации

source: With typed GDScript, Godot can detect even more errors as you write code! It gives you and your teammates more information as you’re working, as the arguments’ types show up when you call a method.
ja: 型付きのGDScriptを使うことで、Godotはコードを書く際にさらに多くのエラーを検出することができます。メソッドを呼び出すと引数の型が表示されるため、作業中に詳細な情報が得られます。
ko: 타입 GDScript로, 코드를 작성할 수록 훨씬 더 많은 오류를 Godot가 감지할 수 있습니다! 즉, 메서드를 호출할 때, 인수의 타입이 나타나기 때문에 작업하는 동안 당신과 당신의 동료에게 더 많은 정보를 제공합니다.
ru: С типизированным GDScript, Godot может обнаружить еще больше ошибок при написании кода! Это дает вам и вашей команде больше информации во время работы, поскольку типы аргументов отображаются при вызове метода.

source: Imagine you’re programming an inventory system. You code an ``Item`` node, then an ``Inventory``. To add items to the inventory, the people who work with your code should always pass an ``Item`` to the ``Inventory.add`` method. With types, you can enforce this:
ja: あなたが在庫管理システムをプログラミングしていると想像してください。 ``Item`` ノード、次に ``Inventory`` をコーディングします。アイテムをインベントリに追加するには、コードを操作する人々は常に ``Item`` を ``Inventory.add`` メソッドに渡す必要があります。型を設定すれば、これを強制できます:
ko: 인벤토리 시스템을 프로그래밍 한다고 상상해보세요. 당신은 ``Item`` 노드를 코딩하고, ``Inventory``\ 를 코딩합니다. 아이템은 인벤토리에 넣기 위해, 당신의 코드로 작업하는 사람들은 항상 ``Item``\ 을 ``Inventory.add``\ 으로 전달해야 합니다. 타입으로는, 다음을 시행할 수 있습니다:
ru: Представьте, что вы программируете систему инвентаризации. Вы запрограммировали узел ``Item``, а затем ``Inventory``. Чтобы добавить предметы в инвентарь, люди, работающие с вашим кодом, должны всегда передавать ``Item`` методу ``Inventory.add``. Используя типы вы можете обеспечить это:

source: Another significant advantage of typed GDScript is the new **warning system**. From version 3.1, Godot gives you warnings about your code as you write it: the engine identifies sections of your code that may lead to issues at runtime, but lets you decide whether or not you want to leave the code as it is. More on that in a moment.
ja: 型付きGDScriptのもう1つの重要な利点は、新しい\ **警告システム**\ です。バージョン3.1以降のGodotではコードを記述する際に警告が表示されます: 実行時に問題を引き起こす可能性のあるコードのセクションが識別されますが、コードをそのままにしておくかどうかを決めることができます。これについては後で説明します。
ko: 타입 GDScript의 또 다른 두드러진 장점은 새로운 **경고 시스템**입니다. 3.1버전부터 Godot는 당신이 코딩을 하는 중에 바로 경고를 보여줍니다: 엔진은 실행 중에 문제가 될 수 있는 코드 부분을 식별하지만 당신이 코드를 그대로 둘지 말지는 당신이 결정할 수 있도록 합니다. 잠시후에 더 설명합니다.
ru: Еще одним существенным преимуществом типизированного GDScript является новая **система предупреждений**. Начиная с версии 3.1, Godot выдает вам предупреждения о вашем коде в процессе его написания: движок определяет части вашего кода, которые могут привести к проблемам во время выполнения, но позволяет вам решить, хотите ли вы оставить код таким, какой он есть. Подробнее об этом через минуту.

source: Static types also give you better code completion options. Below, you can see the difference between a dynamic and a static typed completion options for a class called ``PlayerController``.
ja: 静的型を使用すると、コード補完オプションも改善されます。以下に、 ``PlayerController`` というクラスの動的型補完オプションと静的型補完オプションの違いを示します。
ko: 정적 타입 또한 더 나은 코드 완성 옵션을 제공합니다. 아래에서``PlayerController``라는 클래스에 대한 동적 및 정적 타입 완료 옵션의 차이점을 볼 수 있습니다.
ru: Статические типы также дают вам лучшие варианты завершения кода. Ниже вы можете увидеть разницу между динамической и статической типизацией вариантов завершения для класса под названием ``PlayerController``.

source: You’ve probably stored a node in a variable before, and typed a dot to be left with no autocomplete suggestions:
ja: あなたはおそらく以前に変数にノードを格納していて、オートコンプリートの提案なしで残されるようにドットをタイプしました:
ko: 당신은 아마 전에 변수에 노드를 저장하고, 변수이름 뒤에 점을 입력했으나 자동완성 제안이 표시되지 않았던 경험이 있었을 수 있습니다:
ru: Возможно, вы ранее хранили узел в переменной и набирали точку, и оставались без предложений авто-завершения:

source: This is due to dynamic code. Godot cannot know what node or value type you’re passing to the function. If you write the type explicitly however, you will get all public methods and variables from the node:
ja: これは動的コードによるものです。Godotは、関数に渡されているノードまたは値のタイプを認識できません。ただし型を明示的に記述すると、すべてのpublicメソッドと変数がノードから取得されます:
ko: 이는 동적 코드 때문입니다. Godot는 함수에 전달하는 노드나 값 타입을 알 수 없습니다. 그러나 유형을 명시적으로 작성해주면, 노드에서 모든 공용 메서드 및 변수를 가져옵니다:
ru: Это обусловлено динамическим кодом. Godot не может знать, какой тип узла или значения вы передаете в функцию. Однако, если вы опишите тип явно, вы получите все публичные методы и переменные из узла:

source: In the future, typed GDScript will also increase code performance: Just-In-Time compilation and other compiler improvements are already on the roadmap!
ja: 将来的には、型付きGDScriptによってコードのパフォーマンスも向上します。ジャストインタイムコンパイルやその他のコンパイラの改善はすでにロードマップに盛り込まれています！
ko: 향후에, 타입형 GDScript는 또한 코드 실행 속도 등의 성능을 개선할 것입니다: 즉석(Just-In-Time) 컴파일과 다른 컴파일러 성능 향상이 이미 로드맵에 대기 중입니다!
ru: В будущем, типизированный GDScript также увеличит производительность кода: компиляция Just-In-Time и другие улучшения компилятора уже в планах!

source: Overall, typed programming gives you a more structured experience. It helps prevent errors and improves the self-documenting aspect of your scripts. This is especially helpful when you’re working in a team or on a long-term project: studies have shown that developers spend most of their time reading other people’s code, or scripts they wrote in the past and forgot about. The clearer and the more structured the code, the faster it is to understand, the faster you can move forward.
ja: 全体として、型付きプログラミングはあなたにもっと構造化された経験を与えます。それはエラーを防ぎ、あなたのスクリプトの自己文書化の側面を改善するのを助けます。これはチームや長期的なプロジェクトで作業している場合に特に役立ちます。開発者が他の人のコードや過去に書いたスクリプトを読んで忘れていたことがほとんどの時間を費やしていることが調査によってわかっています。コードがより明確でより構造化されているほど、理解するのが早くなるほど、早く進むことができます。
ko: 전체적으로, 타입형 프로그래밍은 더 구조화된 경험을 제공합니다. 에러를 방지하고 스크립트가 자체문서화되도록 돕습니다. 이러한 점은 긴 프로젝트를 하거난 팀 프로젝트에서 유용합니다: 연구는 개발자들이 다른 개발자의 코드나 또는 자신이 오래전에 작성하여 내용을 잊어버린 스크립트를 보는데 대부분의 시간을 보낸다고 합니다. 코드가 더 명확하고 구조화될수록 이해하는 것은 더 빨라지며 더 빨리 진도를 나갈 수 있습니다.
ru: В целом, типизированное программирование дает вам более структурированный опыт. Это помогает предотвратить ошибки и улучшает само-документируемый аспект ваших скриптов. Это особенно полезно, когда вы работаете в команде или над долгосрочным проектом: исследования показали, что разработчики проводят большую часть своего времени за чтением чужого кода или скриптов, которые они написали в прошлом и о которых забыли. Чем яснее и структурированнее код, тем быстрее его понять, тем быстрее вы сможете двигаться вперед.

source: How to use static typing
ja: 静的型付けの使用方法
ko: 정적 타입 사용법
ru: Как использовать статическую типизацию

source: To define the type of a variable or a constant, write a colon after the variable’s name, followed by its type. E.g. ``var health: int``. This forces the variable's type to always stay the same:
ja: 変数または定数の型を定義するには、変数の名前の後にコロンを書き、その後に指定する型を書きます。例: ``var health: int`` これにより、変数の型は常に保持されます:
ko: 변수나 상수의 형(type)을 정의하기 위해서, 변수이름뒤에 콜론을 붙이고 타입을 명시하세요. 예를 들면 "var health:int". 이것은 변수의 타입이 항상 동일하도록 강제합니다:
ru: Чтобы определить тип переменной или константы, запишите двоеточие после имени переменной, а затем ее тип. Например ``var health: int``. Это заставляет тип переменной всегда оставаться неизменным:

source: Godot will try to infer types if you write a colon, but you omit the type:
ja: コロンを書くと、Godotは型を推測しようとしますが、型を省略します:
ko: Godot은 당신이 콜론을 입력했지만 타입을 생략한 경우 타입을 예측하기 위해서 노력합니다:
ru: Godot попытается определить тип самостоятельно, если вы напишете двоеточие, но не укажите тип:

source: Currently you can use three types of… types:
ja: 現在、3種類の…タイプを使用できます:
ko: 현재 세 개의 타입을 사용할 수 있습니다:
ru: В настоящее время вы можете использовать три вида... типов:

source: :ref:`Built-in <doc_gdscript_builtin_types>`
ja: \ :ref:`ビルトイン <doc_gdscript_builtin_types>`
ko: :ref:`내장 타입 <doc_gdscript_builtin_types>`

source: Core classes and nodes (``Object``, ``Node``, ``Area2D``, ``Camera2D``, etc.)
ja: コアクラスとノード ( ``Object`` 、 ``Node`` 、 ``Area2D`` 、 ``Camera2D`` など)
ko: 핵심 클래스와 노드 (``Object``, ``Node``, ``Area2D``, ``Camera2D``, 등등)
ru: Основные классы и узлы (``Object``, ``Node``, ``Area2D``, ``Camera2D``, и т.д.)

source: Your own, custom classes. Look at the new :ref:`class_name <doc_scripting_continued_class_name>` feature to register types in the editor.
ja: 独自のカスタムクラス。新しい \ :ref:`class_name <doc_scripting_continued_class_name>` 機能を調べて、型をエディタに登録します。
ko: 당신이 만들고 수정한 클래스들. 에디터에서 타입을 등록하려면 새로운 :ref:`클래스이름 <doc_scripting_continued_class_name>` 특징을 보세요.
ru: Ваши собственные, индивидуальные классы. Посмотрите на новую функцию :ref:`class_name <doc_scripting_continued_class_name>` для регистрации типов в редакторе.

source: You don't need to write type hints for constants, as Godot sets it automatically from the assigned value. But you can still do so to make the intent of your code clearer.
ja: Godotは割り当てられた値から自動的に型を設定するので、定数の型ヒントを書く必要はありません。ただしコードの意図をより明確にするために、これを行うこともできます。
ko: 상수에 대해서는 Godot이 자동으로 대입된 값으로부터 타입을 인식하기 때문에 타입 힌트를 쓸 필요가 없습니다. 하지만 여전히 코드의 의도를 명확히 하려면 그렇게 하는게 좋습니다.
ru: Вам не нужно писать типовые подсказки для констант, так как Godot устанавливает их автоматически из присвоенного значения. Но вы все равно можете сделать это, чтобы прояснить смысл вашего кода.

source: Custom variable types
ja: カスタム変数型
ko: 커스텀 변수 타입
ru: Пользовательские типы переменных

source: You can use any class, including your custom classes, as types. There are two ways to use them in scripts. The first method is to preload the script you want to use as a type in a constant:
ja: カスタムクラスを含む任意のクラスを型として使用できます。スクリプトで使用する方法は2つあります。最初の方法は、定数の型として使用するスクリプトをプリロードすることです:
ko: 당신이 만든 클래스를 포함해 어떤 클래스든지 타입으로 사용할 수 있습니다. 스크립트에서 쓸 수 있는 방법이 두 가지가 있는데, 첫번째 방법은 타입으로 사용할 스크립트를 미리 로딩하여 상수로 저장하는 것입니다:
ru: Вы можете использовать любой класс, включая ваши собственные классы, как типы. Есть два способа использовать их в скриптах. Первый способ - предварительно загрузить скрипт, который вы хотите использовать в качестве типа константы:

source: The second method is to use the ``class_name`` keyword when you create. For the example above, your Rifle.gd would look like this:
ja: 2番目の方法は、作成時に ``class_name`` キーワードを使用することです。上記の例では、Rifle.gdは次のようになります:
ko: 두 번째 방법은 생성할 때 ``class_name`` 키워드를 사용하는 것입니다. 위의 예제에서 Rifle.gd는 다음과 같습니다:
ru: Второй метод заключается в использовании ключевого слова ``class_name`` при создании. Для приведенного выше примера ваш Rifle.gd будет выглядеть так:

source: If you use ``class_name``, Godot registers the Rifle type globally in the editor, and you can use it anywhere, without having to preload it into a constant:
ja: ``class_name`` を使用する場合、GodotはRifle型をグローバルにエディタに登録します。定数にプリロードすることなく、どこでも使用できます:
ko: ``class_name``\ 을 사용한다면, Godot는 Rifle 타입을 에디터에서 전역으로 등록합니다, 그리고 상수에 미리 불러올 필요 없이 어디에나 그것을 쓸 수 있습니다:
ru: Если вы используете ``class_name``, Godot глобально регистрирует тип Rifle в редакторе, и вы можете использовать его где угодно, без предварительной загрузки в константу:

source: Variable casting
ja: 変数のキャスト
ko: 변수 캐스팅(casting)
ru: Приведение переменной

source: Type casting is a key concept in typed languages. Casting is the conversion of a value from one type to another.
ja: 型キャストは型付き言語の重要な概念です。キャストは、ある型から別の型への値の変換です。
ko: 타이프 캐스팅(Type casting)은 타입 언어에서의 주요된 개념입니다. 어떤 값의 타입을 다른 타입으로 바꾸는 것입니다.
ru: Приведение типов является ключевым понятием в типизированных языках. Приведение - это преобразование значения из одного типа в другой.

source: Imagine an Enemy in your game, that ``extends Area2D``. You want it to collide with the Player, a ``KinematicBody2D`` with a script called ``PlayerController`` attached to it. You use the ``on_body_entered`` signal to detect the collision. With typed code, the body you detect is going to be a generic ``PhysicsBody2D``, and not your ``PlayerController`` on the ``_on_body_entered`` callback.
ja: ``extends Area2D`` であなたのゲームに敵がいると仮定してください。あなたはそれを ``PlayerController`` と呼ばれるスクリプトが付いている ``KinematicBody2D`` と衝突させたいのです。衝突を検出するには ``on_body_entered`` シグナルを使用します。型付きコードでは、 ``_on_body_entered`` コールバックでは、検出したボディは一般的な ``PhysicsBody2D`` になり、 ``PlayerController`` にはなりません。
ko: 게임에 ``Area2D를 확장하는`` 적이 있다고 상상합시다. 거기에 ``PlayerController`` 스크립트가 붙은 ``KinematicBody2D``, 즉 플레이어가 충돌해야 합니다. ``on_body_entered`` 시그널을 사용하면 충돌을 감지할 수 있습니다. 타입형 코드로, 감지한 바디는 일반 ``PhysicsBody2D``\ 이 될 것이며, ``_on_body_entered`` 콜백의 ``PlayerController``\ 가 아닐 것입니다.
ru: Представьте себе врага в вашей игре, который ``расширяет Area2D``. Вы хотите, чтобы он сталкивался с Player-ом : ``KinematicBody2D`` со скриптом под названием ``PlayerController``, прикрепленным к нему. Вы используете сигнал ``on_body_entered`` для обнаружения столкновений. С типизированным кодом тело, которое вы обнаружите, будет общим ``PhysicsBody2D``, а не вашим ``PlayerController`` при обратном вызове ``_on_body_entered``.

source: You can check if this ``PhysicsBody2D`` is your Player with the ``as`` casting keyword, and using the colon ``:`` again to force the variable to use this type. This forces the variable to stick to the ``PlayerController`` type:
ja: この ``PhysicsBody2D`` がプレイヤーであるかどうかを確認するには、 ``as`` キャストキーワードを使用し、再度コロン ``:`` を使用して変数にこの型を使用させます。これにより、変数は ``PlayerController`` タイプに固定されます:
ko: ``PhysicsBody2D``\ 가 ``as`` 캐스팅 키워드로 이루어진 플레이어인지 확인할 수 있습니다, 그리고 콜론 ``:``\ 을 다시 사용해 변수가 이 타입을 사용하도록 강제합니다. 이렇게 하면 변수는 ``PlayerController`` 타입에 고정하게 합니다:
ru: Вы можете проверить, является ли этот ``PhysicsBody2D`` вашим Player-ом используя ключевое слово ``as`` и снова использовать двоеточие ``:``, чтобы заставить переменную использовать этот тип. Это заставляет переменную придерживаться типа ``PlayerController``:

source: As we’re dealing with a custom type, if the ``body`` doesn’t extend ``PlayerController``, the ``player``\ variable will be set to ``null``. We can use this to check if the body is the player or not. We will also get full autocompletion on the player variable thanks to that cast.
ja: ここではカスタム・タイプを扱っているため、 ``body`` が ``PlayerController`` を拡張しない場合、 ``player`` 変数は ``null`` に設定されます。これを使って、体がプレイヤーかどうかを確認できます。このキャストのおかげで、player変数の完全なオートコンプリートもできるようになります。
ko: 커스텀 타입을 다루고 있으니, ``body``\ 가 ``PlayerController``\ 를 확장하지 않는다면, ``player``\ 변수는 ``null``\ 로 설정될 것입니다. 이걸로 바디가 플레이어인지 아닌지 확인할 수 있습니다. 또한 캐스트 덕분에 플레이어 변수에 완전한 자동 완성을 얻을 수 있습니다.
ru: Так как мы имеем дело с пользовательским типом, если ``body`` не расширяет ``PlayerController``, значение переменной ``player`` будет установлено ``null``. Мы можем использовать это, чтобы проверить, является ли тело Player-ом или нет. Мы также получим полное авто-заполнение переменной Player-а благодаря этому исполнению.

source: If you try to cast with a built-in type and it fails, Godot will throw an error.
ja: 組み込み型でキャストしようとして失敗すると、Godotはエラーをスローします。
ko: 내장 타입으로 캐스트를 하려 하다가 실패한다면, Godot는 오류를 내보낼 것입니다.
ru: Если вы попытаетесь выполнить приведение со встроенным типом, и это не удастся, Godot выдаст ошибку.

source: Safe lines
ja: セーフ・ライン
ko: 안전 라인
ru: Безопасные строки

source: You can also use casting to ensure safe lines. Safe lines are a new tool in Godot 3.1 to tell you when ambiguous lines of code are type-safe. As you can mix and match typed and dynamic code, at times, Godot doesn’t have enough information to know if an instruction will trigger an error or not at runtime.
ja: セーフ・ラインを確保するためにキャストを使用することもできます。セーフ・ラインは、はGodot 3.1の新しいツールで、あいまいなコード行がセーフな型であることを教えてくれます。型指定されたコードと動的なコードを混在させることができるため、Godotには実行時に命令がエラーを引き起こすかどうかを知るための十分な情報がない場合があります。
ko: 안전 라인을 보장하기 위해 형 변환을 사용할 수도 있습니다. 안전 라인은 애매모호한 코드가 형안전한지 알려주는 Godot 3.1에서 새로 추가된 도구입니다. 정적 타입과 동적 타입을 섞어서 대입시킬 수 있기 때문에 Godot은 런타임에 오류가 발생할 지에 대한 여부를 판명할 충분한 정보가 없습니다.
ru: Вы также можете использовать приведение, чтобы обеспечить безопасные строки. Безопасные строки - это новый инструмент в Godot 3.1, который поможет вам понять, когда неоднозначные строки кода являются типо-безопасными. Поскольку вы можете смешивать и сопоставлять типизированный и динамический код, иногда у Godot не хватает информации, чтобы знать, вызовет ли инструкция ошибку или нет во время выполнения.

source: This happens when you get a child node. Let’s take a timer for example: with dynamic code, you can get the node with ``$Timer``. GDScript supports `duck-typing <https://stackoverflow.com/a/4205163/8125343>`__, so even if your timer is of type ``Timer``, it is also a ``Node`` and an ``Object``, two classes it extends. With dynamic GDScript, you also don’t care about the node’s type as long as it has the methods you need to call.
ja: これは子ノードを取得したときに起こります。たとえばタイマーを考えてみましょう。動的コードでは、\ ``$Timer`` でノードを取得できます。GDScriptは `ダック・タイピング <https://stackoverflow.com/a/4205163/8125343>` をサポートしているので、あなたのタイマーが ``Timer`` 型であっても、それは ``Node`` であり ``Object`` でもあり、2つのクラスが拡張しています。動的GDScriptでは、呼び出す必要のあるメソッドがある限り、ノードの種類についても気にする必要はありません。
ko: 이것은 자식 노드를 얻을 때 발생합니다. 타이머를 예로 들어봅니다: 동적 코드를 통해, ``$Timer``\ 로 노드를 얻을 수 있습니다. GDScript는 `덕 타이핑 <https://stackoverflow.com/a/4205163/8125343>`__\ 을 지원하기 때문에, 타이머가 ``Timer`` 타입에 속해 있다면, ``Node``\ 와 ``Object``\ 에도 속해있는 것입니다, 확장된 두 클래스이죠. 동적 GDScript로, 또한 호출하는데 필요한 메서드를 가진다면, 노드 타입에 대해 걱정하지 않아도 됩니다.
ru: Это происходит, когда вы получаете дочерний узел. Возьмем, к примеру, таймер: с динамическим кодом вы можете получить узел с помощью ``$Timer``. GDScript поддерживает `Утиную типизацию <https://stackoverflow.com/a/4205163/8125343>`__, поэтому даже если ваш таймер имеет тип ``Timer``, он также является ``Node`` и ``Object``, два класса которые он расширяет. В динамическом GDScript вы также не заботитесь о типе узла, если у него есть необходимые вам методы для вызова.

source: You can use casting to tell Godot the type you expect when you get a node: ``($Timer as Timer)``, ``($Player as KinematicBody2D)``, etc. Godot will ensure the type works and if so, the line number will turn green at the left of the script editor.
ja: ノードを取得したときに期待される型をGodotに伝えるためにキャストを使用できます: ``($Timer as Timer)`` 、 ``($Player as KinematicBody2D)`` など。Godotは、そのタイプが機能することを確認し、機能する場合は、行番号がスクリプトエディタの左側で緑に変わります。
ko: 노드를 얻을 때 예상하는 타입을 Godot에게 말하기 위해 캐스팅을 사용할 수 있습니다: ``($Timer as Timer)``, ``($Player as KinematicBody2D)`` 등. Godot는 타입이 작동하는지 확인하고, 작동한다면 스크립트 에디터 왼쪽의 줄 숫자가 초록색으로 바뀔 것입니다.
ru: Вы можете использовать приведение, чтобы сообщить Godot-у тип, который вы ожидаете, когда получаете узел: ``($Timer as Timer)``, ``($Player as KinematicBody2D)`` и т.д. Godot обеспечит работу типа и, если это так, то номер строки слева в редакторе скриптов станет зеленым.

source: Safe vs Unsafe Line
ja: セーフ･ラインVSセーフでないライン
ko: 안전 vs 불안전 라인
ru: Безопасные строки против Небезопасных строк

source: You can turn off safe lines or change their color in the editor settings.
ja: セーフ･ラインをオフにするか、エディタ設定でカラーを変更することができます。
ko: 에디터 설정에서 안전 라인을 끌 수 있고 혹은 색상을 바꿀 수 있습니다.
ru: Вы можете отключить безопасные строки или изменить их цвет в настройках редактора.

source: Define the return type of a function with the arrow ->
ja: アロー(->)による関数の戻り値の定義
ko: -> 화살표로 함수의 반환 타입 정의하기
ru: Определите тип возвращаемого значения функции с помощью стрелки ->

source: To define the return type of a function, write a dash and a right angle bracket ``->`` after its declaration, followed by the return type:
ja: 関数の戻り値の型を定義するには、宣言の後に ``->`` を記述し、その後に戻り値の型を記述します:
ko: 함수의 반환 타입을 정의하기 위해, 하이픈과 오른쪽 직각 괄호를 적습니다 ``->`` 선언 후, 반환 타입이 뒤따릅니다:

source: The type ``void`` means the function does not return anything. You can use any type, as with variables:
ja: ``void`` 型は、関数が何も返さないことを意味します。変数と同様に、任意の型を使用できます:
ko: ``void`` 타입은 함수가 아무것도 반환하지 않는 것을 의미합니다. 변수와 마찬가지로 어떤 타입도 사용할 수 있습니다:
ru: Тип ``void`` означает, что функция ничего не возвращает. Вы можете использовать любой тип, как с переменными:

source: You can also use your own nodes as return types:
ja: 独自のノードを戻り値の型として使用することもできます:
ko: 또한 자신의 노드를 반환 타입으로 사용할 수 있습니다:
ru: Вы также можете использовать свои собственные узлы в качестве возвращаемых типов:

source: Typed or dynamic: stick to one style
ja: 静的と動的: どちらかのみを利用する
ko: 타입형 혹은 동적: 하나의 스타일을 고수하기
ru: Типизированный или динамичный: придерживайтесь одного стиля

source: Typed GDScript and dynamic GDScript can coexist in the same project. But I recommended to stick to either style for consistency in your codebase, and for your peers. It’s easier for everyone to work together if you follow the same guidelines, and faster to read and understand other people’s code.
ja: 型付きGDScriptと動的GDScriptは、同じプロジェクト内に共存できます。しかし、コードベースの一貫性のためにも、仲間のためにも、どちらかスタイルに固定することをお勧めします。同じガイドラインに従うことで全員が協力しやすくなり、他の人のコードを素早く読んで理解できるようになります。
ko: 타입형 GDScript와 동적 GDScript는 같은 프로젝트에 공존할 수 있습니다. 하지만 코드 베이스의 일관성과 동료들을 위해, 저는 하나의 스타일을 고수하기를 추천합니다. 같은 가이드라인을 따른다면 모두가 함께 일하기 더 쉽고, 다른 사람의 코드를 읽고 이해하는데 더 빠를 것입니다.
ru: Типизированный GDScript и динамический GDScript могут сосуществовать в одном проекте. Но я бы порекомендовал придерживаться любого из этих стилей для согласованности в вашей кодовой базе и для ваших коллег. Всем будет легче работать вместе, если вы будете следовать одним и тем же правилам, также вы будете быстрее читать и понимать чужой код.

source: Typed code takes a little more writing, but you get the benefits we discussed above. Here’s an example of the same, empty script, in a dynamic style:
ja: 型定義されたコードはもう少し作成が必要ですが、上で説明したような利点があります。次に、同じ空のスクリプトを動的なスタイルで示します:
ko: 타입형 코드는 조금 더 쓸 것이 많지만, 위에서 말한대로 이득을 얻습니다. 여기 같은, 빈 스크립트 예제가 있습니다, 동적 스타일에서는 이렇습니다:
ru: Типизированный код требует немного больше времени для написания, но вы получаете преимущества, которые мы обсуждали выше. Ниже приведен пример того же пустого скрипта в динамическом стиле:

source: And with static typing:
ja: そして静的型付けでは:
ko: 그리고 정적 타입형에서는 이렇습니다:
ru: И со статической типизацией:

source: As you can see, you can also use types with the engine’s virtual methods. Signal callbacks, like any methods, can also use types. Here’s a ``body_entered`` signal in a dynamic style:
ja: このように、エンジンの仮想メソッドで型を使用することもできます。シグナルのコールバックも、他のメソッドと同様に型を使用できます。動的スタイルの ``body_entered`` シグナルは次のとおりです:
ko: 보시다시피, 엔진의 가상 메서드로 타입형을 사용할 수도 있습니다. 메서드와 같은 시그널 콜백도 타입형을 사용할 수 있습니다. 이것이 동적 스타일에서 ``body_entered`` 시그널입니다:
ru: Как видите, вы также можете использовать типы с виртуальными методами движка. Сигнальные обратные вызовы, как и любые методы, также могут использовать типы. Вот сигнал ``body_entered`` в динамическом стиле:

source: And the same callback, with type hints:
ja: 同じコールバックをタイプヒントとともに使用します:
ko: 그리고 타입형 힌트를 쓴 같은 콜백입니다:
ru: И тот же обратный вызов, с типовыми подсказками:
