Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/static_typing.po
Languages: ja, ko, ru

source: You’re free to replace, e.g. the ``CollisionObject2D``, with your own type, to cast parameters automatically:
ja: パラメータを自動的にキャストするには、 ``CollisionObject2D`` などを独自の型に自由に置き換えます:

source: The ``bullet`` variable could hold any ``CollisionObject2D`` here, but we make sure it is our ``Bullet``, a node we created for our project. If it’s anything else, like an ``Area2D``, or any node that doesn’t extend ``Bullet``, the ``bullet`` variable will be ``null``.
ja: ``bullet`` 変数にはここで任意の ``CollisionObject2D`` を保持できますが、それが独自に作成したノードである ``Bullet`` であることを確認します。 ``Area2D`` など、 ``Bullet`` を拡張していないノードなど、それ以外のものがある場合、 ``bullet`` 変数は ``null`` になります。
ko: ``bullet`` 변수는 여기서 ``CollisionObject2D``\ 를 가질 수 있습니다 ,하지만 그것이 우리의 ``Bullet``\ 이어야 합니다, 프로젝트에 생성한 노드 말이죠. ``Area2D``\ 나 ``Bullet``\ 을 확장하지 않는 다른 노드라면, ``bullet`` 변수는 ``null``\ 이 될 것입니다.
ru: Переменная ``bullet`` может содержать любой ``CollisionObject2D`` здесь, но мы должны убедиться, что это наш ``Bullet``, узел, который мы создали для нашего проекта. Если это что-то еще, например, ``Area2D`` или любой другой узел, который не расширяет ``Bullet``, переменная ``bullet`` будет иметь значение ``null``.

source: Warning system
ja: 警告システム
ko: 경고 시스템(Warning system)
ru: Система предупреждений

source: The warning system complements typed GDScript. It’s here to help you avoid mistakes that are hard to spot during development, and that may lead to runtime errors.
ja: この警告システムは型付きGDScriptを補完します。これはコーディング中に発見しにくく、ランタイムエラーにつながる可能性のあるミスを回避するのに役立ちます。
ko: 경고 시스템은 타입형 GDScript를 보완해줍니다. 개발 중에 발생하기 쉽고 런타임 오류를 일으키는 실수를 피하도록 도와줍니다.
ru: Система предупреждений дополняет типизированный GDScript. Она здесь, чтобы помочь вам избежать ошибок, которые трудно обнаружить во время разработки и которые могут привести к ошибкам во время выполнения.

source: You can configure warnings in the Project Settings under a new section called ``GDScript``:
ja: プロジェクト設定 の ``GDScript`` という新しいセクションで警告を設定できます:
ko: 프로젝트 설정에서 ``GDScript``\ 라고 하는 섹션에서 경고를 구성할 수 있습니다:
ru: Вы можете настроить предупреждения в Настройках Проекта, в новом разделе под названием ``GDScript``:

source: warning system project settings
ja: 警告システムプロジェクト設定
ko: 경고 시스템 프로젝트 설정

source: You can find a list of warnings for the active GDScript file in the script editor’s status bar. The example below has 3 warnings:
ja: スクリプトエディタのステータスバーにアクティブなGDScriptファイルに関する警告の一覧が表示されます。次の例には、3つの警告があります:
ko: 스크립트 에디터의 상태 바에서 활성화된 GDScript 파일을 위한 경고 목록을 찾을 수 있습니다. 밑의 예제는 3개의 경고를 갖습니다:
ru: Вы можете найти список предупреждений для активного файла GDScript в строке состояния редактора сценариев. В приведенном ниже примере есть 3 предупреждения:

source: warning system example
ja: 警報システム例
ko: 경고 시스템 예제

source: To ignore specific warnings in one file, insert a special comment of the form ``# warning-ignore:warning-id``, or click on the ignore link to the right of the warning’s description. Godot will add a comment above the corresponding line and the code won’t trigger the corresponding warning anymore:
ja: 1つのファイル内の特定の警告を無視するには、 ``#warning-ignore:<警告ID>`` という形式の特別なコメントを挿入するか、警告の説明の右側にある無視リンクをクリックします。Godotは対応する行の上にコメントを追加し、対応する警告を表示しなくなります:

source: warning system ignore example
ja: 警告システム無視の例
ko: 경고 시스템 무시 예제

source: You can also choose to ignore not just one but all warnings of a certain type in this file with ``# warning-ignore-all:warning-id``. To ignore all warnings of all types in a file add the comment ``# warnings-disable`` to it.
ja: またファイル内で、特定の種類の警告をすべて無視するには、\ ``# warning-ignore-all:<警告ID>``\ を、すべての種類の警告を無視するには\ ``# warnings-disable``\ のコメントを追加します。

source: Warnings won’t prevent the game from running, but you can turn them into errors if you’d like. This way your game won’t compile unless you fix all warnings. Head to the ``GDScript`` section of the Project Settings to turn on this option. Here’s the same file as the previous example with warnings as errors turned on:
ja: 警告によってゲームの実行が妨げられることはありませんが、必要に応じてエラーにすることができます。こうすると、すべての警告を修正しない限りゲームはコンパイルされません。このオプションをオンにするには、プロジェクト設定の ``GDScript`` セクションに移動します。前の例と同じファイルで、エラーとしての警告がオンになっているものを次に示します:
ko: 경고는 게임 실행을 방해하지 않지만, 원한다면 오류로 바꿀 수 있습니다. 이 방법으로 모든 오류를 고치지 않는다면 게임이 컴파일 되지 않을 것입니다. 프로젝트 설정의 ``GDScript`` 섹션으로 가서 이 설정을 킵니다. 이전 예제와 같은 파일로 경고가 오류로 바뀐 것입니다:
ru: Предупреждения не помешают запуску игры, но вы можете превратить их в ошибки, если хотите. Таким образом, ваша игра не будет скомпилирована, пока вы не исправите все предупреждения. Перейдите в раздел ``GDScript`` в настройках проекта, чтобы включить эту опцию. Вот тот же файл, что и в предыдущем примере, с предупреждениями которые интерпретируются как ошибки:

source: warnings as errors
ja: エラーとしての警告
ko: 오류와 같은 경고
ru: предупреждения как ошибки

source: Cases where you can’t specify types
ja: 型を指定できない場合
ko: 타입을 지정할 수 없는 경우
ru: Случаи, когда вы не можете указать типы

source: To wrap up this introduction, let’s cover a few cases where you can’t use type hints. All the examples below **will trigger errors**.
ja: この紹介の締めくくりに、タイプヒントを使用できないいくつかのケースを取り上げましょう。 以下の例はすべて\ **エラーを引き起こします**\ 。
ko: 이 소개를 마무리하며, 타입형 힌트를 사용할 수 없는 몇 몇 경우를 알아봅시다. 밑의 모든 예제는 **오류를 유발합니다**.
ru: Чтобы завершить это введение, давайте рассмотрим несколько случаев, когда вы не можете использовать типовые подсказки. Все приведенные ниже примеры **вызовут ошибки**.

source: You can’t use Enums as types:
ja: Enumを型として使うことはできません:
ko: 이넘(Enum)을 타입으로 사용할 수 없습니다:
ru: Вы не можете использовать Перечисления как типы:

source: You can’t specify the type of individual members in an array. This will give you an error:
ja: 配列の個々のメンバの種類を指定することはできません。これにより、エラーが発生します:
ko: 배열에서 각 멤버의 타입을 지정할 수 없습니다. 오류를 줄 것입니다:
ru: Вы не можете указать тип отдельных членов в массиве. Это приведет к ошибке:

source: You can’t force the assignment of types in a ``for`` loop, as each element the ``for`` keyword loops over already has a different type. So you **cannot** write:
ja: ``for`` キーワード・ループの各要素にはすでに異なる型があるため、 ``for`` ループで型の割り当てを強制することはできません。したがって、次のように書くことは**できません**:
ko: ``for`` 루프에서 타입의 할당을 강제할 수 없습니다, ``for`` 키워드 루프에서 각 요소는 이미 다른 타입을 갖고 있기 때문입니다. 따라서 작성할 수 **없습니다**:
ru: Вы не можете принудительно присваивать типы в цикле ``for``, так как каждый элемент, по которому проходит ключевое слово ``for``, уже имеет свой тип. Таким образом, вы **не можете** написать:

source: Two scripts can’t depend on each other in a cyclic fashion:
ja: 2つのスクリプトは、循環的に相互に依存することはできません:
ko: 두 개의 스크립트가 주기적으로 서로에게 의지할 수 없습니다:
ru: Два скрипта не могут циклически зависеть друг от друга:

source: Summary
ja: 概要
ko: 요약
ru: Подведение итогов

source: Typed GDScript is a powerful tool. Available as of version 3.1 of Godot, it helps you write more structured code, avoid common errors, and create scalable systems. In the future, static types will also bring you a nice performance boost thanks to upcoming compiler optimizations.
ja: 型付きGDScriptは強力なツールです。Godotのバージョン3.1から利用できるようになり、より構造化されたコードの記述、一般的なエラーの回避、スケーラブルシステムの作成に役立ちます。将来的には、コンパイラーの最適化によって静的型のパフォーマンスも大幅に向上するでしょう。
ko: 타입형 GDScript는 강력한 도구입니다. Godot 3.1 버전에 이용할 수 있으며, 일반적인 오류들을 피하면서, 더 구조화된 코드와 확장성 있는 체계를 만드는 것을 도와줍니다. 미래에서는 정적 타입도 향후 컴파일러 최적화로 좋은 퍼포먼스 향상을 제공할 것입니다.
ru: Типизированный GDScript - это мощный инструмент. Доступный начиная с версии 3.1 Godot, он помогает вам писать более структурированный код, избегать распространенных ошибок и создавать масштабируемые системы. В будущем статические типы также принесут вам хороший прирост производительности благодаря предстоящей оптимизации компилятора.

source: To ignore specific warnings in one file, insert a special comment of the form ``#warning-ignore:warning-id``, or click on the ignore link to the right of the warning’s description. Godot will add a comment above the corresponding line and the code won’t trigger the corresponding warning anymore:
ko: 하나의 파일에서 특정 경고를 무시하려면, 특수 주석을 끼워 넣어야 합니다 ``#warning-ignore:warning-id``, 혹은 경고의 설명 오른쪽에 무시 링크를 클릭합니다. Godot는 위에 주석을 추가해야 해당하는 줄과 코드가 더 이상 같은 경고를 내지 않도록 합니다:
