Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/assets/importing_images.po
Languages: cs, de, fr, ja, ru, uk

source: Godot supports high dynamic range textures (as .HDR or .EXR). These are mostly useful as high dynamic range equirectangular panorama skies (the internet has plenty if you search for them), which replace Cubemaps in Godot 2.x. Modern PCs support the BC6H VRAM format, but there are still plenty that do not.
cs: Godot podporuje textury s vysokým dynamickým rozsahem (ve formátu .HDR nebo .EXR). Ty jsou většinou užitečné jako rovnoramenné panoramatické oblohy s vysokým dynamickým rozsahem (na internetu jich najdete spoustu, pokud je budete hledat), které nahrazují Cubemaps v Godotu 2.x. Moderní počítače podporují formát BC6H VRAM, ale stále existuje spousta počítačů, které jej nepodporují.
de: Godot unterstützt HDR-Texturen (als .HDR oder .EXR). Diese sind vor allem als äquirektanguläre HDR-Panoramahimmel nützlich (das Internet hat viele, wenn Sie danach suchen), die Cubemaps in Godot 2.x ersetzen. Moderne PCs unterstützen das BC6H-VRAM-Format, aber es gibt immer noch viele, die dies nicht tun.
fr: Godot prend en charge les textures à plages dynamiques élevées (comme .HDR ou .EXR). Celles-ci sont surtout utiles en tant que ciel panoramique équi-rectanculaire à plage dynamique élevée (Internet en foisonne si vous en cherchez), qui remplace Cubemaps dans Godot 2.x. Les PC modernes prennent en charge le format BC6H VRAM, mais il en existe encore beaucoup dont ce n'est pas le cas.
ru: Godot поддерживает текстуры высокого динамического диапазона (такие, как .HDR или .EXR). Они, в основном, полезны, как равнопрямоугольные панорамы неба (в интернете есть много, если вы ищете их), которые заменяют Cubemaps в Godot 2.x. Современные ПК поддерживают формат BC6H VRAM, но есть еще много других.
uk: Godot підтримує текстури високого динамічного діапазону (як .HDR, або .EXR). Вони в основному корисні, як прямокутні панорами неба (багато таких можна знайти в Інтернеті), замість кубічних карт (Cubemaps) в Godot 2.x. Сучасні комп'ютери підтримують формат VRAM BC6H, але не всі.

source: If you want Godot to ensure full compatibility in terms of the kind of textures, enable the "Force RGBE" option.
cs: Pokud chcete, aby Godot zajistil plnou kompatibilitu z hlediska druhu textur, povolte možnost "Vynutit RGBE".
de: Wenn Sie möchten, dass Godot die volle Kompatibilität in Bezug auf die Art der Texturen gewährleistet, aktivieren Sie die Option "Force RGBE".
fr: Si vous voulez que Godot garantisse une compatibilité totale avec les types de textures, activez l'option "Forcer RGBE".
ru: Если вы хотите, чтобы Godot обеспечивал полную совместимость с точки зрения типов текстур, включите опцию "Force RGBE".
uk: Якщо ви хочете, щоб Godot забезпечив повну сумісність текстур, увімкніть опцію "Force RGBE" ("Формувати RGBE").

source: Normal Map
cs: Normálová mapa
de: Normal Map (Karte)
ja: 通常のマップ
uk: Normal Map (Карта нормалей)

source: When using a texture as normal map, only the red and green channels are required. Given regular texture compression algorithms produce artifacts that don't look that nice in normal maps, the RGTC compression format is the best fit for this data. Forcing this option to "Enabled" will make Godot import the image as RGTC compressed. By default, it's set to "Detect", which means that if the texture is ever used as a normal map, it will be changed to "Enabled" and reimported automatically.
cs: Při použití textury jako normálové mapy jsou vyžadovány pouze červený a zelený kanál. Vzhledem k tomu, že běžné algoritmy komprese textur vytvářejí artefakty, které v normálových mapách nevypadají příliš hezky, je pro tato data nejvhodnější kompresní formát RGTC. Vynucením této možnosti na hodnotu "Povoleno" Godot importuje obrázek jako komprimovaný RGTC. Ve výchozím nastavení je nastavena na "Detekovat", což znamená, že pokud bude textura někdy použita jako normálová mapa, bude změněna na "Povoleno" a automaticky znovu importována.
de: Wenn eine Textur als Normalmap verwendet wird, sind nur der rote und der grüne Kanal erforderlich. Da normale Texturkompressionsalgorithmen Artefakte erzeugen, die in Normalmaps nicht so schön aussehen, ist das RGTC-Kompressionsformat für diese Daten am besten geeignet. Wenn Sie diese Option auf "Aktiviert" setzen, wird Godot das Bild als RGTC-komprimiert importieren. Standardmäßig ist sie auf "Erkennen" eingestellt, d.h. wenn die Textur jemals als normale Map verwendet wird, wird sie in "Aktiviert" geändert und automatisch wieder importiert.
fr: Lorsque vous utilisez une texture comme carte normale, seuls les canaux rouge et vert sont requis. Étant donné que les algorithmes classiques de compressions de textures produisent des artefacts qui ne semblent pas beaux dans les cartes normales, le format de compression RGTC convient parfaitement à ces données. Si vous forcez cette option sur "Activé", Godot importera l'image au format RGTC compressé. Par défaut, il est défini sur "Détecter", ce qui signifie que si la texture est utilisée comme une carte normale, elle sera remplacée par "Activé" et réimportée automatiquement.
ru: При использовании текстуры в качестве карты нормалей требуются только красный и зеленый каналы. Поскольку обычные алгоритмы сжатия текстур создают артефакты, которые не очень хорошо выглядят на картах нормалей, формат сжатия RGTC лучше всего подходит для этих данных. Если для этого параметра установлено значение "Enabled" (включено), Godot будет импортировать изображение как сжатое RGTC. По умолчанию он установлен на "Detect" (обнаружение), что означает, что если текстура когда-либо будет использоваться в качестве карты нормалей, она будет изменена на "Enabled" (включено) и повторно импортирована автоматически.
uk: При використанні текстури в якості карти нормалей, потрібні лише червоний та зелений канали. Звичні алгоритми стиснення текстури створюють спотворення, які не виглядають добре в картах нормалей, формат стиснення RGTC найкраще підходить для цих даних. Коли ця опція в положенні "Enabled" ("Увімкнено"), Godot імпортує зображення у вигляді стиснення RGTC. За замовчуванням встановлено значення "Detect" ("Виявити"), що означає, що якщо текстура коли-не-будь використовуватиметься як карта нормалей, вона буде змінена на "Enabled" ("Увімкнено") і автоматично імпортується.

source: Note that RGTC compression affects the resulting normal map image. You will have to adjust custom shaders that use the normal map to take this into account.
cs: Všimněte si, že komprese RGTC ovlivňuje výsledný obraz normálové mapy. Budete muset upravit vlastní shadery, které používají normálovou mapu, aby tuto skutečnost zohlednily.
de: Beachten Sie, dass sich die RGTC-Komprimierung auf das resultierende Normalmapbild auswirkt. Sie müssen benutzerdefinierte Shader, welche die Normalmap verwenden, anpassen, um dies zu berücksichtigen.
fr: Notez que la compression RGTC affecte l'image normale de la carte résultante. Vous devrez ajuster les shaders personnalisés qui utilisent la carte normale pour en tenir compte.
ru: Обратите внимание, что сжатие RGTC влияет на результирующее изображение карты нормалей. Вам нужно будет настроить пользовательские шейдеры, которые используют карту нормалей, чтобы принять это во внимание.
uk: Зауважте, що стиснення RGTC впливає на отриману карту нормалей зображення. Вам доведеться налаштувати спеціальні шейдери, які використовують карту нормалей, щоб врахувати це.

source: Godot requires the normal map to use the X+, Y- and Z+ coordinates. In other words, if you've imported a material made to be used with another engine, you may have to convert the normal map so its Y axis is flipped. Otherwise, the normal map direction may appear to be inverted on the Y axis.
cs: Godot vyžaduje, aby normálová mapa používala souřadnice X+, Y- a Z+. Jinými slovy, pokud jste importovali materiál vytvořený pro použití v jiném enginu, možná budete muset normálovou mapu převést tak, aby byla její osa Y převrácená. V opačném případě se může zdát, že směr normálové mapy je na ose Y převrácený.
de: Godot benötigt die normale Karte, um die X+ -, Y- und Z+ -Koordinaten zu verwenden. Mit anderen Worten, wenn Sie ein Material importiert haben, das für die Verwendung mit einer anderen Engine erstellt wurde, müssen Sie möglicherweise die normale Karte so konvertieren, dass ihre Y-Achse umgedreht wird. Andernfalls scheint die normale Kartenrichtung auf der Y-Achse invertiert zu sein.
ru: Godot требует, чтобы карта нормалей использовала координаты X+, Y- и Z+. Другими словами, если вы импортировали материал, предназначенный для использования с другим движком, вам, возможно, придется преобразовать карту нормалей, чтобы ее ось Y была перевернута. В противном случае направление карты нормалей может показаться инвертированным по оси Y.
uk: Godot вимагає звичайної карти, щоб використовувати координати X+, Y- та Z+. Іншими словами, якщо ви імпортували матеріал, призначений для використання з іншим редактором, можливо, вам доведеться перетворити звичайну карту, щоб її вісь Y перевернулася. В іншому випадку нормальний напрямок карти може здатися оберненим на осі Y.

source: More information about normal maps (including a coordinate order table for popular engines) can be found `here <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.
cs: Další informace o normálových mapách (včetně tabulky pořadí souřadnic pro populární enginy) najdete `zde <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.
de: Weitere Informationen über Normal Maps (einschließlich einer Koordinatenordnungstabelle für populäre Engines) finden Sie `hier <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.
ru: Более подробную информацию о картах нормалей (включая таблицу порядка координат для популярных движков) можно найти `здесь <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.
uk: Більше інформації про карти нормалей (включаючи таблицю порядків координат для популярних редакторів) можна знайти `тут <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.

source: Flags
cs: Příznaky
fr: Drapeaux
ru: Флаги

source: There are plenty of settings that can be toggled when importing an image as a texture, depending on the use case.
cs: Při importu obrázku jako textury lze přepínat mezi mnoha nastaveními v závislosti na konkrétním případu použití.
de: Es gibt eine Vielzahl von Einstellungen, die beim Importieren eines Bildes als Textur je nach Anwendungsfall umgeschaltet werden können.
fr: De nombreux paramètres peuvent être modifiés lors de l'importation d'une image en tant que texture, en fonction du cas d'utilisation.
ja: 使用状況に応じて、イメージをテクスチャとして読み込むときに切り替えることができる設定が多数あります。
ru: Существует множество параметров, которые можно переключать при импорте изображения в качестве текстуры, в зависимости от варианта использования.
uk: Існує багато налаштувань, які можна регулювати під час імпорту зображення у вигляді текстури, залежно від випадку використання.

source: Repeat
cs: Opakování
de: Repeat (Wiederhole)
fr: Répéter
ru: Повторение
uk: Repeat (Повтор)

source: This setting is most commonly used in 3D, and is therefore generally disabled in 2D. It sets UV coordinates going beyond the 0,0 - 1,1 range to "loop".
cs: Toto nastavení se nejčastěji používá ve 3D, a proto je ve 2D zpravidla vypnuto. Nastavuje UV souřadnice přesahující rozsah 0,0 - 1,1 na "smyčku".
de: Diese Einstellung wird am häufigsten in 3D verwendet und ist daher in 2D generell deaktiviert. Sie setzt UV-Koordinaten, die über den Bereich 0,0 - 1,1 hinausgehen, auf "Schleife".
fr: Ce paramètre est plus généralement utilisé en 3D , il est donc généralement désactivé en 2D. Cela fait que les coordonnées UV vont au-delà de l'intervalle 0,0 - 1,1 pour "boucler".
uk: Цей параметр найчастіше використовується в 3D, тому він, зазвичай, відключений у 2D. Він встановлює УФ (UV)-координати, що виходять за рамки 0,0 - 1,1, на "цикл".

source: Repeating can optionally be set to mirrored mode.
cs: Opakování lze volitelně nastavit do zrcadlového režimu.
de: Die Wiederholung kann optional auf den gespiegelten Modus eingestellt werden.
fr: La répétition peut être réglée optionnellement en mode miroir.
ru: Повторение может быть дополнительно установлено в зеркальном режиме.
uk: Повторення можна перевести в дзеркальний (mirrored) режим.

source: Filter
cs: Filtr
fr: Filtre
ru: Фильтр
uk: Filter (Фільтр)

source: When pixels become larger than the screen pixels, this option enables linear interpolation for them. The result is a smoother (less blocky) texture. This setting can be commonly used in 2D and 3D, but it's usually disabled when making pixel perfect games.
cs: Pokud jsou pixely větší než pixely obrazovky, tato možnost pro ně povolí lineární interpolaci. Výsledkem je hladší (méně kostrbatá) textura. Toto nastavení lze běžně použít ve 2D a 3D, ale při tvorbě her s dokonalým pixelovým rozlišením je obvykle vypnuto.
de: Wenn Pixel größer als die Bildschirmpixel werden, ermöglicht diese Option die lineare Interpolation für diese Pixel. Das Ergebnis ist eine glattere (weniger blockige) Textur. Diese Einstellung kann häufig in 2D und 3D verwendet werden, ist aber normalerweise deaktiviert, wenn man Pixelperfekte Spiele erstellt.
fr: Lorsque les pixels deviennent plus grands que les pixels de l'écran, ces options permettent leur interpolation linéaire. Le résultat est une texture plus lisse (moins pixelisée). Ce paramètre peut être couramment utilisé en 2D et 3D, mais il est généralement désactivé lors de la création de jeux pixel perfect.
ru: Когда пиксели становятся больше пикселей экрана, этот параметр включает для них линейную интерполяцию. В результате получается более гладкая (менее блочная) текстура. Этот параметр можно обычно использовать в 2D и 3D, но обычно он отключается при создании игр с идеальным пикселем.
uk: Коли пікселі стають більшими, ніж пікселі екрана, ця опція дозволяє лінійну інтерполяцію для них. В результаті виходить більш гладка (менш блокована) текстура. Цей параметр може бути використаний у 2D та 3D, але його зазвичай вимикають, коли розробляють піксельні ігри.

source: Mipmaps
cs: Mipmapy
ru: Мип-карты (Mipmaps)

source: When pixels become smaller than the screen, mipmaps kick in. This helps reduce the grainy effect when shrinking the textures. Keep in mind that, in older hardware (GLES2, mainly mobile), there are some requirements to use mipmaps:
cs: Když jsou pixely menší než obrazovka, nastupují mipmapy. Pomáhají snížit zrnitý efekt při zmenšování textur. Mějte na paměti, že na starším hardwaru (GLES2, hlavně mobilní zařízení) existují určité požadavky na použití mipmap:
de: Wenn die Pixel kleiner als der Bildschirm werden, treten Mipmaps in Kraft. Dies hilft, den Körnigkeitseffekt beim Verkleinern der Texturen zu reduzieren. Denken Sie daran, dass bei älterer Hardware (GLES2, hauptsächlich Mobilgeräte) einige Anforderungen an die Verwendung von Mipmaps bestehen:
fr: Lorsque les pixels deviennent plus petits que l'écran, les mipmaps entrent en jeu. Cela permet de réduire l'effet granuleux lors de la réduction des textures. Gardez à l'esprit que, dans les matériels plus anciens (GLES2, principalement mobiles), il existe certaines exigences pour utiliser les mipmaps :
ja: ピクセルが画面よりも小さくなると、ミップマップが始まります。これにより、テクスチャを縮小する際の粒状効果を低減するのに役立ちます。古いハードウェア (GLES2、主にモバイル) では、mipmaps を使用する要件がいくつかあります:
ru: Когда пиксели становятся меньше экрана, срабатывают MIP-карты. Это помогает уменьшить эффект зернистости при сжатии текстур. Имейте в виду, что на более старом оборудовании (GLES2, в основном мобильное) есть некоторые требования для использования MIP-карт:
uk: Коли пікселі стають меншими за екранні, приходить час mipmaps. Він допомагає зменшити зернистий ефект при зменшенні текстур. Майте на увазі, що для старих апаратних засобів (GLES2, головним чином мобільних) є деякі вимоги щодо використання mipmap:

source: Texture width and height must be powers of 2
cs: Šířka a výška textury musí být mocniny 2
de: Texturbreite und -höhe müssen Potenzen von 2 sein
fr: L’hauteur et largeur d’une texture doivent être une puissance de 2
ja: テクスチャの幅と高さは 2 の力でなければなりません
ru: Ширина и высота текстуры должны быть степенями двойки
uk: Ширина та висота текстури повинні ділитися на 2

source: Repeat must be enabled
cs: Opakování musí být povoleno
de: Wiederholung muss aktiviert sein
fr: Répéter doit être activé
ja: 繰り返しを有効にする必要があります
ru: Должен быть включен повтор
uk: Повторення (Repeat) має бути ввімкнено

source: Keep in mind the above when making phone games and applications, want to aim for full compatibility, and need mipmaps.
cs: Při vytváření her a aplikací pro telefony mějte na paměti výše uvedené, když chcete plnou kompatibilitu a zároveň potřebujte mipmapy.
de: Denken Sie an das oben Gesagte, wenn Sie Handyspiele und -anwendungen entwickeln, eine vollständige Kompatibilität anstreben und Mipmaps benötigen.
fr: Gardez à l'esprit ce qui précède lorsque vous créez des jeux et des applications téléphoniques, que vous souhaitez assurer une compatibilité totale, et que vous avez besoin des mipmaps.
ja: 電話ゲームやアプリケーションを作成する際には、上記の注意を要し、完全な互換性を目指し、ミップマップが必要です。
ru: Помните о вышеизложенном при создании игр и приложений для телефона, стремитесь к полной совместимости и вам нужны MIP-карты.
uk: Пам'ятайте про вищезазначене, коли створюєте телефонні ігри та програми, і хочете націлитись на повну сумісність та потребуєте mipmaps.

source: When doing 3D, mipmap should be turned on, as this also improves performance (smaller versions of the texture are used for objects further away).
cs: Při práci ve 3D by měla být zapnuta mipmapa, protože to také zvyšuje výkon (pro vzdálenější objekty se používají menší verze textury).
de: Bei 3D sollte mipmap eingeschaltet sein, da dies auch die Leistung verbessert (kleinere Versionen der Textur werden für weiter entfernte Objekte verwendet).
fr: Lorsque vous faites de la 3D, mipmap doit être activé car cela améliore également les performances (des versions plus petites de la texture sont utilisées pour les objets plus éloignés).
ru: При работе с 3D необходимо включать mipmap, так как это также улучшает производительность (для объектов, расположенных дальше, используются более компактные версии текстуры).
uk: В 3D, mipmap слід увімкнути, оскільки це також покращує продуктивність (менші версії текстури використовуються для віддалених об'єктів).

source: Anisotropic
cs: Anizotropní
de: Anisotropisch
fr: Anisotropique
ja: 異方性
ru: Анизотропный

source: When textures are near parallel to the view (like floors), this option makes them have more detail by reducing blurriness.
cs: Pokud jsou textury takřka rovnoběžné s pohledem (např. podlahy), tato možnost jim dodá více detailů tím, že sníží rozmazání.
de: Wenn die Texturen nahezu parallel zur Ansicht sind (wie z.B. Böden), sorgt diese Option dafür, dass sie mehr Details aufweisen, indem die Unschärfe reduziert wird.
fr: Lorsque les textures sont presque parallèles à la vue (comme les sols), cette option leur donne plus de détails en réduisant le flou.
ru: Когда текстуры почти параллельны виду (например, полы), этот параметр делает их более детализированными за счет уменьшения размытости.
uk: Коли текстури розташовані поблизу паралельно погляду (як підлоги), цей параметр робить їх детальнішими, зменшуючи розмитість.

source: Process
cs: Proces
de: Prozess
fr: Traitement
ja: プロセス
ru: Процесс
uk: Process (Процес)

source: Some special processes can be applied to images when imported as textures.
cs: Na obrázky importované jako textury lze použít některé speciální procesy.
de: Einige spezielle Prozesse können auf Bilder angewendet werden, wenn sie als Texturen importiert werden.
fr: Certains processus spéciaux peuvent être appliqués aux images qui sont importées sous forme de textures.
ru: Некоторые специальные процессы могут быть применены к изображениям при импорте в качестве текстур.
uk: Деякі спеціальні процеси можуть бути застосовані до зображень при імпорті у вигляді текстур.

source: Fix Alpha Border
cs: Oprava okraje Alpha
de: Alpha-Grenze fixieren
fr: Fixer la bordure alpha
ja: アルファ境界線を修正する

source: This puts pixels of the same surrounding color in transition from transparency to non transparency. It helps mitigate the outline effect when exporting images from Photoshop and the like.
cs: Tím se pixely stejné okolní barvy dostanou z průhlednosti do neprůhlednosti. Pomáhá zmírnit efekt obrysů při exportu obrázků z Photoshopu apod.
de: Dies versetzt Pixel derselben Umgebungsfarbe in den Übergang von Transparenz zu Nichttransparenz. Dies hilft, den Umriss-Effekt beim Exportieren von Bildern aus Photoshop und dergleichen zu verringern.
fr: Les pixels de la même couleur environnante passent de la transparence à la non-transparence. Cela aide à atténuer l'effet de contour lors de l'exportation d'images à partir de Photoshop et autres.
ru: Это переводит пиксели одного и того же окружающего цвета из состояния прозрачности в состояние непрозрачности. Это помогает смягчить эффект контура при экспорте изображений из Photoshop и т.п.
uk: Це переводить пікселі однотонного оточуючого кольору в перехід від прозорості до непрозорості. Це допомагає пом'якшити контурний ефект при експорті зображень із Photoshop тощо.

source: It's a good idea to leave it on by default, unless specific values are needed.
cs: Pokud není potřeba nastavit konkrétní hodnoty, je dobré nechat ji ve výchozím nastavení zapnutou.
de: Es ist eine gute Idee dies standardmäßig aktiviert zu lassen, es sei denn bestimmte Werte sind erforderlich.
fr: C'est une bonne idée de le laisser par défaut, sauf si des valeurs spécifiques sont nécessaires.
ja: 特定の値が必要ない限り、既定のままにしておくことをお勧めします。
ru: Если не требуются определенные значения, рекомендуется оставить его по умолчанию.
uk: Його краще не міняти, якщо тільки не потрібні конкретні значення.

source: Premultiplied Alpha
cs: Přednásobená Alpha
de: Vormultiplizierte Alpha
fr: Alpha prémultiplié
ja: 乗算済みアルファ

source: An alternative to fix darkened borders is to use premultiplied alpha. By enabling this option, the texture will be converted to this format. Keep in mind that a material will need to be created that uses the PREMULT ALPHA blend mode on canvas items that need it.
cs: Alternativou pro opravu ztmavených okrajů je použití přednásobené alfa. Povolením této možnosti bude textura převedena do tohoto formátu. Mějte na paměti, že na prvcích plátna, které to potřebují, bude třeba vytvořit materiál, který bude používat režim prolnutí PREMULT ALPHA.
de: Eine Alternative zum beheben abgedunkelter Ränder ist die Verwendung von vormultipliziertem Alpha. Wenn Sie diese Option aktivieren, wird die Textur in dieses Format konvertiert. Beachten Sie, dass ein Material erstellt werden muss, das den PREMULT ALPHA-Mischmodus auf Canvas-Elementen verwendet, die es benötigen.
fr: Une alternative pour la correction des frontières sombres consiste à utiliser l’alpha prémultiplié. En activant cette option, la texture sera convertie dans ce format. N'oubliez pas qu'il faudra créer un matériau utilisant le mode de mélange PREMULT ALPHA sur les éléments de canevas qui en ont besoin.
ja: 暗くなった境界線を修正する別の方法は、乗算済みアルファを使用することです。 このオプションを有効にすると、テクスチャはこのフォーマットに変換されます。 必要なキャンバスアイテムにPREMULT ALPHAブレンドモードを使用するマテリアルを作成する必要があることに注意してください。
ru: Альтернативой исправлению затемненных границ является использование предварительно умноженного альфа-канала. При включении этой опции текстура будет преобразована в этот формат. Имейте в виду, что нужно будет создать материал, который использует режим наложения PREMULT ALPHA для элементов холста, которые в нём нуждаются.
uk: Альтернативою для фіксації затемнених меж є використання premultiplied alpha( попередньо помноженого альфа). Увімкнувши цю опцію, текстура буде перетворена в цей формат. Майте на увазі, що потрібно створити матеріал, який використовує режим суміші PREMULT ALPHA на полотнах, які потребують цього.
