Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/assets/importing_images.po
Languages: cs, de, fr, ja, ru, uk

source: HDR as sRGB
cs: HDR jako sRGB
de: HDR als sRGB
fr: HDR en tant que SRGB
ru: HDR как sRGB
uk: HDR як sRGB

source: A few HDR files are broken and contain sRGB color data. It is advised not to use them, but, in the worst-case scenario, toggling this option on will make them look right.
cs: Několik souborů HDR je poškozeno a obsahuje barevná data sRGB. Doporučujeme je nepoužívat, ale v nejhorším případě zapnutím této možnosti dosáhnete toho, že budou vypadat správně.
de: Einige HDR-Dateien sind fehlerhaft und enthalten sRGB-Farbdaten. Es wird empfohlen diese nicht zu verwenden, schlimmstenfalls aktivieren Sie diese Option, damit sie wieder richtig aussehen.
fr: Quelques fichiers HDR sont cassés et contiennent des données de couleur sRGB. Il est conseillé de ne pas les utiliser, mais, dans le pire des cas, activer cette option les fera paraître corrects.
ru: Некоторые файлы HDR повреждены и содержат данные о цвете sRGB. Рекомендуется не использовать их, но, в худшем случае, включение этой опции заставит их выглядеть правильно.
uk: Кілька файлів HDR є broken і містять кольорові дані sRGB. Не рекомендується використовувати їх, але, в гіршому випадку, ввімкнення цієї опції змусить їх виглядати правильно.

source: Invert Color
cs: Invertovat barvu
de: Farbe invertieren
fr: Inverser la couleur
ru: Invert Color (инвертировать цвета)
uk: Invert Color (Інвертувати колір)

source: Reverses the image's color. This is useful, for example, to convert a height map generated by external programs to depth map to use with :ref:`doc_spatial_material`.
cs: Obrátí barvu obrázku. To je užitečné například pro převod výškové mapy vygenerované externím programem na mapu hloubky pro použití s :ref:`doc_spatial_material`.
de: Kehrt die Farbe des Bildes um. Dies ist z. B. nützlich, um eine Höhenkarte, die von externen Programmen generiert wird, in eine Tiefenkarte zu konvertieren, die mit :ref:`doc_spatial_material` verwendet werden kann.
fr: Inverse la couleur de l'image. Ceci est utile, par exemple, pour convertir une carte de hauteur générée par des programmes externes en carte de profondeur à utiliser avec :ref:`doc_spatial_material`.
ru: Меняет цвет изображения на противоположное. Это полезно, например, для преобразования карты высот, созданной внешними программами, в карту глубины для использования с :ref:`doc_spatial_material`.
uk: Зміна (реверс) кольору зображення. Це корисно, наприклад, для перетворення карти висоти, створеної зовнішніми програмами, в карту глибини для використання з :ref:`doc_spatial_material`.

source: Scale
cs: Zvětšit
de: Maßstab
ru: Масштаб
uk: Масштаб

source: This option only applies to SVG files. It controls the scale of the SVG image. The default scale (1.0) will make the imported SVG match its original design scale.
cs: Tato možnost se vztahuje pouze na soubory SVG. Ovládá měřítko obrázku SVG. Při výchozím měřítku (1,0) bude importovaný SVG odpovídat původnímu měřítku návrhu.
de: Diese Option gilt nur für SVG-Dateien. Es steuert die Skalierung des SVG-Bildes. Mit der Standardskala (1.0) stimmt die importierte SVG-Datei mit der ursprünglichen Entwurfsskala überein.
uk: Цей параметр застосовується лише до файлів SVG. Він контролює масштаб зображення SVG. Шкала за замовчуванням (1.0) дозволить імпортованому SVG відповідати оригінальному масштабу проєкту.

source: Compress Lossless (PNG)
de: Komprimiert verlustfrei (PNG)
fr: Compresser sans perte (PNG)
ja: ロスレス圧縮(PNG)

source: Compress Lossy (WebP)
de: Komprimiert verlustbehaftet (WebP)
fr: Compresser avec pertes (WebP)
ja: 非可逆圧縮(WebP)

source: Stored as PNG
de: Gespeichert als PNG
fr: Stocké en PNG
ja: PNG形式で保存

source: Stored as WebP
de: Gespeichert als WebP
fr: Stocké en WebP
ja: WebP形式で保存

source: Godot uses Linear colorspace when rendering 3D. Textures mapped to albedo or detail channels need to have this option turned on in order for colors to look correct. When set to "Detect" mode, the texture will be marked as SRGB when used in albedo channels.
de: Godot verwendet beim 3D-Rendern den linearen Farbraum. Für Texturen, die auf Albedo- oder Detailkanäle abgebildet werden, muss diese Option aktiviert sein, damit die Farben korrekt aussehen. Wenn sie auf den Modus "Erkennen" eingestellt ist, wird die Textur als SRGB markiert, wenn sie in Albedo-Kanälen verwendet wird.
fr: Godot utilise l'espace colorimétrique linéaire lors du rendu 3D. Les textures mappées à l'albédo ou aux canaux de détail doivent avoir cette option activée pour que les couleurs soient correctes. Lorsqu'il est réglé sur le mode "Détecter", la texture sera marquée comme SRGB lorsqu'elle est utilisée dans les canaux albédo.
ja: Godotは、3Dレンダリング時に線形色空間を使用します。アルベドまたは詳細チャネルにマップされたテクスチャは、色が正しく表示されるために、このオプションをオンにする必要があります。 "Detect" モードに設定すると、アルベド チャネルで使用するとテクスチャがSRGBとしてマークされます。
ru: Godot использует линейное цветовое пространство при визуализации 3D. Для текстур, сопоставленных с каналами альбедо или детализации, этот параметр должен быть включен, чтобы цвета выглядели правильно. В режиме "Detect" текстура будет помечена как SRGB при использовании в каналах альбедо.

source: Why import them?
fr: Pourquoi les importer ?

source: In Godot 3+, image files are no longer native resources and they must be imported. The reason behind this is the large amount of configuration parameters that image files can be imported with.
fr: Dans Godot 3+, les fichiers image ne sont plus des ressources natives et doivent être importés. La raison derrière cela est la grande quantité de paramètres de configurations avec lesquels les fichiers image peuvent être importés.
ja: Godot 3+ では、イメージファイルはネイティブリソースではなくなり、インポートする必要があります。その背景には、イメージファイルをインポートできる構成パラメータが大量に含まれることが理由です。

source: This small tutorial will explain what these parameters are and how to best make use of them.
fr: Ce petit tutoriel expliquera quels sont ces paramètres et comment les utiliser au mieux.
ja: この小さなチュートリアルでは、これらのパラメータが何であるか、およびそれらを最大限に活用する方法について説明します。

source: HDR Mode
fr: Mode HDR
ja: HDRモード
ru: HDR Mode (режим HDR)
uk: Режим HDR

source: VRAM Compression: This is the most common compression mode for 3D assets. File on disk is reduced and video memory usage is also reduced considerably. For 3D, it may present unwanted artifacts, though.
ja: VRAM圧縮:これは3Dアセットの最も一般的な圧縮モードです。ディスク上のファイルが削減され、ビデオメモリの使用量も大幅に削減されます。ただし、3Dの場合は、不要なアーティファクトが表示される場合があります。

source: Lossless Compression: This is the most common compression for 2D assets. It shows assets without any kind of artifacting, and disk compression is decent. It will use considerably more amount of video memory than VRAM, though.
ja: ロスレス圧縮:これは2Dアセットで最も一般的な圧縮です。これは、人為的な影響を受けずにアセットを表示するものであり、ディスク圧縮は適切です。ただし、VRAMよりもかなり多くのビデオメモリを使用します。

source: Lossy Compression: For games with lots of large 2D assets, lossy compression can be a great choice. It has some artifacting, but less than VRAM and the file size is almost a tenth of Lossless.
ja: 非可逆圧縮:大きな2Dアセットを多く使用するゲームでは、非可逆圧縮が適しています。多少の不自然さはありますが、VRAMより小さく、ファイルサイズはロスレスの10分の1程度です。

source: Uncompressed: Only useful for formats that can't be compressed (like, raw float).
ja: 圧縮なし:圧縮できない書式 (生の浮動小数点型など) にのみ役立ちます。

source: In this table, each of the four options are described together with their advantages and disadvantages ( |good| = Best, |bad| =Worst ):
ja: この表では、4つのオプションのそれぞれについて、それぞれの長所と短所と共に説明しています(|良い|=ベスト、|悪い|=最悪):

source: Stored as S3TC/BC,PVRTC/ETC, depending on platform
ja: プラットフォームに応じてS3TC/BC、PVRTC/ETCとして保存
