Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/assets/import_process.po
Languages: fr, pt_br, ru, uk

source: Import process
fr: Processus d’importation
pt_br: Processo de importação
ru: Процесс импорта
uk: Процес імпорту

source: Importing assets in Godot 3.0+
fr: Importer des ressources dans Godot 3.0+
pt_br: Importando assets no Godot 3.0+
ru: Импорт ассетов в Godot 3.0+
uk: Імпорт активів (ассетів) у Godot 3.0+

source: Previously, importing assets in Godot 2.x required manual maintenance of a separate directory with source assets. Without doing this, it was impossible to specify how to convert and change import flags for textures, audio files, scenes, etc.
fr: Précédemment, importer des assets dans Godot 2.x requérait la maintenance manuelle d’un répertoire avec les fichiers sources des assets. Sans faire ça, il était impossible de spécifier comment convertir et comment changer une configuration d’importation pour les textures, l’audio, les scènes, etc.
pt_br: Anteriormente, a importação de assets no Godot 2.x exigia a manutenção manual de um diretório separado com assets de origem. Sem isso, era impossível especificar como converter e alterar os sinalizadores de importação para texturas, arquivos de áudio, cenas, etc.
ru: Раньше для импорта ресурсов в Godot 2.x требовалось вручную поддерживать отдельный каталог с исходными ресурсами. Без этого было невозможно указать, как преобразовывать и изменять флаги импорта для текстур, аудиофайлов, сцен и т.д.
uk: Раніше імпорт активів у Godot 2.x вимагав ручної підтримки окремого каталогу з вихідними активами. Без цього, неможливо було вказати, як конвертувати та змінювати прапори (флаги) імпорту текстур, аудіофайлів, сцен тощо.

source: In Godot 3.0+, we use a more modern approach to importing: Simply drop your assets (image files, scenes, audio files, fonts, etc) directly in the project folder (copy them manually with your OS file explorer). Godot will automatically import these files internally and keep the imported resources hidden in a res://.import folder.
fr: Dans Godot 3.0+, nous utilisons une approche plus moderne pour importer : déposez simplement vos assets (fichiers images, scènes, fichiers audios, polices, etc.) directement dans le répertoire du projet (copiez les manuellement avec l’explorateur de fichier de votre système d’exploitation). Godot importera automatiquement ces fichiers en interne et gardera les ressources importées cachées dans un répertoire res://.import.

source: This means that when trying to access imported assets through code you need to use the :ref:`Resource Loader<class_ResourceLoader>` as it will automatically take into account where the internal files are saved. If you try and access an imported asset using the :ref:`File <class_File>` class it will work in the editor, but break in the exported project.
fr: Cela signifie que lorsque vous essayez d'accéder à des ressources importées par le biais du code, vous devez utiliser le :ref:`Resource Loader<class_ResourceLoader>` car il prendra automatiquement en compte l'endroit où les fichiers internes sont enregistrés. Si vous essayez d'accéder à une ressource importée en utilisant la classe :ref:`Fichier <classe_Fichier>`, cela fonctionnera dans l'éditeur, mais pas dans le projet exporté.
pt_br: Isto significa que ao tentar acessar assets importados através de código você precisa usar o :ref:`Resource Loader<class_ResourceLoader>`, pois ele levará automaticamente em conta onde os arquivos internos são salvos. Se você tentar e acessar um asset importado utilizando a classe :ref:`File <class_File>` ele irá funcionar no editor, mas quebrará no projeto exportado.
ru: Это означает, что при попытке получить доступ к импортированным ресурсам с помощью кода, вам необходимо использовать :ref:`ResourceLoader<class_ResourceLoader>` класс, поскольку он автоматически учитывает: куда сохраняются внутренние файлы. Если попытаетесь получить доступ к импортированному ресурсу с помощью класса :ref:`File <class_File>`, он будет работать в самом редакторе, но прервется на экспортированном проекте.

source: However, the :ref:`Resource Loader<class_ResourceLoader>` cannot access non imported files, only the :ref:`File <class_File>` class can.
fr: Cependant, la classe :ref:`Resource Loader<class_ResourceLoader>` ne peut pas accéder aux fichiers non importés, seule la classe :ref:`File <class_File>` le peut.
pt_br: No entanto, o :ref:`Resource Loader<class_ResourceLoader>` não pode acessar arquivos não importados, apenas a classe :ref:`File <class_File>`pode.
ru: Однако, :ref:`ResourceLoader<class_ResourceLoader>` не имеет доступа к не импортированным файлам, только класс :ref:`File <class_File>` на такое способен.

source: Changing import parameters
fr: Changer les paramètres d’importation
pt_br: Alterando Parâmetros de Importação
ru: Изменение параметров импорта
uk: Зміна параметрів імпорту

source: To change the import parameters of an asset in Godot (again, keep in mind import parameters are only present in non-native Godot resource types) select the relevant resource in the filesystem dock:
fr: Pour changer les paramètres d’importation d’un asset dans Godot(encore une fois, gardez à l’esprit que les paramètres d’importation sont seulement présents pour les types de ressources non-natifs de Godot) sélectionnez la ressource concernée dans le dock du système de fichiers :
pt_br: Para alterar os parâmetros de importação de um asset no Godot (novamente, lembre-se de que os parâmetros de importação estão presentes apenas nos tipos de recursos não nativo do Godot) selecione o recurso relevante na dock do sistema de arquivos:
ru: Чтобы изменить параметры импорта ресурса в Godot (опять же, помните, что параметры импорта присутствуют только в неродных типах ресурсов Godot) выберите соответствующий ресурс в панели файловой системы:

source: Then, after adjusting the parameters, press "Reimport". These parameters will only be used for this asset and on future reimports.
fr: Et, après ajustement des paramètres, pressez "Reimport". Les paramètres utilisés seront uniquement appliqués à cet asset et seront utilisés pour les réimportations futures.
pt_br: Em seguida, depois de ajustar os parâmetros, pressione "Reimportar". Os parâmetros utilizados serão apenas para este asset e serão usados em futuras reimportações.
ru: Затем, после корректировки параметров, нажмите "Reimport". Эти параметры будут использоваться только для этого ассета и для будущих реимпортов.

source: Changing the import parameters of several assets at the same time is also possible. Simply select all of them together in the resources dock and the exposed parameters will apply to all of them when reimporting.
fr: Changer les paramètres d’importation pour plusieurs assets en même temps est possible également. Sélectionnez-les toutes ensemble dans l’onglet ressources et les paramètres exposés seront appliqués à chacune d’entre elles lors de leur réimportation.
pt_br: Alterar os parâmetros de importação de vários assets ao mesmo tempo também é possível. Basta selecionar todos eles juntos na dock de recursos e os parâmetros expostos serão aplicados a todos eles ao reimportar.
ru: Также возможно изменение параметров импорта нескольких ассетов одновременно. Просто выберите их все вместе в панели ресурсов и открытые параметры будут применяться ко всем из них при повторном импорте.
uk: Можлива зміна параметрів імпорту кількох активів одночасно. Просто виберіть їх усіх разом на панелі ресурсів, і відкриті параметри будуть застосовані до всіх при повторному імпорті.

source: Reimporting multiple assets
fr: Réimporter plusieurs assets
pt_br: Reimportando múltiplos assets
ru: Повторный импорт нескольких активов

source: While working on a project you may find that several assets need to have the same parameters changed, such as enabling mipmaps, but you only want those specific parameters changed. To do this, select every asset you want to reimport in the file system. In the import tab there will now be a checkbox to the left of every import parameter.
fr: En travaillant sur un projet, vous pouvez constater que plusieurs assets doivent avoir les mêmes paramètres modifiés, comme l'activation des mipmaps, mais que vous ne voulez que ces paramètres spécifiques uniquement soient modifiés. Pour ce faire, sélectionnez chaque asset que vous souhaitez réimporter dans le système de fichiers. Dans l'onglet d'importation, il y aura désormais une case à cocher à gauche de chaque paramètre d'importation.
pt_br: Ao trabalhar em um projeto, você pode descobrir que vários assets precisam ter os mesmos parâmetros alterados, como a ativação de mipmaps, mas você só quer que esses parâmetros específicos sejam alterados. Para fazer isto, selecione todos os assets que você quer reimportar no sistema de arquivos. Na aba de importação agora haverá uma caixa de seleção à esquerda de cada parâmetro de importação.
ru: Во время работы над проектом вы можете обнаружить, что для нескольких ресурсов необходимо изменить одни и те же параметры, например включить MIP-карты, но вам нужно изменить только эти конкретные параметры. Для этого выберите каждый ресурс, который вы хотите повторно импортировать в файловую систему. На вкладке импорта теперь будет флажок слева от каждого параметра импорта.

source: Select the checkbox of the parameters you want to change on your imported assets, then change the parameters normally. Finally, click the reimport button and every selected asset will be reimported with only those parameters changed.
fr: Cochez la case des paramètres que vous souhaitez modifier sur vos assets importés, puis modifiez les paramètres normalement. Enfin, cliquez sur le bouton de réimportation et chaque asset sélectionné sera réimporté avec uniquement les paramètres modifiés.
pt_br: Marque a caixa de seleção dos parâmetros que você deseja alterar nos seus assets importados e, em seguida, altere os parâmetros normalmente. Finalmente, clique no botão de reimportação e todos os assets selecionados serão reimportados apenas com esses parâmetros alterados.
ru: Установите флажок для параметров, которые вы хотите изменить в импортированных активах, затем измените параметры обычным образом. Наконец, нажмите кнопку повторного импорта, и каждый выбранный актив будет повторно импортирован с изменением только этих параметров.

source: Automatic reimport
fr: Réimportation automatique
pt_br: Reimportação Automática
ru: Автоматический реимпорт

source: When the MD5 checksum of the source asset changes, Godot will perform an automatic reimport of it, applying the preset configured for that specific asset.
fr: Lorsque que la somme de contrôle MD5 d’une ressource change, Godot effectuera une réimportation automatique de celle-ci, en appliquant les paramètres configurés pour cette ressource spécifique.
pt_br: Quando a soma de verificação MD5 do ativo de origem for alterada, Godot executará uma reimportação automática, aplicando a predefinição configurada para esse asset específico.
ru: Когда контрольная сумма MD5 исходного актива изменится, Godot выполнит его автоматический реимпорт, применив предустановку, настроенную для этого конкретного ассета.
uk: Коли контрольна сума MD5 вихідного ресурсу зміниться, Godot здійснить автоматичний повторний імпорт, застосувавши попередньо налаштований для цього конкретний ресурс.

source: Files generated
fr: Fichiers générés
pt_br: Arquivos gerados
ru: Генерируемые файлы
uk: Згенеровані файли

source: Importing will add an extra <asset>.import file, containing the import configuration. Make sure to commit these to your version control system!
fr: Importer ajoutera un fichier <asset>.import en plus, contenant la configuration d’importation. Veillez à bien versionner ceux-ci sur votre système de contrôle de version !
uk: Імпорт додасть додатковий файл <asset> .import, що містить конфігурацію імпорту. Не забудьте скористатись цією системою контролю версій!

source: Additionally, extra assets will be preset in the hidden res://.import folder:
fr: En outre, des ressources supplémentaires seront prédéfinies dans le dossier caché res://.import :
uk: Крім того, додаткові активи будуть встановлені в прихованій теці res://.import:

source: If any of the files present in this folder is erased (or the whole folder), the asset or assets will be reimported automatically. As such, committing this folder to the version control system is optional. It can shorten reimporting time when checking out on another computer, but it takes considerably more space and transfer time. Pick your poison!
fr: Si l'un des fichiers présents dans ce dossier est effacé (ou le dossier entier), la ou les assets seront réimportées automatiquement. De la sorte, la validation de ce dossier sur le système de contrôle de version est facultative. Cela permet de gagner du temps sur la réimportation lors de la vérification sur un autre ordinateur, mais cela prend beaucoup plus de place et de temps de transfert. Choisissez votre poison !
pt_br: Se algum dos arquivos presentes nesta pasta for apagado (ou a pasta inteira), o asset ou assets serão reimportados automaticamente. Dessa forma, fazer o commit desta pasta para sistema de controle de versão é opcional. Pode poupar tempo na reimportação ao fazer o check-out em outro computador, mas leva consideravelmente mais espaço e tempo de transferência. Escolha seu veneno!
ru: Если какой-либо из файлов, имеющихся в этой папке, будет удален (или вся папка), ассет или ассеты будут повторно импортированы автоматически. Таким образом, фиксация этой папки в системе контроля версий не является обязательной. Это может сократить время повторного импорта при проверке на другом компьютере, но требует значительно больше места и времени передачи. Выбирайте свой яд!
uk: Якщо будь-який із файлів, присутніх у цій теці, буде стерто (або вся папка), актив, або активи, будуть повторно імпортовані автоматично. Таким чином, закріплення цієї папки в системі управління версіями не є обов'язковим. Це може скоротити час повторного імпорту при переході на інший комп'ютер, але це забирає значно більше місця та часу на передачу. Виберіть,що, з гіршого, для вас краще!

source: Changing import resource type
fr: Changer le type d’importation de ressource
pt_br: Alterando o tipo de recurso de importação
ru: Изменение типа ресурса импорта
uk: Зміна типу ресурсу імпорту

source: Some source assets can be imported as different types of resources. For this, select the relevant type of resource desired and press "Reimport":
fr: Certains assets sources peuvent être importés comme différent types de ressources. Pour cela, sélectionnez le type de ressource désiré et appuyez sur "Reimport" :
pt_br: Alguns assets de origem podem ser importados como tipos diferentes de recursos. Para isso, selecione o tipo relevante de recurso desejado e pressione "Reimportar":
ru: Некоторые исходники ассетов можно импортировать как ресурсы разных типов. Для этого выберите нужный тип ресурса и нажмите "Reimport":
uk: Деякі вихідні активи можна імпортувати як різні види ресурсів. Для цього виберіть потрібний тип потрібного ресурсу та натисніть «Reimport»:

source: Changing default import parameters
fr: Changer les paramètres d’importation par défaut
pt_br: Alterando parâmetros de importação padrão
ru: Изменение параметров импорта по умолчанию
uk: Зміна параметрів імпорту за замовчуванням

source: Different types of games might require different defaults. Changing the defaults per project can be achieved by using the "Preset.." Menu. Besides some resource types offering presets, the default setting can be saved and cleared too:
fr: Différent types de jeux peuvent nécessiter des valeurs par défaut différentes. Changer ces valeurs par défaut pour un projet peut être effectué en utilisant le menu "Pré-configuration". En plus de certains types de ressources offrant des pré-configurations, la configuration par défaut peut-être sauvées et remise à zéro aussi :
pt_br: Diferentes tipos de jogos podem exigir padrões diferentes. Alterar os padrões por projeto pode ser obtido usando o menu "Predefinição..". Além de alguns tipos de recursos que oferecem predefinições, a configuração padrão também pode ser salva e apagada:
ru: Для разных типов игр могут потребоваться разные значения по умолчанию. Изменить настройки по умолчанию для каждого проекта можно с помощью меню "Preset..". Помимо некоторых типов ресурсов, предлагающих предустановки, можно сохранить и очистить настройку по умолчанию:
uk: Для різних типів ігор можуть знадобитися різні параметри за замовчуванням. Їх зміна для кожного проекту може бути досягнута за допомогою меню "Попередньо .." ("Preset.."). Окрім деяких типів ресурсів, які пропонують свої попередні параметри, ці параметри також можна зберегти та очистити:

source: Simplicity is key!
fr: La simplicité est la clé !
pt_br: Simplicidade é a chave!
ru: Простота - ключ к успеху!
uk: Простота є ключем!

source: This is a very simple workflow which should take very little time to get used to. It also enforces a more correct way to deal with resources.
fr: C'est un flux de travail très simple qui devrait prendre très peu de temps pour s'y habituer. Il impose également une manière plus adéquate de gérer les ressources.
pt_br: Este é um fluxo de trabalho muito simples, que deve levar muito pouco tempo para se acostumar. Também impõe uma maneira mais correta de lidar com recursos.
ru: Это очень простой рабочий процесс, к которому можно очень быстро привыкнуть. Это также обеспечивает более правильный способ обращения с ресурсами.
uk: Це дуже простий процес, до якого легко звикнути. Він також застосовує більш правильний спосіб поводження з ресурсами.

source: There are many types of assets available for import, so please continue reading to understand how to work with all of them!
fr: Il existe de nombreux types de ressources disponibles pour l’importation, alors continuez à lire pour comprendre comment les utiliser !
pt_br: Existem muitos tipos de recursos disponíveis para importação, portanto, continue lendo para entender como trabalhar com todos eles!
ru: Для импорта доступно множество типов ресурсов, поэтому продолжайте читать, чтобы понять, как работать со всеми из них!
uk: Є багато видів активів, доступних для імпорту, тому, будь ласка, читайте далі, щоб зрозуміти, як працювати з усіма ними!

source: In Godot 3.0+, we use a more modern approach to importing: Simply drop your assets (image files, scenes, audio files, fonts, etc) directly in the project folder (copy them manually with your OS file explorer). Godot will automatically import these files internally and keep the imported resources hidden in a ``res://.import`` folder.
ru: В Godot 3.0+ мы используем более современный подход к импорту: просто перетащите необходимые объекты (файлы изображений, сцены, аудиофайлы, шрифты и т.д.) прямо в папку проекта (или скопируйте их вручную с помощью проводника файлов ОС). Godot автоматически импортирует эти файлы и сохранит их в папке res: //.import.

source: Importing will add an extra ``<asset>.import`` file, containing the import configuration. Make sure to commit these to your version control system!
ru: Импорт добавит дополнительный файл ``<asset>.import``, содержащий конфигурацию импорта. Не забудьте зафиксировать их в вашей системе контроля версий!

source: Additionally, extra assets will be preset in the hidden ``res://.import`` folder:
ru: Кроме того, дополнительные ассеты будут предустановлены в скрытой папке ``res://.import``:

source: In Godot 3.0, we use a more modern approach to importing: Simply drop your assets (image files, scenes, audio files, fonts, etc) directly in the project folder (copy them manually with your OS file explorer). Godot will automatically import these files internally and keep the imported resources hidden in a res://.import folder.
uk: У Godot 3.0 ми використовуємо більш сучасний підхід до імпорту: просто скиньте свої активи (файли зображень, сцени, аудіофайли, шрифти тощо) безпосередньо в теку проекту (скопіюйте їх вручну за допомогою програми провідника файлів ОС). Godot автоматично імпортує ці файли всередину і збереже імпортовані ресурси заховані у теці res://.import.

source: This allows changing all the import parameters transparently.
uk: Це дозволяє прозоро змінювати всі параметри імпорту.

source: Changing the import parameters of an asset in Godot (again, keep in mind import parameters are only present in non-native Godot resource types) is easy. Select the relevant resource in the filesystem dock:
uk: Зміна параметрів імпорту об'єкта в Godot (знову ж таки, пам'ятайте, що параметри імпорту присутні лише у нерідних типах ресурсів Godot) дуже проста. Виберіть відповідний ресурс на панелі Файлова система:
