Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/assets/importing_translations.po
Languages: uk

source: Importing translations
uk: Імпорт перекладів

source: Games and internationalization
uk: Ігри та інтернаціоналізація

source: The world is full of different languages and cultures, so nowadays games are released in several languages. To handle this, internationalized text must be supported in any modern game engine.
uk: Світ насичений різними мовами та культурами, тому сьогодні ігри випускаються кількома мовами. Щоб вирішити це, інтернаціоналізований текст повинен підтримуватися в будь-якому сучасному ігровому редакторі.

source: In regular desktop or mobile applications, internationalized text is usually located in resource files (or .po files for GNU stuff). Games, however, can use several orders of magnitude more text than applications, so they must support efficient methods for dealing with loads of multilingual text.
uk: У звичайних настільних, або мобільних додатках, інтернаціоналізований текст зазвичай розміщується у файлах ресурсів (або .po-файлах для GNU-матеріалів). Однак ігри можуть використовувати на кілька порядків більше тексту, ніж програми, тому вони повинні підтримувати ефективні методи розподілу завантаження багатомовного тексту.

source: There are two approaches to generate multilingual language games and applications. Both are based on a key:value system. The first is to use one of the languages as the key (usually English), the second is to use a specific identifier. The first approach is probably easier for development if a game is released first in English, later in other languages, but a complete nightmare if working with many languages at the same time.
uk: Існує два підходи до створення багатомовних мовних ігор та програм. Обидва базуються на системі ключ:значення. Перший полягає у використанні однієї з мов як ключової (зазвичай англійська), а другий - у використанні конкретного ідентифікатора. Перший підхід, ймовірно, простіший для розробки, якщо гра виходить спочатку англійською, а пізніше іншими мовами, але стає повним кошмаром, якщо спробувати працювати з багатьма мовами одночасно.

source: In general, games use the second approach and a unique ID is used for each string. This allows you to revise the text while it is being translated to other languages. The unique ID can be a number, a string, or a string with a number (it's just a unique string anyway).
uk: Загалом, ігри використовують другий підхід і для кожного рядка використовується унікальний ідентифікатор. Це дозволяє переглянути текст під час його перекладу на інші мови. Унікальний ідентифікатор може бути числом, рядком, або рядком з числом (все одно це просто унікальний рядок).

source: If you need a more powerful file format, Godot also supports loading translations written in the gettext ``.po`` format. See :ref:`doc_localization_using_gettext` for details.
uk: Якщо вам потрібен більш потужний формат файлу, Godot також підтримує завантаження перекладів, написаних у форматі ``.po``. Докладніше дивіться :ref:`doc_localization_using_gettext`.

source: Translation format
uk: Формат перекладу

source: To complete the picture and allow efficient support for translations, Godot has a special importer that can read CSV files. Most spreadsheet editors can export to this format, so the only requirement is that the files have a special arrangement. The CSV files **must** be saved with UTF-8 encoding without a `byte order mark <https://en.wikipedia.org/wiki/Byte_order_mark>`__.
uk: Щоб забезпечити ефективну підтримку перекладів, у Godot є спеціальний імпортер, який може читати файли CSV. Більшість редакторів електронних таблиць можуть експортувати в цей формат, тому єдиною вимогою є те, щоб файли мали спеціальне розташування. Файли CSV повинні зберігатися з кодуванням UTF-8 без `позначки порядку байтів <https://en.wikipedia.org/wiki/Byte_order_mark>`__.

source: By default, Microsoft Excel will always save CSV files with ANSI encoding rather than UTF-8. There is no built-in way to do this, but there are workarounds as described `here <https://stackoverflow.com/questions/4221176/excel-to-csv-with-utf8-encoding>`__.
uk: За замовчуванням Microsoft Excel завжди буде зберігати файли CSV з кодуванням ANSI, а не UTF-8. Не існує вбудованого способу уникнути цього, але існують способи обходу, які описано `тут <https://stackoverflow.com/questions/4221176/excel-to-csv-with-utf8-encoding>`__.

source: We recommend using `LibreOffice <https://www.libreoffice.org/>`__ or Google Sheets instead.
uk: Ми рекомендуємо замість цього використовувати `LibreOffice<https://www.libreoffice.org/>`__, або Google Sheets.

source: CSV files must be formatted as follows:
uk: Файли CSV повинні бути відформатовані таким чином:

source: keys
uk: Ключі

source: <lang1>
uk: <мова1>

source: <lang2>
uk: <мова2>

source: <langN>
uk: <моваN>

source: KEY1
uk: КЛЮЧ1

source: string
uk: текст

source: KEY2
uk: КЛЮЧ2

source: KEYN
uk: КЛЮЧN

source: The "lang" tags must represent a language, which must be one of the :ref:`valid locales <doc_locales>` supported by the engine. The "KEY" tags must be unique and represent a string universally (they are usually in uppercase, to differentiate from other strings). These keys will be replaced at runtime by the matching translated string. Note that the case is important, "KEY1" and "Key1" will be different keys. The top-left cell is ignored and can be left empty or having any content. Here's an example:
uk: Теги "мова" повинні представляти мову, яка повинна бути одним з :ref:`дійсних локалів<doc_locales>`, підтримуваних движком. Теги "КЛЮЧ" повинні бути унікальними і представляти собою всі тексти (вони зазвичай пишуться великими літерами, щоб відрізнятись від інших рядків). Ці ключі будуть замінені під час виконання відповідним перекладеним рядком. Зауважте, що "КЛЮЧ1" і "Kлюч1" будуть різними ключами. Верхня ліва комірка ігнорується і її можна залишити порожньою, або дати будь-який вміст. Ось приклад:

source: GREET
uk: ПРИВІТАТИ

source: ASK
uk: ЗАПИТАТИ

source: BYE
uk: ПРОЩАННЯ

source: QUOTE
uk: ЦИТАТА

source: The same example is shown below as a comma-separated plain text file, which should be the result of editing the above in a spreadsheet. When editing the plain text version, be sure to enclose with double quotes any message that contains commas, line breaks or double quotes, so that commas are not parsed as delimiters, line breaks don't create new entries and double quotes are not parsed as enclosing characters. Be sure to escape any double quotes a message may contain by preceding them with another double quote. Alternatively, you can select another delimiter than comma in the import options.
uk: Той самий зразок наведено нижче, як звичайний текстовий файл, розділений комами, який повинен бути результатом редагування вищевказаної таблиці. Редагуючи звичайну текстову версію, обов'язково огортайте подвійними лапками будь-яке повідомлення, що містить коми, розриви рядків, або подвійні лапки, щоб коми не розбиралися як роздільники, розриви рядків не створювали нових записів, а подвійні лапки не розглядалися, як огортаючі символи. Не забудьте загорнути подвійні лапки, які може містити повідомлення, ще однією парою подвійних лапок. Також, ви можете вибрати інший роздільник, замість кома, у параметрах імпорту.

source: CSV importer
uk: Імпортування CSV

source: Godot will treat CSV files as translations by default. It will import them and generate one or more compressed translation resource files next to it.
uk: Godot, за замовчуванням, розглядає файли CSV, як переклади. Він імпортує їх і генерує один, або кілька, стислих файлів ресурсів перекладу поруч.

source: Importing will also add the translation to the list of translations to load when the game runs, specified in project.godot (or the project settings). Godot allows loading and removing translations at runtime as well.
uk: Імпорт також додасть переклад до списку перекладів, який завантажуватиметься під час запуску гри, як зазначено у project.godot (або в налаштуваннях проєкту). Godot дозволяє також завантажувати та видаляти переклади під час виконання.

source: Select the ``.csv`` file and access the **Import** dock to define import options. You can toggle the compression of the imported translations, and select the delimiter to use when parsing the CSV file.
uk: Виберіть ``.csv`` файл та перейдіть до панелі **Імпорт**, щоб визначити параметри імпорту. Ви можете переключити стиснення імпортованих перекладів та вибрати роздільник, який використовуватиметься при розборі файлу CSV.

source: Be sure to click **Reimport** after any change to these options.
uk: Не забудьте натиснути **Reimport** (Переімпортувати) після будь-яких змін цих параметрів.
