Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/assets/importing_audio_samples.po
Languages: cs, ja, zh_tw

source: Importing audio samples
cs: Import zvukových vzorků
ja: オーディオサンプルのインポート
zh_tw: 匯入音訊取樣

source: Why import?
ja: インポートする理由は?
zh_tw: 為何要匯入？

source: Raw audio data in general is large and undesired. Godot provides two main options to import your audio data: WAV and Ogg Vorbis.
ja: 一般に生のオーディオデータは大きく、望ましくありません。Godot は、オーディオ データをインポートするための2つの主要なオプションを提供します: WAV と Ogg Vorbisです。
zh_tw: 原始音訊檔通常都很大，而且我們通常都不會想用原始檔。Godot 中提供了兩個主要選項來匯入音訊資料：WAV 與 Ogg Vorbis。

source: Each has different advantages.
cs: Každý má jiné výhody.
ja: それぞれに異なる利点があります。
zh_tw: 各有優點。

source: WAV files use raw data or light compression, make few demands on the CPU to play back (hundreds of simultaneous voices in this format are fine), but take up significant space.
ja: WAVファイルは非圧縮データまたは軽い圧縮のデータを使用し、再生時にさほどCPUの処理能力を要求しませんが(この形式の何百もの同時音声でも問題ありません)、かなりのスペースを占有します。
zh_tw: WAV 檔使用原始資料或輕度壓縮，播放時不太吃 CPU (使用該格式可同時播放數百個聲音)，但該檔案格式會佔用許多空間。

source: Ogg Vorbis files use a stronger compression that results in much smaller file size, but require significantly more processing power to play back.
cs: Soubory Ogg Vorbis používají silnější kompresi, která vede k mnohem menší velikosti souboru, k přehrávání však vyžadují podstatně větší výpočetní výkon.
ja: Ogg Vorbisファイルは強力な圧縮を使用しているため、ファイルサイズははるかに小さくなりますが、再生にはかなり多くの処理能力が必要です。
zh_tw: Ogg Vorbis 檔使用強力壓縮，因此檔案大小較小，但需要更多的效能才能播放。

source: Here is a comparative chart.
cs: Zde je srovnávací tabulka.
ja: 比較グラフを次に表示します。
zh_tw: 下列為比較圖表。

source: Format
cs: Formát
ja: フォーマット
zh_tw: 格式

source: 1 second of audio
cs: 1 sekunda zvuku
ja: 1秒間のオーディオ
zh_tw: 1 秒的音訊

source: WAV 24-bit, 96 kHz, stereo
ja: WAV 24ビット、96 kHz、ステレオ
zh_tw: WAV 24 位元, 96 kHz, 立體聲

source: WAV 16-bit, 44 kHz, mono
ja: WAV 16ビット、44 kHz、モノラル
zh_tw: WAV 16 位元, 44 kHz, 單聲道

source: WAV 16-bit, IMA-ADPCM, mono
ja: WAV 16ビット、IMA-ADPCM、モノラル
zh_tw: WAV 16 位元, IMA-ADPCM, 單聲道

source: Ogg Vorbis 128 Kb/s, stereo
ja: Ogg Vorbis 128 Kb/s、ステレオ
zh_tw: Ogg Vorbis 128 Kb/秒, 立體聲

source: Ogg Vorbis 96 Kb/s, stereo
ja: Ogg Vorbis 96 Kb/s、ステレオ
zh_tw: Ogg Vorbis 96Kb/秒, 立體聲

source: Consider using WAV for short and repetitive sound effects, and Ogg Vorbis for music, speech, and long sound effects.
cs: Zvažte použití formátu WAV pro krátké a opakující se zvukové efekty a formátu Ogg Vorbis pro hudbu, řeč a dlouhé zvukové sekvence.
ja: 短い繰り返しのサウンドエフェクトにはWAVを使用し、音楽、音声、および長いサウンドエフェクトにはOgg Vorbisを使用することを検討してください。
zh_tw: 建議將 WAV 用於短的重複音效，而 Ogg Vorbis 則用於音樂、語音與長音效。

source: Best practices
cs: Osvědčené postupy
ja: ベストプラクティス
zh_tw: 最佳實踐

source: Godot has an :ref:`extensive bus system <doc_audio_buses>` with built-in effects. This saves SFX artists the need to add reverb to the sound effects, reducing their size greatly and ensuring correct trimming. Say no to SFX with baked reverb!
cs: Godot má :ref:`rozsáhlý systém sběrnic <doc_audio_buses>` s vestavěnými efekty. Díky tomu nemusí tvůrci SFX přidávat ke zvukovým efektům dozvuk, což výrazně snižuje jejich velikost a zajišťuje správné ořezání. Řekněte ne SFX se zabudovaným dozvukem!
ja: Godotには、組み込みのエフェクトを持つ :ref:`豊富なバスシステム <doc_audio_buses>`があります。これにより、SFXアーティストはサウンドエフェクトにリバーブを追加する必要がなくなり、サイズを大幅に削減し、適切なトリミングを確保できます。SFXのベイクドリバーブにノーと言いましょう！
zh_tw: Godot 中有自帶許多特效的 :ref:`豐富匯流排系統 <doc_audio_buses>` 。得益於該系統，SFX 藝術家便無需在音效檔中處理殘響，可有效降低檔案大小並能確保剪輯正確。再也不需要烘焙殘響 SFX 了！

source: As you can see above, sound effects become huge with reverb added.
cs: Jak vidíte výše, zvukové efekty se po přidání dozvuku stanou obrovskými.
ja: このように、リバーブを追加するとサウンド効果が大きくなります。
zh_tw: 就像這樣，包含殘響的音效檔變得很大。

source: Trimming
cs: Ořezávání
ja: トリミング
zh_tw: Trimming - 剪裁

source: One issue that happens often is that the waveform is exported with long silences at the beginning and at the end. These are inserted by DAWs when saving to a waveform, increase their size unnecessarily and add latency to the moment they are played back.
cs: Často se stává, že se křivka zvuku exportuje s dlouhým tichem na začátku a na konci. Ty vkládají DAW při ukládání tvaru zvukové vlny, zbytečně zvětšují její velikost a přidávají zpoždění v okamžiku přehrávání.
ja: 頻繁に発生する問題の1つは、サウンドの前後に長い無音が含まれた状態でエクスポートされることです。これらは、サンドを保存するときにDAWによって挿入され、不必要にサイズを大きくし、再生に発音の遅延を起こします。
zh_tw: 音訊檔前後有很長一段無聲音的時間也是其中一種常見問題。這段無聲的時間通常是由 DAW 在保存波形時插入的，這會導致檔案大小沒必要地增加，並讓播放時產生延遲。

source: Importing as WAV with the **Trimming** option enabled solves this.
cs: Import jako WAV s povolenou možností **Ořezávání** to řeší.
ja: **トリミング(Trim)** オプションを有効にしてWAVとしてインポートすると、この問題が解決されます。
zh_tw: 匯入 WAV 時開啟 **Trimming** 選項可解決此問題。

source: Looping
cs: Smyčka
ja: ループ(Loop)
zh_tw: Looping - 循環

source: Godot supports looping in the samples (tools such as Sound Forge or Audition can add loop points to WAV files). This is useful for sound effects, such as engines, machine guns etc. Ping-pong looping is also supported.
cs: Godot podporuje vytváření smyček v samplerech (nástroje jako Sound Forge nebo Audition umí do souborů WAV přidávat body smyčky). To je užitečné pro zvukové efekty, jako jsou motory, kulomety atd. Podporována je také smyčka ping-pong.
ja: Godotはサンプルのループをサポートしています。(Sound Forgeや AuditionはWAVファイルにループポイントを追加する事が出来ます)。これは、エンジンやマシンガン等のサウンドエフェクトに有用です。ピンポンループもサポートしています。
zh_tw: Godot 中支援在取樣中循環 (如 Soud Forge 或 Audition 等工具可以在 WAV 檔插入循環點)。適用於音效，如引擎或機械槍等聲音。另也支援乒乓式循環 (Ping-pong)。

source: As an alternative, the Import dock has a **Loop** option that enables looping for the entire sample when importing.
cs: Alternativou je možnost **Smyčka** v dokovací stanici Import, která při importu povolí opakování celého vzorku.
ja: 別の方法として、インポート画面には\ **ループ(Loop)**\ オプションがあり、インポート時にサンプル全体のループを有効にします。
zh_tw: 此外，匯入 Dock 中的 **Loop** 選項也可用於在匯入時開啟整段取樣的循環。

source: Supported files
cs: Podporované soubory

source: Godot provides three options to import your audio data: WAV, Ogg Vorbis and MP3.
cs: Godot nabízí tři možnosti importu zvukových dat: WAV, Ogg Vorbis a MP3.

source: WAV files use raw data or light compression (IMA-ADPCM). They are lightweight on the CPU to play back (hundreds of simultaneous voices in this format are fine). The downside is that they take up a lot of disk space.
cs: Soubory WAV používají surová data nebo lehkou kompresi (IMA-ADPCM). Jejich přehrávání je nenáročné na procesor (v tomto formátu lze přehrávat stovky hlasů současně). Nevýhodou je, že zabírají hodně místa na disku.

source: MP3 files use better compression than WAV with IMA-ADPCM, but worse than Ogg Vorbis. This means that a MP3 file with roughly equal quality to Ogg Vorbis will be significantly larger. On the bright side, MP3 requires less CPU usage to play back compared to Ogg Vorbis. This makes MP3 useful for mobile and HTML5 projects where CPU resources are limited, especially when playing multiple compressed sounds at the same time (such as long ambient sounds).
cs: Soubory MP3 používají lepší kompresi než WAV s IMA-ADPCM, ale horší než Ogg Vorbis. To znamená, že soubor MP3 s přibližně stejnou kvalitou jako Ogg Vorbis bude výrazně větší. Pozitivní je, že MP3 vyžaduje při přehrávání menší využití procesoru než Ogg Vorbis. Díky tomu je formát MP3 užitečný pro mobilní projekty a projekty HTML5, kde jsou prostředky procesoru omezené, zejména při přehrávání více komprimovaných zvuků najednou (například dlouhých zvuků prostředí).
