Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/assets/importing_images.po
Languages: cs, de, fr, ja, ru, uk

source: Importing images
cs: Import obrázků
de: Bilder importieren
fr: Importer des images
ru: Импортирование изображений
uk: Імпортування зображень

source: Supported image formats
cs: Podporované formáty obrázků
de: Unterstützte Bildformate
fr: Formats d'image pris en charge
ru: Поддерживаемые форматы изображения
uk: Підтримувані формати зображень

source: Godot can import the following image formats:
cs: Godot umí importovat následující formáty obrázků:
de: Godot unterstützt die folgenden Bildformate:
fr: Godot peut importer les formats d'image suivants :
ru: Godot может импортировать данные форматы изображения:
uk: Godot може імпортувати такі формати зображень:

source: BMP (``.bmp``) - No support for 16-bit per pixel images. Only 1-bit, 4-bit, 8-bit, 24-bit, and 32-bit per pixel images are supported.
cs: BMP (``.bmp``) - Nepodporuje 16bit per pixel. Podporovány jsou pouze obrázky s 1bit, 4bit, 8bit, 24bit a 32bit per pixel.
de: BMP (``.bmp``) - Keine Unterstützung für Bilder mit 16 Bit pro Pixel. Es werden nur Bilder mit 1 Bit, 4 Bit, 8 Bit, 24 Bit und 32 Bit pro Pixel unterstützt.
ru: BMP (``.bmp``) - не поддерживает изображения с разрешением 16 бит на пиксель. Поддерживаются только 1-битные, 4-битные, 8-битные, 24-битные и 32-битные.
uk: BMP (``.bmp``) - Немає підтримки 16-бітових зображень на піксель. Підтримуються лише 1-бітні, 4-бітові, 8-бітові, 24-бітові та 32-бітні зображення на піксель.

source: DirectDraw Surface (``.dds``) - If mipmaps are present in the texture, they will be loaded directly. This can be used to achieve effects using custom mipmaps.
cs: DirectDraw Surface (``.dds``) - Pokud jsou v textuře přítomny mipmapy, načtou se přímo. Toho lze využít k dosažení efektů pomocí vlastních mipmap.
de: DirectDraw Surface (``.dds``) - Wenn Mipmaps in der Textur vorhanden sind, werden sie direkt geladen. Dies kann verwendet werden, um Effekte mit benutzerdefinierten Mipmaps zu erzielen.
fr: DirectDraw Surface (``.dds``) - Si des mipmaps sont présents dans la texture, ils seront chargés directement. Cela peut être utilisé pour obtenir des effets à l'aide de mipmaps personnalisés.
ru: DirectDraw Surface (``.dds``) - если MIP-карты присутствуют в текстуре, они будут загружены напрямую. Это можно использовать для достижения эффектов с помощью настраиваемых MIP-карт.
uk: DirectDraw Surface (`` .dds``) - Якщо в текстурі є mipmaps, вони будуть завантажені безпосередньо. Це можна використовувати для досягнення ефектів за допомогою спеціальних карт.

source: OpenEXR (``.exr``) - Supports HDR (highly recommended for panorama skies).
cs: OpenEXR (``.exr``) - Podporuje HDR (velmi doporučeno pro panoramatickou oblohu).
de: OpenEXR (``.exr``) - Unterstützt HDR (sehr empfohlen für Panoramahimmel).
fr: OpenEXR (``.exr``) - Supporte le HDR (fortement recommandé pour les ciels panoramiques).
ru: OpenEXR (``.exr``) - поддерживает HDR (настоятельно рекомендуется для панорамного неба).
uk: OpenEXR ( ``.exr``) - підтримує HDR (дуже рекомендується для панорамного неба).

source: Radiance HDR (``.hdr``) - Supports HDR (highly recommended for panorama skies).
cs: Radiance HDR (``.hdr``) - Podporuje HDR (velmi doporučeno pro panoramatickou oblohu).
de: Radiance HDR (``.hdr``) - Unterstützt HDR (sehr empfohlen für Panoramahimmel).
fr: Radiance HDR (``.hdr``) - Supporte le HDR (fortement recommandé pour les ciels panoramiques).
ru: OpenEXR (``.exr``) - поддерживает HDR (настоятельно рекомендуется для панорамного неба).
uk: Radiance HDR ( ``.hdr``) - підтримує HDR (дуже рекомендується для панорамного неба).

source: JPEG (``.jpg``, ``.jpeg``) - Doesn't support transparency per the format's limitations.
cs: JPEG (``.jpg``, ``.jpeg``) - Nepodporuje průhlednost podle omezení formátu.
de: JPEG (``.jpg``, ``.jpeg``) - Unterstützt aufgrund der Einschränkungen des Formats keine Transparenz.
fr: JPEG (``.jpg``, ``.jpeg``) - Ne supporte pas la transparence en raison des limitations du format.
ru: JPEG (``.jpg``, ``.jpeg``) - не поддерживает прозрачность в соответствии с ограничениями формата.
uk: JPEG ( ``.jpg``, ``.jpeg``) - не підтримує прозорість відповідно до обмежень формату.

source: PNG (``.png``) - Precision is limited to 8 bits per channel upon importing (no HDR images).
cs: PNG (``.png``) - přesnost je při importu omezena na 8 bitů na kanál (žádné obrázky HDR).
de: PNG (``.png``) - Die Genauigkeit ist beim Import auf 8 Bit pro Kanal begrenzt (keine HDR-Bilder).
fr: PNG (``.png``) - La précision est limitée à 8 bits par canal lors de l'importation (pas d'images HDR).
ru: PNG (``.png``) - точность при импорте ограничена 8 битами на канал (без изображений HDR).
uk: PNG ( ``.png``) - Точність обмежена 8 бітами на канал при імпорті (без HDR-зображень).

source: SVG (``.svg``, ``.svgz``) - SVGs are rasterized using `NanoSVG <https://github.com/memononen/nanosvg>`__ when importing them. Support is limited; complex vectors may not render correctly. For complex vectors, rendering them to PNGs using Inkscape is often a better solution. This can be automated thanks to its `command-line interface <https://wiki.inkscape.org/wiki/index.php/Using_the_Command_Line#Export_files>`__.
cs: SVG (``.svg``, ``.svgz``) - SVG jsou při importu rastrovány pomocí `NanoSVG <https://github.com/memononen/nanosvg>`__. Podpora je omezená; složité vektory se nemusí vykreslovat správně. Pro složité vektory je často lepším řešením jejich vykreslení do PNG pomocí aplikace Inkscape. To lze automatizovat díky jeho rozhraní příkazového řádku <https://wiki.inkscape.org/wiki/index.php/Using_the_Command_Line#Export_files>`__.
de: SVG (``.svg``, ``.svgz``) - SVGs werden beim Importieren mit `NanoSVG <https://github.com/memononen/nanosvg>`__ gerastert. Die Unterstützung ist begrenzt; komplexe Vektoren werden möglicherweise nicht korrekt gerendert. Für komplexe Vektoren ist das Rendern in PNGs mit Inkscape oft die bessere Lösung. Dies kann dank der `Befehlszeilenschnittstelle <https://wiki.inkscape.org/wiki/index.php/Using_the_Command_Line#Export_files>`__ automatisiert werden.
fr: SVG (``.svg``, ``.svgz``) - Les SVG sont rastérisés en utilisant `NanoSVG <https://github.com/memononen/nanosvg>`__ lors de leur importation. Le soutien est limité ; les vecteurs complexes peuvent ne pas être rendus correctement. Pour les vecteurs complexes, les rendre en PNGs en utilisant Inkscape est souvent une meilleure solution. Ceci peut être automatisée grâce à son interface en ligne de commande <https://wiki.inkscape.org/wiki/index.php/Using_the_Command_Line#Export_files>`__.
ru: SVG (``.svg``, ``.svgz``) - SVG растеризируются с использованием `NanoSVG <https://github.com/memononen/nanosvg>` __ при их импорте. Поддержка ограничена; сложные векторы могут отображаться некорректно. Для сложных векторов их рендеринг в PNG с помощью Inkscape часто оказывается лучшим решением. Это можно автоматизировать благодаря интерфейсу командной строки `<https://wiki.inkscape.org/wiki/index.php/Using_the_Command_Line#Export_files>` __.
uk: SVG (`` .svg``, ``.svgz``) - SVG-файли растерізуються за допомогою `NanoSVG <https://github.com/memononen/nanosvg>`__ при їх імпорті. Підтримка обмежена; складні вектори можуть відображатися неправильно. Для складних векторів рендеринг їх у PNG за допомогою Inkscape часто є кращим рішенням. Це можна автоматизувати завдяки `інтерфейсу командного рядка<https://wiki.inkscape.org/wiki/index.php/Using_the_Command_Line#Export_files>`__ .

source: If you've compiled the Godot editor from source with specific modules disabled, some formats may not be available.
cs: Pokud jste editor Godot zkompilovali ze zdrojových kódů s vypnutými specifickými moduly, některé formáty nemusí být k dispozici.
de: Wenn Sie den Godot-Editor aus dem Quellcode mit deaktivierten Modulen kompiliert haben, sind einige Formate möglicherweise nicht verfügbar.
fr: Si vous avez compilé l'éditeur Godot à partir de la source avec des modules spécifiques désactivés, certains formats peuvent ne pas être disponibles.
ru: Если вы скомпилировали редактор Godot из исходного кода с отключенными определенными модулями, некоторые форматы могут быть недоступны.
uk: Якщо ви скомпілювали редактор Godot з початкових кодів з вимиканням певних модулів, робота з деякими форматами може бути недоступною.

source: Importing textures
cs: Import textur
de: Texturen importieren
fr: Importer des textures
ru: Импортирование текстур
uk: Імпортування текстур

source: The default action in Godot is to import images as textures. Textures are stored in video memory and can't be accessed directly. This is what makes drawing them efficient.
cs: Výchozí akcí v systému Godot je import obrázků jako textur. Textury jsou uloženy ve video paměti a nelze k nim přistupovat přímo. Díky tomu je jejich kreslení efektivní.
de: Die Standardaktion in Godot besteht darin, Bilder als Texturen zu importieren. Texturen werden im Videospeicher gespeichert und man kann nicht direkt darauf zugreifen. Dies macht das Zeichnen effizient.
fr: L'action par défaut dans Godot consiste à importer des images sous forme de textures. Ces textures sont stockées dans la mémoire vidéo et ne sont pas accessibles directement. C'est ce qui permet de les dessiner efficacement.
ja: Godotのデフォルトのアクションは、イメージをテクスチャとして読み込む方法です。テクスチャはビデオメモリに格納され、直接アクセスすることはできません。これがそれらを効率的に描く理由です。
ru: Действие по умолчанию в Godot - импортировать изображения в виде текстур. Текстуры хранятся в видеопамяти и не могут быть доступны напрямую. Это то, что делает их рисование более эффективным.
uk: За замовчуванням Godot імпортує зображення у вигляді текстур. Текстури зберігаються у відеопам'яті але не можна отримати до них доступ безпосередньо. Саме завдяки цьому вони вимальовуються ефективно.

source: Import options are vast:
cs: Možnosti importu jsou rozsáhlé:
de: Die Importmöglichkeiten sind riesig:
fr: Les options d’importation sont vastes :
ja: インポートオプションは豊富です:
ru: Возможности импорта обширны:
uk: Варіантів імпорту дуже багато:

source: Detect 3D
cs: Detekovat 3D
fr: Détection 3D
ja: 3Dの検出
uk: Виявити 3D (Detect 3D)

source: This option makes Godot be aware of when a texture (which is imported for 2D as default) is used in 3D. If this happens, setting are changed so the texture flags are friendlier to 3D (mipmaps, filter and repeat become enabled and compression is changed to VRAM). Texture is also reimported automatically.
cs: Tato volba umožňuje Godotu zjistit, kdy je textura (která je ve výchozím nastavení importována pro 2D) použita ve 3D. Pokud k tomu dojde, změní se nastavení tak, aby příznaky textury byly přívětivější pro 3D (povolí se mipmapy, filtr a opakování, komprese se změní na VRAM). Textura se také automaticky znovu importuje.
de: Diese Option zeigt Godot an, wann eine Textur (die standardmäßig für 2D importiert wird) in 3D verwendet wird. In diesem Fall werden die Einstellungen geändert, damit die Texturflags 3D-freundlicher sind (Mipmaps, Filter und Wiederholung werden aktiviert und die Komprimierung wird in VRAM geändert). Die Textur wird ebenfalls automatisch wieder importiert.
fr: Cette option permet à Godot de savoir qu'une texture (importée pour la 2D en tant que défaut) est utilisée en 3D. Si cela se produit, les paramètres sont modifiés pour que les indicateurs de texture soient plus conviviaux pour la 3D (les mipmaps, les filtres et les répétitions sont activés et la compression est modifiée sur VRAM). La texture est également réimportée automatiquement.
ja: このオプションを使用すると、3Dでテクスチャ(これはデフォルトとして2D用にインポートされます)が使用されていることをGodotに認識させることができます。この場合、設定が変更され、テクスチャフラグが3D(ミップマップ、フィルタ、および繰り返しが有効になり、圧縮がVRAMに変更されます)によりわかりやすくなります。テクスチャも自動的に再読み込みされます。
ru: Эта опция позволяет Godot знать, когда текстура (которая по умолчанию импортируется для 2D) используется в 3D. В этом случае настройки изменяются, поэтому флаги текстуры более удобны для 3D (MIP-карты, фильтр и повтор включаются, а сжатие изменяется на VRAM). Текстура также повторно импортируется автоматически.
uk: Цей параметр дає Godot знати про те, коли текстура (яка за замовчуванням імпортується для 2D) використовується в 3D. Якщо це трапиться, налаштування змінюються, щоб текстурні прапори були більш привітними до 3D (mipmaps, фільтрувати та повторюватись ввімкнено, а стиснення змінено на VRAM). Текстура також повторно імпортується автоматично.

source: Compression
cs: Komprese
de: Kompression
ru: Сжатие
uk: Стиснення

source: Images are one of the largest assets in a game. To handle them efficiently, they need to be compressed. Godot offers several compression methods, depending on the use case.
cs: Obrázky jsou jedním z největších zdrojů ve hře. Aby se s nimi dalo efektivně pracovat, je třeba je komprimovat. Godot nabízí několik metod komprese v závislosti na případu použití.
de: Bilder sind einer der größten Nutzerinhalte in einem Spiel. Um sie effizient verarbeiten zu können, müssen sie komprimiert werden. Godot bietet je nach Anwendungsfall mehrere Komprimierungsverfahren an.
fr: Les images sont parmi les plus nombreuses ressources d'un jeu. Pour les gérer efficacement, elles doivent être compressées. Godot propose plusieurs méthodes de compression, en fonction du cas d'utilisation.
ja: 画像は、ゲーム内で最大のアセットの 1 つです。それらを効率的に処理するには、圧縮する必要があります。Godot は、ユースケースに応じて、いくつかの圧縮方法を提供します。
ru: Изображения - одни из важнейших активов в игре. Чтобы справиться с ними эффективно, их нужно сжать. Godot предлагает несколько методов сжатия в зависимости от варианта использования.
uk: Зображення є одним з найбільших активів у грі. Для ефективності їх потрібно стиснути. Godot пропонує кілька методів стиснення, залежно від випадку використання.

source: Compress Mode
cs: Režim komprese
de: Kompressionsmodus
fr: Mode de compression
ja: 圧縮モード
ru: Compress Mode (режим сжатия)
uk: Режим стиснення

source: **VRAM Compression:** This is the most common compression mode for 3D assets. Size on disk is reduced and video memory usage is also decreased considerably (usually by a factor between 4 and 6). This mode should be avoided for 2D as it exhibits noticeable artifacts.
cs: **Komprese VRAM:** Jedná se o nejběžnější režim komprese pro 3D zdroje. Zmenší se velikost na disku a výrazně se sníží i využití videopaměti (obvykle 4 až 6krát). Tomuto režimu byste se měli vyhnout pro 2D, protože vykazuje znatelné artefakty.
de: **VRAM-Komprimierung:** Dies ist der gebräuchlichste Komprimierungsmodus für 3D-Assets. Die Größe auf der Festplatte wird reduziert, und auch die Nutzung des Videospeichers wird erheblich verringert (normalerweise um einen Faktor zwischen 4 und 6). Dieser Modus sollte für 2D vermieden werden, da er auffällige Artefakte aufweist.
fr: **VRAM Compression :** C'est le mode de compression le plus courant pour les assets 3D. Le fichier sur le disque est réduit et l'utilisation de la mémoire vidéo est considérablement réduite également (généralement d'un facteur compris entre 4 et 6). Ce mode doit être évité pour le 2D car il présente des artefacts visibles.
ru: **Сжатие VRAM:** Это наиболее распространенный режим сжатия для 3D-ресурсов. Размер на диске уменьшается, и использование видеопамяти также значительно уменьшается (обычно в 4–6 раз). Этого режима следует избегать для 2D, поскольку он демонстрирует заметные артефакты.
uk: **Стиснення VRAM:** (VRAM Compression) Це найпоширеніший режим стиснення для об'єктів 3D. Розмір на диску зменшується, використання відеопам'яті також значно зменшується (зазвичай на 4 - 6). Цього режиму слід уникати для 2D, через виникнення помітних спотворень.

source: **Lossless Compression:** This is the most common compression mode for 2D assets. It shows assets without any kind of artifacting, and disk compression is decent. It will use considerably more amount of video memory than VRAM Compression, though. This is also the recommended setting for pixel art.
cs: **Bezztrátová komprese:** Jedná se o nejběžnější režim komprese pro 2D zdroje. Zobrazuje obrázky bez jakýchkoli artefaktů a komprese na disku je slušná. Využije však podstatně více videopaměti než komprese VRAM. Jedná se také o doporučené nastavení pro pixel art.
de: **Verlustfreie Komprimierung:** Dies ist der gebräuchlichste Komprimierungsmodus für 2D-Assets. Er zeigt Assets ohne jegliche Art von Artefakten an, und die Festplattenkomprimierung ist anständig. Sie benötigt jedoch wesentlich mehr Videospeicher als die VRAM-Komprimierung. Dies ist auch die empfohlene Einstellung für Pixelkunst.
fr: **Lossless Compression :** C'est le mode de compression le plus courant pour les assets 2D. Il montre les assets sans aucune sorte d'artefact, et la compression sur le disque est décente. Cela utilisera cependant une quantité de mémoire vidéo considérablement plus importante que la compression VRAM. C'est également le réglage recommandé pour l'art au pixel.
ru: **Lossless Compression:** (сжатие без потерь). Это наиболее распространенный режим сжатия для 2D-ресурсов. Он показывает активы без каких-либо артефактов, а сжатие на диске приличное. Однако он будет использовать значительно больше видеопамяти, чем сжатие VRAM. Это рекомендуемый параметр для пиксельной графики.
uk: **Стиснення без втрат:** (Lossless Compression) це найпоширеніший режим стиснення для 2D активів. Він показує активи без будь-яких спотворень, при пристойному зменшенні об'єму використовуваної пам'яті диску. Однак він буде використовувати значно більше обсягу відеопам'яті, ніж VRAM Стиснення. Це також рекомендована настройка для піксельної графіки.

source: **Lossy Compression:** This is a good choice for large 2D assets. It has some artifacts, but less than VRAM and the file size is several times lower compared to Lossless or Uncompressed. Video memory usage isn't decreased by this mode; it's the same as with Lossless Compression or Uncompressed.
cs: **Zrátová komprese:** Tato možnost je vhodná pro velké 2D soubory. Má určité artefakty, ale menší než VRAM a velikost souboru je několikanásobně menší ve srovnání s bezztrátovou kompresí či nekomprimovanou položkou. Využití videopaměti se tímto režimem nesnižuje; je stejné jako u Bezztrátové komprese nebo Nekomprimovaného zdroje.
de: **Verlustbehaftete Komprimierung:** Dies ist eine gute Wahl für große 2D-Assets. Sie hat einige Artefakte, aber weniger als VRAM und die Dateigröße ist im Vergleich zu verlustlos oder unkomprimiert um ein Vielfaches geringer. Die Nutzung des Videospeichers wird durch diesen Modus nicht verringert; es ist derselbe wie bei der verlustfreien oder unkomprimierten Komprimierung.
fr: **Lossy Compression :** C'est un bon choix pour les grosses assets 2D. Il comporte quelques artefacts, mais moins que la VRAM et la taille du fichier est plusieurs fois inférieure à celle d'un fichier Lossless ou Uncompressed. L'utilisation de la mémoire vidéo n'est pas diminuée par ce mode ; c'est la même chose qu'avec la compression Lossless ou Uncompressed.
ru: **Lossy Compression:** (сжатие с потерями). Это хороший выбор для больших 2D-ресурсов. Он имеет некоторые артефакты, но меньше, чем VRAM, а размер файла в несколько раз меньше, чем у файлов без потерь или без сжатия. Использование видеопамяти в этом режиме не уменьшается; это то же самое, что и со сжатием без потерь или без сжатия.
uk: **Стиснення з втратами:** (Lossy Compression) це хороший вибір для великих 2D активів. Він має деякі спотворення, але менші, ніж VRAM, а розмір файлу в кілька разів менший порівняно з режимами Без втрат та Без стиснення. Цей режим не зменшує використання відеопам'яті; воно те саме, що і при стисненні Без втрат та Без стиснення.

source: **Uncompressed:** Only useful for formats that can't be compressed (such as raw float images).
cs: **Nekomprimované:** Užitečné pouze pro formáty, které nelze komprimovat (například surové obrázky typu float).
de: **Unkomprimiert:** Nur nützlich für Formate, die nicht komprimiert werden können (wie z.B. rohe Float-Bilder).
fr: **Uncompressed :** Uniquement utile pour les formats qui ne peuvent pas être compressés (comme les images flottantes brutes).
ru: **Uncompressed:** (без сжатия). Полезно только для форматов, которые нельзя сжать (например, необработанные изображения RAW).
uk: **Без стиснення:** (Uncompressed) корисний лише для форматів, які неможливо стиснути (наприклад, необроблені зображення).

source: In this table, each of the four options are described together with their advantages and disadvantages (|good| = best, |bad| = worst):
cs: V této tabulce jsou popsány všechny čtyři možnosti a jejich výhody a nevýhody (|dobrá| = nejlepší, |špatná| = nejhorší):
de: In dieser Tabelle wird jede der vier Optionen zusammen mit ihren Vor- und Nachteilen beschrieben (|gut| = beste, |schlecht| = schlechteste):
fr: Dans ce tableau, chacune des quatre options est décrite avec ses avantages et inconvénients (|bon| = Meilleur, |mauvais| = Pire) :
ru: В этой таблице каждый из четырех вариантов описан вместе с их преимуществами и недостатками (|хорошее| = лучшее, |плохое| = худшее):
uk: У цій таблиці описаний кожен із чотирьох варіантів разом із їхніми перевагами та недоліками (|good| = краще, |bad| = гірше):

source: Uncompressed
cs: Nekomprimované
de: unkomprimiert
fr: Non compressé
ja: 圧縮なし
ru: Несжатый
uk: Без стиснення

source: Compress VRAM
cs: Komprese VRAM
de: Komprimiert VRAM
fr: Compression VRAM
ja: VRAMを圧縮
uk: Стиснення VRAM

source: Description
cs: Popis
de: Beschreibung
ja: 説明
ru: Описание
uk: Опис

source: Stored as raw pixels
cs: Uloženo jako nezpracované obrazové body
de: Gespeichert als unbearbeitete Pixel
fr: Stocké sous forme de pixels bruts
ja: 未加工のピクセルとして保存
uk: Зберігається як сирі пікселі

source: Stored as S3TC/BC or PVRTC/ETC depending on platform
cs: Uloženo jako S3TC/BC nebo PVRTC/ETC v závislosti na platformě
de: Gespeichert als S3TC/BC oder PVRTC/ETC je nach Plattform
fr: Stocké en S3TC/BC ou PVRTC/ETC selon la plate-forme
ru: Сохраняется как S3TC/BC или PVRTC/ETC в зависимости от платформы
uk: Зберігається як S3TC/BC, або PVRTC/ETC, залежно від платформи

source: Size on Disk
cs: Velikost na disku
de: Größe auf Disk
fr: Taille sur le disque
ja: ディスク上のサイズ
ru: Размер на диске
uk: Розмір на диску

source: |bad| Large
cs: |bad| Velká
de: |bad| Groß
fr: |mauvais| Grand
ja: |悪い|大きい
ru: |плохо| Большой
uk: |bad| Багато

source: |regular| Small
cs: |regular| Malá
de: |regular| Klein
fr: |normal| Petit
ja: |普通|小さい
ru: |обычный| Маленький
uk: |regular| Мало

source: |good| Very Small
cs: |good| Velmi malá
de: |good| Sehr Klein
fr: |bon| Très petit
ja: |良い|非常に小さい
ru: |хороший| Очень маленький
uk: |good| Дуже Мало

source: Memory Usage
cs: Využití paměti
de: Speichernutzung
fr: Utilisation mémoire
ja: メモリ使用量
ru: Использование памяти
uk: Використання пам'яті

source: |good| Small
cs: |good| Malé
de: |good| Klein
fr: |bon| Petit
ja: |良い|小さい
ru: |хорошо| Маленький
uk: |good| Мало

source: Performance
cs: Výkon
de: Leistung
ja: パフォーマンス
ru: Производительность
uk: Швидкодія

source: |regular| Normal
cs: |regular| Normální
fr: |normal| Normal
ja: |普通|通常
ru: |обычный| Нормальный
uk: |regular| Нормально

source: |good| Fast
cs: |good| Rychlý
de: |good| Schnell
fr: |bon| Rapide
ja: |良い|高速
ru: |хорошо| Быстрый
uk: |good| Швидко

source: Quality Loss
cs: Ztráta kvality
de: Qualitätseinbußen
fr: Perte de qualité
ja: 品質損失
ru: Потеря качества
uk: Втрата якості

source: |good| None
cs: |good| Žádná
de: |good| Nichts
fr: |bon| Aucun
ja: |良い|なし
ru: |хорошо| Нет
uk: |good| Нема

source: |regular| Slight
cs: |retular| Mírná
de: |regular| Gering
fr: |normal| Léger
ja: |普通|わずか
ru: |обычно| Незначительно
uk: |regular| Трохи

source: |bad| Moderate
cs: |bad| Mírná
de: |bad| Mittelmäßig
fr: |mauvais| Modérer
ja: |悪い|中程度
ru: |плохо| Умеренно
uk: |bad| Помірно

source: Load Time
cs: Doba načítání
de: Ladezeit
fr: Temps de chargement
ja: 読み込み時間
ru: Время загрузки
uk: Час завантаження

source: |bad| Slow
cs: |bad| Pomalé
de: |bad| Langsam
fr: |mauvais| Lent
ja: |悪い|遅い
ru: |плохо| Медленно
uk: |bad| Повільно
