Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/physics_introduction.po
Languages: es, ko, ru

source: Physics introduction
es: Introducción a la física
ru: Введение в физику

source: In game development, you often need to know when two objects in the game intersect or come into contact. This is known as **collision detection**. When a collision is detected, you typically want something to happen. This is known as **collision response**.
es: En el desarrollo de videojuegos, muchas veces necesitarás saber cuando dos objetos se superponen o entran en contacto. Esto es conocido como **detección de colisiones**. Cuando una colisión es detectada, normalmente es deseable que algo suceda, esto es llamado **respuesta a la colisión**.
ru: При разработке игры часто нужно знать, когда два объекта в игре пересекаются или сталкиваются. Это называется **обнаружением столкновений**. При обнаружении столкновения, как правило, требуется, чтобы что-либо произошло. Это называется **реакцией на столкновение**.

source: Godot offers a number of collision objects in 2D and 3D to provide both collision detection and response. Trying to decide which one to use for your project can be confusing. You can avoid problems and simplify development if you understand how each works and what their pros and cons are.
es: Godot ofrece varios objetos de colisión en 2D y 3D para proveer tanto detección como respuesta a colisión. Tratar de decidir cuál utilizar para nuestro proyecto puede ser confuso al principio, para evitar problemas y simplificar el desarrollo, aquí presentamos mostramos las pros y contras de cada tipo de objeto.
ko: Godot는 충돌 감지와 반응을 모두 제공하기 위해 2D와 3D로 구성된 다수의 충돌 객체를 제공합니다. 프로젝트에 이 중 어떠한 것을 사용할지 결정하려는 것은 혼란스러울 수 있습니다. 하지만 각각의 작동 방식과 장단점을 이해한다면 이러한 문제를 피하고 개발을 간소화할 수 있습니다.
ru: Godot предлагает ряд объектов столкновений в 2D и 3D как для обнаружения столкновений, так и для реагирования на них. Определение, какие из них использовать в Вашем проекте, может оказаться сложным. Избежать проблем и упростить разработку можно, если понимать, как работает каждый из них и каковы его достоинства и недостатки.

source: In this guide, you will learn:
es: En esta guía aprenderás:
ko: 이 가이드에서 다음 내용을 배울 것입니다:
ru: В этом руководстве вы узнаете:

source: Godot's four collision object types
es: Los cuatro tipos de objetos de colisión en Godot
ko: Godot의 4가지 충돌 객체 유형
ru: Четыре типа объектов столкновений в Godot

source: How each collision object works
es: Cómo funciona cada tipo de objeto de colisión
ko: 각 충돌 객체의 작동 방식
ru: Как работает каждый объект столкновений

source: When and why to choose one type over another
es: Cuándo y por qué seleccionar un tipo en lugar de otro
ko: 한 유형을 다른 유형보다 선택해야 하는 시기 및 이유
ru: Когда и почему выбирать один тип среди других

source: This document's examples will use 2D objects. Every 2D physics object and collision shape has a direct equivalent in 3D and in most cases they work in much the same way.
es: Los ejemplos de este documento utilizarán objetos 2D. Cada objeto 2D, físico y forma de colisión (CollisionShape) tiene su equivalente 3D y en la mayoría de los casos funcionan del mismo modo.
ko: 이 문서의 예제에서는 2D 객체를 사용합니다. 모든 2D 객체와 충돌 모양은 3D에서 직접적으로 동등하며 대부분의 경우 거의 동일한 방식으로 작동합니다.
ru: В примерах этого документа будут использоваться 2D объекты. Каждый 2D физический объект и форма столкновений имеют прямой эквивалент в 3D и в большинстве случаев работают одинаковыми способами.

source: Collision objects
es: Objetos de colisión
ru: Объекты столкновений

source: Godot offers four kinds of physics bodies, extending :ref:`CollisionObject2D <class_CollisionObject2D>`:
es: Godot ofrece cuatro tipos de objetos físicos, que extienden :ref:`CollisionObject2D <class_CollisionObject2D>`:
ko: Godot는 :ref:`CollisionObject2D <class_CollisionObject2D>`에서 확장되는 4가지 종류의 물리적 body를 제공합니다:
ru: Godot предлагает четыре вида физических тел, расширяющих :ref:`CollisionObject2D <class_CollisionObject2D>`:

source: ``Area2D`` nodes provide **detection** and **influence**. They can detect when objects overlap and can emit signals when bodies enter or exit. An ``Area2D`` can also be used to override physics properties, such as gravity or damping, in a defined area.
es: Los nodos ``Area2D`` proveen **detección** e **Influencia**. Estos pueden detectar cuando objetos se superponen a ellos y emitir señales cuando cuerpos físicos entran o salen. Un ``Area2D`` también puede usarse para superponer o reemplazar propiedades físicas como gravedad o resistencia en una zona definida.
ru: Узлы ``Area2D`` обеспечивают **обнаружение** и **влияние**. Они могут определять, когда объекты перекрываются, и испускать сигналы при входе или выходе тел. Кроме того, ``Area2D`` можно использовать для переопределения физических свойств, таких, как сила тяжести или упругость, в определенной области.

source: The other three bodies extend :ref:`PhysicsBody2D <class_PhysicsBody2D>`:
es: Los otros tres cuerpos físicos extienden de :ref:`PhysicsBody2D <class_PhysicsBody2D>`:
ru: Остальные три тела расширяют :ref:`PhysicsBody2D <class_PhysicsBody2D>`:

source: A static body is one that is not moved by the physics engine. It participates in collision detection, but does not move in response to the collision. They are most often used for objects that are part of the environment or that do not need to have any dynamic behavior.
es: Un cuerpo estático es uno que no es movido por el motor de física. Participa en detección de colisiones pero no se mueve en respuesta a la colisión. Son normalmente utilizados para objetos que son parte del entorno y no necesitan ningún comportamiento dinámico.
ko: 정적인 body는 물리엔진에 의해 움직이지 않는 물체입니다. 그것은 충돌 감지에는 관여하지만, 충돌에 대응하여 움직이지는 않습니다. 이것들은 환경의 일부이거나 동적 동작이 필요하지 않은 객체에 가장 많이 사용됩니다.
ru: Статическое тело — это тело, которое не перемещается физическим движком. Он участвует в обнаружении столкновений, но не движется в ответ на столкновение. Чаще всего используется для объектов, являющихся частью среды, или не требующих какого-либо динамического поведения.

source: This is the node that implements simulated 2D physics. You do not control a ``RigidBody2D`` directly, but instead you apply forces to it (gravity, impulses, etc.) and the physics engine calculates the resulting movement. :ref:`Read more about using rigid bodies. <doc_rigid_body>`
es: Este es el nodo que implementa simulación de física 2D. Tú no controlas un ``RigidBody2D`` directamente, en lugar de ello, aplicas fuerzas (gravedad, impulsos, etc.) y el motor de física calcula el movimiento resultante. :ref:`Para más información sobre el uso cuerpos rígidos, ver aquí. <doc_rigid_body>`
ko: 이것은 시뮬레이션된 2D 물리를 구현하는 노드입니다. ``RigidBody2D``을 직접적으로 제어하지는 않지만, 그대신 중력이나 충격 등에 힘을 가하며 물리 엔진은 그것의 결과적인 움직임을 계산합니다. :ref:`rigid bodies 사용에 대해 더 알아보기. <doc_rigid_body>`
ru: Это узел реализует симуляцию 2D физики. Вы не управляете RigidBody2D напрямую, а прикладываете к нему силы (гравитация, импульсы и т. д.), и физический движок вычисляет результирующее движение. :ref:`Подробнее об использовании твёрдых тел. <doc_rigid_body>`

source: A body that provides collision detection, but no physics. All movement and collision response must be implemented in code.
es: Es un cuerpo que provee detección de colisiones, pero no física. Todo movimiento y respuestas a colisiones debe ser implementado en código.
ko: 충돌 감지 기능을 제공하지만 물리는 제공하지 않는 body입니다. 모든 이동 및 충돌 반응은 코드로 구현되어야 합니다.
ru: Тело, которое обеспечивает обнаружение столкновений, но не физику. Все движения и реакции на столкновения должны быть реализованы в коде.

source: Physics material
ru: Физический материал

source: Collision shapes
es: Figuras de Colisión
ru: Виды и формы коллизий (столкновений)

source: A physics body can hold any number of :ref:`Shape2D <class_Shape2D>` objects as children. These shapes are used to define the object's collision bounds and to detect contact with other objects.
es: Un cuerpo físico puede contener cuaquier número de objetos :ref:`Shape2D <class_Shape2D>` como hijos. Estas figuras o shapes, son usadas para definir los límites de colisión y detectar contactos con otros objetos físicos.
ko: 물리 body는 원하는 수만큼의 :ref:`Shape2D <class_Shape2D>`객체를 자식으로 수용할 수 있습니다. 이러한 모양은 객체의 충돌 한계를 정의하고 다른 객체와의 접촉을 감지하는 데 사용됩니다.
ru: Физическое тело может содержать любое количество :ref:`Shape2D <class_Shape2D>` объектов в качестве потомков. Эти формы используются для определения границ столкновения объекта и обнаружения контакта с другими объектами.

source: In order to detect collisions, at least one ``Shape2D`` must be assigned to the object.
es: Para detectar colisiones, al menos un recurso derivado de ``Shape2d`` debe ser asignado al objeto.
ko: 충돌을 감지하기 위해, 최소한 하나 이상의 ``Shape2D`` 가 객체어 할당되어야 합니다.
ru: Чтобы обнаруживать столкновения, объекту должен быть назначен хотя бы один ``Shape2D``.

source: The most common way to assign a shape is by adding a :ref:`CollisionShape2D <class_CollisionShape2D>` or :ref:`CollisionPolygon2D <class_CollisionPolygon2D>` as a child of the object. These nodes allow you to draw the shape directly in the editor workspace.
es: El modo más común de asignar un "shape" es agregando un :ref:`CollisionShape2D <class_CollisionShape2D>` o :ref:`CollisionPolygon2D <class_CollisionPolygon2D>` como hijo del objeto. Esos nodos permiten dibujar la forma directamente en el espacio de trabajo.
ko: 모양을 지정하는 가장 일반적인 방법은 객체의 하위 항목으로 :ref:`CollisionShape2D <class_CollisionShape2D>` 또는 :ref:`CollisionPolygon2D <class_CollisionPolygon2D>` 를 추가하는 것입니다. 이러한 노드들은 에디터의 작업 공간에서 직접 모양을 그릴 수 있도록 합니다.
ru: Наиболее распространенным способом назначения формы является добавление :ref:`CollisionShape2D <class_CollisionShape2D>` или :ref:`CollisionPolygon2D <class_CollisionPolygon2D>` как дочернего элемента объекта. Такие узлы позволят Вам рисовать форму непосредственно в рабочем пространстве редактора.

source: Be careful to never scale your collision shapes in the editor. The "Scale" property in the Inspector should remain ``(1, 1)``. When changing the size of the collision shape, you should always use the size handles, **not** the ``Node2D`` scale handles. Scaling a shape can result in unexpected collision behavior.
es: Ten cuidado de nunca escalar las formas de colisión (CollisionShape) en el editor. La propiedad "scale" en el inspector debe mantenerse ``(1,1)``. Cuando se cambia el tamaño del nodo correspondiente a la figura de colisión, siempre se deben utilizar los controles para cambiar tamaño, **no** los controles de ``Node2D`` para escala. Escalar la forma de colisión puede resultar en un comportamiento no esperado.
ru: Будьте осторожны и никогда не масштабируйте формы столкновений в редакторе. Свойство «Масштаб» в инспекторе должно оставаться ``(1, 1)``. При изменении размера формы столкновения всегда следует использовать параметры размера, а не параметры масштаба ``Node2D``. Масштабирование формы может привести к неожиданному поведению при столкновении.

source: Physics process callback
es: Llamada interna para procesamiento de física
ko: 물리 프로세스 콜백 함수
ru: Обратный вызов для физических процессов

source: In order to avoid this inaccuracy, any code that needs to access a body's properties should be run in the :ref:`Node._physics_process() <class_Node_method__physics_process>` callback, which is called before each physics step at a constant frame rate (60 times per second by default). This method will be passed a ``delta`` parameter, which is a floating-point number equal to the time passed in *seconds* since the last step. When using the default 60 Hz physics update rate, it will typically be equal to ``0.01666...`` (but not always, see below).
ru: Чтобы избежать этой проблемы, любой код, которому требуется доступ к свойствам тела, должен выполняться в обратном вызове :ref:`Node._physics_process() <class_Node_method__physics_process>`, который вызывается перед каждым шагом расчёта физики с постоянной частотой кадров (по умолчанию 60 раз в секунду). Этому методу будет передан параметр ``delta``, являющимся числом с плавающей запятой, равным времени, прошедшему в секундах с момента последнего шага. При использовании частоты обновления физики по умолчанию 60 Гц она обычно будет равна ``0,01666...`` (но не всегда, см. ниже).

source: It's recommended to always use the ``delta`` parameter when relevant in your physics calculations, so that the game behaves correctly if you change the physics update rate or if the player's device can't keep up.
ru: Рекомендуется всегда использовать параметр ``delta`` в Ваших физических вычислениях, чтобы игра вела себя правильно, если Вы измените скорость обновления физики, или если устройство игрока будет тормозить.

source: Collision layers and masks
es: Capas y Máscaras de Colisión
ru: Слои и маски столкновений

source: One of the most powerful, but frequently misunderstood, collision features is the collision layer system. This system allows you to build up complex interactions between a variety of objects. The key concepts are **layers** and **masks**. Each ``CollisionObject2D`` has 20 different physics layers it can interact with.
es: Una de las características más poderosas, aunque frecuentemente malentendidas, de las colisiones es el sistema de capa de colisión. Este sistema permite crear interacciones complejas entre una variedad de objetos. Los conceptos clave son **layers** (capas) y **masks** (mascaras). Cada ``CollisionObject2D`` tiene 20 capas físicas diferentes con las que se puede interactuar.
ru: Одной из самых мощных, но часто неправильно понимаемых возможностей в системе столкновений является система слоёв столкновений. Она позволяет создавать сложные взаимодействия между различными объектами. Ключевыми понятиями являются **слои** и **маски**. Каждый ``CollisionObject2D`` имеет 20 различных физических слоев, с которыми он может взаимодействовать.

source: Let's look at each of the properties in turn:
es: Veamos cada una de las propiedades:
ko: 각 속성을 차례대로 살펴보겠습니다:
ru: Рассмотрим каждое из свойств по очереди:

source: This describes the layers that the object appears **in**. By default, all bodies are on layer ``1``.
es: Esta describe las capas en las que el objeto aparece. Por defecto, todos los cuerpos están en la capa ``1``.
ko: 이것은 객체가 **나타나는** 레이어를 형성합니다. 기본적으로 모든 body는 계층 ``1``에 있습니다.
ru: Здесь описываются слои, на которых **отображается** объект. По умолчанию все тела находятся на слое ``1``.

source: This describes what layers the body will **scan** for collisions. If an object isn't in one of the mask layers, the body will ignore it. By default, all bodies scan layer ``1``.
es: Esto describe en qué capas el cuerpo **buscará** colisiones. Si un objeto no está en una de las máscaras, el cuerpo lo ignorará. Por defectos, todos los cuerpos buscan la capa ``1``.
ko: 이것은 body가 충돌을 위해 **스캔**하는 레이어를 형성합니다. 객체가 마스크 레이어 중 하나에 있지 않으면, body는 이를 무시합니다. 기본적으로 모든 body는 레이어 ``1``을 스캔합니다.
ru: Здесь описываются слои, которые будут использоваться для **сканирования** телом столкновений. Если объект не находится в одном из слоев маски, тело игнорирует его. По умолчанию все тела сканируют слой ``1``.

source: These properties can be configured via code, or by editing them in the Inspector.
es: Estas propiedades pueden ser configuradas por código o editadas mediante el Inspector.
ko: 이러한 속성은 코드를 통해 구성하거나 인스펙터에서 편집하여 구성할 수 있습니다.
ru: Эти свойства можно настроить с помощью кода или путем их редактирования в инспекторе.

source: Keeping track of what you're using each layer for can be difficult, so you may find it useful to assign names to the layers you're using. Names can be assigned in Project Settings -> Layer Names.
es: Mantener un seguimiento de cada capa usada puede ser complicado, así que puede ser útil asignar nombres a cada una de las capas utilizadas. Los nombres pueden ser asignados en Ajustes del Proyecto -> Layer Names.
ko: 각 레이어를 사용하는 대상을 추적하는 것은 어려울 수 있으므로, 사용중인 레이어에 이름을 할당하는 것이 유용할 수 있습니다. 이름은 프로젝트 설정 -> 레이어 이름 에서 할당할 수 있습니다.
ru: Отслеживать, для чего используется каждый слой, может быть затруднительно, поэтому может оказаться полезным назначить имена используемым слоям. Имена можно присвоить в меню Настройки проекта - > Имена слоев.

source: GUI example
ru: Пример GUI

source: You have four node types in your game: Walls, Player, Enemy, and Coin. Both Player and Enemy should collide with Walls. The Player node should detect collisions with both Enemy and Coin, but Enemy and Coin should ignore each other.
es: Tienes 4 tipos de nodos en tu juego: Walls (Paredes), Player (Jugador), Enemy (Enemigo) y Coin (Monedas). Player y Enemy deben colisionar con Wall. El nodo Player debe detectar colisiones tanto de Enemy como de Coin, pero Enemy y coin deben ignorarse mutuamente.
ko: 당신의 게임에는 4가지의 노드 유형이 있습니다: 벽, 플레이어, 적, 코인. 플레이어와 적 모두 벽과 충돌해야 합니다. 플레이어 노드는 적과 코인과의 충돌을 모두 감지해야 하지만, 적과 코인은 서로 무시해야 합니다.
ru: В игре есть четыре типа узлов: «Стены», «Игрок», «Враг» и «Монета». И Игрок, и Враг должны сталкиваться со стенами. Узел Игрок должен обнаруживать столкновения как с Враг, так и с Монета, но Враг и Монета должны игнорировать друг друга.

source: Start by naming layers 1-4 "walls", "player", "enemies", and "coins" and place each node type in its respective layer using the "Layer" property. Then set each node's "Mask" property by selecting the layers it should interact with. For example, the Player's settings would look like this:
es: Comienza nombrando las capas 1 a 4 "walls", "player", "enemies", y "coins" y coloca cada nodo en su respectiva propiedad "layer". Luego asigna cada propiedad "mask" seleccionando las capas con las que debe interactuar. Por ejemplo Player debería verse así:
ko: 레이어 1-4를 "walls", "player", "enemies", 그리고 "coins" 으로 이름을 지정하는 걸로 시작하고, "Layer" 특성을 사용하여 각 노드 유형을 해당 레이어에 배치합니다. 그런 다음 각 노드가 상호작용할 계층을 선택하여 각 노드의 "Mask" 속성을 설정합니다. 예를 들어, 플레이어의 설정은 다음과 같습니다:
ru: Начните с именования слоев 1-4: «walls», «player», «enemies» и «coins» и поместите каждый тип узла в соответствующий слой с помощью свойства «Слой». Затем задайте свойство «Маска» каждого узла, выбрав слои, с которыми он должен взаимодействовать. Например, настройки игрока будут выглядеть следующим образом:

source: Code example
ru: Пример кода

source: In function calls, layers are specified as a bitmask. Where a function enables all layers by default, the layer mask will be given as ``0x7fffffff``. Your code can use binary, hexadecimal, or decimal notation for layer masks, depending on your preference.
ru: В вызовах функций слои задаются как битовая маска. Если функция включает все слои по умолчанию, маска слоя будет задана как ``0x7fffffff``. Код может использовать двоичное, шестнадцатеричное или десятичное представление для масок слоев в зависимости от предпочтений пользователя.

source: The code equivalent of the above example where layers 1, 3 and 4 were enabled would be as follows::
ru: Код, эквивалентный приведенному выше примеру, в котором были включены уровни 1, 3 и 4, будет следующим:

source: Area nodes provide **detection** and **influence**. They can detect when objects overlap and emit signals when bodies enter or exit. Areas can also be used to override physics properties, such as gravity or damping, in a defined area.
es: Los nodos de área (Area) proporcionan **detección** y **influencia**. Pueden detectar cuando los objetos se superponen y emitir señales cuando los cuerpos entran o salen. Las áreas también pueden utilizarse para anular propiedades físicas, como la gravedad o la amortiguación, en un área definida.
ru: Узлы областей обеспечивают **обнаружение ** и **влияние**. Они могут обнаруживать перекрытия объектов и испускать сигналы при входе или выходе тел. Области также могут использоваться для переопределения физических свойств, таких как сила тяжести или упругости в определенной области.

source: There are three main uses for :ref:`Area2D <class_Area2D>`:
es: Estos son los tres tipos de usos principales de :ref:`Area2D <class_Area2D>`:
ko: :ref:`Area2D <class_Area2D>` 에는 3가지 주요 용도가 있습니다:
ru: Есть три основных варианта использования :ref:`Area2D <class_Area2D>`:

source: Overriding physics parameters (such as gravity) in a given region.
es: Sobreescribir los parámetros físicos (como la gravedad) en una región determinada.
ru: Переопределение физических параметров (таких как гравитация) в данной области.

source: Detecting when other bodies enter or exit a region or what bodies are currently in a region.
es: Detectar cuando otros cuerpos entran o salen de una región o qué cuerpos están actualmente en una región.
ko: 다른 body가 특정 지역에 들어오거나 나가는 때를 탐지하거나 현재 지역에 있는 body가 무엇인지를 탐지합니다.
ru: Обнаружение, когда другие тела входят или выходят из области или какие тела находятся в настоящее время в области.

source: Checking other areas for overlap.
es: Revisar la superposición con otras áreas.
ko: 다른 영역들이 겹치는지 확인합니다.
ru: Проверка других областей на перекрытие.

source: By default, areas also receive mouse and touchscreen input.
es: Por defecto, los nodos tipo Area también reciben entradas (input) de ratón y táctiles.
ko: 기본적으로, 영역은 마우스 및 터치스크린 입력도 받습니다.
ru: По умолчанию области также получают ввод с помощью мыши и сенсорного экрана.

source: A static body is one that is not moved by the physics engine. It participates in collision detection, but does not move in response to the collision. However, it can impart motion or rotation to a colliding body **as if** it were moving, using its ``constant_linear_velocity`` and ``constant_angular_velocity`` properties.
es: Un cuerpo estático (static body) es uno que no es movido por el motor de física. Participa en detección de colisiones pero no se mueve en respuesta a ellas. Sin embargo, pueden provocar movimientos o rotaciones a un cuerpo que colisiona como si fuesen movidas cuando utilizan sus propiedades ``constant_linear_velocity`` (velocidad linear constante) y ``constant_angular_velocity`` (velocidad angular constante).
ko: 정적인 body는 물리 엔진에 의해 움직이지 않는 물체입니다. 그것은 충돌 감지에는 참여하지만 충돌에 대응하여 움직이지 않습니다. 그러나, ``constant_linear_velocity``와 ``constant_angular_velocity``의 특성을 이용하여 **마치** 움직이는 것처럼 충돌하는 body에 움직임이나 회전을 전달할 수 있습니다.
ru: Статическое тело — это тело, которое не перемещается физическим движком. Оно участвует в обнаружении столкновений, но не движется в ответ на столкновение. Однако, оно может передавать движение или вращение столкнувшемуся телу, **как если бы** оно двигалось, используя его свойства``constant_linear_velocity`` и ``constant_angular_velocity``.

source: ``StaticBody2D`` nodes are most often used for objects that are part of the environment or that do not need to have any dynamic behavior.
es: Los nodos ``StaticBody2D`` son usados mayormente par aobjetos que son parte del entorno o que no necesitan ningún comportamiento dinámico.
ko: ``StaticBody2D``노드는 환경에 속하거나 동적 동작을 수행할 필요가 없는 객체에 가장 많이 사용됩니다.
ru: Узлы ``StaticBody2D`` чаще всего используются для объектов, которые являются частью среды, или которым не требуется какое-либо динамическое поведение.

source: Example uses for ``StaticBody2D``:
es: Ejemplos de usos para ``StaticBody2D``:
ko: ``StaticBody2D``이용 예시:
ru: Примеры использования ``StaticBody2D``:

source: Platforms (including moving platforms)
es: Plataformas (incluyendo plataformas móviles)
ko: 플랫폼(이동 플랫폼 포함)
ru: Платформы (включая движущиеся платформы)

source: Conveyor belts
es: Cintas transportadoras
ko: 컨베이어 벨트
ru: Конвейерные ленты

source: Walls and other obstacles
es: Paredes y otros obstáculos sólidos
ko: 벽 및 기타 장애물
ru: Стены и другие препятствия
