Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/physics_introduction.po
Languages: es, ko, ru

source: This is the node that implements simulated 2D physics. You do not control a :ref:`RigidBody2D <class_RigidBody2D>` directly. Instead, you apply forces to it and the physics engine calculates the resulting movement, including collisions with other bodies, and collision responses, such as bouncing, rotating, etc.
es: Este es el nodo que implementa la simulación de física 2D. No se puede controlar un :ref:`RigidBody2D <class_RigidBody2D>` directamente. En su lugar, se le aplican fuerzas y el motor de física calcula el movimiento resultante, incluyendo colisiones con otros cuerpos, y respuestas a colisiones, como rebotes, rotación, etc.
ru: Реализует симуляцию 2D-физики. Вы не управляете :ref:`RigidBody2D <class_RigidBody2D>` напрямую. Вместо этого к нему применяются силы, и физический движок вычисляет результирующее движение, включая столкновения с другими телами и реакции на столкновения, такие как отскок, поворот и т.д.

source: You can modify a rigid body's behavior via properties such as "Mass", "Friction", or "Bounce", which can be set in the Inspector.
ru: Поведение твёрдого тела можно изменить с помощью таких свойств, как «Масса», «Трение» или «Отскок», которые можно задать в инспекторе.

source: The body's behavior is also affected by the world's properties, as set in `Project Settings -> Physics`, or by entering an :ref:`Area2D <class_Area2D>` that is overriding the global physics properties.
es: El comportamiento de un cuerpo de este tipo también es afectado por las propiedades del mundo, como las asignadas en `Ajustes del Proyecto -> Physics` o pro entrar en un :ref:`Area2D <class_Area2D>` que está reemplazando las propiedades físicas globales.
ko: body의 행동은 또한 `Project Settings -> Physics` 에서 설정한 세계 속성의 영향을 받거나 전역 물리 특성을 재정의하는 :ref:`Area2D <class_Area2D>`를 입력한 것에 영향을 받습니다.
ru: На поведение тела также влияют свойства мира, заданные в `Свойства проекта - > Физика`, или вход в :ref:`Area2D <class_Area2D>`, переопределяющего глобальные свойства физики.

source: When a rigid body is at rest and hasn't moved for a while, it goes to sleep. A sleeping body acts like a static body, and its forces are not calculated by the physics engine. The body will wake up when forces are applied, either by a collision or via code.
es: Cuando un cuerpo rígido está inmóvil y permanece inmóvil por un tiempo, entra en reposo. Un cuerpo en reposo actúa como un cuerpo estático, y sus fuerzas no son calculadas por el motor de física. El cuerpo se activará cuando se ejerzan fuerzas, ya sea por una colisión o mediante código.
ru: Когда твёрдое тело находится в состоянии покоя и какое-то время не двигалось, оно «засыпает». Спящее тело ведёт себя как статическое тело, и его силы не рассчитываются физическим движком. Тело будет просыпаться либо при приложении сил, либо при столкновении, либо при помощи кода.

source: Rigid body modes
es: Modos de cuerpos rígidos
ko: Rigid body 모드
ru: Режимы твёрдого тела

source: A rigid body can be set to one of four modes:
es: Un cuerpo rígido puede estar en uno de cuatro modos:
ko: rigid body는 다음 네 가지 모드 중 하나로 설정할 수 있습니다:
ru: Твёрдое тело может быть установлено в один из четырех режимов:

source: **Rigid** - The body behaves as a physical object. It collides with other bodies and responds to forces applied to it. This is the default mode.
es: **Rigid** - El cuerpo se comporta como un objeto físico. Colisiona con otros cuerpos y responde a las fuerzas aplicadas sobre él. Este es el modo asignado por defecto.
ko: **Rigid** - 이 body는 물리적 물체처럼 작동합니다. 그것은 다른 body들과 충돌하고 그것에 적용되는 힘에 반응합니다. 기본 모드입니다.
ru: **Твёрдое** — тело ведет себя как физический объект. Оно сталкивается с другими телами и реагирует на приложенные к нему силы. Это режим по умолчанию.

source: **Static** - The body behaves like a :ref:`StaticBody2D <class_StaticBody2D>` and does not move.
es: **Static** - El cuerpo se comporta como un :ref:`StaticBody2D <class_StaticBody2D>` y no se mueve.
ko: **Static** - 이 body는 :ref:`StaticBody2D <class_StaticBody2D>` 처럼 동작하며 움직이지 않습니다.
ru: **Статичное** — тело ведет себя как :ref:`StaticBody2D <class_StaticBody2D>` и не двигается.

source: **Character** - Similar to "Rigid" mode, but the body cannot rotate.
es: **Character** - Similar al modo "Rigid", pero el cuerpo no puede rotar.
ru: **Персонаж** — аналогично режиму «Твёрдое», но тело не может вращаться.

source: **Kinematic** - The body behaves like a :ref:`KinematicBody2D <class_KinematicBody2D>` and must be moved by code.
es: **Kinematic** - El cuerpo se comporta como un :ref:`KinematicBody2D <class_KinematicBody2D>` y debe ser movido por código.
ko: **Kinematic** - 이 body는 :ref:`KinematicBody2D <class_KinematicBody2D>` 처럼 작동하며 코드를 통해 움직여야 한다.
ru: **Кинематическое** — Тело ведет себя как :ref:`KinematicBody2D <class_KinematicBody2D>` и должно перемещаться кодом.

source: Using RigidBody2D
es: Usando RigidBody2D
ko: RigidBody2D 사용하기
ru: Использование RigidBody2D

source: One of the benefits of using a rigid body is that a lot of behavior can be had "for free" without writing any code. For example, if you were making an "Angry Birds"-style game with falling blocks, you would only need to create RigidBody2Ds and adjust their properties. Stacking, falling, and bouncing would automatically be calculated by the physics engine.
es: Uno de los beneficios de utilizar un cuerpo rígido (rigid body) es que mucho de comportamiento se puede obtener "gratis", sin escribir una sola línea de código, si estás haciendo un juego tipo "Angry Birds", con bloques que caen, sólo necesitarás crear nodos RigidBody2D y ajustar sus propiedades. Apilar, hacer caer y rebotar será manejado por por e motor de física.
ko: rigid body를 사용하는 것의 이점 중 하나는 코드를 쓰지 않고도 많은 행동을 "자유롭게" 할 수 있다는 것입니다. 예를 들어, 떨어지는 블록으로 "앵그리 버드"-스타일의 게임을 만드는 경우, RiddleBody2D를 만들고 해당 속성을 조정하기만 하면 됩니다. 쌓기, 낙하 및 튕김은 물리 엔진에 의해 자동으로 계산됩니다.
ru: Одним из преимуществ использования жесткого тела является то, что различные поведения можно получить «бесплатно», без написания какого-либо кода. Например, если бы Вы делали игру в стиле «Angry Birds» с падающими блоками, Вам нужно было бы просто создать различные RigidBody2D и скорректировать их свойства. Штабелирование, падение и отскок будут автоматически рассчитываться с помощью физического движка.

source: However, if you do wish to have some control over the body, you should take care - altering the ``position``, ``linear_velocity``, or other physics properties of a rigid body can result in unexpected behavior. If you need to alter any of the physics-related properties, you should use the :ref:`_integrate_forces() <class_RigidBody2D_method__integrate_forces>` callback instead of ``_physics_process()``. In this callback, you have access to the body's :ref:`Physics2DDirectBodyState <class_Physics2DDirectBodyState>`, which allows for safely changing properties and synchronizing them with the physics engine.
es: Sin embargo, si lo que quieres es tener algo de control sobre el cuerpo, debes tener cuidado - modificar ``position`` (posición), ``linear_velocity`` (velocidad lineal) u otras propiedades físicas de un cuerpo rígido puede resultar en un comportamiento inesperado. Si necesitas alterar cualquier propiedad relacionada a la física, deberás usar la función interna o callback :ref:`_integrate_forces() <class_RigidBody2D_method__integrate_forces>` callback instead of ``_physics_process()``. En este callback, tienes acceso al :ref:`Physics2DDirectBodyState <class_Physics2DDirectBodyState>` (representación del estado físico) del cuerpo, lo que permite cambiar propiedades de manera segura y sincronizarlas con el motor de física.
ru: Однако, если вы хотите иметь некоторый контроль над телом, Вам следует быть осторожным — изменение ``position``, ``linear_velocity`` или других физических свойств твёрдого тела может привести к неожиданному поведению. Если необходимо изменить какое-либо из связанных с физикой свойств, следует использовать обратный вызов :ref:`_integrate_forces() <class_RigidBody2D_method__integrate_forces>`вместо ``_physics_process ()``. В этом обратном вызове вы имеете доступ к :ref:`Physics2DDirectBodyState <class_Physics2DDirectBodyState>` тела, что позволяет безопасно изменять свойства и синхронизировать их с физическим движком.

source: For example, here is the code for an "Asteroids" style spaceship:
es: Por ejemplo, este es el código para una nave tipo "Asteroids":
ko: 예를 들어, 다음은 "소행성" 스타일 우주선의 코드입니다:
ru: Например, вот код космического корабля в стиле «Asterioids»:

source: Note that we are not setting the ``linear_velocity`` or ``angular_velocity`` properties directly, but rather applying forces (``thrust`` and ``torque``) to the body and letting the physics engine calculate the resulting movement.
es: Note que no estamos asignando ``linear_velocity`` o ``angular_velocity`` directamente, en su lugar aplicamos fuerzas (``thrust`` - propulsión - y ``torque``) al cuerpo y dejamos que el motor de física calcule el movimiento resultante.
ko: ``linear_velocity`` 또는 ``angular_velocity`` 를 직접 설정하는 것이 아니라 힘 (``추력`` 과 ``토크``) 을 body에 적용하고 그 결과적인 움직임을 물리엔진이 계산하도록 한다는 점에 유의해야 합니다.
ru: Обратите внимание, что мы не устанавливаем свойства ``linear_velocity`` или ``angular_velocity`` напрямую, а, скорее, прикладываем силы (``thrust`` и ``torque``) к телу и позволяем физическому движку рассчитать результирующее движение.

source: When a rigid body goes to sleep, the ``_integrate_forces()`` function will not be called. To override this behavior, you will need to keep the body awake by creating a collision, applying a force to it, or by disabling the :ref:`can_sleep <class_RigidBody2D_property_can_sleep>` property. Be aware that this can have a negative effect on performance.
es: Cuando un cuerpo rígido se duerme, la función ``_integrate_forces`` no es llamada. Para evitar este comportamiento debemos mantener el cuerpo despierto creando una colisión, aplicando una fuerza sobre él o desactivando la propiedad :ref:`can_sleep <class_RigidBody2D_property_can_sleep>` (puede dormirse). Ten en cuenta que esto puede impactar negativamente en el desempeño.
ru: Когда жесткое тело переходит в спящий режим, функция ``_integrate_forces()`` не вызывается. Чтобы переопределить это поведение, необходимо сохранить тело в рабочем состоянии, создав столкновение, применив к нему силу или отключив свойство :ref:`can_sleep <class_RigidBody2D_property_can_sleep>`. Помните, что это может негативно сказаться на производительности.

source: Contact reporting
es: Reporte de contactos
ko: 접촉 알림
ru: Отслеживание контактов

source: By default, rigid bodies do not keep track of contacts, because this can require a huge amount of memory if many bodies are in the scene. To enable contact reporting, set the :ref:`contacts_reported <class_RigidBody2D_property_contacts_reported>` property to a non-zero value. The contacts can then be obtained via :ref:`Physics2DDirectBodyState.get_contact_count() <class_Physics2DDirectBodyState_method_get_contact_count>` and related functions.
es: Por defecto, los cuerpos rígidos no mantienen registro de los contactos porque esto requiere gran cantidad de memoria si hay muchos en la escena. Para habilitar el reporte de contactos, asigna un valor mayor a cero a la propiedad :ref:`contacts_reported <class_RigidBody2D_property_contacts_reported>`. Los contactos se pueden obtener mediante la función :ref:`Physics2DDirectBodyState.get_contact_count() <class_Physics2DDirectBodyState_method_get_contact_count>` y otras funciones relacionadas.
ru: По умолчанию твёрдые тела не отслеживают контакты, поскольку это может потребовать огромного объема памяти, если в сцене находится много тел. Чтобы включить отслеживание контактов, задайте для свойства :ref:`contacts_reported <class_RigidBody2D_property_contacts_reported>` ненулевое значение. Контакты могут быть получены через :ref:`Physics2DDirectBodyState.get_contact_count() <class_Physics2DDirectBodyState_method_get_contact_count>` и связанные с ним функции.

source: Contact monitoring via signals can be enabled via the :ref:`contact_monitor <class_RigidBody2D_property_contact_monitor>` property. See :ref:`RigidBody2D <class_RigidBody2D>` for the list of available signals.
es: El monitoreo de contactos mediante señales se puede activar mediante la propiedad :ref:`contact_monitor <class_RigidBody2D_property_contact_monitor>`. Ver :ref:`RigidBody2D <class_RigidBody2D>` para conocer la lista de señales disponibles.
ru: Мониторинг контактов через сигналы можно включить с помощью свойства :ref:`contact_monitor <class_RigidBody2D_property_contact_monitor>`. Список доступных сигналов см. в разделе :ref:`RigidBody2D <class_RigidBody2D>`.

source: :ref:`KinematicBody2D <class_KinematicBody2D>` bodies detect collisions with other bodies, but are not affected by physics properties like gravity or friction. Instead, they must be controlled by the user via code. The physics engine will not move a kinematic body.
es: Los cuerpos tipo :ref:`KinematicBody2D <class_KinematicBody2D>` detectan colisiones con otros cuerpos pero no son afectados por propiedades físicas como gravedad o fricción, deben ser controlados por el usuario mediante código. El motor de física no moverá un cuerpo cinemático.
ko: :ref:`KinematicBody2D <class_KinematicBody2D>` body는 다른 물체와의 충돌을 감지하지만 중력이나 마찰과 같은 물리적 성질의 영향을 받지 않습니다. 대신 코드를 통해 사용자가 제어해야 합니다. 물리 엔진은 kinematic body를 움직이지 않습니다.
ru: :ref:`KinematicBody2D <class_KinematicBody2D>` обнаруживают столкновения с другими телами, но на них не влияют физические свойства, такие как гравитация или трение. Вместо этого они должны управляться пользователем через код. Физический движок не будет перемещать кинематическое тело.

source: When moving a kinematic body, you should not set its ``position`` directly. Instead, you use the ``move_and_collide()`` or ``move_and_slide()`` methods. These methods move the body along a given vector, and it will instantly stop if a collision is detected with another body. After the body has collided, any collision response must be coded manually.
es: Al mover un cuerpo cinemático, no se debe establecer su ``position`` directamente. En su lugar, se utilizan los métodos ``move_and_collide()`` o ``move_and_slide()``. Estos métodos mueven el cuerpo a lo largo de un vector determinado, y se detendrá inmediatamente si se detecta una colisión con otro cuerpo. Después de que el cuerpo haya colisionado, cualquier respuesta de colisión debe ser programada manualmente.
ko: kinematic body를 옮길 때는 ``위치``를 직접 정해서는 안 됩니다. 대신 ``move_and_collide()`` 또는 ``move_and_slide()`` 방법을 사용합니다. 이러한 방법은 주어진 벡터를 따라 body를 움직이며, 다른 body와의 충돌이 감지되면 즉시 정지합니다. body가 충돌한 후에는 모든 충돌 응답을 수동으로 코딩해야 합니다.
ru: При перемещении кинематического тела не следует устанавливать его ``position`` непосредственно. Вместо этого используются методы ``move_and_collide()`` или ``move_and_slide()``. Эти методы перемещают тело по заданному вектору, и оно мгновенно останавливается, если обнаруживается столкновение с другим телом. После того как тело столкнулось, любая реакция на столкновение должна быть закодирована вручную.

source: Kinematic collision response
es: Respuesta de colisión cinemática
ko: Kinematic 충돌 반응
ru: Реакция кинематического тела на столкновение

source: After a collision, you may want the body to bounce, to slide along a wall, or to alter the properties of the object it hit. The way you handle collision response depends on which method you used to move the KinematicBody2D.
es: Después de una colisión, puedes querer que un cuerpo rebote, para que se deslice a lo largo de una superficie o para alterar las propiedades del objeto golpeado. El modo de manejar una respuesta de colisión depende del método usado para mover el KinematicBody2D.
ko: 충돌 후 body가 튀어 오르거나, 벽을 따라 미끄러지거나, 부딪힌 개체의 속성을 변경하기를 원할 수 있습니다. 충돌 응답을 처리하는 방법은 KineticBody2D를 이동하는 데 사용한 방법에 따라 달라집니다.
ru: После столкновения тело может отскочить, начать скользить по стене или изменить свойства объекта, в который оно попало. Способ обработки реакции на столкновение зависит от способа перемещения KinematicBody2D.

source: When using ``move_and_collide()``, the function returns a :ref:`KinematicCollision2D <class_KinematicCollision2D>` object, which contains information about the collision and the colliding body. You can use this information to determine the response.
es: Cuando se utiliza ``move_and_collide()`` (mover y colisionar), la función retorna un objeto del tipo :ref:`KinematicCollision2D <class_KinematicCollision2D>`, el cual contiene información sobre la colisión y el cuerpo golpeado. Puedes usar esta información para determinar la respuesta.
ko: 이 기능은 ``move_and_collide()``를 사용할 때 충돌 및 충돌 물체에 대한 정보가 포함된 :ref:`KinematicCollision2D <class_KinematicCollision2D>` 개체를 반환합니다. 이 정보를 사용하여 응답을 확인할 수 있습니다.
ru: При использовании ``move_and_collide()`` функция возвращает объект :ref:`KinematicCollision2D <class_KinematicCollision2D>`, который содержит информацию о столкновении и столкнувшемся теле. Эту информацию можно использовать для определения реакции.

source: For example, if you want to find the point in space where the collision occurred:
es: Por ejemplo, si quieres obtener el punto en el espacio donde ocurrió una colisión:
ko: 예를 들어, 충돌이 발생한 공간의 지점을 찾으려면 다음과 같이 하십시오:
ru: Например, если нужно найти точку в пространстве, где произошло столкновение:

source: Or to bounce off of the colliding object:
es: O para rebotar del objeto colisionado:
ko: 충돌 개체가 튀어나오도록 하기 위해선 다음과 같이 하십시오:
ru: Или отскочить от объекта, с которым столкнулись:

source: Sliding is a common collision response; imagine a player moving along walls in a top-down game or running up and down slopes in a platformer. While it's possible to code this response yourself after using ``move_and_collide()``, ``move_and_slide()`` provides a convenient way to implement sliding movement without writing much code.
es: Resbalar o "slide" es una respuesta común a colisiones. Imagina un jugador moviéndose a lo largo de las paredes en un juego de vista superior o top-down, o corriendo hacia arriba o hacia abajo en las pendientes de un jeugo de plataformas. Es posible codificar la respuesta para este tipo de colisiones utilizando ``move_and_collide()``, pero ``move_and_slide()`` provee un modo conveniente de implementar el efecto de resbalar sobre superficies con mucho menos código.
ko: 슬라이딩은 일반적인 충돌 반응입니다. 플레이어가 하향식 게임에서 벽을 따라 움직이거나 플랫폼 안에서 오르내리는 경사를 상상해 보십시오. ``move_and_collide()``를 사용한 후 직접 코드화할 수 있지만 ``move_and_slide()``는 많은 코드를 작성하지 않고 슬라이딩 이동을 실행할 수 있는 편리한 방법입니다.
ru: Скольжение является общей реакцией на столкновение; представьте себе игрока, движущегося вдоль стен в игре с видом сверху, или бегающего вверх и вниз по склонам в платформере. Хотя этот ответ и можно закодировать самостоятельно после использования ``move_and_collide()``, ``move_and_slide()`` обеспечивает более удобный способ реализации скользящего движения без написания большого количества кода.

source: ``move_and_slide()`` automatically includes the timestep in its calculation, so you should **not** multiply the velocity vector by ``delta``.
es: ``move_and_slide()`` incluye automáticamente el "timestep" (paso temporal) en su cálculo, por lo que **no** se debe multiplicar el vector de velocidad por ``delta``.
ko: ``move_and_slide()`` 는 자동으로 타임스탬프를 계산에 포함하므로, 속도 벡터에 ``delta`` 를 곱하면 **안** 됩니다.
ru: ``move_and_slide()`` автоматически включает временной интервал в свои расчеты, поэтому **не умножайте** вектор скорости на ``delta``.

source: For example, use the following code to make a character that can walk along the ground (including slopes) and jump when standing on the ground:
es: Por ejemplo, usa el siguiente código para hacer que un personaje pueda caminar por el piso (incluyendo pendientes) y salte cuando está en el piso:
ko: 예를 들어, 다음 코드를 사용하여 지면(경사 포함)을 따라 걸을 수 있고 지면에 있을 때 점프할 수 있는 캐릭터를 만들 수 있습니다:
ru: Например, используйте следующий код для создания персонажа, который может ходить по земле (включая уклоны) и прыгать, когда стоит на земле:

source: See :ref:`doc_kinematic_character_2d` for more details on using ``move_and_slide()``, including a demo project with detailed code.
es: Ver :ref:`doc_kinematic_character_2d` para más detalles sobre el uso de ``move_and_slide()``, incluyendo proyecto de demostración con código detallado.
ko: 자세한 코드가 포함된 데모 프로젝트를 포함하여 ``move_and_slide()`` 사용에 대한 자세한 내용은 :ref:`doc_kinematic_character_2d`를 참조하십시오.
ru: Дополнительные сведения по использованию ``move_and_slide()`` см. в разделе :ref:`doc_kinematic_character_2d`, включая демонстрационный проект с подробным кодом.

source: The physics engine may spawn multiple threads to improve performance, so it can use up to a full frame to process physics. Because of this, the value of a body's state variables such as ``position`` or ``linear velocity`` may not be accurate for the current frame.
es: El motor de física puede disparar hilos múltiples para mejorar la performance, así que puede utilizar todo un frame para procesar la física. A raíz de esto, el valor del estado (State) de un cuerpo (body) como ``position`` o ``linear_velocity`` puede no ser preciso para el frame actual.
ko: 물리 엔진은 성능을 향상시키기 위해 여러 개의 스레드를 생성할 수 있으므로, 물리적 작업을 처리하는 데 최대 프레임까지 사용할 수 있습니다. 이로 인해, ``위치`` 또는 ``선형 속도`` 와 같은 body의 상태 변수의 값이 현재 프레임에 정확하지 않을 수 있습니다.

source: In order to avoid this inaccuracy, any code that needs to access a body's properties should be run in the :ref:`Node._physics_process() <class_Node_method__physics_process>` callback, which is called before each physics step at a constant frame rate (60 times per second by default).
es: Para evitar esta inexactitud, cualquier código que necesite acceder a las propiedades de un cuerpo debe ejecutarse en la función :ref:`Node._physics_process() <class_Node_method__physics_process>`, la cual es invocada por el motor de cada paso de la física a una velocidad de cuadro constante (60 veces por segundo por defecto).

source: **Example:**
es: **Ejemplo:**
ko: **예시:**

source: You can modify a rigid body's behavior via properties such as "Mass", "Friction", or "Bounce", which can be set in the Inspector.
es: Puedes modificar el comportamiento de un rigid body (cuerpo rígido) mediante propiedades como "mass" (masa), "friction"(fricción), o "bounce" (rebote/elasticidad), estas pueden asignarse desde el Inspector.
ko: 인스펙터에서 설정할 수 있는 "Mass", "Friction", 또는 "Bounce" 와 같은 특성을 통해 rigid body의 동작을 수정할 수 있습니다.
