Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/ragdoll_system.po
Languages: ru

source: Ragdoll system
ru: Система Ragdoll

source: Introduction
ru: Введение

source: Since version 3.1, Godot supports ragdoll physics. Ragdolls rely on physics simulation to create realistic procedural animation. They are used for death animations in many games.
ru: Начиная с версии 3.1, Godot поддерживает физику тряпичных кукол (ragdolls). Для создания реалистичной процедурной анимации тряпичные куклы используют физическое моделирование. Они используются для анимации смерти во многих играх.

source: In this tutorial, we will be using the Platformer3D demo to set up a ragdoll.
ru: В этом учебном пособии мы будем использовать пример Platformer3D для настройки тряпичной куклы.

source: You can download the Platformer3D demo on `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ or using the `Asset Library <https://godotengine.org/asset-library/asset/125>`_.
ru: Вы можете скачать пример Platformer3D с `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ или использовать `Библиотеку Ассетов <https://godotengine.org/asset-library/asset/125>`_.

source: Setting up the ragdoll
ru: Настройка куклы

source: Creating physical bones
ru: Создание физических костей

source: Like many other features in the engine, there is a node to set up a ragdoll: the :ref:`PhysicalBone <class_PhysicalBone>` node. To simplify the setup, you can generate ``PhysicalBone`` nodes with the "Create physical skeleton" feature in the skeleton node.
ru: Как и для многих других возможностей движка существует узел для настройки куклы: :ref:`PhysicalBone <class_PhysicalBone>`. Для упрощения настройки Вы можете создать узлы ``PhysicalBone`` через функцию "Создать физический скелет" в узле скелетона.

source: Open the platformer demo in Godot, and then the Robi scene. Select the ``Skeleton`` node. A skeleton button appears on the top bar menu:
ru: Откройте демо платформера в Godot, а затем сцену Robi. Выберите узел ``Skeleton``. В меню верхней панели появится кнопка скелета:

source: Click it and select the ``Create physical skeleton`` option. Godot will generate ``PhysicalBone`` nodes and collision shapes for each bone in the skeleton and pin joints to connect them together:
ru: Щелкните его и выберите опцию ``Создать физический скелет``. Godot будет генерировать узлы ``PhysicalBone`` и формы столкновений для каждой кости скелета и штыревые крепления для их соединения:

source: Some of the generated bones aren't necessary: the ``MASTER`` bone for example. So we're going to clean up the skeleton by removing them.
ru: Некоторые из созданных костей не являются необходимыми: например, кость``MAIN``. Мы очистим скелет, удалив её.

source: Cleaning up the skeleton
ru: Очистка скелета

source: Each ``PhysicalBone`` the engine needs to simulate has a performance cost, so you want to remove every bone that is too small to make a difference in the simulation, as well as all utility bones.
ru: Каждая ``PhysicalBone``, которую должен моделировать движок, ухудшает производительность, поэтому Вы захотите удалить каждую кость, которая слишком мала, чтобы оказывать влияние на моделирование, а также все вспомогательные кости.

source: For example, if we take a humanoid, you do not want to have physical bones for each finger. You can use a single bone for the entire hand instead, or one for the palm, one for the thumb, and a last one for the other four fingers.
ru: Например, если мы берем гуманоида, Вы не захотите иметь физические кости для каждого пальца. Вместо этого Вы можете использовать единственную кость для всей руки, или одну для ладони, одну для большого пальца и последнюю для остальных четырех пальцев.

source: Remove these physical bones: ``MASTER``, ``waist``, ``neck``, ``headtracker``. This gives us an optimized skeleton and makes it easier to control the ragdoll.
ru: Удалите эти физические кости: ``MASTER``, ``waist``, ``neck``, ``headtracker``. Это даст нам оптимизированный скелет и облегчит управление куклой.

source: Collision shape adjustment
ru: Настройка форм столкновений

source: The next task is adjusting the collision shape and the size of physical bones to match the part of the body that each bone should simulate.
ru: Следующая задача — настроить форму столкновений и размеры физических костей так, чтобы они соответствовали частям тела, которые должна моделировать каждая кость.

source: Joints adjustment
ru: Настройка суставов

source: Once you adjusted the collision shapes, your ragdoll is almost ready. You just want to adjust the pin joints to get a better simulation. ``PhysicalBone`` nodes have an unconstrained pin joint assigned to them by default. To change the pin joint, select the ``PhysicalBone`` and change the constraint type in the ``Joint`` section. There, you can change the constraint's orientation and its limits.
ru: Как только Вы настроили формы столкновения, Ваша кукла почти готова. Вы просто хотите настроить суставы для более качественного моделирования. У узлов ``PhysicalBone`` есть неограниченный сустав, назначенный на них по умолчанию. Чтобы изменить сустав, выберите ``PhysicalBone`` и поменяйте тип ограничения в разделе ``Joint``. Там Вы можете изменить ориентацию ограничения и ее пределы.

source: This is the final result:
ru: Это и есть финальный результат:

source: Simulating the ragdoll
ru: Моделирование куклы

source: The ragdoll is now ready to use. To start the simulation and play the ragdoll animation, you need to call the ``physical_bones_start_simulation`` method. Attach a script to the skeleton node and call the method in the ``_ready`` method:
ru: Теперь кукла готова к использованию. Для запуска моделирования и воспроизведения анимации куклы необходимо вызвать метод ``physical_bones_start_simulation``. Присоедините скрипт к скелетному узлу и вызовите метод в ``_ready`` методе:

source: To stop the simulation, call the ``physical_bones_stop_simulation()`` method.
ru: Чтобы остановить моделирование, вызовите метод ``physical_bones_stop_simulation()``.

source: You can also limit the simulation to only a few bones. To do so, pass the bone names as a parameter. Here's an example of partial ragdoll simulation:
ru: Можно также ограничить моделирование только несколькими костями. Для этого передайте имена костей в качестве параметра. Вот пример частичного моделирования куклы:

source: Collision layer and mask
ru: Слой столкновения и маска

source: Make sure to set up your collision layers and masks properly so the ``KinematicBody``'s capsule doesn't get in the way of the physics simulation:
ru: Не забудьте правильно настроить слои столкновений и маски, чтобы капсула ``KinematicBody`` не попала в путь физического моделирования:

source: For more information, read :ref:`doc_physics_introduction_collision_layers_and_masks`.
ru: Для получения дополнительной информации см. :ref:`doc_physics_introduction_collision_layers_and_masks`.
