Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/ray-casting.po
Languages: es, ko

source: Introduction
es: Introducción
ko: 소개

source: One of the most common tasks in game development is casting a ray (or custom shaped object) and checking what it hits. This enables complex behaviors, AI, etc. to take place. This tutorial will explain how to do this in 2D and 3D.
es: Una de las tareas más comunes en el desarrollo de juegos es lanzar un rayo (o un objeto con forma personalizada) y comprobar con qué choca. Esto permite que ocurran comportamientos complejos (IA, etcétera). Este tutorial explicará cómo hacer esto en 2D y 3D.
ko: 게임 개발에서 가장 일반적인 작업 중 하나는 광선(또는 사용자 지정 모양의 물체)를 투사하고 그것이 부딪히는 것을 확인하는 것입니다. 이를 통해 복잡한 행동, AI 등이 발생할 수 있습니다. 이 튜토리얼에서는 2D 및 3D로 이 작업을 수행하는 방법에 대해 설명합니다.

source: Godot stores all the low level game information in servers, while the scene is just a frontend. As such, ray casting is generally a lower-level task. For simple raycasts, node such as :ref:`RayCast <class_RayCast>` and :ref:`RayCast2D <class_RayCast2D>` will work, as they will return every frame what the result of a raycast is.
es: Godot almacena toda la información de bajo nivel del juego en servidores, mientras que la escena es solo una interfaz. Como tal, el ray casting es generalmente una tarea de bajo nivel. Para raycasts simples, los nodos :ref:`RayCast <class_RayCast>` y :ref:`RayCast2D <class_RayCast2D>` funcionarán, ya que devolverán a cada cuadro el resultado de un raycast.
ko: 씬이 단지 프론트엔드일 동안, Godot는 모든 낮은 레벨의 게임 정보를 서버에 저장합니다. 따라서 일반적으로 레이 캐스팅은 하위 작업입니다. 단순 레이캐스트의 경우, :ref:`RayCast <class_RayCast>` 및 :ref:`RayCast2D <class_RayCast2D>`와 같은 노드는 모든 프레임의 레이캐스트의 결과가 어떤 것인지 반환함으로써 작동 할 것입니다.

source: Many times, though, ray-casting needs to be a more interactive process so a way to do this by code must exist.
es: Sin embargo, muchas veces el ray-casting debe ser un proceso más interactivo, así que es necesario que exista una forma de hacer esto por código.
ko: 그러나, 많은 경우, 광선 투사는 보다 상호작용적인 과정이 필요하므로 코드로 이를 수행하는 방법이 있어야만 합니다.

source: Space
es: Espacio
ko: 공간

source: In the physics world, Godot stores all the low level collision and physics information in a *space*. The current 2d space (for 2D Physics) can be obtained by accessing :ref:`CanvasItem.get_world_2d().space <class_CanvasItem_method_get_world_2d>`. For 3D, it's :ref:`Spatial.get_world().space <class_Spatial_method_get_world>`.
es: En el mundo físico, Godot almacena toda la información de bajo nivel sobre colisiones y física en un *espacio*. El espacio 2d actual (para Física 2D) se puede obtener accediendo a :ref:`CanvasItem.get_world_2d().space <class_CanvasItem_method_get_world_2d>`. Para 3D, accediendo a :ref:`Spatial.get_world().space <class_Spatial_method_get_world>`.

source: The resulting space :ref:`RID <class_RID>` can be used in :ref:`PhysicsServer <class_PhysicsServer>` and :ref:`Physics2DServer <class_Physics2DServer>` respectively for 3D and 2D.
es: El espacio resultante :ref:`RID <class_RID>` puede usarse en :ref:`PhysicsServer <class_PhysicsServer>` y :ref:`Physics2DServer <class_Physics2DServer>` respectivamente para 3D y 2D.
ko: 결과적인 공간 :ref:`RID <class_RID>`는 3D 및 2D에 대해 각각 :ref:`PhysicsServer <class_PhysicsServer>` 및 :ref:`Physics2DServer <class_Physics2DServer>` 에서 사용할 수 있습니다.

source: Accessing space
es: Accediendo al espacio
ko: 공간에 접근하기

source: Godot physics runs by default in the same thread as game logic, but may be set to run on a separate thread to work more efficiently. Due to this, the only time accessing space is safe is during the :ref:`Node._physics_process() <class_Node_method__physics_process>` callback. Accessing it from outside this function may result in an error due to space being *locked*.
es: La física de Godot se ejecuta de manera predeterminada en el mismo hilo que la lógica del juego, pero puede configurarse para que se ejecute en un hilo separado y así funcione de manera más eficiente. Debido a esto, el único momento en que acceder al espacio es seguro es durante la devolución de llamada (callback) de :ref:`Node._physics_process() <class_Node_method__physics_process>`. Acceder desde fuera de esta función puede provocar un error debido a que el espacio está *bloqueado*.

source: To perform queries into physics space, the :ref:`Physics2DDirectSpaceState <class_Physics2DDirectSpaceState>` and :ref:`PhysicsDirectSpaceState <class_PhysicsDirectSpaceState>` must be used.
es: Para realizar consultas en el espacio de física, se deben utilizar :ref:`Physics2DDirectSpaceState <class_Physics2DDirectSpaceState>` y :ref:`PhysicsDirectSpaceState <class_PhysicsDirectSpaceState>`.
ko: 물리 공간에 대한 쿼리를 수행하려면 :ref:`Physics2DDirectSpaceState <class_Physics2DDirectSpaceState>` 및 :ref:`PhysicsDirectSpaceState <class_PhysicsDirectSpaceState>` 를 사용해야 합니다.

source: Use the following code in 2D:
es: Usa el siguiente código en 2D:
ko: 2D에서는 다음 코드를 사용합니다:

source: Or more directly:
es: O más directamente:
ko: 더욱더 직접적인 코드:

source: And in 3D:
es: Y en 3D:
ko: 3D에서는 다음 코드를 사용합니다:

source: Raycast query
es: Consulta de Raycast
ko: 광선 투사 쿼리

source: For performing a 2D raycast query, the method :ref:`Physics2DDirectSpaceState.intersect_ray() <class_Physics2DDirectSpaceState_method_intersect_ray>` may be used. For example:
es: Para realizar una consulta de raycast 2D se puede utilizar el método :ref:`Physics2DDirectSpaceState.intersect_ray() <class_Physics2DDirectSpaceState_method_intersect_ray>`. Por ejemplo:

source: The result is a dictionary. If the ray didn't hit anything, the dictionary will be empty. If it did hit something, it will contain collision information:
es: El resultado es un diccionario. Si el rayo no le dio a nada, el diccionario estará vacío. Si chocó con algo, contendrá información de colisión:

source: The ``result`` dictionary when a collision occurs contains the following data:
es: El diccionario resultante ``result`` cuando ocurre una colisión contiene los siguientes datos:
ko: 충돌이 발생할 경우 ``결과`` 딕셔너리에는 다음 데이터가 포함됩니다:

source: The data is similar in 3D space, using Vector3 coordinates.
es: Los datos son similares en el espacio 3D, usando coordenadas Vector3.
ko: 데이터는 Vector3 좌표를 사용하는 3D 공간에서와 유사합니다.

source: Collision exceptions
es: Excepciones de colisión
ko: 충돌 예외

source: A common use case for ray casting is to enable a character to gather data about the world around it. One problem with this is that the same character has a collider, so the ray will only detect its parent's collider, as shown in the following image:
es: Un caso de uso común de ray casting es un permitir que un personaje reúna datos sobre el mundo que lo rodea. Un problema que surge en estos casos es que ese mismo personaje tiene un Colisionador, por lo que el rayo sólo detectará el Colisionador de su padre, como se muestra en la siguiente imagen:
ko: 광선 투사의 일반적인 용도는 캐릭터가 주변 세계에 대한 데이터를 수집할 수 있도록 하는 것입니다. 이것의 한 가지 문제점은 다음 이미지와 같이 같은 캐릭터가 충돌체를 가지고 있어서, 광선은 부모의 충돌체만 감지한다는 것입니다:

source: To avoid self-intersection, the ``intersect_ray()`` function can take an optional third parameter which is an array of exceptions. This is an example of how to use it from a KinematicBody2D or any other collision object node:
es: Para evitar la autointersección, la función ``intersect_ray()`` puede recibir un tercer parámetro opcional que es una matriz de excepciones. Aquí se muestra un ejemplo de cómo utilizarlo desde un KinematicBody2D o desde cualquier otro nodo de objeto de colisión:
ko: 자체 교차를 방지하기 위해, ``intersect_ray()`` 함수는 예외 배열인 선택적 세 번째 파라미터를 취할 수 있습니다. 이것은 KinematicBody2D 또는 다른 충돌 개체 노드에서 사용하는 방법의 예입니다:

source: The exceptions array can contain objects or RIDs.
es: La matriz de excepciones puede contener objetos o identificadores relativos (RIDs).
ko: 예외 배열에는 개체 또는 RID가 포함될 수 있습니다.

source: Collision Mask
es: Máscara de colisión
ko: 충돌 마스크

source: While the exceptions method works fine for excluding the parent body, it becomes very inconvenient if you need a large and/or dynamic list of exceptions. In this case, it is much more efficient to use the collision layer/mask system.
es: Mientras que el método de excepciones funciona bien para excluir el cuerpo padre, resulta muy incómodo si se necesita una lista grande y dinámica de las excepciones. En ese caso, es mucho más eficiente utilizar el sistema de máscaras/capas de colisión.
ko: 예외 방법은 부모 body를 제외하고도 잘 작동하지만, 많은 and/or 동적 예외 목록이 필요한 경우 매우 불편하게 됩니다. 이 경우 충돌 계층/마스크 시스템을 사용하는 것이 훨씬 효율적입니다.

source: The optional fourth argument for ``intersect_ray()`` is a collision mask. For example, to use the same mask as the parent body, use the ``collision_mask`` member variable:
es: El cuarto argumento opcional para ``intersect_ray()`` es una máscara de colisión. Por ejemplo, para usar la misma máscara que el cuerpo padre, usa la variable ``collision_mask``:

source: 3D ray casting from screen
es: Ray casting 3D desde la pantalla
ko: 화면에서의 3D ray casting(광선 투사)

source: Casting a ray from screen to 3D physics space is useful for object picking. There is not much need to do this because :ref:`CollisionObject <class_CollisionObject>` has an "input_event" signal that will let you know when it was clicked, but in case there is any desire to do it manually, here's how.
es: Lanzar un rayo de la pantalla al espacio de físicas 3D es útil para recoger objetos. No hay demasiada necesidad de hacer esto porque :ref:`CollisionObject <class_CollisionObject>` tiene una señal de "input_event" que permite saber cuando ha hecho clic, pero en el caso de querer hacerlo manualmente, esta es la forma.

source: To cast a ray from the screen, you need a :ref:`Camera <class_Camera>` node. A ``Camera`` can be in two projection modes: perspective and orthogonal. Because of this, both the ray origin and direction must be obtained. This is because ``origin`` changes in orthogonal mode, while ``normal`` changes in perspective mode:
es: Para lanzar un rayo desde la pantalla, se necesita un nodo :ref:`Camera <class_Camera>`. Una ``Camera`` (cámara) puede estar en dos modos de proyección: perspectiva y ortogonal. Debido a esto, deben obtenerse el origen del rayo y su dirección. Esto es porque en el modo ortogonal ``origin`` (origen) cambia, mientras que en el modo perspectiva ``normal`` cambia:
ko: 화면에서 광선을 캐스팅하려면 :ref:`Camera <class_Camera>` 노드가 필요합니다. ``카메라``는 두 가지 투영 모드일 수 있습니다: 원근법과 직교. 이로 인해 광선 원점과 방향을 모두 얻어야 합니다. 이는 직교 모드의 ``원래`` 변화, 원근법 모드에서의 ``정상`` 변화 때문입니다:

source: To obtain it using a camera, the following code can be used:
es: Para obtenerlo mediante una cámara, se puede utilizar el siguiente código:
ko: 카메라를 사용하여 얻기 위해선, 다음 코드를 사용할 수 있습니다:

source: Remember that during ``_input()``, the space may be locked, so in practice this query should be run in ``_physics_process()``.
es: Recuerda que durante un ``input()``, el espacio puede estar bloqueado, así que en la práctica esta consulta debe ser ejecutada en ``_physics_process()``.
ko: ``_input()`` 동안 공간이 잠겨 있을 수 있으므로 실제로 이 쿼리는 ``_physics_process()``에서 실행해야 한다는 점을 기억하십시오.
