Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/rigid_body.po
Languages: fr, ja

source: RigidBody
ja: リジットボディ(RigidBody/剛体)

source: What is a rigid body?
fr: Qu'est-ce qu'un corps rigide ?
ja: リジッド ボディとは何ですか？

source: A rigid body is one that is directly controlled by the physics engine in order to simulate the behavior of physical objects. In order to define the shape of the body, it must have one or more :ref:`Shape <class_Shape>` objects assigned. Note that setting the position of these shapes will affect the body's center of mass.
fr: Un corps rigide est un corps qui est directement contrôlé par le moteur physique afin de simuler le comportement des objets physiques. Pour définir la forme du corps, il doit avoir un ou plusieurs objets :ref:`Shape <class_Shape>` assignés. Notez que le réglage de la position de ces formes affectera le centre de masse du corps.
ja: リジッド ボディは、物理オブジェクトの動作をシミュレートするために物理エンジンによって直接制御されるものです。ボディの形状を定義するには、1つ以上の :ref:`Shape <class_Shape>` オブジェクトが割り当てられている必要があります。これらの形状の位置を設定すると、ボディの重心に影響することに注意してください。

source: How to control a rigid body
fr: Comment contrôler un corps rigide
ja: リジッド ボディを制御する方法

source: A rigid body's behavior can be altered by setting its properties, such as friction, mass, bounce, etc. These properties can be set in the Inspector or via code. See :ref:`RigidBody <class_RigidBody>` for the full list of properties and their effects.
fr: Le comportement d'un corps rigide peut être modifié en réglant ses propriétés, telles que la friction, la masse, le rebond, etc. Ces propriétés peuvent être définies dans l'inspecteur ou via un code. Voir :ref:`RigidBody <class_RigidBody>` pour la liste complète des propriétés et leurs effets.
ja: リジッドボディの動作は、摩擦、質量、反発などのプロパティを設定することで変更できます。これらのプロパティは、インスペクタまたはコードを介して設定できます。プロパティとその効果の完全なリストについては、 :ref:`RigidBody <class_RigidBody>` を参照してください。

source: There are several ways to control a rigid body's movement, depending on your desired application.
fr: Il y a plusieurs façons de contrôler le mouvement d'un corps rigide, selon l'application désirée.
ja: 目的のアプリケーションに応じて、リジットボディの動きを制御する方法がいくつかあります。

source: If you only need to place a rigid body once, for example to set its initial location, you can use the methods provided by the :ref:`Spatial <class_Spatial>` node, such as ``set_global_transform()`` or ``look_at()``. However, these methods cannot be called every frame or the physics engine will not be able to correctly simulate the body's state. As an example, consider a rigid body that you want to rotate so that it points towards another object. A common mistake when implementing this kind of behavior is to use ``look_at()`` every frame, which breaks the physics simulation. Below, we'll demonstrate how to implement this correctly.
fr: Si vous n'avez besoin de placer qu'une seule fois un corps rigide, par exemple pour définir son emplacement initial, vous pouvez utiliser les méthodes fournies par le nœud :ref:`Spatial <class_Spatial>`, telles que ``set_global_transform()`` ou ``look_at()``. Cependant, ces méthodes ne peuvent pas être appelées toutes les images ou le moteur physique ne sera pas capable de simuler correctement l'état du corps. Par exemple, considérez un corps rigide que vous voulez faire pivoter pour qu'il pointe vers un autre objet. Une erreur courante lors de l'implémentation de ce type de comportement est d'utiliser ``look_at()`` chaque image, ce qui casse la simulation physique. Ci-dessous, nous allons montrer comment implémenter correctement ceci.
ja: リジッド ボディを1回だけ配置する必要がある場合、たとえば最初の位置を設定する場合は、\ ``set_global_transform()`` または ``look_at()`` などの :ref:`Spatial <class_Spatial>` ノードで提供されるメソッドを使用できます。ただし、これらのメソッドをフレームごとに呼び出してはいけません。もし呼び出すと、物理エンジンは体の状態を正しくシミュレートできなくなります。たとえば、別のオブジェクトを向くように回転させるリジッド ボディを考えてみましょう。この種の動作を実装する際のよくある間違いは、物理シミュレーションを破壊する ``look_at()`` をすべてのフレームで使用してしまうことです。以下に、これを正しく実装する方法を示します。

source: The fact that you can't use ``set_global_transform()`` or ``look_at()`` methods doesn't mean that you can't have full control of a rigid body. Instead, you can control it by using the ``_integrate_forces()`` callback. In this method, you can add *forces*, apply *impulses*, or set the *velocity* in order to achieve any movement you desire.
fr: Le fait que vous ne puissiez pas utiliser les méthodes ``set_global_transform()`` ou ``look_at()`` ne signifie pas que vous ne pouvez pas avoir un contrôle total sur un corps rigide. Au lieu de cela, vous pouvez le contrôler en utilisant le callback ``_integrate_forces()``. Dans cette méthode, vous pouvez ajouter des *forces*, appliquer des *impulsions*, ou régler la *vitesse* afin d'obtenir le mouvement que vous souhaitez.
ja: ``set_global_transform()`` または ``look_at()`` メソッドを使用できないという事実は、リジットボディを完全に制御できないという意味ではありません。代わりに、\ ``_integrate_forces()`` コールバックを使用して制御できます。この方法では、 *forces* を追加したり、\ *impulses* を適用したり、\ *velocity* を設定して、希望する動きを実現したりできます。

source: The "look at" method
fr: La méthode "look at"
ja: "look at"メソッド

source: As described above, using the Spatial node's ``look_at()`` method can't be used each frame to follow a target. Here is a custom ``look_at()`` method that will work reliably with rigid bodies:
fr: Comme décrit ci-dessus, l'utilisation de la méthode ``look_at()`` du nœud Spatial ne peut pas être utilisée pour chaque image pour suivre une cible. Voici une méthode personnalisée ``look_at()`` qui fonctionnera de manière fiable avec des corps rigides :
ja: 上で説明したように、Spatialノードの ``look_at()`` メソッドを使用して、各フレームをターゲットに追従させることはできません。以下は、リジットボディで確実に動作するカスタム ``look_at()`` メソッドです:

source: This method uses the rigid body's ``set_angular_velocity()`` method to rotate the body. It first calculates the difference between the current and desired angle and then adds the velocity needed to rotate by that amount in one frame's time.
fr: Cette méthode utilise la méthode ``set_angular_velocity()`` du corps rigide pour faire tourner le corps. Il calcule d'abord la différence entre l'angle actuel et l'angle désiré, puis ajoute la vitesse nécessaire pour tourner de cette valeur dans le temps d'une image.
ja: このメソッドは、リジットボディの ``set_angular_velocity()`` メソッドを使用して体を回転させます。最初に現在の角度と目的の角度の差を計算し、次に1フレームの時間内にその量だけ回転するのに必要な速度を追加します。

source: This script will not work with rigid bodies in *character mode* because then, the body's rotation is locked. In that case, you would have to rotate the attached mesh node instead using the standard Spatial methods.
fr: Ce script ne fonctionnera pas avec les corps rigides en *character mode* car la rotation du corps est alors verrouillée. Dans ce cas, vous devrez faire tourner le nœud de maillage attaché à la place en utilisant les méthodes spatiales standard.
ja: このスクリプトは、ボディの回転がロックされているため、\ *character mode* のリジッドボディでは動作しません。その場合、標準のSpatialメソッドを使用する代わりに、アタッチされたメッシュノードを回転する必要があります。
