Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/using_area_2d.po
Languages: de, ru

source: Using Area2D
de: Verwenden von Area2D
ru: Использование Area2D

source: Introduction
de: Einführung
ru: Введение

source: Godot offers a number of collision objects to provide both collision detection and response. Trying to decide which one to use for your project can be confusing. You can avoid problems and simplify development if you understand how each of them works and what their pros and cons are. In this tutorial, we'll look at the :ref:`Area2D <class_Area2D>` node and show some examples of how it can be used.
de: Godot bietet eine Reihe von Kollisionsobjekten an, um sowohl Kollisionserkennung als auch Reaktion zu ermöglichen. Der Versuch zu entscheiden, welches für Ihr Projekt verwendet werden soll, kann verwirrend sein. Sie können Probleme vermeiden und die Entwicklung vereinfachen, wenn Sie verstehen wie sie funktionieren und welche Vor- und Nachteile sie haben. In dieser Anleitung sehen wir uns den Node :ref:`Area2D <class_Area2D>` an und zeigen einige Beispiele, wie er verwendet werden kann.
ru: Godot предлагает ряд объектов столкновений в 2D и 3D как для обнаружения столкновений, так и для реагирования на них. Определение, какие из них использовать в Вашем проекте, может оказаться сложным. Избежать проблем и упростить разработку можно, если понимать, как работает каждый из них и каковы его достоинства и недостатки. В этом учебном пособии мы рассмотрим узел :ref:`Area2D <class_Area2D>` и покажем некоторые примеры его использования.

source: This document assumes you're familiar with Godot's various physics bodies. Please read :ref:`doc_physics_introduction` first.
de: In diesem Dokument wird davon ausgegangen, dass Sie mit den verschiedenen physikalischen Körpern von Godot vertraut sind. Bitte lesen Sie zuerst :ref:`doc_physics_introduction`.
ru: Этот документ предполагает, что вы знакомы с различными физическими телами Godot. Сначала прочитайте :ref:`doc_physics_introduction`.

source: What is an area?
de: Was ist ein Bereich?
ru: Что такое область?

source: An Area2D defines a region of 2D space. In this space you can detect other :ref:`CollisionObject2D <class_CollisionObject2D>` nodes overlapping, entering, and exiting. Areas also allow for overriding local physics properties. We'll explore each of these functions below.
de: Eine Area2D definiert einen Bereich im 2D Raum. Innerhalb dieses Bereichs werden andere :ref:`CollisionObject2D <class_CollisionObject2D>`-Nodes beim ein- und austreten sowie überschneiden erkannt. Diese Bereiche erlauben es auch physikalische Eigenschaften außer Kraft zu setzen. Wir werden auf jede dieser Funktionen genauer eingehen.
ru: Area2D определяет область в 2D пространстве. В этой области можно обнаруживать перекрытия, вхождения и выходы с другими узлами :ref:`CollisionObject2D <class_CollisionObject2D>`. Области также позволяют переопределять свойства локальной физики. Ниже мы рассмотрим каждую из этих функций.

source: Area properties
de: Bereichs-Eigenschaften
ru: Свойства области

source: Areas have many properties you can use to customize their behavior.
de: Bereiche haben viele Eigenschaften, mit denen Sie ihr Verhalten anpassen können.
ru: Области имеют множество свойств, которые можно использовать для настройки их поведения.

source: The first eight properties are used to configure the area's physics override behavior. We'll look at how to use those in the section below.
de: Die ersten acht Eigenschaften werden verwendet, um das physikalische Überschreibungsverhalten des Bereichs zu konfigurieren. Wir werden uns im folgenden Abschnitt ansehen, wie diese verwendet werden.
ru: Первые восемь свойств используются для переопределения поведения физики области. Мы рассмотрим, как использовать их в разделе ниже.

source: *Monitoring* and *Monitorable* are used to enable and disable the area.
de: *Monitoring* und *Monitorable* werden verwendet, um den Bereich zu aktivieren und zu deaktivieren.
ru: *Monitoring* и *Monitorable* используются для включения и отключения области.

source: The "Collision" section is where you configure the area's collision layer(s) and mask(s).
de: Im Abschnitt "Collision" konfigurieren Sie die Kollisionsebene(n) und die Maske(n) des Bereichs.
ru: В разделе «Collision» настраиваются слои столкновений и масок области.

source: The "Audio Bus" section allows you to override audio in the area, for example to apply an audio effect when the player moves through.
de: Im Abschnitt "Audiobus" können Sie Audio in dem Bereich überschreiben, um beispielsweise einen Audioeffekt anzuwenden, wenn sich der Spieler hindurch bewegt.
ru: Раздел «Audio Bus» позволяет переопределить звук в области, например, применить звуковой эффект при прохождении через неё игрока.

source: Note that Area2D extends :ref:`CollisionObject2D <class_CollisionObject2D>`, so it also provides properties inherited from that class, such as ``input_pickable``.
de: Beachten Sie, dass Area2D :ref:`CollisionObject2D <class_CollisionObject2D>` erweitert, sodass auch Eigenschaften bereitgestellt werden, die von dieser Klasse geerbt wurden, z.B. ``input_pickable``.
ru: Обратите внимание, что Area2D расширяет :ref:`CollisionObject2D <class_CollisionObject2D>`, поэтому также предоставляет свойства, унаследованные от этого класса, такие как ``input_pickable``.

source: Overlap detection
de: Überlagerung erkennen
ru: Обнаружение перекрытий

source: Perhaps the most common use of Area2D nodes is for contact and overlap detection. When you need to know that two objects have touched, but don't need physical collision, you can use an area to notify you of the contact.
de: Möglicherweise werden Area2D-Nodes am häufigsten zur Kontakt- und Überlappungserkennung verwendet. Wenn Sie wissen müssen, ob sich zwei Objekte berührt haben, aber keine physische Kollision benötigt wird, können Sie solch einen Bereich verwenden, um Sie über den Kontakt zu informieren.
ru: Возможно, наиболее распространенным использованием узлов Area2D является обнаружение контактов и перекрытий. Если нужно знать, что два объекта коснулись, но они не нуждаются в симуляции физического столкновения, можно использовать область для уведомления о контакте.

source: For example, let's say we're making a coin for the player to pick up. The coin is not a solid object - the player can't stand on it or push it - we just want it to disappear when the player touches it.
de: Nehmen wir zum Beispiel an, wir machen eine Münze, die der Spieler aufheben kann. Die Münze ist kein festes Objekt (der Spieler kann nicht darauf stehen oder sie schieben) wir möchten nur, dass sie verschwindet, wenn der Spieler sie berührt.
ru: Например, мы делаем монету для игрока. Монета не является твердым объектом. Игрок не может стоять на ней или толкать её. Мы просто хотим, чтобы она исчезла, когда игрок прикасается к ней.

source: Here's the node setup for the coin:
de: Hier ist das Node-Setup für die Münze:
ru: Вот настройка узла для монеты:

source: To detect the overlap, we'll connect the appropriate signal on the Area2d. Which signal to use depends on the player's node type. If the player is another area, use ``area_entered``. However, let's assume our player is a ``KinematicBody2D`` (and therefore a ``CollisionObject2D`` type), so we'll connect the ``body_entered`` signal.
de: Um die Überlappung zu erkennen, verbinden wir das entsprechende Signal mit dem Area2d. Welches Signal verwendet werden soll, hängt vom Knotentyp des Spielers ab. Wenn der Spieler ein anderer Bereich ist, verwenden Sie ``area_entered``. Nehmen wir jedoch an, unser Spieler ist ein ``KinematicBody2D`` (und daher ein ``CollisionObject2D``-Typ), also verbinden wir das ``body_entered``-Signal.
ru: Чтобы обнаружить перекрытие, мы подключим соответствующий сигнал к Area2d. Используемый сигнал зависит от типа узла игрока. Если игрок является другой областью, используйте ``area_entered``. Однако предположим, что наш игрок является ``KinematicBody2D`` (и, следовательно, типом ``CollisionObject2D``), поэтому мы подключим сигнал ``body_entered``.

source: If you're not familiar with using signals, see :ref:`doc_signals` for an introduction.
de: Wenn Sie mit der Verwendung von Signalen nicht vertraut sind, finden Sie eine Einführung unter :ref:`doc_signals`.
ru: Если вы не знакомы с использованием сигналов, см. :ref:`doc_signals` для введения.

source: Now our player can collect the coins!
de: Jetzt kann unser Spieler die Münzen sammeln!
ru: Теперь наш игрок может собирать монеты!

source: Some other usage examples:
de: Weitere nützliche Beispiele:
ru: Некоторые другие примеры использования:

source: Areas are great for bullets and other projectiles that hit and deal damage, but don't need any other physics such as bouncing.
de: Bereiche eignen sich hervorragend für Geschosse und andere Projektile, die treffen und Schaden verursachen, aber keine andere Physik wie das Abprallen benötigen.
ru: Области отлично подходят для пуль и других снарядов, которые поражают и наносят ущерб, но не нуждаются в какой-либо другой физике, такой как отскок.

source: Use a large circular area around an enemy to define its "detect" radius. When the player is outside the area, the enemy can't "see" it.
de: Verwenden Sie eine große kreisförmige Fläche um einen Feind, um dessen "Erkennungs"-Radius zu definieren. Wenn sich der Spieler außerhalb des Gebiets befindet, kann der Feind es nicht "sehen".
ru: Используйте большую круговую область вокруг противника для задания радиуса обнаружения. Когда игрок находится за пределами области противник не может его «увидеть».

source: "Security cameras" - In a large level with multiple cameras, attach areas to each camera and activate them when the player enters.
de: "Überwachungskameras" - Befestigen Sie in einem großen Level mit mehreren Kameras Bereiche an jeder Kamera und aktivieren Sie sie, wenn der Spieler eintritt.
ru: «Камеры безопасности» — на большом уровне с несколькими камерами прикрепите области к каждой камере и активируйте их при входе игрока.

source: See the :ref:`doc_your_first_game` for an example of using Area2D in a game.
de: Siehe :ref:`doc_your_first_game` für ein Beispiel eines Spiels, dass Area2D verwendet.
ru: Пример использования Area2D в игре см. в разделе :ref:`doc_your_first_game`.

source: Area influence
de: Bereichseinfluss
ru: Области влияния

source: The second major use for area nodes is to alter physics. By default, the area won't do this, but you can enable this with the *Space Override* property. When areas overlap, they are processed in *Priority* order (higher priority areas are processed first). There are four options for override:
de: Die zweite Hauptanwendung für Area-Nodes ist die Veränderung der Physik. Standardmäßig wird der Bereich dies nicht tun, aber Sie können dies mit der Eigenschaft *Space Override* aktivieren. Wenn sich Bereiche überschneiden, werden sie der Reihe nach entsprechend ihrer *Priorität* verarbeitet (Bereiche mit höherer Priorität werden zuerst verarbeitet). Es gibt vier Optionen zum Überschreiben:
ru: Второе основное использование узлов области состоит в изменении физики. По умолчанию область этого делать не будет, но это можно включить с помощью свойства *Space Override*. Если области перекрываются, они обрабатываются в порядке *Priority* (сначала обрабатываются области с более высоким приоритетом). Существует четыре варианта переопределения:

source: *Combine* - The area adds its values to what has been calculated so far.
de: *Combine* - Der Bereich addiert seine Werte zu den bisher berechneten Werten.
ru: *Combine* — область добавляет свои значения к вычисленным на данный момент значениям.

source: *Replace* - The area replaces physics properties, and lower priority areas are ignored.
de: *Replace* - Der Bereich ersetzt physikalische Eigenschaften, und Bereiche mit niedrigerer Priorität werden ignoriert.
ru: *Replace* — область заменяет физические свойства, а области с более низким приоритетом игнорируются.

source: *Combine-Replace* - The area adds its gravity/damping values to whatever has been calculated so far (in priority order), ignoring any lower priority areas.
de: *Combine-Replace* - Der Bereich addiert seine Schwerkraft-/Dämpfungswerte zu den bisher berechneten Werten (in Prioritätsreihenfolge), wobei Bereiche mit niedrigerer Priorität ignoriert werden.
ru: *Combine-Replace* — область добавляет свои значения силы тяжести/упругости к тем значениям, которые были рассчитаны до этого момента (в порядке приоритета), игнорируя любые области с более низким приоритетом.

source: *Replace-Combine* - The area replaces any gravity/damping calculated so far, but keeps calculating the rest of the areas.
de: *Replace-Combine* - Der Bereich ersetzt die bisher berechnete Schwerkraft/Dämpfung, berechnet jedoch weiterhin den Rest des Bereichs.
ru: *Replace-Combine* — область заменяет любую рассчитанную до этого момента гравитацию/упругость, но продолжает вычислять остальные области.

source: Using these properties, you can create very complex behavior with multiple overlapping areas.
de: Mit diesen Eigenschaften können Sie ein sehr komplexes Verhalten mit mehreren überlappenden Bereichen erstellen.
ru: С помощью этих свойств можно создать очень сложное поведение с несколькими перекрывающимися областями.

source: The physics properties that can be overridden are:
de: Die physikalischen Eigenschaften, die überschrieben werden können, sind:
ru: Физические свойства, которые можно переопределить:

source: *Gravity* - Gravity's strength inside the area.
de: *Gravity* - Die Stärke der Schwerkraft innerhalb des Gebiets.
ru: *Gravity* — Сила гравитации внутри области.

source: *Gravity Vec* - Gravity's direction. This vector does not need to be normalized.
de: *Gravity Vec* - Richtung der Schwerkraft. Dieser Vektor muss nicht normalisiert werden.
ru: *Gravity Vec* — Направление силы тяжести. Этот вектор не нуждается в нормализации.

source: *Linear Damp* - How quickly objects stop moving - linear velocity lost per second.
de: *Linear Damp* - Wie schnell sich Objekte nicht mehr bewegen - lineare Geschwindigkeit pro Sekunde verlieren.
ru: *Linear Damp* — Как быстро объекты перестают двигаться — уменьшение линейной скорости в секунду.

source: *Angular Damp* - How quickly objects stop spinning - angular velocity lost per second.
de: *Angular Damp* - Wie schnell sich Objekte nicht mehr drehen - Winkelgeschwindigkeit pro Sekunde verlieren.
ru: *Angular Damp* — Как быстро объекты перестают вращаться — уменьшение угловой скорости в секунду.

source: Point gravity
de: Punktgravitation
ru: Точечная сила тяжести

source: The *Gravity Point* property allows you to create an "attractor". Gravity in the area will be calculated towards a point, given by the *Gravity Vec* property. Values are relative to the Area2D, so for example using ``(0, 0)`` will attract objects to the center of the area.
de: Mit der Eigenschaft *Gravity Point* können Sie einen "Attraktor" erstellen. Die Schwerkraft in dem Gebiet wird in Richtung eines Punktes berechnet, der durch die Eigenschaft *Gravity Vec* angegeben wird. Die Werte beziehen sich auf Area2D, beispielsweise werden durch ``(0, 0)`` Objekte in die Mitte des Bereichs gezogen.
ru: Свойство *Gravity Point* позволяет создать «аттрактор». Гравитация в области будет рассчитываться в направлении точки, заданной свойством *Gravity Vec*. Значения относятся к Area2D, поэтому, например, использование ``(0, 0)`` будет притягивать объекты в центр области.

source: Examples
de: Beispiele
ru: Примеры

source: The example project attached below has three areas demonstrating physics override.
de: Das unten angehängte Beispielprojekt enthält drei Bereiche, in denen die Außerkraftsetzung der Physik demonstriert wird.
ru: Приведенный ниже пример проекта имеет три области, демонстрирующие переопределение физики.

source: You can download this project here: :download:`using_area_2d.zip <files/using_area_2d.zip>`
de: Das Projekt steht hier zum download bereit: :download:`using_area_2d.zip <files/using_area_2d.zip>`
ru: Вы можете скачать этот проект здесь: :download:`using_area_2d.zip <files/using_area_2d.zip>`
