Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/development/compiling/compiling_for_web.po
Languages: fr, ja, ru, zh_cn, zh_tw

source: Compiling for the Web
fr: Compilation pour le Web
ja: Web用のコンパイル
zh_cn: 为Web平台编译
zh_tw: 為網頁平台進行編譯

source: Requirements
fr: Pré-requis
ja: 必要条件
ru: Требования
zh_cn: 需求
zh_tw: 系統需求

source: To compile export templates for the Web, the following is required:
fr: Pour compiler des modèles d'exportation pour le Web, ce qui suit est nécessaire :
ja: Webのエクスポートテンプレートをコンパイルするには、次のことが必要です:
ru: Для составления шаблонов экспорта для Web необходимо следующее:
zh_cn: 要编译Web的导出模板，需要以下内容:
zh_tw: 要為網頁平台進行編譯，需滿足下列需求：

source: `SCons 3.0+ <https://www.scons.org>`__ build system.
fr: `SCons 3.0+ <https://www.scons.org>`__ système de construction(build).
ja: `3.0以降のSCons <https://scons.org/pages/download.html>`_ ビルドシステム。
zh_tw: `SCons 3.0+ <https://www.scons.org>`__ 建置系統。

source: For a general overview of SCons usage for Godot, see :ref:`doc_introduction_to_the_buildsystem`.
fr: Pour un aperçu général de l'utilisation de SCons pour Godot, voir :ref:`doc_introduction_to_the_buildsystem`.
ja: Godotにおける基本的なSconsの使い方については、\ :ref:`doc_introduction_to_the_buildsystem`\ を参照してください。
ru: Для общего обзора использования SCons в Godot, смотрите :ref:`doc_introduction_to_the_buildsystem`.
zh_cn: 有关Godot的SCons用法的一般概述，请参阅 :ref:`doc_introduction_to_the_buildsystem`。
zh_tw: 有關配合 Godot 使用 SCons 的一般說明，請參考 :ref:`doc_introduction_to_the_buildsystem` 。

source: Building export templates
fr: Création de modèles d'exportation
ja: エクスポートテンプレートの構築
zh_cn: 构建导出模板
zh_tw: 建置匯出樣板

source: Before starting, confirm that ``emcc`` is available in your PATH. This is usually configured by the Emscripten SDK, e.g. when invoking ``emsdk activate`` and ``source ./emsdk_env.sh``/``emsdk_env.bat``.
fr: Avant de commencer, confirmez que ``emcc`` est disponible dans votre PATH. Ceci est généralement configuré par le SDK Emscripten, par exemple lors de l'invocation de ``emsdk activate`` et ``source ./emsdk_env.sh``/``emsdk_env.bat``.
ru: Перед началом работы убедитесь, что ``emcc`` доступен в вашем PATH. Обычно это настраивается Emscripten SDK, например, при вызове ``emsdk activate`` и ``source ./emsdk_env.sh``/ ``emsdk_env.bat``.

source: Open a terminal and navigate to the root directory of the engine source code. Then instruct SCons to build the JavaScript platform. Specify ``target`` as either ``release`` for a release build or ``release_debug`` for a debug build::
fr: Ouvrez un terminal et naviguez jusqu'au répertoire racine du code source du moteur. Ensuite, demandez à SCons de construire la plate-forme JavaScript. Spécifiez ``target`` comme étant soit ``release`` pour une version release, soit ``release_debug`` pour une version de débogage :
ja: ターミナルを開き、エンジンソース コードのルートディレクトリに移動します。次に、SConsにJavaScriptプラットフォームの構築を指示します。 ``target`` をリリース ビルドの ``release`` またはデバッグ ビルドの ``release_debug`` として指定します:
ru: Откройте терминал и перейдите в корневой каталог исходного кода движка. Затем дайте команду SCons на сборку платформы JavaScript. Укажите ``target`` либо как ``release`` для сборки release, либо как ``release_debug`` для сборки debug::
zh_cn: 打开终端并导航到引擎源代码的根目录。 然后指示SCons构建JavaScript平台。 将 ``target`` 指定为发布版本的 ``release`` 或调试版本的``release_debug`` ::
zh_tw: 開啟終端機，並移至 Godot 原始碼的根目錄。接著使用 SCons 來為 JavaScript 平台建置。將如果要建置正式版本，請將 ``target`` 指定為 ``release`` ，若要建置除錯版本，請將 ``target`` 指定為 ``release_debug`` ：

source: By default, the :ref:`JavaScript singleton <doc_javascript_eval>` will be built into the engine. Official export templates also have the JavaScript singleton enabled. Since ``eval()`` calls can be a security concern, the ``javascript_eval`` option can be used to build without the singleton::
fr: Par défaut, le :ref:`singleton JavaScript <doc_javascript_eval>` sera compiler dans le moteur.. Les modèles d'exportation officiels ont également le JavaScript singleton activé. Comme les appels ``eval()`` peuvent être un problème de sécurité, l'option ``javascript_eval`` peut être utilisée pour compiler sans le singleton :
ru: По умолчанию в движок будет встроен :ref:`JavaScript синглтон <doc_javascript_eval>`. В официальных шаблонах экспорта также включен синглтон JavaScript. Поскольку вызовы ``eval()`` могут представлять угрозу безопасности, опция ``javascript_eval`` может быть использована для сборки без синглтона::
zh_tw: 預設情況下， :ref:`JavaScript 單例 <doc_javascript_eval>` 會被建置至引擎內。官方的匯出樣板中也有開啟 JavaScript 單例。由於 ``eval`` 呼叫有安全性疑慮，因此可以通過 ``javascript_eval`` 選項來建置不包含該單例的版本：

source: The engine will now be compiled to WebAssembly by Emscripten. Once finished, the resulting file will be placed in the ``bin`` subdirectory. Its name is ``godot.javascript.opt.zip`` for release or ``godot.javascript.opt.debug.zip`` for debug.
fr: Le moteur sera maintenant compilé en WebAssembly par Emscripten. Une fois terminé, le fichier résultant sera placé dans le sous-répertoire ``bin``. Son nom est ``godot.javascript.opt.zip`` pour une version release ou ``godot.javascript.opt.debug.zip`` pour une version de débogage.
ja: これで、エンジンはEmscriptenによってWebAssemblyにコンパイルされます。完了すると、結果のファイルは ``bin`` サブディレクトリに配置されます。名前は ``godot.javascript.opt.zip`` (リリース用)か、``godot.javascript.opt.debug.zip``(デバッグ用)です。
ru: Теперь движок будет скомпилирован в WebAssembly с помощью Emscripten. После завершения работы полученный файл будет помещен в подкаталог ``bin``. Его имя будет ``godot.javascript.opt.zip`` для релиза или ``godot.javascript.opt.debug.zip`` для отладки.
zh_cn: 现在，引擎将由Emscripten编译为WebAssembly。 完成后，生成的文件将放在 ``bin`` 子目录中。 它的名字是``godot.javascript.opt.zip`` for release或``godot.javascript.opt.debug.zip`` for debug。
zh_tw: 引擎會通過 Emscripten 來編譯至 WebAssembly。完成之後，產生的檔案會被放在 ``bin`` 子資料夾中。正式版本 (release) 的檔案名稱為 ``godot.javascript.opt.zip`` ，除錯版本 (debug) 為 ``godot.javascript.opt.debug.zip`` 。

source: Finally, rename the zip archive to ``webassembly_release.zip`` for the release template::
fr: Enfin, renommez l'archive zip en ``webassembly_release.zip`` pour le modèle release :
ja: 最後に、リリース テンプレートのzipアーカイブの名前を ``webassembly_release.zip`` に変更します:
ru: Наконец, переименуйте zip-архив в ``webassembly_release.zip`` для шаблона релиза::
zh_cn: 最后，将zip存档重命名为 ``webassembly_release.zip`` 以获取发布模板::
zh_tw: 最後，將用於正式樣板 (release) 的 ZIP 檔重新命名為 ``webassembly_release.zip`` ：

source: And ``webassembly_debug.zip`` for the debug template::
fr: Et ``webassembly_debug.zip`` pour le modèle de débogage :
ja: デバッグテンプレートの ``webassembly_debug.zip`` :
ru: И ``webassembly_debug.zip`` для отладочного шаблона::
zh_cn: 调试模板的``webassembly_debug.zip`` ::
zh_tw: 並將用於除錯樣板 (debug) 的 ZIP 檔重新命名為 ``webassembly_release.zip`` ：

source: Threads and GDNative
fr: Threads et GDNative

source: The default export templates do not include threads and GDNative support for performance and compatibility reasons. See the :ref:`export page <doc_javascript_export_options>` for more info.
fr: Les modèles d'exportation par défaut n'incluent pas le support des threads et de GDNative pour des raisons de performance et de compatibilité. Voir la page :ref:`export <doc_javascript_export_options>` pour plus d'informations.
ru: Шаблоны экспорта по умолчанию не включают поддержку потоков и GDNative по причинам производительности и совместимости. Дополнительную информацию см. на странице :ref:`экспорт <doc_javascript_export_options>`.

source: You can build the export templates using the option ``threads_enabled=yes`` or ``gdnative_enabled=yes`` to enable threads or GDNative support::
fr: Vous pouvez compiler les modèles d'exportation en utilisant l'option ``threads_enabled=yes`` ou ``gdnative_enabled=yes`` pour activer les threads ou le support GDNative :
ru: Вы можете создавать шаблоны экспорта, используя опцию ``threads_enabled=yes`` или ``gdnative_enabled=yes`` для включения поддержки потоков или GDNative::

source: Once finished, the resulting file will be placed in the ``bin`` subdirectory. Its name will have either the ``.threads`` or ``.gdnative`` suffix.
fr: Une fois terminé, le fichier résultant sera placé dans le sous-répertoire ``bin``. Son nom aura le suffixe ``.threads`` ou ``.gdnative``.
ru: По завершению итоговый файл будет сохранен в подкаталог ``bin``. Его имя будет иметь либо суффикс ``.threads``, либо ``.gdnative``.

source: Finally, rename the zip archives to ``webassembly_release_threads.zip`` and ``webassembly_release_gdnative.zip`` for the release template::
fr: Enfin, renommez les archives zip en ``webassembly_release_threads.zip`` et ``webassembly_release_gdnative.zip`` pour le modèle release :
ru: Наконец, переименуйте zip-архивы в ``webassembly_release_threads.zip`` и ``webassembly_release_gdnative.zip`` для шаблона релиза::

source: And ``webassembly_debug_threads.zip`` and ``webassembly_debug_gdnative.zip`` for the debug template::
fr: Et ``webassembly_debug_threads.zip`` et ``webassembly_debug_gdnative.zip`` pour le modèle de débogage :
ru: И ``webassembly_debug_threads.zip`` и ``webassembly_debug_gdnative.zip`` для шаблона отладки::

source: Building the Editor
fr: Compilation de l'éditeur
ru: Сборка редактора

source: It is also possible to build a version of the Godot editor that can run in the browser. The editor version requires threads support and is not recommended over the native build. You can build the editor with::
fr: Il est également possible de compiler une version de l'éditeur Godot qui peut fonctionner dans le navigateur. La version de l'éditeur nécessite le support des threads et n'est pas recommandée par rapport à la version native. Vous pouvez compiler l'éditeur avec :
ru: Также можно собрать версию редактора Godot, которая может работать в браузере. Версия редактора требует поддержки потоков и не рекомендуется к использованию вместо нативной сборки. Вы можете собрать редактор с помощью::

source: Once finished, the resulting file will be placed in the ``bin`` subdirectory. Its name will be ``godot.javascript.opt.tools.threads.zip``. You can upload the zip content to your web server and visit it with your browser to use the editor.
fr: Une fois terminé, le fichier résultant sera placé dans le sous-répertoire ``bin``. Son nom sera ``godot.javascript.opt.tools.threads.zip``. Vous pouvez télécharger le contenu du zip sur votre serveur web et le visiter avec votre navigateur pour utiliser l'éditeur.
ru: После завершения работы полученный файл будет помещен в подкаталог ``bin``. Его имя будет ``godot.javascript.opt.tools.threads.zip``. Вы можете загрузить содержимое zip-файла на свой веб-сервер и посетить его с помощью браузера, чтобы воспользоваться редактором.

source: Refer to the :ref:`export page <doc_javascript_export_options>` for the web server requirements.
fr: Reportez-vous à la :ref:`page exportation <doc_javascript_export_options>` pour connaître la configuration requise du serveur Web.
ru: Требования к веб-серверу см. на странице :ref:`экспорта <doc_javascript_export_options>`.

source: `Python 3.5+ <https://www.python.org/>`__.
ja: `Python 3.5 以降 <https://www.python.org/>`_\ 。

source: Before starting, confirm that the Emscripten configuration file exists and specifies all settings correctly. This file is available as ``~/.emscripten`` on UNIX-like systems and ``%USERPROFILE%\.emscripten`` on Windows. It's usually written by the Emscripten SDK, e.g. when invoking ``emsdk activate latest``, or by your package manager. It's also created when starting Emscripten's ``emcc`` program if the file doesn't exist.
ja: 開始する前に、Emscripten構成ファイルが存在することを確認し、すべての設定を正しく指定します。このファイルは、UNIX ライクなシステムでは``~/.emscripten`` 、Windows では ``%USERPROFILE%\.emscripten`` として使用できます。通常はEmscripten SDKで書かれていて、例えば ``emsdk activate latest`` を起動した時や、またはパッケージマネージャによって呼び出す場合、また、ファイルが存在しない場合、Emscriptenの ``emcc`` プログラムを開始するときに作成されます。
zh_cn: 在开始之前，请确认Emscripten配置文件存在并正确指定所有设置。 这个文件在类UNIX系统上可用作``〜/ .emscripten``，在Windows上可用``％USERPROFILE％\。emscripten``。 它通常由Emscripten SDK编写，例如 当调用``emsdk activate latest``时，或者由您的包管理器调用。 如果文件不存在，它也会在启动Emscripten的``emcc``程序时创建。
zh_tw: 在開始前，請確保有 Emscripten 組態設定檔，並確定所有設定都正確。該檔案在類 UNIX 系統上位於 ``~/.emscripten`` ，Windows 上則為 ``%USERPROFILE%\.emscripten``。該檔案通常會由 Emscripten SDK 寫入，如呼叫 ``emsdk activate latest`` 時，或是由套件管理員寫入。另外，在開啟 Emscripten 的 ``emcc`` 程式時若該檔案不存在也會建立。

source: On Windows, make sure to escape backslashes of paths within the Emscripten configuration file as double backslashes ``\\`` or use Unix-style paths with a single forward slash ``/``.
ja: Windowsでは、Emscripten構成ファイル内のパスのバックスラッシュを二重のバックスラッシュ ``\\`` としてエスケープするか、単一のスラッシュ ``/`` でUnixスタイルのパスを使用してください。
zh_cn: 在Windows平台上，确保将Emscripten配置文件中的路径反斜杠，转义为双反斜杠“\\”，或者使用带有单个正斜杠“/”的unix样式的路径。
zh_tw: 在 Windows 上請確保在 Emscripten 設定檔中有轉譯反斜線，即寫成兩個反斜線 ``\\`` 。或者也可以使用 Unix 風格的單一斜線 ``/`` 。

source: By default, the :ref:`JavaScript singleton <doc_javascript_eval>` will be built into the engine. Since ``eval()`` calls can be a security concern, the ``javascript_eval`` option can be used to build without the singleton::
ja: デフォルトでは、\ :ref:`JavaScriptシングルトン <doc_javascript_eval>`\ がエンジンに組み込まれます。 ``eval()`` '呼び出しはセキュリティ上の問題になる可能性があるため、 ``javascript_eval`` オプションを使用してシングルトンなしでビルドできます:
zh_cn: 默认情况下，引用内置 :ref:`JavaScript singleton <doc_javascript_eval>` 。 由于 ``eval()`` 调用可能是一个安全问题， ``javascript_eval`` 选项可用于构建而不需要单例::

source: Building per asm.js translation or LLVM backend
ja: \ asm.js変換または LLVMバックエンドごとのビルド
zh_cn: 根据asm.js转换或LLVM后端构建
zh_tw: 以 asm.js 轉譯或 LLVM 後端進行建置

source: WebAssembly can be compiled in two ways: The default is to first compile to asm.js, a highly optimizable subset of JavaScript, using Emscripten's *fastcomp* fork of LLVM. This code is then translated to WebAssembly using a tool called ``asm2wasm``. Emscripten automatically takes care of both processes, we simply run SCons.
ja: WebAssemblyは2つの方法でコンパイルできます。デフォルトでは、EmscriptenのLLVMの\ *fastcomp*\ フォークを使用して、JavaScriptの高度に最適化可能なサブセットであるasm.jsに最初にコンパイルします。 このコードは、 ``asm2wasm`` というツールを使用してWebAssemblyに変換されます。 Emscriptenは両方のプロセスを自動的に処理します。SConsを実行するだけです。
zh_cn: WebAssembly可以用两种方式编译:默认是首先使用Emscripten的* fastcomp * LLVM分支编译为asm.js，这是一个高度可优化的JavaScript子集。 然后使用名为 ``asm2wasm`` 的工具将此代码转换为WebAssembly。 Emscripten会自动处理这两个进程，我们只需运行SCons。
zh_tw: WebAssembly 可以通過兩種方式來編譯：預設的方法是通過 Emscripten 的 **fastcomp** LLVM 分支來先編譯為 asm.js —— 一種高度最佳化的 JavaScript 子集。這個程式碼會再使用 ``asm2wasm`` 工具程式來轉譯為 WebAssembly。Emscripten 會自動處理這兩個過程，我們只要執行 SCons 就好了。

source: The other method uses LLVM's WebAssembly backend. This backend is available starting with LLVM 8 or in development builds. Emscripten manages this process as well, so we just invoke SCons.
ja: もう1つの方法は、LLVMのWebAssemblyバックエンドを使用します。このバックエンドは、LLVM 8以降または開発ビルドで利用可能です。 Emscriptenはこのプロセスも管理するため、SConsを呼び出します。
zh_tw: 另一個方法是使用 LLVM 的 WebAssembly 後端。這個後端可以在 LLVM 8 之後的版本或開發分支中使用。Emscripten 一樣會處理這個過程，因此我們只需要呼叫 SCons。

source: In order to choose one of the two methods, the ``LLVM_ROOT`` variable in the Emscripten configuration file is used. If it points to a directory containing binaries of Emscripten's *fastcomp* fork of clang, ``asm2wasm`` is used. This is the default in a normal Emscripten installation. Otherwise, LLVM binaries built with the WebAssembly backend will be expected and the LLVM's WebAssembly backend is used.
ja: 2つの方法のいずれかを選択するために、Emscripten構成ファイルの ``LLVM_ROOT`` 変数が使用されます。Emscriptenのclangの *fastcomp* フォークのバイナリを含むディレクトリを指している場合、\ ``asm2wasm`` が使用されます。これは、通常のEmscriptenインストールのデフォルトです。それ以外の場合、WebAssemblyバックエンドで構築されたLLVMバイナリが期待され、LLVMのWebAssemblyバックエンドが使用されます。
zh_tw: 若要從這兩種方法中選擇，可以使用 Emscripten 設定檔中的 ``LLVM_ROOT`` 變數。若該變數指向了包含 Emscripten **fastcomp** 分支 clang 二進位檔的資料夾，則會使用 ``asm2wasm`` 。在一般的 Emscripten 安裝中，此選項為預設。否則，Emscripten 會在該資料夾中尋找包含 WebAssembly 後端的 LLVM 二進位檔，然後使用 LLVM 的 WebAssembly 後端。

source: `Python 2.7+ or Python 3.5+ <https://www.python.org/>`__
zh_cn: `Python 2.7+或Python 3.5+ <https://www.python.org/>`__

source: `SCons <https://www.scons.org>`__ build system
zh_cn: `SCons <https://www.scons.org>`__构建系统
