Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/development/compiling/cross-compiling_for_ios_on_linux.po
Languages: de

source: Cross-compiling for iOS on Linux
de: Cross-Compiling für iOS unter Linux

source: Disclaimer
de: Haftungsausschluss

source: Requirements
de: Voraussetzungen

source: `XCode with the iOS SDK <https://developer.apple.com/xcode/download>`__ (a dmg image)
de: `XCode mit dem iOS SDK <https://developer.apple.com/xcode/download>`__ (ein dmg-Bild)

source: `Fuse <https://github.com/libfuse/libfuse>`__ for mounting and umounting the dmg image.
de: `Sicherung <https://github.com/libfuse/libfuse>`__ zum Einbinden und Freigeben des dmg-Images.

source: This also has some extra dependencies: automake, autogen, libtool.
de: Dies hat auch einige zusätzliche Abhängigkeiten: automake, autogen, libtool.

source: Configuring the environment
de: Umgebung konfigurieren

source: Clone the repository on your machine:
de: Klonen Sie das Repository auf Ihrem Computer:

source: Build it:
de: Baue es:

source: Preparing the SDK
de: SDK vorbereiten

source: Mount the XCode image:
de: Einbinden des XCode image:

source: Extract the iOS SDK:
de: Extrahieren des iOS SDK:

source: Pack the SDK:
de: SDK packen:

source: Build cctools:
de: cctools bauen:

source: Now you should have the iOS toolchain binaries in ``/home/user/iostoolchain/usr/bin``.
de: Jetzt sollten Sie die iOS-Toolchain-Binärdateien in ``/home/user/iostoolchain/usr/bin`` haben.

source: Compiling Godot for iPhone
de: Godot für iPhone kompilieren

source: Once you've done the above steps, you should keep two things in your environment: the built toolchain and the iPhoneOS SDK directory. Those can stay anywhere you want since you have to provide their paths to the SCons build command.
de: Sobald Sie die oben genannten Schritte ausgeführt haben, sollten Sie zwei Dinge in Ihrer Umgebung behalten: die erstellte Toolchain und das iPhoneOS SDK-Verzeichnis. Diese können überall bleiben, da Sie ihre Pfade zum SCons-Build-Befehl angeben müssen.

source: For the iPhone platform to be detected, you need the ``OSXCROSS_IOS`` environment variable defined to anything.
de: Damit die iPhone-Plattform erkannt werden kann, muss die Umgebungsvariable ``OSXCROSS_IOS`` für alles definiert sein.

source: Now you can compile for iPhone using SCons like the standard Godot way, with some additional arguments to provide the correct paths:
de: Jetzt können Sie mit SCons für das iPhone nach dem Standard-Godot-Weg kompilieren, mit einigen zusätzlichen Argumenten, um die richtigen Pfade anzugeben:

source: Producing fat binaries
de: Fette Binärdateien produzieren

source: Then you will have iOS fat binaries in ``bin`` directory.
de: Dann werden Sie iOS Fat-Binärdateien im Verzeichnis ``bin`` haben.
