Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/development/compiling/getting_source.po
Languages: es, zh_cn

source: Getting the source
es: Consiguiendo el código fuente
zh_cn: 获取源代码

source: Downloading the Godot source code
es: Descargando el código fuente de Godot
zh_cn: 下载 Godot 源代码

source: Before :ref:`getting into the SCons build system <doc_introduction_to_the_buildsystem>` and compiling Godot, you need to actually download the Godot source code.
es: Antes de :ref:`adentrarnos en el sistema de construcción SCons <doc_introduction_to_the_buildsystem>` y compilar Godot, necesitas descargar el código fuente.
zh_cn: 在 :ref:`进入SCons 构建系统 <doc_introduction_to_the_buildsystem>` 并编译 Godot 之前, 您需要将 Godot 的源代码下载到本地.

source: The source code is available on `GitHub <https://github.com/godotengine/godot>`__ and while you can manually download it via the website, in general you want to do it via the ``git`` version control system.
es: El código fuente está disponible en `GitHub <https://github.com/godotengine/godot>`__ y aunque puedes descargarlo de manera manual desde la página web, en general deberías hacerlo a través del sistema de control de versiones ``git``.
zh_cn: 源代码位于 `GitHub <https://github.com/godotengine/godot>`__ 上, 虽然您可以通过网站手动下载它, 但是通常您希望通过 ``git`` 版本控制系统来下载.

source: If you are compiling in order to make contributions or pull requests, you should follow the instructions from the :ref:`Pull Request workflow <doc_pr_workflow>`.
zh_cn: 如果你是为了做贡献或拉动请求而进行编译, 你应该遵循 :ref:`拉动请求工作流 <doc_pr_workflow>` 的说明.

source: If you don't know much about ``git`` yet, there are a great number of `tutorials <https://git-scm.com/book>`__ available on various websites.
es: Si todavía no sabes mucho sobre ``git``, hay un gran número de `tutoriales <https://git-scm.com/book>`__ disponibles en diversos sitios web.
zh_cn: 如果您还不太了解 ``git``, 在各种网站上都有大量的 `Git 教程 <https://git-scm.com/book>`__ .

source: In general, you need to install ``git`` and/or one of the various GUI clients.
es: En general, necesitas instalar ``git`` y/o uno de los diversos interfaces visuales.
zh_cn: 通常, 您需要安装 ``git`` 和/或其他带有 ``git`` 的图形界面客户端.

source: Afterwards, to get the latest development version of the Godot source code (the unstable ``master`` branch), you can use ``git clone``.
es: A continuación, para conseguir la última versión de desarrollo del código fuente de Godot (la rama inestable ``master``), puedes usar ``git clone``.
zh_cn: 之后, 要获得最新版本的Godot源代码(不稳定的 ``master`` 分支), 可以使用 ``git clone``.

source: If you are using the ``git`` command line client, this is done by entering the following in a terminal:
es: Si estás usando el cliente de línea de comandos de ``git``, esto se realiza escribiendo lo siguiente en el terminal:
zh_cn: 如果您使用 ``git`` 命令行, 可以通过在终端输入下列命令来完成:

source: For any stable release, visit the `release page <https://github.com/godotengine/godot/releases>`__ and click on the link for the release you want. You can then download and extract the source from the download link on the page.
es: Para conseguir cualquiera de los lanzamientos oficiales de Godot, visita la `página de lanzamientos <https://github.com/godotengine/godot/releases>`__ y haz click en el enlace de la versión que versión que necesites. Podrás descargar y extraer el código fuente de esa misma página de descargas.
zh_cn: 要获取稳定版本的源代码, 请访问 `源代码发布页面 <https://github.com/godotengine/godot/releases>`__ 然后单击所需发行版的链接. 然后, 您可以从页面上的下载链接下载并解压源代码.

source: There are also generally branches besides ``master`` for each major version.
es: Generalmente hay más bifurcaciones de código además de la rama ``master`` para cada versión mayor.
zh_cn: 此外, 您可以通过 ``git`` 在各个主要版本的分支间进行切换.

source: After downloading the Godot source code, you can :ref:`continue to compiling Godot <doc_introduction_to_the_buildsystem>`.
es: Después de descargar el código fuente puedes :ref:`continuar hacia la sección de compilado de Godot <doc_introduction_to_the_buildsystem>`.
zh_cn: 获取到 Godot 的源代码之后, 您就可以继续 :ref:`编译 Godot <doc_introduction_to_the_buildsystem>` 了.
