Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/version_control_systems.po
Languages: de

source: Version control systems
de: Versionsverwaltungssysteme

source: Introduction
de: Einführung

source: Godot aims to be VCS-friendly and generate mostly readable and mergeable files.
de: Godot strebt danach, VCS-freundlich zu sein und größtenteils lesbare und zusammenführbare Dateien zu generieren.

source: Version control plugins
de: Versionsverwaltungs-Plugins

source: As of July 2023, there is only a Git plugin available, but the community may create additional VCS plugins.
de: Stand Juli 2023 gibt es nur noch ein Git-Plugin, aber die Community kann weitere VCS-Plugins erstellen.

source: Official Git plugin
de: Offizielles Git Plugin

source: As of July 2023, the Git plugin hasn't been updated to work with Godot 4.1 and later yet.
de: Stand Juli 2023 wurde das Git Plugin noch nicht aktualisiert, um Versionen ab Godot 4.1 zu unterstützen.

source: Files to exclude from VCS
de: Dateien, die von VCS ausgeschlossen werden sollen

source: This lists files and folders that should be ignored from version control in Godot 4.1 and later.
de: Für Versionen ab Godot 4.1, sollten die hier aufgelisteten Datein und Ordner von der Versions Controlle ausgeschlossen werden.

source: The list of files of folders that should be ignored from version control in Godot 3.x and Godot 4.0 is **entirely** different. This is important, as Godot 3.x and 4.0 may store sensitive credentials in ``export_presets.cfg`` (unlike Godot 4.1 and later).
de: Die Liste an Datein und Ordnern die von der Versions Kontrolle ausgeschlossen werden sollten, ist für Godot 3.x und Godot 4.0 **komplett** anders. Es ist wichtig dies zu beachten, da Godot 3.x und 4.0 sensitive Informationen in ``export_presets.cfg`` speichern. (Seit Godot 4.1 ist das nichtmehr der Fall).

source: If you are using Godot 3, check the ``3.5`` version of this documentation page instead.
de: Wenn Sie Godot 3 verwenden, sehen Sie sich stattdessen die ``3.5``-Version dieser Dokumentationsseite an.

source: There are some files and folders Godot automatically creates when opening a project in the editor for the first time. To avoid bloating your version control repository with generated data, you should add them to your VCS ignore:
de: Godot generiert einige Ordner und Datein automatisch, wenn ein Projekt das erste mal im Editor geöffnet wird. Um Ihr Versions Kontroll Repository nicht mit diesen generierten Daten zu überfluten, sollten sie vom VCS ignoriert werden:

source: ``.godot/``: This folder stores various project cache data.
de: ``.godot/``: Dieser Ordner speichert unterschiedliche Projekt Cache Daten.

source: You can make the Godot project manager generate version control metadata for you automatically when creating a project. When choosing the **Git** option, this creates ``.gitignore`` and ``.gitattributes`` files in the project root:
de: Der Godot Projekmanager kann Version Kontroll Metadaten automatisch erstellen, wenn ein Projekt erstellt wird. Wird die Option **Git** gewählt, erstellt er ``.gitignore`` und ``.gitattributes`` Dateien im Hauptordner des Projektes:

source: Creating version control metadata in the project manager's New Project dialog
de: Erstellen von Versions Kontroll Metadaten im Erstellungs-Dialog des Projektmanagers

source: Creating version control metadata in the project manager's **New Project** dialog
de: Erstellen von Versions Kontroll Metadaten im Erstellungs-Dialog des Projektmanagers

source: Working with Git on Windows
de: Mit Git unter Windows arbeiten

source: Most Git for Windows clients are configured with the ``core.autocrlf`` set to ``true``. This can lead to files unnecessarily being marked as modified by Git due to their line endings being converted from LF to CRLF automatically.
de: Die meisten Git für Windows-Clients sind mit der Einstellung ``core.autocrlf`` auf ``true`` konfiguriert. Dies kann dazu führen, dass Dateien unnötigerweise von Git als geändert markiert werden, da ihre Zeilenenden automatisch von LF in CRLF umgewandelt werden.

source: It is better to set this option as:
de: Es ist besser, diese Option einzustellen als:

source: Translation status
de: Übersetzungsstatus
