Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/visual_script/custom_visualscript_nodes.po
Languages: de, es, fr, uk

source: Custom VisualScript nodes
de: Eigene VisualScript Nodes
es: Nodos de VisualScript personalizados
fr: Nœuds VisualScript personnalisés
uk: Власні вузли VisualScript

source: Custom nodes are written in GDScript and can then be used in VisualScript. This is useful for offloading complex code to GDScript and reusing it.
de: Eigene Nodes werden in GDScript geschrieben und können dann in VisualScript genutzt werden. Dies ist nützlich um komplexen Code nach GDScript auszulagern und mehrfach zu nutzen.
es: Los nodos personalizados son escritos en GDScript y pueden ser usado luego en VisualScript. Esto es útil para llevar lógica compleja a GDScript y reusarla.
fr: Les nœuds personnalisés sont écrits en GDScript et peuvent ensuite être utilisés en VisualScript. Ceci est utile pour décharger du code complexe en GDScript et le réutiliser.
uk: Власні вузли можна створити в GDScript, а потім використовувати у VisualScript. Це корисно для завантаження складного коду в GDScript і повторного його використання.

source: Creating a custom node
de: Erstellen eines eigenen Nodes
es: Creando un nodo personalizado
fr: Création d'un nœud personnalisé
uk: Створення власного вузла

source: Create a new script that extends :ref:`class_VisualScriptCustomNode` and put a ``tool`` keyword at the top. This is needed for the script to run in the editor.
de: Erstellen Sie ein neues Skript, das :ref:`class_VisualScriptCustomNode` erweitert und setzen Sie oben ein` `tool``-Schlüsselwort ein. Dies ist erforderlich, damit das Skript im Editor ausgeführt werden kann.
es: Crea un nuevo script que extienda :ref:`class_VisualScriptCustomNode` y pon la palabra cave ``tool`` al principio. Esto es necesario para que el script se ejecute en el editor.
fr: Créez un nouveau script qui extends :ref:`class_VisualScriptCustomNode` et mettez un mot-clé ``tool`` en haut. Ceci est nécessaire pour que le script s'exécute dans l'éditeur.
uk: Створіть новий скрипт, який розширює :ref:`class_VisualScriptCustomNode` і помістіть зверху ключове слово ``tool``. Це потрібно для запуску скрипта в редакторі.

source: There are some functions that can be implemented to set parameters of the custom node. Only add functions that are needed, a ``_has_input_sequence_port`` function is not necessary if it should return ``false`` for example.
de: Es gibt einige Funktionen, die implementiert werden können, um Parameter des benutzerdefinierten Nodes festzulegen. Fügen Sie nur Funktionen hinzu die benötigt werden. Eine ``_has_input_sequence_port`` Funktion ist nicht erforderlich, wenn sie beispielsweise ``false`` zurückgeben soll.
es: Existen funciones que pueden ser implementadas para asignar parámetros del nodo personalizado. Sólo agrega las que necesites, funciones ``_has_input_sequence_port`` no son necesarias si esta debe retornar ``false``, por ejemplo.
fr: Certaines fonctions peuvent être crées pour définir les valeurs des paramètres du nœud personnalisé. Il suffit d'ajouter les fonctions nécessaires, une fonction ``_has_input_sequence_port`` n'est pas nécessaire si elle doit retourner ``false`` (Faux) par exemple.
uk: Є кілька функцій, які можна реалізувати для встановлення параметрів власного вузла. Додайте лише ті функції, які потрібні; наприклад функція ``_has_input_sequence_port``, якщо вона має повертати ``false``.

source: The most important part of a custom node is the ``_step`` function. The logic of the node is defined there.
de: Der wichtigste Teil eines eigenen Nodes die ``_step`` Funktion. Die Logik des Nodes wird dort definiert.
es: La parte más importante de en nodo personalizado es la función ``_step``. La lógica del nodo es definida allí.
fr: La partie la plus importante d'un nœud personnalisé est la fonction ``_step``. La logique du nœud y est définie.
uk: Найважливішою частиною вузла є функція ``_step``. Там визначена логіка вузла.

source: The ``inputs`` parameter holds the value of the input ports.
de: Der ``inputs`` Parameter beinhaltet den Wert der Eingabe-Ports.
es: El parámetro ``inputs`` contiene valores de los puertos de entrada.
fr: Les paramètres d'entrée ``inputs`` contiennent la valeur des ports d'entrées.
uk: Параметр ``inputs`` містить значення вхідних портів.

source: The ``outputs`` parameter is an array where the indices represent the output port ids. It can be modified to set the values of the output ports.
de: Der Parameter ``output`` ist ein Array, in dem die Indizes die IDs des Ausgabeports darstellen. Er kann geändert werden, um die Werte der Ausgangsports festzulegen.
es: El parámetro ``outputs`` es un array donde el índice representa el id de los puertos de salida. Puede ser modificado para asignar valores a los puertos de salida.
fr: Le paramètre de sorties ``outputs`` est une liste où les indices représentent les identités (ids) des ports de sortie. Il peut être modifié pour changer les valeurs des ports de sortie.
uk: Параметр ``outputs`` є масивом , в якому індекси являють собою ідентифікатори вихідного порту. Його можна змінити, щоб встановити значення вихідних портів.

source: ``start_mode`` can be checked to see if it is the first time ``_step`` is called.
de: ``start_mode`` hiermit kann überprüft werden, ob ``_step`` das erste Mal aufgerufen wird.
es: ``start_mode`` puede ser revisado para ver si es la primera vez que se llamó a ``_step``.
fr: La méthode ``start_mode`` peut être utilisée pour vérifier si ``_step`` est appelée pour la première fois.
uk: ``start_mode`` може перевірити, чи не вперше ``_step`` викликаний.

source: ``working_mem`` is persistent each ``_step`` call. It can be used to store information.
de: ``working_mem`` bleibt bei jedem ``_step`` Aufruf bestehen. Es kann zum Speichern von Informationen verwendet werden.
es: ``working_mem`` es persistente para cada llamada a ``_step``. Puede ser usado para guardar información.
fr: ``working_mem`` est conservé entre chaque appel de ``_step``. Il peut donc être utilisé pour stocker des informations.
uk: ``working_mem`` постійний при кожному виклику ``_step``. З його допомогою можна зберігати інформацію.

source: If you want to throw an error, for example if the input types are incorrect, you can return the error message as a string. When everything goes right, return the id of the sequence port which should be called next. If your custom node doesn't have any, just return 0.
de: Wenn Sie einen Fehler auslösen möchten, z.B. wenn die Eingabetypen falsch sind, können Sie die Fehlermeldung als Zeichenfolge zurückgeben. Wenn alles richtig läuft, geben Sie die ID des Sequenzports zurück, der als nächstes aufgerufen werden soll. Wenn Ihr benutzerdefinierter Node keinen hat, geben Sie einfach 0 zurück.
es: Si quieres disparar un error, por ejemplo si el tipo de entrada es incorrecto, puedes retornar el mensaje de error como una cadena. Cuando todo va bien, retorna el id de la secuencia de puertos que debería ser llamado en el siguiente paso. Si tu nodo personalizado no tiene ninguno, sólo retorna 0.
fr: Si vous voulez faire remonter une erreur, par exemple si les types de saisie sont incorrects, vous pouvez renvoyer le message d'erreur sous forme de chaîne de caractères. Lorsque tout va bien, retournez l'identifiant (id) du port de séquence qui doit être appelé après. Si votre nœud personnalisé n'en a pas, retournez simplement 0.
uk: Якщо ви хочете видалити помилку, наприклад, якщо типи введення неправильні, ви можете повернути повідомлення про помилку в вигляді текста. Коли все піде правильно, поверніть ідентифікатор порту послідовності, який слід викликати наступним. Якщо ваш вузол не має жодного, просто поверніть 0.

source: Example:
de: Beispiel:
es: Ejemplo:
fr: Exemple :
uk: Приклад:

source: Using a custom node
de: Einen benutzerdefinierten Node nutzen
es: Usando un nodo personalizado
fr: Utilisation d'un nœud personnalisé
uk: Використання власного вузла

source: To use the script, add a ``CustomNode``, select it and drag your custom node script into the ``script`` property shown in the inspector.
de: Um das Skript zu verwenden fügen Sie einen ``CustomNode`` hinzu, wählen Sie ihn aus und ziehen Sie Ihr benutzerdefiniertes Node-Skript in die im Inspektor angezeigte Eigenschaft ``script``.
es: Para usar el script, agrega un ``CustomNode``, selecciona el script personalizado y arrástralo a la propiedad ``script`` que se ve en el inspector.
fr: Pour utiliser le script, ajoutez un ``CustomNode``, sélectionnez-le et faites glisser votre script de nœud personnalisé dans la propriété ``script`` affichée dans l'inspecteur.
uk: Щоб скористатися скриптом, додайте ``CustomNode``, виберіть його та перетягніть власний скрипт вузла у властивість ``script`` показану в інспекторі.

source: Result:
de: Ergebnis:
es: Resultado:
fr: Résultat :
uk: Результат:
