Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/visual_script/getting_started.po
Languages: ja, ko, pl, zh_cn

source: Getting started with Visual Scripting
ja: ビジュアル・スクリプト入門
ko: Visual Scripting 시작하기
pl: Wprowadzenie do Visual Scripting
zh_cn: 可视化脚本入门

source: As with everything in Godot, we prioritize a good experience over copying or integrating third party solutions which might not fit nicely in the current workflow. This led us to write our own version of how we believe this feature would work best with the engine.
ja: Godotのすべてのものと同様に、現在のワークフローにはうまく適合しない可能性があるサードパーティ製のソリューションをコピーまたは統合するよりも、優れた経験を優先します。このため、この機能がエンジンで最もうまく動作すると思われる独自のバージョンを作成しました。
ko: Godot의 모든 기능과 마찬가지로, 우리는 현재 워크플로우에 적합하지 않을 수 있는 타사 솔루션을 복사하거나 통합하는 것에 대한 좋은 경험을 우선순위로 둡니다. 이것으로 우리는 이 기능이 엔진에서 가장 잘 작동할 것이라고 생각하는 우리의 설명을 적을 수 있었습니다.
pl: Tak jak w przypadku wszystkiego, co znajduje się w Godocie, przedkładamy dobre doświadczenia nad kopiowanie lub integrowanie rozwiązań innych firm. To skłoniło nas do napisania własnego języka, który będzie bardzo dobrze integrował się z silnikiem.
zh_cn: 与Godot中的所有内容一样，我们优先考虑良好的体验，而不是复制或集成可能无法很好地适应当前工作流程的第三方解决方案。这导致我们编写了自己的版本，我们认为此功能最适合引擎使用的版本。

source: In Godot, a Visual Script fits smoothly together with regular scripts in the Editor tab
ja: Godotでは、 エディタ・タブでビジュアルスクリプトを通常のスクリプトとスムーズに連携させることができます
ko: Godot에서, Visual Script가 에디터 탭의 일반 스크립트와 매끄럽게 호환합니다
pl: W Godocie Visual Script dobrze wpasowuje się razem ze zwykłymi skryptami w zakładkę w Edytorze
zh_cn: 在Godot中，可视化脚本与在编辑器选项卡中的常规脚本配合得很好

source: In fact, Visual Scripting integrates so well to Godot that it's hard to believe it was added only in version 3.0. This is because, when editing, the rest of Godot panels and docks act like a palette from where you can drag and drop all sorts of information to the script canvas:
ja: 実際、ビジュアル・スクリプトはGodotと非常によく統合されているため、バージョン3.0でのみ追加されたとは信じられません。これは編集時に残りのGodotパネルとドックがパレットのように機能し、そこからあらゆる種類の情報をスクリプトキャンバスにドラッグアンドドロップできるためです:
ko: 사실, Visual Scripting이 Godot에 잘 통합되기 때문에 버전 3.0에 추가되었다고 보기 어렵습니다. 왜냐하면 Visual Script를 편집할 때, Godot 패널과 독의 나머지 부분이 모든 종류의 정보를 스크립트 캔버스로 끌어다 놓을 수 있는 팔레트처럼 작동하기 때문입니다:
pl: W rzeczywistości, Visual Scripting tak dobrze integruje się z Godotem, że trudno uwierzyć, że został dodany dopiero w wersji 3.0. Dzieje się tak dlatego, że podczas edycji pozostałe panele i doki Godota działają jak paleta, z której można przeciągnąć i upuścić różnego rodzaju informacje na płótno skryptu:
zh_cn: 实际上，可视化脚本与Godot的集成是如此之好，以至于很难相信仅在3.0版中才添加了它。这是因为，在编辑时，其余的Godot面板和停靠面板就像一个调色板一样，您可以从中将各种信息拖放到脚本画布上：

source: Creating a script
ja: スクリプトの作成
ko: 스크립트 생성하기
zh_cn: 创建一个脚本

source: Creating scripts works the same as with other scripting languages: Select any node in the scene and push the "New Script" button at the top right corner of the Scene Tree dock:
ja: スクリプトの作成は他のスクリプト言語と同じように機能します。シーン内の任意のノードを選択し、シーンツリードックの右上隅にある "New Script" ボタンを押します:
ko: 스크립트 생성은 다른 스크립팅 언어와 동일하게 작동합니다: 씬의 아무 노드나 선택하고 씬 트리 독의 오른쪽 상단 모서리에 있는 "새 스크립트" 버튼을 누릅니다:
pl: Tworzenie skryptów działa tak samo jak w przypadku innych języków skryptowych: Zaznacz dowolny węzeł sceny i naciśnij przycisk "Nowy skrypt" w prawym górnym rogu okna drzewa sceny:
zh_cn: 创建脚本的工作方式与其他脚本语言相同：选择场景中的任何节点，然后按场景树面板右上角的 ``新建脚本`` 按钮：

source: Once it opens, the script type "Visual Script" must be selected from the drop down list. The script extension must be ".vs" (for Visual Script!).
ja: 開いたら、ドロップダウンリストからスクリプトタイプ "Visual Script" を選択する必要があります。スクリプトの拡張子は ".vs" にする必要があります(Visual Scriptの場合)。
ko: 열리면 드롭 다운 목록에서 스크립트 타입 "Visual Script"를 선택해야 합니다. 스크립트 확장은 ".vs"(Visual Script를 위해!) 이어야 합니다.
pl: Po jego otwarciu z listy rozwijanej należy wybrać skrypt typu "Visual Script". Rozszerzeniem skryptu musi być ".vs" (dla Visual Script!).
zh_cn: 打开后，必须从下拉列表中选择脚本类型 ``可视化脚本（Visual Script）``。脚本扩展名必须为 ``.vs`` （对于可视化脚本！）。

source: Finally, the Script Editor will open, allowing you to start editing the visual script:
ja: 最後にスクリプトエディタが開き、ビジュアル・スクリプトの編集を開始できます:
ko: 마침내, Script 에디터가 열리고, Visual script 편집을 시작할 수 있습니다:
zh_cn: 最后，脚本编辑器将打开，允许开始编辑可视脚本：

source: Adding a function
ja: 関数の追加
ko: 함수 추가하기
zh_cn: 添加一个函数

source: Unlike other visual scripting implementations, Visual Scripting in Godot is heavily based on functions. This happens because it uses the same interface to communicate with the engine as other scripting engines. In Godot, the scripting interface is universal and all implementations conform to it.
ja: 他のビジュアルスクリプティング実装とは異なり、Godotのビジュアルスクリプティングは関数に大きく基づいています。これは、他のスクリプトエンジンと同じインターフェイスを使用してエンジンと通信するために発生します。Godotでは、スクリプトインターフェースは汎用的で、すべての実装はそれに準拠しています。
ko: 다른 시각적 스크립팅 실행과 달리 Godot의 Visual Scripting은 함수를 기반으로 합니다. 왜냐하면 다른 스크립팅 엔진처럼 엔진과 통신하는 동일한 인터페이스를 사용하기 때문에 일어납니다. Godot에서는 스크립팅 인터페이스가 보편적이며 모든 실행이 이 인터페이스를 준수합니다.
pl: W przeciwieństwie do innych implementacji visual scripting, skrypty wizualne w Godot w dużej mierze opierają się na funkcjach. Dzieje się tak dlatego, że używa tego samego interfejsu do komunikacji z silnikiem, co inne silniki skryptowe. W Godot interfejs skryptowy jest uniwersalny i wszystkie jego implementacje są z nim zgodne.
zh_cn: 与其他可视化脚本实现不同，Godot中的可视化脚本重度基于功能。这是因为它使用与其他脚本引擎相同的接口与引擎进行通信。在Godot中，脚本接口是通用的，并且所有实现都遵循它。

source: A function is an individual canvas with nodes connected.
ja: 関数は、ノードが接続されている個々のキャンバスです。
ko: 함수는 노드가 연결된 개별 캔버스입니다.
pl: Funkcja to pojedyncze płótno z podłączonymi węzłami.
zh_cn: 函数是连接了节点的单个画布。

source: A single script can contain many functions, each of which will have a canvas of its own, allowing for more organization.
ja: 1つのスクリプトに多数の関数を含めることができ、それぞれに独自のキャンバスがあり、より多くの編成が可能になります。
ko: 단일 스크립트에는 많은 함수를 포함할 수 있으며, 각각 고유의 캔버스를 갖고 있고, 더 많은 구성을 할 수 있습니다.
pl: Pojedynczy skrypt może zawierać wiele funkcji, z których każda będzie miała własne płótno, co pozwoli na lepszą organizację.
zh_cn: 单个脚本可以包含许多函数，每个函数都有自己的画布，从而允许进行更多的组织。

source: There are three main ways to add functions in a script:
ja: スクリプトに関数を追加するには、主に3つの方法があります:
ko: 스크립트에 함수를 추가하는 세 가지 주요 방법이 있습니다:
pl: Istnieją trzy główne sposoby dodawania funkcji w skrypcie:
zh_cn: 在脚本中添加函数的主要方法有三种：

source: Overriding a virtual function
ja: 仮想関数のオーバーライド
ko: 가상 함수 재정의하기(Override)
zh_cn: 重写一个虚函数

source: Most types of nodes and other types of objects in Godot contain virtual functions. These are functions that will be called (run your code) when something happens and can be looked up in the reference. Virtual functions are listed when pressing the "Override" icon in the member panel:
ja: Godotのほとんどの種類のノードやその他の種類のオブジェクトには仮想関数が含まれています。これらは、何かが起こったときに呼び出され(コードを実行する)、参照で調べることができる関数です。メンバーパネルの "Override" アイコンを押すと、仮想関数が一覧表示されます:
ko: Godot에 있는 대부분의 타입의 노드와 다른 타입의 객체는 가상 함수를 포함합니다. 이들은 무언가가 발생했을 때 (코드를 실행하여) 호출될 함수로 참조에서 볼 수 있습니다. 멤버 패널에서 "재정의" 아이콘을 누르면 가상 함수가 나열됩니다:
zh_cn: Godot中大多数类型的节点和其他类型的对象都包含虚拟函数。这些功能在发生某些情况时将被调用（运行您的代码），并且可以在参考中查找这些函数。当按下成员面板中的 ``覆盖`` 图标时，将列出虚函数：

source: In the following example, a function will be executed when the node is loaded and added to the running scene. For this, the _ready() virtual method will be overridden:
ja: 次の例ではノードがロードされて実行中のシーンに追加されたときに関数が実行されます。このため_ready()仮想メソッドはオーバーライドされます:
ko: 다음 예시에서는, 노드를 불러와서 실행 씬에 추가될 때 함수가 실행될 것입니다. 이를 위해 _ready () 가상 메서드가 재정의 될 것입니다:
pl: W poniższym przykładzie funkcja zostanie wykonana po załadowaniu węzła i dodaniu go do uruchomionej sceny. W tym celu metoda wirtualna _ready() zostanie nadpisana:
zh_cn: 在以下示例中，将在节点被加载并被添加到运行场景时执行一个函数。为此，``_ready()`` 虚函数将被重写：

source: Finally, a canvas appears for this function, showing the override:
ja: 最後に、この関数のキャンバスが表示され、オーバーライドが表示されます:
ko: 마침내, 이 함수를 위해 재정의를 보여주는 캔버스가 나타났습니다:
pl: Na końcu pojawi się płótno z tą funkcją, pokazujące nadpisanie:
zh_cn: 最后，一个画布出现在这个函数上，显示重写：

source: As some functions expect you to return a value, they will also add a return node where such value is supposed to be provided:
ja: 一部の関数は値を返すことを期待しているので、そのような値を提供することを想定しているリターンノードも追加します:
ko: 일부 함수는 값을 반환할 것을 예상하며, 그들에게는 반환 노드를 추가하여 해당 값을 제공해야 합니다:
pl: Ponieważ niektóre funkcje oczekują zwrotu wartości, dodają one również węzeł zwrotny, w którym wartość ta ma być podana:
zh_cn: 由于某些函数希望您返回值，因此它们还会在应该提供该值的地方，添加一个返回节点：

source: Connecting a signal to a function
ja: シグナルの関数への接続
ko: 함수에 시그널 연결하기
zh_cn: 连接一个信号到一个函数

source: Nodes in a tree emit signals when something happens. Godot uses signals for all sorts of things. A typical example would be a button that emits a "pressed" signal when actually pressed.
ja: ツリー内のノードは何かが起こるとシグナルを発します。 Godotはあらゆる種類のものにシグナルを使用します。典型的な例は、実際に押されたときに "pressed" 信号を発するボタンです。
ko: 트리의 노드는 무언가가 발생하면 시그널을 방출(emit)합니다. Godot는 모든 종류의 시그널을 사용합니다. 전형적인 예로 버튼이 실제로 눌렀을 때 "pressed"(눌렸음) 시그널을 내보내는 것이 있습니다.
pl: Węzły w drzewie wysyłają sygnały, gdy coś się dzieje. Godot używa sygnałów do wielu rodzajów rzeczy. Typowym przykładem jest przycisk, który po wciśnięciu emituje sygnał "pressed".
zh_cn: 当某些事情发生时，树中的节点会发出信号。Godot将信号用于各种事物。一个典型的例子是一个按钮，当实际按下按钮时会发出 ``按下`` 信号。

source: For this, a node must be selected and the Node tab opened. This will allow inspecting the signals. Once they are displayed, connect the "pressed" signal:
ja: このためにはノードを選択して[ノード]タブを開く必要があります。これで信号を調べることができます。表示されたら、 "pressed" 信号を接続します:
ko: 이를 위해, 노드를 선택하고 Node 탭을 열어줍니다. 이렇게 하면 시그널을 볼 수 있습니다. 일단 보여지면, "pressed" 시그널을 연결하십시오:
pl: W tym celu należy zaznaczyć węzeł i otworzyć zakładkę Węzeł. Pozwoli to na sprawdzenie sygnałów. Po ich wyświetleniu należy podłączyć sygnał "pressed":
zh_cn: 为此，必须选择一个节点并打开节点选项卡。这将允许检查信号。一旦它们被显示，连接 ``按下`` 信号：

source: This will open the connection dialog. In this dialog, you must select the node where the signal will be connected to, and the function that will receive the signal:
ja: これで接続ダイアログが開きます。 このダイアログでは、信号が接続されるノードと信号を受信する機能を選択する必要があります:
ko: 연결 대화 상자가 열립니다. 이 대화 상자에서 시그널을 연결할 노드를 선택하고 시그널을 받을 함수를 선택해야 합니다:
pl: Spowoduje to otwarcie okna połączenia sygnału. W tym oknie należy wybrać węzeł, do którego będzie podłączony sygnał, oraz funkcję odbierającą sygnał:
zh_cn: 这将打开连接对话框。在此对话框中，您必须选择信号要被连接到的节点，以及将接收信号的函数：

source: If this is done right, a new function will be created in our script and a signal will automatically be connected to it:
ja: これが正しく行われると、スクリプト内に新しい関数が作成され、シグナルが自動的にその関数に接続されます:
ko: 잘 작동된다면, 스크립트에 새 함수가 만들어지며 시그널이 자동으로 연결됩니다:
pl: Jeśli zostanie to wykonane prawidłowo, w naszym skrypcie zostanie utworzona nowa funkcja i automatycznie zostanie do niej podłączony sygnał:
zh_cn: 如果正确完成，将在我们的脚本中创建一个新函数，并自动将一个信号连接到它：

source: Creating a function manually
ja: 関数の手動作成
ko: 수동으로 함수 만들기
zh_cn: 手动创建一个函数

source: The last way to create functions is to do it manually. In general, this is not as common unless you really need it. Custom functions work when another (or the same) script calls them manually. The main use cases for this are breaking a larger function up into several manageable chunks and reusing your visual code.
ja: 関数を作成する最後の方法は手動でそれをすることです。一般にこれはが必要な時はさほどありません。カスタム関数は、別の(または同じ)スクリプトがそれらを手動で呼び出すときに機能します。これの主な使用例は、大きな機能をいくつかの管理可能なチャンクに分割し、ビジュアルコードを再利用することです。
ko: 마지막 방법으로는 함수를 수동으로 생성하는 것입니다. 일반적으로 정말로 필요한 경우가 아니라면 수동 생성은 쓰이지 않습니다. 커스텀 함수는 다른 (또는 같은) 스크립트가 수동으로 호출할 때 작동합니다. 주요 사용 사례로는 함수를 더 작게 분리하는 것이나, 시각적 코드를 재 사용하는 것입니다.
zh_cn: 创建函数的最后一种方法是手动完成。一般来说，除非您真的需要，否则这是不常见的。当另一个（或相同）脚本手动调用自定义函数时，它们会起作用。这样做的主要用例是，将一个较大的函数分解为几个可管理的块，并重新使用可视化代码。

source: To create a function manually, push the big "Plus" button, and a new function will be added with a default name:
ja: 手動で関数を作成するには、大きな "Plus" ボタンを押すと、新しい関数がデフォルトの名前で追加されます:
ko: 함수를 수동으로 생성하려면, 큰 "더하기" 버튼을 누르세요, 그러면 기본 이름으로 새로운 함수가 추가됩니다:
pl: Aby utworzyć funkcję ręcznie, naciśnij duży przycisk "Plus", a nowa funkcja zostanie dodana z domyślną nazwą:
zh_cn: 要手动创建函数，请按下 ``加号`` 按钮，然后将添加一个具有默认名称的新函数：

source: This will add a new function, which can be renamed by simply double clicking its name:
ja: 新しい関数が追加され、名前をダブルクリックするだけで名前を変更できます:
ko: 이름을 더블 클릭하여 이름을 바꿀 수 있는 새 함수가 추가됩니다:
pl: Spowoduje to dodanie nowej funkcji, której nazwę można zmienić poprzez dwukrotne kliknięcie jej nazwy:
zh_cn: 这将添加一个新函数，只需双击其名称即可重命名该函数：

source: To edit the "arguments" this function can get (the values you pass to it when you call this function), simply click the Function node and check the inspector:
ja: この関数が取得できる "arguments" (この関数を呼び出すときに渡す値)を編集するには、関数ノードをクリックしてインスペクタをチェックするだけです:
ko: 이 함수가 가질 수 있는 "인수(arguments)"를 편집하려면 (이 함수를 호출할 때 전달하는 값), 함수 노드를 클릭하고 인스펙터를 확인하세요:
pl: Aby edytować "argumenty" tej funkcji (wartości, które podajesz przy wywołaniu jej ), po prostu kliknij na funkcję węzła i sprawdź inspektor:
zh_cn: 要编辑此函数可以获得的 ``参数`` （调用此函数时传递给它的值），只需点击 ``函数（Function）`` 节点并检查属性检查器：

source: More on that will be explained later in this document.
ja: 詳細については、このドキュメントの後半で説明します。
ko: 자세한 내용은 이 문서의 뒷부분에서 설명합니다.
pl: Więcej zostanie wyjaśnione później w tym dokumencie.
zh_cn: 关于这一点的更多内容，将在本文后面解释。
