Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/visual_script/nodes_purposes.po
Languages: es, zh_cn

source: Nodes and terminology
zh_cn: 节点与术语

source: Before continuing, it must be noted that the *Node* terminology needs to be used with care. When referring to *Visual Script Nodes* (or generally *Nodes*) this text will refer to the little boxes you connect with lines, which are part of a graph. When referring to *Scene Nodes*, it is implied that the elements that make up a Scene are being referred, which are part of a tree. Their naming is similar but their function is different. When referring to *Node* here, it will be implied that a *Visual Script Node* is referred to unless indicated otherwise.
es: Antes de continuar conviene recalcar que la terminología *Nodo* hay que usarla con cuidado. Cuando nos referimos a los *Nodos de Visual Script* (o generalmente *Nodos*) nos referimos a las pequeñas cajitas que conectas con líneas, y que son parte de un gráfico. Cuando nos referimos a *Nodos de escena*, esto implica que nos referimos a los elementos que configuran una escena, y que son parte del árbol de dicha escena. El nombre es similar pero su función es diferente. Cuando nos refiramos a *Nodo* aquí nos estaremos refiriendo a un *Nodo de visual script* si no se indica lo contrario.
zh_cn: 在继续之前，必须注意 *节点* 术语需要谨慎使用。 当引用 *可视化脚本节点* (或通常为 *节点* )时，此文本是指与线连接的小方框，它是图的一部分。 当引用 *场景节点* 时，它暗指构成场景的元素，它是树的一部分。 他们的命名类似，但他们的功能是不同的。 在此处谈到 *节点* 时，除非另有说明，否则将暗指 *可视化脚本节点* 。

source: Node properties
zh_cn: 节点属性

source: Like in most visual scripting implementations, each node has editable properties. In Godot, though, we try to avoid bloating the nodes with editable controls for the sake of readability.
es: Como en otras implementaciones se lenguajes visuales de código, cada nodo tiene propiedades editables. En Godot, no obstante, intentamos evitar un excesivo uso de controles editables por el bien de la legibilidad.
zh_cn: 与大多数可视化脚本实现一样，每个节点都具有可编辑的属性。 但是，在Godot中，为了便于阅读，我们尽量避免使用可编辑的控件来复杂化节点。

source: Nodes still display the required information as text, but editing is done via the *Inspector*. To edit them, select any node and edit its properties in the *Inspector*.
es: Los nodos todavía muestran la información requerida como texto, pero la edición se realiza a través del *Inspector*. Para editarlos, selecciona cualquier nodo y edita sus propiedades en el *Inspector*.
zh_cn: 节点仍然以文本形式显示所需信息，但编辑是通过 *属性面板* 完成的。 要编辑它们，请选择任何节点并在 *属性面板* 中编辑其属性。

source: Ports and connections
zh_cn: 端口和连接

source: Programming in Godot Visual Scripting is done via *Nodes* and *Port Connections* inside each function.
es: La programación en Godot Visual Scripting se realiza a través de *Nodos* y *Conexiones de Puertos* dentro de cada función.
zh_cn: Godot的可视化编程，是通过每个函数内的 *节点* 和 *端口连接* 来完成的。

source: Ports
es: Puertos
zh_cn: 端口

source: Nodes in Godot Visual Scripting have *Ports*. These are endpoints that appear to the left and right of nodes and which can be used to make *Connections*: There are two types of *Ports*: *Sequence* and *Data*.
es: Los nodos en Godot Visual Scripting tienen *Puertos*. Éstos son los puntos finales que aparecen a la izquierda y derecha de los nodos y que se pueden usar para hacer *Conexiones*: Hay dos tipos de *Puertos*: *Secuencias* y *Datos*.
zh_cn: Godot可视化编程中的节点有 *端口* 。 它们是出现在节点左侧和右侧的端点，可用于制作 *连接* :有两种类型的 *端口* : *顺序* 和 *数据* 。

source: *Sequence Ports* indicate the order in which operations are executed. Typically when a *Node* is done processing, it will go to the next node from one of the ports at the right. If nothing is connected, the function may end, or another output *Sequence Port* might be tried (this depends on the node). Thanks to this, you can follow the logic flow within a function by following the white lines. Not every *Node* has *Sequence Ports*. In fact, most do not.
zh_cn: *顺序端口* 表示执行操作的顺序。 通常当 *节点* 完成处理时，它将从右边的一个端口进入下一个节点。 如果没有连接，则该函数可能结束，或者可能尝试另一个输出 *顺序端口*(这取决于节点)。 多亏了这一点，您可以通过遵循白线来跟踪函数内的逻辑流程。 并非每个 *节点* 都有 *顺序端口* 。 事实上，大多数没有。

source: *Data Ports* ports contain typed values. Types can be any regular Godot types, such as a boolean, an integer, a string, a Vector3, an array, any Object or Scene Node, etc. A *Data Port* on the right side of a node is considered an output, while, a port on the left side is an input. Connecting them allows information to flow to the next node.
es: Los *Puertos de Datos* contienen valores tipados. Los tipos pueden ser cualquier tipo regular de Godot, como un booleano, un entero, una cadena de texto, un Vector3, un array y cualquier Objeto o Escena, etc. Un *Puerto de Datos* en la parte derecha de un nodo se considera una salida, mientras que un puerto a la izquierda es una entrada. Conectando estos permitimos que la información fluya hacia el siguiente nodo.
zh_cn: *数据端口* 包含具有类型的值。 类型可以是任何常规的Godot类型，例如布尔值，整数，字符串，Vector3，数组，任何对象或场景节点等。节点右侧的 *数据端口* 被视为输出， 而左侧的端口是输入。 连接它们，从而使得信息流到下一个节点。

source: Not all *Data Port* types are compatible and will allow connections, though. Pay special attention to colors and icons, as each type has a different representation:
es: No todos los tipos de *Puertos de Datos* son compatibles y permiten la interconexión. Presta especial atención a los colores y los iconos, cada tipo tiene una representación diferente:
zh_cn: 但并非所有的 *数据端口* 类型都兼容并且允许连接。 要特别注意颜色和图标，因为每种类型都有不同的表示形式:

source: Connections
es: Conexiones
zh_cn: 连接

source: Connecting is a relatively simple process. Drag an *Output Port* towards an *Input Port*.
es: La conexión es un proceso relativamente sencillo. Arrastra un *Puerto de salida* hacia un *Puerto de entrada*.
zh_cn: 连接是一个相对简单的过程。 将 *输出端口* 拖向 *输入端口* 。

source: Disconnecting takes a bit more practice. Disconnecting in *Data Ports* happens by dragging the *Input* away, while for *Sequence Ports*, this happens by dragging the *Output* away.
es: Desconectar necesita un poco más de práctica. La desconexión de los *Puertos de Datos* se consigue arrastrando la *Entrada* hacia afuera, mientras que para los *Puertos de Secuencia*, esto se consigue arrastrando hacia fuera la *Salida*.
zh_cn: 断开连接需要一点练习。 断开 *数据端口* 是通过拖离 *输入* 来实现的，而对于 *顺序端口*，则通过拖离 *输出* 来实现。

source: This may seem strange at first, but it happens because *Data Ports* are 1:N (A single output port can connect to many inputs), while *Sequence Ports* are N:1 (Many sequence outputs can be connected to a single input).
zh_cn: 这在开始时可能看起来很奇怪，但它发生是因为 *数据端口* 是1:N(单个输出端口可以连接到许多输入)，而 *顺序端口* 是 N:1(许多顺序输出可以连接到单个输入)。

source: Connecting to empty space (drag to connect but unpress over empty space) is also context sensitive, it will supply a list of most common operations. For sequences, it will be conditional nodes:
es: Conectando a un espacio vacío (arrastrar para conectar pero soltar en un espacio vacío) es sensible al contexto, mostrará una lista de operaciones comunes. Para secuencias, serán nodos condicionales:
zh_cn: 连接到空白区域(拖动以连接但是在空白区域上按下)也是上下文敏感的，它将提供最常见操作的列表。 对顺序，它将是条件节点:

source: While, for data, a contextual set/get/call menu will open:
es: Mientras que, para datos, se abrirá el menú contextual set/get/call:
zh_cn: 而对于数据，将打开上下文设置/获取/调用菜单:

source: Adding nodes
zh_cn: 添加节点

source: Finally! We got to the fun part! But, before explaining in more detail what each type of node does, let's take a short look at how nodes are most commonly added and dealt with.
es: Finalmente llegamos a la parte divertida! Pero, antes de explicar en detalle lo que hace cada tipo de nodo, echemos un vistazo a cómo son agregados y tratados los nodos más comunes.
zh_cn: 最后！ 我们到了有趣的部分！ 但是，在更详细地解释每种类型节点的作用之前，让我们简单地看一下节点最常添加和处理的方式。

source: Accessing scene nodes
zh_cn: 访问场景节点

source: One of the most common tasks is accessing Scene Tree Nodes (again, not to mistake with *Visual Script Nodes*). Dragging from the Scene Tree and dropping into the canvas will ask you to *call a method* (sometimes referred to as *member function*) on this node.
es: Una de las tareas más comunes es acceder a Nodos del árbol de escena (de nuevo, no confundir con *Nodos de Visual Script*). Arrastrando del árbol de escena y soltando en el área de trabajo, pedirá *seleccionar un método* (a veces referido como *función miembro*) de este nodo.
zh_cn: 最常见的任务之一是访问场景树节点(同样，不要误认为是 *可视脚本节点 * )。 从场景树拖动并放入画布将要求您 *在此节点上调用方法* (有时称为 *成员函数* )。

source: While accessing properties is desired in most cases (more on that below), sometimes *calling methods* can be useful too. Methods execute specific actions on objects. In the above case, the mouse pointer can be warped to a position in local coordinates to the control. Another common use case is queueing a node for deletion, which is done with the *queue_free* method.
es: Mientras que acceder a propiedades es deseable en la mayoría de los casos (más sobre esto a continuación), a veces *llamar métodos* puede ser útil también. Los métodos ejecutan acciones en objetos. En el caso anterior, el puntero del ratón puede ser transportado a una posición en coordenadas locales del control. Otro caso de uso común poner en cola un nodo para borrarlo, lo que se hace con el método *queue_free*.
zh_cn: 虽然在大多数情况下需要访问属性(下面有更多内容)，但有时 *调用方法* 也很有用。 方法对对象执行特定操作。 在上述情况下，鼠标指针可以扭曲到控件的本地坐标中的位置。 另一个常见用例是将节点排队以进行删除，这是使用 *queue_free* 方法完成的。

source: Care must be taken that this only works if the scene being edited contains your *Visual Script* in one of the nodes! Otherwise, a warning will be shown.
es: Se debe tener en cuenta que esto sólo funciona si la escena siendo editada contiene el *Visual Script* en uno de los nodos! De otro modo, se mostrará una advertencia.
zh_cn: 必须注意，这只适用于正在编辑的场景在其中一个节点中包含 *可视化脚本* 的情况！ 否则，将显示警告。

source: Accessing scene node properties
zh_cn: 访问场景节点属性

source: This is the most common way to edit *Scene Nodes* in Visual Scripting. Select a *Scene Node* from the *Scene Tree*, go to the Inspector, find *the Name* of the property you want to edit (hint, *not* the value!) and drag it to the canvas:
es: Este es el modo más común de editar *Nodos de la escena* en Visual Scripting. Seleccione un *Nodo de la escena* del *Árbol de escena*, vaya al Inspector, encuentre *el Nombre* de la propiedad que quiere editar (el nombre, *no* el valor!) y arrástrelo al área de trabajo:
zh_cn: 这是在可视化脚本中编辑 *场景节点* 的最常用方法。 从 *场景树* 中选择 *场景节点* ，转到属性面板，找到要编辑的属性的名称(提示， *不* 是值！)并将其拖到画布上:

source: The result is that this value can be changed from your script by writing to a *Data Port*.
es: El resultado será que este valor podrá ser cambiado desde el script escribiendo a un *Puerto de Datos* (Data Port).
zh_cn: 结果是可以通过写入 *数据端口* 从脚本更改此值。

source: If instead reading this value is desired, drag the node again but hold the *Control* key (or Command on Mac). This will create a getter:
es: Si en cambio deseas leer este valor, arrastra el nodo de nuevo pero mantén presionada la tecla *Control* (o Comando en Mac). Esto creará un getter:
zh_cn: 如果需要读取此值，请再次拖动节点，但按住 *Control* 键(或Mac上的Command)。 这将创建一个getter:

source: In this case, the value can be read from a *Data Port*.
es: En este caso, el valor podrá ser leído desde un *Puerto de datos*.
zh_cn: 在这种情况下，可以从 *数据端口* 读取值。

source: Variables
zh_cn: 变量

source: Variables are memory containers local to the script which can hold a value. This value can be read from any of the functions of the script or from other scripts via the method described in the previous step.
es: Las variables son contenedores de memoria locales al script que pueden contener un valor. Este valor se puede leer desde cualquiera de las funciones del script o desde otros scripts mediante el método descrito en el paso anterior.
zh_cn: 变量是脚本本地的内存容器，可以容纳一个值。 可以通过上一步中描述的方法从脚本的任何功能或其他脚本中读取此值。

source: To add a Variable, push the "+" button on the *Variables* section of the Members panel. Double-click the new variable to rename it:
es: Para agregar una variable, presione el botón "+" en la sección Variables del panel Miembros. Doble clic en la nueva variable para renombrarla:
zh_cn: 要添加变量，请按成员面板的 *变量* 部分中的“+”按钮。 双击新变量以重命名它:

source: Right-clicking the variable allows you to configure its properties:
es: Clic derecho en la variable permite configurar sus propiedades:
zh_cn: 右键单击该变量可以配置其属性:

source: As it can be seen above, the type and initial value of the variable can be changed, as well as some property hints. Ticking the "Export" option makes the variable visible in the Inspector when selecting the node. This also makes it available to other scripts via the method described in the previous step.
zh_cn: 如上所示，可以更改变量的类型和初始值，以及一些属性提示。 选择“导出”选项会在选择节点时使属性面板中的变量可见。 这也可以通过上一步中描述的方法将其提供给其他脚本。

source: To use the variable in the script, simply drag it to the canvas to create a getter:
es: Para utilizar una variable en el script, simplemente arrástrela al área de trabajo para crear un getter:
zh_cn: 要在脚本中使用该变量，只需将其拖到画布上即可创建一个getter:

source: Likewise, hold *Control* (*Command* on Mac) to drop a setter:
es: Del mismo modo, manteniendo presionado *Control* (*Command* en Mac) para crear un setter:
zh_cn: 同样，按住 *Control* (Mac上的 *Command* )删除一个setter:

source: Signals
es: Señales
zh_cn: 信号

source: It is also possible to create your own signals in a script and use them. For this, do the same steps you did for variables in the previous step, except for *Signals*:
es: También es posible crear tus propias señales en un script y usarlas. Para esto, realiza los mismos pasos utilizados para variables en el paso anterior, pero para la sección *Signals*:
zh_cn: 也可以在脚本中创建自己的信号并使用它们。 为此，除了 *Signals* 之外，执行与上一步中的变量相同的步骤:

source: A signal can also be edited via the right-click menu to customize its arguments:
zh_cn: 也可以通过右键单击菜单编辑信号以自定义其参数:

source: The signal you have created will appear in the Inspector, along with the built-in node signals. This allows you to connect it from another script from another *Scene Node*:
zh_cn: 您创建的信号将与内置节点信号一起显示在Inspector中。 这允许您从另一个 *Scene Node* 的另一个脚本连接它:

source: Finally, to emit the signal, simply drag it to the canvas:
es: Finalmente, para emitir la señal, simplemente arrástrela al área de trabajo:
zh_cn: 最后，要发出信号，只需将其拖到画布上:

source: Remember that emitting a signal is a sequenced operation, so it must come from a Sequence port.
es: Recuerde que emitir una senal es una operación secuenciada, así que debe venir de un puerto Sequence.
zh_cn: 请记住，发出信号是一个有序操作，因此它必须来自一个Sequence端口。

source: Adding more nodes
zh_cn: 添加更多节点

source: Now that the basics are covered, let's discuss the large amount of utility nodes available for your canvas! Below the member panel, exists the list of all available node types:
es: Ahora que lo básico está cubierto, hablemos de la gran la gran cantidad de nodos de utilidad (utility nodes) disponibles para tu área de trabajo! En el panel de miembros de abajo, existe la lista de todos los tipos de nodos disponibles:
zh_cn: 既然已经涵盖了基础知识，那么让我们讨论一下可用于画布的大量实用程序节点！ 在成员面板下方，存在所有可用节点类型的列表:

source: Ctrl-F (Command-F on Mac) allows you to search the list.
es: Ctrl-F (Command-F en Mac) le permite buscar en la lista.
zh_cn: Ctrl-F(Mac上的Command-F)允许您搜索列表。

source: Any of them can be dragged to the scene. Unlike nodes (e.g. dragging a property from the Inspector sets the context to the node being edited automatically), these are added without any "contextual" information, so this has to be done manually.
es: Cualquiera de ellos peude ser arrastrado a la escena. A diferencia de los nodos(ejemplo, arrastrar una propiedad del inspector establece que el contexto del nodo se edita automáticamente), éstos se añaden sin ninguna información "contextual", por eso se tiene que hacer manualmente.
zh_cn: 其中任何一个都可以拖到现场。 与节点(例如，从Inspector拖动属性将上下文设置为正在自动编辑的节点)不同，这些节点在没有任何“上下文”信息的情况下添加，因此必须手动完成。

source: Remember that you can check the class reference for what each node does, as they are documented there. That mentioned, a brief overview of node types follows:
es: Recuerda que puedes verificar la clase de referencia a cada nodo que se realiza, ya que estan documentados, que se mencionan, en un breve resumen de los siguientes tipos de nodos:
zh_cn: 请记住，您可以检查每个节点的类参考，因为它们在那里记录。 提到的，节点类型的简要概述如下:

source: Constants
es: Constantes
zh_cn: 常量

source: Constant nodes are nodes that provide values that, while not changing over time, can be useful as reference values. Most of the time they are integer or float.
es: Nodos constantes pueden proveer valores que, aunque no cambian con el tiempo, pueden ser útiles como valores de referencia. En la mayor parte del tiempo son enteros o flotantes.
zh_cn: 常量节点是提供值的节点，这些值虽然不随时间变化，但可用作参考值。 大多数情况下它们是整数或浮点数。

source: The first one is "Constant", which allows you to select any value of any type as constant, from an integer (42) to a String ("Hello!"). In general, this node is not used that often because of default input values in *Data Ports*, but it's good to know it exists.
zh_cn: 第一个是“常量”，它允许您选择任何类型的任何值作为常量，从整数(42)到字符串(“Hello！”)。 通常，由于 *Data Ports* 中的默认输入值，通常不使用此节点，但知道它存在是很好的。

source: The second is the GlobalConstant node, which contains a long list of constants for global types in Godot. In there you can find some useful constants to refer to key names, joystick or mouse buttons, etc.
es: El segundo es el nodo GlobalConstant, que contiene una larga lista de constantes para tipos globales en Godot. Allí encontrarás constantes útiles para referirse a nombres clave, botones de joystick o ratón, etc.
zh_cn: 第二个是GlobalConstant节点，它包含Godot中全局类型的一长串常量。 在那里您可以找到一些有用的常量来引用键名，操纵杆或鼠标按钮等。

source: The third one is MathConstant, which provides typical mathematical constants, such as PI, E, etc.
zh_cn: 第三个是MathConstant，它提供典型的数学常数，如PI，E等。

source: Data
es: Datos
zh_cn: 数据

source: Data nodes deal with all sorts of access to information. Any information in Godot is accessed via these nodes, so they are some of the most important ones to use and pretty diverse.
es: Los nodos Data tratan todo tipo de acceso a información. Cualquier información en Godot es accedida mediante esos nodos, esos son los más importantes para usar y también muy diversos.
zh_cn: 数据节点处理各种信息访问。 Godot中的任何信息都可以通过这些节点访问，因此它们是一些最重要的使用和非常多样化的节点。

source: There are many types of nodes of interest here, so a short attempt to describe them will follow:
es: Hay muchos tipos de nodo de interés aquí, a continuación hay una breve descripción de ellos:
zh_cn: 这里有许多类型的感兴趣的节点，因此将对其进行简短的描述:

source: Action
zh_cn: 动作

source: Action nodes are vital when dealing with input from a device. You can read more about actions in the (@TODO ACTION TUTE LINK). In the following example below, the control is moved to the right when the "move_right" action is pressed.
es: Los nodos Action son vitales cuando se trata la entrada desde un dispositivo. En el siguiente ejemplo, el control es trasladado hacia la derecha cuando la acción "move_right" es presionada.
zh_cn: 在处理来自设备的输入时，动作节点是至关重要的。 您可以在 (@TODO ACTION TUTE LINK) 中阅读有关操作的更多信息。 在下面的示例中，当按下“move_right”动作时，控件将移动到右侧。

source: Engine Singleton
zh_cn: 引擎单例

source: Engine singletons are global interfaces (meaning they can be accessed without a reference; unlike Scene Nodes, they are always available). They have several purposes, but in general, they are useful for low-level access or OS-related access.
zh_cn: 引擎单例是全局接口(意味着它们可以在没有引用的情况下访问，与场景节点不同，它们始终可用)。 它们有多种用途，但通常它们对于低级访问或与操作系统相关的访问很有用。

source: Remember that dragging a connection to empty space will help you call functions or set/get properties on these:
es: Recuerda que arrastrando una conexión a un espacio vacío ayudará a llamar funciones o asignar/obtener (set/get) propiedades en los siguientes:
zh_cn: 请记住，将连接拖动到空白区域将帮助您调用函数或设置/获取以下属性:

source: Local Variables
es: Variables locales
zh_cn: 局部变量

source: These are nodes you can use as temporary storage for your graphs. Make sure they all have the same name and type when using them and they will reference the same piece of memory.
es: Estos son nodos que puedes usar como almacenamiento temporal para tus gráficos. Asegúrate que todos tienen el mismo nombre y tipo al usarlos y que hacen referencia a la misma parte de memoria.
zh_cn: 这些节点可用作图形的临时存储。 确保它们在使用时都具有相同的名称和类型，它们将引用相同的内存。

source: As it can be seen above, there are two nodes available: A simple getter, and a sequenced getter (setting requires a sequence port).
es: Como se puede apreciar arriba, hay dos nodos disponibles: Un getter simple y un getter secuenciado (la asignación requiere un puerto secuenciado).
zh_cn: 从上面可以看出，有两个节点可用:一个简单的getter和一个有序的getter(设置需要一个序列端口)。

source: Scene Node
es: Nodo de Escena
zh_cn: 场景节点

source: This is just a reference to a node in the tree, but it's easier to use this node by dragging the actual node from the scene tree to the canvas (this will create it and configure it).
es: Esto es sólo una referencia a un nodo en el árbol, pero es más fácil usar este nodo arrastrando el nodo actual desde el árbol de escena hasta el área de trabajo (esto lo creará y configurará).
zh_cn: 这只是对树中节点的引用，但通过将实际节点从场景树拖动到画布(这将创建并配置它)，可以更轻松地使用此节点。

source: Self
es: Propio
zh_cn: 自身

source: In some rare occasions, it may be desired to pass this Scene Node as argument. It can be used to call functions and set/get properties, or drag nodes (or event the node itself that has the script) from the Scene Tree to the canvas for this.
es: En raras ocasiones, se puede desear pasar este Nodo de Escena como argumento. Se puede usar para llamar funciones y establecer/obtener propiedades, o arrastrar nodos (o eventos del mismo nodo que tenga el script) desde el Árbol de Escenas hasta el área de trabajo para esto.
zh_cn: 在极少数情况下，可能需要将此场景节点作为参数传递。 它可用于调用函数和设置/获取属性，或将节点(或将具有脚本的节点本身的事件)从“场景树”拖动到画布。

source: SceneTree
es: Árbol de Escenas
zh_cn: 场景树

source: This node is similar to the Singleton node because it references the SceneTree, which contains the active scene. SceneTree, however, only works when the node is sitting in the scene and active, otherwise accessing it will return an error.
zh_cn: 此节点类似于Singleton节点，因为它引用包含活动场景的SceneTree。 但是，SceneTree仅在节点位于场景中并且处于活动状态时才起作用，否则访问它将作为错误返回。

source: SceneTree allows for many low-level things, like setting stretch options, calling groups, make timers, or even load another scene. It's a good class to get familiar with.
zh_cn: SceneTree允许许多低级别的事情，比如设置拉伸选项，调用组，制作计时器，甚至加载另一个场景。 熟悉这是一个很好的课程。

source: Preload
es: Precarga
zh_cn: 预载

source: This does the same function as preload() in GDScript. It maintains this resource loaded and ready to use. Rather than instancing the node, it's simpler to drag the desired resource from the filesystem dock to the canvas.
es: Esto hace la misma función que preload() en GDScript. Mantiene este recurso cargado y listo para usar. En lugar de instanciar el nodo, es más sencillo arrastrar el recurso deseado desde el panel de Sistema de Archivos hasta el área de trabajo.
zh_cn: 这与GDScript中的preload()功能相同。 它维护此资源已加载并可以使用。 而不是实例化节点，将所需资源从文件系统停靠点拖到画布上更简单。

source: Resource Path
es: Ruta de recursos
zh_cn: 资源路径

source: This node is a simple helper to get a string with a path to a resource you can pick. It's useful in functions that load things from disk.
es: Este nodo es un simple helper para obtener una cadena con una ruta a un recurso que puedes elegir. Es útil en funciones que cargan cosas desde el disco.
zh_cn: 此节点是一个简单的帮助器，用于获取包含可以选择的资源的路径的字符串。 它在从磁盘加载东西的函数中很有用。

source: Comment
es: Comentario
zh_cn: 注释

source: A Comment node works as a node you can resize to put around other nodes. It will not try to get focus or be brought to top when selecting it. It can also be used to write text on it.
es: Un nodo Comentario funciona como un nodo que puede ser redimensionado para colocarlo alrededor de otros nodos. No tratará de obtener el foco o ser puesto al frente al seleccionarlo. También se puede utilizar para escribir texto en él.
zh_cn: Comment节点用作可以调整大小以放置其他节点的节点。 在选择它时，它不会试图获得焦点或被放到首位。 它也可以用来在上面写文字。

source: Flow Control
es: Control de Flujo
zh_cn: 流程控制
