Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/visual_script/nodes_purposes.po
Languages: es, zh_cn

source: Flow control nodes allow the execution to take different branches, usually depending on a given condition.
es: Los nodos de control de flujo permiten que la ejecución tome diferentes caminos, normalmente dependiendo de una condición determinada.
zh_cn: 流控制节点允许执行采用不同的分支，通常取决于给定的条件。

source: This is a simple node that checks a bool port. If true, it will go via the "true" sequence port. If false, the second. After going for either of them, it goes via the "done" port. Leaving sequence ports disconnected is fine if not all of them are used.
es: Este es un nodo simple que compara un puerto booleano. Si es true, continuará por el puerto secuencia true. Si es falso, irá por el segundo. Después de ir por cualquiera de ellos, sigue por el puerto "done". Dejar los puertos de secuencia desconectados está bien si alguno de ellos no es usado.
zh_cn: 这是一个检查bool端口的简单节点。 如果为true，它将通过“true”序列端口。 如果是假的话，第二个。 在找到其中任何一个后，它通过“done”端口。 如果不是全部使用，则断开序列端口的连接是很好的。

source: Iterator
es: Iterador
zh_cn: 迭代器

source: Some data types in Godot (ie, arrays, dictionaries) are iterable. This means that a bit of code can run for each element that it has.
es: Algunos tipos de dato en Godot (por ejemplo array y diccionarios) son iterables. Esto significa que una porción de código puede ser ejecutada por cada elemento que tiene.
zh_cn: Godot中的一些数据类型(即数组，字典)是可迭代的。 这意味着可以为它拥有的每个元素运行一些代码。

source: The Iterator node goes through all elements and, for each of them, it goes via the "each" sequence port, making the element available in the "elem" data port.
es: El nodo Iterator va a través de todos los elementos y, por cada uno, pasa por el puerto secuencia "each", haciendo que el elemento esté disponible en el puerto de datos "elem".
zh_cn: Iterator节点遍历所有元素，并且对于每个元素，它通过“each”序列端口，使元素在“elem”数据端口中可用。

source: When done, it goes via the "exit" sequence port.
es: Cuando está listo, va por el puerto secuencia "exit".
zh_cn: 完成后，它通过“exit”序列端口。

source: Some functions can return values. In general for virtual ones, Godot will add the Return node for you. A return node forces the function to end.
es: Algunas funciones pueden retornar valores. En general, para las funciones virtuales, Godot agregará el nodo Return. Un nodo return fuerza a la función a terminar.
zh_cn: 某些函数可以返回值。 一般来说，对于虚拟的，Godot会为您添加Return节点。 返回节点强制函数结束。

source: This node is useful mostly for organizing your graph. It calls its sequence ports in order.
es: Este nodo es útil principalmente para organizar el grafo. Llama a sus puertos secuencia en orden.
zh_cn: 此节点主要用于组织图形。 它按顺序调用其序列端口。

source: TypeCast
zh_cn: 类型转换

source: This is a useful and commonly used node. You can use it to cast arguments or other objects to the type you desire. Afterwards, you can even drag the object output to get full completion.
es: Este es un nodo útil y de uso común. Puedes usarlo para asignar argumentos u otros objetos al tipo deseado. Después, puedes arrastrar el objeto de salida para obtener su completa finalización.
zh_cn: 这是一个有用且常用的节点。 您可以使用它将参数或其他对象转换为您想要的类型。 之后，您甚至可以拖动对象输出以完全完成。

source: It is also possible to cast to a script, which will allow complete script properties and functions:
es: También es posible convertir a un script, lo que permite obtener propiedades y funciones del script:
zh_cn: 也可以转换为脚本，这将允许完整的脚本属性和功能:也可以转换为脚本，这将允许完整的脚本属性和功能:

source: Switch
zh_cn: 选择

source: The Switch node is similar to the Condition node, but it matches many values at the same time.
es: El nodo Switch es similar al nodo Condition, pero iguala muchos valores al mismo tiempo.
zh_cn: Switch节点类似于Condition节点，但它同时匹配许多值。

source: This is a more primitive form of iteration. "repeat" sequence output will be called as long as the condition in the "cond" data port is met.
es: Esta es una forma primitiva de iteración. La salida de secuencia "repeat" será llamada tantas veces como la condición en el puerto de datos "cond" se cumpla.
zh_cn: 这是一种更原始的迭代形式。 只要满足“cond”数据端口中的条件，就会调用“重复”序列输出。

source: Functions
es: Funciones
zh_cn: 函数

source: Functions are simple helpers, most of the time deterministic. They take some arguments as input and return an output. They are almost never sequenced.
es: Los Function son ayudantes, la mayoría del tiempo deterministas. Toman algunos argumentos de entrada y devuelven una salida. En general no son secuenciados.
zh_cn: 这是一个有用且常用的节点。 您可以使用它将参数或其他对象转换为您想要的类型。 之后，您甚至可以拖动对象输出以完全完成。

source: Built-In
es: Funciones propias
zh_cn: 内置

source: By Type
zh_cn: 按类型

source: Those are the methods available to basic types. For example, if you want a dot-product, you can search for "dot" instead of the Vector3 category. In most cases just search the list of nodes, it should be faster.
es: Son métodos disponibles para tipos básicos. Por ejemplo, si quieres realizar un producto punto (dot product) puedes buscar "dot" en lugar de la categoría Vector3. En la mayoría de los casos sólo busca en la lista de nodos, debería ser mas rápido.
zh_cn: 这些是基本类型可用的方法。例如，如果您想要一个点积，您可以搜索“点”而不是Vector3类型。在大多数情况下，只需搜索节点列表，就应该更快。

source: Call
es: Llamada ("Call")
zh_cn: 调用

source: This is the generic calling node. It is rarely used directly but by dragging to empty space on an already configured node.
es: Esta es la llamada a nodo genérica. Es raramente utilizada directamente, se utiliza arrastrando desde un nodo ya configurado.
zh_cn: 这是通用调用节点。它很少直接使用，而是通过拖动到已配置的节点上的空白空间来使用。

source: Constructors
es: Constructores
zh_cn: 构造函数

source: These are all the functions needed to create Godot basic datatypes. For example, If you need to create a Vector3 out of 3 floats, a constructor must be used.
es: Esas son todas las funciones necesarias para crear tipos de datos básicos de Godot. Por ejemplo, si necesitas crear un Vector3 desde 3 floats, se debe utilizar un constructor.
zh_cn: 这些是创建Godot基本数据类型所需的所有函数。例如，如果需要从3个浮点数中创建一个Vector3，则必须使用构造函数。

source: Destructor
zh_cn: 析构函数

source: This is the opposite to Constructor, it allows to separate any basic type (ie, Vector3) into its sub-elements.
es: Es lo contrario al Constructor, permite separar tipos básicos en sus sub-elementos.
zh_cn: 这与构造函数相反，它允许将任何基本类型(即Vector3)分离到子元素中。

source: Emit Signal
es: Emitir Señal
zh_cn: 发射信号

source: Emits signals from any object. In general it's not that useful, as dragging a signal to the canvas works better.
es: Emite señales desde cualquier objeto. En general no es tan útil, ya que arrastrar una señal al área de trabajo es lo más eficaz.
zh_cn: 从任何物体发出信号。一般来说，这并不是很有用，因为拖动信号到画布的效果更好。

source: Get/Set
zh_cn: 获取/设置

source: Generic Getter/Setter node. Dragging properties from the Inspector works better, as they appear properly configured on drop.
es: Nodo Setter/Getter genérico. Arrastrando propiedades desde el Inspector suele ser mejor, ya que aparecen configuradas al soltar.
zh_cn: 通用的Getter/Setter节点。从属性面板中拖拽属性效果更好，因为在拖放时它们就被正确配置。

source: Wait
zh_cn: 等待

source: The Wait nodes will suspend execution of the function until something happens (many frames can pass until resuming, in fact). Default nodes allow you to wait for a frame to pass, a fixed frame or a given amount of time until execution is resumed.
es: El nodo Wait suspende la ejecución de la función hasta que suceda algo (de hecho, pueden pasar muchos frames hasta llegar resumirla). Por defecto los nodos permiten esperar un frame, un fixed frame o una cantidad de tiempo dada antes de resumir la ejecución.
zh_cn: 等待节点将暂停执行函数直到发生某些事情(实际上，许多帧可以通过，直到恢复)。默认节点允许您等待帧通过、固定帧或给定的时间量，直到执行恢复为止。

source: This node completely suspends the execution of the script, and it will make the function return a value that can be used to resume execution.
es: Este nodo suspende completamente la ejecución del script y hará que la función retorne un valor que puede ser utilizado para continuar la ejecución.
zh_cn: 这个节点完全暂停脚本的执行，它将使函数返回一个值，该值可用于恢复执行。

source: Yield Signal
es: Señal Yield
zh_cn: Yield 信号

source: Same as Yield, but will wait until a given signal is emitted.
es: Lo mismo que Yield, pero espera a que determinada señal sea emitida.
zh_cn: 与Yield相同，但要等到一个给定的信号发出。

source: Index
zh_cn: 索引

source: Generic indexing operator, not often used but it's good that it exists just in case.
es: Operador de indexación genérico, no muy usado pero es bueno que esté por si acaso.
zh_cn: 泛型索引操作符，不常用，但它的存在是好的，以防万一。

source: Operators
es: Operadores
zh_cn: 运算符

source: These are mostly generic operators, such as addition, multiplication, comparison, etc. By default, these mostly accept any datatype (and will throw an error at run-time if the types fed do not match those expected by the operator). It is always recommended to set the right type for operators to catch errors faster and make the graph easier to read.
zh_cn: 这些操作符主要是通用的操作符，如加法、乘法、比较等。默认情况下，这些操作符主要接受任何数据类型(如果输入的类型与操作符不匹配，则会在运行时出错)。建议始终为操作符设置正确的类型，以更快地捕捉错误并使图形更易于阅读。

source: Expression Node
zh_cn: 表达式节点

source: Among the operators, the *Expression* node is the most powerful. If well used, it allows you to enormously simplify visual scripts that are math or logic heavy. Type any expression on it and it will be executed in real-time.
es: Entre los operadores, el nodo *Expression* es el más potente. Si se usa bien, permite simplificar enormemente los visual scripts complejos desde el punto de vista matemático o lógico. Escribe cualquier expresión en él y se ejecutará en tiempo real.
zh_cn: 在运算符中， *Expression* 节点是最强大的。 如果使用得当，它可以让您获得数学或逻辑繁重的视觉可视化脚本。 在其上键入任何表达式，它将实时执行。

source: Expression nodes can:
es: Los nodos Expression pueden:
zh_cn: 表达式节点可以:

source: Perform math and logic expressions based on custom inputs (eg: "a*5+b", where a and b are custom inputs):
es: Ejecutar expresiones lógicas y matemáticas basadas en entradas personalizadas (ej. "a*5+b", donde a y b son tipos de entrada personalizados):
zh_cn: 基于自定义输入执行数学和逻辑表达式(例如:“a*5 + b”，其中a和b是自定义输入):

source: Access local variables or properties:
es: Acceder a variables locales o propiedades:
zh_cn: 访问局部变量或属性:

source: Use most of the existing built-in functions that are available to GDScript, such as sin(),cos(),print(), as well as constructors, such as Vector3(x,y,z),Rect2(..), etc.:
es: Utilizar la mayoría de las funciones built-in disponibles en GDScript, como sin(), cos(), print, así como constructores como Vector3(x,y,z),Rect2(...), etc.:
zh_cn: 使用GDScript可用的大多数现有内置函数，例如 sin(),cos(),print()，以及构造函数，例如Vector3(x，y，z)，Rect2(..) 等:

source: Call API functions:
es: Funciones API Call:
zh_cn: 调用API函数:

source: Use sequenced mode, which makes more sense in case of respecting the processing order:
es: Usar modo secuenciado, lo que tiene más sentido en caso de respetar el orden de procesamiento:
zh_cn: 使用顺序模式，在遵守处理顺序的情况下更有意义:

source: Nodes and Terminology
es: Nodos y terminología

source: Node Properties
es: Propiedades de los nodos

source: Ports and Connections
es: Puertos y Conexiones

source: *Sequence Ports* indicate the order in which operations are executed. Typically when a *Node* is done processing, it will go to the next node from one of the ports at the right. If nothing is connected the function may end, or another output *Sequence Port* might be tried (this depends on the node). Thanks to this, you can follow the logic flow within a function by following the white lines. Not every *Node* has *Sequence Ports*. In fact, most do not.
es: Los *Puertos de Secuencia* indican el orden en el que se ejecutan las operaciones. Típicamente cuando un *Nodo* es procesado, irá al siguiente nodo desde uno de los puertos a su derecha. Si no hay nada conectado, la función puede terminar, o se puede intentar otra salida *Puerto de secuencia* (esto depende del nodo). Gracias a esto, puede seguir el flujo lógico dentro de una función siguiendo las líneas blancas. No todos los *Nodos* tienen *Puertos de Secuencia*. De hecho, la mayoría no lo hace.

source: This may seem strange at the beginning, but it happens because *Data Ports* are 1:N (A single output port can connect to many inputs), while *Sequence Ports* are N:1 (Many sequence outputs can be connected to a single input).
es: Esto puede parecer extraño al principio, pero es así porque los *Puertos de DAtos* son 1:N (Una salida única puede conectarse a muchas entradas), mientras que los *Puertos de Secuencia* son N:1 (Muchas salidas pueden conectarse a una única entrada).

source: Adding Nodes
es: Agregando Nodos

source: Accessing Scene Nodes
es: Accediendo a Nodos de la Escena

source: Accessing Scene Node Properties
es: Accediendo a propiedades de Nodos de la Escena

source: As it can be seen above, the type and initial value of the variable can be changed, as well as some property hints. Ticking the "Export" options makes the variable visible in the Inspector when selecting the node. This also makes it available to other scripts via the method described in the previous step.
es: Como puede verse, el tipo y valor iniciales e la variable pueden ser cambiados, así como algunos hints de propiedades. Seleccionando la opción "Export" se hace que la variable sea visible en el Inspector cuando se selecciona el nodo. Esto hace también la hace disponible a otros scripts mediante el método descrito en el paso anterior.

source: A signal can also be edited via right-click menu to customize its arguments:
es: Una señal también puede ser editada con el menú de clic derecho para personalizar sus argumentos:

source: The signal you have created will appear in the Inspector along with the built-in node signals. This allows you to connect it from another script from another *Scene Node*:
es: La señal que has creado aparecerá en el Inspector junto con las señales de nodo incorporadas. Esto permite conectarlo desde otro script procedente de otro *Nodo de Escena*:

source: Adding More Nodes
es: Agregando más nodos

source: The first one is "Constant" which allows you to select any value of any type as constant, from an integer (42) to a String ("Hello!"). In general this node is not used that often because of default input values in *Data Ports*, but it's good to know it exists.
es: La primera es "Constant" que permite seleccionar cualquier valor de cualquier tipo como constante, desde un entero (42) hasta una cadena ("Hello!"). En general, este nodo no se utiliza tan a menudo debido a los valores de entrada por defecto en *Data Ports*, pero es bueno saber que existe.

source: The third one is MathConstant, which provides typical mathematical constants such as PI, E, etc.
es: El tercero es MathConstant, el cual provee constantes típicas en matemáticas como PI, E, etc.

source: Engine singletons are global interfaces (meaning they can be accessed without a reference, unlike Scene Nodes, they are always available). They have several purposes, but in general they are useful for low level access or OS-related access.
es: Los Engine Singletons son interfaces globales (pueden ser accedidas sin una referencia, y están siempre disponibles a diferencia de Nodos de la Escena). Tienen muchos propósitos pero, en general, son útiles para acceso a funciones de bajo nivel del SO.

source: This node is similar to the Singleton node because it references the SceneTree, which contains the active scene. SceneTree, however, only works when the node is sitting in the scene and active, otherwise accessing it will return as an error.
es: Este nodo es similar al nodo Singleton porque hace referencia al SceneTree, que contiene la escena activa. El SceneTree, sin embargo, sólo funciona cuando el nodo se encuentra activo en la escena, de lo contrario, el acceso a él retornará como un error.

source: SceneTree allows for many low level things, like setting stretch options, calling groups, make timers, or even load another scene. It's a good class to get familiar with.
es: SceneTree permite hacer muchas cosas de bajo nivel, como cambiar las opciones de ajuste de pantalla, llamar grupos, crear temporizadores o cargar otra escena principal. Es una clase con la que hay que estar familiarizado.

source: Condition
es: Condición

source: Return
es: Devuelve ("Return")

source: Sequence
es: Secuencia

source: While
es: Mientras ("While")

source: There is a list of built in helpers. The list is almost identical to the one from GDScript (@TODO, link to gdscript methods?). Most of them are mathematical functions, but others can be useful helpers. Make sure to take a look at the list at some point.
es: Hay una lista de helpers internos. La lista es casi idéntica a la de GDScript (@TODO, enlace a métodos gdscript?). La mayoría de ellos son funciones matemáticas, pero otros pueden ser útiles como ayuda. Asegúrate de echar un vistazo a la lista en algún momento.
