Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shading/shading_reference/canvas_item_shader.po
Languages: es, ja

source: CanvasItem shaders
es: Shaders CanvasItem
ja: CanvasItemシェーダー

source: CanvasItem shaders are used to draw all 2D elements in Godot. These include all nodes that inherit from CanvasItems, and all GUI elements.
es: Los shaders CanvasItem se usan para dibujar todos los elementos 2D en Godot. Estos incluyen todos los nodos que heredan de CanvasItems, y todos los elementos GUI.
ja: CanvasItemシェーダーは、Godotですべての2D要素を描画するために使用されます。これらには、CanvasItemsから継承するすべてのノード、およびすべてのGUI要素が含まれます。

source: CanvasItem shaders contain less built-in variables and functionality than Spatial shaders, but they maintain the same basic structure with vertex, fragment, and light processor functions.
es: Los shaders CanvasItem contienen menos variables incorporadas y funcionalidad que los shaders espaciales, pero mantienen la misma estructura básica con funciones de vértice, fragmento y procesador de luz.
ja: CanvasItemシェーダーには、Spatialシェーダーよりも少ない組み込み変数と関数が含まれていますが、頂点、フラグメント、およびライトプロセッサー関数と同じ基本構造を維持しています。

source: Render modes
es: Modos de renderizado
ja: レンダリングモード

source: Render mode
es: Modo de renderizado
ja: レンダリングモード

source: Description
es: Descripción
ja: 説明

source: Mix blend mode (alpha is transparency), default.
es: Modo de blending por mezcla (alfa es transparencia), es el modo por defecto.
ja: ミックスブレンドモード(アルファは透明度)、デフォルト。

source: Additive blend mode.
es: Modo de blending aditivo.
ja: 加算ブレンドモード。

source: Subtractive blend mode.
es: Modo de blending substractivo.
ja: 減算ブレンドモード。

source: Multiplicative blend mode.
es: Modo de blending multiplicativo.
ja: 乗法ブレンドモード。

source: Pre-multiplied alpha blend mode.
es: Modo de blending con alfa premultiplicado.
ja: 事前乗算されたアルファブレンドモード。

source: Disable blending, values (including alpha) are written as-is.
es: Desactivar la mezcla, los valores (incluido el alfa) se escriben tal cual.
ja: ブレンドを無効にすると、値(アルファを含む)がそのまま書き込まれます。

source: Result is just albedo. No lighting/shading happens in material.
es: El resultado es sólo albedo. El material no recibe luces ni shading.
ja: 結果は単なるアルベドです。マテリアルではライティング/シェーディングは発生しません。

source: Only draw on light pass.
es: Sólo dibuja en light pass (cuando se usa multipass).
ja: ライトパスでのみ描画します。

source: VERTEX/NORMAL/etc need to be transformed manually in vertex function.
es: VERTEX/NORMAL/etc necesitan ser transformados manualmente en función de vértice.
ja: VERTEX/NORMAL/その他は、頂点関数で手動で変換する必要があります。

source: Built-ins
es: Funciones propias

source: Values marked as "in" are read-only. Values marked as "out" are for optional writing and will not necessarily contain sensible values. Values marked as "inout" provide a sensible default value, and can optionally be written to. Samplers are not subjects of writing and they are not marked.
es: Los valores marcados como "in" son de sólo lectura. Los valores marcados como "out" son de escritura opcional y no necesariamente contendrán valores sensibles. Los valores marcados como "inout" proporcionan un valor por defecto sensato y pueden escribirse opcionalmente. Los valores marcados como "in" no son objeto de escritura y no están marcados.
ja: "in"としてマークされた値は読み取り専用です。"out"とマークされた値はオプションの書き込み用であり、必ずしも適切な値を含むとは限りません。"inout"とマークされた値は、適切なデフォルト値を提供し、オプションで書き込むことができます。サンプラーは書込みの対象ではなく、マークされていません。

source: Global built-ins
es: Funciones incorporadas globales

source: Global built-ins are available everywhere, including custom functions.
es: Las internas globales están disponibles en todas partes, incluyendo las funciones personalizadas.

source: Built-in
es: Integrado
ja: ビルトイン

source: in float **TIME**
es: en real **TIME**

source: Global time since the engine has started, in seconds (always positive). It's subject to the rollover setting (which is 3,600 seconds by default). It's not affected by :ref:`time_scale<class_Engine_property_time_scale>` or pausing, but you can override the ``TIME`` variable's time scale by calling ``VisualServer.set_shader_time_scale()`` with the desired time scale factor as parameter (``1.0`` being the default).
es: Tiempo global desde que el motor ha empezado, en segundos (siempre positivo). Está sujeto a la configuración de rollover (que son 3.600 segundos por defecto). No está afectado por :ref:`time_scale<class_Engine_property_time_scale>` o por pausa, pero puedes anular la escala de tiempo de la variable ``TIME`` llamando ``VisualServer.set_shader_time_scale()`` con el factor de la escala de tiempo deseada como paametro (``1.0`` siendo el predeterminado).

source: Vertex data (``VERTEX``) is presented in local space (pixel coordinates, relative to the camera). If not written to, these values will not be modified and be passed through as they came.
es: Los datos del vértice (``VERTEX``) se presentan en el espacio local (coordenadas de píxeles, relativas a la cámara). Si no se escriben, estos valores no se modificarán y se pasarán tal como llegaron.
ja: 頂点データ(``VERTEX``)はローカル空間(カメラに対するピクセル座標)に表示されます。書き込まれていない場合、これらの値は変更されず、そのまま渡されます。

source: The user can disable the built-in modelview transform (projection will still happen later) and do it manually with the following code:
es: El usuario puede desactivar la transformación incorporada de modelview (la proyección seguirá sucediendo más tarde) y hacerlo manualmente con el siguiente código:
ja: ユーザーは組み込みのmodelview変換を無効にし(投影は後で行われます)、次のコードを使用して手動で実行できます:

source: ``WORLD_MATRIX`` is actually a modelview matrix. It takes input in local space and transforms it into view space.
es: En realidad ``WORLD_MATRIX``es un matriz "modelview". Toma la entrada en espacio local y la convierte en espacio de vista.
ja: ``WORLD_MATRIX`` は実際にはモデルビューマトリックスです。ローカル空間で入力を受け取り、それをビュー空間に変換します。

source: In order to get the world space coordinates of a vertex, you have to pass in a custom uniform like so:
es: Para obtener las coordenadas de un vértice en espacio de mundo, hay que pasarlo en un constante Uniform personalizado:
ja: 頂点のワールド空間座標を取得するには、次のようなカスタムのuniformを渡す必要があります:

source: Then, in your vertex shader:
es: Luego, en el shader de vértice:
ja: 次に、頂点シェーダーで:

source: ``world_position`` can then be used in either the vertex or fragment functions.
es: entonces se puede usar``world_position`` o en la función de vértice or de fragment.
ja: ``world_position`` は頂点関数またはフラグメント関数で使用できます。

source: Other built-ins, such as UV and COLOR, are also passed through to the fragment function if not modified.
es: Otros típos integrados, como UV y COLOR, también se pasan a la función fragment si no están modificados.
ja: UVやCOLORなどの他のビルトインも、変更されていない場合はフラグメント関数に渡されます。

source: For instancing, the INSTANCE_CUSTOM variable contains the instance custom data. When using particles, this information is usually:
es: Para el instanciamiento, la variable INSTANCE_CUSTOM contiene los datos personalizados de la instancia. Cuando se usan partículas, esta información es normalment:
ja: インスタンス化の場合、INSTANCE_CUSTOM変数にはインスタンスのカスタムデータが含まれます。パーティクルを使用する場合、この情報は通常次のとおりです:

source: **x**: Rotation angle in radians.
es: **x**: Ángulo de rotación en radianes.
ja: **x**: ラジアン単位の回転角度。

source: **y**: Phase during lifetime (0 to 1).
es: **y**: Fase durante la vida (0 a 1).
ja: **y**: ライフタイム中のフェーズ(0〜1)。

source: **z**: Animation frame.
es: **z**: Fotograma de animación.
ja: **z**: アニメーションフレーム。

source: Image space to view space transform.
es: Transformación del espacio Image al espacio de vista.
ja: イメージ空間からビュー空間への変換。

source: Extra transform.
es: Transform extra.
ja: 追加の変換。

source: View space to clip space transform.
es: Ver el espacio para recortar la transformación del espacio.
ja: ビュー空間からクリップ空間への変換。

source: Instance custom data.
es: Datos personalizados de la instancia.
ja: インスタンスのカスタムデータ。

source: in bool **AT_LIGHT_PASS**
es: in booleano **AT_LIGHT_PASS**

source: ``true`` if this is a light pass.
es: ``true`` si esta es una light pass.
ja: ライトパスの場合はこれが ``true``。

source: Vertex, in image space.
es: Vértice, en el espacio de la imagen.
ja: イメージ空間内の頂点。

source: Normalized pixel size of default 2D texture. For a Sprite with a texture of size 64x32px, **TEXTURE_PIXEL_SIZE** = :code:`vec2(1/64, 1/32)`
es: Tamaño de píxel normalizado de la textura 2D por defecto. Para un Sprite con una textura de tamaño 64x32px, **TEXTURE_PIXEL_SIZE** = :code:`vec2(1/64, 1/32)`
ja: デフォルトの2Dテクスチャの正規化されたピクセルサイズ。サイズが64x32pxのテクスチャを持つスプライトの場合、\ **TEXTURE_PIXEL_SIZE** = :code:`vec2(1/64, 1/32)`

source: Texture coordinates.
es: Siguiente Coordenada.

source: Color from vertex primitive.
es: El color del vértice primitivo.
ja: 頂点プリミティブの色。

source: Final modulate color. If used, **COLOR** will not be multiplied by modulate automatically after the fragment function.
es: Color final de modulación. Si se usa, **COLOR** no se multiplicará por modular automáticamente después de la función de fragmento.

source: inout float **POINT_SIZE**
es: inout real **POINT_SIZE**

source: Point size for point drawing.
es: Tamaño del punto para el dibujo del punto.
ja: ポイント描画のポイントサイズ。

source: Certain Nodes (for example, :ref:`Sprites <class_Sprite>`) display a texture by default. However, when a custom fragment function is attached to these nodes, the texture lookup needs to be done manually. Godot does not provide the texture color in the ``COLOR`` built-in variable; to read the texture color for such nodes, use:
es: Ciertos nodos (por ejemplo, :ref:`Sprites <class_Sprite>`) muestran una textura por defecto. Sin embargo, cuando una función de fragmento personalizada se adjunta a estos nodos, la búsqueda de la textura debe hacerse manualmente. Godot no provee el color de la textura en la variable incorporada ``COLOR``; para leer el color de la textura para tales nodos, usa:
ja: 特定のノード(たとえば、\ :ref:`Sprites <class_Sprite>`)は、デフォルトでテクスチャを表示します。ただし、カスタムフラグメント関数がこれらのノードにアタッチされている場合、テクスチャルックアップは手動で行う必要があります。 Godotは、組み込みの ``COLOR`` 変数にテクスチャの色を提供しません。そのようなノードのテクスチャカラーを読み取るには、次を使用します:

source: This differs from the behavior of the built-in normal map. If a normal map is attached, Godot uses it by default and assigns its value to the built-in ``NORMAL`` variable. If you are using a normal map meant for use in 3D, it will appear inverted. In order to use it in your shader, you must assign it to the ``NORMALMAP`` property. Godot will handle converting it for use in 2D and overwriting ``NORMAL``.
es: Esto difiere del comportamiento del mapa normal incorporado. Si se adjunta un mapa normal, Godot lo usa por defecto y asigna su valor a la variable ``NORMAL`` incorporada. Si se usa un mapa normal destinado a ser usado en 3D, aparecerá invertido. Para usarlo en tu shader, debes asignarlo a la propiedad ``NORMALMAP``. Godot se encargará de convertirlo para su uso en 2D y sobrescribir ``NORMAL``.

source: Coordinate of pixel center. In screen space. ``xy`` specifies position in window, ``z`` specifies fragment depth if ``DEPTH`` is not used. Origin is lower-left.
es: Coordenadas del centro de los píxeles. En el espacio de la pantalla. ``xy`` especifica la posición en la ventana, ``z`` especifica la profundidad del fragmento si no se usa ``DEPTH``. El origen es abajo a la izquierda.
ja: ピクセルの中心の座標。画面スペース内。\ ``xy`` はウィンドウ内の位置を指定し、\ ``z`` は ``DEPTH`` を使用しない場合のフラグメントの深さを指定します。原点は左下です。

source: Normal read from **NORMAL_TEXTURE**. Writable.
es: Lectura normal de **NORMAL_TEXTURE**. Escrito.
ja: **NORMAL_TEXTURE ** からの法線の読み込み。書き込み可能。

source: Configures normal maps meant for 3D for use in 2D. If used, overwrites **NORMAL**.
es: Configura mapas normales destinados a 3D para su uso en 2D. Si se usa, sobrescribe **NORMAL**.
ja: 2Dで使用する3D用の法線マップを構成します。使用する場合、\ **NORMAL** を上書きします。

source: inout float **NORMALMAP_DEPTH**
es: inout real **NORMALMAP_DEPTH**

source: Normalmap depth for scaling.
es: Profundidad del Normalmap para el escalado.
ja: スケーリングのための法線マップの深さ。

source: UV from vertex function.
es: UV de la función del vértice.
ja: 頂点関数からのUV。

source: Color from vertex function and output fragment color. If unused, will be set to **TEXTURE** color.
es: Color de la función del vértice y color del fragmento de salida. Si no se usa, se fijará en el color de la **TEXTURE**.
ja: 頂点関数の色と出力フラグメントの色。使用しない場合、\ **TEXTURE ** 色に設定されます。

source: Default 2D texture.
es: Textura 2D por defecto.
ja: デフォルトの2Dテクスチャ。

source: Default 2D normal texture.
es: Textura normal 2D por defecto.
ja: デフォルトの2D法線テクスチャ。

source: Screen UV for use with **SCREEN_TEXTURE**.
es: Pantalla UV para usar con **SCREEN_TEXTURE**.
ja: **SCREEN_TEXTURE ** で使用するスクリーンUV。

source: Size of individual pixels. Equal to inverse of resolution.
es: El tamaño de los píxeles individuales. Igual a la inversa de la resolución.
ja: 個々のピクセルのサイズ。解像度の逆数に等しい。

source: Coordinate for drawing points.
es: Coordenadas para dibujar puntos.
ja: 描画ポイントの座標。

source: Screen texture, mipmaps contain gaussian blurred versions.
es: La textura de la pantalla, los mipmaps contienen versiones gaussianas difuminadas.
ja: 画面テクスチャ、ミップマップにはガウスぼかしバージョンが含まれています。

source: Light processor functions work differently in 2D than they do in 3D. In CanvasItem shaders, the shader is called once for the object being drawn, and then once for each light touching that object in the scene. Use render_mode ``unshaded`` if you do not want any light passes to occur for that object. Use render_mode ``light_only`` if you only want light passes to occur for that object; this can be useful when you only want the object visible where it is covered by light.
es: Las funciones de los procesadores de luz funcionan de manera diferente en 2D que en 3D. En los shaders CanvasItem, el shader se llama una vez para el objeto que se dibuja, y luego una vez para cada luz que toca ese objeto en la escena. Utiliza el modo_render_mode ``unshaded`` si no quieres que se produzca ningún paso de luz para ese objeto. Usa el modo render_mode ``light_only`` si sólo quieres que se produzcan pases de luz para ese objeto; esto puede ser útil cuando sólo quieres que el objeto sea visible donde está cubierto por la luz.
ja: ライトプロセッサの機能は、2Dでの動作と3Dでの動作が異なります。 CanvasItemシェーダーでは、シェーダーは描画されるオブジェクトに対して1回呼び出され、次にシーン内のそのオブジェクトに触れる各ライトに対して1回呼び出されます。そのオブジェクトに対してライトパスを発生させたくない場合は、render_mode ``unshaded`` を使用します。そのオブジェクトに対してのみライトパスを発生させたい場合は、render_mode ``light_only`` を使用します。これは、光で覆われた場所にのみオブジェクトを表示する場合に役立ちます。

source: When the shader is on a light pass, the ``AT_LIGHT_PASS`` variable will be ``true``.
es: Cuando el shader está en un pase de luz, la variable ``AT_LIGHT_PASS`` será ``true``.
ja: シェーダーがライトパス上にある場合、\ ``AT_LIGHT_PASS`` 変数は ``true`` になります。

source: Input Normal. Although this value is passed in, **normal calculation still happens outside of this function**.
es: Entrada normal. Aunque se pase este valor, **el cálculo normal sigue ocurriendo fuera de esta función**.
ja: 入力される法線。この値は渡されてきますが、\ **法線の計算はこの関数の外部で行われます**\ 。

source: UV from vertex function, equivalent to the UV in the fragment function.
es: UV de la función de vértice, equivalente a la UV en la función de fragmento.
ja: 頂点関数からのUV。フラグメント関数のUVと同等です。

source: Input Color. This is the output of the fragment function (with final modulation applied, if **MODULATE** is not used in any function of the shader).
es: Color de entrada. Esta es la salida de la función de fragmento (con la modulación final aplicada, si **MODULATE** no se utiliza en ninguna función del shader).

source: Current texture in use for CanvasItem.
es: Textura actual en uso para CanvasItem.
ja: CanvasItemに使用されている現在のテクスチャ。

source: **SCREEN_TEXTURE** Coordinate (for using with screen texture).
es: **SCREEN_TEXTURE** Coordenadas (para usar con la textura de la pantalla).

source: UV for Point Sprite.
es: UV para Point Sprite.
ja: ポイントスプライトのUV。

source: Vector from light to fragment in local coordinates. It can be modified to alter illumination direction when normal maps are used.
es: Vector de luz a fragmento en coordenadas locales. Puede ser modificado para alterar la dirección de la iluminación cuando se usan mapas normales.
ja: ローカル座標でのライトからフラグメントへのベクトル。法線マップを使用する場合、照明の方向を変更するように変更できます。

source: Vector from light to fragment in local coordinates. It can be modified to alter shadow computation.
es: Vector de luz a fragmento en coordenadas locales. Puede ser modificado para alterar el cálculo de la sombra.
ja: ローカル座標でのライトからフラグメントへのベクトル。シャドウ計算を変更するために変更できます。

source: inout float **LIGHT_HEIGHT**
es: inout real **LIGHT_HEIGHT**

source: Height of Light. Only effective when normals are used.
es: La altura de la luz. Sólo es efectivo cuando se usan normales.
ja: ライトの高さ。法線が使用されている場合にのみ有効です。

source: Color of Light.
es: Color de la Luz.
ja: ライトの色。

source: UV for Light texture.
es: UV para la textura de la Luz.
ja: ライトテクスチャのUV。

source: Shadow Color of Light.
es: El color de la Sombra de la Luz.
ja: ライトの影の色。

source: Value from the Light texture and output color. Can be modified. If not used, the light function is ignored.
es: Valor de la textura de la Luz y el color de salida. Puede ser modificado. Si no se usa, la función de luz es ignorada.
ja: ライトテクスチャと出力カラーの値。変更できます。使用しない場合、ライト関数は無視されます。

source: Vertex built-ins
ja: 頂点用ビルトイン

source: Global time, in seconds.
ja: 秒単位のグローバル時間。

source: Fragment built-ins
ja: フラグメント用ビルトイン

source: This differs from the behaviour of the built-in normal map. If a normal map is attached, Godot uses it by default and assigns its value to the built-in ``NORMAL`` variable. If you are using a normal map meant for use in 3D, it will appear inverted. In order to use it in your shader, you must assign it to the ``NORMALMAP`` property. Godot will handle converting it for use in 2D and overwriting ``NORMAL``.
ja: これは、ビルトイン法線マップの動作とは異なります。法線マップがアタッチされている場合、Godotはデフォルトでそれを使用し、その値を組み込みの ``NORMAL`` 変数に割り当てます。3Dで使用するための法線マップを使用している場合は、反転して表示されます。シェーダーで使用するには、\ ``NORMALMAP`` プロパティに割り当てる必要があります。Godotは、2Dで使用するために変換し、\ ``NORAMAL`` を上書きします。

source: Global time in seconds.
ja: 秒単位のグローバル時間。

source: Light built-ins
ja: ライト用ビルトイン

source: Input Color. This is the output of the fragment function with final modulation applied.
ja: 入力される色。これは、最終的な変調が適用されたフラグメント関数の出力です。
