Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shading/shading_reference/particle_shader.po
Languages: es

source: Particle shaders
es: Shaders Particle

source: Particle shaders are a special type of vertex shader that runs before the object is drawn. They are used for calculating material properties such as color, position, and rotation. They are drawn with any regular material for CanvasItem or Spatial, depending on whether they are 2D or 3D.
es: Los shaders de partículas son un tipo especial de shader de vértices que se ejecuta antes de que el objeto sea dibujado. Se utilizan para calcular las propiedades de los materiales, como el color, la posición y la rotación. Se dibujan con cualquier material normal para CanvasItem o Spatial, dependiendo de si son 2D o 3D.

source: Particle shaders are unique because they are not used to draw the object itself; they are used to calculate particle properties, which are then used by the CanvasItem of Spatial shader. They contain only a vertex processor function that outputs multiple properties (see built-ins below).
es: Los shaders de partículas son únicos porque no se utilizan para dibujar el objeto en sí mismo; se usan para calcular las propiedades de las partículas, que luego son utilizadas por el CanvasItem de Shader Espacial. Sólo contienen una función de procesador de vértices que da salida a múltiples propiedades (véase más adelante).

source: Particle shaders use a transform feedback shader, which is a special type of vertex shader that runs on its own. It takes in data in a buffer like a regular vertex shader does, but it also outputs to data buffers instead of outputting to the fragment shader for pixel-processing. Because of this, transform feedback shaders can build on themselves each run, unlike other shaders that discard the data they have calculated once they draw to the frame buffer.
es: Los shaders de partículas utilizan un shader de feedback transformada. Recibe los datos en una memoria intermedia como lo hace un shader de vértices normal, pero también da salida a las memorias intermedias de datos en lugar de dar salida al shader de fragmentos para el procesamiento de píxeles. Debido a esto, los shaders de feedback de transformación pueden construirse sobre sí mismos cada vez que se ejecutan, a diferencia de otros shaders que descartan los datos que han calculado una vez que se dibujan en el frame buffer.

source: Particle shaders are only available in the GLES3 backend. If you need particles in GLES2, use :ref:`CPUParticles <class_CPUParticles>`.
es: Los shaders de partículas sólo están disponibles en el backend GLES3. Si necesitas partículas en GLES2, usa :ref:`CPUParticles <class_CPUParticles>`.

source: Render modes
es: Modos de renderizado

source: Render mode
es: Modo de renderizado

source: Description
es: Descripción

source: Do not clear previous data on restart.
es: No borre los datos anteriores sobre el reinicio.

source: Disable attractor force. (Not currently implemented in 3.1)
es: Desactiva la fuerza de atracción. (No se aplica actualmente a 3.1)

source: Ignore **VELOCITY** value.
es: Ignora el valor de **VELOCIDAD**.

source: Built-ins
es: Funciones propias

source: Values marked as "in" are read-only. Values marked as "out" are for optional writing and will not necessarily contain sensible values. Values marked as "inout" provide a sensible default value, and can optionally be written to. Samplers are not subjects of writing and they are not marked.
es: Los valores marcados como "in" son de sólo lectura. Los valores marcados como "out" son de escritura opcional y no necesariamente contendrán valores sensibles. Los valores marcados como "inout" proporcionan un valor por defecto sensato y pueden escribirse opcionalmente. Los valores marcados como "in" no son objeto de escritura y no están marcados.

source: Global built-ins
es: Funciones incorporadas globales

source: Global built-ins are available everywhere, including custom functions.
es: Las internas globales están disponibles en todas partes, incluyendo las funciones personalizadas.

source: Built-in
es: Integrado

source: in float **TIME**
es: en real **TIME**

source: Global time, in seconds.
es: Tiempo global, en segundos.

source: In order to use the ``COLOR`` variable in a SpatialMaterial, set ``use_vertex_as_albedo`` to ``true``. In a ShaderMaterial, access it with the ``COLOR`` variable.
es: Para usar la variable ``COLOR`` en un SpatialMaterial, ponga ``use_vertex_as_albedo`` en ``true``. En un ShaderMaterial, accede a él con la variable ``COLOR``.

source: Particle color, can be written to and accessed in mesh's vertex function.
es: El color de las partículas, se puede escribir y acceder a la función de vértice de la malla.

source: Particle velocity, can be modified.
es: La velocidad de las partículas, puede ser modificada.

source: out float **MASS**
es: out real **MASS**

source: Particle mass, use for attractors (not implemented in 3.1).
es: Masa de partículas, usado para los atractores (no implementado en 3.1).

source: inout bool **ACTIVE**
es: inout booleano **ACTIVE**

source: ``true`` when Particle is active, can be set to ``false``.
es: ``true`` cuando Particula está activo, puede ser configurado como ``false``.

source: in bool **RESTART**
es: in booleano **RESTART**

source: ``true`` when particle must restart (lifetime cycled).
es: ``true`` cuando la partícula debe reiniciar (ciclo de vida).

source: Custom particle data. Accessible from shader of mesh as **INSTANCE_CUSTOM**.
es: Datos de partículas personalizadas. Accesible desde el shader de malla como **INSTANCE_CUSTOM**.

source: Particle transform.
es: Transformación de partícula.

source: in float **LIFETIME**
es: in real **LIFETIME**

source: Particle lifetime.
es: La vida de las partículas.

source: in float **DELTA**
es: in real **DELTA**

source: Delta process time.
es: Tiempo de proceso Delta.

source: Unique number since emission start.
es: Un número único desde el comienzo de la emisión.

source: Particle index (from total particles).
es: Índice de partículas (de partículas totales).

source: Emitter transform (used for non-local systems).
es: Transformación del emisor (utilizado para sistemas no locales).

source: Random seed used as base for random.
es: Semillas al azar usadas como base para el azar.
