Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shading/shading_reference/shaders.po
Languages: de, es, fr, ja, pt_br

source: Shaders
de: Shader (Schattierer)
ja: シェーダー

source: Introduction
de: Einführung
es: Introducción
ja: はじめに
pt_br: Introdução

source: Shaders are unique programs that run on the GPU. They are used to specify how to take mesh data (vertex positions, colors, normals, etc.) and draw them to the screen. Shaders do not process information the same way a normal program does because they are optimized for running on the GPU. One consequence of this is that shaders do not retain their data after they run; they output a final color to the screen and then move on. Accordingly, there is no way of accessing the color output from the last run of the shader.
de: Shader (Schattierer) sind eigenständige Programme die auf der GPU laufen. Sie werden genutzt um die Mesh-Daten (Vertex Positionen, Farben, Normals, usw.) auszuwerten und auf dem Bildschirm zu zeichnen. Shader verarbeiten Daten nicht auf die gleiche Weise wie ein normales Programm, da sie auf der GPU laufen und dafür optimiert wurden. Ein Konsequenz daraus ist, dass Shader ihre Daten nach dem Durchlauf verlieren; sie geben eine Farbe auf dem Bildschirm aus und fahren fort. Demzufolge gibt es keinen Weg auf diese Farbausgabe vom letzten Shaderdurchlauf zuzugreifen.
es: Los shaders son programas únicos que se ejecutan en la GPU. Se usan para especificar cómo tomar datos de la malla (posiciones de vértices, colores, normales, etc.) y dibujarlos en la pantalla. Los shaders no procesan la información de la misma manera que un programa normal porque están optimizados para ejecutarse en la GPU. Una consecuencia de esto es que los shaders no retienen sus datos después de ejecutarse; emiten un color final a la pantalla y luego siguen adelante. Por consiguiente, no hay forma de acceder a la salida de color de la última ejecución del shader.
fr: Les shaders sont des programmes uniques qui tournent sur le GPU. Ils permettent de spécifier comment prendre les données du maillage (positions des sommets, couleurs, normales, etc.) et les dessiner à l'écran. Les shaders ne traitent pas les informations de la même manière qu'un programme normal car ils sont optimisés pour fonctionner sur le GPU. Une des conséquences de cette situation est que les shaders ne conservent pas leurs données après leur exécution ; ils émettent une couleur finale à l'écran et passent ensuite à l'étape suivante. Par conséquent, il n'y a aucun moyen d'accéder à la sortie couleur de la dernière passe du shader.
ja: シェーダーは、GPU上で実行される独自のプログラムです。メッシュデータ(頂点の位置、色、法線など)を取得して画面に描画する方法を指定するために使用されます。シェーダーは、GPUでの実行用に最適化されているため、通常のプログラムと同じように情報を処理しません。この結果、シェーダーは実行後にデータを保持しません。最終的な色を画面に出力し、次に進みます。したがって、シェーダーの最後の実行からのカラー出力にアクセスする方法はありません。
pt_br: Shaders são programas únicos que rodam na GPU. Eles são usados para especificar como pegar os dados de malha (posições dos vértices, cores, normais, etc.) e desenhá-los na tela. Os shaders não processam as informações da mesma forma que um programa normal porque são otimizados para execução na GPU. Uma consequência disso é que os shaders não retêm seus dados depois de executados; eles exibem uma cor final na tela e depois seguem em frente. Consequentemente, não há como acessar a saída de cor da última execução do shader.

source: Godot uses a shader language very similar to GLSL, but with added functionality and slightly less flexibility. The reason for doing this is that Godot integrates built-in functionality to make writing complex shaders substantially easier. Godot wraps the user-written shader code in code of its own. That way, Godot handles a lot of the low-level stuff that the user doesn't need to worry about, and it is able to parse your shader code and use it to affect the rendering pipeline. For more advanced shaders, you can turn this functionality off using a render_mode.
es: Godot utiliza un lenguaje de shader muy similar al GLSL, pero con mayor funcionalidad y ligeramente menos flexibilidad. La razón para hacer esto es que Godot integra la funcionalidad incorporada para hacer la escritura de shaders complejos sustancialmente más fácil. Godot envuelve el código de sombreador escrito por el usuario en un código propio. De esta manera, Godot maneja muchas de las cosas de bajo nivel de las que el usuario no tiene que preocuparse, y es capaz de analizar su código de shader y utilizarlo para afectar la tubería de renderizado. Para shaders más avanzados, puedes desactivar esta funcionalidad usando un render_mode.
fr: Godot utilise un langage de shader très similaire à GLSL, mais avec des fonctionnalités supplémentaires et un peu moins de flexibilité. La raison en est que Godot intègre des fonctionnalités intégrées pour faciliter considérablement l'écriture de shaders complexes. Godot enveloppe le code du shader écrit par l'utilisateur dans un code qui lui est propre. De cette façon, Godot gère beaucoup de choses de bas niveau dont l'utilisateur n'a pas à se soucier, et il est capable d'analyser votre code de shader et de l'utiliser pour affecter le pipeline de rendu. Pour les shaders plus avancés, vous pouvez désactiver cette fonctionnalité en utilisant un render_mode.
ja: Godotは、GLSLと非常によく似たシェーダー言語を使用しますが、機能が追加され、柔軟性がわずかに低下します。これを行う理由は、Godotが組み込み関数を統合して、複雑なシェーダーの作成を大幅に簡単にするためです。 Godotは、ユーザーが作成したシェーダーコードを独自のコードでラップします。このようにして、Godotはユーザーが心配する必要のない低レベルのものを多数処理し、シェーダーコードを解析し、それを使用してレンダリングパイプラインに影響を与えることができます。より高度なシェーダーの場合、render_modeを使用してこの機能をオフにできます。
pt_br: O Godot usa uma linguagem de shader muito semelhante ao GLSL, mas com funcionalidade adicional e um pouco menos de flexibilidade. A razão para fazer isso é que o Godot integra uma funcionalidade embutida para tornar a escrita de shaders complexos substancialmente mais fácil. O Godot envolve o código de shader escrito pelo usuário em código próprio. Dessa forma, Godot lida com muitas das coisas de baixo nível com as quais o usuário não precisa se preocupar e é capaz de analisar seu código de shader e usá-lo para afetar a pipeline de renderização. Para shaders mais avançados, você pode desligar essa funcionalidade usando um render_mode.

source: This document provides you with some information about shaders, specific to Godot. For a detailed reference of the shading language in Godot see the :ref:`Godot shading language doc<doc_shading_language>`.
de: Dieses Dokument bietet Ihnen einige Information über Shader, speziell in Godot. Für eine detaillierte Referenz der Shader-Sprache in Godot siehe :ref:`Godot Shader-Sprache<doc_shading_language>`.
es: Este documento le proporciona alguna información sobre shaders, específica de Godot. Para una referencia detallada del lenguaje de shader en Godot ver la :ref:`Godot shading language doc<doc_shading_language>`.
fr: Ce document vous fournit quelques informations sur les shaders, spécifiques à Godot. Pour une référence détaillée du langage de shading dans Godot, voir :ref:`Godot shading language doc<doc_shading_language>`.
ja: このドキュメントは、Godot固有のシェーダーに関する情報を提供します。 Godotのシェーディング言語の詳細なリファレンスについては、\ :ref:`Godot shading language doc<doc_shading_language>` を参照してください。
pt_br: Este documento fornece algumas informações sobre shaders, específicas para o Godot. Para uma referência detalhada da linguagem de shader no Godot, consulte :ref:`Linguagem de shading do Godot <doc_shading_language>`.

source: Shader types
de: Shader-Typen
es: Tipos de Shaders
fr: Types de shader
ja: シェーダーの種類
pt_br: Tipos de shader

source: Instead of supplying a general purpose configuration for all uses (2D, 3D, particles), Godot shaders must specify what they are intended for. Different types support different render modes, built-in variables, and processing functions.
de: Anstatt eine Universalkonfiguration für alle Verwendungszwecke (2D, 3D, Partikel) bereitzustellen, müssen Godot-Shader angeben wofür sie bestimmt sind. Verschiedene Typen unterstützen verschiedene Rendermodi, integrierte Variablen und Verarbeitungsfunktionen.
es: En lugar de ofrecer una configuración de propósito general (2D, 3D, partículas), los shaders de Godot deben especificar para qué serán usadas. Diferentes tipos soportan distintos modos de renderizado, variables integradas y funciones de procesamiento.
fr: Au lieu de fournir une configuration générale pour tous les usages (2D, 3D, particules), les shaders Godot doivent préciser à quoi ils sont destinés. Différents types supportent différents modes de rendu, variables intégrées et fonctions de traitement.
ja: すべての用途(2D、3D、パーティクル)に汎用的な設定を提供する代わりに、Godotシェーダーは目的を指定する必要があります。さまざまなタイプがさまざまなレンダリングモード、組み込み変数、および処理関数をサポートしています。
pt_br: Em vez de fornecer uma configuração de propósito geral para todos os usos (2D, 3D, partículas), os shaders do Godot devem especificar a que se destinam. Diferentes tipos oferecem suporte a diferentes modos de renderização, variáveis integradas e funções de processamento.

source: All shaders need to specify their type in the first line, in the following format:
de: Alle Shader müssen ihren Typ in der ersten Zeile spezifizieren, im folgenden Format:
es: Todos los shaders deben especificar el tipo en la primera línea, en el siguiente formato:
fr: Tous les shaders doivent spécifier leur type dans leur première ligne, dans le format suivant :
ja: すべてのシェーダーは、最初の行で次の形式でタイプを指定する必要があります:
pt_br: Todos os shaders precisam especificar o seu tipo na primeira linha, no seguinte formato:

source: Valid types are:
de: gültige Typen sind:
es: Los tipos válidos son:
fr: Les types valides sont :
ja: 有効なタイプは以下のとおりです:
pt_br: Tipos válidos são:

source: :ref:`spatial <doc_spatial_shader>`: For 3D rendering.
de: :ref:`Spatial-Shader <doc_spatial_shader>`: für 3D Rendering.
es: :ref:`spatial <doc_spatial_shader>`: Para rendering 3D.
fr: :ref:`spatial <doc_spatial_shader>` : Pour le rendu 3D.
ja: :ref:`spatial <doc_spatial_shader>`: 3Dレンダリング用。
pt_br: :ref:`spatial <doc_spatial_shader>`: Para renderização 3D.

source: :ref:`canvas_item <doc_canvas_item_shader>`: For 2D rendering.
de: :ref:`canvas_item <doc_canvas_item_shader>`: für 2D Rendering.
es: :ref:`canvas_item <doc_canvas_item_shader>`: Para rendering 2D.
fr: :ref:`canvas_item <doc_canvas_item_shader>` : Pour le rendu 2D.
ja: :ref:`canvas_item <doc_canvas_item_shader>`: 2Dレンダリング用。
pt_br: :ref:`canvas_item <doc_canvas_item_shader>`: Para renderização 2D.

source: :ref:`particles <doc_particle_shader>`: For particle systems.
de: :ref:`particles <doc_particle_shader>`: für Partikelsysteme.
es: :ref:`particles <doc_particle_shader>`: Para sistemas de partículas.
fr: :ref:`particles <doc_particle_shader>` : Pour les systèmes de particules.
ja: :ref:`particles <doc_particle_shader>`: パーティクルシステム用。
pt_br: :ref:`particles <doc_particle_shader>`: Para sistemas de partículas.

source: For detailed information on each shading type, see the corresponding reference document.
de: Für detaillierte Informationen über jeden Shader Typ, siehe in das zugehörige Referenzdokument.
es: Para obtener información detallada sobre cada tipo de shader, véase el documento de referencia correspondiente.
fr: Pour des informations détaillées sur chaque type de shader, regardez la page de la documentation correspondante.
ja: 各シェーディングタイプの詳細については、対応するリファレンスドキュメントを参照してください。
pt_br: Para obter informações detalhadas sobre cada tipo de shading, consulte o documento de referência correspondente.

source: Render modes
de: Render-Modi
es: Modos de renderizado
fr: Mode de rendu
ja: レンダリングモード
pt_br: Modos de renderização

source: Different shader types support different render modes. They are optional and, if specified, must be after the *shader_type*. Render modes are used to alter the way built-in functionality is handled. For example, it is common to use the render mode ``unshaded`` to skip the built-in light processor function.
de: Verschiedene Shader-Typen unterstützen unterschiedliche Render-Modi. Sie sind optional und müssen, falls angegeben, nach dem *shader_type* stehen. Render-Modi werden verwendet, um die Art und Weise zu ändern, wie integrierte Funktionen behandelt werden. Beispielsweise ist es üblich, den Rendermodus`` zu verwenden, um die integrierte Lichtprozessorfunktion zu überspringen.
es: Los distintos tipos de shaders soportan diferentes modos de renderizado. Son opcionales pero, si se especifican, debe hacerse después del *shader_type*. Estos modos son usados para alterar la forma en que la funcionalidad integrada es manejada. Por ejemplo, es común usar el modo ``unshaded`` para saltearse la función de procesamiento de iluminación (light).
fr: Différents types de shader supportent différents modes de rendu. Ils sont optionnels et, s’ils sont précisés, doivent être après le *shader_type*. Les modes de rendu sont utilisés pour modifier la manière dont les fonctionnalités intégrées sont gérées. Par exemple, il est courant d’utiliser le mode de rendu ``unshaded`` (sans ombres) pour sauter la fonction intégrée de traitement de la lumière.
ja: さまざまなシェーダータイプがさまざまなレンダリングモードをサポートします。これらは、オプションであり、指定する場合は、\ *shader_type*\ の後に指定する必要があります。レンダリングモードは、組み込み機能の処理方法を変更するために使用されます。たとえば、レンダリングモード ``unshaded`` を使用して、組み込みのライトプロセッサ機能をスキップするのが一般的です。
pt_br: Diferentes tipos de shader oferecem suporte a diferentes modos de renderização. Eles são opcionais e, se especificados, devem estar após o *shader_type*. Os modos de renderização são usados para alterar a maneira como a funcionalidade integrada é tratada. Por exemplo, é comum usar o modo de renderização ``unshaded`` para pular a função embutida do processador de luz.

source: Render modes are specified underneath the shader type:
de: Rendermodi werden nach dem Shader-Typ angegeben:
es: Los modos de representación se especifican debajo del tipo shader:
fr: Les modes de rendu sont spécifiés en dessous du type de shader :
ja: レンダリングモードは、シェーダータイプの下に指定されます:
pt_br: Os modos de renderização são especificados sob o tipo de shader:

source: Each shader type has a different list of render modes available. See the document for each shader type for a complete list of render modes.
de: Für jeden Shader-Typ steht eine andere Liste von Rendermodi zur Verfügung. Eine vollständige Liste der Rendermodi finden Sie im Dokument für jeden Shader-Typ.
es: Cada tipo de shader tiene una lista diferente de modos de representación disponibles. Consulta el documento de cada tipo shader para obtener una lista completa de los modos de renderización.
fr: Chaque type de shader a une liste différente de mode de rendus disponibles. Regardez la documentation de chaque type de shader pour une liste complète des modes de rendu.
ja: 各シェーダータイプには、使用可能なレンダリングモードの異なるリストがあります。レンダリングモードの完全なリストについては、各シェーダータイプのドキュメントを参照してください。
pt_br: Cada tipo de shader possui uma lista diferente de modos de renderização disponíveis. Consulte o documento de cada tipo de shader para obter uma lista completa dos modos de renderização.

source: Processor functions
de: Prozessor-Funktionen
es: Funciones de procesamiento
fr: Fonctions processeur
ja: プロセッサー関数
pt_br: Funções de processador

source: Depending on the shader type, different processor functions may be optionally overridden. For "spatial" and "canvas_item", it is possible to override ``vertex``, ``fragment``, and ``light``. For "particles", only ``vertex`` can be overridden.
de: Je nach Shader-Typ können optional verschiedene Prozessorfunktionen überschrieben werden. Für "spatial" und "canvas_item" ist es möglich, ``vertex``, ``fragment``, und ``light`` zu überschreiben. Für "Partikel" kann nur ``vertex`` überschrieben werden.
es: Dependiendo del tipo de shader, distintas funciones de procesamiento estarán disponibles para sobreescribir. Para "spatial" y "canvas_item", es posible utilizar ``vertex``, ``fragment`` y ``light``. Para "particles" sólo está disponible ``vertex``.
fr: Selon le type de shader, différentes fonction processeur peuvent optionnellement être réécrites. Pour "spatial" et "canvas_item", il est possible de réécrire ``vertex``, ``fragment``, et ``light``. Pour "particles", seul ``vertex`` peut être réécrit.
ja: シェーダーのタイプに応じて、異なるプロセッサー関数がオプションでオーバーライドされる場合があります。"spatial" および "canvas_item" の場合、\ ``vertex``\ 、\ ``fragment`` および ``light`` をオーバーライドできます。"particles" の場合、オーバーライドできるのは``vertex`` のみです。
pt_br: Dependendo do tipo de shader, diferentes funções de processador podem ser substituídas opcionalmente. Para "spatial" e "canvas_item", é possível sobrepor ``vertex``, ``fragment`` e ``light``. Para "particles", apenas o ``vertex`` pode ser substituído.

source: Vertex processor
de: Vertex-Prozessor
es: Procesador Vertex
fr: Processeur de sommet
ja: 頂点プロセッサー
pt_br: Processador de vértice

source: The ``vertex`` processing function is called once for every vertex in "spatial" and "canvas_item" shaders. For "particles" shaders, it is called once for every particle.
de: Die ``vertex`` Verarbeitungsfunktion wird einmal für jeden Vertex in den Shadern "spatial" und "canvas_item" aufgerufen. Für "Partikel" -Shader wird es für jedes Partikel einmal aufgerufen.
es: La función de procesamiento ``vertex`` es llamada por cada vértice en shaders "spatial" y "canvas_item". Para "particles", es llamada por cada partícula.
fr: La fonction processeur ``vertex`` est appelée une fois pour chaque sommet dans les shaders "spatial" et "canvas_item". Pour les shaders "particles", elle est appelée une fois pour chaque particule.
ja: ``vertex`` 処理関数は、"spatial" および "canvas_item" シェーダーのすべての頂点に対して1回呼び出されます。"particles" シェーダーの場合、すべてのパーティクルに対して1回呼び出されます。
pt_br: A função de processamento ``vertex`` é chamada uma vez para cada vértice nos shaders "spatial" e "canvas_item". Para shaders "particles", é chamado uma vez para cada partícula.

source: The ``vertex`` function is used to modify per-vertex information that will be passed on to the fragment function. It can also be used to establish variables that will be sent to the fragment function by using varyings(see other doc).
de: Die Funktion ``vertex`` wird verwendet um Informationen pro Vertex zu ändern, die an die Fragmentfunktion weitergegeben werden. Es kann auch verwendet werden um Variablen festzulegen, die mithilfe von Variationen an die Fragmentfunktion gesendet werden (siehe anderes Dokument).
es: La función ``vertex`` se utiliza para modificar la información por vértice que se pasará a la función de fragmentos. También se puede utilizar para establecer las variables que se enviarán a la función de fragmento mediante el uso de variaciones (véase otro documento).
fr: La fonction ``vertex`` est utilisée pour modifier les informations par vertex qui seront transmises à la fonction fragment. Il peut aussi être utilisé pour établir des variables qui seront envoyées à la fonction fragment en utilisant des varyings (voir autre doc).
ja: ``vertex`` 関数は、フラグメント関数に渡される頂点ごとの情報を変更するために使用されます。また、varying (他のドキュメントを参照)を使用してフラグメント関数に送信される変数を設定するためにも使用できます。
pt_br: A função ``vertex`` é usada para modificar a informação por vértice que será passada para a função de fragmento. Também pode ser usado para estabelecer variáveis que serão enviadas para a função de fragmento usando variações(consulte outro documento).

source: By default, Godot will take your vertex information and transform it accordingly to be drawn. If this is undesirable, you can use render modes to transform the data yourself; see the :ref:`Spatial shader doc <doc_spatial_shader>` for an example of this.
de: Standardmäßig nimmt Godot Ihre Vertex-Informationen und transformiert sie entsprechend um sie zu zeichnen. Wenn dies unerwünscht ist, können Sie die Daten mithilfe von Rendermodi selbst transformieren. Ein Beispiel hierfür finden Sie im :ref:`Spatial Shader Dokument <doc_spatial_shader>.
es: Por defecto, Godot tomará la información de su vértice y la transformará para ser dibujada. Si esto no es deseable, puedes usar los modos de representación para transformar los datos tú mismo; ver el :ref:`Spatial shader doc <doc_spatial_shader>` para un ejemplo de esto.
fr: Par défaut, Godot prendra les informations de votre vertex et les transformera en conséquence pour les dessiner. Si cela n'est pas souhaitable, vous pouvez utiliser les modes de rendu pour transformer les données vous-même ; voir le :ref:`Spatial shader doc <doc_spatial_shader>` pour un exemple de ceci.
ja: デフォルトでは、Godotは頂点情報を取得し、それに応じて変換して描画します。これが望ましくない場合は、レンダリングモードを使用して自分でデータを変換できます。この例については、\ :ref:`Spatial shader doc <doc_spatial_shader>` を参照してください。
pt_br: Por padrão, o Godot pegará suas informações de vértice e as transformará de acordo com o desenho. Se isso for indesejável, você pode usar modos de renderização para transformar os dados você mesmo; veja o :ref:`Documento do shader espacial <doc_spatial_shader>` para um exemplo disso.

source: Fragment processor
de: Fragment-Prozessor oder Pixel-Prozessor
es: Procesador Fragment
fr: Processeur de fragments
ja: フラグメントプロセッサー
pt_br: Processador de fragmentos

source: The ``fragment`` processing function is used to set up the Godot material parameters per pixel. This code runs on every visible pixel the object or primitive draws. It is only available in "spatial" and "canvas_item" shaders.
de: Die ``fragment`` Verarbeitungsfunktion wird verwendet um die Godot-Materialparameter pro Pixel einzurichten. Dieser Code wird auf jedem sichtbaren Pixel ausgeführt, das das Objekt oder Grundelement zeichnet. Es ist nur in den Shadern "spatial" und "canvas_item" verfügbar.
es: El procesador ``fragment`` es usado para asignar parámetros de materiales por pixel. Este código es ejecutado por cada pixel visible que es dibujado en el objeto o primitiva. Sólo está disponible en shaders "spatial" y "canvas_item".
fr: La fonction de traitement des ``fragment`` permet de régler les paramètres du matériau Godot par pixel. Ce code s'exécute sur chaque pixel visible de l'objet ou du dessein primitif. Il n'est disponible que dans les shaders "spatial" et "canvas_item".
ja: ``fragment`` 処理関数は、ピクセルごとにGodotマテリアルパラメーターを設定するために使用されます。このコードは、オブジェクトまたはプリミティブが描画するすべての可視ピクセルで実行されます。"spatial" および "canvas_item" シェーダーでのみ使用できます。
pt_br: A função de processamento ``fragment`` é usada para configurar os parâmetros do material do Godot por pixel. Este código é executado em cada pixel visível que o objeto ou primitivo desenha. Ele está disponível apenas nos shaders "spatial" e "canvas_item".
