Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shading/shading_reference/shaders.po
Languages: de, es, fr, ja, pt_br

source: The standard use of the fragment function is to set up material properties that will be used to calculate lighting. For example, you would set values for ``ROUGHNESS``, ``RIM``, or ``TRANSMISSION`` which would tell the light function how the lights respond to that fragment. This makes it possible to control a complex shading pipeline without the user having to write much code. If you don't need this built-in functionality, you can ignore it and write your own light processing function and Godot will optimize it away. For example, if you do not write a value to ``RIM``, Godot will not calculate rim lighting. During compilation, Godot checks to see if ``RIM`` is used; if not, it cuts all the corresponding code out. Therefore, you will not waste calculations on effects that you do not use.
es: El uso estándar de la función fragment es establecer las propiedades materiales que se utilizarán para calcular la iluminación. Por ejemplo, se establecerían los valores de ``ROUGHNESS``, ``RIM``, o ``TRANSMISSION`` que le dirían a la función de la luz cómo las luces responden a ese fragmento. Esto hace posible controlar un complejo conducto shader sin que el usuario tenga que escribir mucho código. Si no necesitas esta funcionalidad incorporada, puedes ignorarla y escribir tu propia función de procesamiento de luz y Godot la optimizará. Por ejemplo, si no escribes un valor en ``RIM``, Godot no calculará la iluminación del borde. Durante la compilación, Godot comprueba si ``RIM`` se utiliza, si no, corta todo el código correspondiente. Por lo tanto, no desperdiciará los cálculos en efectos que no utiliza.
fr: L'utilisation standard de la fonction de fragment consiste à définir les propriétés des matériaux qui seront utilisées pour calculer l'éclairage. Par exemple, vous pouvez définir des valeurs pour ``ROUGHNESS``, ``RIM``, ou ``TRANSMISSION`` qui indiquent à la fonction lumière comment les lumières réagissent à ce fragment. Cela permet de contrôler un pipeline de shading complexe sans que l'utilisateur n'ait à écrire beaucoup de code. Si vous n'avez pas besoin de cette fonctionnalité intégrée, vous pouvez l'ignorer et écrire votre propre fonction de traitement de la lumière et Godot l'optimisera. Par exemple, si vous n'écrivez pas de valeur à ``RIM``, Godot ne calculera pas l'éclairage rim. Lors de la compilation, Godot vérifie si ``RIM`` est utilisé ; si ce n'est pas le cas, il coupe tout le code correspondant. Par conséquent, vous ne gaspillerez pas les calculs sur des effets que vous n'utilisez pas.
ja: フラグメント関数の標準的な使用法は、ライティングの計算に使用されるマテリアルプロパティを設定することです。たとえば、\ ``ROUGHNESS``\ 、\ ``RIM``\ または ``TRANSMISSION`` の値を設定して、ライトがそのフラグメントにどのように応答するかをライト機能に伝えます。これにより、ユーザーが多くのコードを記述することなく、複雑なシェーディングパイプラインを制御できます。この組み込み機能が必要ない場合は、それを無視して独自のライト処理関数を記述すれば、Godotはそれを最適化します。たとえば、\ ``RIM`` に値を書き込まない場合、Godotはリム照明を計算しません。コンパイル中、Godotは ``RIM`` が使用されているかどうかを確認します。そうでない場合は、対応するすべてのコードを切り取ります。したがって、使用しない効果の計算を無駄にすることはありません。
pt_br: O uso padrão da função de fragmento é configurar as propriedades do material que serão usadas para calcular a iluminação. Por exemplo, você definiria valores para ``ROUGHNESS``, ``RIM``, ou ``TRANSMISSION`` que diria à função de luz como as luzes respondem a esse fragmento. Isso torna possível controlar uma pipeline de sombreamento complexa sem que o usuário precise escrever muito código. Se você não precisa dessa funcionalidade integrada, pode ignorá-la e escrever sua própria função de processamento de luz e o Godot a otimizará. Por exemplo, se você não escrever um valor para ``RIM``, Godot não calculará a iluminação do aro. Durante a compilação, o Godot verifica se ``RIM`` é usado; caso contrário, elimina todo o código correspondente. Portanto, você não desperdiçará cálculos com efeitos que não usa.

source: Light processor
de: Beleuchtungs-Prozessor
es: Procesador Light
fr: Processeur de lumière
ja: ライトプロセッサー
pt_br: Processador de luz

source: The ``light`` processor runs per pixel too, but also runs for every light that affects the object (and does not run if no lights affect the object). It exists as a function called inside the ``fragment`` processor and typically operates on the material properties setup inside the ``fragment`` function.
es: El procesador "light" se ejecuta también por pixel, pero además es ejecutado por cada luz que afecta el objeto (y no es ejecutada si no hay luces afectando el objeto). Existe como una función llamada dentro de ``fragment`` y típicamente opera sobre las propiedades de los materiales configuradas dentro de la función ``fragment``.
fr: Le processeur de ``light`` fonctionne aussi par pixel, mais aussi pour chaque lumière qui affecte l'objet (et ne fonctionne pas si aucune lumière n'affecte l'objet). Il existe sous la forme d'une fonction appelée à l'intérieur du processeur de ``fragment`` et opère typiquement sur les propriétés du matériau configurées à l'intérieur de la fonction ``fragment``.
ja: ``light`` プロセッサーもピクセルごとに実行されますが、オブジェクトに影響を与えるすべてのライトに対しても実行されます(ライトがオブジェクトに影響を与えない場合は実行されません)。これは ``fragment`` プロセッサー内で呼び出される関数として存在し、通常は ``fragment`` 関数内で設定されたマテリアルプロパティで動作します。
pt_br: O processador ``light`` funciona por pixel também, mas também funciona para cada luz que afeta o objeto (e não funciona se nenhuma luz afetar o objeto). Ele existe como uma função chamada dentro do processador ``fragment`` e normalmente opera na configuração das propriedades do material dentro da função ``fragment``.

source: The ``light`` processor works differently in 2D than it does in 3D; for a description of how it works in each, see their documentation, :ref:`CanvasItem shaders <doc_canvas_item_shader>` and :ref:`Spatial shaders <doc_spatial_shader>`, respectively.
es: El procesador ``light`` funciona de manera diferente en 2D que en 3D; para una descripción de cómo funciona en cada uno, ver su documentación, :ref:`CanvasItem shaders <doc_canvas_item_shader>` y :ref:`Shaders espaciales <doc_spatial_shader>`, respectivamente.
fr: Le processeur ``light`` fonctionne différemment en 2D qu'en 3D ; pour une description de son fonctionnement dans chaque cas, voir leur documentation, :ref:`CanvasItem shaders <doc_canvas_item_shader>` et :ref:`Spatial shaders <doc_spatial_shader>`, respectivement.
ja: ``light`` プロセッサは、2Dでは3Dとは異なる動作をします。それぞれの仕組みの説明については、\ :ref:`CanvasItem shaders <doc_canvas_item_shader>` と :ref:`Spatial shaders <doc_spatial_shader>` のそれぞれのドキュメントを参照してください 。
pt_br: O processador ``light`` funciona de maneira diferente em 2D do que em 3D; para uma descrição de como funciona em cada um, consulte suas documentações, :ref:`Shaders CanvasItem <doc_canvas_item_shader>` e :ref:`Shaders Spatial <doc_spatial_shader>`, respectivamente.
