Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shading/shading_reference/spatial_shader.po
Languages: es

source: Spatial shaders are used for shading 3D objects. They are the most complex type of shader Godot offers. Spatial shaders are highly configurable with different render modes and different rendering options (e.g. Subsurface Scattering, Transmission, Ambient Occlusion, Rim lighting etc). Users can optionally write vertex, fragment, and light processor functions to affect how objects are drawn.
es: Los shaders espaciales se utilizan para sombrear objetos 3D. Son el tipo más complejo shader que ofrece Godot. Los shaders espaciales son altamente configurables con diferentes modos de renderización y diferentes opciones de renderización (por ejemplo, dispersión en el subsuelo, transmisión, oclusión ambiental, iluminación del borde, etc.). Los usuarios pueden opcionalmente escribir vértices, fragmentos y funciones de procesador de luz para afectar a la forma en que se dibujan los objetos.

source: Render modes
es: Modos de renderizado

source: Render mode
es: Modo de renderizado

source: Description
es: Descripción

source: Mix blend mode (alpha is transparency), default.
es: Modo de blending por mezcla (alfa es transparencia), es el modo por defecto.

source: Additive blend mode.
es: Modo de blending aditivo.

source: Subtractive blend mode.
es: Modo de blending substractivo.

source: Multiplicative blend mode.
es: Modo de blending multiplicativo.

source: Only draw depth for opaque geometry (not transparent).
es: Sólo dibuja "depth" para geometría opaca (no transparente).

source: Always draw depth (opaque and transparent).
es: Siempre dibuja "depth" (opaco y transparente).

source: Never draw depth.
es: Nunca dibuja depth.

source: Do opaque depth pre-pass for transparent geometry.
es: Realiza un pre-pass de depth opaco para geometría transparente.

source: Disable depth testing.
es: Desactiva testing de depth.

source: Cull front-faces.
es: Culling de caras frontales.

source: Cull back-faces (default).
es: Culling de caras internas (por defecto).

source: Culling disabled (double sided).
es: Culling deshabilitado (doble cara).

source: Result is just albedo. No lighting/shading happens in material.
es: El resultado es sólo albedo. El material no recibe luces ni shading.

source: Lambert shading for diffuse (default).
es: Utiliza Lambert shading para diffuse (por defecto).

source: Lambert wrapping (roughness dependent) for diffuse.
es: Utiliza Lambert wrapping (dependiente de roughness) para diffuse.

source: Oren Nayar for diffuse.
es: Usa Oren Nayar para diffuse.

source: Burley (Disney PBS) for diffuse.
es: Utiliza Burley (Disney PBS) para diffuse.

source: Toon shading for diffuse.
es: Shading Toon para diffuse.

source: Schlick-GGX for specular (default).
es: Usa Schlick-GGX para specular (por defecto).

source: Blinn for specular (compatibility).
es: Blinn para specular (compatibilidad).

source: Phong for specular (compatibility).
es: Usa Phong para specular (compatibilidad).

source: Toon for specular.
es: Usa Toon para specular.

source: Disable specular.
es: Deshabilita specular.

source: VERTEX/NORMAL/etc. need to be transformed manually in vertex function.
es: VERTEX/NORMAL/etc. Necesitan ser transformados manualmente en función de vértice.

source: VERTEX/NORMAL/etc. are modified in world coordinates instead of local.
es: VERTEX/NORMAL/etc son modificados en coordenadas del mundo en lugar de locales.

source: Use when non-uniform scale is applied to mesh.
es: Se usa cuando se aplica una escala no uniforme a la malla.

source: Use vertex-based lighting.
es: Usa iluminación basada en vértices.

source: Disable computing shadows in shader.
es: Deshabilita las sombras de computación en shader.

source: Disable contribution from ambient light and radiance map.
es: Deshabilitar la contribución de la luz ambiental y el mapa de radiaciones.

source: **shadow_to_opacity**
es: **sombra_a_opacidad**

source: Lighting modifies the alpha so shadowed areas are opaque and non-shadowed areas are transparent. Useful for overlaying shadows onto a camera feed in AR.
es: La iluminación modifica el alfa para que las áreas sombreadas sean opacas y las no sombreadas sean transparentes. Útil para superponer sombras a una cámara en AR.

source: Built-ins
es: Funciones propias

source: Values marked as "in" are read-only. Values marked as "out" are for optional writing and will not necessarily contain sensible values. Values marked as "inout" provide a sensible default value, and can optionally be written to. Samplers are not subjects of writing and they are not marked.
es: Los valores marcados como "in" son de sólo lectura. Los valores marcados como "out" son de escritura opcional y no necesariamente contendrán valores sensibles. Los valores marcados como "inout" proporcionan un valor por defecto sensato y pueden escribirse opcionalmente. Los valores marcados como "in" no son objeto de escritura y no están marcados.

source: Global built-ins
es: Funciones incorporadas globales

source: Global built-ins are available everywhere, including custom functions.
es: Las internas globales están disponibles en todas partes, incluyendo las funciones personalizadas.

source: Built-in
es: Integrado

source: in float **TIME**
es: en real **TIME**

source: Global time, in seconds.
es: Tiempo global, en segundos.

source: Vertex data (``VERTEX``, ``NORMAL``, ``TANGENT``, ``BITANGENT``) are presented in local model space. If not written to, these values will not be modified and be passed through as they came.
es: Los datos de los vértices (``VERTEX``, ``NORMAL``, ``TANGENT``, ``BITANGENT``) se presentan en el espacio modelo local. Si no se escriben, estos valores no se modificarán y se pasarán tal como llegaron.

source: They can optionally be presented in world space by using the *world_vertex_coords* render mode.
es: Opcionalmente pueden ser presentados en el espacio mundial usando el modo de representación *world_vertex_coords*.

source: Users can disable the built-in modelview transform (projection will still happen later) and do it manually with the following code:
es: Los usuarios pueden desactivar la transformada incorporada de modelview (la proyección seguirá sucediendo más tarde) y hacerlo manualmente con el siguiente código:

source: Other built-ins, such as UV, UV2 and COLOR, are also passed through to the fragment function if not modified.
es: Otras incorporadas, tales como UV, UV2 y COLOR, son también pasadas a la función fragmento si no se modifican.

source: Users can override the modelview and projection transforms using the ``POSITION`` built-in. When ``POSITION`` is used, the value from ``VERTEX`` is ignored and projection does not happen. However, the value passed to the fragment shader still comes from ``VERTEX``.
es: Los usuarios pueden sobreescribir la vista del modelo y las transformaciones de la proyección usando la ``POSICIÓN`` incorporada. Cuando se usa ``POSICIÓN``, el valor de ``VERTEX`` se ignora y la proyección no ocurre. Sin embargo, el valor pasado al shader de fragmentos sigue viniendo de ``VERTEX``.

source: For instancing, the INSTANCE_CUSTOM variable contains the instance custom data. When using particles, this information is usually:
es: Para el instanciamiento, la variable INSTANCE_CUSTOM contiene los datos personalizados de la instancia. Cuando se usan partículas, esta información es normalment:

source: **x**: Rotation angle in radians.
es: **x**: Ángulo de rotación en radianes.

source: **y**: Phase during lifetime (0 to 1).
es: **y**: Fase durante la vida (0 a 1).

source: **z**: Animation frame.
es: **z**: Fotograma de animación.

source: This allows you to easily adjust the shader to a particle system using default particles material. When writing a custom particle shader, this value can be used as desired.
es: Esto le permite ajustar fácilmente el shader a un sistema de partículas usando el material de partículas predeterminado. Cuando se escribe un shader de partículas personalizado, este valor puede ser usado como se desee.

source: in vec2 **VIEWPORT_SIZE**
es: en vec2 **VIEWPORT_SIZE**

source: Size of viewport (in pixels).
es: Tamaño del viewport (en píxeles).

source: Model space to world space transform.
es: Modelo de transformación del espacio en el mundo.

source: in mat4 **INV_CAMERA_MATRIX**
es: en mat4 **INV_CAMERA_MATRIX**

source: World space to view space transform.
es: El espacio mundial para ver la transformada del espacio.

source: View space to clip space transform.
es: Ver el espacio para recortar la transformación del espacio.

source: in mat4 **CAMERA_MATRIX**
es: en mat4 **CAMERA_MATRIX**

source: View space to world space transform.
es: Transform de espacio de vista a espacio de mundo.

source: Model space to view space transform (use if possible).
es: Espacio de vista a el espacio de la transformada mundial (usarlo si es posible).

source: Clip space to view space transform.
es: Recortar el espacio para ver la transformada del espacio.

source: Vertex in local coordinates.
es: Vertex en coordenadas locales.

source: If written to, overrides final vertex position.
es: Si está escrito, sobreescribe la posición final del vértice.

source: Normal in local coordinates.
es: Normal en coordenadas locales.

source: Tangent in local coordinates.
es: Tangente en coordenadas locales.

source: Binormal in local coordinates.
es: Binormal en coordenadas locales.

source: out float **ROUGHNESS**
es: out real **ROUGHNESS**

source: Roughness for vertex lighting.
es: Rugosidad para la iluminación del vértice.

source: UV main channel.
es: Canal principal de UV.

source: UV secondary channel.
es: Canal secundario UV.

source: in bool **OUTPUT_IS_SRGB**
es: in booleano **OUTPUT_IS_SRGB**

source: ``true`` when calculations happen in sRGB color space (``true`` in GLES2, ``false`` in GLES3).
es: ``true`` cuando los cálculos ocurren en el espacio de color sRGB (``true`` en GLES2, ``false`` en GLES3).

source: Color from vertices.
es: Color de los vértices.

source: inout float **POINT_SIZE**
es: inout real **POINT_SIZE**

source: Point size for point rendering.
es: Tamaño de punto para la representación de puntos.

source: in int **INSTANCE_ID**
es: en entero **INSTANCE_ID**

source: Instance ID for instancing.
es: ID de instancia para el instanciamiento.

source: Instance custom data (for particles, mostly).
es: Datos personalizados de la instancia (para las partículas, en su mayoría).

source: The default use of a Godot fragment processor function is to set up the material properties of your object and to let the built-in renderer handle the final shading. However, you are not required to use all these properties, and if you don't write to them, Godot will optimize away the corresponding functionality.
es: El uso por defecto de una función del procesador de fragmentos Godot es configurar las propiedades materiales de su objeto y dejar que el renderizador incorporado se encargue del shader final. Sin embargo, no es necesario que utilice todas estas propiedades, y si no las escribe, Godot optimizará la funcionalidad correspondiente.

source: Coordinate of pixel center in screen space. ``xy`` specifies position in window, ``z`` specifies fragment depth if ``DEPTH`` is not used. Origin is lower-left.
es: La coordenada del centro del píxel en el espacio de la pantalla. ``xy`` especifica la posición en la ventana, ``z`` especifica la profundidad del fragmento si no se usa ``DEPTH``. El origen esta abajo a la izquierda.

source: Vertex that comes from vertex function (default, in view space).
es: Vértice que proviene de la función de vértice (por defecto, en el espacio de visión).

source: Vector from camera to fragment position (in view space).
es: Vector desde la cámara hasta la posición del fragmento (en el espacio de visión).

source: in bool **FRONT_FACING**
es: in booleano **FRONT_FACING**

source: ``true`` if current face is front face.
es: ``true`` si la cara actual es la cara frontal.

source: Normal that comes from vertex function (default, in view space).
es: Normal que viene de la función de vértice (por defecto, en el espacio de visión).

source: Tangent that comes from vertex function.
es: Tangente que proviene de la función del vértice.

source: Binormal that comes from vertex function.
es: Binormal que proviene de la función del vértice.

source: Set normal here if reading normal from a texture instead of NORMAL.
es: Ponga normal aquí si lee normal de una textura en lugar de NORMAL.

source: out float **NORMALMAP_DEPTH**
es: out real **NORMALMAP_DEPTH**

source: Depth from variable above. Defaults to 1.0.
es: Profundidad de la variable de arriba. Por defecto es 1.0.

source: UV that comes from vertex function.
es: UV que proviene de la función del vértice.

source: UV2 that comes from vertex function.
es: UV2 que proviene de la función del vértice.

source: COLOR that comes from vertex function.
es: COLOR que proviene de la función del vértice.

source: Albedo (default white).
es: Albedo (blanco por defecto).

source: out float **ALPHA**
es: out real **ALPHA**

source: Alpha (0..1); if written to, the material will go to the transparent pipeline.
es: Alfa (0..1); si se escribe, el material irá a la tubería transparente.

source: out float **ALPHA_SCISSOR**
es: out real **ALPHA_SCISSOR**

source: If written to, values below a certain amount of alpha are discarded.
es: Si se escribe, se descartan los valores inferiores a una cierta cantidad de alfa.

source: out float **METALLIC**
es: out real **METALLIC**

source: Metallic (0..1).
es: Metálico (0..1).

source: out float **SPECULAR**
es: out real **SPECULAR**

source: Specular. Defaults to 0.5, best not to modify unless you want to change IOR.
es: Especular. El valor por defecto es 0.5, mejor no modificarlo a menos que quiera cambiar el IOR.

source: Roughness (0..1).
es: Rugosidad (0..1).

source: out float **RIM**
es: out real **RIM**

source: Rim (0..1). If used, Godot calculates rim lighting.
es: Rim (0..1). Si se usa, Godot calcula la iluminación del borde.

source: out float **RIM_TINT**
es: out real **RIM_TINT**

source: Rim Tint, goes from 0 (white) to 1 (albedo). If used, Godot calculates rim lighting.
es: Rim Tint, va de 0 (blanco) a 1 (albedo). Si se usa, Godot calcula la iluminación del borde.

source: out float **CLEARCOAT**
es: out real **CLEARCOAT**

source: Small added specular blob. If used, Godot calculates Clearcoat.
es: Pequeña mancha especular añadida. Si se usa, Godot calcula Clearcoat.

source: out float **CLEARCOAT_GLOSS**
es: out real **CLEARCOAT_GLOSS**

source: Gloss of Clearcoat. If used, Godot calculates Clearcoat.
es: El brillo de Clearcoat. Si se usa, Godot calcula Clearcoat.

source: out float **ANISOTROPY**
es: out real **ANISOTROPY**

source: For distorting the specular blob according to tangent space.
es: Para distorsionar la mancha especular según el espacio tangencial.

source: Distortion direction, use with flowmaps.
es: Dirección de la distorsión, uso con flowmaps.

source: out float **SSS_STRENGTH**
es: out real **SSS_STRENGTH**

source: Strength of Subsurface Scattering. If used, Subsurface Scattering will be applied to object.
es: La fuerza del Subsurface Scattering. Si se usa, la Subsurface Scattering se aplicará al objeto.

source: Transmission mask (default 0,0,0). Allows light to pass through object. Only applied if used.
es: Máscara de transmisión (por defecto 0,0,0). Permite que la luz pase a través del objeto. Sólo se aplica si se utiliza.

source: Emission color (can go over 1,1,1 for HDR).
es: Color de la emisión (puede superar el 1,1,1 para HDR).

source: out float **AO**
es: out real **AO**

source: Strength of Ambient Occlusion. For use with pre-baked AO.
es: La fuerza de la oclusión del ambiente. Para usar con AO precocinado.

source: out float **AO_LIGHT_AFFECT**
es: out real **AO_LIGHT_AFFECT**

source: How much AO affects lights (0..1; default 0).
es: Cuánto AO afecta a las luces (0..1; por defecto 0).

source: Built-in Texture for reading from the screen. Mipmaps contain increasingly blurred copies.
es: Textura incorporada para leer desde la pantalla. Los Mipmaps contienen copias cada vez más borrosas.

source: Built-in Texture for reading depth from the screen. Must convert to linear using INV_PROJECTION.
es: Textura incorporada para la profundidad de lectura de la pantalla. Debe convertirse a lineal usando INV_PROJECTION.

source: out float **DEPTH**
es: out real **DEPTH**

source: Custom depth value (0..1).
es: Valor de profundidad personalizado (0..1).

source: Screen UV coordinate for current pixel.
es: Muestra la coordenada UV para el píxel actual.

source: Point Coordinate for drawing points with POINT_SIZE.
es: Coordenadas de puntos para dibujar puntos con POINT_SIZE.

source: Writing light processor functions is completely optional. You can skip the light function by setting render_mode to ``unshaded``. If no light function is written, Godot will use the material properties written to in the fragment function to calculate the lighting for you (subject to the render_mode).
es: Las funciones del procesador de luz de escritura son completamente opcionales. Puedes saltarte la función de luz poniendo el modo de render_mode a ``unshaded``. Si no se escribe ninguna función de luz, Godot utilizará las propiedades del material escritas en la función de fragmento para calcular la iluminación por ti (sujeto al render_mode).

source: To write a light function, assign something to ``DIFFUSE_LIGHT`` or ``SPECULAR_LIGHT``. Assigning nothing means no light is processed.
es: Para escribir una función de luz, asigna algo a ``DIFFUSE_LIGHT`` o ``SPECULAR_LIGHT``. Asignar nada significa que no se procesa ninguna luz.

source: The light function is called for every light in every pixel. It is called within a loop for each light type.
es: La función de luz se llama para cada luz en cada píxel. Se llama dentro de un bucle para cada tipo de luz.

source: Below is an example of a custom light function using a Lambertian lighting model:
es: A continuación se muestra un ejemplo de una función de luz personalizada utilizando un modelo de iluminación lambertiano:

source: If you want the lights to add together, add the light contribution to ``DIFFUSE_LIGHT`` using ``+=``, rather than overwriting it.
es: Si quieres que las luces se sumen, agrega la contribución de la luz a ``DIFUSE_LIGHT`` usando ``+=``, en lugar de sobrescribirla.

source: The ``light()`` function won't be run if the ``vertex_lighting`` render mode is enabled, or if **Rendering > Quality > Shading > Force Vertex Shading** is enabled in the Project Settings. (It's enabled by default on mobile platforms.)
es: La función ``light()`` no se ejecutará si el modo de renderización ``vertex_lighting`` está habilitado, o si **Rendering > Quality > Shading > Force Vertex Shading** está habilitado en la configuración del proyecto. (Está habilitada por defecto en las plataformas móviles).

source: Elapsed total time in seconds.
es: Tiempo total transcurrido en segundos.

source: Coordinate of pixel center in screen space. ``xy`` specifies position in window, ``z`` specifies fragment depth if ``DEPTH`` is not used. Origin is lower-left.
es: La coordenada del centro del píxel en el espacio de la pantalla. ``xy`` especifica la posición en la ventana, ``z`` especifica la profundidad del fragmento si no se usa ``DEPTH``. El origen es abajo a la izquierda.

source: Normal vector, in view space.
es: Vector normal, en el espacio de visión.

source: View vector, in view space.
es: Vector de vista, en el espacio de vista.

source: Light Vector, in view space.
es: Vector de luz, en el espacio de visión.

source: Attenuation based on distance or shadow.
es: Atenuación basada en la distancia o en la sombra.

source: Base albedo.
es: Albedo de la base.

source: Color of light multiplied by energy.
es: El color de la luz multiplicado por la energía.

source: in float **ROUGHNESS**
es: in real **ROUGHNESS**

source: Roughness.
es: Rugosidad.

source: Transmission mask from fragment function.
es: Máscara de transmisión de la función fragment.

source: Diffuse light result.
es: Resultado de luz difusa.

source: Specular light result.
es: Resultado de la luz especular.
