Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/content/procedural_geometry/arraymesh.po
Languages: fr, ja, zh_cn

source: Using the ArrayMesh
fr: Utilisation du ArrayMesh
ja: ArrayMeshの使用
zh_cn: 使用ArrayMesh

source: This tutorial will present the basics of using an :ref:`ArrayMesh <class_arraymesh>`
fr: Ce tutoriel présente les bases de l'utilisation d'un :ref:`ArrayMesh <class_arraymesh>`
ja: このチュートリアルでは、\ :ref:`ArrayMesh <class_arraymesh>` の使用法の基本を紹介します
zh_cn: 本教程将介绍使用 :ref:`ArrayMesh <class_arraymesh>` 的基础知识

source: To do so, we will use the function :ref:`add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>`, which takes up to four parameters. The first two are required, while the second two are optional.
fr: Pour ce faire, nous utiliserons la fonction :ref:`add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>`, qui prend jusqu'à quatre paramètres. Les deux premiers sont obligatoires, tandis que les deux autres sont facultatifs.
ja: そのためには、関数 :ref:`add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>` を使用します。これは最大4つのパラメーターを取ります。最初の2つは必須ですが、残りの2つはオプションです。
zh_cn: 为此,我们将使用函数 :ref:`add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>` ,它最多需要四个参数.前两个参数是必须的,后两个参数是可选的.

source: The first is the ``PrimitiveType``, this is an OpenGL concept that instructs the GPU how to arrange the primitive based on the vertices given whether it is triangles, lines, points, etc. A complete list can be found under the :ref:`Mesh <class_mesh>` class reference page.
fr: Le premier est le ``PrimitiveType``, c'est un concept OpenGL qui indique au GPU comment arranger la primitive en fonction des sommets donnés, qu'il s'agisse de triangles, de lignes, de points, etc. Une liste complète peut être trouvée sur la page de référence de la classe :ref:`Mesh <class_mesh>`.
ja: 1つ目は ``PrimitiveType`` です。これは、三角形、線、点などであるかどうかにかかわらず、頂点に基づいてプリミティブを配置する方法をGPUに指示するOpenGLの概念です。完全なリストは下の :ref:`Mesh <class_mesh>` クラスのリファレンスページにあります。
zh_cn: 第一个是``PrimitiveType``,这是一个OpenGL的概念,指示GPU如何根据给定的顶点来安排基元,是三角形、线、点等.完整的列表可以在 :ref:`Mesh <class_mesh>`类参考页面下找到.

source: The second is the actual Array that stores the mesh information. The array is a normal Godot array that is constructed with empty brackets ``[]``. It stores a ``Pool**Array`` (e.g. PoolVector3Array, PoolIntArray, etc.) for each type of information.
fr: Le second est le Array réel qui stocke les informations sur le maillage. Le array est un array de Godot normal qui est construit avec des crochets vides ``[]``. Il stocke un ``Pool**Array`` (par exemple PoolVector3Array, PoolIntArray, etc.) pour chaque type d'information.
ja: 2番目は、メッシュ情報を格納する実際の配列です。配列は、空のブラケット ``[]`` で構成される通常のGodot配列です。情報の種類ごとに ``Pool**Array`` (PoolVector3Array、PoolIntArrayなど)を格納します。
zh_cn: 第二种是存储网格信息的实际Array.该数组是一个普通的Godot数组,用空括号``[]``构造.它为每一种类型的信息存储一个``Pool**Array``(如PoolVector3Array、PoolIntArray等).

source: ``ARRAY_VERTEX`` = 0 | PoolVector3Array or PoolVector2Array
fr: ``ARRAY_VERTEX`` = 0 | PoolVector3Array ou PoolVector2Array
ja: ``ARRAY_VERTEX`` = 0 | PoolVector3ArrayまたはPoolVector2Array

source: ``ARRAY_TANGENT`` = 2 | PoolRealArray of groups of 4 floats. first 3 floats determine the tangent, and the last the binormal direction as -1 or 1.
fr: ``ARRAY_TANGENT`` = 2 | PoolRealArray de groupes de 4 flottants. Les 3 premiers flottants déterminent la tangente, et le dernier la direction binaire comme -1 ou 1.
ja: ``ARRAY_TANGENT`` = 2 | 4つのfloatが一組になったPoolRealArray。最初の3つのfloatは接線を決定し、最後の従法線の方向は-1または1です。
zh_cn: ``ARRAY_TANGENT`` = 2 | PoolRealArray 4组浮点数,前3个浮点数决定切线,最后一个决定双法线方向,为-1或1.

source: ``ARRAY_TEX_UV`` = 4 | PoolVector2Array or PoolVector3Array
fr: ``ARRAY_TEX_UV`` = 4 | PoolVector2Array ou PoolVector3Array
ja: ``ARRAY_TEX_UV`` = 4 | PoolVector2ArrayまたはPoolVector3Array

source: ``ARRAY_TEX_UV2`` = 5 | PoolVector2Array or PoolVector3Array
fr: ``ARRAY_TEX_UV2`` = 5 | PoolVector2Array ou PoolVector3Array
ja: ``ARRAY_TEX_UV2`` = 5 | PoolVector2ArrayまたはPoolVector3Array

source: ``ARRAY_BONES`` = 6 | PoolRealArray of groups of 4 floats or PoolIntArray of groups of 4 ints
fr: ``ARRAY_BONES`` = 6 | PoolRealArray de groupes de 4 flottants ou PoolIntArray de groupes de 4 ints
ja: ``ARRAY_BONES`` = 6 | 4つのfloatが一組になったPoolRealArrayまたは4つのintが一組になったPoolIntArray
zh_cn: ``ARRAY_BONES`` = 6 | 4组浮点数的PoolRealArray或4组ints的PoolIntArray

source: ``ARRAY_WEIGHTS`` = 7 | PoolRealArray of groups of 4 floats
fr: ``ARRAY_WEIGHTS`` = 7 | PoolRealArray de groupes de 4 flottants
ja: ``ARRAY_WEIGHTS`` = 7 | 4つのfloatが一組になったPoolRealArray
zh_cn: ``ARRAY_WEIGHTS`` = 7 | 4个浮点的浮动数组

source: The Array of vertices is always required. All the others are optional and will only be used if included.
fr: L'Array des sommets est toujours requis. Tous les autres sont facultatifs et ne seront utilisés que s'ils sont inclus.
ja: 頂点の配列は常に必要です。他のすべてはオプションであり、含まれている場合にのみ使用されます。
zh_cn: 顶点阵列是必须的.所有其他的都是可选的,只有在包含的情况下才会使用.

source: Each array needs to have the same number of elements as the vertex array except for the index array. For arrays like tangents, an element is a group of 4 floats. So the array size will be four times the size of the vertex array size, but they will have the same number of elements
fr: Chaque array doit avoir le même nombre d'éléments que l'array des sommets, à l'exception de l'array des index. Pour les arrays comme les tangentes, un élément est un groupe de 4 flottants. La taille de l'array sera donc quatre fois plus grande que celle de l'array des sommets, mais ils auront le même nombre d'éléments
ja: 各配列は、インデックス配列を除き、頂点配列と同じ数の要素を持つ必要があります。接線のような配列の場合、要素は4つのfloatが一組です。したがって、配列のサイズは頂点配列のサイズの4倍になりますが、要素の数は同じになります
zh_cn: 除了索引数组外,每个数组的元素数量需要和顶点数组相同.对于像切线这样的数组,一个元素是4个浮动数组.所以数组的大小将是顶点数组大小的4倍,但它们的元素数是一样的

source: The index array is unique.
fr: L'array des index est unique.
ja: インデックス配列は一意です。
zh_cn: 索引数组是唯一的.

source: The third parameter is an array of blendshapes for the Mesh to use. While this tutorial does not cover using blendshapes, it is possible to specify them when creating a surface from arrays.
fr: Le troisième paramètre est un ensemble de blendshapes à utiliser pour le Mesh. Bien que ce tutoriel ne couvre pas l'utilisation des blendshapes, il est possible de les spécifier lors de la création d'une surface à partir d'arrays.
ja: 3番目のパラメーターは、使用するMeshのblendshapeの配列です。このチュートリアルではブレンドシェイプの使用については説明しませんが、配列からサーフェスを作成するときにそれらを指定することは可能です。
zh_cn: 第三个参数是网格要使用的混合形状数组.虽然本教程不涉及混合形状的使用,但在从数组创建曲面时,可以指定它们.

source: The last parameter is the compress flags which specifies which arrays to store with half as many bits. The values can be found in the classref for :ref:`VisualServer <class_visualserver>` under :ref:`ArrayFormat <enum_visualserver_arrayformat>`.
fr: Le dernier paramètre est les drapeaux de compression qui spécifient les arrays à stocker avec deux fois moins de bits. Les valeurs peuvent être trouvées dans la classref pour :ref:`VisualServer <class_visualserver>` sous :ref:`ArrayFormat <enum_visualserver_arrayformat>`.
ja: 最後のパラメーターは、半分のビット数で格納する配列を指定する圧縮フラグです。値は、\ :ref:`ArrayFormat <enum_visualserver_arrayformat>` の下の :ref:`VisualServer <class_visualserver>` のクラスリファレンスにあります。
zh_cn: 最后一个参数是压缩标志,指定哪些数组要用一半的比特数来存储.这些值可以在 :ref:`VisualServer <class_visualserver>`的classref中的 :ref:`ArrayFormat <enum_visualserver_arrayformat>`下找到.

source: For normal usage you will find it is best to leave the last two parameters empty.
fr: Pour une utilisation normale, il est préférable de laisser les deux derniers paramètres vides.
ja: 通常の使用法では、最後の2つのパラメーターを空のままにしておくのが最善です。
zh_cn: 对于正常的使用,你会发现最好将最后两个参数留空.

source: Add an :ref:`ArrayMesh <class_arraymesh>` to a MeshInstance. Normally, adding an ArrayMesh in the editor is not useful, but in this case it allows as to access the ArrayMesh from code without creating one.
fr: Ajoutez un :ref:`ArrayMesh <class_arraymesh>` à une MeshInstance. Normalement, l'ajout d'un ArrayMesh dans l'éditeur n'est pas utile, mais dans ce cas il permet d'accéder au ArrayMesh à partir du code sans en créer un.
ja: :ref:`ArrayMesh <class_arraymesh>` をMeshInstanceに追加します。通常、エディタにArrayMeshを追加することは有用ではありませんが、この場合、コードを作成せずにコードからArrayMeshにアクセスできます。
zh_cn: 在Mesh实例中添加一个 :ref:`ArrayMesh <class_arraymesh>` .通常情况下,在编辑器中添加ArrayMesh是没有用的,但在这种情况下,允许从代码中访问ArrayMesh,而不需要创建一个.

source: Next, add a script to the MeshInstance.
fr: Ensuite, ajoutez un script au MeshInstance.
ja: 次に、MeshInstanceにスクリプトを追加します。
zh_cn: 接下来,在MeshInstance中添加一个脚本.

source: Under ``_ready()``, create a new Array.
fr: Sous ``_ready()``, créez un nouvel Array.
ja: ``_ready()`` 下に、新しい配列を作成します。
zh_cn: 在``_ready()``下创建一个新的数组.

source: This will be the array that we keep our surface information in, it will hold all the arrays of data that the surface needs. Godot will expect it to be of size ``Mesh.ARRAY_MAX``, so resize it accordingly.
fr: Ce sera l'array dans lequel nous conserverons nos informations de surface, il contiendra tous les arrays de données dont la surface a besoin. Godot s'attendra à ce qu'il soit de la taille ``Mesh.ARRAY_MAX``, alors redimensionnez-le en conséquence.
ja: これは、サーフェス情報を保持する配列になり、サーフェスに必要なすべてのデータ配列を保持します。 Godotは、サイズが ``Mesh.ARRAY_MAX`` であることを期待するため、それに応じてサイズを変更します。
zh_cn: 这将是保存表面信息的数组,将保存表面需要的所有数据数组.Godot希望它的大小最大是 ``Mesh.ARRAY_MAX`` ,所以要相应调整.

source: Next create the arrays for each data type you will use.
fr: Créez ensuite les arrays pour chaque type de données que vous utiliserez.
ja: 次に、使用する各データ型の配列を作成します。
zh_cn: 接下来,为您将使用的每种数据类型创建数组.

source: Once you have filled your data arrays with your geometry you can create a mesh by adding each array to ``surface_array`` and then committing to the mesh.
fr: Une fois que vous avez rempli vos arrays de données avec votre géométrie, vous pouvez créer un maillage en ajoutant chaque array à ``surface_array``, puis en validant le maillage.
ja: データ配列にジオメトリを入力したら、各配列を ``surface_array`` に追加し、メッシュにコミットすることでメッシュを作成できます。
zh_cn: 一旦你用几何体填充了你的数据数组,就可以通过将每个数组添加到 ``surface_array`` ,然后提交到网格中来创建网格.

source: In this example, we used ``Mesh.PRIMITIVE_TRIANGLES``, but you can use any primitive type available from mesh.
fr: Dans cet exemple, nous avons utilisé ``Mesh.PRIMITIVE_TRIANGLES``, mais vous pouvez utiliser n'importe quel type primitif disponible à partir de mesh.
ja: この例では、\ ``Mesh.PRIMITIVE_TRIANGLES`` を使用しましたが、メッシュから利用可能な任意のプリミティブタイプを使用できます。
zh_cn: 在这个例子中,使用了 ``Mesh.PRIMITIVE_TRIANGLES`` ,但你也可以使用mesh中的任何基本类型.

source: Put together the full code looks like:
fr: Le code complet ressemble à ceci :
ja: 完全なコードをまとめると次のようになります:
zh_cn: 完整的代码如下:

source: The code that goes in the middle can be whatever you want. Below we will present some example code that could go in the middle.
fr: Le code qui va au milieu peut être ce que vous voulez. Ci-dessous, nous présenterons un exemple de code qui pourrait aller au milieu.
ja: 中間にあるコードは、あなたが望むものなら何でも構いません。以下に、途中で実行できるコード例を示します。
zh_cn: 中间可以放你想要的任何代码.下面将介绍一些放在中间的示例代码.

source: Generating geometry
fr: Génération de la géométrie
ja: ジオメトリの生成
zh_cn: 生成几何体

source: Here is sample code for generating a sphere. Although the code is presented in GDScript, there is nothing Godot specific about the approach to generating it. This implementation has nothing in particular to do with ArrayMeshes and is just a generic approach to generating a sphere. If you are having trouble understanding it or want to learn more about procedural geometry in general, you can use any tutorial that you find online.
fr: Voici un exemple de code pour générer une sphère. Bien que le code soit présenté en GDScript, il n'y a rien de spécifique à Godot dans l'approche de sa génération. Cette implémentation n'a rien de particulier à voir avec ArrayMeshes et n'est qu'une approche générique pour générer une sphère. Si vous avez du mal à comprendre ou si vous souhaitez en savoir plus sur la géométrie procédurale en général, vous pouvez utiliser n'importe quel tutoriel que vous trouverez en ligne.
ja: 球を生成するためのサンプルコードを次に示します。コードはGDScriptで表示されますが、コードを生成する方法についてGodot固有のものはありません。この実装は、ArrayMeshとは特に関係がなく、球体を生成するための一般的なアプローチです。理解に問題がある場合、またはプロシージャジオメトリ全般について詳しく知りたい場合は、オンラインで見つけたチュートリアルを使用できます。
zh_cn: 这是生成球体的示例代码. 尽管代码是用GDScript编写的,但是Godot并没有指定用特定的方式来实现它. 这种实现方式与ArrayMeshes无关,仅仅是一种通用的生成球体的方式. 如果您觉得这比较难以理解,或者想更全面了解 procedural geometry,可以在网上寻找相关的教程进行学习.

source: Combined with the code above, this code will generate a sphere.
fr: Combiné avec le code ci-dessus, ce code va générer une sphère.
ja: 上記のコードと組み合わせて、このコードは球体を生成します。
zh_cn: 与上面的代码相结合,这段代码将生成一个球体.

source: When it comes to generating geometry with the ArrayMesh you need to understand what goes in each array and then you can follow tutorials for any language/engine and convert it into Godot.
fr: Quand il s'agit de générer une géométrie avec ArrayMesh, vous devez comprendre ce qui se passe dans chaque array, puis vous pouvez suivre des tutoriels pour n'importe quel langage/moteur et le convertir dans Godot.
ja: ArrayMeshを使用してジオメトリを生成する場合は、各配列の内容を理解する必要があります。その後、任意の言語/エンジンのチュートリアルに従ってGodotに変換できます。
zh_cn: 当谈到用ArrayMesh生成几何体时,你需要了解每个数组中的内容,然后可以按照任何语言和引擎的教程将其转换为Godot.

source: Saving
fr: Enregistrer
ja: 保存
zh_cn: 保存中

source: Finally, Godot provides a single method to save ArrayMeshes using the :ref:`ResourceSaver <class_resourcesaver>` class. This is useful when you want to generate a mesh and then use it later without having to re-generate.
fr: Enfin, Godot fournit une méthode unique pour enregistrer ArrayMeshes en utilisant la classe :ref:`ResourceSaver <class_resourcesaver>`. Ceci est utile lorsque vous souhaitez générer un maillage, puis l'utiliser plus tard sans avoir à générer de nouveau.
ja: 最後に、Godotは :ref:`ResourceSaver <class_resourcesaver>` クラスを使用してArrayMeshを保存する単一のメソッドを提供します。これは、メッシュを生成し、後で再生成することなく再利用する場合に便利です。
zh_cn: 最后,Godot提供了一个单一的方法,使用 :ref:`ResourceSaver <class_resourcesaver>` 类来保存ArrayMeshes.当你想生成一个网格,然后在以后使用它而不需要重新生成时,这个方法很有用.
