Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/content/procedural_geometry/index.po
Languages: es, ja, zh_cn

source: Procedural geometry
es: Geometría procedural
ja: 手続き型ジオメトリ(幾何)
zh_cn: 程序几何

source: There are many ways to procedurally generate geometry in Godot. In this tutorial series we will explore a few of them. Each technique has its own benefits and drawbacks, so it is best to understand each one and how it can be useful in a given situation.
ja: Godotでジオメトリを手続き的に生成する方法は多数あります。このチュートリアルシリーズでは、それらのいくつかを検討します。それぞれの手法には長所と短所があるため、それぞれを理解し、特定の状況でどのように役立つかを理解することが最善です。
zh_cn: 在Godot中, 有许多方法可以程序化地生成几何体. 在本系列教程中, 我们将探讨其中的几种方法. 每种技术都有自己的优点和缺点, 所以最好了解每种技术, 以及它在特定情况下如何发挥作用.

source: What is geometry?
es: ¿Qué es geometría?
ja: ジオメトリとは何ですか？
zh_cn: 什么是几何？

source: Geometry is a fancy way of saying shape. In computer graphics, geometry is typically represented by an array of positions called "vertices". In Godot, geometry is represented by Meshes.
es: La geometría es una forma elegante de decir formas. En los gráficos por ordenador, la geometría se representa típicamente por una serie de posiciones llamadas "vértices". En Godot, la geometría es representada por Meshes.
ja: ジオメトリは、形を洒落た言い方で表現したものです。コンピュータグラフィックスでは、ジオメトリは通常「頂点」と呼ばれる位置の配列で表されます。 Godotでは、ジオメトリはメッシュで表されます。
zh_cn: 几何学是形状的一种花式说法. 在计算机图形学中, 几何图形通常由称为 "顶点" 的位置数组来表示. 在Godot中, 几何体用Meshes来表示.

source: What is a Mesh?
es: ¿Qué es una Mesh?
ja: メッシュとは何ですか?
zh_cn: 什么是网格？

source: Many things in Godot have mesh in their name: the :ref:`Mesh <class_Mesh>`, the :ref:`ArrayMesh <class_ArrayMesh>`, the :ref:`MeshInstance <class_MeshInstance>`, the :ref:`MultiMesh <class_MultiMesh>`, and the :ref:`MultiMeshInstance <class_MultiMeshInstance>`. While they are all related, they have slightly different uses.
es: Muchas cosas en Godot tienen un mesh en su nombre: el :ref:`Mesh <class_Mesh>`, el :ref:`ArrayMesh <class_ArrayMesh>`, el :ref:`MeshInstance <class_MeshInstance>`, el :ref:`MultiMesh <class_MultiMesh>`, y el :ref:`MultiMeshInstance <class_MultiMeshInstance>`. Aunque todos están relacionados, tienen usos ligeramente diferentes.
ja: Godotの多くの物には名前にメッシュがあります: :ref:`Mesh <class_Mesh>`\ 、\ :ref:`ArrayMesh <class_ArrayMesh>`\ 、\ :ref:`MeshInstance <class_MeshInstance>`\ 、\ :ref:`MultiMesh < class_MultiMesh>`\ 、および\ :ref:` MultiMeshInstance <class_MultiMeshInstance> `\ 。それらはすべて関連がありますが、用途が少し異なります。
zh_cn: 在Godot中, 很多东西的名字中都有mesh: :ref:`Mesh <class_Mesh>` , :ref:`ArrayMesh <class_ArrayMesh>` , :ref:`MeshInstance <class_MeshInstance>` , :ref:`MultiMesh <class_MultiMesh>` 和 :ref:`MultiMeshInstance <class_MultiMeshInstance>` . 虽然它们都是相关的, 但用途略有不同.

source: Meshes and ArrayMeshes are resources that are drawn using a MeshInstance node. Resources like Meshes and ArrayMeshes cannot be added to the scene directly. A MeshInstance represents one instance of a mesh in your scene. You can reuse a single mesh in multiple MeshInstances to draw it in different parts of your scene with different materials or transformations (scale, rotation, position etc.).
es: Meshes y ArrayMeshes son recursos que se dibujan usando un nodo de MeshInstance. Recursos como Meshes y ArrayMeshes no pueden ser añadidos a la escena directamente. Un MeshInstance representa una instancia de un mesh en tu escena. Puedes reutilizar una solo mesh en múltiples MeshInstance para que se dibuje en diferentes partes de tu escena con diferentes materiales o transformaciones (escala, rotación, posición, etc.).
ja: MesheとArrayMeshは、MeshInstanceノードを使用して描画されるリソースです。 MesheやArrayMeshなどのリソースをシーンに直接追加することはできません。 MeshInstanceは、シーン内のメッシュの1つのインスタンスを表します。単一のメッシュを複数のMeshInstanceで再利用して、異なるマテリアルまたは変換(スケール、回転、位置など)を使用してシーンの異なる部分に描画することができます。
zh_cn: Meshes 和 ArrayMeshes 是使用 MeshInstance 节点绘制的资源. 像Mesh和ArrayMeshes这样的资源不能直接添加到场景中. 一个MeshInstance代表了场景中网格的一个实例. 您可以在多个MeshInstance中重复使用一个网格, 用不同的材质或变换(比例, 旋转, 位置等)在场景的不同部分绘制它.

source: If you are going to draw the same object many times, it can be helpful to use a MultiMesh with a MultiMeshInstance. The MultiMeshInstance draws meshes thousands of times very cheaply. It takes advantage of hardware instancing in order to do so. The drawback with using a MultiMeshInstance is that you are limited to one material for all instances. It uses an instance array to store different colors and transformations for each instance, but all the instances use the same material.
es: Si vas a dibujar el mismo objeto muchas veces, puede ser útil usar una MultiMesh con una MultiMeshInstance. La MultiMeshInstance dibuja mallas miles de veces muy asequibles. Se aprovecha de la instanciación del hardware para hacerlo. El inconveniente de usar una MultiMeshInstance es que se limita a un material para todas las instancias. Utiliza un array de instancias para almacenar diferentes colores y transformaciones para cada instancia, pero todas las instancias utilizan el mismo material.
ja: 同じオブジェクトを何度も描画する場合は、MultiMeshとMultiMeshInstanceを使用すると便利です。 MultiMeshInstanceは非常に安価に何千回もメッシュを描画します。そのためには、ハードウェアのインスタンス化を利用します。 MultiMeshInstanceを使用する場合の欠点は、すべてのインスタンスで1つのマテリアルに制限されることです。インスタンス配列を使用して、インスタンスごとに異なる色と変換を保存しますが、すべてのインスタンスは同じマテリアルを使用します。
zh_cn: 如果你要多次绘制同一个对象, 那么使用MultiMesh与MultiMeshInstance会很有帮助.MultiMeshInstance可以非常便宜地绘制数千次网格. 它利用了硬件实例的优势来实现这一目的. 使用MultiMeshInstance的缺点是所有实例只能使用一种材料. 它使用一个实例数组为每个实例存储不同的颜色和变换, 但所有的实例都使用相同的材质.

source: What a Mesh is
es: Qué es una Mesh
ja: メッシュとは
zh_cn: 什么是网格

source: A Mesh is composed of one or more surfaces. A surface is an array composed of multiple sub-arrays containing vertices, normals, UVs, etc. Normally the process of constructing surfaces and meshes is hidden from the user in the :ref:`VisualServer <class_VisualServer>`, but with ArrayMeshes, the user can construct a Mesh manually by passing in an array containing the surface information.
es: Un Mesh está compuesto de una o más caras. Una cara es un conjunto compuesto de múltiples sub-arrays que contienen vértices, normales, UVs, etc. Normalmente el proceso de construcción de superficies y mallas está oculto para el usuario en el :ref:`VisualServer <class_VisualServer>`, pero con ArrayMeshes, el usuario puede construir una Mesh manualmente pasando un array que contiene la información de la superficie.
ja: メッシュは、1つ以上のサーフェスで構成されます。サーフェスは、頂点、法線、UVなどを含む複数のサブ配列で構成される配列です。通常、サーフェスとメッシュを構築するプロセスは、\ :ref:`VisualServer <class_VisualServer>` でユーザーから隠されていますが、ArrayMeshではユーザーは、サーフェス情報を含む配列を渡すことにより、メッシュを手動で構築できます。
zh_cn: 一个Mesh是由一个或多个曲面组成. 曲面是由多个子数组组成的数组, 包含顶点, 法线, UV等. 通常情况下, 构造曲面和网格的过程对用户来说是隐藏在 :ref:`VisualServer <class_VisualServer>` 中的, 但是通过ArrayMeshes, 用户可以通过传递一个包含曲面信息的数组来手动构造一个Mesh.

source: Surfaces
es: Caras
ja: サーフェス

source: Each surface has its own material. Alternatively, you can override the material for all surfaces in the Mesh when you use a MeshInstance using ``MeshInstance.override_material``.
es: Cada superficie tiene su propio material. También puedes anular el material para todas las superficies del Mesh cuando utilices una MeshInstance usando ``MeshInstance.override_material``.
ja: 各サーフェスには独自のマテリアルがあります。または、\ ``MeshInstance.override_material`` を使用してMeshInstanceを使用するときに、メッシュ内のすべてのサーフェスのマテリアルをオーバーライドできます。
zh_cn: 每个曲面都有自己的材质. 另外, 当你使用MeshInstance时, 你可以使用 ``MeshInstance.override_material`` 覆盖Mesh中所有曲面的材质.

source: Surface array
es: Array de las caras
ja: サーフェス配列
zh_cn: 表面数组

source: The surface array is an array of length ``ArrayMesh.ARRAY_MAX``. Each position in the array is filled with a sub-array containing per-vertex information. For example, the array located at ``ArrayMesh.ARRAY_NORMAL`` is a :ref:`PoolVector3Array <class_PoolVector3Array>` of vertex normals.
es: El array de superficie es un array de longitud ``ArrayMesh.ARRAY_MAX``. Cada posición en el array está llena de un sub-array que contiene información por vértice. Por ejemplo, el array situado en ``ArrayMesh.ARRAY_NORMAL`` es un :ref:`PoolVector3Array <class_PoolVector3Array>` de vértices normales.
ja: サーフェス配列は、長さ ``ArrayMesh.ARRAY_MAX`` の配列です。配列の各位置は、頂点ごとの情報を含むサブ配列で埋められます。たとえば、\ ``ArrayMesh.ARRAY_NORMAL`` にある配列は、頂点法線の :ref:`PoolVector3Array <class_PoolVector3Array>` です。
zh_cn: 曲面数组是一个长度为 ``ArrayMesh.ARRAY_MAX`` 的数组. 数组中的每个位置都有一个子数组, 包含每个顶点的信息. 例如, 位于 ``ArrayMesh.ARRAY_NORMAL`` 处的数组是一个 :ref:`PoolVector3Array <class_PoolVector3Array>` 的顶点法线.

source: The surface array can be indexed or non-indexed. Creating a non-indexed array is as easy as not assigning an array at the index ``ArrayMesh.ARRAY_INDEX``. A non-indexed array stores unique vertex information for every triangle, meaning that when two triangle share a vertex, the vertex is duplicated in the array. An indexed surface array only stores vertex information for each unique vertex and then also stores an array of indices which maps out how to construct the triangles from the vertex array. In general, using an indexed array is faster, but it means you have to share vertex data between triangles, which is not always desired (e.g. when you want per-face normals).
es: El array de superficie puede ser indexado o no indexado. Crear un array no indexado es tan fácil como no asignar un array en el índice ``ArrayMesh.ARRAY_INDEX``. Un array no indexado almacena información única de vértices para cada triángulo, lo que significa que cuando dos triángulos comparten un vértice, el vértice se duplica en el array. Un array con superficie indexada sólo almacena información de vértices para cada vértice único y luego también almacena un array de índices que traza el mapa de cómo construir los triángulos a partir del array de vértices. En general, el uso de un array indexado es más rápido, pero significa que hay que compartir los datos de vértices entre los triángulos, lo que no siempre es deseado (por ejemplo, cuando se quieren utilizar normales por cara).
ja: サーフェス配列はインデックス付きでもインデックスなしでもかまいません。非インデックス配列の作成は、インデックス ``ArrayMesh.ARRAY_INDEX`` で配列を割り当てないのと同じくらい簡単です。インデックスなしの配列には、すべての三角形の一意の頂点情報が格納されます。つまり、2つの三角形が頂点を共有する場合、頂点は配列内で複製されます。インデックス付きの表面配列は、各一意の頂点の頂点情報のみを格納し、頂点配列から三角形を構築する方法をマップするインデックスの配列も格納します。一般に、インデックス付き配列の使用は高速ですが、三角形間で頂点データを共有する必要があることを意味します。これは常に望ましいわけではありません(たとえば、面ごとの法線が必要な場合)。
zh_cn: 曲面数组可以是有索引的, 也可以是非索引的. 创建非索引数组就像在索引 ``ArrayMesh.ARRAY_INDEX`` 处不分配数组一样简单. 非索引数组为每个三角形存储唯一的顶点信息, 也就是说, 当两个三角形共用一个顶点时, 顶点在数组中是重复的. 有索引的曲面数组只存储每个唯一顶点的顶点信息, 然后还存储一个索引数组, 它映射出如何从顶点数组构造三角形. 一般来说, 使用索引数组的速度更快, 但这意味着您必须在三角形之间共享顶点数据, 这并不总是需要的(例如, 当您想要每面法线时).

source: Tools
es: Herramientas
ja: ツール
zh_cn: 工具

source: Godot provides different ways of accessing and working with geometry. More information on each will be provided in the following tutorials.
ja: Godotは、ジオメトリにアクセスして操作するさまざまな方法を提供します。それぞれの詳細については、次のチュートリアルで説明します。
zh_cn: Godot 提供了不同的访问和处理几何体的方法. 关于每种方法的更多信息将在下面的教程中提供.

source: The ArrayMesh resource extends Mesh to add a few different quality of life functions, and most importantly, the ability to construct a Mesh surface through scripting.
es: El recurso ArrayMesh extiende el Mesh para añadir unas cuantas funciones diferentes de calidad de vida, y lo más importante, la capacidad de construir una superficie de Mesh a través de scripts.
ja: ArrayMeshリソースはMeshを拡張して、いくつかの異なるQOL(利便性向上用の)関数を追加します。最も重要なことは、スクリプティングによってMeshサーフェスを構築する機能です。
zh_cn: ArrayMesh资源扩展了Mesh, 增加了一些不同的便捷功能, 最重要的是, 可以通过脚本构建Mesh曲面.

source: For more information about the ArrayMesh, please see the :ref:`ArrayMesh tutorial <doc_arraymesh>`.
es: Para más información sobre ArrayMesh, lee :ref:`ArrayMesh tutorial <doc_arraymesh>`.
ja: ArrayMeshの詳細については、\ :ref:`ArrayMesh tutoria <doc_arraymesh>` を参照してください。
zh_cn: 有关ArrayMesh的更多信息, 请参阅 :ref:`ArrayMesh tutorial <doc_arraymesh>`.

source: The MeshDataTool is a resource that converts Mesh data into arrays of vertices, faces, and edges that can be modified at runtime.
es: El MeshDataTool es un recurso que convierte los datos del Mesh en arrays de vértices, caras y bordes que pueden ser modificados en tiempo de ejecución.
ja: MeshDataToolは、メッシュデータを、実行時に変更できる頂点、面、およびエッジの配列に変換するリソースです。
zh_cn: MeshDataTool是一个将Mesh数据转换为顶点, 面和边的数组的资源, 可以在运行时进行修改.

source: For more information about the MeshDataTool, please see the :ref:`MeshDataTool tutorial <doc_meshdatatool>`.
es: Para más información sobre MeshDataTool, lee :ref:`MeshDataTool tutorial <doc_meshdatatool>`.
ja: MeshDataToolの詳細については、\ :ref:`MeshDataTool tutorial <doc_meshdatatool>` を参照してください。
zh_cn: 有关 MeshDataTool 的完整列表, 请参见 :ref:`MeshDataTool tutorial <doc_meshdatatool>`.

source: The SurfaceTool allows the creation of Meshes using an OpenGL 1.x immediate mode style interface.
ja: SurfaceToolでは、OpenGL 1.xイミディエイトモードスタイルのインターフェイスを使用してメッシュを作成できます。
zh_cn: SurfaceTool允许使用OpenGL 1.x即时模式风格的接口创建网格.

source: For more information about the SurfaceTool, please see the :ref:`SurfaceTool tutorial <doc_surfacetool>`.
es: Para más información sobre SurfaceTool, por favor lee el :ref:`SurfaceTool tutorial <doc_surfacetool>`.
ja: SurfaceToolの詳細については、\ :ref:`SurfaceTool tutorial <doc_surfacetool>` を参照してください。
zh_cn: 有关SurfaceTool的更多信息, 请阅读 :ref:`SurfaceTool tutorial <doc_surfacetool>`.

source: ImmediateGeometry is a node that uses an immediate mode style interface (like SurfaceTool) to draw objects. The difference between ImmediateGeometry and the SurfaceTool is that ImmediateGeometry is a node itself that can be added to the scene tree and is drawn directly from the code. The SurfaceTool generates a Mesh that needs to be added a MeshInstance to be seen.
ja: ImmediateGeometryは、イミディエイトモードスタイルのインターフェイス(SurfaceToolなど)を使用してオブジェクトを描画するノードです。 ImmediateGeometryとSurfaceToolの違いは、ImmediateGeometryはシーンツリーに追加できるノード自体であり、コードから直接描画されることです。 SurfaceToolは、表示するMeshInstanceに追加する必要があるメッシュを生成します。
zh_cn: ImmediateGeometry是一个使用即时模式风格接口(像SurfaceTool一样)绘制对象的节点.ImmediateGeometry和SurfaceTool的区别在于,ImperialGeometry本身是一个节点, 可以添加到场景树中, 直接从代码中绘制.SurfaceTool生成一个Mesh, 需要添加一个MeshInstance才能看到.

source: ImmediateGeometry is useful for prototyping because of the straightforward API, but it is slow because the geometry is rebuilt every frame. It is most useful for quickly adding simple geometry to debug visually (e.g. by drawing lines to visualize physics raycasts etc.).
ja: ImmediateGeometryは、簡単なAPIのためにプロトタイピングに役立ちますが、ジオメトリがフレームごとに再構築されるため、速度が遅くなります。単純なジオメトリをすばやく追加して視覚的にデバッグするのに最も役立ちます(たとえば、物理的なレイキャストなどを視覚化するために線を描画する)。
zh_cn: ImmediateGeometry因为其直接的API而对原型设计很有用, 但它的速度很慢, 因为每一帧都要重建几何体. 它最有用的是快速添加简单的几何体来进行可视化调试(例如, 通过画线来可视化物理学射线广播等).

source: For more information about ImmediateGeometry, please see the :ref:`ImmediateGeometry tutorial <doc_immediategeometry>`.
es: Para más información sobre ImmediateGeometry, por favor lee el :ref:`ImmediateGeometry tutorial <doc_immediategeometry>`.
ja: ImmediateGeometryの詳細については、\ :ref:`ImmediateGeometry tutorial <doc_immediategeometry>` を参照してください。
zh_cn: 有关 ImmediateGeometry 的更多信息, 请参见 :ref:`ImmediateGeometry tutorial <doc_immediategeometry>` .

source: Which one should I use?
es: ¿Cuál método debería usar?
ja: どちらを使うべきですか？
zh_cn: 我应该使用哪一个？

source: Which method you use depends on what you are trying to do and what kind of procedure you are comfortable with.
ja: どの方法を使用するかは、何をしようとしているか、どのような手順に慣れているかによって異なります。
zh_cn: 用哪种方法取决于你想做什么, 以及你能接受什么样的程序.

source: Both SurfaceTool and ArrayMesh are excellent for generating static geometry (meshes) that don't change over time.
es: Tanto SurfaceTool como ArrayMesh son excelentes para generar geometría estática (meshes) que no cambian con el tiempo.
ja: SurfaceToolとArrayMeshはどちらも、時間とともに変化しない静的なジオメトリ(メッシュ)の生成に最適です。
zh_cn: SurfaceTool和ArrayMesh都是生成不随时间变化的静态几何体(网格)的绝佳工具.

source: Using an ArrayMesh is slightly faster than using a SurfaceTool, but the API is more a little more challenging. Additionally, SurfaceTool has a few quality of life methods such as ``generate_normals()`` and ``index()``.
es: Usar un ArrayMesh es ligeramente más rápido que usar una SurfaceTool, pero la API es más desafiante. Además, SurfaceTool tiene algunos métodos de calidad de vida como ``generate_normals()`` e ``index()``.
ja: ArrayMeshの使用は、SurfaceToolの使用よりもわずかに高速ですが、APIはもう少し挑戦的です。さらに、SurfaceToolには ``generate_normals()`` や ``index()`` などの利便性向上メソッドがいくつかあります。
zh_cn: 使用ArrayMesh比使用SurfaceTool稍快一些, 但API的难度更大一些. 另外,SurfaceTool还有一些便捷的方法, 比如 ``generate_normals()`` 和 ``index()`` .

source: ImmediateGeometry regenerates the mesh every frame, so it is much slower than ArrayMesh or SurfaceTool. However, if you need the geometry to change every frame anyway it provides a much easier interface that may even be a little faster than generating an ArrayMesh every frame.
es: ImmediateGeometry regenera el mesh en cada cuadro, por lo que es mucho más lento que ArrayMesh o SurfaceTool. Sin embargo, si necesitas que la geometría cambie cada cuadro igualmente, proporciona una interfaz mucho más fácil que puede ser incluso un poco más rápida que la generación de un ArrayMesh en cada cuadro.
ja: ImmediateGeometryはフレームごとにメッシュを再生成するため、ArrayMeshやSurfaceToolよりもはるかに低速です。ただし、とにかくすべてのフレームを変更するためにジオメトリが必要な場合は、すべてのフレームでArrayMeshを生成するよりも少し速い可能性がある、はるかに簡単なインターフェイスを提供します。
zh_cn: ImmediateGeometry 每一帧都会重新生成网格, 所以它比 ArrayMesh 或 SurfaceTool 慢很多. 然而, 如果你需要每一帧都改变几何体, 它提供了一个更简单的接口, 甚至可能比每一帧生成一个ArrayMesh更快.

source: The MeshDataTool is not fast, but it gives you access to all kinds of properties of the mesh that you don't get with the others (edges, faces, etc.). It is incredibly useful when you need that sort of data to transform the mesh, but it is not a good idea to use if that information is not needed. The MeshDataTool is best used if you are going to be using an algorithm that requires access to the face or edge array.
es: El MeshDataTool no es rápido, pero te da acceso a todo tipo de propiedades del mesh que no consigues con los otros (bordes, caras, etc.). Es increíblemente útil cuando se necesita ese tipo de datos para transformar la malla, pero no es una buena idea utilizarlo si esa información no es necesaria. El MeshDataTool se utiliza mejor si se va a utilizar un algoritmo que requiere el acceso al array de caras o bordes.
ja: MeshDataToolは高速ではありませんが、他のものでは得られないメッシュのすべての種類のプロパティ(エッジ、面など)にアクセスできます。メッシュを変換するためにそのようなデータが必要な場合は非常に便利ですが、その情報が必要でない場合は使用するのは得策ではありません。 MeshDataToolは、面またはエッジ配列へのアクセスを必要とするアルゴリズムを使用する場合に最適に使用されます。
zh_cn: MeshDataTool的速度并不快, 但它可以让你访问网格的各种属性, 而这些属性是其他工具无法获得的(边, 面等). 当你需要这类数据来变换网格时, 它是非常有用的, 但如果不需要这些信息, 就不适合使用. 如果您要使用需要访问面或边缘数组的算法, 最好使用 MeshDataTool.

source: ImmediateGeometry
zh_cn: Immediate geometry (立即几何体)
