Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/content/procedural_geometry/meshdatatool.po
Languages: fr, ja, zh_cn

source: Using the MeshDataTool
fr: Utilisation du MeshDataTool
ja: MeshDataToolの使用
zh_cn: 使用MeshDataTool

source: The :ref:`MeshDataTool <class_meshdatatool>` is not used to generate geometry. But it is helpful for dynamically altering geometry, for example if you want to write a script to tessellate, simplify, or deform meshes.
zh_cn: :ref:`MeshDataTool <class_meshdatatool>` 不是用来生成几何体的, 但它对动态改变几何体很有帮助, 例如, 如果你想写一个脚本来分割, 简化或变形网格.

source: The MeshDataTool is not as fast as altering arrays directly using ArrayMesh. However, it provides more information and tools to work with meshes than the ArrayMesh does. When the MeshDataTool is used, it calculates mesh data that is not available in ArrayMeshes such as faces and edges, which are necessary for certain mesh algorithms. If you do not need this extra information then it may be better to use an ArrayMesh.
fr: MeshDataTool n'est pas aussi rapide que la modification d'arrays directement à l'aide d'ArrayMesh. Cependant, il fournit plus d'informations et d'outils pour travailler avec des maillages que ne le fait ArrayMesh. Lorsque le MeshDataTool est utilisé, il calcule les données de maillage qui ne sont pas disponibles dans ArrayMeshes telles que les faces et les arêtes, qui sont nécessaires pour certains algorithmes de maillage. Si vous n'avez pas besoin de ces informations supplémentaires, il peut être préférable d'utiliser un ArrayMesh.
ja: MeshDataToolは、ArrayMeshを使用して配列を直接変更するほど高速ではありません。ただし、ArrayMeshよりも多くの情報とメッシュを操作するツールを提供します。 MeshDataToolを使用すると、特定のメッシュアルゴリズムに必要なFace(面)やEdge(エッジ/辺)などのArrayMeshでは使用できないメッシュデータが計算されます。この追加情報が必要ない場合は、ArrayMeshを使用することをお勧めします。
zh_cn: MeshDataTool不像直接使用ArrayMesh改变数组那么快. 但是, 它提供了比ArrayMesh更多的信息和工具来处理网格. 当使用MeshDataTool时, 它会计算ArrayMeshes中没有的网格数据, 如面和边, 这些数据对于某些网格算法来说是必要的. 如果您不需要这些额外的信息, 那么使用 ArrayMesh 可能会更好.

source: MeshDataTool can only be used on Meshes that use the PrimitiveType ``Mesh.PRIMITIVE_TRIANGLES``.
fr: MeshDataTool ne peut être utilisé que sur les maillages qui utilisent le PrimitiveType ``Mesh.PRIMITIVE_TRIANGLES``.
ja: MeshDataToolは、PrimitiveType ``Mesh.PRIMITIVE_TRIANGLES`` を使用するメッシュでのみ使用できます。
zh_cn: MeshDataTool 只能用于使用基本类型 ``Mesh.PRIMITIVE_TRIANGLES`` 的网格.

source: As an example, let's walk through the process of deforming the mesh generated in the :ref:`ArrayMesh tutorial <doc_arraymesh>`.
fr: A titre d'exemple, nous allons parcourir le processus de déformation du maillage généré dans le tutoriel :ref:`ArrayMesh <doc_arraymesh>`.
ja: 例として、\ :ref:`ArrayMeshチュートリアル <doc_arraymesh>` で生成されたメッシュを変形するプロセスを見てみましょう。
zh_cn: 举个例子, 让我们来看看 :ref:`ArrayMesh 教程 <doc_arraymesh>` 中生成的网格的变形过程.

source: Assume the mesh is stored in an ArrayMesh named ``mesh``. We then initialize the MeshDataTool from ``mesh`` by calling ``create_from_surface()``. If there is already data initialized in the MeshDataTool calling ``create_from_surface()`` will clear it for you. Alternatively, you can call ``clear()`` yourself before re-using the MeshDataTool
fr: Supposons que le maillage soit stocké dans un ArrayMesh appelé ``mesh``. Nous initialisons alors le MeshDataTool à partir de ``mesh`` en appelant ``create_from_surface()``. S'il y a déjà des données initialisées dans le MeshDataTool, appeller ``create_from_surface()`` les effacera pour vous. Vous pouvez aussi appeler vous-même ``clear()`` avant de réutiliser le MeshDataTool
ja: メッシュが ``mesh`` という名前のArrayMeshに保存されていると仮定します。次に、\ ``create_from_surface()`` を呼び出して、\ ``mesh`` からMeshDataToolを初期化します。 MeshDataToolで初期化されたデータが既にある場合、\ ``create_from_surface()`` を呼び出すとデータがクリアされます。または、MeshDataToolを再利用する前に、自分で `` clear()`` を呼び出すことができます
zh_cn: 假设网格存储在一个名为 ``mesh`` 的ArrayMesh中. 然后我们通过调用 ``create_from_surface()`` 从 ``mesh`` 初始化MeshDataTool. 如果MeshDataTool中已经有初始化的数据, 调用 ``create_from_surface()`` 将会清除它, 另外, 也可以在重新使用MeshDataTool之前, 自己调用 ``clear()``

source: ``create_from_surface()`` uses the vertex arrays from the ArrayMesh to calculate two additional arrays, one for edges and one for faces.
fr: ``create_from_surface()`` utilise les arrays de sommets du ArrayMesh pour calculer deux tableaux supplémentaires, un pour les arêtes et un pour les faces.
ja: ``create_from_surface()`` は、ArrayMeshの頂点配列を使用して、エッジ用と面用の2つの追加配列を計算します。
zh_cn: ``create_from_surface()`` 使用ArrayMesh中的顶点数组来计算另外两个数组, 一个是边, 一个是面.

source: An edge is a connection between any two vertices. Each edge in the edge array contains a reference to the two vertices it is composed of, and up to two faces that it is contained within.
fr: Une arête est une connexion entre deux sommets. Chaque arête de l'array d'arêtes contient une référence aux deux sommets qui la composent et jusqu'à deux faces dans lesquelles elle est contenue.
ja: エッジは、任意の2つの頂点間の接続です。エッジ配列の各エッジには、それが構成する2つの頂点への参照と、それが含まれる最大2つの面が含まれます。
zh_cn: 边缘是任意两个顶点之间的连接. 边缘数组中的每一条边缘都包含了对它所组成的两个顶点的引用, 以及它所包含的最多的两个面.

source: A face is a triangle made up of three vertices and three corresponding edges. Each face in the face array contains a reference to the three triangles and three edges it is composed of.
fr: Une face est un triangle composé de trois sommets et de trois arêtes correspondantes. Chaque face de l'array de faces contient une référence aux trois triangles et aux trois arêtes qui la composent.
ja: 面は、3つの頂点と3つの対応するエッジで構成される三角形です。面配列の各面には、3つの三角形とそれが構成される3つのエッジへの参照が含まれています。
zh_cn: 面是由三个顶点和三条对应的边组成的三角形. 面数组中的每个面都包含了它所组成的三个三角形和三条边的参考.

source: The vertex array contains edges, faces, normals, color, tangent, uv, uv2, bones, and weight information connected with each vertex.
fr: L'array des vertex contient les arêtes, les faces, les normales, les couleurs, les tangentes, les uv, les uv2, les os et les informations de poids liées à chaque vertex.
ja: 頂点配列には、各頂点に接続されたエッジ、面、法線、色、接線、uv、uv2、ボーン、およびウェイト情報が含まれます。
zh_cn: 顶点数组包含与每个顶点相连的边, 面, 法线, 颜色, 切线, uv, uv2, 骨骼和权重信息.

source: To access information from these arrays you use a function of the form ``get_****()``:
fr: Pour accéder aux informations de ces tableaux, vous utilisez une fonction de la forme ``get_****()`` :
ja: これらの配列から情報にアクセスするには、\ ``get _****()`` 形式の関数を使用します:
zh_cn: 为了从这些数组中获取信息, 你可以使用 ``get_ **** ()`` 的函数:

source: What you choose to do with these functions is up to you. A common use case is to iterate over all vertices and transform them in some way:
fr: Ce que vous choisissez de faire avec ces fonctions dépend de vous. Un cas d'utilisation courant consiste à parcourir tous les sommets et à les transformer d'une manière ou d'une autre :
ja: これらの関数で何をするかはあなた次第です。一般的な使用例は、すべての頂点を反復処理し、何らかの方法で変換することです。
zh_cn: 你选择用这些函数做什么取决于你. 一个常见的用例是对所有顶点进行迭代, 并以某种方式对它们进行转换:

source: Finally, ``commit_to_surface()`` adds a new surface to the ArrayMesh. So if you are dynamically updating an existing ArrayMesh, first delete the existing surface before adding a new one.
fr: Enfin, ``commit_to_surface()`` ajoute une nouvelle surface à l'ArrayMesh. Donc si vous mettez à jour dynamiquement un ArrayMesh existant, supprimez d'abord la surface existante avant d'en ajouter une nouvelle.
ja: 最後に、\ ``commit_to_surface()`` はArrayMeshに新しいサーフェスを追加します。したがって、既存のArrayMeshを動的に更新する場合は、新しいサーフェスを追加する前に既存のサーフェスを削除してください。
zh_cn: 最后, ``commit_to_surface()`` 将一个新的曲面添加到ArrayMesh中. 因此, 如果你要动态更新一个现有的ArrayMesh, 首先要删除现有的曲面, 然后再添加一个新的曲面.

source: Below is a complete example that creates a pulsing blob complete with new normals and vertex colors.
fr: Vous trouverez ci-dessous un exemple complet qui crée un blob pulsé avec de nouvelles couleurs de normales et de sommets.
ja: 以下は、新しい法線と頂点の色で完全な脈動するブロブを作成する完全な例です。
zh_cn: 下面是一个完整的例子, 它可以创建一个具有新法线和顶点颜色的脉冲耀点.
