Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/first_look_at_the_editor.po
Languages: pt_br

source: First look at Godot's editor
pt_br: Primeiras impressões do editor da Godot

source: This page will give you a brief overview of Godot's interface. We're going to look at the different main screens and docks to help you situate yourself.
pt_br: Esta página irá dar-lhe uma breve visão geral da interface da Godot. Iremos olhar para as diferentes telas principais e painéis para ajudar você a se situar.

source: For a comprehensive breakdown of the editor's interface and how to use it, see the :ref:`Editor manual <toc-learn-editor>`.
pt_br: Para uma descrição mais detalhada da interface do editor e como utilizá-la, veja o :ref:`Manual do editor <toc-learn-editor>`.

source: The Project manager
pt_br: O Gestor do Projeto

source: When you launch Godot, the first window you see is the Project Manager. In the default tab, "Projects," you can manage existing projects, import or create new ones, and more.
pt_br: Quando você executa a Godot, a primeira janela que você vê é o Gestor de Projetos. Na aba padrão "Projetos Locais", você pode gerenciar projetos pré-existentes, importar ou criar novos projetos, e mais.

source: At the top of the window, there is another tab named "Asset Library Projects". In the open-source asset library you can search for demo projects, templates, and completed projects, including many that are developed by the community.
pt_br: No topo da janela, há outra aba com o nome "Projetos da Biblioteca de Recursos". Na biblioteca de recursos de código aberto, você pode procurar por projetos de demonstração, modelos, e projetos finalizados, incluindo muitos que foram feitos pela comunidade.

source: You can also change the editor's language using the drop-down menu to the right of the engine's version in the window's top-right corner. By default, it is in English (EN).
pt_br: Você pode também mudar o idioma do editor utilizando o menu suspenso à direita da versão do motor(engine), no canto superior direito da janela. Por padrão, está em English (EN).

source: When you open a new or an existing project, the editor's interface appears. Let's look at its main areas.
pt_br: Quando você abre um projeto novo ou já existente, a interface do editor aparece. Vamos olhar suas áreas principais.

source: By default, it features **menus**, **main screens**, and playtest buttons along the window's top edge.
pt_br: Por padrão, aparece **menus**, **telas principais**, e os botões de teste no canto superior da janela.

source: In the center is the **viewport** with its **toolbar** at the top, where you'll find tools to move, scale, or lock the scene's nodes.
pt_br: No centro está a **janela de visualização (viewport)** com sua **barra de ferramenta (toolbar)** no topo, onde você encontra as ferramentas para mover, redimensionar ou travar nós da sua cena.

source: On either side of the viewport sit the **docks**. And at the bottom of the window lies the **bottom panel**.
pt_br: Em ambos os lados da janela de exibição estão os **painéis**. E na parte inferior da janela encontra-se o **painel inferior**.

source: The toolbar changes based on the context and selected node. Here is the 2D toolbar.
pt_br: A barra de ferramentas muda baseado no contexto e no nó selecionado. Aqui está a barra de ferramentas 2D.

source: Below is the 3D one.
pt_br: Abaixo é sua versão 3D.

source: Let's look at the docks. The **FileSystem** dock lists your project files, be it scripts, images, audio samples, and more.
pt_br: Vamos dar uma olhada nos painéis. O painel **Sistema de arquivos** lista seus arquivos de projeto, sejam eles códigos, imagens, áudios, entre outros.

source: The **Scene** dock lists the active scene's nodes.
pt_br: O painel **Cena** lista os nós da cena ativa.

source: The **Inspector** allows you to edit the properties of a selected node.
pt_br: O **Inspetor** te permite editar as propriedades de um nó selecionado.

source: The **bottom panel**, situated below the viewport, is the host for the debug console, the animation editor, the audio mixer, and more. They can take precious space, that's why they're folded by default.
pt_br: O **Painel Inferior**, embaixo do viewport, é onde fica o console de depuração, o editor de animação e o mixer de áudio. Eles são largos e podem ocupar bastante espaço, por isso eles ficam minimizados por padrão.

source: When you click on one, it expands vertically. Below, you can see the animation editor opened.
pt_br: Quando você clica em um deles, ele expande verticalmente. Abaixo você pode ver o editor de animações aberto.

source: The four main screens
pt_br: As quatro cenas principais

source: There are four main screen buttons centered at the top of the editor: 2D, 3D, Script, and AssetLib.
pt_br: Há quatro botões da tela principal centralizado no topo do editor: 2D, 3D, Script e AssetLib.

source: You'll use the **2D screen** for all types of games. In addition to 2D games, the 2D screen is where you'll build your interfaces.
pt_br: Você usará a **tela 2D** para todos os tipos de jogos. Além dos jogos 2D são desenvolvidos, a tela 2D é onde você criará suas interfaces.

source: In the **3D screen**, you can work with meshes, lights, and design levels for 3D games.
pt_br: Na **tela 3D**, você pode trabalhar com malhas (*meshes*), luzes e a criação de leveis para jogos 3D.

source: Notice the perspective button under the toolbar. Clicking on it opens a list of options related to the 3D view.
pt_br: Repare no botão ``Perspectiva`` abaixo da barra de ferramentas (toolbar), ele abre uma lista de opções relacionadas à vista 3D.

source: Read :ref:`doc_introduction_to_3d` for more detail about the **3D main screen**.
pt_br: Leia :ref:`doc_introduction_to_3d` para saber mais sobre a **tela principal 3D**.

source: The **Script screen** is a complete code editor with a debugger, rich auto-completion, and built-in code reference.
pt_br: A **tela Script** é um editor de código completo com um depurador, preenchimento automático avançado e referência de código integrada.

source: Finally, the **AssetLib** is a library of free and open-source add-ons, scripts, and assets to use in your projects.
pt_br: Finalmente, o **AssetLib** é uma biblioteca de add-ons, scripts e assets gratuitos e de código aberto para usar nos seus projetos.

source: You can learn more about the asset library in :ref:`doc_what_is_assetlib`.
pt_br: Você pode aprender mais sobre a biblioteca de assets em :ref:`doc_what_is_assetlib`.

source: Integrated class reference
pt_br: Referência de classe integrada

source: Godot comes with a built-in class reference.
pt_br: Godot vem com um referência de classe embutida.

source: You can search for information about a class, method, property, constant, or signal by any one of the following methods:
pt_br: Você pode procurar informações sobre uma classe, método, propriedade, ou sinal usando qualquer um dos métodos seguintes:

source: Pressing :kbd:`F1` (or :kbd:`Alt + Space` on macOS) anywhere in the editor.
pt_br: Pressionando :kbd:`F1` (ou :kbd:`Alt + Space` no macOS) em qualquer lugar no editor.

source: Clicking the "Search Help" button in the top-right of the Script main screen.
pt_br: Clicando no botão "Pesquisar Ajuda" no canto superior direito da tela principal do Script.

source: Clicking on the Help menu and Search Help.
pt_br: Clicando no menu de Ajuda e Procurar Ajuda.

source: Clicking while pressing the :kbd:`Ctrl` key on a class name, function name, or built-in variable in the script editor.
pt_br: Clicar enquanto pressiona a tecla :kbd:`Ctrl` no nome da classe, nome da função ou variável built-in no editor de script.

source: When you do any of these, a window pops up. Type to search for any item. You can also use it to browse available objects and methods.
pt_br: Quando você faz qualquer um desses, uma janela aparece. Digite para pesquisar qualquer item. Você também pode usá-lo para procurar objetos e métodos disponíveis.

source: Double-click on an item to open the corresponding page in the script main screen.
pt_br: Clique duplo em um item para abrir o script correspondente na tela principal.

source: Translation status
pt_br: Estado da Tradução
