Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/godot_design_philosophy.po
Languages: uk

source: Godot's design philosophy
uk: Філософія архітектури Godot

source: **Every game engine is different and fits different needs.** Not only do they offer a range of features, but the design of each engine is unique. This leads to different workflows and different ways to form your games' structures. This all stems from their respective design philosophies.
uk: **Кожен ігровий рушій різний і відповідає різним потребам.** Вони не тільки пропонують цілий ряд функцій, але й архітектура кожного рушія унікальна. Це призводить до різних робочих процесів та різних способів формування структур ваших ігор. Все це випливає з їхніх конкретних особливостей.

source: This page is here to help you understand how Godot works, starting with some of its core pillars. It is not a list of available features, nor is it an engine comparison. To know if any engine can be a good fit for your project, you need to try it out for yourself and understand its design and limitations.
uk: Ця сторінка тут для того, щоб допомогти вам зрозуміти як Godot працює, починаючи з самих основ. Це не список доступних можливостей, також це не порівняння різних двигунів. Щоб зрозуміти, чи добре підходить якийсь движок в проєкт, його необхідно спробувати і зрозуміти його архітектуру і обмеження.

source: Object-oriented design and composition
uk: Об'єктно-орієнтована дизайн і композиція

source: Godot embraces object-oriented design at its core with its flexible scene system and Node hierarchy. It tries to stay away from strict programming patterns to offer an intuitive way to structure your game.
uk: Godot включає в себе об'єктно-орієнтована дизайн з його гнучкою системою сцен і ієрархією вузлів. Він намагається триматися подалі від суворих шаблонів програмування, щоб запропонувати інтуїтивний спосіб структурування вашої гри.

source: For one, Godot lets you **compose or aggregate** scenes. It's like nested prefabs: you can create a BlinkingLight scene and a BrokenLantern scene that uses the BlinkingLight. Then, create a city filled with BrokenLanterns. Change the BlinkingLight's color, save, and all the BrokenLanterns in the city will update instantly.
uk: По-перше, Godot дозволяє вам складати (або збирати) сцени. Це як вкладені префаб: ви можете створити мерехтливе світло і сцену зі зламаним ліхтарем, який використовує мерехтливе світло. Потім створити місто наповнений такими ліхтарями. Потім поміняти колір мерехтіння, зберегти об'єкт, і всі ліхтарі тут же оновляться.

source: On top of that, you can **inherit** from any scene.
uk: Більш того, ви можете ** успадковувати ** від цієї сцени.

source: A Godot scene could be a Weapon, a Character, an Item, a Door, a Level, part of a level… anything you'd like. It works like a class in pure code, except you're free to design it by using the editor, using only the code, or mixing and matching the two.
uk: Сцена Godot може бути зброєю, персонажем, предметом, дверима, рівнем, частиною рівня... всім, чим завгодно. Вона працює як клас у чистому коді, за винятком того, що ви вільні спроєктувати її лише за допомогою редактора, лише використовуючи код, або змішуючи та поєднуючи обидва способи.

source: It's different from prefabs you find in several 3D engines, as you can then inherit from and extend those scenes. You may create a Magician that extends your Character. Modify the Character in the editor and the Magician will update as well. It helps you build your projects so that their structure matches the game's design.
uk: Це відрізняється від збірних даних (префабів), які ви знайдете в деяких тривимірних редакторах, тому що ви можете успадкувати та розширити ці сцени. Ви можете створити сцену Маг, яка буде успадкована та розширена з вашої сцени Персонаж. Змініть Персонаж у редакторі, і Маг також оновиться. Це допомагає вам будувати свої проєкти так, щоб їх структура відповідала архітектурі гри.

source: All-inclusive package
uk: Комплексний

source: Godot tries to provide its own tools to answer most common needs. It has a dedicated scripting workspace, an animation editor, a tilemap editor, a shader editor, a debugger, a profiler, the ability to hot-reload locally and on remote devices, etc.
uk: Godot надає свої власні інструменти для задоволення найбільш поширених потреб. Він має вбудований редактор коду, редактор анімації, редактор tilemap, редактор шейдеров, відладчик, профілювальник, можливість перезавантаження на ходу локально і на віддалених пристроях і багато іншого.

source: The goal is to offer a full package to create games and a continuous user experience. You can still work with external programs as long as there is an import plugin for it. Or you can create one, like the `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
uk: Мета полягає в тому, щоб запропонувати повний пакет для створення ігор і безперервного навчання. Ви можете працювати з зовнішніми програмами, якщо для них є плагін імпорту. Або ви можете створити його, наприклад, `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`.

source: Note that with GDNative, you can write high-performance code using compiled languages like C, C++, Rust, or Python (using the Cython compiler) without recompiling the engine.
uk: Зауважте, що за допомогою GDNative ви можете писати високоефективний код, використовуючи компільовані мови, такі як C, C++, Rust, або Python (використовуючи компілятор Cython), без перекомпіляції рушія.

source: *VisualScript is a node-based programming language that integrates well in the editor. You can drag and drop nodes or resources into the graph to create new code blocks.*
uk: *VisualScript - мова програмування на основі вузлів, яка добре інтегрується в редактор. Ви можете перетягувати вузли, або ресурси, в графік для створення нових блоків коду.*

source: Note that the 3D workspace doesn't feature as many tools as the 2D workspace. You'll need external programs or add-ons to edit terrains, animate complex characters, and so on. Godot provides a complete API to extend the editor's functionality using game code. See `The Godot editor is a Godot game`_ below.
uk: Зауважте, що в робочій області 3D немає такої кількості інструментів, як у робочій області 2D. Вам знадобляться зовнішні програми, або додатки, для редагування місцевості, анімації складних персонажів тощо. Godot пропонує повний API для розширення функціональності редактора за допомогою ігрового коду. Дивіться `The Godot editor is a Godot game`_ нижче.

source: *A State Machine editor plugin in Godot 2 by kubecz3k. It lets you manage states and transitions visually.*
uk: *Плагін редактора State Machine (Машина станів) у Godot 2 від kubecz3k. Він дозволяє візуально керувати станами та переходами.*

source: Open source
uk: Відкритий код

source: Godot offers a fully open source codebase under the **MIT license**. This means all the technologies that ship with it have to be Free (as in freedom) as well. For the most part, they're developed from the ground up by contributors.
uk: Godot пропонує повністю відкриту кодову базу даних під **ліцензією MIT**. Це означає, що всі технології, що постачаються разом із нею, повинні бути безкоштовними (як і вільними). Здебільшого вони розробляються з нуля вкладниками.

source: Anyone can plug in proprietary tools for the needs of their projects — they just won't ship with the engine. This may include Google AdMob, or FMOD. Any of these can come as third-party plugins instead.
uk: Будь-хто може підключити власні інструменти для потреб своїх проєктів - вони просто не постачаються з рушієм. Це може бути Google AdMob, або FMOD. Будь-який із них може натомість може стати стороннім плагіном.

source: On the other hand, an open codebase means you can **learn from and extend the engine** to your heart's content. You can also debug games easily, as Godot will print errors with a stack trace, even if they come from the engine itself.
uk: З іншого боку, відкрита база коду означає, що ви можете **вивчити і розширити редактор** як забажаєте. Ви також можете легко налагоджувати ігри, оскільки Godot друкує помилки із stack trace, навіть якщо вони надходять із самого движка.

source: This **does not affect the work you do with Godot** in any way: there's no strings attached to the engine or anything you make with it.
uk: Це **ніяк не впливає на роботу, яку ви робите з Godot** : ніякі рядки додані до редактора, і ніяка робота з ним.

source: Community-driven
uk: Ініціативна спільнота

source: **Godot is made by its community, for the community, and for all game creators out there.** It's the needs of the users and open discussions that drive the core updates. New features from the core developers often focus on what will benefit the most users first.
uk: **Godot створений його спільнотою, для спільноти та для всіх творців ігор.** Саме основні потреби користувачів та відкриті дискусії визначають основні оновлення. Нові функції основних розробників часто зосереджуються на тому, що в першу чергу принесе користь користувачам.

source: That said, although a handful of core developers work on it full-time, the project has over 600 contributors at the time of writing. Benevolent programmers work on features they may need themselves, so you'll see improvements in all corners of the engine at the same time in every major release.
uk: Хоча повний робочий день над ним працюють лише декілька основних розробників, проєкт нараховує понад 600 учасників. Доброзичливі програмісти працюють над можливостями, які можуть знадобитися їм самим, тож ви побачите вдосконалення в усіх куточках движка одночасно у кожному великому випуску.

source: The Godot editor is a Godot game
uk: Редактор Godot - це гра Godot

source: The Godot editor runs on the game engine. It uses the engine's own UI system, it can hot-reload code and scenes when you test your projects, or run game code in the editor. This means you can **use the same code** and scenes for your games, or **build plugins and extend the editor.**
uk: Редактор Godot працює на ігровому движку. Він використовує власну систему інтерфейсу движка, може перезавантажувати код і сцени під час тестування проєктів, або запускати ігровий код у редакторі. Це означає, що ви можете використовувати **той самий код** і сцени для своїх ігор, або **створювати плагіни та розширювати редактор.**

source: This leads to a reliable and flexible UI system, as it powers the editor itself. With the ``tool`` keyword, you can run any game code in the editor.
uk: Це призводить до надійної та гнучкої системи користувацького інтерфейсу, оскільки вона приводить в дію сам редактор. За допомогою ключового слова ``tool`` ви можете запустити будь-який ігровий код у редакторі.

source: *RPG in a Box is a voxel RPG editor made with Godot 2. It uses Godot's UI tools for its node-based programming system and for the rest of the interface.*
uk: *RPG in Box - це редактор вокселів RPG , створений з Godot 2. Він використовує інструменти інтерфейсу Godot для своєї програми програмування на основі вузлів та для решти інтерфейсу.*

source: Put the ``tool`` keyword at the top of any GDScript file and it will run in the editor. This lets you import and export plugins, create plugins like custom level editors, or create scripts with the same nodes and API you use in your projects.
uk: Помістіть ключове слово ``tool`` на початку будь-якого файлу GDScript, і він запуститься в редакторі. Це дозволяє імпортувати та експортувати плагіни, створювати плагіни, такі як редактори власного рівня, або створювати скрипти з тими ж вузлами та API, які ви використовуєте у своїх проєктах.

source: Separate 2D and 3D engines
uk: Окремі 2D та 3D движки

source: Godot offers dedicated 2D and 3D rendering engines. As a result, **the base unit for 2D scenes is pixels.** Even though the engines are separate, you can render 2D in 3D, 3D in 2D, and overlay 2D sprites and interfaces over your 3D world.
uk: Godot пропонує спеціалізовані движки 2D та 3D візуалізації. В результаті **базовою одиницею для 2D сцен є пікселі**. Незважаючи на те, що движки є окремими, ви можете візуалізувати 2D в 3D, 3D в 2D і накладати 2D спрайти та інтерфейси поверх вашого 3D-світу.
