Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/introduction_to_godot.po
Languages: pt_br, ru

source: Introduction to Godot
pt_br: Introdução ao editor do Godot
ru: Введение в Godot

source: This article is here to help you figure out whether Godot might be a good fit for you. We will introduce some broad features of the engine to give you a feel for what you can achieve with it and answer questions such as "what do I need to know to get started?".
pt_br: Este artigo está aqui para te ajudar a decidir se o Godot é uma boa opção para você. Iremos te introduzir a alguma funcionalidades gerias do moto para dar-lhe um sentimento de o quê você consegue alcançar com ele e responder perguntas como "o que preciso saber para começar?".
ru: Эта статья поможет понять, насколько хорошо Godot вам подходит. Мы ознакомим вас с некоторыми основными возможностями движка, чтобы дать понять, чего с его помощью можно достигнуть и ответить на вопрос «что мне нужно знать для начала?».

source: This is by no means an exhaustive overview. We will introduce many more features in this getting started series.
pt_br: Isso não é de maneira alguma uma apresentação extensiva. Introduziremos muitas mais funcionalidades na séries de introdução.
ru: Это ни в коем случае не исчерпывающий обзор. Мы познакомимся со множеством других возможностей в этом цикле.

source: What is Godot?
pt_br: O que é Godot?
ru: Что такое Godot?

source: Godot is a general-purpose 2D and 3D game engine designed to support all sorts of projects. You can use it to create games or applications you can then release on desktop or mobile, as well as on the web.
pt_br: Godot é um motor de jogos 2D e 3D de uso geral projetado para dar suporte a qualquer tipo de projeto. Você pode usá-lo para criar jogos ou aplicativos que podem ser lançados em computadores, celulares e também na internet.
ru: Godot — это универсальный 2D и 3D игровой движок, спроектированный для поддержки всех видов проектов. Вы можете использовать его для создания игр или приложений, которые можете затем выпускать на настольных или мобильных платформах, а также web.

source: You can also create console games with it, although you either need strong programming skills or a developer to port the game for you.
pt_br: Você também pode criar jogos de console ele, mesmo que você precise de fortes habilidades de programação ou de um desenvolvedor para portar o jogo para você.
ru: Вы также можете создавать игры для приставок, хотя это требует высокого навыка программирования или разработчика, который портирует игру за вас.

source: The Godot team can't provide an open-source console export due to the licensing terms imposed by console manufacturers. Regardless of the engine you use, though, releasing games on consoles is always a lot of work. You can read more on that here: :ref:`doc_consoles`.
pt_br: A equipe da Godot não pode prover uma exportação open-source para consoles por conta de termos de licenciamento impostos pelas fabricantes de consoles. Independente da engine que utilizar, lançar jogos para consoles é sempre um trabalho e tanto. Você pode ler mais sobre isso aqui: :ref:`doc_consoles` .
ru: Команда Godot не может обеспечить реализацию экспорта с открытым исходным кодом из-за условий лицензирования, установленных производителями консолей. Независимо от используемого движка, выпуск игр на консоли — это всегда множество работы. Вы можете узнать больше здесь: :ref:`doc_consoles`.

source: What can the engine do?
pt_br: O que a Engine é capaz de fazer?
ru: Что может движок?

source: Godot was initially developed in-house by an Argentinan game studio. Its development started in 2001, and the engine was rewritten and improved tremendously since its open-source release in 2014.
pt_br: Godot foi inicialmente desenvolvido caseiramente por um estúdio argentino. Seu desenvolvimento começou em 2001, e o motor foi reescrito e melhorado tremendamente desde a abertura de seu código, lançado em 2014.
ru: Godot изначально был разработан собственными силами Аргентинской игровой студии. Его разработка была начата в 2001, а после открытия исходного кода в 2014 движок был переписан и значительно улучшен.

source: Some examples of games created with Godot include Ex-Zodiac and Helms of Fury.
pt_br: Alguns exemplos de jogos criados com a Godot incluem Ex-Zodiac e Helms of Fury.

source: As for applications, the open-source pixel art drawing program Pixelorama is powered by Godot, and so is the voxel RPG creator RPG in a box.
pt_br: Quanto a aplicativos, o programa voltado para desenho de pixel art Pixelorama é desenvolvido no Godot, assim como o criador de RPG em voxel RPG in a box.
ru: Что до приложений, открытая программа для пиксель-арта Pixelorama и RPG in a box — конструктор воксельных RPG — сделаны на Godot.

source: You can find many more examples in the official showcase videos:
pt_br: Você pode encontrar muitos outros exemplos nos videos oficiais de demonstração:
ru: Вы можете найти намного больше примеров в официальных обзорных видео:

source: `April 2020 desktop and console showcase`_
pt_br: `Demonstração de desktop e console de Abril de 2020`_
ru: `Демонстрация ноутбуков и консолей в апреле 2020 года`_

source: `April 2020 mobile showcase`_
pt_br: `Demonstração para dispositivos móveis de abril de 2020`_

source: How does it work and look?
pt_br: Como funciona e como é?
ru: Как это работает и выглядит?

source: Godot comes with a fully-fledged game editor with integrated tools to answer the most common needs. It includes a code editor, an animation editor, a tilemap editor, a shader editor, a debugger, a profiler, and more.
pt_br: O Godot vem com um editor de jogos completo com ferramentas integradas para atender às necessidades mais comuns. Tem um editor de códigos dedicado, um editor de animação, um editor de mapas 2D, um editor de shaders, um depurador, um profiler e mais.

source: The team strives to offer a feature-rich game editor with a consistent user experience. While there is always room for improvement, the user interface keeps getting refined.
pt_br: A equipe se esforça em oferecer um editor de jogos rico e com um experiência de usuário consistente. Sempre há espaço para melhorias, a exemplo, a interface de usuário, que continua recebendo refinamento
ru: Команда стремится предложить многофункциональный редактор игр с единообразным пользовательским интерфейсом. Хотя всегда есть пространство для улучшений и пользовательский интерфейс постоянно совершенствуется.

source: Of course, if you prefer, you can work with external programs. We officially support importing 3D scenes designed in Blender_ and maintain plugins to code in VSCode_ and Emacs_ for GDScript and C#. We also support Visual Studio for C# on Windows.
pt_br: Se você preferir, é claro, pode usar programas externos. Oficialmente damos suporte à importação de cenas feitas no Blender_ e mantemos plugins para programar no VSCode_ e Emacs_ para GDScript e C#. Também damos suporte ao Visual Studio para C# no Windows.

source: Programming languages
pt_br: Linguagens de programação
ru: Языки программирования

source: Let's talk about the available programming languages.
pt_br: Vamos falar sobre as linguagens de programação disponíveis.
ru: Давайте поговорим о поддерживаемых языках программирования.

source: You can code your games using :ref:`GDScript <toc-learn-scripting-gdscript>`, a Godot-specific and tightly integrated language with a lightweight syntax, or :ref:`C# <toc-learn-scripting-C#>`, which is popular in the games industry. These are the two main scripting languages we support.
pt_br: Você pode programar seu jogo usando :ref:`GDScript <toc-learn-scripting-gdscript>`, uma linguagem específica do Godot e diretamente integrada com uma sintaxe simples, ou :ref:`C# <toc-learn-scripting-C#>`, que é popular na indústria de jogos. Essas são as duas principais linguagens de scripts suportadas.
ru: Ты можешь программировать свои игры используя :ref:`GDScript <toc-learn-scripting-gdscript>`, специально созданный и втроенный в Godot язык с легким синтаксисом, или :ref:`C# <toc-learn-scripting-C#>`, который популярен в игровой индустрии. Это два основных поддерживаемых языка написания скриптов.

source: Godot also supports a node-based visual programming language named :ref:`VisualScript <toc-learn-scripting-visual_script>`.
pt_br: Godot também suporta uma linguagem de programação visual baseada em nós :ref:`VisualScript: <toc-learn-scripting-visual_script>`.
ru: Так же Godot поддерживает визуальный язык программирования основанный на узлах, который называется :ref:`VisualScript: <toc-learn-scripting-visual_script>`.

source: With the :ref:`GDNative <toc-tutorials-gdnative>` technology, you can also write gameplay or high-performance algorithms in C or C++ without recompiling the engine. You can use this technology to integrate third-party libraries and other Software Development Kits (SDK) in the engine.
pt_br: Com a tecnologia :ref:`GDNative <toc-tutorials-gdnative>`, você também pode escrever lógica de jogabilidade ou algoritmos de alto desempenho em C ou C++ sem recompilar o motor. Você pode utilizar esta tecnologia para integrar bibliotecas de terceiros e outros kits de desenvolvimento de software (SDK) no motor.
ru: Посредством технологии :ref:`GDNative <toc-tutorials-gdnative>`, вы также можете описывать геймплей или высокопроизводительные алгоритмы на C и C++ без рекомпиляции игрового движка. Вы можете использовать эту технологию для интеграции в движок сторонних библиотек или Software Development Kits (SDK).

source: Of course, you can also directly add modules and features to the engine, as it's completely free and open-source.
pt_br: Naturalmente, você também pode adicionar diretamente módulos e recursos ao motor, já que ele é completamente gratuito e de código aberto.
ru: И конечно вы можете добавлять в движок собственные модули и функции, так как он полностью свободный и имеет открытый исходный код.

source: These are the five officially supported programming languages. The community maintains support for many more. For more information, see :ref:`GDNative third-party bindings <doc_what_is_gdnative_third_party_bindings>`.
pt_br: Estas são as cinco linguagens de programação oficialmente suportadas. A comunidade mantém suporte para muitas outras. Para mais informações, veja :ref:`GDDNative third-party bindings <doc_what_is_gdnative_third_party_bindings>`.
ru: Есть пять официально поддерживаемых языков программирования. Сообщество предоставляет поддержку для большего их числа. Для подробностей смотрите :ref:`GDNative third-party bindings <doc_what_is_gdnative_third_party_bindings>`.

source: What do I need to know to use Godot?
pt_br: O que eu preciso saber para usar Godot?
ru: Что мне нужно знать для того, чтобы использовать Godot?

source: Godot is a feature-packed game engine. With its thousands of features, there is a lot to learn. To make the most of it, you need good programming foundations. While we try to make the engine accessible, you will benefit a lot from knowing how to think like a programmer first.
pt_br: Godot é um motor de jogo repleto de recursos. Com suas milhares de funcionalidades, há muito o que aprender. Para aproveitá-lo ao máximo, você precisa de uma boa base de programação. Enquanto nós tentamos tornar o motor acessível, você se beneficiará muito se primeiro souber pensar como um programador.
ru: Godot это полнофункциональный игровой движок. С тысячами функций, потребующий времени на изучение. Для того, что бы использовать его по максимуму тебе потребуются хорошие основы программирования. Хотя мы стараемся сделать движок доступным, вам будет полезно знать, как мыслить как программист.

source: Godot relies on the object-oriented programming paradigm. Being comfortable with concepts such as classes and objects will help you code efficiently in it.
pt_br: Godot confia no paradigma da programação orientada a objetos. Estar confortável com conceitos como classes e objetos o ajudará a programar de forma eficiente.
ru: Godot полагается на парадигму объектно-ориентированного программирования. Понимание таких концепций, как классы и объекты, поможет более эффективному программированию.

source: If you are entirely new to programming, we recommend following the `CS50 open courseware`_ from Harvard University. It's a great free course that will teach you everything you need to know to be off to a good start. It will save you countless hours and hurdles learning any game engine afterward.
pt_br: Se você é totalmente novo na programação, recomendamos fazer o curso `CS50` da Universidade de Harvard. É um ótimo curso gratuito que ensinará tudo o que você precisa saber para começar bem. Isso economizará incontáveis horas e dificuldades para aprender qualquer engine de jogos depois.
ru: Если вы абсолютный новичок в программировании, мы рекомендуем прослушать `CS50 open courseware`_ от Гарвардского университета. Это отличный бесплатный курс, который научит вас всему, что необходимо знать для хорошего старта. Он сохранит вам многие часы и избавит от трудностей в изучении любого игрового движка.

source: In CS50, you will learn multiple programming languages. Don't be afraid of that: programming languages have many similarities. The skills you learn with one language transfer well to others.
pt_br: No CS50, você aprenderá várias linguagens de programação. Não tenha medo disso: as linguagens de programação têm muitas semelhanças. As habilidades que você aprende com um idioma se transferem bem para outros.
ru: В CS50 вы будете изучать несколько языков программирования. Не стоит пугаться: языки программирования во многом похожи. Навыки, полученные на одном языке, хорошо переносятся на другие.

source: We will provide you with more Godot-specific learning resources in :ref:`doc_learning_new_features`.
pt_br: Forneceremos mais recursos de aprendizado específicos da Godot em :ref:`doc_learning_new_features`.
ru: Мы предоставим вам больше ориентированных на Godot учебных ресурсов в :ref:`doc_learning_new_features`.

source: In the next part, you will get an overview of the engine's essential concepts.
pt_br: Na próxima parte, você terá uma visão geral dos conceitos essenciais da engine.
ru: В следующей части вы ознакомитесь с основными концепциями движка.

source: Translation status
pt_br: Estado de tradução
ru: Translation status (статус перевода)
