Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/animations.po
Languages: cs, de, es, fr, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Animations
cs: Animace
de: Animationen
es: Animaciones
ja: アニメーション
ko: 애니메이션(Animations)
pl: Animacje
pt_br: Animações
ru: Анимации
uk: Анімації
zh_cn: 动画
zh_tw: 動畫

source: Introduction
cs: Úvod
de: Einführung
es: Introducción
ja: はじめに
ko: 소개
pl: Wprowadzenie
pt_br: Introdução
ru: Введение
uk: Вступ
zh_cn: 前言
zh_tw: 簡介

source: Godot's animation system is extremely powerful and flexible.
cs: Animační systém Godot je mimořádně výkonný a flexibilní.
de: Das Animationssystem von Godot ist extrem leistungsstark und flexibel.
es: El sistema de animación de Godot es extremadamente poderoso y flexible.
fr: Le système d'animation de Godot est extrêmement puissant et flexible.
ja: Godotのアニメーションシステムは非常に強力で柔軟です。
ko: Godot의 애니메이션 시스템은 매우 강력하고 유연합니다.
pl: System animacji Godota jest niezwykle potężny i elastyczny.
pt_br: O sistema de animação da Godot é extremamente poderoso e flexível.
ru: Анимационная система Godot чрезвычайно мощная и гибкая.
uk: Анімаційна система Godot надзвичайно потужна та гнучка.
zh_cn: Godot的动画系统非常强大和灵活.
zh_tw: Godot 的動畫系統極為強大且靈活。

source: To begin, let's use the scene from the previous tutorial (:ref:`doc_splash_screen`). The goal is to add a "fade-in" animation to the splash image. Here's a copy just in case: :download:`robisplash.zip <files/robisplash.zip>`.
cs: Začněme scénou z předchozího tutoriálu (:ref:`doc_splash_screen`). Cílem je přidat do úvodního obrázku animaci "fade-in". Zde je pro jistotu kopie: :download:`robisplash.zip <files/robisplash.zip>`.
de: Beginnen wir mit der Szene aus dem vorherigen Tutorial (:ref:`doc_splash_screen`). Das Ziel besteht darin, dem Begrüßungsbild eine "Einblend"-Animation hinzuzufügen. Hier ist eine Kopie für alle Fälle: :download:`robisplash.zip <files/robisplash.zip>`.
es: Para empezar, usemos la escena del tutorial anterior (:ref:`doc_splash_screen`). El objetivo es añadir una animación "fade-in" a la imagen de inicio. Aquí hay una copia por si acaso: :download:`robisplash.zip <files/robisplash.zip>`.
fr: Pour commencer , utilisez la scène du tutoriel précédent (:ref:`doc_splash_screen`). L'objectif est d'ajouter une animation de fondu-enchaîné à l'image d'accueil . Voici une copie juste au cas où : :download:`robisplash.zip <files/robisplash.zip>`.
ja: 初めに、前のチュートリアル (:ref:`doc_splash_screen`) のシーンを使用しましょう。 目標は、スプラッシュ画像に「フェードイン」アニメーションを追加することです。 念のためコピーを次に示します: :download:`robisplash.zip <files/robisplash.zip>`\ 。
ko: 시작하기 위해서 지난 튜토리얼의 씬(:ref:`doc_splash_screen`)을 사용하겠습니다. 목표는 "점진적으로 선명해지는(fade-in)" 애니메이션을 스플래시 이미지에 적용하는 것입니다. 다음은 만일의 경우에 대비한 복사본입니다: :download:`robisplash.zip <files/robisplash.zip>`.
pl: Na początek użyjmy sceny z poprzedniego poradnika (:ref:`doc_splash_screen`). Celem jest dodanie do ekranu startowego, animacji "zanikającej". Oto kopia na wszelki wypadek: :download:`robisplash.zip <files/robisplash.zip>`.
pt_br: Para começar, vamos usar a cena do tutorial anterior (: ref: `doc_splash_screen`). O objetivo é adicionar uma animação "fade-in" à imagem inicial. Aqui está uma cópia para o caso: :download:`robisplash.zip <files/robisplash.zip>`.
ru: Для начала воспользуемся сценой из предыдущего урока (:ref:`doc_splash_screen`). Цель заключается в добавлении "появляющейся" анимации к заставке. Вот копия на всякий случай: :download:`robisplash.zip <files/robisplash.zip>`.
uk: Для початку скористаємося сценою з попереднього уроку (:ref:`doc_splash_screen`). Задача полягає в тому, щоб до зображення привітання додати анімацію "зникнення". Ось копія, про всяк випадок::download:`robisplash.zip <files/robisplash.zip>`.
zh_cn: 首先, 让我们使用前面教程中的场景( :ref:`doc_splash_screen` ). 目标是添加一个 ``淡入`` 动画到起始图像. 为了防万一, 这里是一个副本: :download:`robisplash.zip <files/robisplash.zip>`.
zh_tw: 首先我們要使用前一個教學（ :ref:`doc_splash_screen` ）的場景。這篇教學的目的是要給啟動畫面加上「淡入」動畫效果。以防萬一，這裡也有一份檔案： :download:`robisplash.zip <files/robisplash.zip>` 。

source: Add an animation player
cs: Přidání přehrávače animací
de: Hinzufügen eines Animationsplayers
es: Agregar un reproductor de animaciones
fr: Ajouter un lecteur d'animation
ja: アニメーションプレイヤーを追加する
ko: 애니메이션 플레이어 추가하기
pl: Dodaj animację gracza
pt_br: Adicionar um player de animação
ru: Добавление анимации персонажу
uk: Додавання анімації до гравця
zh_cn: 添加一个动画播放器
zh_tw: 新增一個動畫播放器

source: First of all, add an :ref:`AnimationPlayer <class_AnimationPlayer>` node to the scene as a child of "background" (the root node):
cs: Nejprve přidejte do scény uzel :ref:`AnimationPlayer <class_AnimationPlayer>` jako potomka uzlu ``background`` (kořenový uzel):
de: Füge der Szene zunächst einen :ref:`AnimationPlayer <class_AnimationPlayer>` - Node als Kind von "background" (dem Wurzel-Node) hinzu:
es: Primero agregaremos un nodo :ref:`AnimationPlayer <class_AnimationPlayer>` a la escena, como hijo de "background" (el nodo raíz):
fr: Pour commencer, ajoutez un nœud :ref:`AnimationPlayer <class_AnimationPlayer>`à la scène en tant qu'enfant de "background" (le nœud racine) :
ja: まず、\ :ref:`AnimationPlayer <class_AnimationPlayer>`\ ノードを「background」(ルートノード) の子としてシーンに追加します:
ko: 먼저, :ref:`AnimationPlayer <class_AnimationPlayer>` 노드를 "background"(루트 노드)의 자식으로 추가하세요:
pl: Po pierwsze, dodaj do sceny węzeł :ref:`AnimationPlayer <class_AnimationPlayer>` do sceny jako dziecko "background" (tło - węzeł główny):
pt_br: Primeiro de tudo, adicione um nó: ref: `AnimationPlayer <class_AnimationPlayer>` à cena como um filho de "background" (o nó raiz):
ru: Прежде всего, добавьте :ref:`AnimationPlayer <class_AnimationPlayer>` в сцену как дочерний узел "background" (корневой узел):
uk: Перш за все, додайте до сцени вузол :ref:`AnimationPlayer <class_AnimationPlayer>` нащадком "background" (кореневого вузла):
zh_cn: 首先, 将一个 :ref:`AnimationPlayer <class_AnimationPlayer>` 节点添加到场景中, 作为 ``background`` (根节点)的子节点:
zh_tw: 首先，新增一個 :ref:`AnimationPlayer <class_AnimationPlayer>` 節點作為「background」（根節點）的子節點：

source: When a node of this type is selected, the animation editor panel will appear:
cs: Po výběru uzlu tohoto typu se zobrazí panel editoru animací:
de: Wenn ein Node dieses Typs ausgewählt wird, wird der Animationseditor angezeigt:
es: Cuando se selecciona un nodo de este tipo, aparece el panel de edición de animación:
fr: Quand un nœud de ce type est sélectionné , le panneau de l'éditeur d'animation apparaît :
ja: このタイプのノードを選択すると、アニメーション エディタ・パネルが表示されます:
ko: 이 타입의 노드가 선택될 때, 애니메이션 에디터 패널이 나타납니다:
pl: Po wybraniu węzła tego typu, zostanie wyświetlony panel animacji:
pt_br: Quando um nó desse tipo é selecionado, o painel do editor de animação é exibido:
ru: При выборе узла данного типа появляется панель редактора анимаций:
uk: При виборі вузлів такого типу з'являється панель редактора анімації:
zh_cn: 当选择这种类型的节点时, 动画编辑器面板会出现:
zh_tw: 當這種類型的節點被選中後會顯示動畫編輯器面板：

source: The animation editor panel stays visible until manually hidden.
cs: Panel editoru animací zůstane viditelný, dokud jej ručně neskryjete.
de: Der Animationseditor bleibt sichtbar, bis er manuell ausgeblendet wird.
es: El editor de animaciones permanecerá visible hasta que se oculte manualmente.
fr: Le panneau de l'éditeur d'animation reste visible jusqu'à ce qu'il soit masqué manuellement.
ja: アニメーション エディタ・パネルは、手動で非表示にするまで表示されたままになります。
ko: 애니메이션 에디터 패널은 수동으로 숨기지 않는 이상 표시됩니다.
pl: Edytor animacji pozostaje widoczny aż do jego ręcznego ukrycia.
pt_br: O painel do editor de animação permanece visível até ser ocultado manualmente.
ru: Панель редактора анимаций остается видимой до тех пор, пока не будет скрыта вручную.
uk: Панель редактора анімації залишається видимою, поки її не заховати вручну.
zh_cn: 动画编辑器面板保持可见, 直到手动隐藏.
zh_tw: 動畫編輯器面板會保持顯示，直到手動隱藏。

source: Creating the animation
cs: Vytvoření animace
de: Erstellen einer Animation
es: Crear una animación
fr: Créer l'animation
ja: アニメーションの作成
ko: 애니메이션 만들기
pl: Tworzenie animacji
pt_br: Criando a animação
ru: Создание анимации
uk: Створення анімації
zh_cn: 创建动画
zh_tw: 建立動畫

source: It's time to create a new animation! Press the Animation button then select new from the menu. Name the animation "intro" when the dialog appears.
cs: Je čas vytvořit novou animaci! Stiskněte tlačítko Animace a z nabídky vyberte možnost Nová. Po zobrazení dialogového okna pojmenujte animaci "intro".
fr: Il est temps de créer une nouvelle animation ! Appuyez sur le bouton Animation puis sélectionnez nouveau dans le menu. Nommez l'animation "intro" lorsque la boite de dialogue apparaît.
ja: 新しいアニメーションを作成しましょう！ [アニメーション]ボタンを押して、メニューから[新規]を選択します。ダイアログが表示されたら、アニメーションに「intro」という名前を付けます。
ko: 새 애니메이션을 만들 시간입니다! 애니메이션 버튼을 누른 다음 메뉴에서 새로 만들기(new)를 선택하세요. 대화 상자가 나타나면 애니메이션 이름을 "intro" 라고 지으세요.
ru: Пришло время создать новую анимацию! Нажмите на кнопку создания новой анимации и, когда появится диалоговое окно, назовите анимацию "intro".
uk: Настав час створити нову анімацію! Натисніть кнопку Анімація, а потім виберіть у меню Новий. Назвіть анімацію "intro" ("вступ"), коли з'явиться діалогове вікно.
zh_cn: 是时候创建一个新的动画了！按下动画按钮, 然后在菜单中选择新建. 在出现的对话框中输入动画名称 ``intro``.
zh_tw: 該來建立新動畫了！按動畫按鈕並在選單中選擇新增。對話框出現後將動畫名稱設為「intro」。

source: Now that we have an animation, the property editor enters "animation editing" mode. In this mode, a key icon appears next to every property of the property editor. In Godot, any property of an object can be animated:
cs: Nyní, když máme animaci, přejde editor vlastností do režimu "úpravy animace". V tomto režimu se vedle každé vlastnosti editoru vlastností zobrazí ikona klíče. V Godotu lze animovat libovolnou vlastnost objektu:
de: Jetzt, da wir eine Animation haben, wechselt der Eigenschafteneditor in den Modus "Animationsbearbeitung". In diesem Modus wird neben jeder Eigenschaft des Eigenschafteneditors ein Schlüsselsymbol angezeigt. In Godot kann jede Eigenschaft eines Objekts animiert werden:
fr: Maintenant que nous avons une animation, l'éditeur de propriétés entre en mode "édition d'animation". Dans ce mode, une icône clé apparaît à côté de chaque propriété de l'éditeur de propriétés. Sur Godot, n'importe quelle propriété d'un objet peut être animée :
ja: アニメーションができたので、プロパティエディタは「アニメーション編集」モードに入ります。このモードでは、プロパティエディタのすべてのプロパティの横にキーアイコンが表示されます。 Godotでは、どんなオブジェクトのプロパティもアニメーション化できます。
ko: 이제 애니메이션이 있으므로 속성 에디터가 "애니메이션 편집(animation editing)" 모드로 들어갑니다. 이 모드에서는 속성 편집기의 모든 속성 옆에 키 아이콘이 나타납니다. Godot에서 객체의 모든 속성에 애니메이션을 적용할 수 있습니다:
ru: Теперь, когда у нас есть анимация, редактор свойств переходит в режим "редактирования анимации". В этом режиме рядом с каждым свойством редактора свойств отображается значок ключа. В Godot, любое свойство объекта может быть анимировано:
uk: Тепер, коли у нас є анімація, редактор властивостей переходить у режим «редагування анімації». У цьому режимі, поруч із кожною властивістю редактора властивостей, з’являється значок ключа. У Godot будь-яка властивість об'єкта може бути анімована:
zh_cn: 现在我们有一个动画, 属性检查器进入 ``动画编辑`` 模式. 在此模式下, 属性检查器的每个属性旁边都会显示一个钥匙图标. 在Godot中, 对象的任何属性都可以被动画化:
zh_tw: 現在有動畫了，屬性編輯器會進入「動畫編輯」模式。在這個模式下，屬性編輯器中的所有屬性旁邊都會出現一個鑰匙圖示。在 Godot 中，物件的任何屬性都可以被動畫化：

source: Editing the animation
cs: Úpravy animace
de: Bearbeiten einer Animation
es: Editando la animación
fr: Éditer l'animation
ja: アニメーションの編集
ko: 애니메이션 편집하기
pl: Edycja animacji
pt_br: Editando a animação
ru: Редактирование анимации
uk: Редагування анімації
zh_cn: 编辑动画
zh_tw: 編輯動畫

source: The logo will appear from the top of the screen.
cs: Logo se objeví v horní části obrazovky.
de: Das Logo erscheint oben auf dem Bildschirm.
es: El logo aparecerá desde la parte superior de la pantalla.
fr: Le logo apparaîtra en haut de l'écran.
ja: ロゴが画面の上部から表示されます。
ko: 로고는 화면 위쪽에서 나타납니다.
pl: Logo pojawi się w górnej części ekranu.
pt_br: O logotipo aparecerá na parte superior da tela.
ru: Мы хотим чтобы logo появился вверху экрана.
uk: Логотип буде з'являтися у верхній частині екрана.
zh_cn: Logo将从屏幕顶部出现.
zh_tw: Logo 會顯示在螢幕的最上方。

source: With the animation editor panel open, select the "logo" node and set the "Rect / Position" property to ``(118, -400)`` and press the key button next to the property to add a keyframe:
cs: V otevřeném panelu editoru animace vyberte uzel ``logo`` a nastavte vlastnost ``Rect / Position`` na ``(118, -400)`` a stisknutím tlačítka vedle této vlastnosti přidejte klíčový snímek:
fr: Avec le panneau de l'éditeur d'animation ouvert, sélectionnez le nœud "logo" et réglez la propriété "Rect / Position" sur ``(118, -400)`` et appuyez sur le bouton en forme de clé à côté de la propriété pour ajouter une clé d'animation :
ja: アニメーションエディタパネルを開いた状態で、「logo」ノードを選択し、「Rect / Position」プロパティを ``(118, -400)`` に設定し、プロパティの横にあるキーボタンを押してキーフレームを追加します。
ko: 애니메이션 에디터 패널이 열린 상태에서 "Logo" 노드를 선택하고 "Rect / Position" 속성을 ``(118, -400)``\ 으로 설정한 다음 속성 옆에 있는 키 버튼을 눌러 키프레임을 추가하세요:
ru: Открыв панель редактора анимации, выберите узел "logo" и установите свойство "Rect / Position" на ``(118, -400)`` и нажмите на ключ, расположенный рядом со свойством:
uk: Відкривши панель редактора анімації, виберіть вузол "logo" і встановіть властивість "Rect / Position" на ``(118, -400)``, натисніть ключ поруч із властивістю, щоб додати ключовий кадр:
zh_cn: 在动画编辑器面板打开的情况下, 选择 ``logo`` 节点, 并将 ``Rect / Position`` 属性设置为 ``(118, -400)``, 然后按该属性旁边的键按钮以添加关键帧:
zh_tw: 在動畫編輯器開啟的狀態下選擇「logo」節點，並將「Rect / Position」屬性設為 ``(118, -400)`` ，然後點擊屬性旁邊的鑰匙按鈕來新增一個關鍵影格：

source: When the dialog appears, confirm that you are creating a new track.
cs: Po zobrazení dialogového okna potvrďte, že vytváříte novou stopu.
de: Wenn das Dialogfeld angezeigt wird, vergewissere Dich, dass Du eine neue Spur erstellst.
es: Cuando el diálogo aparezca, confirme la creación de la nueva pista.
fr: Lorsque la boîte de dialogue apparaît, confirmez que vous créez une nouvelle piste.
ja: ダイアログが表示されたら、新しいトラックを作成していることを確認します。
ko: 대화 상자가 나타나면, 새 트랙을 만들겠다고 확인하세요.
pl: Gdy pojawi się okno dialogowe, potwierdź, że tworzysz nową ścieżkę.
pt_br: Quando a caixa de diálogo aparecer, confirme se você está criando uma nova faixa.
ru: Когда появится диалоговое окно, подтвердите, что вы создаете новую дорожку.
uk: Коли з'явиться діалогове вікно, підтвердіть, що ви створюєте нову доріжку.
zh_cn: 当对话框出现时, 证明你正在创建一个新轨道.
zh_tw: 對話框跳出後，代表正在建立新的軌道。

source: The keyframe will be added in the animation player editor:
cs: Klíčový snímek bude přidán do editoru přehrávače animací:
de: Das Schlüsselbild wird im Animationsplayer-Editor hinzugefügt:
es: El fotograma clave sera agregado al editor de animaciones:
fr: La clé d'animation va être ajoutée dans l'éditeur d'animation :
ja: キーフレームは、アニメーションプレイヤー・エディタに追加されます:
ko: 키프레임이 애니메이션 플레이어 에디터에 나타납니다:
pt_br: O quadro-chave será adicionado ao editor do player de animação:
ru: Ключевой кадр будет добавлен в редактор плеера анимации:
uk: Ключовий кадр буде додано в редактор плеєра анімації:
zh_cn: 关键帧将添加到动画播放器编辑器中:
zh_tw: 動畫編輯器中會新增一個關鍵影格：

source: Move the editor cursor forward in time by clicking here:
cs: Kliknutím sem přesuňte kurzor editoru v čase dopředu:
fr: Déplacez le curseur d'édition en avant dans le temps en cliquant ici :
ja: ここをクリックして、エディタカーソルを時間的に前方に移動します:
ko: 여기를 클릭해서 에디터 커서를 앞으로 이동하세요:
uk: Перемістіть курсор редактора вперед, натиснувши тут:
zh_cn: 点击此处, 将编辑器光标及时向前移动:
zh_tw: 點擊這裡將編輯器的遊標時間往後移動：

source: Change the logo position to ``(118, 0)`` and add a keyframe again. With two keyframes with different values, the animation happens.
cs: Změňte pozici loga na ``(118, 0)`` a znovu přidejte klíčový snímek. Se dvěma klíčovými snímky s různými hodnotami již můžeme animovat.
fr: Modifiez la position du logo à ``(118, 0)`` et ajoutez une clé d'animation à nouveau. Avec deux clés d'animation ayant deux valeurs différentes, l'animation se produit.
ja: ロゴの位置を ``(118, 0)`` に変更し、またキーフレームを追加してください。値の異なるキーフレームがふたつあれば、アニメーションができます。
ko: Logo 위치를 ``(118, 0)``\ 으로 변경하고 키프레임을 다시 추가하세요. 두 키프레임에 다른 값을 주면 애니메이션이 적용됩니다.
uk: Змініть положення логотипу на ``(118, 0)`` і знову додайте ключовий кадр. З двома ключовими кадрами з різними значеннями відбувається анімація.
zh_cn: 将 ``logo`` 的位置改为 ``(118, 0)``, 并再次添加一个关键帧. 当有两个具有不同值的关键帧, 将产生动画.
zh_tw: 將 logo 的位置更改為 ``(118, 0)`` 並再新增一個關鍵影格。有了兩個有不同數值的關鍵影格，即可產生動畫。

source: Pressing "Play selected animation from start" button on the animation panel (or :kbd:`Shift + D` on keyboard) will make the logo descend.
cs: Stisknutím tlačítka "Přehrát vybranou animaci od začátku" na panelu animace (nebo :kbd:`Shift + D` na klávesnici) se logo spustí.
fr: Appuyer sur "Lecture de l'animation sélectionnée depuis le début" sur le panneau d'animation (ou :kbd:`Shift + D` sur le clavier) fera descendre le logo.
ja: アニメーションパネルの[選択したアニメーションを最初から再生]ボタン(またはキーボードの :kbd:`Shift + D`)を押すと、ロゴが下降します。
ko: 애니메이션 패널에서 "선택한 애니메이션을 처음부터 재생합니다(Play selected animation from start)" 버튼 (또는 키보드의 :kbd:`Shift+D`)를 누르면 로고가 내려갑니다.
uk: Натискання "Відтворити вибрану анімацію від початку" на анімаційній панелі (чи :kbd:`Shift + D` на клавіатурі) змусить логотип опуститися.
zh_cn: 在动画面板按下 ``从开始播放播放所选动画`` .(或者按下 :kbd:`Shift+D`) 将使 ``logo`` 下降.
zh_tw: 點擊動畫面板上的「從頭播放所選動畫」（或是按鍵盤 :kbd:`Shift + D` ）來讓 logo 降下。

source: Click the "Autoplay on Load" button to set the animation to start automatically when the scene starts.
cs: Kliknutím na tlačítko "Autoplay on Load" nastavíte automatické spuštění animace při spuštění scény.
de: Klicke auf die Schaltfläche "Automatisch beim Laden abspielen", um die Animation beim Start der Szene automatisch zu starten.
es: Haz clic en el botón "Autoreproducir al Cargar" para que la animación se inicie automáticamente cuando se inicie la escena.
fr: Cliquez sur le bouton "Lecture automatique au chargement" pour que l'animation se lance automatiquement quand la scène démarre.
ja: 「ロード時の自動再生」 ボタンをクリックすると、シーンの開始時にアニメーションが自動的に開始されます。
ko: "불러올 시 자동으로 재생(Autoplay on Load)" 버튼을 눌러 씬이 시작될 때 애니메이션이 자동으로 시작되도록 설정하세요.
pl: Kliknąć przycisk "Autoplay on Load", aby ustawić automatyczne uruchamianie animacji gdy scena jest uruchamiana.
pt_br: Clique no botão "Autoplay on Load" para definir a animação para iniciar automaticamente quando a cena começar.
ru: Нажмите на кнопку "Автовоспроизведение при Загрузке", чтобы анимация запускалась автоматически при запуске сцены.
uk: Натисніть кнопку "Автовідтворення при завантаженні", щоб анімація відтворювалася автоматично при старті сцени.
zh_cn: 点击 ``加载时自动播放(Autoplay on Load)`` 按钮, 将动画设置为在场景开始时自动开始.
zh_tw: 點擊「載入後自動播放」按鈕來將動畫設為在場景開始時自動播放。

source: And finally, when running the scene, the animation should look like this:
cs: A konečně, při spuštění scény by animace měla vypadat takto:
de: Und zum Schluss sollte die Animation beim Ausführen der Szene so aussehen:
es: Y finalmente, cuando ejecute la escena, la animación deberá verse así:
fr: Et enfin, lors de l'exécution de la scène, l'animation devrait ressembler à ceci :
ja: 最後に、シーンを実行すると、アニメーションは次のようになります:
ko: 그리고 마침내 씬을 실행시키면 애니메이션이 다음과 같이 보입니다:
pl: W końcu, kiedy uruchomimy scenę, animacja powinna wyglądać tak:
pt_br: E finalmente, ao executar a cena, a animação deve ficar assim:
ru: И, наконец, при запуске сцены анимация должна выглядеть следующим образом:
uk: Врешті при запуску сцени має відтворюватися приблизно така анімація:
zh_cn: 最终, 当运行场景时, 动画应该是这样的:
zh_tw: 最後，當場景開始執行時動畫應該會長這樣：

source: It's time to create a new animation! Press the new animation button and name the animation "intro" when the dialog appears.
es: ¡Es hora de crear una nueva animación! Presiona el botón de nueva animación y nombra la animación "intro" cuando aparezca el cuadro de diálogo.
pt_br: Chegou a hora de criar uma nova animação! Pressione o novo botão de animação e nomeie a animação "intro" quando a caixa de diálogo aparecer.

source: Now that we have an animation the property editor enters "animation editing" mode. In this mode, a key icon appears next to every property of the property editor. In Godot any property of an object can be animated:
es: Ahora que tenemos una animación, el editor de propiedades entra en modo "edición de animación". En este modo, aparece un icono con forma de llave junto a cada propiedad del editor de propiedades. En Godot cualquier propiedad de un objeto puede ser animada:
pt_br: Agora que temos uma animação, o editor de propriedades entra no modo "edição de animação". Neste modo, um ícone de chave aparece ao lado de todas as propriedades do editor de propriedades. Em Godot, qualquer propriedade de um objeto pode ser animada:

source: With the animation editor panel open, select the "logo" node and set the "Rect / Position" property to ``(118, -400)`` and press the key button next to the property:
de: Wähle bei geöffnetem Animationseditor-Bedienfeld den Node "Logo" aus, setze die Eigenschaft "Rect / Position" auf ``(118, -400)`` und drücke die Schlüsselschaltfläche neben der Eigenschaft:
es: Con el editor de animaciones abierto, selecciona el nodo "logo" y establece la propiedad "Rect / Position" en ``(118, -400)`` y pulsa el botón de la llave junto a la propiedad:
pt_br: Com o painel do editor de animação aberto, selecione o nó "logo" e defina a propriedade "Rect / Position" para "(118, -400)" e pressione o botão ao lado da propriedade:

source: Move the editor cursor to the end by clicking here:
de: Bewege den Editor-Cursor an das Ende, indem Du hier klickst:
es: Mueve el cursor del editor al final haciendo clic aquí:
pt_br: Mova o cursor do editor para o final, clicando aqui:

source: Change the logo position to ``(118, 0)`` and add a keyframe again. With two keyframes, the animation happens.
de: Ändere die Logo-Position in ``(118, 0)`` und füge erneut ein Schlüsselbild hinzu. Bei zwei Schlüsselbildern erfolgt die Animation.
es: Cambia la posición del logo a ``(118, 0)`` y vuelve a añadir un fotograma clave. Con dos fotogramas clave, la animación sucede.
pt_br: Mude a posição do logo para `` (118, 0) `` e adicione um quadro-chave novamente. Com dois quadros-chave, a animação acontece.

source: Pressing "Play selected animation from start. (Shift-D)" on the animation panel will make the logo descend.
de: Durch Drücken von "Ausgewählte Animation vom Start aus abspielen (Umschalt-D)" im Animationsfenster wird das Logo nach unten bewegt.
es: Presionando "Reproducir la animación seleccionada desde el principio. (Mayúsculas-D)" en el panel de animaciones hará que el logo descienda.
pl: Naciśnij "Play selected animation from start. (Shift-D)" na panelu animacji spowoduje opadanie loga.
pt_br: Pressionar "Reproduzir animação selecionada a partir do início (Shift-D)" no painel de animação fará o logotipo descer.
ru: Нажатие на кнопку "Воспроизвести выбранную анимацию с самого начала. (Shift-D)" на панели анимации, сделает так чтобы logo стало опускаться.
