Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/exporting.po
Languages: fi, it, ja, ko, pt_br, ru, zh_cn

source: You must also provide icons and splash screen images as shown below:
fi: Sinun täytyy myös asettaa ikonit ja käynnistyskuvat, kuten näytetty alla:
it: È inoltre necessario fornire icone e immagini della schermata iniziale come mostrato di seguito:
ja: アイコンとスプラッシュスクリーンも下の画像のように指定する必要があります:
ko: 그리고 반드시 아이콘과 스플래시 스크린 이미지를 다음과 같이 제공해야 합니다:
pt_br: Você também deve fornecer ícones e imagens da tela inicial, conforme mostrado abaixo:
ru: Также вы должны предоставить значки и изображения заставок, как показано ниже:
zh_cn: 您还必须提供图标和启动屏幕图像，如下所示：

source: Click **Export Project** and select a destination folder.
ru: Нажмите кнопку **Экспортировать проект** и выберите папку назначения.

source: Once you have successfully exported the project, you'll find the following folders and files have been created in your selected location:
fi: Kun olet vienyt projektisi onnistuneesti, löydät seuraavat kansiot ja tiedostot luotuina antamastasi sijainnista:
it: Una volta esportato correttamente il progetto, troverai le seguenti cartelle e file creati nella posizione selezionata:
ja: プロジェクトのエクスポートに成功すると、選択した場所に、以下の通りにフォルダとファイルが作られます。
ko: 프로젝트가 완전히 내보내졌다면, 당신이 지정한 폴더에 파일들이 만들어 진것을 볼 수 있습니다:
pt_br: Depois de exportar o projeto, você verá que as seguintes pastas e arquivos foram criados no local selecionado:
ru: Как только вы успешно экспортируете проект, вы обнаружите, что в вашем выбранном месте созданы следующие папки и файлы:
zh_cn: 成功导出项目后，将在所选位置找到以下文件夹和文件：

source: You can now open the project in Xcode and build the project for iOS. The Xcode build procedure is beyond the scope of this tutorial. See https://help.apple.com/xcode/mac/current/#/devc8c2a6be1 for more information.
ru: Теперь вы можете открыть проект в Xcode и собрать его для iOS. Порядок сборки Xcode выходит за рамки данного урока. См. https://help.apple.com/xcode/mac/current/#/devc8c2a6be1 для получения дополнительной информации.

source: Click **Export Project** on the HTML5 preset. We don't need to change any of the default settings.
ru: Нажмите кнопку **Экспортировать проект** на базе предустановки HTML5. Нам не нужно изменять какие-либо параметры по умолчанию.

source: When the export is complete, you'll have a folder containing the following files:
fi: Kun vienti on valmis, saat seuraavat tiedostot sisältävän kansion:
it: Al termine dell'esportazione, avrai una cartella contenente i seguenti file:
ja: エクスポートが完了すると、下記のファイルがあるフォルダが作られます。
ko: 내보내기가 끝나면, 다음의 파일이 들어있는 폴더를 찾으실 수 있습니다:
pt_br: Quando a exportação estiver concluída, você terá uma pasta contendo os seguintes arquivos:
ru: Когда экспорт будет завершен, будет создана папка, содержащая следующие файлы:
zh_cn: 导出完成后，您将拥有一个包含以下文件的文件夹：

source: Viewing the ``.html`` file in your browser lets you play the game. However, you can't open the file directly. Instead, it needs to be served by a web server. If you don't have one set up on your computer, you can search online to find suggestions for your specific OS.
ru: Просмотр файла ``.html`` в браузере позволяет вам воспроизводить игру. Однако, вы не сможете открыть файл напрямую. Вместо этого он должен обслуживаться веб-сервером. Если он не установлен у вас на компьютере, то можете поискать в сети варианты решений для вашей операционной системы.

source: Point your browser at the URL where you've placed the HTML file. You may have to wait a few moments while the game loads before you see the start screen.
ru: В адресной строке браузера укажите URL расположения вашего HTML-файла. Возможно, вам придётся немного подождать, пока игра загрузится и вы увидите стартовый экран.

source: The console window beneath the game tells you if anything goes wrong. You can disable it by disabling **Export With Debug** in the final file dialog that appears when you export the project.
ru: Если что-то пойдёт не так, окно консоли ниже игры скажет, в чём проблема. Вы можете его отключить, сняв опцию **Экспорт в режиме отладки** в завершающем окне файла при экспорте проекта.

source: While WebAssembly is supported in all major browsers, it is still an emerging technology and you may find some things that don't work. Make sure you have updated your browser to the most recent version, and report any bugs you find on the `Godot GitHub repository <https://github.com/godotengine/godot/issues>`_.
ru: Хотя WebAssembly поддерживается во всех основных браузерах, это все еще развивающаяся технология, и вы можете обнаружить, что некоторые вещи не работают. Убедитесь, что вы обновили браузер до последней версии и сообщите о любых обнаруженных ошибках в `репозиторий Godot на Github <https://github.com/godotengine/godot/issues>`_.

source: The way you export your game depends on what platform you are targeting. In this tutorial, you'll learn how to export the "Dodge the Creeps" game for a variety of platforms. First, however, we need to make some changes to the way the game works.
fi: Tapa, jolla viet pelisi, riippuu kohdealustasta. Tässä oppaassa opit, kuinka viedä "Dodge the Creeps" peli useille eri alustoille. Ensin meidän täytyy kuitenkin tehdä joitakin muutoksia pelin toimintatapaan.
it: La modalità di esportazione del gioco dipende dalla piattaforma di destinazione. In questo tutorial, imparerai come esportare il gioco "Dodge the Creeps" per una varietà di esse. In primo luogo, tuttavia, abbiamo bisogno di apportare modifiche ad alcune funzionalità del gioco.
ja: エクスポートの方法はプラットホームごとに異なります。このチュートリアルでは「這うものをよけろ」をいろいろなプラットフォーム用にエクスポートする方法を学びます。最初にゲームの仕組みを少し変える必要があります。
ko: 당신이 무슨 플랫폼을 타깃으로 삼느냐에 따라 게임을 내보내는 방법은 다릅니다. 이 튜토리얼에서는, 어떻게 "Dodge the Creeps" 게임을 다양한 플랫폼에 내보내는 지를 배울겁니다. 그러나, 먼저 우리는 게임이 작동하는 방식을 바꿔야합니다.
pt_br: A maneira como você exporta seu jogo depende de qual plataforma você está objetivando. Neste tutorial, você aprenderá como exportar o jogo "Dodge the Creeps" para uma variedade de plataformas. Primeiro, no entanto, precisamos fazer algumas mudanças na maneira como o jogo funciona.
zh_cn: 导出游戏的方式取决于您的目标平台。本教程中，您将学习如何将 ``Dodge the Creeps`` 游戏导出到各种平台。然而，首先我们需要对游戏的工作方式做一些改变。

source: If you haven't made "Dodge the Creeps" yourself yet, please read :ref:`doc_your_first_game` before continuing with this tutorial.
fi: Jos et ole vielä tehnyt "Dodge the Creeps" peliä itse, ole hyvä ja lue :ref:`doc_your_first_game` ennen kuin jatkat tämän ohjeen parissa.
it: Se non hai ancora creato "Dodge the Creeps", leggi :ref:'doc_your_first_game' prima di continuare con questo tutorial.
ja: 自分でまだ「這うものをよけろ」を作成していない場合は、このチュートリアルを続ける前に :ref:`doc_your_first_game` をお読みください。
ko: 아직 "Dodge the Creeps"을 스스로 만들지 않았다면, 이 튜토리얼을 시작하기 전에 :ref:`doc_your_first_game` 을 읽어주세요.
pt_br: Se você ainda não fez "Dodge the Creeps", leia: ref: `doc_your_first_game` antes de continuar com este tutorial.
zh_cn: 如果您还没有自己完成 ``Dodge the Creeps`` 游戏，请阅读 :ref:`doc_your_first_game` 后再继续本教程。

source: In "Dodge the Creeps" we used keyboard controls to move the player's character. This is fine if your game is being played on a PC platform, but on a phone or tablet, you need to support touchscreen input. Because a click event can be treated the same as a touch event, we'll convert the game to a click-and-move input style.
fi: "Dodge the Creeps" pelissä käytämme näppäimistöohjausta pelaajan hahmon liikkuttamiseksi. Tämä on sopivaa, jos peliäsi pelataan PC-alustalla, mutta puhelinta tai tablettia varten sinun täytyy tukea kosketusnäytön syötteitä. Koska hiiren napsautusta voidaan käsitellä samalla tavalla kuin kosketusta, muunnamme pelin napsauta-ja-liiku tyyliselle syötteelle.
it: In "Dodge the Creeps" abbiamo usato i controlli della tastiera per muovere il giocatore. Questo va bene su una PC, ma su un telefono o tablet è necessario rilevare l'input da touchscreen. Poiché un evento click può essere trattato allo stesso modo di un evento touch, convertiremo il gioco in uno stile di input click-and-move.
ja: 「這うものをよけろ」ではプレイヤーキャラクターをキーボードでコントロールしました。これはPCなら良いのですが、スマートフォンやタブレットではタッチスクリーンの入力に対応する必要があります。クリックイベントをタッチイベントと同じに扱うことでゲームをクリックして移動するようにできます。
ko: "Dodge the Creeps" 에서 우리는 키보드로 플레이어의 캐릭터를 움직이게 합니다. 이것은 PC 플랫폼에서 실행된다면 괜찮습니다만, 폰이나 태블릿이라면, 터치 스크린 입력을 지원해야합니다. 클릭 이벤트는 터치 이벤트와 동일하게 처리될 수 있기 때문에, 우리는 게임을 클릭-그리고-움직임 입력 스타일로 만들어야합니다.
pt_br: Em "Dodge the Creeps", usamos controles de teclado para mover o personagem do jogador. Isso é bom se o seu jogo está sendo jogado em uma plataforma de PC, mas em um telefone ou tablet, você precisa suportar a entrada de tela sensível ao toque. Como um evento de clique pode ser tratado da mesma forma que um evento de toque, convertemos o jogo em um estilo de entrada de clicar-e-mover.
zh_cn: 在 ``Dodge the Creeps`` 中我们使用键盘控制 ``Player`` 角色的移动。如果您的游戏是在PC平台上玩的，这没问题，但在手机或平板上，您需要支持触屏输入。因为点击事件可以被视为触摸事件，我们将把游戏转换为点击移动输入风格。

source: By default Godot emulates mouse input from touch input. That means if anything is coded to happen on a mouse event, touch will trigger it as well. Godot can also emulate touch input from mouse clicks, which we will need to be able to keep playing our game on our computer after we switch to touch input. In the "Project Settings" under *Input Devices* and *Pointing*, set *Emulate Touch From Mouse* to "On".
ja: デフォルトでは、Godotはタッチ入力からマウス入力をエミュレートします。つまり、何かがマウスイベントで発生するようにコーディングされている場合、タッチもそれをトリガーします。 Godotは、マウスクリックからタッチ入力をエミュレートすることもできますが、タッチ入力に切り替えた後でも、コンピューターでゲームをプレイし続けることができる必要があります。 [プロジェクト設定]で *Input Devices* の *Pointing* 内にある、\ *Emulate Touch From Mouse* を[オン]に設定します。
pt_br: Por padrão o Godot emula o mouse quando há entrada de toque. Quer dizer que se tudo é programado para acontecer em um evento de mouse, o toque vai ativar da mesma forma. O Godot também pode emular o toque a partir de cliques do mouse, o que precisaremos para poder jogar nosso jogo no computador depois que trocarmos para entrada de toque. Nas "Configurações do Projeto" em *Input Devices* e *Pointing*, ligue a opção *Emulate Touch From Mouse*.
zh_cn: 默认情况下，Godot 从触摸输入模拟鼠标输入。这意味着为鼠标事件所写的代码也能被触摸事件触发。Godot 也可以从鼠标点击模拟触摸输入。如果我们将游戏转到触摸操纵, 要在电脑上继续玩就要用到这个功能。在"项目设置"下的*Input Devices*, *Pointing* 下, 设置*Emulate Touch From Mouse* 为 "启用"。

source: We also want to ensure that the game scales consistently on different-sized screens, so in the project settings go to *Display*, then click on *Window*. In the *Stretch* options, set *Mode* to "2d" and *Aspect* to "keep".
ja: また、ゲームが異なるサイズの画面上で一貫してスケーリングされるようにするため、プロジェクト設定で *Display* に移動し、\ *Window* をクリックします。\ *Stretch* オプションで、\ *Mode* を"2d"に、\ *Aspect* を"keep"に設定します。
pt_br: Também queremos ter certeza que o jogo mudará de tamanho consistentemente em telas de diferentes tamanhos, então nas configurações do projeto vá para *Display* e clique em *Window*. Nas opções de *Stretch*, mude *Mode* para "2d" e *Aspect* para "keep".
zh_cn: 我们也希望保证游戏在不同大小的屏幕上缩放正常。在项目设置中转到 *显示（Display）*，然后点击 *窗口（Window）*。在 *伸展（Stretch）* 选项中，将 *模式（Mode）* 设置为 "2d"，将 *纵横比（Aspect）* 设置为"keep"。

source: Since we are already in the *Window* settings, we should also set under *Handheld* the *Orientation* to "portrait".
ja: すでに *Window* の設定になっているので、続いて *Handheld* 内の *Orientation* を"portrait"に設定する必要があります。
pt_br: Desde que já estamos nas configurações da *Janela*, também devemos definir a *Orientação* para "portrait" em *Handheld*.
zh_cn: 由于我们已经在*窗口*设置中，我们还应该在*手持*的*方向*下设置为“纵向”。

source: The main scene is the one that your game will start in. In *Project -> Project Settings -> Application -> Run*, set *Main Scene* to "Main.tscn" by clicking the folder icon and selecting it.
ja: メインシーンは、ゲームが開始されるシーンです。\ *プロジェクト -> プロジェクト設定 -> Application -> Run* で、フォルダアイコンをクリックして選択し、\ *Main Scene* を"Main.tscn"に設定します。
pt_br: A cena principal é na qual o seu jogo iniciará. Em *Projeto -> Opções do Projeto -> Aplicação -> Rodar*, defina *Cena Principal* para "Main.tscn" clicando no ícone da pasta e selecionando-a.
zh_cn: 主场景是你的游戏会启动的场景。要更改任务栏图标，请转到 *项目→项目设置→Application→Run*中, 设置*Main Scene*为"Main.tscn" 。单击文件夹图标，然后选择Main.tscn即可。

source: In order to export, you need to download the *export templates* from the http://godotengine.org/download. These templates are optimized versions of the engine without the editor pre-compiled for each platform . You can also download them in Godot by clicking on *Editor -> Manage Export Templates*:
fi: Jotta voit viedä projekteja, sinun täytyy ladata *vientimallit* osoitteesta http://godotengine.org/download. Nämä mallit ovat kullekin alustalle esikäännettyjä optimoituja versioita pelimoottorista ilman editoria Voit myös ladata ne Godotissa napsauttamalla *Editori -> Hallinnoi vientimalleja*:
it: Per esportare, è necessario scaricare i modelli di esportazione da http://godotengine.org/download. Questi modelli sono versioni ottimizzate del motore senza l'editor precompilato per ogni piattaforma. È anche possibile scaricarli in Godot facendo clic su "Editor" - - - > Gestisci modelli di esportazione:
ja: エクスポートするには、http://godotengine.org/download から\ *export templates*\ をダウンロードする必要があります。これらのテンプレートは、各プラットフォーム用にエディタがプリコンパイルされていない最適化されたバージョンのエンジンです。\ *Editor-> Manage Export Templates*\ をクリックして、Godotでダウンロードすることもできます。
ko: 프로젝트를 내보내려면, *내보내기 템플릿(export templates)* 을 http://godotengine.org/download 에서 다운로드 해야 합니다. 이 템플릿은 엔진에 최적화된 버전으로 각 플렛폼에 따로 컴파일된 편집기가 필요 없습니다. 당신은 또한 Godot에서 *편집기 -> 내보내기 템플릿 관리* 를 통해 다운로드 할 수 있습니다:
pt_br: Para exportar, você precisa baixar os *export templates* de http://godotengine.org/download. Esses modelos são versões otimizadas do mecanismo sem o editor previamente compilado para cada plataforma. Você também pode baixá-los em Godot clicando em *Editor -> Gerenciar Modelos de Exportação*:
zh_cn: 为了导出，您需要从 `这里 <http://godotengine.org/download>`__ 下载 *导出模板*。这些模板是为每个平台预先编译的不带编辑器的引擎的优化版本。您还可以通过点击 *编辑器->管理导出模板* 在Godot中下载它们：

source: In the window that appears, you can click "Download" to get the template version that matches your version of Godot.
fi: Voit napsauttaa "Lataa" avautuneessa ikkunassa saadaksesi vientimallin version, joka vastaa sinun Godotin versiota.
it: Nella finestra che appare, è possibile fare clic su "Download" per ottenere la versione del modello relativa alla versione di Godot.
ja: 表示されるウィンドウで、「ダウンロード」をクリックして、ご使用のGodotのバージョンに一致するテンプレートバージョンを取得できます。
ko: 나타나는 창에서, "다운로드" 를 눌러서 당신의 Godot 버전과 맞는 템플릿을 다운로드 할 수 있습니다.
pt_br: Na janela que aparece, você pode clicar em "Download" para obter a versão do modelo que corresponde à sua versão do Godot.
zh_cn: 在出现的窗口中，您可以点击 ``下载`` 以获取与您的Godot版本匹配的模板版本。

source: If you upgrade Godot, you must download templates that match the new version or your exported projects may not work correctly.
fi: Jos päivität Godotin, sinun täytyy ladata vientimallit, jotka vastaavat uutta versiota tai viedyt projektisi eivät välttämättä toimi kunnolla.
it: Se si aggiorna Godot, è necessario scaricare i modelli relativi alla nuova versione o i progetti esportati potrebbero non funzionare correttamente.
ja: Godotをアップグレードする場合、新しいバージョンに一致するテンプレートをダウンロードする必要があります。そうしないと、エクスポートされたプロジェクトが正しく機能しない場合があります。
ko: Godot를 업그레이드 하셨다면, 새로운 버전에 맞는 템플릿을 다운로드 해야 하고 그렇지 않으면 프로젝트가 제대로 내보내기가 작동하지 않습니다.
pt_br: Se você atualizar o Godot, deverá baixar modelos que correspondam à nova versão ou seus projetos exportados podem não funcionar corretamente.
zh_cn: 如果升级Godot，则必须下载与新版本匹配的模板，否则导出的项目可能无法正常工作。

source: Next, you can configure the export settings by clicking on *Project -> Export*.
ja: 次に、\ *プロジェクト -> エクスポート* の順にクリックして、エクスポート設定を構成できます。
pt_br: Em seguida, você pode definir as configurações de exportação clicando em *Projeto -> Exportar*.
zh_cn: 接下来，您可以通过点击 *项目 -> 导出* 来配置导出设置。

source: Create a new export preset by clicking "Add..." and selecting a platform. You can make as many presets as you like with different settings.
fi: Luo uudet esiasetukset viennille napsauttamalla "Lisää..." ja valitsemalla alusta. Voit tehdä niin monia esiasetuksia kuin haluat erilaisilla asetuksilla.
it: Crea un nuovo pofilo di esportazione cliccando su "Add....." e selezionando una piattaforma. È possibile creare più profili a piacere con impostazioni diverse.
ja: 「追加...」をクリックしてプラットフォームを選択し、新しいエクスポートプリセットを作成します。 さまざまな設定で好きなだけプリセットを作成できます。
ko: "추가..."를 눌러서 새 내보내기 프리셋을 만들고 플랫폼을 선택하세요. 다양한 설정과 함께 당신은 많은 프리셋를 만들 수 있습니다.
pt_br: Crie uma nova predefinição de exportação clicando em "Adicionar ..." e selecionando uma plataforma. Você pode fazer quantas predefinições desejar com configurações diferentes.
zh_cn: 通过点击 ``添加...`` 并选择平台来创建新的导出预设。您可以使用不同的设置创建任意数量的预设。

source: At the bottom of the window are two buttons. "Export PCK/ZIP" only creates a packed version of your project's data. This doesn't include an executable so the project can't be run on its own.
fi: Ikkunan alalaidassa on kaksi painiketta. "Vie PCK/ZIP" luo vain pakatun version projektisi datasta. Se ei sisällä suoritettavaa tiedostoa, joten projektia ei voi ajaa sellaisenaan.
it: Nella parte inferiore della finestra sono presenti due pulsanti. "Esporta PCK / ZIP" crea solo una versione compressa dei dati del progetto. Questo non include alcun eseguibile, quindi il progetto non può girare in autonomia.
ja: ウィンドウの下部には2つのボタンがあります。 「PCK / ZIPのエクスポート」は、プロジェクトのデータのパックバージョンのみを作成します。 これには実行可能ファイルが含まれていないため、プロジェクトを単独で実行することはできません。
ko: 창의 아래쪽에 두 버튼이 있습니다. "PCK/ZIP 내보내기"는 오직 프로젝트 데이터를 압축된 버전으로 만듭니다. 이것은 실행 파일이 아니므로 프로젝트가 스스로 실행되지 못합니다.
pt_br: Na parte inferior da janela há dois botões. "Exportar PCK / ZIP" cria apenas uma versão compactada dos dados do seu projeto. Isso não inclui um executável, portanto, o projeto não pode ser executado por conta própria.
zh_cn: 窗口的底部有两个按钮。``导出 PCK/ZIP`` 只创建项目数据的打包版本。它不包含可执行文件，因此该项目无法单独运行。

source: The second button, "Export Project", creates a complete executable version of your game, such as an `.apk` for Android or an `.exe` for Windows.
fi: Toinen painike, "Vie projekti", luo valmiin suoritettavan version pelistäsi, kuten esimerkiksi `.apk` Androidille tai `.exe` Windowsille.
it: Il secondo pulsante, "Esporta progetto", crea una versione eseguibile completa del gioco, ad esempio un '.apk' per Android o un '.exe' per Windows.
ja: 2番目のボタン「プロジェクトのエクスポート」は、Androidの場合は `.apk` 、Windowsの場合は `.exe` など、ゲームの完全な実行可能バージョンを作成します。
ko: 두 번째 버튼, " 프로젝트 내보내기", 게임의 완전 실행가능한 버전을 만듭니다, 마치 Android의 `.apk` 나 Windows의 `.exe` 처럼 말이죠.
pt_br: O segundo botão, "Exportar Projeto", cria uma versão executável completa do seu jogo, como um `.apk` para o Android ou um `.exe` para o Windows.
zh_cn: 第二个按钮 ``导出项目`` 创建游戏的完整可执行版本，例如Android的 ``.apk`` 或Windows的 ``.exe``。

source: In the "Resources" and "Features" tabs, you can customize how the game is exported for each platform. We can leave those settings alone for now.
fi: "Resurssit" ja "Ominaisuudet" välilehdillä voit räätälöidä pelisi viennin kullekin alustalle. Voimme jättää nuo asetukset toistaiseksi rauhaan.
it: Nelle schede "Risorse" e "Caratteristiche" è possibile personalizzare le modalità di esportazione del gioco per ogni piattaforma. Per ora possiamo lasciare queste impostazioni come sono.
ja: 「リソース」タブと「機能」タブでは、プラットフォームごとにゲームをエクスポートする方法をカスタマイズできます。 今のところ、これらの設定はそのままにしておきます。
ko: "리소스"와 "기능" 탭에서 당신은 게임이 각 플랫폼으로 어떻게 만들어질지를 설정할 수 있습니다. 지금은 이 설정을 그냥 놔 두어도 됩니다.
pt_br: Nas abas "Recursos" e "Funcionalidades" você pode personalizar como o jogo é exportado para cada plataforma. Podemos deixar essas configurações como estão por enquanto.
zh_cn: 在 ``资源（Resources）`` 和 ``特性（Features）`` 选项卡中，您可以自定义如何为每个平台导出游戏。我们可以先不考虑这些设置。

source: Exporting PC platforms works the same across the three supported operating systems. Open the export window and click "Add.." to create the preset(s) you want to make. Then click "Export Project" and choose a name and destination folder. Choose a location *outside* of your project folder.
fi: PC-alustoille vienti toimii samalla tavalla kaikille kolmelle tuetulle käyttöjärjestelmälle. Avaa vienti-ikkuna ja napsauta "Lisää..." luodaksesi ne esiasetukset, jotka haluat tehdä. Napsauta sitten "Vie projekti" ja valitse nimi ja kohdekansio. Valitse sijainti projektikansiosi *ulkopuolelta*.
it: L'esportazione su PC è la stessa per tuttu e tre i sistemi operativi supportati. Apri la finestra di esportazione e clicca su "Add....." per creare i preset che desideri. Quindi fai clic su "Esporta progetto" e scegli un nome e una cartella di destinazione. Scegli una posizione al di fuori dalla cartella del progetto.
ja: PCプラットフォームへのエクスポートは３つのサポートされたオペレーションシステムで同じ様に動きます。プリセットを作るためにエクスポートウィンドウを開き「Add..」をクリックします。その後 「エクスポートプロジェクト」 をクリックし、名前と保存フォルダを選びます。あなたのプロジェクトの *外側* の場所を選んで下さい。
ko: PC 플랫폼 내보내기는 지원되는 세 가지 운영체제에서 동일하게 작동합니다. 내보내기 창을 열고 "추가..."를 눌러 만들고 싶은 프리셋을 생성합니다. 그후 "프로젝트 내보내기"를 클릭하고 이름과 목적 폴더를 지정합니다. 당신의 프로젝트 폴더 *바깥* 에 위치를 지정하세요.
pt_br: A exportação de plataformas para PC funciona da mesma forma nos três sistemas operacionais suportados. Abra a janela de exportação e clique em "Adicionar..." para criar a(s) predefinição(ões) que você deseja criar. Em seguida, clique em "Exportar Projeto" e escolha um nome e uma pasta de destino. Escolha um local *fora* da pasta do seu projeto.
zh_cn: 导出PC平台在三个受支持的操作系统上的工作原理相同。打开导出窗口，然后点击 ``添加..`` 以创建要创建的预设。 然后点击 ``导出项目``，然后选择一个名称和目标文件夹。选择项目文件夹的 *外部* 位置。

source: Click "Save" and the engine will build the export files.
fi: Napsauta "Tallenna" ja pelimoottori rakentaa vientitiedostot.
it: Fare clic su "Salva" e l'engine creerà i file relativi all'esportazione.
ja: 「保存」をクリックするとエンジンはエクスポートファイルをビルドします。
ko: "저장"을 누르면 엔진이 내보내기 파일을 만들겁니다.
pt_br: Clique em "Salvar" e o mecanismo criará os arquivos de exportação.
zh_cn: 单击 ``保存``，引擎将构建导出文件。

source: When exporting for macOS, if you export on a macOS computer, you'll end up with a `.dmg` file, while using Linux or Windows produces a `.zip`. In either case, the compressed file contains a macOS `.app` that you can double-click and run.
fi: Jos teet viennin macOS:lle macOS-tietokoneella, saat `.dmg` tiedoston, kun taas Linuxin tai Windowsin käyttö tuottaa `.zip` tiedoston. Kummassakin tapauksessa pakattu tiedosto sisältää macOS `.app` tiedoston, jonka voit ajaa kaksoisnapsautuksella.
it: Quando esporti per macOS, tramite un computer macOS, otterrai un file '.dmg', mentre se usi Linux o Windows otterrai un file '.zip'. In entrambi i casi, il file compresso contiene un `.app` per macOS che è possibile eseguire con un doppio click.
ja: macOSへとエクスポートする際、macOSマシン上でエクスポートすると、 `.dmg` ファイルができますが、LinuxあるいはWindowsの場合は `.zip` ファイルが作られます。いずれの場合も、この圧縮ファイルの中にはmacOS用 `.app` が含まれていて、ダブルクリックすると実行できます。
ko: macOS 컴퓨터에서 작업한다면, macOS로 내보낼 때, 파일을 `.dmg` 파일로 만들 것이고, 반면에 Linux나 Windows는 `.zip` 으로 생성합니다. 어떤 경우든지, 압축된 파일은 macOS의 `.app` 을 갖고 있으므로 더블 클릭해서 실행할 수 있습니다.
pt_br: Ao exportar para o MacOS, se você exportar em um computador MacOS, você terminará com um arquivo `.dmg`, enquanto se usar um Linux ou Windows para isso produzirá um` .zip`. Em ambos os casos, o arquivo compactado contém um `.app` do MacOS que você pode clicar duas vezes e executar.
zh_cn: 为macOS导出时，如果在macOS计算机上导出，则最终会得到一个 ``.dmg`` 文件，而在使用Linux或Windows时会生成一个 ``.zip`` 文件。无论哪种情况，压缩文件都包含一个macOS ``.app``，您可以双击并运行它。
