Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/exporting.po
Languages: fi, it, ja, ko, pt_br, ru, zh_cn

source: Exporting
fi: Vienti
it: Esportazione
ja: エクスポート
ko: 내보내기(Exporting)
pt_br: Exportando
ru: Экспорт
zh_cn: 导出

source: Overview
fi: Yleiskatsaus
it: Panoramica
ja: 概要
ko: 개요
pt_br: Visão geral
ru: Обзор
zh_cn: 概览

source: Now that you have a working game, you probably want to share your success with others. However, it's not practical to ask your friends to download Godot just so they can open your project. Instead, you can *export* your project, converting it into a "package" that can be run by anyone.
fi: Nyt kun sinulla on toimiva peli, haluat todennäköisesti jakaa onnistumisesi muiden kanssa. Ei ole kuitenkaan käytännöllistä pyytää ystäviäsi lataamaan Godotia, vain jotta he voisivat avata projektisi. Voit sen sijaan *viedä* projektisi, muuntamalla sen "paketiksi", jonka kuka tahansa voi ajaa.
it: Ora che avete un gioco funzionante, probabilmente volete condividere il vostro successo con gli altri. Tuttavia, non è pratico chiedere ai tuoi amici di scaricare Godot solo per aprire il tuo progetto. Invece, puoi *esportare* il tuo progetto, convertendolo in un "pacchetto" che può essere gestito da chiunque.
ja: 動作するゲームを作成したら、他の人にシェアしたいでしょう。でも、友達にGodotをダウンロードして、あなたのプロジェクトを開くように頼むのは現実的ではないですね。代わりに、あなたは自分のプロジェクトを\ *エクスポート*\ して誰でも動作させることのできる「パッケージ」にすることができます。
ko: 이제 당신은 작업한 게임을 갖고 있으니, 당신의 성공을 남과 나누고 싶을 겁니다. 하지만, 그렇다고 친구에게 Godot를 다운로드하고 프로젝트를 열라고 요청하는 것은 실용적이지 못합니다. 대신, 당신은 당신의 프로젝트를 "패키지"로 전환해서 누구나 열 수 있도록 *내보내기* 가 가능합니다.
pt_br: Agora que você tem um jogo em funcionamento, provavelmente quer compartilhar seu sucesso com os outros. No entanto, não é prático pedir a seus amigos que façam o download do Godot apenas para que possam abrir seu projeto. Em vez disso, você pode *exportar* seu projeto, convertendo-o em um "pacote" que pode ser executado por qualquer pessoa.
ru: Теперь, когда у вас есть рабочая игра, вы, вероятно, захотите поделиться своим успехом с другими. Однако непрактично просить ваших друзей, чтобы они скачали Godot для открытия вашего проекта с игрой. Вместо этого, вы можете *экспортировать* ваш проект, превращая его в "пакет", который может открыть любой пользователь.
zh_cn: 现在您已经有了一个可以运行的游戏，您可能想要和别人分享您的成果。然而，让您的朋友下载Godot而只是为了打开您的项目是不实际的。相反，您可以 *导出* 您的项目，将其转换为任何人都可以运行的 ``软件包``。

source: The way you export your game depends on what platform you are targeting. In this tutorial, you'll learn how to export the *Dodge the Creeps* game for a variety of platforms. First, however, we need to make some changes to the way the game works.
ru: Способ экспорта вашей игры зависит от того, на какую платформу вы ориентируетесь. В этом уроке вы научитесь экспортировать игру "Увернись от Крипов" на различные платформы. Во-первых, нам нужно внести некоторые изменения в работу игры.

source: If you haven't made *Dodge the Creeps* yourself yet, please read :ref:`doc_your_first_game` before continuing with this tutorial.
ru: Если вы еще не создали "Увернись от Крипов!" самостоятельно, пожалуйста, прочтите :ref:`doc_your_first_game`, прежде чем продолжить этот урок.

source: Preparing the project
fi: Projektin valmistelu
it: Preparazione del progetto
ja: プロジェクトの準備
ko: 프로젝트 준비하기
pt_br: Preparando o projeto
ru: Подготовка проекта
zh_cn: 准备项目

source: In *Dodge the Creeps*, we used keyboard controls to move the player's character. This is fine if your game is being played on a PC platform, but on a phone or tablet, you need to support touchscreen input. Because a click event can be treated the same as a touch event, we'll convert the game to a click-and-move input style.
ru: В "Увернись от Крипов" мы использовали управление с клавиатуры для перемещения игрока. Это хорошо, если ваша игра для PC, но на телефоне или планшете требуется поддержка сенсорного ввода. Поскольку событие щелчка мыши может обрабатываться так же, как сенсорное событие, мы переведем игру на стиль ввода click-and-move (клик и перемещение).

source: By default, Godot emulates mouse input from touch input. That means that if anything is coded to happen on a mouse event, touch will trigger it as well. Godot can also emulate touch input from mouse clicks, which we will need to be able to keep playing our game on our computer after we switch to touch input.
ru: По умолчанию Godot эмулирует ввод мыши с сенсорного ввода. Это означает что все, что запрограммировано случаться по событию мыши, также будет реагировать и при события сенсорного ввода. Godot также может эмулировать сенсорный ввод из щелчков мыши, что позволяет нам продолжать играть в нашу игру на компьютере после перехода на сенсорный ввод.

source: In **Project > Project Settings**, under **Input Devices > Pointing**, enable **Emulate Touch From Mouse**.
ru: В **Проект > Настройки проекта**, под **Устройства ввода > Указание**, включите**Эмулировать нажатие из мыши**.

source: We also want to ensure that the game scales consistently on different-sized screens, so in the project settings go to **Display**, then click on **Window**. In the **Stretch** options, set **Mode** to ``2d`` and **Aspect** to ``keep``.
ru: Нам также надо убедиться, что игра будет корректно масштабироваться при разных размерах экрана, поэтому в настройках проекта перейдите в **Display**, затем кликните на **Window**. В разделе **Stretch** измените **Mode** на ``2d`` и **Aspect** на ``keep``.

source: Since we are already in the **Window** settings, we should also set under **Handheld** the **Orientation** to ``portrait``.
ru: Так как мы уже в настройках **Window**, нам также необходимо установить под **Handheld** значение **Orientation** в ``portrait``.

source: Next, we need to modify the ``Player.gd`` script to change the input method. We'll remove the key inputs and make the player move towards a "target" that's set by the touch (or click) event.
fi: Seuraavaksi meidän täytyy muokata ``Player.gd`` skriptiä muuttaaksemme syötemenetelmää. Poistamme näppäimistösyötteet ja laitamme pelaajan liikkumaan kohti "kohdetta", joka asetetaan kosketuksella (tai hiiren näpäytyksellä).
it: Successivamente, è necessario modificare lo script ''Player.gd'' per modificare il metodo di input. Rimuoveremo gli input dei tasti e faremo in modo che il giocatore si sposti verso un "bersaglio" impostato dall'evento touch (o click).
ja: 次に、 ``Player.gd`` スクリプトを変更して、入力メソッドを変更する必要があります。 キー入力を削除し、タッチ(またはクリック)イベントで設定された「ターゲット」にプレイヤーを移動させます。
ko: 다음으로, 우리는 입력 메소드를 변경하기 위해 ``Player.gd`` 스크립트를 수정해야 합니다. 키 입력을 지우고 플레이어가 터치 (나 클릭) 이벤트로 설정된 "타깃"을 향해 움직이도록 합니다.
pt_br: Em seguida, precisamos modificar o script ``Player.gd`` para alterar o método de entrada. Removeremos as entradas principais e faremos com que o jogador se mova em direção a um "alvo" definido pelo evento de toque (ou clique).
ru: Далее, нужно модифицировать скрипт ``Player.gd``, чтобы изменить метод ввода. Уберем клавишное управление и сделаем так, чтобы игрок двигался к цели ("target"), которая задается событием нажатия по экрану (или клика мыши).
zh_cn: 接下来，我们需要修改 ``Player.gd`` 脚本来改变输入方式。我们将移除键盘输入并使 ``Player`` 移动到触摸（或点击）事件设置的 ``目标``。

source: Here is the full script for the player, with comments noting what we've changed:
fi: Tässä koko skripti pelaajalle, muutokset kommenteihin merkittynä:
it: Ecco lo script completo per il giocatore, con i commenti che indicano i cambiamenti effettuati
ja: プレイヤーの完全なスクリプトを以下に示します。変更点はコメントに記載されています。
ko: 여기 플레이어를 위한 전체 스크립트가 있습니다, 변경한 점에는 코멘트가 있습니다:
pt_br: Aqui está o script completo para o jogador, com comentários observando o que mudamos:
ru: Вот полный скрипт для игрока, с комментариями, которые мы изменили:
zh_cn: 这是 ``Player`` 的完整脚本，注释指出了我们做了哪些改变：

source: Setting a main scene
ja: メイン シーンの設定
pt_br: Definindo uma cena principal
ru: Настройка главной сцены
zh_cn: 设置主场景

source: The main scene is the one that your game will start in. For this *Dodge the Creeps* example, in **Project -> Project Settings -> Application -> Run**, set **Main Scene** to ``Main.tscn`` by clicking the folder icon and selecting it.
ru: Главная сцена - это то, где начинается ваша игра. Для примера "Уклонись от Крипов", в **Проект -> Настройки проекта -> Application -> Run** измените **Main Scene** на "Main.tscn", кликнув по иконке папки и выбрав её.

source: Export templates
fi: Vientimallit
it: Modelli di esportazione
ja: テンプレートのエクスポート
ko: 템플릿 내보내기
pt_br: Exportar modelos
ru: Экспорт шаблонов
zh_cn: 导出模板

source: To export the project, you need to download the *export templates* from the http://godotengine.org/download. These templates are optimized versions of the engine without the editor pre-compiled for each platform. You can also download them in Godot by clicking on **Editor -> Manage Export Templates**:
ru: Чтобы экспортировать проект, вам потребуется скачать **шаблоны экспорта** из http://godotengine.org/download. Эти шаблоны представляют собой оптимизированные версии движка без редактора, предварительно скомпилированного для каждой платформы. Вы также можете скачать их в самом Godot, кликнув на **Редактор -> Управление шаблонами экспорта**:

source: If you've downloaded Godot from `Steam <https://store.steampowered.com/app/404790/Godot_Engine/>`__, export templates are already included. Therefore, you don't need to download them using the **Manage Export Templates** dialog.
ru: Если вы загрузили Godot из Steam <https://store.steampowered.com/app/404790/Godot_Engine/> `__, шаблоны экспорта уже включены. Следовательно, вам не нужно загружать их с помощью диалогового окна ** Управление шаблонами экспорта **.

source: In the window that appears, you can click **Download** to get the template version that matches your version of Godot.
ru: В окне, которое откроется, вы сможете нажать **Загрузка** и получить версию шаблона, соответствующую вашей версии Godot.

source: Export templates are bound to a specific Godot version. If you upgrade Godot, you must download templates that match the new version.
ru: Шаблоны экспорта привязаны к определенной версии Godot. Если вы обновляете Godot, вы должны загрузить шаблоны, соответствующие новой версии.

source: Export presets
fi: Viennin esiasetukset
it: Export presets (Profili di esportazione)
ja: プリセットのエクスポート
ko: 프리셋 내보내기
pt_br: Predefinições de Exportação
ru: Экспорт предустановок
zh_cn: 导出预设

source: Next, you can configure the export settings by clicking on **Project -> Export**.
ru: Далее, вы можете настроить параметры экспорта, кликнув на **Проект -> Экспортировать**.

source: Create a new export preset by clicking **Add...** and selecting a platform. You can make as many presets as you like with different settings.
ru: Создайте новую предустановку экспорта, нажав на **Добавить...** и выбрав платформу. Вы можете создать сколько угодно предустановок с различными настройками.

source: At the bottom of the window are two buttons. **Export PCK/ZIP** only creates a packed version of your project's data. This doesn't include an executable so the project can't be run on its own.
ru: Внизу окна есть две кнопки. **Экпортировать PCK/Zip** лишь создает упакованную версию данных вашего проекта. Исполняемый файл при этом не включается, поэтому проект не сможет быть запущен самостоятельно.

source: The second button, **Export Project**, creates a complete executable version of your game, such as an ``.apk`` for Android or an ``.exe`` for Windows.
ru: Вторая кнопка, **Экспортировать проект**, создает полную исполняемую версию вашего проекта, например ``.apk`` для Android или ``.exe`` для Windows.

source: In the **Resources** and **Features** tabs, you can customize how the game is exported for each platform. We can leave those settings alone for now.
ru: Во вкладках **Ресурсы** и **Свойства** вы можете настроить экспорт игры для каждой платформы. Эти настройки пока оставим.

source: Exporting by platform
fi: Vienti alustottain
it: Esportazione per piattaforma
ja: プラットフォーム別のエクスポート
ko: 플랫폼 별 내보내기
pt_br: Exportando por plataforma
ru: Экспортирование на платформу
zh_cn: 按平台导出

source: In this section, we'll walk through the process for each platform, including any additional software or requirements you'll need.
fi: Tässä luvussa käymme prosessin läpi kullekin alustalle, sisältäen kaikki tarvitsemasi ylimääräiset ohjelmistot tai edellytykset.
it: In questa sezione, affronteremo il procedimento per ogni piattaforma, includendo eventuale software o requisiti necessari.
ja: このセクションでは、必要な追加のソフトウェアまたは要件を含む、各プラットフォームのプロセスを説明します。
ko: 이 섹션에서, 추가 소프트웨어나 요구 사항과 함께 각 플랫폼의 프로세스를 단계적으로 배울겁니다.
pt_br: Nesta seção, vamos percorrer o processo de cada plataforma, incluindo qualquer software ou requisitos adicionais que você precise.
ru: В данном разделе мы рассмотрим процесс для каждой платформы, включая любое дополнительное программное обеспечение или требования, которые вам понадобятся.
zh_cn: 在本节中，我们将逐步介绍每个平台的流程，包括您需要的任何其他软件或要求。

source: PC (Linux/macOS/Windows)
ru: ПК (Linux/macOS/Windows)

source: Exporting PC platforms works the same across the three supported operating systems. Open the export window and click **Add...** to create the preset(s) you want to make. Then click **Export Project** and choose a name and destination folder. Choose a location *outside* of your project folder.
ru: Экспорт на платформы ПК работает одинаково для трех поддерживаемых операционных систем. Откройте окно экспорта и кликните **Добавить...**, чтобы создать жалаемую предустановку(-и). Затем кликните **Экспортировать проект** и подберите имя и целевую папку. Выберите расположение *снаружи* вашей папки с проектом.

source: Click **Save** and the engine will build the export files.
ru: Кликните **Сохранить**, и движок соберёт экспортируемые файлы.

source: When exporting for macOS, if you export from a macOS computer, you'll end up with a ``.dmg`` file, while using Linux or Windows produces a ``.zip``. In either case, the compressed file contains a macOS ``.app`` that you can double-click and run.
ru: При экспорте для macOS, если вы экспортируете на компьютере с macOS, то вы получите файл ``.dmg``, в то время как при использовании Linux или Windows создается файл ``.zip``. В любом случае сжатый файл содержит в себе ``.app`` macOS'а, который вы можете запустить двойным нажатием.

source: On Windows, if you want your exported executable to have a different icon than the default one, you need to change it manually. See :ref:`doc_changing_application_icon_for_windows`.
ru: На Windows, если вы хотите, чтобы ваш экспортированный исполняемый файл имел иконку отличную от той, что установлена по умолчанию, вам необходимо изменить ее вручную. Смотрите: :ref:`doc_changing_application_icon_for_windows`.

source: Mobile devices come with a wide variety of capabilities. In most cases, Godot's default settings will work, but mobile development is sometimes more art than science, and you may need to do some experimenting and searching for help in order to get everything working.
fi: Mobiililaitteissa on laaja kirjo erilaisia ominaisuuksia. Useimmiten Godotin oletusasetukset kelpaavat, mutta mobiilikehitys on joskus enemmän taidetta kuin tiedettä ja voit joutua tekemään hieman kokeiluja ja etsiä apuja saadaksesi kaiken toimimaan.
it: I dispositivi mobili sono dotati di un'ampia gamma di funzionalità. Nella maggior parte dei casi basteranno le impostazioni predefinite di Godot, ma lo sviluppo mobile a volte è più estroso, quindi potrebbe essere necessario fare tentativi e cercare aiuto per farlo funzionare.
ja: モバイル機器には幅広い性能差があります。ほとんどの場合、Godotのデフォルト設定は有効ですが、しかしモバイル開発は時として科学よりも芸術に近くなるので、すべて完璧に動かすには、多少の試行や人の助けが必要になるかもしれません。
ko: 모바일 기기에는 다양한 기능이 있습니다. 대부분의 경우는, Godot의 기본 설정이 먹히지만, 모바일 개발은 때로는 과학보단 더 예술에 가깝습니다, 그리고 모든 것이 작동시키기 위해 도움을 청하고 몇 가지 실험을 하게 될지도 모릅니다.
pt_br: Os dispositivos móveis vêm com uma ampla variedade de recursos. Na maioria dos casos, as configurações padrão do Godot funcionarão, mas o desenvolvimento móvel às vezes é mais arte do que ciência, e você pode precisar fazer algumas experiências e procurar ajuda para fazer tudo funcionar.
ru: Мобильные устройства обладают широким спектром возможностей. В большинстве случаев настойки Godot по умолчанию будут работать, однако временами мобильная разработка - это скорее искусство, чем наука, и вам, вероятно, придется экспериментировать и искать помощи для того, чтобы все заработало.
zh_cn: 移动设备具有各种各样的功能。在大多数情况下，Godot的默认设置是可以工作的，但是移动开发有时更多的是艺术而不是科学，您可能需要做一些试验和寻找帮助，以使一切工作正常。

source: Before you can export your project for Android, you must download the following software:
fi: Ennen kuin voit viedä projektisi Androidille, sinun täytyy ladata seuraavat ohjelmistot:
it: Prima di poter esportare il progetto per Android, è necessario scaricare il seguente software:
ja: Androidへエクスポートできるようにするには、下記のソフトウェアをダウンロードする必要があります。
ko: Android에 내보내기 전에, 다음의 소프트웨어를 다운받으셔야 합니다:
pt_br: Antes de exportar seu projeto para Android, você deve fazer o download do seguinte software:
ru: Прежде чем вы сможете экспортировать свой проект на Android, вы должны загрузить следующее программное обеспечение:
zh_cn: 必须先下载以下软件，然后才能导出Android项目：

source: Open JDK (**version 8 is required**, more recent versions won't work): https://adoptopenjdk.net/index.html
ru: Open JDK (**требуется версия 8**, более поздние версии не будут работать): https://adoptopenjdk.net/index.html

source: When you run Android Studio for the first time, click on **Configure -> SDK Manager** and install **Android SDK Platform Tools**. This installs the ``adb`` command-line tool that Godot uses to communicate with your device.
ru: При первом запуске Android Studio щелкните на **Настройки -> SDK Manager** и установите **Android SDK Platform Tools**. Это установит ``adb`` инструментарий командной строки, который Godot использует для взаимодействия с вашим устройством.

source: Next, create a debug keystore by running the following command on your system's command line:
fi: Seuraavaksi, luo debug keystore suorittamalla seuraava komento järjestelmäsi komentorivillä:
it: Successivamente, creare un keystore di debug eseguendo il seguente comando sulla riga di comando del sistema:
ja: 次は、デバッグ用キーストア(keystore) を生成する下記のコマンドを、コマンドラインから実行してください:
ko: 다음으로, 시스템의 명령줄에 다음의 명령을 실행시켜 debug keystore를 만드세요:
pt_br: Em seguida, crie um keystore de depuração executando o seguinte comando na linha de comandos do seu sistema:
ru: Далее создайте хранилище ключей для отладки, выполнив следующую команду в консоли вашей системы:
zh_cn: 接下来，通过在系统的命令行上运行以下命令来创建调试密钥库：

source: Click on *Editor -> Editor Settings* in Godot and select the *Export/Android* section. Here, you need to set the paths to the Android SDK applications on your system and the location of the keystore you just created.
fi: Napsauta Godotissa *Editori -> Editorin asetukset* ja valitse *Export/Android* osio. Sinun täytyy asettaa tähän polut järjestelmäsi Android SDK -sovelluksiin ja juuri luomasi keystoren sijaintiin.
it: Clicca su *Editor -> Impostazioni Editor* in Godot e seleziona la sezione *Esporta/Android*. Qui è necessario impostare i percorsi delle applicazioni SDK Android sul sistema e la posizione del keystore appena creato.
ja: Godotの「エディタ → エディタ設定」をクリックし、一覧から「Export / Android」を選択してください。ここでadb (Android SDK)、jarsigner (Java SDK)、および作成したキーストアへのパスを指定します。
ko: Godot에서 *편집기 -> 편집기 설정* 으로 가서 *Export/Android*섹션을 선택합니다. 여기에서, 당신은 Android SDK 응용 프로그램의 위치와 당신이 방금 만든 키 저장소의 위치를 설정해줘야 합니다.
pt_br: Clique em *Editor -> Configurações do Editor* no Godot e selecione a seção *Export / Android*. Aqui, você precisa definir os caminhos para os aplicativos do Android SDK em seu sistema e o local do keystore que você acabou de criar.
ru: Нажмите на *Редактор -> Настройки редактора* в Godot и выберите раздел *Export/Android*. Здесь вам нужно установить пути к приложениям Android SDK на вашей системе и расположение хранилища ключей, который вы только что создали.
zh_cn: 单击Godot中的 *编辑器 -> 编辑器设置*，然后选择 *导出/Android* 部分。在这里，您需要设置系统上Android SDK应用程序的路径以及刚刚创建的密钥库的位置。

source: Now you're ready to export. Click on **Project -> Export** and add a preset for Android (see above). Select the newly added Android preset. Under **Options**, go to **Screen** and set **Orientation** to **Portrait**. If your game is in landscape mode (i.e. the window width in pixels is greater than the window height), leave this on **Landscape**.
ru: Теперь вы готовы экспортировать. Нажмите на **Проект -> Экспортировать...** и добавьте предустановку для Android (см. выше). Выберете недавно добавленную предустановку Android. В **Параметры** перейдите к **Screen** и установите **Orientation** на **Portrait**. Если ваша игра в ландшафтном режиме(т.е. ширина окна в пикселях больше высоты), оставьте ее на **Landscape**.

source: Click the **Export Project** button and Godot will build an APK you can download on your device. To do this on the command line, use the following:
ru: Нажмите кнопку **Экспортировать проект**, и Godot соберет файл APK, который вы сможете загрузить на своё устройство. Чтобы сделать это с помощью консоли, выполните следующую команду:

source: Your device may need to be in *developer mode*. Consult your device's documentation for details.
fi: Voi olla, että laitteesi tarvitsee olla *kehitystilassa* (*developer mode*). Katso tarkemmat tiedot laitteesi dokumentaatiosta.
it: Potrebbe essere necessario che il dispositivo sia in *modalità sviluppatore*. Consultare la documentazione del dispositivo per i dettagli.
ja: デバイスを\ *デベロッパー・モード*\ にする必要があるかもしれません。デバイスのドキュメンテーションを参照してください。
ko: 당신의 기기가 *개발자 모드* 이어야 합니다. 자세한 내용은 장치 설명서를 참고하세요.
pt_br: Seu dispositivo pode precisar estar no *modo de desenvolvedor*. Consulte a documentação do seu dispositivo para detalhes.
ru: Вашему устройству может потребоваться нахождение в "режиме разработчика". Обратитесь к документации устройства для получения более подробной информации.
zh_cn: 我们的设备可能需要处于 *开发者模式*。有关详细信息，请查阅设备的文档。

source: If your system supports it, connecting a compatible Android device will cause a **One-click Deploy** button to appear in Godot's playtest button area:
ru: Если ваша система поддерживает это, подключение совместимого Android-устройства вызовет появление кнопки **Развертывание в один клик** в области кнопок игрового тестирования Godot:

source: Clicking this button builds the APK and copies it onto your device in one step.
fi: Tämän painikkeen napsauttaminen muodostaa APK:n ja kopioi sen laitteellesi yhdellä kertaa.
it: Facendo clic su questo pulsante si crea l'APK e lo copia sul dispositivo in un unico passaggio.
ja: このボタンをクリックすると、一度にAPKがビルドされてあなたのデバイスにコピーされます。
ko: 이 버튼을 누르면 APK를 만들고 당신의 기기로 복사됩니다.
pt_br: Clicar neste botão cria o APK e o copia para o seu dispositivo em uma única etapa.
ru: Нажатие на эту кнопку собирает APK и копирует его на ваше устройство в один шаг.
zh_cn: 点击此按钮可一步完成构建APK，并将其复制到您的设备上。

source: To build your game for iOS, you must have a computer running macOS with Xcode installed.
ru: Чтобы собрать игру для iOS, вы должны иметь компьютер с операционной системой MacOS с установленным Xcode.

source: Before exporting, there are some settings that you *must* complete for the project to export successfully. First, the **App Store Team Id**, which you can find by logging in to your Apple developer account and looking in the **Membership** section.
ru: Перед экспортом вы *должны* выполнить некоторые настройки для успешного экспорта проекта. В первую очередь это касается **App Store Team Id**, который вы можете найти, войдя в вашу учетную запись разработчика Apple и посмотреть в разделе **Membership**.
