Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/exporting.po
Languages: fi, it, ja, ko, pt_br, ru, zh_cn

source: On Windows, if you want your exported executable to have a different icon than the default one, you need to change it manually. See: :ref:`doc_changing_application_icon_for_windows`.
fi: Jos haluat, että viedyn suoritettavan tiedoston kuvake poikkeaa oletuskuvakkeesta Windowsilla, sinun täytyy vaihtaa se käsin. Katso: :ref:`doc_changing_application_icon_for_windows`.
it: In Windows, se si desidera che l'eseguibile esportato abbia un'icona diversa da quella predefinita, è necessario modificarla manualmente. Vedere: :ref:`doc_changing_application_icon_for_windows`.
ja: Windows上では、エクスポートされた実行ファイルのアイコンをデフォルトから変えたい場合、手動で変更する必要があります。\ :ref:`doc_changing_application_icon_for_windows`\ を参照してください。
ko: Windows에서, 당신이 내보낸 실행 파일이 기존과 다른 아이콘을 갖도록 하고 싶다면, 수동으로 교체해야합니다. 여기를 참고하세요: :ref:`doc_changing_application_icon_for_windows`.
pt_br: No Windows, se você deseja que o executável exportado tenha um ícone diferente do padrão, será necessário alterá-lo manualmente. Veja:: ref: `doc_changing_application_icon_for_windows`.
zh_cn: 在Windows上，如果希望导出的可执行文件的图标与默认图标不同，则需要手动更改它。请参阅： :ref:`doc_changing_application_icon_for_windows`。

source: Open JDK(version 8 is required, more recent versions won't work): https://adoptopenjdk.net/index.html
pt_br: Open JDK(A versão 8 é necessária, versões mais recentes não funcionarão): https://adoptopenjdk.net/index.html

source: When you run Android Studio for the first time, click on *Configure -> SDK Manager* and install "Android SDK Platform Tools". This installs the `adb` command-line tool that Godot uses to communicate with your device.
fi: Kun käynnistät Android Studion ensimmäisen kerran, napsauta *Configure -> SDK Manager* ja asenna "Android SDK Platform Tools". Tämä asentaa `adb` komentorivityökalun, jota Godot käyttää keskustellakseen laitteesi kanssa.
it: Quando si esegue Android Studio per la prima volta, fare clic su *Configura -> SDK Manager* e installare "Android SDK Platform Tools". Questo installa lo strumento a riga di comando `adb` che Godot usa per comunicare con il vostro dispositivo.
ja: Android Studioを最初に起動したときは、\ *Configure -> SDK Manager* をクリックして"Android SDK Platform Tools"をインストールしてください。これにより、Godotがデバイスと通信するのに使うコマンドラインツール `adb` がインストールされます。
ko: Android 스튜디오를 처음 실행하신다면, *Configure -> SDK Manager* 를 클릭하고 "Android SDK Platform Tools" 을 실행하세요. 이것은 Godot가 장치와 통신하도록 만드는 `adb` 명령줄 도구를 실행시킵니다.
pt_br: Quando você executar o Android Studio pela primeira vez, clique em *Configure -> SDK Manager* e instale "Android SDK Platform Tools". Isso instala a ferramenta de linha de comando `adb` que o Godot usa para se comunicar com o seu dispositivo.
zh_cn: 首次运行Android Studio时，点击 *配置-> SDK Manager* 并安装 ``Android SDK平台工具``。这将安装Godot用来与您的设备通信的 ``adb`` 命令行工具。

source: Now you're ready to export. Click on *Project -> Export* and add a preset for Android (see above). Select the Android Presets and under *Options* go to *Screen* and set *Orientation* to "Portrait".
ja: これで、エクスポートする準備ができました。\ *プロジェクト -> エクスポート* をクリックし、Android用のプリセットを追加します(上記を参照)。 Androidプリセットを選択し、\ *オプション* で *Screen* に移動し、\ *Orientation* を"Portrait"に設定します。
pt_br: Agora você está pronto para exportar. Clique em *Projeto -> Exportar* e adicione uma predefinição para Android (veja acima). Selecione as predefinições para Android e em *Opções* vá para *Screen* e mude *Orientation* para "Portrait".
zh_cn: 现在您可以开始导出了。点击 *项目 -> 导出*，并添加Android的预设（请参见上文）。

source: Click the "Export Project" button and Godot will build an APK you can download on your device. To do this on the command line, use the following:
fi: Napsauta "Vie projekti" painiketta ja Godot koostaa APK:n, jonka voit ladata laitteellesi. Tehdäksesi tämän komentoriviltä, käytä seuraavaa:
it: Clicca sul pulsante "Export Project" e Godot costruirà un APK che potrai scaricare sul tuo dispositivo. Per farlo sulla riga di comando, utilizzare quanto segue:
ja: 「プロジェクトのエクスポート」ボタンをクリックすると、Godotはデバイスに送信できるAPKをビルドします。コマンドラインでするには、下記のように実行してください:
ko: "프로젝트 내보내기" 버튼을 클릭하면 Godot가 APK를 만들고 휴대용 기기에 다운로드 할 수 있게 됩니다. 명령줄에서 하려면, 이것을 사용하세요:
pt_br: Clique no botão "Exportar Projeto" e o Godot criará um APK que você pode baixar no seu dispositivo. Para fazer isso na linha de comando, use o seguinte:
zh_cn: 点击 ``导出项目`` 按钮，Godot将生成一个APK，您可以下载该APK到设备上。为此，请在命令行中使用以下命令：

source: If your system supports it, connecting a compatible Android device will cause a "One-click Deploy" button to appear in Godot's playtest button area:
fi: Jos järjestelmäsi tukee sitä, Godotin pelitestauspainikkeiden alueelle ilmestyy "One-click Deploy" painike, kun yhdistät yhteensopivan Android-laitteen:
it: Se il vostro sistema lo supporta, il collegamento di un dispositivo Android compatibile farà apparire il pulsante "One-click Deploy" nell'area del pulsante playtest di Godot:
ja: システムが対応している場合、互換性のあるAndroidデバイスを接続すると、Godotのテストプレイ用ボタンの場所に「ワンクリック・デプロイ」ボタンが現れます。
ko: 시스템이 지원한다면, Godot의 실행 버튼 영역에 "원 클릭 배포" 버튼이 표시되어 호환 가능한 Android 기기와 연결합니다:
pt_br: Se o seu sistema for compatível, a conexão de um dispositivo Android compatível fará com que um botão "Implantação com um clique" apareça na área de botões de teste de jogo (playtest) do Godot:
zh_cn: 如果您的系统支持，则连接兼容的Android设备将在Godot的测试按钮区域中显示 ``一键部署`` 按钮：

source: In order to build your game for iOS, you must have a computer running macOS with Xcode installed.
fi: Kääntääksesi pelisi iOS:lle, sinulla täytyy olla MacOS-tietokone, jossa on asennettuna Xcode.
it: Per costruire il tuo gioco per iOS, devi avere un computer che esegue macOS con Xcode installato.
ja: ゲームをiOS用にビルドするには、XcodeがインストールされたmacOSの走るコンピュータが必要になります。
ko: iOS에 게임이 돌아가게 하고 싶다면, 당신은 macOS와 Xcode가 실행되는 컴퓨터를 갖고 있어야 합니다.
pt_br: Para compilar seu jogo para iOS, você deve ter um computador executando o MacOS com o Xcode instalado.
zh_cn: 为了构建适用于iOS的游戏，您必须有一台运行MacOS且安装了Xcode的计算机。

source: Before exporting, there are some settings that you *must* complete for the project to export successfully. First, the "App Store Team Id", which you can find by logging in to your Apple developer account and looking in the "Membership" section.
fi: Ennen vientiä, sinun *täytyy* asettaa joitakin asetuksia, jotta projektin vienti onnistuisi. Ensin, "App Store Team Id", jonka löydä kirjautumalla sisään omalle Apple-kehittäjätunnuksellesi ja katsomalla "Membership"-osiota.
it: Prima dell'esportazione, è necessario completare alcune impostazioni per la corretta esportazione del progetto. In primo luogo, ''l'Id team dell'App Store", che puoi trovare accedendo al tuo account sviluppatore Apple e cercando nella sezione "Appartenenza".
ja: エクスポートする前に、\ *必ず*\ しなければならないプロジェクト設定がいくつかあります。一つ目に必要なのは『App Store Team ID』で、Appleデベロッパー・アカウントにログインしてから『メンバーシップ』のセクションを探すとあります。
ko: 내보내기 전에, 성공적으로 프로젝트를 내보내기 위해 당신이 *반드시* 해야할 몇 가지 사항이 있습니다. 먼저, "앱스토어 Team Id" 입니다, 이것은 당신이 애플 개발자 계정에 로그인 한 후 "멤버십" 섹션에서 볼 수 있습니다.
pt_br: Antes de exportar, existem algumas configurações que você *deve* concluir para o projeto exportar com êxito. Primeiro, o "App Store Team Id", que você pode encontrar fazendo login na sua conta de desenvolvedor da Apple e procurando na seção "Membership".
zh_cn: 在导出之前，您 *必须* 完成一些设置才能成功导出项目。首先是 ``苹果商店团队Id``，您可以登录到您的苹果开发者账户并在 ``会员`` 一栏中找到它。

source: Click "Export Project" and select a destination folder.
fi: Napsauta "Vie projekti" ja valitse kohdekansio.
it: Fare clic su "Esporta progetto" e selezionare una cartella di destinazione.
ja: 「プロジェクトのエクスポート」をクリックして、エクスポート先のフォルダを選択します。
ko: "프로젝트 내보내기"를 누르고 대상 폴더를 선택하세요.
pt_br: Clique em "Exportar Projeto" e selecione uma pasta de destino.
zh_cn: 点击 ``导出项目`` 并选择目标文件夹。

source: You can now open the project in Xcode and build the project for iOS. Xcode build procedure is beyond the scope of this tutorial. See https://help.apple.com/xcode/mac/current/#/devc8c2a6be1 for more information.
fi: Voit nyt avata projektisi Xcodessa ja kääntää projektin iOS:lle. Xcoden kääntämiseen liittyvät toimenpiteet eivät kuulu tämän oppaan piiriin. Katso https://help.apple.com/xcode/mac/current/#/devc8c2a6be1 lisätietoja varten.
it: Ora è possibile aprire il progetto in Xcode e costruire il progetto per iOS. La procedura di compilazione di Xcode va oltre lo scopo di questo tutorial. Visionare https://help.apple.com/xcode/mac/current/#/devc8c2a6be1 per ulteriori informazioni.
ja: このプロジェクトをXcodeで開いて、iOS向けにビルドします。Xcodeのビルド手順についてはこのチュートリアルの範疇を超えるので、https://help.apple.com/xcode/mac/current/#/devc8c2a6be1 を参考にしてください(英語)。
ko: 당신은 이제 프로젝트를 Xcode에서 열 수 있고 iOS로 프로젝트를 만들 수 있습니다. Xcode 개발 순서는 이 튜토리얼에 해당하지 않습니다. 자세한 것은 https://help.apple.com/xcode/mac/current/#/devc8c2a6be1 를 참고하세요.
pt_br: Agora você pode abrir o projeto no Xcode e criar o projeto para iOS. O procedimento de compilação do Xcode está além do escopo deste tutorial. Consulte https://help.apple.com/xcode/mac/current/#/devc8c2a6be1 para mais informações.
zh_cn: 现在，您可以在Xcode中打开项目并为iOS构建项目。Xcode的构建过程超出了本教程的范围。有关更多信息，请参见 `这里 <https://help.apple.com/xcode/mac/current/#/devc8c2a6be1>`__。

source: Click "Export Project" on the HTML5 preset. We don't need to change any of the default settings.
fi: Napsauta "Vie projekti" HTML5-esiasetuksissa. Meidän ei tarvitse muuttaa mitään oletusasetuksista.
it: Fare clic su "Esporta progetto" sul preset HTML5. Non è necessario modificare le impostazioni predefinite.
ja: HTML5のプリセットにて「プロジェクトのエクスポート」をクリックします。設定はデフォルトから変える必要はありません。
ko: HTML5 프리셋으로 "프로젝트 내보내기"를 클릭하세요. 기본 설정에서 바꿀 필요가 없습니다.
pt_br: Clique em "Exportar Projeto" na predefinição HTML5. Não precisamos alterar nenhuma das configurações padrão.
zh_cn: 点击HTML5预置中的 ``导出项目``。我们不需要更改任何默认设置。

source: Viewing the `.html` file in your browser lets you play the game. However, you can't open the file directly, it needs to be served by a web server. If you don't have one set up on your computer, you can search online to find suggestions for your specific OS.
ja: `.html` ファイルをブラウザーで見るとゲームをプレイできます。しかし、このファイルを直接開くことはできないので、ウェブサーバー上に置く必要があります。もし用意していないのであれば、お使いのOSに適したセットアップ法をオンラインで検索してみてください。
pt_br: Visualizar o arquivo `.html` no seu navegador permite que você abra o jogo. No entanto, você não pode abrir o arquivo diretamente, é necessário que ele seja disponibilizado por um servidor web. Se você não tiver um em seu computador, pesquise na internet sugestões para seu sistema operacional específico.
zh_cn: 在浏览器中查看 ``.html`` 文件可以让您玩游戏。但是，您无法直接打开文件，它需要由Web服务器提供。如果您的计算机上还没有设置一个，则可以在线搜索以查找有关特定操作系统的建议。

source: Point your browser at the URL where you've placed the html file. You may have to wait a few moments while the game loads before you see the start screen.
fi: Syötä selaimeesi URL siihen kohteeseen, jonne sijoitit html-tiedoston. Voit joutua odottamaan hetken pelin latautumista, ennen kuin näet aloitusruudun.
it: Usa il tuo browser per aprire l'indirizzo URL del file html. Il caricamento potrebbe impiegare qualche secondo prima di mostrare la schermata d'avvio.
ja: htmlファイルを置いた場所のURLをブラウザで開いてみてください。ゲームがロードされてスタートスクリーンが表示されるまで、しばらくかかるかもしれません。
ko: URL에 html 파일을 올릴 브라우저를 향하게 하세요. 게임 시작 화면을 보기 전에 잠시 기다려야 할지도 모릅니다.
pt_br: Aponte seu navegador para a URL onde você colocou o arquivo html. Você pode ter que esperar alguns momentos enquanto o jogo carrega antes de ver a tela inicial.
zh_cn: 将浏览器指向放置html文件的URL。在载入游戏之前，您可能需要等待片刻，然后才能看到开始屏幕。

source: The console window beneath the game tells you if anything goes wrong. You can disable it by setting "Export With Debug" off when you export the project.
fi: Pelin alapuolella oleva konsoli-ikkuna kertoo sinulle, jos jokin meni vikaan. Voit kytkeä sen pois päältä asettamalla "Vie debugaten" off-asentoon, kun viet projektisi.
it: La finestra della console sotto il gioco ti dice se qualcosa va storto. È possibile disabilitarla impostando "Esporta con debug" su off quando si esporta il progetto.
ja: 下にあるコンソール・ウィンドウは、なにか問題があればそれを知らせてくれます。プロジェクトのエクスポート時に「デバッグ付きエクスポート」のチェックを外すと、無効にできます。
ko: 게임 아래 콘솔 창은 게임이 잘못됬는가를 말해줍니다. 프로젝트를 내보낼 때 "Export With Debug"를 꺼서 이것을 없앨 수 있습니다.
pt_br: A janela do console abaixo do jogo informa se algo está errado. Você pode desativá-la configurando "Exportar Com Depuração" quando exportar o projeto.
zh_cn: 游戏下方的控制台窗口会告诉您是否出了问题。您可以通过在导出项目时将 ``使用调试导出`` 关闭来禁用它。

source: While WASM is supported in all major browsers, it is still an emerging technology and you may find some things that don't work. Make sure you have updated your browser to the most recent version, and report any bugs you find at the `Godot GitHub repository <https://github.com/godotengine/godot/issues>`_.
pt_br: Apesar de WASM ter suporte na maioria dos navegadores, ainda é uma tecnologia emergente e você pode encontrar algumas coisas que ainda não funcionam. Certifique-se de ter atualizado seu navegador para a versão mais recente, e relate quaisquer erros que você encontrar no repositório do `Godot no Github <https://github.com/godotengine/godot/issues>`_.

source: HTML5 (web)
fi: HTML5 (verkko)
ja: HTML5 (ウェブ)
ko: HTML5 (웹)
zh_cn: HTML5 （网页）

source: By default Godot emulates mouse input from touch input. That means if anything is coded to happen on a mouse event, touch will trigger it as well. If you wish to disable that for whatever reason, or emulate touch from mouse input, you can do that in the "Project Settings" under *Input Devices* and *Pointing*
ko: 기본적으로 Godot는 터치 입력에서 마우스 입력을 에뮬레이트합니다. 즉, 마우스 이벤트로 발생하도록 코딩된 것을, 터치로도 조작할 수 있습니다. 어떤 이유로든지 그것을 비활성화하거나, 마우스 입력에서 터치를 에뮬레이트하고 싶다면, "프로젝트 설정"에서 *Input Devices*\ 와 *Pointing*\ 으로 할 수 있습니다

source: Before we change the input method, in the project settings go to *Display*, then click on *Window*. In the *Stretch* options, set *Mode* to "2d" and *Aspect* to "keep". This ensures that the game scales consistently on different sized screens.
ko: 입력 방식을 바꾸기 전에, 프로젝트 설정에서 *Display*\ 로 갑니다, 그리고 *Window*\ 를 클릭합니다. *Stretch* 옵션에서, *Mode*\ 를 "2d"로 설정하고 *Aspect*\ 를 "keep"으로 설정합니다. 이걸로 다른 크기의 화면에서도 게임은 일정하게 유지됩니다.

source: Next, you can configure the export settings by clicking on *Project -> Export*:
ko: 다음은, *프로젝트 -> 내보내기* 로 내보내기 설정을 구성할 수 있습니다:

source: Java JDK: http://www.oracle.com/technetwork/java/javase/downloads/index.html
ko: 자바 JDK: http://www.oracle.com/technetwork/java/javase/downloads/index.html

source: Now you're ready to export. Click on *Project -> Export* and add a preset for Android (see above).
ko: 이제 만들 준비가 됬습니다. *프로젝트 -> 내보내기* 를 누르고 (위에서 본) Android의 프리셋을 추가하세요.

source: Viewing the `.html` file in your browser lets you play the game. However, you can't open the file directly, it needs to be served by a web server. If you don't have one set up on your computer, you can use Google to find suggestions for your specific OS.
ko: 브라우저에 `.html` 파일을 열면 게임을 할 수 있습니다. 하지만 바로 파일을 열 수는 없습니다, 그것은 웹 서버에 의해 제공되어야 합니다. 당신의 컴퓨터에 웹서버가 없으면, 구글 검색을 하여 특정 OS에서 웹서버를 설치하는 방법을 찾으실 수 있습니다.

source: Browser support for WASM is not very widespread. Firefox and Chrome both support it, but you may still find some things that don't work. Make sure you have updated your browser to the most recent version, and report any bugs you find at the `Godot Github repository <https://github.com/godotengine/godot/issues>`_.
ko: WASM 에 대한 브라우저 지원은 아직 확산되지 않았습니다. 파이어폭스와 크롬은 둘다 WASM을 지원하지만, 여전히 작동하지 않는 점들을 볼 수도 있습니다. 브라우저를 최신 버전으로 업데이트하고, `Godot Github repository <https://github.com/godotengine/godot/issues>`_ 에 발견한 버그를 신고해주세요.
