Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/filesystem.po
Languages: fr, ko, zh_cn

source: File system
fr: Système de fichiers
ko: 파일 시스템(File system)
zh_cn: 文件系统

source: Introduction
ko: 소개
zh_cn: 简介

source: File systems are yet another hot topic in engine development. The file system manages how the assets are stored and how they are accessed. A well-designed file system also allows multiple developers to edit the same source files and assets while collaborating.
fr: Le système de fichier est également un des sujets importants du développement du moteur. Le système de fichier gère la façon dont les assets sont stockés et comment elles sont accessibles. Un système bien conçu permet à plusieurs développeurs d'éditer les mêmes fichiers et assets lorsqu'ils collaborent ensembles.
ko: 파일 시스템은 하지만 엔진 개발에 있어 또 다른 주요 주제입니다. 파일 시스템은 어떻게 에셋이 저장되고 액세스 되는 지를 관리합니다. 잘 설계된 파일 시스템은 여러 개발자들에게도 또한 서로 협력하면서 같은 소스 파일과 에셋을 편집할 수 있게 합니다.
zh_cn: 文件系统也是游戏引擎开发的热门话题之一。文件系统掌管着资源(assets)的存取。一个好的文件系统能让团队中的成员们共同编辑相同的源文件和资源。

source: Initial versions of the Godot engine (and previous iterations before it was named Godot) used a database. Assets were stored in it and assigned an ID. Other approaches were tried as well, such as local databases, files with metadata, etc. In the end, the simple approach won and now Godot stores all assets as files in the file system.
fr: La version initiale du moteur de Godot (avant qu'il soit appelé Godot) utilisait une base de donnée. Le assets étaient stockés dedans et assigné à un identifiant (ID). D'autres approches ont été essayées, comme des bases de données locales, des fichiers avec des métadonnées, etc. L'approche la plus simple l'a remporté et maintenant Godot stock ses assets sous formes de fichier dans le système de fichier.
ko: Godot 엔진의 초기 버전에는 (그리고 아직 Godot라는 이름이 붙기 전) 데이터베이스를 사용했습니다. 에셋은 그곳에 있었고 ID가 지정되었습니다. 다른 접근도 시도해보았습니다, 지역 데이터베이스나, 메타데이터가 있는 파일 등등을 말이죠. 결국 간단한 접근법을 얻게 되었고 지금 Godot는 모든 에셋을 파일 시스템에 저장합니다.
zh_cn: Godot在最初版本及以前使用过一个数据库。资源都被分配了ID存储在其中。后来我们也尝试了各种其他方法，例如本地数据库、带元数据的文件等等。但最终，我们选择了将Godot所有的资源存储于文件系统中这一简单途径。

source: Implementation
fr: Implémentation
ko: 구현
zh_cn: 实现

source: The file system stores resources on disk. Anything, from a script, to a scene or a PNG image is a resource to the engine. If a resource contains properties that reference other resources on disk, the paths to those resources are also included. If a resource has sub-resources that are built-in, the resource is saved in a single file together with all the bundled sub-resources. For example, a font resource is often bundled together with the font textures.
fr: Le système de fichier stock ses ressources sur disque. Des scripts aux scènes en passant par les images en PNG sont des ressources pour le moteur. Si une ressource contient des propriétés faisant référence à d'autres ressources sur le disque, le chemin de ces ressources sont également inclus. Si une ressource est constituée d'une sous ressource, elle est sauvegardé en un seul fichier avec toutes ses sous-ressources. Par exemple, une ressource de police est souvent comprise avec une police de caractère.
ko: 파일 시스템은 리소스를 디스크에 저장합니다. 스크립트에서 씬이나 PNG 이미지까지 어떤 것이든, 엔진에게는 리소스 입니다. 리소스가 디스크 내 다른 리소스의 참조를 속성으로 갖고 있다면, 그 리소스로 가는 경로 또한 포함됩니다. 리소스가 내장 하위 리소스를 갖는다면, 그 리소스는 모든 묶인 하위 리소스들과 함께 단일 파일로 저장됩니다. 예를 들어, 폰트 리소스는 종종 폰트 텍스쳐와 묶여집니다.
zh_cn: 文件系统将资源(resources)存储在硬盘上。无论是某一个脚本(script)、还是某一个场景(scene)、抑或是某一张PNG图片，任何东西，对于Godot引擎来说,都是一个资源(resource)。如果一个资源包含着一些指向硬盘上的其他资源的属性(properties)，那么指向那些资源的路径(paths)也同样包含在该资源当中。如果一个资源内建有一些子资源(sub-resources)，那么所有的子资源都会和它一起打包在一个文件当中。

source: In general, the Godot file system avoids using metadata files. The reason for this is simple, existing asset managers and VCSs are simply much better than anything we can implement, so Godot tries its best to play along with SVN, Git, Mercurial, Perforce, etc.
fr: En général, le système de fichier de Godot évite d'utiliser des fichiers de métadonnées. La raison est simple, les gestionnaires d'assets existants et les VCS sont tout simplement bien meilleurs que tout ce que nous pouvons mettre en œuvre, alors Godot essaie de jouer au mieux avec SVN, Git, Mercurial, Perforce, etc.
ko: 일반적으로 Godot 파일 시스템은 메타데이터 파일 사용을 피합니다. 그 이유는 간단합니다, 기존 에셋 관리자와 버전 관리 시스템(VCS)은 우리가 구현할 수 있는 것보다 훨씬 더 뛰어나기 때문에, Godot는 SVN, Git, Mercurial, Perforce 등과 함께 최선을 다합니다.
zh_cn: 总的来讲，Godot的文件系统并未使用元数据文件，理由很简单，现在的各种资产管理系统和版本控制系统都远比我们自己实现的要好得多，所以Godot尽量去参与到SVN, Git, Mercurial, Perforce等当中。

source: Example of a file system contents:
fr: Exemple du contenu d'un système de fichier :
ko: 파일 시스템 내용물 예시:
zh_cn: 举个例子，一个文件系统内有：

source: The project.godot file is the project description file, and it is always found at the root of the project. In fact, its location defines where the root is. This is the first file that Godot looks for when opening a project.
fr: Le fichier project.godot est un fichier de description de projet, et il se trouve toujours à la racine du projet. En faite la localisation définie où la racine se situe. C'est le premier fichier que Godot va regarder quand il ouvre un projet.
ko: project.godot 파일은 프로젝트 설명 파일이고, 항상 프로젝트의 루트에서 찾으실 수 있습니다. 사실 파일 위치가 루트의 위치를 정의합니다. 이 파일은 프로젝트를 열 때 Godot가 제일 먼저 찾는 파일입니다.
zh_cn: 文件project.godot是一个项目描述文件，你总能在当前项目的根目录下找到它。事实上，Godot正是根据它的位置定义当前项目根目录的位置。这正是在你打开某个项目时，Godot最先寻找的文件。

source: This file contains the project configuration in plain text, using the win.ini format. Even an empty project.godot can function as a basic definition of a blank project.
fr: Ce fichier contient la configuration du projet en texte brut sous le format win.ini. Même un fichier project.godot vide peut fonctionner comme une définition basique d'un projet vide.
ko: 이 파일은 프로젝트 설정을 win.ini 형식을 사용해, 일반 텍스트로 갖습니다. 심지어 비어있는 project.godot도 비어있는 프로젝트의 기본 정의 기능을 할 수 있습니다.
zh_cn: 这个文件是一个普通的文本文件，以win.ini的格式写着当前项目的各种配置信息。即使是一个空的project.godot文件也可做为某个空项目的基本定义。

source: Path delimiter
fr: Délimiteur de chemin d'accès (Path delimiter)
ko: 경로 구분 기호
zh_cn: 路径分隔符

source: Godot only supports ``/`` as a path delimiter. This is done for portability reasons. All operating systems support this, even Windows, so a path such as ``c:\project\project.godot`` needs to be typed as ``c:/project/project.godot``.
fr: Godot supporte uniquement ``/`` comment délimiteur de chemin d'accès pour plusieurs raisons. Toutes opérations de système supporte cela, même Windows. Un chemin tel que ``c:\project\project.godot`` doit donc être écrit ``c:/project/project.godot``.
ko: Godot는 오직 ``/`` 만을 경로 구분 기호로 지원합니다. 그 이유는 이식 능력 입니다. 모든 운영 시스템이, 심지어 윈도우까지, 이를 지원하기 때문에, ``c:\project\project.godot`` 같은 경로는 ``c:/project/project.godot`` 와 같은 타입이 되어야 합니다.
zh_cn: Godot只支持用 ``/`` 做路径分隔符。这是为了最求更好的可移植性。所有的操作系统都支持它，就算是Windows，所以像是 ``c:\project\project.godot`` 这种路径，在Godot中必须写作 ``c:/project/project.godot`` 。

source: Resource path
fr: Chemin des ressources (Resource path)
ko: 리소스 경로(Resource path)
zh_cn: 资源路径

source: When accessing resources, using the host OS file system layout can be cumbersome and non-portable. To solve this problem, the special path ``res://`` was created.
fr: Lorsqu'il faut accéder à des ressources, utiliser le système de fichier du système d'exploitation peut être encombrante et non portative. Pour résoudre ce problème, le chemin spécial ``res://`` a été créé.
ko: 리소스를 액세스 할 때, 호스트 OS 파일 시스템 레이아웃을 사용하는 것은 성가시고 휴대성이 떨어질 수 있습니다. 이 문제를 해결하기 위해, ``res://`` 라는 특수 경로가 만들어졌습니다.
zh_cn: 当你需要去取用资源时，使用主机操作系统的文件系统布局可能会又繁琐又导致项目不可移植。为了解决这个问题，我们创建了专有路径 ``res://`` 。

source: The path ``res://`` will always point at the project root (where project.godot is located, so in fact ``res://project.godot`` is always valid).
fr: Le chemin ``res://`` pointera toujours vers la racine du projet (là où project.godot est localisé, alors ``res://project.godot`` est toujours valide).
ko: ``res://`` 경로는 항상 프로젝트 루트를 향할 것입니다 (거기에는 project.godot이 있고, 그래서 사실 ``res://project.godot`` 경로가 항상 있습니다).
zh_cn: 路径``res://``将始终指向项目根(project.godot所在的位置, 因此实际上``res://project.godot``始终有效)。

source: This file system is read-write only when running the project locally from the editor. When exported or when running on different devices (such as phones or consoles, or running from DVD), the file system will become read-only and writing will no longer be permitted.
fr: Le système de fichier est en lecture-écriture uniquement lorsque le projet est lancé localement de l'éditeur. Lorsqu'il est exporté ou lancé sur des appareils différents (comme des téléphones, consoles, ou lancé d'un DVD), le système de fichier passe en lecture seule et l'écriture n'est plus permise.
ko: 파일 시스템은 에디터에서 프로젝트를 로컬로 실행 중일 때만 읽고 씁니다. 내보내질 때나 아니면 다른 기기에서 실행 중일 때 (휴대전화나 콘솔, 혹은 DVD로 실행), 파일 시스템은 읽기만 하고 더 이상 쓰기가 용납되지 않습니다.
zh_cn: 只有在从编辑器本地运行项目时, 此文件系统才是读写的。导出或在不同设备 (如手机或控制台) 上运行时, 文件系统将变为只读, 不再允许写入。

source: User path
fr: Chemin de l'utilisateur (User path)
ko: 사용자 경로(User path)
zh_cn: 用户路径

source: Writing to disk is often still needed for various tasks such as saving game state or downloading content packs. To this end, the engine ensures that there is a special path ``user://`` that is always writable.
fr: Écrire sur le disque est souvent nécessaire lors de diverses tâches comme la sauvegarde d'une partie ou le téléchargement de contenu additionnel. Pour cela, le moteur assure le fait que le chemin spécial ``user://`` est toujours accessible en écriture.
ko: 디스크에 쓰기는 게임 상태를 저장하거나 콘텐츠 팩을 다운로드하는 등의 다양한 작업에 종종 필요합니다. 이를 위해, 엔진은 ``user://`` 라는 항상 쓸 수 있는 경로를 보장합니다.
zh_cn: 对于保存游戏状态或下载内容包等各种任务, 通常仍然需要写入磁盘。为此, 引擎确保有一个始终可写的特殊路径``user://``。

source: Host file system
fr: Système de fichier hôte (Host file system)
ko: 호스트 파일 시스템(Host file system)
zh_cn: 主机文件系统

source: Alternatively host file system paths can also be used, but this is not recommended for a released product as these paths are not guaranteed to work on all platforms. However, using host file system paths can be useful when writing development tools in Godot!
fr: Autrement le système de fichier hôte peut également être utilisé. Cependant ce n'est pas recommandé pour un produit commercialisé car il n'est pas garanti que ces chemins fonctionnent sur toutes les plates-formes. Toutes fois, utiliser un système de fichier hôte peut être utile lors du développement d'outils dans Godot !
ko: 또는 호스트 파일 시스템 경로도 사용될 수 있습니다, 하지만 이것이 모든 플랫폼에서 작동된다는 보장은 없으니 출시된 제품에 이 경로를 쓰는 것을 추천하지는 않습니다. 하지만, 호스트 파일 시스템 경로를 사용하면 Godot에서 개발 도구를 쓸 때 유용할 수 있습니다!
zh_cn: 或者, 也可以使用主机文件系统路径, 但不建议对已发布的产品使用此路径, 因为不能保证这些路径在所有平台上都能正常工作。但是, 在 godot 中编写开发工具时, 使用主机文件系统路径非常有用!

source: Drawbacks
fr: Inconvénients
ko: 단점
zh_cn: 缺点

source: There are some drawbacks to this simple file system design. The first issue is that moving assets around (renaming them or moving them from one path to another inside the project) will break existing references to these assets. These references will have to be re-defined to point at the new asset location.
fr: Il y a quelques inconvénients à ce système de fichier. Le premier problème est lorsqu'il s'agit de tourner autour des assets (les renommer, les bouger d'un endroit à un autre dans le projet), cela va casser la référence existante de ces assets. Ces références devront être redéfinie du point de leur nouvelle position.
ko: 이 간단한 파일 시스템 설계에는 몇 가지 단점이 있습니다. 첫 번째 문제는 에셋의 이동으로 (프로젝트 내에서 이름을 바꾸거나 한 경로를 다른 곳으로 옮기는 등) 이 에셋에 관해 존재하는 참조를 깨버릴 것입니다. 이 참조는 새 에셋 위치를 향하도록 다시 정의해야만 합니다.
zh_cn: 这种简单的文件系统设计有一些缺点。第一个问题是, 移动资产 (重命名它们或将它们从项目内的一个路径移动到另一个路径) 将破坏对这些资产的现有引用。必须重新定义这些引用, 以指向新的资产位置。

source: To avoid this, do all your move, delete and rename operations from within Godot, on the FileSystem dock. Never move assets from outside Godot, or dependencies will have to be fixed manually (Godot detects this and helps you fix them anyway, but why go the hard route?).
fr: Pour éviter ça, faites tous vos changement à l'intérieur de godot, dans l'emplacement du système de fichier. Ne jamais modifier un asset en dehors de Godot, sinon les dépendances devront être effectuées manuellement (Godot détecte ça et vous aides à le faire quand même, mais pourquoi prendre le chemin compliqué ?).
ko: 이를 피하기 위해, Godot에서, 파일 시스템 독 내에서, 위치를 바꾸거나 이름을 바꾸거나 삭제하는 등의 모든 작업을 해야만 합니다. Godot 밖에서 에셋을 움직이지 마세요, 그렇지 않으면 종속 여부를 수동으로 설정해야만 합니다 (Godot는 이를 감지하고 당신이 고치는 것을 어쨌든 도울 것이지만, 왜 어려운 길로 가시나요?).
zh_cn: 若要避免这种情况, 请在文件系统坞站上的Godot内执行所有操作、删除和重命名操作。永远不要从Godot外部移动资产, 否则必须手动修复依赖项(Godot检测到这一点, 并帮助您修复它们, 但为什么要走艰难的路线？)。

source: The second is that, under Windows and macOS, file and path names are case insensitive. If a developer working in a case insensitive host file system saves an asset as "myfile.PNG", but then references it as "myfile.png", it will work fine on their platform, but not on other platforms, such as Linux, Android, etc. This may also apply to exported binaries, which use a compressed package to store all files.
fr: Le second est que sous Windows et macOS, les fichiers et les chemins d'accès ne sont pas sensible à la casse. Si un développeur travaille dans un environnement non sensible à la casse et sauvegarde un asset "monfichier.PNG", mais le référence à "monfichier.png", cela marchera sur sa plateforme, mais pas sur d'autres plateforme tel que Linux, Android, etc. Cela peut également s'appliquer sur les fichiers binaires exportés, qui utilisent un paquet compressé pour stocker tous les fichiers.
ko: 두 번째로 윈도우와 macOS에서는 파일과 경로 이름을 대소문자를 구별하지 않는 것입니다. 대소문자를 구분하지 않는 호스트 파일 시스템이 에셋을 "myfile.PNG"라고 저장하지만, "myfile.png" 로 참조됩니다, 그 플랫폼 내에서는 작동이 잘 될 것입니다, 하지만 리눅스, 안드로이드 등의 플랫폼에서는 작동하지 않습니다. 이는 압축된 패키지로 모든 파일을 저장하는 내보낸 바이너리에도 적용될 수 있습니다.

source: It is recommended that your team clearly define a naming convention for files when working with Godot! One simple fool-proof convention is to only allow lowercase file and path names.
fr: Il est recommandé que votre équipe définisse clairement une convention de nommage pour les fichier quand elle travaille avec Godot ! Une convention simple et infaillible est de n'autoriser que les noms de fichiers et de chemins en minuscules.
ko: Godot로 작업할 때 팀이 명명 규칙을 분명하게 정의하는 것을 추천합니다! 간단히 바보 같은 규칙이라면 파일과 경로 이름을 소문자로만 허락하는 것입니다.

source: The second is that under Windows and macOS file and path names are case insensitive. If a developer working in a case insensitive host file system saves an asset as "myfile.PNG", but then references it as "myfile.png", it will work fine on their platform, but not on other platforms, such as Linux, Android, etc. This may also apply to exported binaries, which use a compressed package to store all files.
zh_cn: 第二种情况是, 在Windows和macOS文件和路径名下不区分大小写。如果在不区分大小写的主机文件系统中工作的开发人员将资产另存为“myfile.PNG”, 但随后将其引用为“myfile.png”, 它将在他们的平台上正常工作, 但在其他平台上不行, 如Linux、Android等。这也可能适用于导出的二进制文件, 这些二进制文件使用压缩包来存储所有文件。

source: It is recommended that your team clearly defines a naming convention for files when working with Godot! One simple fool-proof convention is to only allow lowercase file and path names.
zh_cn: 建议您的团队在使用Godot时明确定义文件的命名约定!一个简单的万无一失的约定是只允许小写文件和路径名。
