Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/godot_design_philosophy.po
Languages: es, fr, it, ja, ko, zh_cn

source: This leads to a reliable and flexible UI system, as it powers the editor itself. With the ``tool`` keyword, you can run any game code in the editor.
es: Esto lleva a un sistema confiable y flexible para UI, ya que lo usa el editor mismo. Con la palabra clave ``tool``, puedes ejecutar cualquier código de juego en el editor.
it: Questo conduce a un sistema d'interfaccia affidabile e flessibile, dato che esso supporta l'editor stesso. Con lo ``strumento`` keyword, puoi eseguire qualsiasi codice di gioco nell'editor.
ja: エディタ自身も使用するために、信頼性のある柔軟なUIシステムを実現しました。\ ``tool`` キーワードを使えば、あらゆるゲーム用コードをエディタ内で実行できます。
ko: 이것은 편집기 자체에 권한을 부여하기 때문에 안정적이고 유연한 UI 시스템을 만듭니다. ``tool`` 키워드로 당신은 편집기에서 어떤 게임 코드도 실행시킬 수 있습니다.
zh_cn: 由于它为编辑器本身提供了动力，因此这导致了可靠且灵活的UI系统。 使用 `` tool`` 关键字，您可以在编辑器中运行任何游戏代码。

source: *RPG in a Box is a voxel RPG editor made with Godot 2. It uses Godot's UI tools for its node-based programming system and for the rest of the interface.*
ja: *Godot 2でつくられたボクセルRPGエディタ『RPG in a Box』。ノードベースのプログラミング・システムおよびユーザーインターフェースに、GodotのUIツールが使われています。*
zh_cn: *RPG in a Box* 是一个用Godot 2制作的RPG体素编辑器。它使用Godot的UI工具来制作其基于节点的编程系统和界面的其余部分。

source: Put the ``tool`` keyword at the top of any GDScript file and it will run in the editor. This lets you import and export plugins, create plugins like custom level editors, or create scripts with the same nodes and API you use in your projects.
es: Coloca la palabra clave ``tool`` al principio de cualquier archivo GDScript y se ejecutará en el editor. Esto le permite importar y exportar plugins, crear plugins como editores de nivel personalizados o crear scripts con los mismos nodos y API que se utilizan en los proyectos.
it: Metti la parola chiave ``tool`` in cima a qualsiasi file GDScript e verrá eseguto nell'editor. Questo ti consente di importare ed esportare plugin, creare plugin come editor di livello personalizzati, o creare script con gli stessi nodi e API che usi nei tuoi progetti.
ja: GDScriptファイルの一番上に ``tool`` キーワードを追加すれば、エディタ内で動かせます。これによりインポートおよびエクスポート用プラグインや、カスタムのレベルエディタ、組み込みノードやAPIのように使えるスクリプトなどが作れます。
ko: ``tool`` 키워드를 GDscript 파일의 맨 위에 놓으면 편집기에서 파일이 실행될 것입니다. 이걸로 당신은 프로젝트에 쓰이는 것과 똑같은 노드와 API를 가지고 플러그인을 내보내거나 가져올 수 있고, 사용자 지정 레벨 편집기 같은 플러그인을 제작하거나, 스크립트를 만들 수 있습니다.
zh_cn: 将 ``tool`` 关键字放在任何GDScript文件的顶部，它将在编辑器中运行。这使您可以导入和导出插件，创建自定义级别编辑器之类的插件，或使用与项目中使用的相同的节点和API来创建脚本。

source: Separate 2D and 3D engines
es: Motores 2D y 3D separados
fr: Moteurs 2D et 3D séparés
it: Motori 2D e 3D separati
ja: 2Dと3Dのエンジンを分割
ko: 2D 와 3D 엔진을 분리함
zh_cn: 独立的2D和3D引擎

source: Godot offers dedicated 2D and 3D rendering engines. As a result, **the base unit for 2D scenes is pixels.** Even though the engines are separate, you can render 2D in 3D, 3D in 2D, and overlay 2D sprites and interfaces over your 3D world.
es: Godot ofrece motores de renderizado 2D y 3D dedicados. Como resultado, **la unidad base para escenas 2D son los píxeles.** Aunque los motores están separados, puedes renderizar 2D en 3D, 3D en 2D, y superponer sprites 2D e interfaces sobre tu mundo 3D.
it: Godot offre motori di rendering 2D e 3D dedicati. Di conseguenza, **l'unità di base per le scene 2D è il pixel.** Anche se i motori sono separati, è possibile renderizzare il 2D in 3D, il 3D in 2D, e sovrapporre gli sprite e le interfacce 2D nel tuo mondo 3D.
ja: Godotには2Dと3Dでそれぞれ別の描写エンジンを搭載しています。その結果、\ **2Dシーンの基本単位はピクセルです。**\ 描写エンジンは分離していますが、3D内で2Dレンダーも、2D内で3Dレンダーも、3Dワールドの画面に2Dスプライトやインターフェースをオーバーレイすることもできます。
ko: Godot는 전용 2D 와 3D 렌더링 엔진을 제공합니다. 그 결과 **2D 씬의 기본 단위는 픽셀입니다.** 비록 엔진이 분리되더라도, 당신은 3D에서 2D를, 2D에서 3D를 렌더할 수 있고, 3D 월드에 2D 스프라이트와 인터페이스를 씌울 수 있습니다.
zh_cn: Godot提供专门的2D和3D渲染引擎。因此，**2D场景的基本单位是像素。** 即使引擎是分开的，您可以在3D渲染2D，在2D渲染3D，并在您的3D世界叠加2D精灵和界面。

source: Godot’s design philosophy
es: Filosofía del diseño de Godot
fr: La philosophie de conception de Godot
it: La filosofia progettuale di Godot
ko: Godot의 디자인 철학

source: **Every game engine is different and fits different needs.** Not only do they offer a range of features, but the design of each engine is unique. This leads to different workflows and different ways to form your games’ structures. This all stems from their respective design philosophies.
es: **Cada motor de videojuegos es diferente y se ajusta a diferentes necesidades.** No sólo ofrecen un amplio rango de características, si no que el diseño de cada motor es único. Esto lleva a diferentes flujos de trabajo y diferentes modos de construir la estructura de tus juegos. Todo esto surge de sus respectivas filosofías de diseño.
it: **Ogni motore di gioco è diverso e si adatta alle diverse esigenze.** Non solo offrono una serie di caratteristiche, ma il design di ogni motore è unico. Questo porta a diversi flussi di lavoro e modi diversi per formare le strutture dei tuoi giochi. Tutto ciò deriva dalle rispettive filosofie progettuali.
ko: **모든 게임 엔진은 서로 다르고 그렇기에 다른 필요를 충족시킵니다.** 그들이 제공하는 기능의 범위 뿐만 아니라, 각 엔진의 디자인도 독특합니다. 이것은 게임의 구조를 형성하는 다양한 방법과 다양한 워크플로를 유도합니다. 이 모든 것이 각각의 디자인 철학에서 생겨난 것입니다.

source: A Godot scene could be a Weapon, a Character, an Item, a Door, a Level, part of a level… anything you’d like. It works like a class in pure code, except you’re free to design it by using the editor, using only the code, or mixing and matching the two.
es: Una escena de Godot puede ser un Arma, un Personaje, un Item, una Puerta, un Nivel, parte de un nivel… cualquier cosa que quieras. Esto funciona como una clase en código puro, excepto que eres libre de diseñarla usando el editor, usando sólo código, o una mezcla de las dos.
it: Una scena di Godot può essere un'arma, un personaggio, un oggetto, una porta, un livello, una parte di un livello.... tutto quello che vuoi. Funziona come una classe in codice puro, tranne per il fatto che si è liberi di progettarlo usando l'editor, usando solo il codice, o mescolando e abbinando i due.
ko: Godot 씬은 무기나 캐릭터, 아이템, 문, 하나의 레벨, 레벨의 일부... 원하는 어떤 것이든 될수 있습니다. 편집기를 사용하거나, 오직 코드만을 사용하거나 이 둘을 섞어서 일치시켜서 자유롭게 디자인한다는 경우를 제외하면 마치 순수코드에서의 클래스처럼 작동합니다.

source: It’s different from prefabs you find in several 3D engines, as you can then inherit from and extend those scenes. You may create a Magician that extends your Character. Modify the Character in the editor and the Magician will update as well. It helps you build your projects so that their structure matches the game’s design.
es: Esto es diferente de los prefabs que se encuentran en distintos motores 3D, ya que se pueden heredar y extender las escenas. Puedes crear un Mago que extienda tu Personaje. Modifica el Personaje en el editor y el Mago se actualizará. Esto ayuda a construir tus proyectos de forma tal que su estructura se ajustan al diseño del juego.
it: È diverso dai prefabbricati che si trovano in vari motori 3D, in quanto è possibile ereditare ed estendere quelle scene. Puoi creare un Mago che estende il tuo Personaggio. Modificare il Personaggio nell'editor e anche il Mago si aggiornerà. Ti aiuta a costruire i tuoi progetti in modo che la loro struttura corrisponda al design del gioco.
ko: 이것은 씬을 상속하고 확장한다는 점에서 여러 3D 엔진에서 볼수 있는 프리펩과는 다릅니다. 당신은 캐릭터를 확장시켜 마법사를 만들수도 있습니다. 편집기에 있는 캐릭터를 수정하면 마법사도 이를 업데이트합니다. 이것은 당신이 프로젝트를 만들면서 프로젝트 구조가 게임 디자인에 일치하도록 도와줍니다.

source: Also note that Godot offers many different types of objects called nodes, each with a specific purpose. Nodes are part of a tree and always inherit from their parents up to the Node class. Although the engine does feature components like collision shapes, they’re the exception, not the norm.
es: Observa también que Godot ofrece diferentes tipos de objetos llamados nodos, cada uno con un propósito específico. Los nodos son parte de un árbol y siempre heredan de sus padres hacia arriba hasta la clase Node. Aunque el motor posee componentes como las figuras de colisión, esos son la excepción, no la regla.
fr: Notez également que Godot offre de nombreux types différents d'objets appelés nœuds, chacun avec un but spécifique. Les nœuds font partie d'un arbre et héritent toujours de leurs parents jusqu'à la classe Node. Bien que le moteur comporte des éléments comme des formes géométriques de collision, ils sont l'exception et non la norme.
it: Inoltre, nota che Godot offre tanti tipi di oggetti diversi chiamati nodi, ognuno con un suo scopo. Tutti i nodi sono parte di un albero ed ereditano dai loro padri, fino alla classe Nodo. Anche se l'engine ha alcuni componenti, per esempio le forme di collisione, che eccezionalmente non rispettano questa regola.
ko: 또한 Godot는 노드라고 불리는 다양한 유형의 객체를 제공합니다, 이들 각각 특정한 목적을 지니고 있습니다. 노드는 트리의 일부분으로 항상 그들의 부모 노드에서 노드 클래스까지 상속합니다. 비록 엔진이 충돌 모양같은 구성 요소를 포함하지만, 이들은 예외이고, 표준이 아닙니다.

source: That is also partly why Godot offers its own programming languages GDscript and VisualScript, along with C#. They’re designed for the needs of game developers and game designers, and they’re tightly integrated in the engine and the editor.
es: Esta es una de las razones por la que Godot ofrece su propio lenguaje de programación GDscript y VisualScript, junto con C#. Están diseñados para las necesidades de los desarrolladores y diseñadores de videojuegos, y están fuertemente integrados al motor y el editor.
fr: C'est aussi en partie pour cela que Godot propose ses propres langages de programmation GDscript et VisualScript, parallèlement à C#. Ils ont été conçus pour les besoins des développeurs et des designers de jeu, et sont étroitement intégrés au moteur et à l'éditeur.
it: Questo è anche in parte il motivo per cui Godot offre i propri linguaggi di programmazione GDscript e VisualScript, insieme a C#. Sono progettati per le esigenze degli sviluppatori di giochi e game designer, e sono strettamente integrati nel motore e nell'editor.
ko: 이것이 Godot가 C#과 함께, 고유의 프로그래밍 언어인 GDScript와 VisualScript를 제공하는 이유이기도 합니다. 그들은 게임 개발자와 게임 디자이너의 필요를 위해 제작되었고, 엔진과 편집기에 완벽하게 통합됩니다.

source: Note that the 3D workspace doesn’t feature as many tools as the 2D workspace. You’ll need external programs or add-ons to edit terrains, animate complex characters, and so on. Godot provides a complete API to extend the editor’s functionality using game code. See `The Godot editor is a Godot game`_ below.
es: Fíjate que el area de trabajo 3D no tiene tantas herramientas como el 2D. Necesitarás programas externos, add-ons para editar terrenos, animar personajes complejos, etc. Godot provee un API completa para extender la funcionalidad del editor usando código de juegos. Ver `The Godot editor is a Godot game`_ debajo.
fr: Il est à noter que l'espace de travail pour la 3D ne comporte pas autant d'outils que celui pour la 2D. Vous aurez besoin de programmes externes ou d'extensions pour éditer des terrains, animer des personnages complexes, etc. Godot fourni une API complète pour étendre les fonctionnalités de l'éditeur via du code dans le jeu. Cf. `L'éditeur Godot est un jeu Godot`_ ci-dessous.
it: Tieni presente che l'area di lavoro 3D non presenta tanti strumenti come l'area di lavoro 2D. Avrai bisogno di programmi esterni o componenti aggiuntivi per modificare i terreni, animare personaggi complessi e così via. Godot fornisce un'API completa per estendere le funzionalità dell'editor usando il codice di gioco. Vedi 'L'editor Godot è un gioco Godot' sotto.
ko: 3D 작업 공간은 2D 작업 공간같은 도구들이 많지 않습니다. 당신은 외부 프로그램이나 애드온으로 지형을 편집하거나, 복잡한 캐릭터를 애니메이트하거나 해야합니다. Godot는 게임 코드를 사용하여 편집기의 기능성을 넓히는 완전한 API를 제공합니다. 하단의 `The Godot editor is a Godot game`_ 을 참고하세요.

source: Godot offers a fully open source codebase under the **MIT license**. This means all the technologies that ship with it have to be Free (as in freedom) as well. For the most part, they’re developed from the ground up by contributors.
es: Godot ofrece un código base completamente abierto bajo la **licencia MIT**. Esto significa que todas las tecnologías que se distribuyen con él también tienen que ser Libres (es decir, en libertad). En su mayor parte, son desarrollados por los contribuidores desde el inicio.
it: Godot offre una base di codice completamente open source sotto la **licenza MIT**. Ciò significa che anche tutte le tecnologie fornite devono essere gratuite (come in libertà). Per la maggior parte, sono sviluppati da zero dai collaboratori.
ko: Godot는 **MIT 라이선스** 하에 완전한 오픈 소스 코드베이스를 제공합니다. 이는 여기서 제공하는 모든 기술들은 (자유로서의) 무료임을 의미합니다. 대부분의 기술들은, 참여자들에 의해 기초부터 개발되었습니다.

source: On the other hand, an open codebase means you can **learn from and extend the engine** to your heart’s content. You can also debug games easily, as Godot will print errors with a stack trace, even if they come from the engine itself.
es: Por otra parte, tener una base de código abierta significa que puedes **aprender y extender el motor** todo lo que quieras. Puedes también depurar juegos fácilmente, ya que Godot imprimirá errores con un volcado de pila, aún si vienen del propio motor.
it: D'altra parte, un sorgente aperto significa che puoi **imparare dall'engine ed estenderne le funzionalità** come piú ti aggrada. Puoi anche fare debug dei giochi in maniera semplice, poiché Godot stamperà gli errori con una stack trace, anche se arrivano dall'engine stesso.
ko: 한편, 오픈 코드베이스는 당신이 **엔진에서 배우고 확장하여** 당신의 마음대로 콘텐츠를 만들 수 있다는 것을 의미합니다. 또한 Godot는 에러가 엔진 자체에서 발생하는 것일지라도, 스택 추적을 포함한 에러를 출력하므로, 게임을 쉽게 디버깅 할 수 있습니다.

source: This **does not affect the work you do with Godot** in any way: there’s no strings attached to the engine or anything you make with it.
es: Esto **no afecta el modo en que trabajes con Godot** de ningún modo: no hay "ataduras" al motor o a ninguna cosa que hagas con este.
fr: Cela *n'affecte en rien le travail que vous faites avec Godot** : il n'y a aucune condition attachée au moteur ou à tout ce que vous en faites.
it: Questo **non impatta il lavoro che fai con Godot** in nessuna maniera: non ci sono lacci che ti legano all'engine o a qualsiasi cosa tu faccia con esso.
ko: 이것은 어떤 방식으로라도 **Godot를 사용하는 작업에 영향을 주지 않습니다** : 엔진에는 어떤 문자열도 붙어있지 않고 문자열로 만들 것도 없습니다.

source: **Godot is made by its community, for the community, and for all game creators out there.** It’s the needs of the users and open discussions that drive the core updates. New features from the core developers often focus on what will benefit the most users first.
es: **Godot es hecho por su comunidad, para la comunidad y para todos los creadores de videojuegos** Es la necesidad de los usuarios y discusiones abiertas las que dirigen las actualizaciones fundamentales. Nuevas característias creadas por los desarrolladores principales normalmente se enfocan en beneficios para la mayoría primero.
fr: **Godot est fait par sa communauté, pour la communauté et pour tous les créateurs de jeux.** Ce sont les besoins des utilisateurs et les discussions ouvertes qui déterminent les mises-à-jour critiques. Les nouvelles fonctionnalités apportées par les développeurs du cœur du moteur se focalisent souvent sur ce qui profitera d'abord au plus grand nombre d'utilisateurs.
it: **Godot é fatto dalla sua comunità, per la sua comunità, e per tutti i creatori di giochi là fuori.** Sono le necessità degli utenti e le discussioni aperte che guidano le update principali. Le nuove funzionalità dagli sviluppatori principali spesso si focalizzano per prima cosa su ció che beneficierá la maggior parte degli utenti.
ko: **Godot는 커뮤니티에 의해, 커뮤니티를 위해, 그리고 모든 게임 개발자들을 위해 만들어졌습니다.** 이것은 핵심 업데이트를 이끌어 내는 열린 토론과 사용자들의 요구가 반영된 것입니다. 새로은 기능은 핵심 개발자로부터 나오며 대부분의 사용자들에게 도움을 주는 것을 최우선으로 봅니다.

source: That said, although a handful of core developers work on it full-time, the project has over 600 contributors at the time of writing. Benevolent programmers work on features they may need themselves, so you’ll see improvements in all corners of the engine at the same time in every major release.
es: Dicho esto, aunque un puñado de desarrolladores principales trabajan en él a tiempo completo, el proyecto tiene más de 600 colaboradores en el momento de escribir este artículo. Programadores voluntarios trabajan en características que ellos mismos pueden necesitar, por lo que se verán mejoras en todos los rincones del motor al mismo tiempo en cada versión principal.
it: Ció detto, anche se una maciata di sviluppatori principali lavora sul core a tempo pieno, il progetto ha oltre 600 contributori al momento. Programmatori volenterosi lavorano su funzionalità di cui potrebbero aver bisogno loro stessi, perció vedrai miglioramenti in tutti gli aspetti dell'engine allo stesso tempo ad ogni major release.
ko: 이는 즉, 비록 소수의 핵심 개발자들이 하루 종일 일할지라도, 프로젝트는 그 시간에 600명이 넘는 참여자가 활동합니다. 자애로운 프로그래머들이 스스로에게 필요한 기능들을 작업하기 때문에, 모든 주요 릴리즈 마다 엔진의 모든 방면에서 개선되는 것을 볼 수 있을 겁니다.

source: The Godot editor runs on the game engine. It uses the engine’s own UI system, it can hot-reload code and scenes when you test your projects, or run game code in the editor. This means you can **use the same code** and scenes for your games, or **build plugins and extend the editor.**
es: El editor de Godot funciona desde el motor de juego. Utiliza el propio sistema de UI del motor, puede recargar en vivo código y escenas cuando se prueban los proyectos, o ejecutar código de juego en el editor. Esto significa que puedes **usar el mismo código** y las mismas escenas para tus juegos, o **construir plugins y extender el editor.**
fr: L'éditeur Godot fonctionne sur le moteur de jeu. Il utilise le propre système d'interface utilisateur du moteur, il peut recharger à chaud du code et des scènes lorsque vous testez vos projets, ou exécuter du code de jeu dans l'éditeur. Cela signifie que vous pouvez **utiliser le même code** et les mêmes scènes pour vos jeux, ou **construire des plugins et étendre l'éditeur.**
it: L'editor di Godot gira sul motore di gioco. Esso utilizza l'interfaccia propria del motore, può ricaricare codice e scene in maniera veloce quando esegui i test dei tuoi progetti, oppure eseguire codice di gioco nell'editor. Questo significa che tu puoi **usare lo stesso codice** e scene per i tuoi giochi, o **costruire plugin e estendere l'editor.**
ko: Godot 편집기는 게임 엔진으로 돌아갑니다. 이것은 엔진 스스로의 UI 시스템을 사용하고, 프로젝트를 테스트하거나 편집기에서 게임 코드를 실행할 때 코드와 씬을 핫 리로드 할 수 있습니다. 이는 당신이 게임에 쓰는 코드와 **같은 코드와 씬을 사용해서** , **플러그인을 만들거나 편집기를 확장** 시킬 수 있다는 것을 의미합니다.

source: *RPG in a Box is a voxel RPG editor made with Godot 2. It uses Godot’s UI tools for its node-based programming system and for the rest of the interface.*
es: *RPG in a Box es un editor de RPG de voxel hecho con Godot 2. Utiliza las herramientas de UI de Godot para su sistema de programación basado en nodos y para el resto de la interfaz.*
it: *RPG in a Box é un editor di GDR voxel fatto con Godot 2. Usa gli strumenti dell'interfaccia di Godot per il suo sistema di programmazione basato sui nodi e per il resto dell'interfaccia.*
ko: *RPG in a Box는 복셀 RPG 편집기로 Godot 2 에서 만들어졌습니다. 노드 기반 프로그래밍 시스템과 인터페이스의 일부를 위해 Godot UI 툴을 사용했습니다.*

source: Anyone can plug in proprietary tools for the needs of their projects — they just won’t ship with the engine. This may include Google AdMob, or FMOD. Any of these can come as third-party plugins instead.
it: Chiunque può collegare strumenti proprietari per le esigenze dei loro progetti - semplicemente non saranno inclusi nell'engine. Questo può includere Google AdMob, o FMOD. Ognuno di questi può essere invece implementato comeplugin di terze parti.

source: **Every game engine is different and fits different needs.** Not only do they offer a range of features, the design of each engine is unique. This leads to different workflows and different ways to form your games’ structures. This all stems from their respective design philosophies.
fr: **Chaque moteur de jeu est différent et répond à des besoins différents.** Non seulement ils offrent une série de fonctionnalités, mais la conception de chaque moteur est unique. Cela conduit à des flux de travail différents et à des façons différentes de former les structures de vos jeux. Tout cela découle de leurs philosophies de conception respectives.

source: A Godot scene could be a Weapon, a Character, an Item, a Door, a Level, part of a level… anything you’d like. It works like a class in pure code except you’re free to design it by using the editor, using only the code, or mixing and matching the two.
fr: Une scène de Godot peut être une arme, un personnage, un objet, une porte, une porte, un niveau, une partie d'un niveau… tout ce que vous voulez. Elle fonctionne comme une classe en pur code classique sauf que vous êtes libre de la concevoir en utilisant l'éditeur, en utilisant seulement le code, ou en mélangeant et en faisant correspondre les deux.

source: It’s different from prefabs you find in several 3D engines as you can then inherit from and extend those scenes. You may create a Magician that extends your Character. Modify the Character in the editor and the Magician will update as well. It helps you build your projects so that their structure matches the game’s design.
fr: C'est différent des préfabriqués que l'on trouve dans plusieurs moteurs 3D car on peut ensuite en hériter et étendre ces scènes. Vous pouvez créer un magicien qui étend votre personnage. Modifiez le personnage dans l'éditeur et le magicien se mettra également à jour. Ça vous aide à construire vos projets afin que leur structure corresponde à la conception du jeu.

source: On the other hand, an open codebase means you can **learn from and extend the engine** to your heart’s content. You can also debug games easily as Godot will print errors with a stack trace, even if they come from the engine itself.
fr: D'autre part, un code source ouvert signifie que vous pouvez **apprendre et étendre le moteur** autant qu'il vous plaira. Vous pouvez également déboguer facilement les jeux car Godot affichera les erreurs avec une trace de la pile, même si elles proviennent du moteur lui-même.

source: That said, although a handful of core developers work on it full-time, the project has over 500 contributors at the time of writing. Benevolent programmers work on features they may need themselves, so you’ll see improvements in all corners of the engine at the same time in every major release.
fr: Cela dit, bien qu'une poignée de développeurs centrale y travaillent à plein temps, le projet compte plus de 500 collaborateurs au moment de la rédaction du présent document. Des programmeurs bénévoles travaillent sur des fonctions dont ils peuvent avoir besoin eux-mêmes, de sorte que vous verrez des améliorations dans tous les coins du moteur en même temps dans chaque version majeure.

source: This leads to a reliable and flexible UI system as it powers the editor itself. With the ``tool`` keyword, you can run any game code in the editor.
fr: Cela conduit à un système d'interface utilisateur fiable et flexible car l'éditeur lui-même est propulsé avec. Avec le mot-clé ``tool``, vous pouvez exécuter n'importe quel code de jeu dans l'éditeur.
