Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/godot_design_philosophy.po
Languages: es, fr, it, ja, ko, zh_cn

source: Godot's design philosophy
ja: Godotの設計哲学
zh_cn: Godot的设计理念

source: Now that you've gotten your hands wet, let's talk about Godot's design.
es: Ahora que te has ensuciado las manos, hablemos del diseño de Godot.
fr: Maintenant que vous avez mis les mains dans le cambouis, parlons de la conception de Godot.
it: Ora che vi siete bagnati le mani, parliamo del progetto di Godot.
ja: 手が濡れたところで、Godotのデザインについて説明しましょう。
ko: 이제 당신은 손에 땀이 날 지경이니, Godot의 디자인 철학에 대해 얘기해 보겠습니다.
zh_cn: 既然您已经小试身手，让我们谈谈Godot的设计。

source: **Every game engine is different and fits different needs.** Not only do they offer a range of features, but the design of each engine is unique. This leads to different workflows and different ways to form your games' structures. This all stems from their respective design philosophies.
ja: **すべてのゲームエンジンは、それぞれ別のニーズに合わせて作られています。**\ 単に機能の違いだけではなく、エンジンによって異なる設計がされているのです。これにより、ワークフローや、ゲームを構築する方法に違いを生み出します。これらはすべて設計哲学に由来するものです。
zh_cn: **每个游戏引擎都不同，以满足不同的需求。** 它们不仅提供一系列功能，而且每个引擎的设计都是独一无二的。这将导致不同工作流程和项目组织结构。这一切都源于它们各自的设计理念。

source: This page is here to help you understand how Godot works, starting with some of its core pillars. It is not a list of available features, nor is it an engine comparison. To know if any engine can be a good fit for your project, you need to try it out for yourself and understand its design and limitations.
es: En esta página está para ayudar a comprender cómo funciona Godot. comenzando con algunos de sus pilares fundamentales. Esta no es una lista de características disponibles ni una comparación de motores. Para saber si un motor es bueno para tu proyecto, deberás probarlo por tí mismo y comprender su diseño y limitaciones.
fr: Cette page est là pour vous aider à comprendre le fonctionnement de Godot, en commençant par certains de ses piliers fondamentaux. Il ne s'agit pas d'une liste des fonctionnalités disponibles, ni d'une comparaison de moteurs. Pour savoir si un moteur peut convenir à votre projet, vous devez l'essayer vous-même et comprendre sa conception et ses limites.
it: Questa pagina è qui per aiutarvi a capire come funziona Godot, a partire da alcuni dei suoi pilastri fondamentali. Non si tratta di un elenco delle caratteristiche disponibili, né di un confronto tra motori. Per sapere se un motore può essere adatto al tuo progetto, devi provarlo tu stesso e comprenderne il design e i limiti.
ja: このページは、Godotがどのように機能するのかを理解するのに役立ちます。これは利用可能な機能のリストでもエンジンの比較でもありません。自分のプロジェクトに適したエンジンがあるかどうかを知るには、自分で試してみて、その設計と制限を理解する必要があります。
ko: 이 페이지가 Godot의 작동방식을 이해하도록 돕기 위해, 여러 핵심 기둥들로 시작합니다. 이것은 사용가능한 기능의 목록이 아닐 뿐더러, 엔진을 비교하는 것도 아닙니다. 어떤 엔진이라도 당신의 프로젝트에 잘 맞들어지는지 알기 위해선, 당신이 스스로 시도하고 그것의 디자인과 한계를 이해해야합니다.
zh_cn: 这个页面是为了帮助您通过godot的一些核心功能来理解它的工作原理。这个页面既不是godot特性的介绍列表，也不会对各个引擎做比较。要知道哪一种引擎更适合您的项目，您需要自己尝试一下并了解各个引擎对设计和局限性。

source: Please watch `Discover Godot 3, the Free game engine <https://youtu.be/4v3qge-3CqQ>`_ if you're looking for an overview of the engine's features.
es: Por favor, mira `Discover Godot 3, the Free game engine <https://youtu.be/4v3qge-3CqQ>`_ (la presentación está disponible en otros idiomas en`<https://github.com/GDquest/godot-3-presentation>`) si estás buscando un resumen de las características del motor.
fr: Veuillez regarder `Discover Godot 3, the Free game engine <https://youtu.be/4v3qge-3CqQ>` si vous cherchez un aperçu des fonctionnalités du moteur.
it: Guarda 'Scoprire Godot 3, il motore di gioco gratuito <https://youtu.be/4v3qge-3CqQ> se stai cercando una panoramica delle funzionalità del motore.
ja: エンジンの機能の概要をお探しの場合は、Youtubeにある\ `Discover Godot 3, the Free game engine <https://youtu.be/4v3qge-3CqQ>`_\ (英語)をご覧ください。
ko: 엔진의 기능에 관한 개요를 보고 싶다면 `Discover Godot 3, the Free game engine <https://youtu.be/4v3qge-3CqQ>`_ 를 봐주세요.
zh_cn: 如果您正在寻找引擎特性的概述，请观看 `探索免费游戏引擎Godot 3 <https://youtu.be/4v3qge-3CqQ>`_ 。

source: Object-oriented design and composition
es: Diseño orientado a objetos y composición
fr: Conception et composition orientées objet
it: Progettazione e composizione orientata all'oggetto
ja: オブジェクト指向の設計と構成
ko: 객체 지향 디자인과 구성
zh_cn: 面向对象的设计与组合

source: Godot embraces object-oriented design at its core with its flexible scene system and Node hierarchy. It tries to stay away from strict programming patterns to offer an intuitive way to structure your game.
es: Godot adopta un diseño orientado a objetos desde el núcleo con su sistema flexible de escenas y jerarquía de nodos. Esto intenta mantenerlo lejos de patrones de programación estrictos para ofrecer un modo intuitivo de estructurar su juego.
fr: Godot embrasse la conception orientée objet à son cœur avec son système de scène flexible et sa hiérarchie de nœuds. Il essaie de rester éloignés des modèles de programmation stricts pour offrir un moyen intuitif de structurer votre jeu.
it: Godot abbraccia il design orientato agli oggetti al suo interno con il suo sistema flessibile di scene e la gerarchia dei Nodi, e cerca di stare lontano da rigidi schemi di programmazione per offrire un modo intuitivo per strutturare il tuo gioco.
ja: Godotは、柔軟なシーンシステムとノード階層を備えたオブジェクト指向設計をコアに採用しています。ゲームを直感的に構築する方法を提供するために、厳密なプログラミング・パターンを避けています。
ko: Godot는 유연한 씬 시스템과 노드 계층 구조를 갖춘 객체 지향 디자인을 핵심으로 갖고 있습니다. 이것으로 엄격한 프로그래밍 패턴을 피하고 직관적인 방법으로 게임을 구성하도록 만들었습니다.
zh_cn: Godot凭借其灵活的场景系统和节点层次结构，将面向对象设计作为其核心。它试图远离严格的编程模式，以提供直观的方式来构建游戏。

source: For one, Godot lets you **compose or aggregate** scenes. It's like nested prefabs: you can create a BlinkingLight scene and a BrokenLantern scene that uses the BlinkingLight. Then, create a city filled with BrokenLanterns. Change the BlinkingLight's color, save, and all the BrokenLanterns in the city will update instantly.
es: Godot permite **componer o agregar** escenas. Esto es como prefabs anidados: puedes crear una escena LuzIntermitente y una escena LamparaRota que usa LuzIntermitente. Luego crea una ciudad llena de LamparaRota. Cambia el color de la LuzIntermitente, graba y todas las LamparaRota en la ciudad se actualizarán instantáneamente.
fr: D'une part, Godot vous permet de **composer ou d'agréger** des scènes. C'est comme des préfabriqués imbriqués : vous pouvez créer une scène BlinkingLight et une scène BrokenLantern qui utilise le BlinkingLight. Ensuite, créez une ville remplie de BrokenLanterns. Changez la couleur du BlinkingLight, sauvegardez, et toutes les BrokenLanterns dans la ville se mettront à jour instantanément.
it: Per prima cosa, Godot consente di **comporre o aggregare** scene. È come un prefabbricato annidato: è possibile creare una scena LuceAccesa una scena LanternaRotta che utilizza LuceAccesa. Poi, creare una città piena di LanterneRotte. Cambia il colore di LuceAccesa, salva, e tutte le LanterneRotte della città si aggiornano istantaneamente.
ja: 一例として、Godotはあなたがシーンを\ **構成または集約すること**\ を可能にします。これは入れ子になったプレハブのようなものです。BlinkingLight(ちらつく光) シーンと、そのBlinkingLightを使用するBrokenLantern(壊れたランタン) シーンを作成できます。その次に、BrokenLanternでいっぱいの街を作成します。それからBlinkingLightの色を変更して保存すると、街にあるすべてのBrokenLanternが即座に更新されます。
ko: 이를 위해 Godot는 당신이 씬을 **조립하거나 집합하도록** 만들었습니다. 이건 마치 중첩 물체같습니다: 당신이 깜박이는 빛 씬을 만들고 이 씬이 사용된 고장난 전봇대 씬을 만들었습니다. 그리고, 고장난 전봇대가 들어간 도시를 만듭니다. 깜박이는 빛의 색을 바꾸고, 저장해서, 도시의 모든 고장난 전봇대가 즉각적으로 업데이트될 것입니다.
zh_cn: 首先，Godot可以让您 **组合或聚合** 场景。就像嵌套的预制件一样：您可以创建 ``BlinkingLight`` 场景，并创建使用 ``BlinkingLight`` 的 ``BrokenLantern`` 场景。然后，创建一个充满 ``BrokenLanterns`` 的城市。更改BlinkingLight的颜色，保存，城市中的所有 ``BrokenLantern`` 都会立即更新。

source: On top of that, you can **inherit** from any scene.
es: Además, puede **heredar** desde cualquier escena.
fr: En plus de cela, vous pouvez **hériter** de n'importe quelle scène.
it: Inoltre, puoi **ereditare** da qualsiasi scena.
ja: それに加えて、あらゆるシーンから\ **継承すること**\ ができます。
ko: 무엇보다도, 당신이 어떤 씬에서든지 **상속하는 것** 이 가능합니다.
zh_cn: 最重要的是，您可以从任何场景 **继承** 。

source: A Godot scene could be a Weapon, a Character, an Item, a Door, a Level, part of a level… anything you'd like. It works like a class in pure code, except you're free to design it by using the editor, using only the code, or mixing and matching the two.
ja: Godotのシーンは、武器になったり、キャラクター、アイテム、ドア、レベル、レベルの一部……など、何にでもなれます。これは純粋なコードにおけるクラスのような働きをします。しかしシーンは、エディタのみを使って作ることも、コードのみで構成することも、あるいは両方組み合わせて作成することもできます。
zh_cn: 一个Godot场景可以是武器、角色、物品、门、关卡、关卡的一部分……任何你能想象的东西。它就像类一样，但也可以使用编辑器、纯代码或同时使用两者来编辑场景。

source: It's different from prefabs you find in several 3D engines, as you can then inherit from and extend those scenes. You may create a Magician that extends your Character. Modify the Character in the editor and the Magician will update as well. It helps you build your projects so that their structure matches the game's design.
ja: これは、いくつかの3Dエンジンにあるようなプレハブとは異なるものです。シーンは他のシーンから継承し、派生させることができます。キャラクターから派生させて魔法使いを作ることもできます。そしてキャラクターをエディタで編集すれば、魔法使いにも変更が反映されます。このように、ゲームのデザインに合わせてプロジェクトを構築する助けとなります。
zh_cn: 和其他几个3D引擎的Prefab（预制体）不同，场景可以通过继承来扩展。你可以创建一个 ``Magician（魔术师）`` 来扩展您的 ``Character（角色）`` 。在编辑器中修改 ``Character（角色）`` （例如添加跳跃功能）， ``Magician（魔术师）`` 也会更新。这样设计可以帮你保持项目结构与设计的一致性。

source: Also note that Godot offers many different types of objects called nodes, each with a specific purpose. Nodes are part of a tree and always inherit from their parents up to the Node class. Although the engine does feature components like collision shapes, they're the exception, not the norm.
ja: また、Godotにはノードと呼ばれるさまざまなタイプのオブジェクトがあり、それぞれに特定の目的があります。ノードはツリーの一部であり、常に親からNodeクラスまで継承します。エンジンには衝突シェイプなどのコンポーネントもありますが、これらは例外であり、標準ではありません。
zh_cn: 另外，Godot提供了不同类型的节点（Node）对象，每种节点都有特定的用途。节点是场景树的一部分，并且最终继承自 ``Node`` 类。尽管引擎确实具有碰撞形状之类的组件，但它们是例外（并非Node，属于Resource）。

source: Sprite is a Node2D, a CanvasItem and a Node. It has all the properties and features of its three parent classes, like transforms or the ability to draw custom shapes and render with a custom shader.
es: Sprite es un Node2D, un CanvasItem y un Node. Todos estos tienen las propiedades y carecterísticas de sus clases padre, como transforms y la habilidad de dibujar figuras personalizadas o utilizar un shader personalizado.
fr: Sprite est un Node2D, un CanvasItem et un Node. Il a toutes les propriétés et les caractéristiques de ses trois classes mères, comme les transformations ou la possibilité de dessiner des formes personnalisées et de faire un rendu avec un shader personnalisé.
it: Lo sprite è un Node2D, un CanvasItem e un Node. Ha tutte le proprietà e le caratteristiche delle sue tre classi madri, come le trasformazioni o la possibilità di disegnare forme personalizzate e renderizzare con uno shader personalizzato.
ja: SpriteはNode2D、CanvasItem、Nodeです。トランスフォームや、カスタムシェイプを描画してカスタムシェーダでレンダリングする機能など、3つの親クラスのすべてのプロパティと機能を備えています。
ko: Node2D의 Sprite, CanvasItem과 Node. 이 세 개의 부모 클래스는 모든 속성과 기능을 가지고 있습니다, 예를들면 변환이나 사용자 지정 모양을 그리고 쉐이더로 렌더하는 것이 있습니다.
zh_cn: ``Sprite`` 是 ``Node2D``，``CanvasItem`` 和 ``Node`` 类型。它具有三个父类的所有属性和特性，比如 ``transforms`` 或者绘制自定义形状和渲染自定义着色的能力。

source: All-inclusive package
es: Paquete con todo incluído
fr: Forfait tout compris
it: Pacchetto all-inclusive
ja: オールインワン・パッケージ
ko: 모든 것이 들어있는 패키지
zh_cn: 完善的工具集

source: Godot tries to provide its own tools to answer most common needs. It has a dedicated scripting workspace, an animation editor, a tilemap editor, a shader editor, a debugger, a profiler, the ability to hot-reload locally and on remote devices, etc.
es: Godot intenta proporcionar sus propias herramientas para las necesidades más comunes. Tiene un espacio de trabajo dedicado a scripting, un editor de animaciones, un editor de tilemaps, un editor de shader, un depurador, un perfilador, la habilidad de recargar localmente y en dispositivos remotos, etc.
fr: Godot essaie de fournir ses propres outils pour répondre aux besoins les plus courants. Il dispose d'un espace de travail dédié aux scripts, d'un éditeur d'animation, d'un éditeur de tilemap, d'un éditeur de shader, d'un débogueur, d'un profileur, de la possibilité de rechargement à chaud local et sur des périphériques distants, etc.
it: Godot cerca di fornire i propri strumenti per rispondere ai bisogni più comuni. Ha uno spazio di lavoro dedicato allo scripting, un editor di animazione, un editor di tilemap, un editor di shader, un debugger, un profiler, la possibilità di caricare a caldo localmente e su dispositivi remoti, ecc.
ja: Godotは最も一般的なニーズに答えるために、備えているツールを提供しようとします。専用のスクリプトワークスペース、アニメーションエディタ、タイルマップエディタ、シェーダエディタ、デバッガ、プロファイラ、ローカルおよびリモートデバイス上でのホットリロードなどが可能です。
ko: Godot는 가장 보편적인 요구들의 해답을 제공하고자 노력했습니다. Godot는 전용 스크립팅 작업 공간과 애니메이션 편집기, 타일맵 편집기, 쉐이더 편집기, 디버거, 프로파일러, 지역 및 원격 장치를 핫 리로드 하는 기능 등등을 가지고 있습니다.
zh_cn: Godot尝试提供自己的工具来满足最常见的需求。它具有专用的脚本工作区、动画编辑器、tilemap编辑器、着色器编辑器、调试器、分析器、能够在本地和远程等设备上热重载的功能。

source: The goal is to offer a full package to create games and a continuous user experience. You can still work with external programs as long as there is an import plugin for it. Or you can create one, like the `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
es: El objetivo es ofrecer un paquete completo para crear juegos y una buena experiencia de usuario continuada. Se pueden utilizar programas externos siempre que haya un plugin de importación para este. O puedes crear uno como el `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
fr: L'objectif est d'offrir un package complet pour créer des jeux et une expérience utilisateur continue. Vous pouvez toujours travailler avec des programmes externes tant qu'il existe un plugin d'importation. Ou vous pouvez en créer un, comme le `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
it: L'obiettivo è quello di offrire un pacchetto completo per creare giochi e un'esperienza utente continuativa. È ancora possibile lavorare con programmi esterni, purché ci sia un plugin per l'importazione. Oppure è possibile crearne uno, come l'importatore di mappe piastrellate <https://github.com/vnen/godot-tiled-importer>
ja: 目標は、ゲームを作成するための完全なパッケージと、途切れないユーザー エクスペリエンスを提供することです。外部プログラムからのインポート用プラグインがある場合は、外部プログラムでの作業もできます。あるいは、\ `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`_\ のようなプラグインを作成するのもいいでしょう。
ko: 목표는 게임을 만드는 모든 패키지와 끊김없는 사용자 경험을 제공하는 것입니다. 물론 가져오기 플러그인이 있다면 여전히 외부 프로그램과 함께 작업할 수 있습니다. 아니면 `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__ 처럼 하나로 만들 수도 있습니다.
zh_cn: 我们的目标是提供一个完整的软件包来创建游戏以及持续的用户体验。您仍然可以和外部程序一起工作，只要有一个导入插件做支持。或者您可以自己创建一个，比如 `Tiled Map导入器 <https://github.com/vnen/godot-tiled-importer>`__ 。

source: That is also partly why Godot offers its own programming languages GDscript and VisualScript, along with C#. They're designed for the needs of game developers and game designers, and they're tightly integrated in the engine and the editor.
ja: それが、Godotが独自のプログラミング言語であるGDscriptとVisualScriptを、C#と一緒に提供している理由のひとつでもあります。これらはゲーム開発者やゲームデザイナーのニーズに合わせて設計されていて、エンジンとエディタに緊密に統合されています。
zh_cn: 这也是为什么Godot提供自己的编程语言GDscript和VisualScript以及C#的部分原因。它们是为满足游戏开发人员和游戏设计师的需求而设计的，并且紧密集成在引擎和编辑器中。

source: GDscript lets you write simple code using Python-like syntax, yet it detects types and offers a static language's quality of auto-completion. It is also optimized for gameplay code with built-in types like Vectors and Colors.
es: GDscript permite escribir código simple utilizando una sintaxis similar a la de Python, pero detecta tipos y ofrece la calidad de autocompletado de un lenguaje estático. También está optimizado para código de juegos con tipos integrados como Vectors y Colors.
it: GDscript permette di scrivere codice semplice usando una sintassi simile a Python, ma rileva i tipi e offre un auto-completamento statico a livello di linguaggio di programmazione. È anche ottimizzato programmare giochi con tipi integrati quali Vettori e Colori.
ja: GDScriptはPythonに似た文法で、コードがシンプルになりますが、型を検出でき、静的言語クオリティの自動補完を実現しています。さらにVectorやColorのような組み込み型により、ゲームプレイ用コードの性能は最適化されます。
ko: GDScript는 Python과 유사한 문법을 사용하여 쉬운 코드를 사용하지만, 타입을 인지하고 정적 언어의 자동 완성 품질을 제공합니다. 또한 Vectors와 Colors 같은 내장 함수를 가지고 있어 게임플레이 코드에 최적화되어 있습니다.
zh_cn: GDscript使您可以使用类似Python的语法编写简单的代码，但是它可以检测类型并提供静态语言的自动补全特质。它还针对具有内置类型（如 ``Vectors`` 和 ``Colors`` ）的游戏代码进行了优化。

source: Note that with GDNative, you can write high-performance code using compiled languages like C, C++, Rust, or Python (using the Cython compiler) without recompiling the engine.
es: Observa que con GDNative se puede escribir código de alto rendimiento usando lenguajes compilados como C, C++, Rust o Python (usando el compilador Cython) sin recompilar el motor.
fr: Il est à noter qu'avec GDNative, vous pouvez écrire du code haute performance en utilisant des langages compilés tels que C, C++, Rust ou Python (en utilisant le compilateur Cython) sans avoir à recompiler le moteur.
it: Nota che con GDNative, puoi scrivere codice ad alte prestazioni usando linguaggi compilati come C, C++, Rust, o Python (usando il compilatore Cython) senza ricompilare il motore.
ja: GDNativeを使用すると、エンジンを再コンパイルすることなく、C、C++、Rust、またはPython(Cythonコンパイラを使用)などのコンパイル済み言語を使用して高性能コードを作成できます。
ko: GDNative를 사용하면, 엔진을 리컴파일하지 않고 C, C++, Rust, 아니면 (Cython 컴파일러를 사용한) Python과 같이 컴파일된 언어를 사용해 고성능의 코드를 작성할 수 있습니다.
zh_cn: 请注意，使用GDNative，您可以编写出使用类似C、C++、Rust或Python（使用Cython编译器）这类的编译语言编写的高性能代码，而无需重新编译引擎。

source: *VisualScript is a node-based programming language that integrates well in the editor. You can drag and drop nodes or resources into the graph to create new code blocks.*
es: *VisualScript es un lenguaje de programación basado en nodos que se integra al editor. Puedes arrastrar y soltar nodos o recursos dentro del grafo para crear nuevos bloques de código.*
fr: *VisualScript est un langage de programmation basé sur des noeuds s'intégrant très bien avec l'éditeur. Vous pouvez glisser-déposer des noeuds ou des ressources dans le graphe pour créer de nouveaux blocs de code.*
it: *VisualScript è un linguaggio di programmazione basato su nodi che si integra bene nell'editor. È possibile trascinare e rilasciare nodi o risorse nel grafico per creare nuovi blocchi di codice*.
ja: *VisualScriptは、エディタにうまく統合されたノードベースのプログラミング言語です。ノードまたはリソースをグラフにドラッグアンドドロップして、新しいコードブロックを作成できます。*
ko: *VisualScript는 노드 기반 프로그래밍 언어로 편집기에 잘 통합되어 있습니다. 노드나 리소스를 그래프로 드래그 앤 드롭하여 새 노드 블럭을 생성할 수 있습니다.*
zh_cn: *VisualScript是一种基于节点的编程语言，可以很好地集成到编辑器中。 您可以将节点或资源拖放到图中以创建新的代码块。*

source: Note that the 3D workspace doesn't feature as many tools as the 2D workspace. You'll need external programs or add-ons to edit terrains, animate complex characters, and so on. Godot provides a complete API to extend the editor's functionality using game code. See `The Godot editor is a Godot game`_ below.
ja: 3Dワークスペースには、2Dワークスペースほど多くのツールはありません。地形を編集したり、複雑なキャラクターをアニメーション化したりするには、外部プログラムやアドオンが必要です。Godotは、ゲームコードを使用してエディタの機能を拡張するための完全なAPIを提供しています。下の `The Godot editor is a Godot game`_ を参照してください。
zh_cn: 请注意，3D工作区不像2D工作区有那么多工具。你将需要外部程序或插件来编辑地形、动画复杂角色等。Godot提供了完整的API，可以使用游戏代码扩展编辑器的功能。参见下面的 `Godot编辑器是一个Godot游戏<#the-godot-editor-is-a-godot-game>`_ 。

source: *A State Machine editor plugin in Godot 2 by kubecz3k. It lets you manage states and transitions visually.*
es: *Un plugin del editor State Machine en Godot 2, por kubecz3k. Permite gestionar visualmente estados y transiciones.*
it: Un plugin dell'editor di Godot 2 per le Macchine a Stati fatto da kubecz3k. Permette di gestire stati e transizioni in maniera visuale.
ja: *kubecz3k氏制作のGodot 2用プラグインであるステートマシン・エディタ。状態および遷移を視覚的に整理できます。*
ko: *Godot 엔진 2에서 kubecz3k님이 만드신 State Machine editor 플러그인입니다. 이걸로 당신은 시각적으로 상태와 변화를 다룰 수 있습니다.*
zh_cn: *Godube 2中的状态机编辑器插件，由kubecz3k开发。它使您可以直观地管理状态和转换。*

source: Open source
es: Código abierto
ja: オープンソース
ko: 오픈 소스
zh_cn: 开源

source: Godot offers a fully open source codebase under the **MIT license**. This means all the technologies that ship with it have to be Free (as in freedom) as well. For the most part, they're developed from the ground up by contributors.
ja: Godotのコードベースは\ **MITライセンス**\ のもとで完全にオープンソースとなっています。これはつまり、Godotエンジンに付属するコードは、フリー(自由)でなければならない、ということです。それらのコードはほとんどの場合、人々の貢献によって開発されたものです。
zh_cn: Godot源代码采用了 **MIT许可证** 。这意味着它附带的所有技术也必须是自由的（自由使用、修改等）。大部分代码都是由贡献者从头开始开发的。

source: Anyone can plug in proprietary tools for the needs of their projects — they just won't ship with the engine. This may include Google AdMob, or FMOD. Any of these can come as third-party plugins instead.
ja: もしプロジェクトに必要とあれば、プロプライエタリ(非オープン)なプラグインを追加することは可能ですが、しかしエンジンに最初から付属はしていません。これにはGoogle AdMobやFMODなどが当てはまるでしょう。いずれもサードパーティーのプラグインとして追加できます。
zh_cn: 任何人都可以根据各自需求添加专有软件——当然它们是不会通过引擎一起提供。包括Google AdMob或FMOD等，如果需要可以作为第三方插件来提供。

source: On the other hand, an open codebase means you can **learn from and extend the engine** to your heart's content. You can also debug games easily, as Godot will print errors with a stack trace, even if they come from the engine itself.
ja: 一方、コードベースがオープンであるということは、心ゆくまで\ **エンジンの内部を学んだり、拡張することができます。**\ またこれによりGodotは、エンジン自身のものも含めて、スタックトレース付きのエラーを表示できるので、ゲームのデバッグがより容易になります。
zh_cn: 另一方面，开放源代码意味着你可以 **学习并扩展引擎** 。你也可以很容易地调试游戏，因为Godot会使用堆栈跟踪打印所有错误，即使这些错误来自引擎本身。

source: This **does not affect the work you do with Godot** in any way: there's no strings attached to the engine or anything you make with it.
ja: これは\ **Godotで作られた作品にはなんら影響をおよぼしません。**\ Godotエンジン自体にも、それで作られたものにも、使用条件が課されることはありません。
zh_cn: **开放源码的协议不会以任何方式影响您用Godot所创作的作品**：不会有附加条件影响Godot引擎与您用Godot制作的东西。

source: Community-driven
es: Dirigido por la comunidad
fr: Géré par une communauté
it: gestito dalla comunità
ja: コミュニティ主導
ko: 커뮤니티 중심
zh_cn: 社区驱动

source: **Godot is made by its community, for the community, and for all game creators out there.** It's the needs of the users and open discussions that drive the core updates. New features from the core developers often focus on what will benefit the most users first.
ja: **Godotは、そのコミュニティによって、コミュニティのために、そしてすべてのゲームクリエイターのために作られています。**\ コアアップデートを推進するのは、ユーザーのニーズとオープンな議論です。コア開発者が提供する新機能は、多くの場合、最も多くのユーザーにメリットをもたらすものに重点が置かれます。
zh_cn: **Godot开发自社区，为其社区内外所有游戏开发者创造的。** 由用户需求及公开讨论驱动核心更新。核心开发人员的新功能通常将重点放在首先让大多数用户受益的方面。

source: That said, although a handful of core developers work on it full-time, the project has over 600 contributors at the time of writing. Benevolent programmers work on features they may need themselves, so you'll see improvements in all corners of the engine at the same time in every major release.
ja: つまり、フルタイムで働く中心的開発者はわずか数名ですが、このプロジェクトには現時点で600名を超える貢献者がおります。善意のプログラマーの方々が自分自身の求める機能を追加していくので、メジャーリリースのたびにエンジンのあらゆる点が改善されていくのです。
zh_cn: 就是说，尽管只有少数全职的核心开发者，但在撰写本文时，该项目已有超过600位贡献者。仁慈的程序员致力于完善他们可能需要的功能，因此在每个主要版本中都能看到引擎各个方面的改进。

source: The Godot editor is a Godot game
es: El editor de Godot es un juego de Godot
fr: L'éditeur Godot est un jeu Godot
it: L'editor di Godot è un gioco sviluppato in Godot
ja: Godotエディタ自身がGodotのゲーム
ko: Godot 편집기는 Godot 게임입니다
zh_cn: Godot编辑器是一个Godot游戏

source: The Godot editor runs on the game engine. It uses the engine's own UI system, it can hot-reload code and scenes when you test your projects, or run game code in the editor. This means you can **use the same code** and scenes for your games, or **build plugins and extend the editor.**
ja: Godotエディタもゲームエンジン上で動作しています。 エディタは、エンジン自身のUIシステムを使用しており、プロジェクトのテスト時にコードやシーンをホットリロードしたり、エディタ内でゲームコードを実行したりできます。つまり、ゲームと\ **同じコード**\ とシーンを使用したり、\ **プラグインを構築してエディタを拡張することもできます。**
zh_cn: Godot编辑器运行在游戏引擎上。它使用引擎自己的UI系统，可以在测试项目时热重载代码和场景，也可以在编辑器中运行游戏代码。这意味着 **使用相同的代码** 和场景既可以构建游戏，也可以 **构建插件并扩展编辑器** 。
