Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/instancing_continued.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Instancing (continued)
cs: Vytváření instancí (pokračování)
de: Instanziieren (Fortsetzung)
es: Instanciar (continuación)
fi: Ilmentymien luonti (jatkuu)
fr: L'instanciation (suite)
it: Instanziazione (continua)
ja: インスタンス化(続き)
ko: 인스턴스 (이어서)
pl: Instancje (kontynuacja)
pt_br: Instâncias (continuação)
ru: Создание экземпляра (продолжение)
uk: Instancing (продовження)
zh_cn: 实例化(续)
zh_tw: 實體化 (續)

source: Recap
cs: Rekapitulace
de: Wiederholung
es: Resumen
fi: Kertaus
fr: Récapitulatif
it: Ricapitolando
ja: 要約
ko: 요약
pl: P:odsumowanie
pt_br: Recapitulação
ru: Резюме
uk: Коротке повторення
zh_cn: 概要
zh_tw: 重點

source: Instancing has many handy uses. At a glance, with instancing you have:
cs: Vytváření instancí mám mnoho praktických využití. Stručně řečeno tvorba instancí vám poskytuje:
de: Das Instanziieren hat mehrere praktische Einsatzmöglichkeiten. Du kannst:
es: Instanciar tiene mucha utilidad. A primera vista, con instanciar tienes:
fi: Ilmentymillä on monia käteviä käyttötarkoituksia. Pikaisella vilkaisulla, ilmentymien avulla saat:
fr: L'instanciation a de nombreuses utilisations pratiques. En un coup d'œil, avec l'instanciation vous avez :
it: Istanziare ha molti usi. A prima vista, attraverso l'istanziazione si ha:
ja: インスタンス化には便利な使い方がたくさんあります。インスタンス化を使用すると、次のようになります:
ko: 인스턴스화는 매우 다양하게 쓰입니다. 인스턴스화를 통해 무엇을 할 수 있는지 대충 살표보시죠:
pl: Instancjonowanie ma wiele przydatnych zastosowań. Na pierwszy rzut oka, z instancją masz:
pt_br: Instâncias tem muitos usos interessantes. Olhando de relance, com instâncias você tem:
ru: У экземпляров есть много полезных применений. С помощью экземпляров вы можете:
uk: Instancing має багато корисних застосувань. Завдяки йому ви маєте:
zh_cn: 实例化有很多便捷的用途。大致来说，实例化拥有：
zh_tw: 實體化有很多便利的用途。簡單來說，通過實體化就可以：

source: The ability to subdivide scenes and make them easier to manage.
cs: Možnost rozdělit scény a zjednodušit tak práci s nimi.
de: Die Möglichkeit Szenen aufzuteilen und diese einfacher zu Hand haben.
es: La habilidad de dividir escenas y hacerlas más fácil de manejar.
fi: Mahdollisuus jakaa skenet osiin ja tehdä niistä helpommin hallittavia.
fr: La possibilité de subdiviser les scènes et de les rendre plus faciles à gérer.
it: L'abilitá di suddividere le scene e renderle piú facili da gestire.
ja: シーンを細分化し、管理を容易にする機能。
ko: 관리하기 편하게 하기 위해 씬들을 여러 하위 객체로 나눌 수 있는 것.
pl: Możliwość podziału scen i ułatwienia zarządzania nimi.
pt_br: A habilidade de subdividir cenas e torná-las mais fáceis de gerenciar.
ru: Возможность разделить сцены и сделать управление ими проще.
uk: Можливість розподілити сцени та полегшити керування ними.
zh_cn: 细分场景并使其更简单地管理的能力。
zh_tw: 細分場景，讓場景更容易管理。

source: A tool to manage and edit multiple node instances at once.
cs: Nástroj pro správu a úpravy více instancí jednoho uzlu současně.
es: Una herramienta para gestionar y editar múltiples instancias de nodo a la vez.
fi: Työkalu, jolla hallita ja muokata useita solmun ilmentymiä samalla kertaa.
fr: Un outil pour gérer et éditer plusieurs instances de nœud à la fois.
it: Uno strumento per gestire e modificare multiple istanze di Nodi alla volta.
ja: 複数のノードインスタンスを一度に管理および編集するためのツール。
ru: Инструмент для управления и редактирования нескольких экземпляров узлов одновременно.
uk: Інструмент для управління та редагування декількох екземплярів вузлів одночасно.
zh_tw: 通過實體化來一次管理與編輯多個節點實體。

source: A way to organize and embed complex game flows or even UIs (in Godot, UI Elements are nodes, too).
cs: Způsob, jak organizovat a vkládat složité herní mechanizmy nebo dokonce uživatelská rozhraní UI (v Godotu jsou prvky UI také uzly).
de: Einen Weg deinen komplexe Spielfluss oder sogar UI's (in Godot sind UI Elemente auch Nodes) zu organisieren und einzubetten.
es: Una manera de organizar flujos de juego complejos, incluso para UI (en godot, los elementos UI son nodos también).
fi: Tapa järjestää ja sisältää monimutkaisia pelimalleja tai jopa käyttöliittymiä (Godotissa myös käyttöliittymäelementit ovat solmuja).
fr: Une façon d'organiser et d'intégrer des flux de jeu complexes ou même des interfaces utilisateur (dans Godot, les éléments d'interface utilisateur sont aussi des nœuds).
it: Un modo per organizzare e integrare logiche di gioco complesse o anche UI (in Godot anche gli elementi dell'UI sono nodi).
ja: 複雑なゲームフローやUIを整理して埋め込む方法 (Godotでは、UI要素もノードです)。
ko: 복잡한 게임 플로우나 심지어는 UI를 구조화하고 내장하는 방법 (Godot에서는 UI의 원소들 마저도 노드들입니다).
pt_br: Uma maneira de organizar e embutir fluxos complexos de jogo e mesmo interfaces com usuário (no Godot, elementos de interface também são nós).
ru: Способ организации и внедрения сложных игровых потоков или даже пользовательского интерфейса (в Godot элементы пользовательского интерфейса тоже являются узлами).
uk: Спосіб організації та вбудовування складних ігрових потоків, або, навіть, інтерфейсів користувача (у Godot елементи інтерфейсу також є вузлами).
zh_cn: 一种方式来设计更复杂的游戏流程甚至是UI（UI元素在Godot中也是节点）。
zh_tw: 通過實體化，可以在 UI 內組織與嵌入複雜的遊戲流程 (Godot 裡的 UI 元素也是節點)。

source: Design language
cs: Jazyk pro návrh hry
de: Designsprache
es: Lenguaje de diseño
fi: Suunnittelukieli
fr: Langage de conception
it: Linguaggio di design
ja: デザイン言語
ko: 언어의 설계
pt_br: Linguagem de concepção
ru: Дизайн
uk: Стиль проектування
zh_cn: 设计语言
zh_tw: 設計語言

source: But the greatest strength that comes with instancing scenes is that it works as an excellent design language. This distinguishes Godot from all the other engines out there. Godot was designed from the ground up around this concept.
cs: Ale největší přínos tvorby instancí scén je to, že vše zároveň funguje jako vynikající designový jazyk. Toto odlišuje Godota od všech ostatních enginů tam venku za zdí. Godot byl navržen od prvopočátku kolem tohoto konceptu.
es: Uno de los puntos fuertes de la instanciación de escenas, es que funciona como un excelente lenguaje de diseño. Es lo que distingue a Godot de otros motores. Godot se diseñó desde su base en torno a este concepto.
fi: Mutta suurin skeneilmentymien luonnista tuleva vahvuus on, että se toimii erinomaisena suunnittelukielenä. Tämä erottaa Godotin kaikista muista olemassa olevista pelimoottoreista. Godot on suunniteltu alusta saakka tämän ajatuksen ympärille.
fr: Mais la plus grande force qui vient avec l’instanciation des scènes est qu'elle fonctionne comme un excellent langage de conception. C'est ce qui distingue Godot de tous les autres moteurs. Godot a été conçu dès le départ autour de ce concept.
it: Il grande vantaggio che proviene dall'instanziazione delle scene é che funziona come un eccellente linguaggio per il design. Questo è ciò che distingue Godot da tutti gli altri motori esistenti. Godot é stato progettato con l'idea di questo concetto.
ja: しかし、シーンのインスタンス化の最大の利点は、優れた設計言語として機能することです。これは、Godotと他のすべてのエンジンとの違いです。 Godotは、この概念に基づいて設計されました。
uk: Але найбільша сила використання екземплярів сцен, полягає в тому, що це чудовий стиль проектування. Це відрізняє Godot від усіх інших редакторів. Godot був розроблений з нуля саме навколо цієї концепції.
zh_tw: 其實，最大的優點就是能把「實體化場景」看作一個優秀的設計語言。這就是 Godot 與其他引擎的差別，Godot 就是基於這個概念所設計的。

source: When making games with Godot, the recommended approach is to dismiss most common design patterns, such as MVC or Entity-Relationship diagrams, and instead think about your scenes in a more natural way. Start by imagining the visible elements in your game, the ones that can be named not just by a programmer, but by anyone.
cs: Doporučený postup při vytváření hry v Godotu je zapomenout na většinu běžných návrhových vzorů, jako jsou diagramy MVC nebo Entity-Relationship, a místo toho přemýšlet o scénách přirozenějším způsobem. Začněte tím, že si představíte viditelné prvky vaší hry, tedy těmi, které může pojmenovat nejenom programátor, ale i libovolný hráč vašeho díla.
de: Beim Erstellen von Spielen mit Godot ist die die empfohlene Herangehensweise die, alle gängigen Designschemas, wie MVC oder Entity-Relationship Diagramme zu vergessen und statt dessen Szenen auf einem natürlicherem Weg zu gestalteten. Beginne, in dem du dir die sichtbaren Elemente in deinem Spiel vorstellst. Nicht nur die, die ein Programmierer nennen kann, sondern die, die alle sehen.
es: Cuando haces juegos con Godot, el enfoque recomendado es descartar los patrones de diseño comunes, como MVC o diagramas de Entidad-Relación, en su lugar piensa en tus escenas en un modo más natural. Comienza imaginando los elementos visibles de tu juego, los que pueden ser nombrados no sólo por un programador, sino por cualquiera.
fi: Tehdessä pelejä Godotilla, suositeltu lähestymistapa on hylätä useimmat yleiset suunnittelumallit, kuten MVC ja Entity-Relationship, ja ajatella sen sijaan skenejäsi luonnollisempaan tapaan. Aloita kuvittelemalla pelisi näkyvät elementit, ne jotka kuka tahansa pystyy nimeämään, ei vain ohjelmoija.
fr: Lorsque vous créez des jeux avec Godot, l'approche recommandée est de rejeter la plupart des modèles de conception courants, tels que les diagrammes MVC ou Entity-Relationship, et de penser plutôt à vos scènes d'une manière plus naturelle. Commencez par imaginer les éléments visibles dans votre jeu, ceux qui peuvent être nommés non seulement par un programmeur, mais par n'importe qui.
it: Quando si creano giochi con Godot, l'approccio raccomandato é quello di mettere da parte i design pattern piú comuni come MVC o il modello E-R per concentrarsi su un design piú naturale per le proprie scene. Inizia immaginando gli elementi visibili nel tuo gioco, quelli che possono essere nominati non solo da un programmatore ma da ognuno.
ja: Godotでゲームを作る場合、推奨されるアプローチは、MVCやエンティティ-関係図のような最も一般的なデザインパターンを無視し、代わりにあなたのシーンをより自然な方法で考えることです。ゲームの中で目に見える要素、つまりプログラマーだけでなく誰もが命名できる要素を想像することから始めましょう。
ko: 고도로 게임을 만들 때에는 통상적으로 쓰이는 디자인 패턴들(MVC 혹은 개체-관계 다이어그램 등)을 버리고 씬들을 좀 더 자연스럽게 바라보기를 권장합니다.
pl: Podczas tworzenia gier z Godot, zalecane jest, aby odrzucić najbardziej powszechne wzorce projektowe, takie jak MVC lub diagramy Entity-Relationhip, a zamiast tego myśleć o swoich scenach w bardziej naturalny sposób. Zacznij od wyobrażenia sobie elementów widocznych w grze, które mogą być nazwane nie tylko przez programistę, ale przez każdego.
pt_br: Ao fazer jogos com o Godot, a abordagem recomendada é dispensar os padrões de concepção mais comuns, como MVC e diagramas de Entidade-Relacionamento, e, em vez disso, pensar nas suas cenas de uma forma mais natural. Comece imaginando os elementos visíveis do seu jogo, aqueles que conseguem ser citados não só pelo programador, mas por qualquer um.
ru: При создании игр с помощью Godot рекомендуется отклонить наиболее распространенные шаблоны проектирования, такие как MVC или диаграммы отношений сущностей, и вместо этого думать о своих сценах более естественным образом. Начните с воображения видимых элементов в вашей игре, тех, которые может назвать не только программист, но и кто угодно.
uk: При створенні ігор з Godot, рекомендується відмовитись від найбільш поширених моделей проектування, таких як діаграми MVC, або Entity-Relationship, а замість цього продумати свої сцени більш природним чином. Почніть з уявлення видимих елементів у вашій грі, тих, які може назвати не просто програміст, а будь-хто.
zh_cn: 当使用Godot制作游戏时，推荐的方法是把其他的设计风格例如MVC（模型-视图-控制器模式）或者实体关系图（E-R图）抛开，并且开始以一种自然的方式思考游戏。开始想象游戏中的所有可见元素，那些能够不只被程序员，而是能被任何人命名的东西。
zh_tw: 當使用 Godot 製作遊戲的時候，我們建議你忽略大多數常見的設計模式，例如 MVC 或 ER 圖等，轉而用更自然的方式思考場景的設計。可以先從想像遊戲中的單一元素開始，不只是程式設計師能叫出名字的元素，而是任何人都喊得出名字的元素。

source: For example, here's how a simple shooter game could be imagined:
cs: Například takhle by se dala představit jednoduchá střílečka:
de: So könnte man sich zum Beispiel einen simplen Shooter vorstellen:
es: Por ejemplo, aquí hay un ejemplo sencillo de cómo puede verse un juego de disparos:
fi: Esimerkiksi, yksinkertaisen ampumispelin voisi kuvitella näin:
fr: Par exemple, voici comment imaginer un simple jeu de tir :
it: Per esempio, ecco come un semplice sparatutto puó essere immaginato:
ja: たとえば、単純なシューティングゲームを想像する方法を次に示します:
ko: 예를 들자면 우리는 간단한 슈팅 게임을 다음과 같이 상상해볼 수 있습니다:
pl: Na przykład, oto jak można sobie wyobrazić prostą grę strzelecką:
pt_br: Por exemplo, aqui está como um jogo simples de tiro poderia ser imaginado:
ru: Например, вот как можно представить себе простую игру-шутер:
uk: Наприклад, ось як можна уявити просту гру стрілялки:
zh_cn: 比如说，想象一下有一个简单的射击游戏：
zh_tw: 例如，可以這樣想像簡單的射擊遊戲：

source: You can come up with a diagram like this for almost any kind of game. Write down the parts of the game that you can visualize, and then add arrows to represent ownership of one component by another.
cs: S takovým diagramem můžete přijít pro téměř jakoukoli hru. Zakreslete si ty části hry, které si můžete vizualizovat, a poté přidejte šipky znázorňující vlastnictví jedné komponenty druhou.
de: Solch ein Diagramm kann man für jedes mögliche Spiel erstellen. Schreibe auf, welche Teile des Spiels du visualisieren kannst und füge Pfeile hinzu um die Beziehungen zwischen den Komponenten zu repräsentieren.
es: Puedes crear un diagrama como este para casi cualquier tipo de juego. Escribe las partes del juego que puedes visualizar y luego añade flechas para representar la propiedad de un componente por otro.
fi: Voit keksiä tämänkaltaisen kaavion melkein minkä tahansa kaltaiselle pelille. Kirjoita ylös ne pelin osat, jotka voit visualisoida, ja lisää sitten nuolet kuvastamaan komponenttien omistussuhteita toisistaan.
fr: Vous pouvez créer un diagramme comme celui-ci pour presque tous les types de jeux. Notez les parties du jeu que vous pouvez visualiser, puis ajoutez des flèches pour représenter la possession d'un composant par un autre.
it: È possibile creare un diagramma come questo per quasi tutti i tipi di gioco. Scrivi le parti del gioco che puoi visualizzare, poi aggiungi frecce per rappresentare la proprietà di un componente da un altro.
ja: どんな種類のゲームでも、このような図を作成できます。視覚化できるゲームの部分を書いて、矢印を追加して、あるコンポーネントが別のコンポーネントの所有権を表すようにします。
ko: 무슨 게임을 디자인하든, 위와 같은 다이어그램을 그릴 수 있을 것입니다. 게임에서 시각화할 수 있는 부분들을 쭉 적어보고, 각 컴포넌트들의 소유권을 나타내주기 위한 화살표를 추가해줍니다.
pl: Możesz wymyślić taki schemat dla prawie każdego rodzaju gry. Zapisz części gry, które możesz wizualizować, a następnie dodaj strzałki, aby reprezentować własność jednego komponentu przez drugi.
pt_br: É possível chegar a um diagrama desse tipo para quase qualquer tipo de jogo. Anote as partes do jogo que consegue visualizar e daí adicione setas que representam a posse de um componente por outro.
ru: Вы можете придумать такую схему практически для любой игры. Запишите части игры, которые вы можете визуализировать, а затем добавьте стрелки, чтобы показать принадлежность одних компонентов другим.
uk: Ви можете створити подібну схему майже для будь-якої гри. Запишіть частини гри, які ви можете візуалізувати, а потім протягніть стрілки, щоб зрозуміти які компоненти, яким будуть належати.
zh_cn: 对于几乎任何类型的游戏，想出这样的图都很容易。只需要写下游戏中可以看到的部分，然后加上箭头来表示它们的所属关系。
zh_tw: 幾乎任何一種遊戲都可以用這種方式畫成圖片。先寫下遊戲裡可以被看到的部分，然後在每個部分用箭頭來表示這些元素的從屬關係。

source: Once you have a diagram like this, the recommended process for making a game is to create a scene for each element listed in the diagram. You'll use instancing (either by code or directly in the editor) for the ownership relationships.
cs: Jakmile budete mít schéma, doporučeným postupem pro tvorbu hry je vytvoření scény pro každý prvek uvedený v diagramu. Pro vlastnické vztahy použijete vytváření instancí (buď kódem ve skriptu nebo přímo v editoru).
de: Sobald du solch ein Diagramm hast, empfiehlt es sich für jedes Element im Diagramm eine Szene zu erstellen. Um die Beziehungen zu verwirklichen wirst du das Instanziieren (entweder im Code oder direkt im Editor) verwenden.
es: Cuando tengas un diagrama como este, el proceso recomendado para hacer un juego es crear una escena para cada elemento listado en el diagrama. Usaras instanciación (ya sea por código o directamente en el editor) para las relaciones de propiedad.
fi: Kun sinulla on tällainen kaavio, suositeltu menetelmä pelin tekemiseksi on luoda skene kutakin kaaviossa lueteltua elementtiä kohden. Käytät ilmentymiä (joko koodista tai suoraan editorista käsin) omistajuussuhteita varten.
fr: Une fois que vous avez un diagramme comme celui-ci, le processus recommandé pour créer un jeu est de créer une scène pour chaque élément répertorié dans le diagramme. Vous utiliserez l'instanciation (soit par code ou directement dans l'éditeur) pour les relations de possession.
it: Una volta che si dispone di un diagramma come questo il processo consigliato per la creazione di un gioco è quello di creare una scena per ogni elemento elencato nel diagramma. Si userà l'istanziazione (tramite codice o direttamente nell'editor) per i rapporti di proprietà.
ja: このような図を作成したら、図にリストされている各要素に対してシーンを作成することをお勧めします。所有関係にはインスタンス化(コードで、またはエディタで直接)を使用します。
ko: 다이어그램이 완성되었다면 게임을 만들 때 다이어그램에 있는 원소들에 대응되는 씬을 만들기를 권장합니다. 여기서 소유 관계를 나타내주기 위해 코드를 사용하든, 에디터로 직접하든 인스턴스화를 사용할 것입니다.
pl: Gdy masz już taki schemat, zalecanym procesem tworzenia gry jest stworzenie sceny dla każdego z elementów wymienionych na diagramie. Użyjesz instancjonowania (za pomocą kodu lub bezpośrednio w edytorze) dla relacji własnościowych.
pt_br: Com um diagrama desse tipo, o processo recomendado para fazer um jogo é criar uma cena para cada elemento listado no diagrama. Você usará instâncias (seja por código ou diretamente pelo editor) para as relações de posse.
ru: Как только вы получите такую схему, рекомендуем вам создать сцены для каждого элемента игры, указанного на схеме, так же используйте создание экземпляров (либо в коде, либо непосредственно в редакторе) для задания принадлежности одних компонентов к другим.
uk: Після того як ви намалюєте таку діаграму, рекомендований процес створення гри - це створення сцени для кожного елемента, перерахованого на діаграмі. Ви будете використовувати створення екземплярів (чи в коді, чи безпосередньо в редакторі) для побудови ієрархії відносин.
zh_cn: 一旦形成了这样的图，制作一个游戏就可以是为每个图中的节点创建一个场景。然后使用其实例（或通过代码，或通过编辑器）来表达所属关系。
zh_tw: 畫出這樣的圖之後，我們建議你為圖上的各個元素都建立一個場景來使用，再通過實體化來做出從屬關係 (可以用程式碼或是直接在編輯器裡實體化)。

source: A lot of time spent in programming games (or software in general) is on designing an architecture and fitting game components to that architecture. Designing based on scenes replaces that approach and makes development much faster and more straightforward, allowing you to concentrate on the game logic itself. Because most game components map directly to a scene, using a design based on scene instantiation means little other architectural code is needed.
cs: Hodně času stráveného při programováním her (nebo softwaru obecně) je o navrhování architektury a přizpůsobení herních komponent této architektuře. Navrh založený na scénách nahrazuje tento přístup a dělá vývoj mnohem rychlejším a přímočarějším, což vám umožňuje soustředit se na samotnou herní logiku. Protože většina herních komponent je mapována přímo na scénu, použití designu založeného na instancích scén znamená, že žádné další rozšiřování architektury kódem není většinou potřeba.
es: Gran parte del tiempo dedicado a programar juegos (o software en general) se destina a diseñar una arquitectura y ajustar componentes del juego a esa arquitectura. Diseñar en base a escenas reemplaza ese enfoque y hace el desarrollo mucho más rápido y directo, permitiéndote concentrarte en la lógica misma del juego. Como la mayoría de los componentes se relacionan directamente con una escena, usar un diseño basado en instanciación de escenas implica muy poco código arquitectural adicional.
fi: Iso osa pelien (tai ohjelmistojen ylipäänsä) ohjelmoimiseen kuluvasta ajasta menee arkkitehtuurin suunnitteluun ja pelikomponenttien sovittamiseen tuohon arkkitehtuuriin. Skeneihin pohjautuva suunnittelu korvaa tuon lähestymistavan ja tekee kehittämisestä paljon nopeampaa ja suoraviivaisempaa, antaen sinun keskittyä pelilogiikkaan itseensä. Koska useimmat pelikomponentit sopivat suoraan skeneiksi, skenejen ilmentymiin pohjautuvan suunnittelun käyttö tarkoittaa, että hyvin vähän muuta arkkitehtuurista koodia tarvitaan.
fr: Dans la programmation de jeux vidéos (ou de logiciels en général), une bonne partie du temps est consacrée à concevoir une architecture et à ajouter les composants du jeu dans cette architecture. La conception basée sur des scènes remplace cette approche et rend le développement plus rapide et plus simple, ce qui vous permet de vous concentrer sur la logique du jeu. Comme la plupart des composants du jeu correspondent directement à une scène, l'utilisation d'un design basé sur l'instanciation de la scène signifie que peu d'autres codes architecturaux sont nécessaires.
it: Molto tempo speso nella programmazione dei giochi (o del software in generale) è dedicato alla progettazione di un'architettura e all'adattamento dei componenti di gioco a tale architettura. La progettazione basata su scene sostituisce questo approccio e rende lo sviluppo molto più veloce e semplice, permettendoti di concentrarti sulla logica del gioco stesso. Poiché la maggior parte dei componenti di gioco sono mappati direttamente su una scena, l'utilizzo di un'istanziazione basata sulle scene significa che serve poco codice aggiuntivo.
ja: ゲーム(またはソフトウェア全般)のプログラミングに費やされる時間の多くは、アーキテクチャの設計とそのアーキテクチャへゲームコンポーネントを合わせることに使われます。シーンに基づいた設計はそのアプローチに代わるものであり、開発をより迅速かつ簡単に行えるため、ゲームロジック自体に集中できます。ほとんどのゲームコンポーネントはシーンに直接配置されるため、シーンのインスタンス化に基づくデザインを使用すると、他のアーキテクチャコードはほとんど必要ありません。
ru: В программировании игр (и в разработке вообще) много времени тратится на проектирование архитектуры самой игры и взаимосвязей между ее компонентами в рамках созданной архитектуры. Проектирование на основе сцен заменяет этот подход и делает разработку намного быстрее и более простой, позволяя вам сосредоточиться на самой логике игры. Поскольку большинство игровых компонентов отображаются непосредственно в сцене, то использование дизайна основанного на создании экземпляра сцены означает, что требуется немного другой подход для ее построения.
uk: Багато часу в програмуванні ігор (та і взагалі в розробці програм) витрачається на проектування архітектури та підлагодження ігрових компонентів до цієї архітектури. Проектування на основі сцен замінює такий підхід і робить розробку набагато швидшою і простішою, дозволяючи сконцентруватися на логіці гри. Оскільки більшість ігрових компонентів відображаються безпосередньо на сцені, проектування на основі інстансування сцен, означає, що інший архітектурний код не потрібен.
zh_tw: 開發遊戲 (或是一般軟體) 時，我們總會花費許多時間來設計架構，然後再花時間把遊戲的元素都套用到這個架構上。以場景為基礎來設計就取代了這個過程，讓開發變得更快速而且更直觀，也讓你能直接專注於實現遊戲本身的邏輯。由於大多數的遊戲元件都可以直接對應到場景上，使用使用以場景實體化為基礎的設計也就能在架構上花費較少的程式碼。
