Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/instancing.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: In the previous part, we saw that a scene is a collection of nodes organized in a tree structure, with a single node as its root. You can split your project into any number of scenes. This feature helps you break down and organize your game's different components.
pt_br: Na parte anterior, nós vimos que uma cena é uma coleção de nós organizados em uma estrutura de árvore, com um único nó como sua raiz. Você pode dividir seu projeto em qualquer número de cenas. Essa funcionalidade ajuda você a dividir e organizar os diferentes componentes do seu jogo.

source: As we mentioned in the previous part, instanced scenes behave like a node: the editor hides their content by default. When you instance the Ball, you only see the Ball node. Notice also how each duplicate has a unique name.
pt_br: Como mencionámos na parte anterior, as cenas instanciadas se comportam como um nó: o editor esconde o seu conteúdo por padrão. Quando você instancia a Bola, você vê apénas o nó Bola. Note também que cada duplicata tem um nome único.

source: Every instance of the Ball scene starts with the same structure and properties as ``Ball.tscn``. However, you can modify each independently, such as changing how they bounce, how heavy they are, or any property exposed by the source scene.
pt_br: Cada instância da cena Ball começa com a mesma estrutura e propriedades que ``Ball.tscn``. Porém, você pode modificar cada uma independentemente, tal como mudar como ela quica, o quão pesada ela é, ou qualquer propriedade exposta pela cena de origem.

source: Extract the archive on your computer. Then, open Godot, and in the project manager, click the Import button to import the project.
pt_br: Extraia o arquivo em seu computador. Depois, abra o Godot e no gerenciador de projects, clique no botão Importar para importar o projeto.

source: In the pop-up that appears, click the browse button and navigate to the folder you extracted.
pt_br: No pop-up que apareceu, clique o botão explorar e navegue até a pasta que você extraiu.

source: Double-click the ``project.godot`` file to open it.
pt_br: Clique duas vezes no arquivo ``project.godot ` para abri-lo.

source: Finally, click the Import & Edit button.
pt_br: Por fim, clique no botão Importar & Editar.

source: The project contains two packed scenes: ``Main.tscn``, containing walls against which the ball collides, and ``Ball.tscn``. The Main scene should open automatically.
pt_br: O projeto contém duas Cenas Empacotadas: ``Main.tscn``, contendo paredes contra as quais a bola colide, e ``Ball.tscn``. A cena principal deve abrir automaticamente.

source: Let's add a ball as a child of the Main node. In the Scene dock, select the Main node. Then, click the link icon at the top of the scene dock. This button allows you to add an instance of a scene as a child of the currently selected node.
pt_br: Vamos adicionar uma bola como um filho do nó principal. Na doca de Cena, selecione o nó Principal. Depois, clique no ícone de ligação na parte superior da doca de cena. Este botão permite-lhe adicionar uma instância de uma cena como filho do nó atualmente selecionado.

source: Double-click the ball scene to instance it.
pt_br: Clique duas vezes na cena da bola para instancia-la.

source: Click on it and drag it towards the center of the view.
pt_br: Clique nele e arraste-o para o centro da visualização.

source: Play the game by pressing F5. You should see it fall.
pt_br: Aperte F5 para jogar o jogo. Você deve vê-la cair.

source: Now, we want to create more instances of the Ball node. With the ball still selected, press :kbd:`Ctrl-D` (:kbd:`Cmd-D` on macOS) to call the duplicate command. Click and drag to move the new ball to a different location.
pt_br: Agora, queremos criar mais instâncias do nó Bola. Com a bola ainda selecionada, aperte :kbd:`Ctrl-D` (:kbd:`Cmd-D` no macOS) para chamar o comando duplicar. Clicque e arraste para mover a nova bola para um local diferente.

source: You can repeat this process until you have several in the scene.
pt_br: Você pode repetir esse processo até que você tenha vários na cena.

source: Play the game again. You should now see every ball fall independently from one another. This is what instances do. Each is an independent reproduction of a template scene.
pt_br: Jogue o jogo novamente. Agora você deve ver cada bola cair independentemente de uma da outra. Isso é o que instâncias fazem. Cama uma é uma reprodução independente de uma cena modelo.

source: There is more to instances. With this feature, you can:
pt_br: Instâncias possuem mais do que isso. Com essa funcionalidade, você pode:

source: Changing a property on an instance always overrides values from the corresponding packed scene.
pt_br: Mudar uma propriedade em uma instância sempre terá prioridade sobre os valores da Cena Empacotada correspondente.

source: Let's try this. Open ``Ball.tscn`` and select the Ball node. In the Inspector on the right, click on the PhysicsMaterial property to expand it.
pt_br: Vamos testar isso. Abra ``Ball.tscn``e selecione o nó Ball. No Inspetor à direita, clique na propriedade PhysicsMaterial para expandi-la.

source: Set its Bounce property to ``2`` by clicking on the number field, typing ``2``, and pressing :kbd:`Enter`.
pt_br: Clique no campo número e digite ``2``e aperte :kbd:`Enter` para definir a propriedade Bounce como 2.

source: Play the game by pressing :kbd:`F5` and notice how all balls now bounce a lot more. As the Ball scene is a template for all instances, modifying it and saving causes all instances to update accordingly.
pt_br: Rode o jogo apertando :kbd:`F5`e perceba que as bolas agora quicam muito mais. Como a cena Ball é um modelo para todas as instâncias, modificar e salvá-la causa que todas as instâncias atualizem de acordo.

source: Let's now adjust an individual instance. Head back to the Main scene by clicking on the corresponding tab above the viewport.
pt_br: Agora vamos ajustar uma instância individual. Clique na aba correspondente acima da janela de exibição para voltar para a cena Main.

source: Select one of the instanced Ball nodes and, in the Inspector, set its Gravity Scale value to ``10``.
pt_br: Selecione um dos nós Ball instanciados e, no Inspetor, mude sua Escala de Gravidade para ``10``.

source: Rerun the game and notice how this ball now falls much faster than the others.
pt_br: Rode o jogo de novo e perceba que essa bola agora caí muito mais rápida que as outras.

source: If you change a value on the ``PhysicsMaterial`` of one instance, it will affect all the others. This is because ``PhysicsMaterial`` is a resource, and resources are shared between instances. To make a resource unique for one instance, right-click on it in the Inspector and click Make Unique in the contextual menu.
pt_br: Se você mudar um valor no ``PhysicsMaterial`` de uma instância, isso afetará todas as outras. Isso é porque ``PhysicsMaterial`` é um recurso, e recursos são compartilhados entre instâncias. Para fazer um recurso único para uma instância, clique nele com o botão direito no Inspetor e clique Tornar Único no menu contextual.

source: Resources are another essential building block of Godot games we will cover in a later lesson.
pt_br: Recursos são outro bloco de construção essencial de jogos Godot que cobriremos em uma lição posterior.

source: Scene instances as a design language
pt_br: Instâncias de Cenas como uma linguagem de design

source: Instances and scenes in Godot offer an excellent design language, setting the engine apart from others out there. We designed Godot around this concept from the ground up.
pt_br: Instâncias e cenas no Godot oferecem uma excelente linguagem de design, distinguindo a engine de outras. Concebemos o Godot em torno deste conceito desde o início.

source: We recommend dismissing architectural code patterns when making games with Godot, such as Model-View-Controller (MVC) or Entity-Relationship diagrams. Instead, you can start by imagining the elements players will see in your game and structure your code around them.
pt_br: Nós recomendamos ignorar padrões de código de arquitetura, tal como o Model-View-Control (MVC) ou diagramas Relação-Entidade, ao fazer jogos com Godot. Ao invés disso, você pode começar imaginando os elementos que jogadores verão em seu jogo e estruturar seu código ao redor deles.

source: Imagine we started by creating the room. We could make a couple of different room scenes, with unique arrangements of furniture in them. Later, we could make a house scene that uses multiple room instances for the interior. We would create a citadel out of many instanced houses and a large terrain on which we would place the citadel. Each of these would be a scene instancing one or more sub-scenes.
pt_br: Imagine que começamos criando a sala. Poderíamos fazer algumas cenas de salas diferentes, com arranjos únicos de móveis nelas. Mais tarde, poderíamos fazer uma cena de casa que usa várias instâncias de sala para o interior. Criaríamos uma cidadela com muitas casas instanciadas e um grande terreno no qual colocaríamos a cidadela. Cada uma delas seria uma cena instanciando uma ou mais sub-cenas.

source: Summary
pt_br: Resumo

source: Instancing, the process of producing an object from a blueprint has many handy uses. With scenes, it gives you:
pt_br: Instanciar, o processo de produzir um objeto a partir de um plano tem muitos usos úteis. Com cenas, ele lhe dá:

source: The ability to divide your game into reusable components.
pt_br: A capacidade de dividir seu jogo em componentes reutilizáveis.

source: A tool to structure and encapsulate complex systems.
pt_br: Uma ferramenta para estruturar e encapsular sistemas complexos.

source: A language to think about your game project's structure in a natural way.
pt_br: Uma linguagem para pensar sobre a estrutura do seu projeto de jogo de uma forma natural.

source: Translation status
pt_br: Estado da Tradução

source: Instancing
cs: Instancing (vytváření instancí)
de: Instanziieren
es: Instanciar
fi: Ilmentymien luonti
fr: Instancier
it: Instanziare
ja: インスタンス
ko: 인스턴스(Instance)하기
pl: Tworzenie instancji
ru: Создание экземпляров
uk: Instancing (вставка екземпляра, Інстансування)
zh_cn: 实例化
zh_tw: 實體化

source: Introduction
cs: Úvod
de: Einführung
es: Introducción
fi: Johdanto
it: Introduzione
ja: はじめに
ko: 소개
pl: Wprowadzenie
ru: Введение
uk: Вступ
zh_cn: 简介
zh_tw: 簡介

source: Creating a single scene and adding nodes into it might work for small projects, but as a project grows in size and complexity, the number of nodes can quickly become unmanageable. To address this, Godot allows a project to be separated into any number of scenes. This provides you with a powerful tool that helps you organize the different components of your game.
cs: Vytvoření jedné scény a přidávání všech uzlů do ní může fungovat pro malé projekty, Ale jak se projekt zvětšuje a komplikuje, počet uzlů nám může rychle přelést přez hlavu. Godot proto umožňuje rozdělit projekt do libovolného množství scén. Tím dostáváme do ruky mocný nástroj, který nám pomůže přehledně uspořádat rozdílně komponenty celé hry.
de: Eine einzelne Szene zu erstellen und ihr alle benötigten Nodes hinzuzufügen, kann bei kleinen Projekten funktionieren. Aber wenn ein Projekt an Größe und Komplexität zunimmt, wird der Nodebaum schnell unübersichtlich. Godot erlaubt es, ein Projekt in beliebig viele Szenen aufzuteilen. Damit steht Ihnen ein mächtiges Werkzeug zur Verfügung, das Ihnen hilft, die verschiedenen Komponenten Ihres Spiels zu organisieren.
es: Crear una escena simple y agregar nodos puede servir para proyectos pequeños, pero cuando un proyecto crece en tamaño y complejidad, el número de nodos se puede volver rápidamente inmanejable. Para abordar eso, Godot permite que un proyecto pueda separarse en cualquier número de escenas. Esto provee una poderosa herramienta que ayuda a organizar los diferentes componentes de tu juego.
fi: Yksittäisen skenen luonti ja solmujen lisääminen siihen voi toimia pienelle projektille, mutta kun projektin koko ja monimutkaisuus kasvaa, solmujen määrästä muuttuu pian hallitsemattomaksi. Tämän ratkaisemiseksi Godot sallii projektin jakamisen useisiin skeneihin. Se tarjoaa sinulle tehokkaan työkalun, joka auttaa järjestelemään pelisi eri komponentit.
fr: La création d'une scène unique et l'ajout de nœuds peuvent fonctionner pour de petits projets, mais à mesure que la taille et la complexité d'un projet augmentent, le nombre de nœuds peut rapidement devenir ingérable. Pour y remédier, Godot permet de séparer un projet en un nombre quelconque de scènes. Cela vous fournit un outil puissant qui vous aide à organiser les différentes composantes de votre jeu.
it: Creare una singola scena e aggiungere nodi a questa puó funzionare per piccoli progetti ma, quando il progetto diventa piú grande e complesso, il numero di nodi puó diventare rapidamente ingestibile. Per risolvere questo problema Godot permette che un progetto sia separato in un qualsiasi numero di scene in modo da avere uno strumento che ti aiuti adn organizzare le diverse componenti di un gioco.
ja: 1つのシーンを作成してノードを追加すると、小規模なプロジェクトでは機能しますが、プロジェクトのサイズと複雑さが増すにつれて、ノードの数がすぐに管理できなくなる可能性があります。これに対処するために、Godot ではプロジェクトを任意の数のシーンに分割することが許されています。これにより、ゲームのさまざまなコンポーネントを整理するのに役立つ強力なツールが提供されます。
ko: 하나의 씬를 만들고 노드를 추가하는 것은 작은 프로젝트에는 적합할지도 모릅니다. 하지만 프로젝트의 규모가 커지고 복잡해지면서, 수많은 노드들은 곧바로 다루기 어려워집니다. 이를 해결하기 위해 Godot에서는 프로젝트를 여러 개의 씬으로 나눌 수 있습니다. 이것으로 게임의 서로 다른 구성 요소를 조직하는데 큰 도움이 될 수 있습니다.
pl: Tworzenie pojedynczej sceny i dodawanie do niej węzłów może działać w przypadku małych projektów, ale wraz ze wzrostem rozmiaru i złożoności projektu liczba węzłów może szybko stać się niemożliwa do opanowania. Aby temu zaradzić, Godot pozwala aby projekt został podzielony na dowolną liczbę scen. W ten sposób otrzymasz potężne narzędzie, które pomoże Ci zorganizować różne elementy gry.
ru: Создание одной сцены и добавление узлов в нее может работать в небольших проектах, но по мере роста сложности проекта количество узлов может быстро стать огромным. Чтобы решить эту проблему, Godot позволяет разделить проект на любое количество сцен. Это дает вам мощный инструмент, который поможет вам организовать различные компоненты вашей игры.
uk: Створення одної сцени та додавання до неї вузлів може працювати для маленьких проектів, але по мірі збільшення проекта в розмірах і складності, кількість вузлів може швидко стати некерованою. Щоб вирішити це, Godot дозволяє розділити проект на будь-яку кількість сцен. Це дає вам потужний інструмент, який допоможе організувати різні компоненти вашої гри.
zh_cn: 创建单个场景并向其中添加节点，这可能适用于小型项目，但随着项目规模和复杂度的增长，节点数量可能很快变得无法管理。为了解决这个问题，Godot允许一个项目被分成许多场景。这提供了一个强大的工具，有助于组织游戏的不同组件。
zh_tw: 對於小型的專案來說，建立單一場景然後把各個節點都加到同一個場景下可能沒關係。但當專案的大小與複雜度都成長後，節點的數量很快就會變得難以管理。為了解決這個問題，Godot 中可以將專案拆分成任意數量的場景，進而將遊戲整理成各個不同的模組。

source: In :ref:`doc_scenes_and_nodes` you learned that a scene is a collection of nodes organized in a tree structure, with a single node as the tree root.
cs: V :ref:`doc_scenes_and_nodes` jste se dozvěděli, že scéna je skupina uzlů uspořádaných ve stromové struktuře s jediným uzlem kořenovým.
de: In :ref:`doc_scenes_and_nodes` haben Sie gelernt, dass eine Szene eine Sammlung von Nodes ist, die in einer Baumstruktur organisiert sind, mit einem Node als Wurzel.
es: En :ref:`doc_scenes_and_nodes` has aprendido que una escena es una colección de nodos organizados en una estructura de árbol, con un nodo simple como raíz del árbol.
fi: Kappaleessa :ref:`doc_scenes_and_nodes` opit, että skene on kokoelma solmuja puurakenteeseen järjestettynä, niin että yksi solmu toimii puun juurena.
fr: Dans :ref:`doc_scenes_and_nodes` vous avez appris qu'une scène est une collection de nœuds organisés dans une structure arborescente, avec un seul nœud comme racine de l'arbre.
it: In :ref:`doc_scenes_and_nodes` hai imparato che una scena é una collezione di nodi organizzata in una struttura ad albero, con un singolo nodo come radice.
ja: :ref:`doc_scenes_and_nodes`\ では、シーンはツリー構造で編成されたノードのコレクションであり、単一のノードがツリールートであることを学びました。
ko: :ref:`doc_scenes_and_nodes`\ 에서 말하길, 씬은 노드들이 트리 구조로 조직된 묶음이고, 하나의 노드가 트리의 루트가 된다고 했습니다.
pl: W :ref:`doc_scenes_and_nodes` dowiedziałeś się, że scena jest zbiorem węzłów zorganizowanych w strukturę drzewa, z pojedynczym węzłem jako korzeniem drzewa.
ru: В :ref:`doc_scenes_and_nodes` вы узнали, что сцена представляет собой набор узлов, организованных в древовидной структуре, с единственным узлом в качестве корня дерева.
uk: В :ref:`doc_scenes_and_nodes` ви дізналися, що сцена - це сукупність вузлів, організованих у структурі дерева, з одним вузлом в якості кореня дерева.
zh_cn: 在 :ref:`doc_scenes_and_nodes` 中，你已了解场景是一个以树结构组织的节点的集合，并由单个节点作为树的根节点。
zh_tw: 我們已經在 :ref:`doc_scenes_and_nodes` 裡學過，場景就是由依據樹狀組織的節點所構成的，而其中會有一個節點作為樹的根節點。

source: You can create as many scenes as you like and save them to disk. Scenes saved in this manner are called "Packed Scenes" and have a ``.tscn`` filename extension.
cs: Můžete vytvořit libovolný počet scén a uložit je na disk. Takto uložené scény se nazývají "Sbalené scény" a mají příponu názvu souboru ``.tscn`` .
de: Sie können beliebig viele Szenen erstellen und speichern. Auf diese Weise gespeicherte Szenen werden "Verpackte Szenen" genannt und haben die Dateinamenerweiterung ``.tscn``.
es: Puedes crear cuantas escenas quieras y grabarlas en el disco. Las escenas grabadas de esta manera se llaman "Packed Scenes" y tienen una extensión de archivo ``.tscn``.
fi: Voit luoda niin monta skenejä kuin haluat ja tallentaa ne levylle. Tähän tapaan tallennettuja skenejä kutsutaan "Pakatuiksi skeneiksi" ja niillä on ``.tscn`` tiedostopääte.
fr: Vous pouvez créer autant de scènes que vous le souhaitez et les sauvegarder sur disque. Les scènes sauvegardées de cette manière sont appelées "Scènes empaquetés" (*Packed Scenes*) et ont une extension de nom de fichier ``.tscn``.
it: Puoi creare quante scene vuoi e salvarle su disco. Le scene salvate in questa maniera sono chiamate "Packed Scenes" e hanno estensione ``.tscn``.
ja: 必要な数のシーンを作成し、ディスクに保存できます。この方法で保存されたシーンは「パックされたシーン」と呼ばれ、 ``.tscn`` の拡張子を持ちます。
ko: 많은 씬을 원하는 만큼 만들어서 디스크에 저장할 수 있습니다. 씬은 "Packed Scenes(압축된 씬)"라 불리는 방식으로 저장되고, ``.tscn`` 파일 확장자 이름을 갖습니다.
pl: Można tworzyć dowolną liczbę scen i zapisywać je na dysku. Zapisane w ten sposób sceny nazywane są "Spakowanymi Scenami" i mają rozszerzenie nazwy pliku ``.tscn``.
ru: Вы можете создать столько сцен, сколько хотите, и сохранить их на диск. Сцены, сохраненные таким образом, называются "Упакованные сцены" (Packed Scenes) и имеют расширение ``.tscn``.
uk: Ви можете створити скільки завгодно сцен і зберегти їх на диску. Сцени, збережені таким чином, називаються "упакованими сценами" і мають розширення ``.tscn``.
zh_cn: 可以创建任意多的场景并将其保存到磁盘。以这种方式保存的场景被称为“打包场景”，并会有个 ``.tscn`` 扩展名。
zh_tw: 可以建立任意數量的場景並保存在硬碟上。場景會用一種叫做「打包場景 (Packed Scenes)」的形式保存，副檔名為 ``.tscn``。

source: Once a scene has been saved, it can be instanced into another scene as if it were any other node.
cs: Jakmile je scéna uložena, může být vložena (instalována, aj: instanced) do jiné scény, jako by byla jakýmkoliv jiným uzlem.
de: Sobald eine Szene gespeichert wurde, kann sie in eine andere Szene instanziiert werden, als wäre sie ein Node.
es: Una vez que se ha guardado la escena, se puede instanciar en otra escena como cualquier otro nodo.
fi: Kun skene on tallennettu, siitä voidaan luoda ilmentymä toiseen skeneen ikään kuin se olisi mikä tahansa muu solmu.
fr: Une fois qu'une scène a été sauvegardée, elle peut être instanciée dans une autre scène comme s'il s'agissait d'un autre nœud.
it: Una volta che una scena é stata salvata puó successivamente essere istanziata all'interno di un'altra scena esattamente come qualunque altro nodo.
ja: セーブしたシーンは、他のノードと同じように別のシーンでインスタンス化できます。
ko: 일단 씬 하나를 저장한다면, 다른 씬으로 인스턴스(Instance)할 수 있습니다. 다른 노드들처럼 말이죠.
pl: Po zapisaniu sceny można tworzyć jej instancje by przenieść do innej sceny, tak jakby była to inna scena.
ru: Как только сцена была сохранена, ее можно интегрировать в другую сцену, как если бы это был любой другой узел.
uk: Після того, як сцена збережена, її можна встановити (інстансувати) в іншу сцену так, ніби це який-не-будь вузол.
zh_cn: 一旦场景被保存，它就可以被实例化到另一个场景中，就像它是任何其他节点一样。
zh_tw: 場景儲存後就能像其他節點一樣實體化到另一個場景內。

source: In the above picture, Scene B was added to Scene A as an instance.
cs: Na výše uvedeném obrázku byla scéna B přidána do scény A jako instance.
de: Im obigen Bild wurde Szene B als Instanz zu Szene A hinzugefügt.
es: En la imagen anterior, Scene B se añadió a Scene A como una instancia.
fi: Yllä olevassa kuvassa skene B lisättiin ilmentymänä skeneen A.
fr: Dans l'image ci-dessus, la scène B a été ajoutée à la scène A en tant qu'instance.
it: Nell'immagine sopra, la Scena B é stata aggiunta alla Scena A come istanza.
ja: 上の図では、シーンBがインスタンスとしてシーンAに追加されました。
ko: 위 그림에서 씬 B는 씬 A에 인스턴스로 추가되었습니다.
pl: Na powyższym zdjęciu Scena B została dodana do Sceny A.
ru: На вышеприведенном рисунке сцена В была добавлена в сцену А в качестве узла.
uk: На малюнку вище Сцена B була встановлена в Сцену А в якості вузла-нащадка.
zh_cn: 在上面的图片中，场景B作为实例被添加到A中。
zh_tw: 在上面的圖片中，場景 B 被新增到場景 A 中作為實體。

source: Instancing by example
cs: Vytvoření instance - příklad
de: Instanziieren anhand eines Beispiels
es: Instanciar con ejemplos
fi: Esimerkki ilmentymien luonnista
fr: L'instanciation par l'exemple
it: Instanziazione per esempi
ja: インスタンス化の例
ko: 예제를 통해 인스턴스하기
pl: Instancjowanie na przykładzie
ru: Создание экземпляров на примере
uk: Зразок інстансування
zh_cn: 通过示例实例化
zh_tw: 實體化的例子

source: To learn how instancing works, let's start by downloading a sample project: :download:`instancing.zip <files/instancing.zip>`.
cs: Chcete-li se dozvědět, jak funguje vytváření instancí, začněte stažením ukázkového projektu: :download:`instancing.zip <files / instancing.zip>`.
de: Um zu lernen, wie die Instanziierung funktioniert, laden wir zunächst ein Beispielprojekt herunter: :download:`instancing.zip <files/instancing.zip>`.
es: Para aprender cómo funciona instanciar, comencemos descargando un proyecto de ejemplo: :download:`instancing.zip <files/instancing.zip>`.
fi: Oppiaksesi kuinka ilmentymien luonti toimii, aloitetaan lataamalla esimerkkiprojekti: :download:`instancing.zip <files/instancing.zip>`.
fr: Pour apprendre comment fonctionne l'instanciation, commençons par télécharger un exemple de projet : :download:`instancing.zip <files/instancing.zip>`.
it: Per capire come funziona l'instanziazione, iniziamo scaricando un progetto di esempio: :download:`instancing.zip <files/instancing.zip>`.
ja: インスタンス化のしくみを学ぶには、サンプル プロジェクトをダウンロードして始めましょう: :download:`instancing.zip <files/instancing.zip>`\ 。
ko: 어떻게 인스턴스가 이루어지는지 배우기 위해, 먼저 샘플 프로젝트를 다운로드합시다: :download:`instancing.zip <files/instancing.zip>`.
pl: Aby dowiedzieć się, jak działa instancjowanie, zacznijmy od pobrania przykładowego projektu: :download:`instancing.zip <files/instancing.zip>`.
ru: Чтобы узнать, как это работает, давайте начнем с загрузки примера проекта: :download:`instancing.zip <files/instancing.zip>`.
uk: Щоб краще зрозуміти, як створювати екземпляр (instancing), давайте завантажимо зразок проекту: :download:`instancing.zip <files/instancing.zip>`.
zh_cn: 要了解实例化如何工作，我们先下载一个示例项目： :download:`instancing.zip <files/instancing.zip>`。
zh_tw: 讓我們先下載一個範例專案來瞭解實體化是怎麼運作的： :download:`instancing.zip <files/instancing.zip>` 。
