Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/instancing_continued.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Let's take a look at one more, somewhat more complex, example of an open-world type game with lots of assets and nested elements:
cs: Podívejme se na další, poněkud složitější příklad hry typu open-world se spoustou zdrojů a vnořených prvků:
de: Schauen wir uns num etwas komplexeres wie zum Beispiel ein Open-World Spiel an, welches viele Assets und verschachtete Elemente besitzt:
es: Veamos un ejemplo, un poco más complejo, de un juego tipo mundo abierto con muchos recursos y elementos anidados:
fi: Katsotaanpa jälleen yhtä, hieman monimutkaisempaa esimerkkiä avoimen maailman tyyppisestä pelistä, jossa on paljon assetteja ja muita sisäkkäisiä elementtejä:
fr: Jetons un coup d’œil à un exemple supplémentaire, un peu plus complexe, d'un jeu de type monde ouvert avec beaucoup de ressources et d'éléments imbriqués :
it: Osserviamo un altro esempio, forse un po' più complesso, di un gioco in stile open-world pieno di assets ed elementi intrecciati:
ja: アセットとネストされた要素が多いオープンワールド型ゲームの例をもう1つ見てみましょう:
ko: 좀 더 복잡한 예시를 들어보겠습니다. 한 번 애셋들도 많고, 중첩된 원소들이 많은 오픈월드 게임을 살펴보죠:
pl: Przyjrzyjmy się jeszcze jednemu, nieco bardziej złożonemu przykładowi gry typu open-world z dużą ilością zasobów i elementów zagnieżdżonych:
pt_br: Vamos dar uma olhada em mais um exemplo, um tanto mais complexo, de um jogo do tipo mundo aberto, com muitos ativos e elementos aninhados:
ru: Рассмотрим еще один, несколько более сложный пример игры открытого типа с большим количеством ресурсов и вложенных элементов:
uk: Давайте розглянемо ще один, дещо складніший, приклад гри відкритого типу з великою кількістю ресурсів та вкладених елементів:
zh_cn: 我们来看看另一个更复杂的开放世界类游戏的例子，它有很多资源和嵌套元素：
zh_tw: 再來看看另一個某方面來說更複雜的例子。這個例子是開放世界類型的遊戲，有很多素材以及巢狀的元素：

source: Take a look at the room element. Let's say we started there. We could make a couple of different room scenes, with different arrangements of furniture (also scenes) in them. Later, we could make a house scene, connecting rooms to make up its interior.
cs: Podívejte se na prvek Místnost. Řekněme, že jsme tam začali. Mohli bychom vytvořit několik různých scén Místností s různým uspořádáním Nábytku (také scén). Později bychom mohli vytvořit scénu Dům, propojit Místnosti a vytvořit tak její interiér.
de: Schau die das Raumelement an. Beginnen wir hier. Wir könnten ein Paar verschiedene Raumszenen anlegen, welche verschiedene Sammlungen an Möbeln(ebenfalls Szenen) beinhalten. Später können wir eine Hausszene erstellen, welche die Räume verbindet und so das Innere beschreibt.
es: Observa el elemento de la habitación (room). Digamos que empezamos allí. Podríamos hacer un par de escenas de habitación diferentes, con diferentes disposiciones de muebles (también escenas) en ellas. Más tarde, podríamos hacer una escena de casa (house), conectando habitaciones para conformar su interior.
fi: Vilkaise huone-elementtiä. Sanokaamme, että aloitamme siitä. Voisimme tehdä muutaman eri huoneskenen erilaisilla huonekalujen (myöskin skenejä) järjestyksillä. Myöhemmin, voisimme tehdä taloskenen, yhdistäen huoneet sen sisätiloiksi.
fr: Prenons par exemple l'élément "room" (pièce) du diagramme. Disons que nous commencions par ici. Nous pourrions alors créer quelques variantes de la scène "room", avec différents arrangements de meubles (eux-mêmes des scènes) à l'intérieur. Plus tard nous pourrions même créer une scène "house" (maison) faisant la connexion entre les différentes scènes "room" et créant ainsi son intérieur.
it: Date un'occhiata all'elemento della stanza. Presupponiamo di iniziare lì. Potremmo creare una serie di differenti scene per ciascuna stanza, con diverse disposizioni dei mobili (anch'esse scene). In seguito, potremmo creare una scena per la casa, e connettere tutte le stanze precedenti per formare tutti i suoi interni.
ja: 部屋の要素を見てみましょう。そこから始めたとしましょう。家具(シーンも)の配置が異なる複数の異なる部屋のシーンを作成できます。後で、部屋を接続して内部を構成する家のシーンを作成できます。
ko: 방 원소를 살펴보죠. 우리가 시작하는 부분을 봅시다. 우리는 가구 배치를 달리하여 서로 다른 두 가지의 방 씬을 만들 수 있습니다. 나중에는, 방들을 연결해서 집 씬을 만들 수도 있습니다.
pl: Przyjrzyj się pokojowi. Powiedzmy, że właśnie tutaj zaczynamy. Mogliśmy wykonać kilka różnych scen pokojów, z różnymi aranżacjami mebli (także scen) w nich. Potem mogliśmy stworzyć scenę dom, łączącą pokoje i tworzącą jej wnętrze.
pt_br: Dê uma olhada no elemento "aposento". Digamos que começamos por lá. Nós poderíamos fazer algumas outras cenas de aposentos diferentes, com diferentes disposições dos móveis (que também são cenas) neles. Depois, poderíamos fazer uma cena de casa, conectando aposentos para compor seu interior.
ru: Взгляните на такой элемент как комната. Допустим, мы начнем от туда. Мы могли бы сделать несколько различных сцен комнат, с различными расположениями мебели (также сцены) в них. Позже мы могли бы сделать сцену дома, соединяя комнаты, чтобы создать его интерьер.
uk: Погляньте на елемент кімнати. Скажімо, ми там почали. Ми могли б зробити кілька різних сцен кімнати з різним розташуванням меблів (також сцен) в них. Пізніше ми могли б зробити сцену будинку, з'єднавши кімнати, щоб скласти його інтер'єр.
zh_cn: 看一看房间（Room）元素。我们从这开始。我们制作几个不同的房间场景，里面有不同的家具（和场景）布置。然后我们做一个房屋（House）场景，用这些房间来填充内部。
zh_tw: 先來從房間元素開始。我們可以做幾個不同的房間場景，裡面用不同的方式來排列傢俱 (傢俱也是場景)。之後我們就能做一個房子場景，然後再把房間接上去就有了內部構造了。

source: Then, we could make a citadel scene, which is made out of many instanced houses. Then, we could start working on the world map terrain, adding the citadel onto it.
cs: Pak bychom mohli vytvořit scénu Citadely, která je vyrobena z mnoha instancí Domů. Potom bychom mohli začít pracovat na Terénu mapy světa a přidat do něj Citadelu.
de: Dann könnten wir eine Szene für eine Festung erstellen, welche aus vielen dieser instanziierten Häuser besteht. Danach könnten wir anfangen und das Terrain auf der Weltkarte erstellen und dort die Festung hinzufügen.
es: Entonces, podríamos crear una escena de ciudadela (citadel), la cual está compuesta por muchas casas instanciadas. Entonces, podríamos empezar a trabajar en el terreno del mapa del mundo, añadiendo la ciudadela a él.
fi: Sen jälkeen voisimme tehdä linnoitusskenen, joka on luotu useista talojen ilmentymistä. Sitten voisimme alkaa työstää maailmankarttaa, lisäten linnoituksen siihen.
fr: Ensuite, nous pourrions faire une scène citadelle, qui est faite de nombreuses maisons instanciées. Ensuite, nous pourrions commencer à travailler sur le terrain de la carte du monde, en y ajoutant la citadelle.
it: Poi, potremmo creare una scena per la cittadella, che sarà formata da tutte le istanze delle case. In seguito, potremmo iniziare a lavorare sulla mappa del gioco, aggiungendo la cittadella al suo interno.
ja: その後、我々は多くのインスタンス化された家から作られた要塞のシーンを作ることができました。その後、世界地図の地形に取り組み始め、要塞を追加しました。
ko: 그런 뒤, 많은 인스턴스된 집들로 이루어진 성 씬을 만들 수 있습니다. 그리고, 월드 맵 지형에 성을 추가하는 작업을 할 수 있습니다.
pl: Wtedy moglibyśmy stworzyć scenę cytadeli, która składa się z wielu instancji domów. Wtedy moglibyśmy zacząć pracę na mapie świata, dodając do niej cytadelę.
pt_br: Então, poderíamos fazer a cena de uma cidadela, que é composta por muitas instâncias de casas. Assim, poderíamos começar a trabalhar no terreno do mapa do mundo, adicionando a cidadela nele.
ru: Затем мы могли бы сделать сцену крепости, которая сделана из многих экземпляров домов. Затем мы могли бы начать работать над рельефом карты мира, добавив на нее нашу крепость.
uk: Потім ми могли б зробити сцену цитаделі, яка зроблена з багатьох екземплярів будинків. Далі ми могли б почати працювати над місцевою картою світу, додавши на неї цитадель.
zh_cn: 然后，我们可以制作一个城堡（Citadel）场景，有许多实例化的房屋在里面。然后我们可以在世界地图地形（Terrain）上工作了，将城堡添加进来。
zh_tw: 接著，我們可以做一個城堡場景，城堡就是由很多房子的實體所組成的。再來就可以開始處理世界地圖的地形了，然後把城堡放進去裡面。

source: Later, we could create scenes that represent guards (and other NPCs) and add them to the citadel as well. As a result, they would be indirectly added to the overall game world.
cs: Později bychom mohli vytvořit scény, které představují Stráže (a další NPC) a také je přidat do Citadely. V důsledku toho by byli nepřímo přidáni do celého herního světa.
de: Später könnten wir Szenen anlegen, die Wachen repräsentieren (und ander NPCs) und dieser der Festung hinzufügen. Das Resultat wäre, dass sie indirekt der kompletten Spielwelt hinzugefügt werden.
es: Más adelante, podrímos crear escenas que representasen guardias (y otros NPCs) y también añadirlos a la ciudadela. Como resultado, se añadirían indirectamente al mundo del juego en general.
fi: Myöhemmin, voisimme luoda skenejä, jotka edustavat vartijoita (ja muita ei-pelaajahahmoja) ja lisätä ne myös linnoitukseen. Sen seurauksena ne lisättäisiin epäsuorasti koko pelimaailmaan.
fr: Plus tard, nous pourrions créer des scènes représentant des gardes (et d'autres PNJs) et les ajouter à la citadelle. En conséquence, ils seraient indirectement ajoutés à l'ensemble du monde du jeu.
it: Poi, potremmo creare scene rappresentanti guardie (e altri NPC) e aggiungere anch'essi alla cittadella. Di conseguenza, verranno indirettamente aggiunti al complessivo mondo di gioco.
ja: 後で、衛兵(及び他のNPC)を表すシーンを作成し、要塞に追加することもできます。その結果、ゲームの世界全体に間接的に追加されます。
ko: 나중에는, 경호원이나 다른 NPC들의 씬을 만들고 성에 추가 할 수 있습니다. 그 결과, 그것들은 게임 세상에 간접적으로 추가됩니다.
pl: Później mogliśmy tworzyć sceny reprezentujące strażników (i innych NPC-ów) i dodawać je do cytadeli. W rezultacie zostałyby one pośrednio dodane do całego świata gier.
pt_br: Posteriormente, poderíamos criar cenas que representem guardas (e outros personagens não jogáveis) e adicioná-los na cidadela também. Como resultado, eles seriam indiretamente adicionados no mundo do jogo.
ru: Позже мы можем создать сцены, которые представляют собой охранников (и других NPC) и добавить их в нашу крепость. В результате, они будут косвенно добавлены в общий игровой мир.
uk: Пізніше ми могли б створити сцени, які представляють охоронців (та інших NPC) і додати їх до цитаделі. Як результат, вони будуть опосередковано додані до загального ігрового світу.
zh_cn: 然后，我们可以创建代表卫兵（和其它NPC）的场景，并将它们添加到城堡中。因此，它们会间接地被加入到整个游戏世界。
zh_tw: 接下來我們可以建立一些代表守衛 (以及其他 NPC) 的場景，然後也把這些場景都加進城堡裡。這樣一來，這些 NPC 就間接地進到了整個遊戲世界裡了。

source: With Godot, it's easy to iterate on your game like this, as all you need to do is create and instance more scenes. Furthermore, the editor UI is designed to be user friendly for programmers and non-programmers alike. A typical team development process can involve 2D or 3D artists, level designers, game designers, and animators, all working with the editor interface.
cs: S Godotem je snadné takto postupně budovat vaši hru, protože vše, co musíte udělat, je vytvořit další scény a následně jejich instance. Kromě toho je uživatelské rozhraní editoru navrženo tak, aby bylo uživatelsky přívětivé pro programátory i neprogramátory. Typický proces týmového vývoje může vyžadovat 2D nebo 3D umělce, návrháře úrovní, herní návrháře a animátory, všechny pracující s jedním editorem.
de: Mit Godot ist es einfach neue Objekte hinzuzufügen, alles was man tun ist ist mehr Szenen zu erstellen und zu initiieren. Darüber hinaus ist die UI des Editors so entworfen worden, dass sie benutzerfreunflich für Programmiere und nicht Programmierer ist. Ein typisches Entwicklerteam kann 2D und 3D Künstler, Leveldesigner, Gamedesigner und Animateure einschließen, die alle mit diesem Editorinterface arbeiten.
es: Con Godot, es fácil iterar en tu juego de esta manera, ya que todo lo que necesitas hacer es crear e instanciar más escenas. Además, la interfaz UI del editor está diseñada para que sea fácil de usar tanto para programadores como para no programadores. Un proceso típico de desarrollo en equipo puede involucrar artistas 2D o 3D, diseñadores de nivel, diseñadores de juegos y animadores, todos trabajando con la interfaz del editor.
fi: Godotin avulla on helppo iteroida peliäsi tähän tapaan, kaikki mitä sinun tarvitsee tehdä on luoda uusia skenejä ja niistä ilmentymiä. Lisäksi editorin käyttöliittymä on suunniteltu helppokäyttöiseksi yhtä lailla ohjelmoijille kuin ei-ohjelmoijillekin.
fr: Avec Godot, il est facile d'itérer sur votre jeu comme ceci, car tout ce que vous avez à faire est de créer et d'instancier plus de scènes. De plus, l'interface utilisateur de l'éditeur est conçue pour être conviviale pour les programmeurs et les non-programmeurs. Un processus typique de développement en équipe peut impliquer des artistes 2D ou 3D, des concepteurs de niveaux, des concepteurs de jeux et des animateurs, tous travaillant avec l'interface de l'éditeur.
it: Con Godot è facile creare giochi come questo, e tutto ciò che hai bisogno è creare ed istanziare più scene. Perlopiù, l'interfaccia dell'editor è designata per essere facile da usare sia per programmatori e non. Un tipico gruppo di sviluppo comprende artisti 2D o 3D, level designers, game designers e animatori, tutti che lavorano con l'interfaccia dell'editor.
ja: Godotなら、シーンの作成・インスタンス化を繰り返す事で簡単に上記の事が出来ます。 さらに、エディタのUIは、プログラマーにとっても非プログラマーにとっても使いやすいように設計されています。 典型的なチーム開発プロセスには、2Dまたは3Dアーティスト、レベルデザイナー、ゲームデザイナー、アニメーターが関与します。これらはすべてエディタインターフェイスで作業できます。
ko: Godot이라면, 당신은 씬을 만들고 그것을 인스턴스하면 되니까 작업을 쉽게 반복할 수 있습니다. 게다가, 에디터 UI는 프로그래머나 비 프로그래머에게도 친근하게 디자인 되었습니다. 전형적인 개발 팀은 2D나 3D 아티스트, 레벨 디자이너, 게임 디자이너, 애니메이터를 포함하지만, 모두가 이 에디터 내에서 작업 할 수 있습니다.
pl: Z Godotem, łatwo jest tworzyć grę w ten sposób, ponieważ wszystko co musisz zrobić to stworzyć i wyświetlić więcej scen. Ponadto, interfejs użytkownika edytora jest zaprojektowany tak, aby był przyjazny dla programistów, jak i dla innych użytkowników. Typowy proces tworzenia może obejmować artystów 2D lub 3D, projektantów poziomów, projektantów gier i animatorów, którzy współpracują z interfejsem edytora.
pt_br: Como Godot, é fácil fazer esse tipo de iteração no seu jogo, já que tudo que você precisa fazer é criar mais cenas e suas instâncias. Além disso, a interface do editor é projetada para ser amigável para programadores e não-programadores. Um processo típico de desenvolvimento em equipe pode envolver artistas 2D e 3D, projetistas de níveis, projetistas de jogo e animadores, todos trabalhando com a interface do editor.
ru: С Godot, это легко повторить и в вашей игре, все что вам нужно сделать, это создать больше экземпляров сцен. Кроме того, пользовательский интерфейс редактора разработан, чтобы быть удобным как для программистов так и не программистов. Типичный состав команды разработчиков может включать в себя 2D или 3D художников, дизайнеров уровней, гейм-дизайнеров и аниматоров, и все работают с одним интерфейсом редактора.
uk: З Godot легко відтворити гру, схожу на цю, адже все, що вам потрібно зробити, це створити та інстансувати більше сцен. Крім того, інтерфейс редактора побудований так, щоб ним було зручно користуватися, як програмістам, так і не програмістам. Типовий склад команди розробки може залучати 2D, або 3D, художників, дизайнерів рівнів, дизайнерів ігор та аніматорів, які працюють з інтерфейсом редактора.
zh_cn: 使用Godot，就可以很容易像这样迭代你的游戏，因为你需要做的就是创建和实例化更多的场景。编辑器UI也被设计成对程序员和非程序员都友好，一个典型的团队开发过程会涉及2D或3D美术工作者、关卡设计师、游戏设计师、动画师，他们都可以这个编辑器界面工作。
zh_tw: 在 Godot 裡，很容易就可以通過這種方式來迭代出遊戲，需要做的就只是建立場景、實體化場景然後建立更多場景再實體化更多場景。而且，不管是對於程式設計師或非程式設計師來說，Godot 的編輯器 UI 很友善。一般標準的團隊開發流程還會有 2D 與 3D 設計師、關卡設計師、遊戲設計師以及動畫家的參與，大家都會使用 Godot 編輯器界面來進行作業。

source: Information overload!
cs: Informační přetížení!
de: Informationsüberfluss!
es: ¡Sobrecarga de información!
fi: Informaatioähky!
fr: Surcharge d'informations !
it: Sovraccarico di informazioni!
ja: 情報が多すぎますね!
ko: 정보가 너무 많아요!
pl: Przeciążenie informacjami!
pt_br: Sobrecarga de informações!
ru: Информационная перегрузка!
uk: Інформаційне перевантаження!
zh_cn: 信息量太大了！
zh_tw: 資訊爆炸！

source: This has been a lot of high level information dropped on you all at once. However, the important part of this tutorial was to create an awareness of how scenes and instancing are used in real projects.
cs: Zavalili jsme vás spoustou obecných informací. Důležitou součástí tohoto tutoriálu však bylo vytvořit povědomí o tom, jak jsou scény a jejich instance používány ve skutečných projektech.
de: Wir haben dir hier viele "high-level" Informationen auf einmal an den Kopf geworfen. Allerdings war ein wichtiger Teil dieses Tutorials der, dir zu zeigen wie Szenen und Instanziierung in realen Projekten verwendet wird.
es: Esto ha sido mucha información de alto nivel que ha caído sobre ti a la vez. Sin embargo, la parte importante de este tutorial fue crear una conciencia de cómo se usan las escenas y la instanciación en proyectos reales.
fi: Sinua on pommitettu suurella määrällä korkean tason tietoa yhdellä kertaa. Oli miten oli, tämän oppaan tärkein osuus oli lisätä tietoisuutta siitä kuinka skenejä ja niiden ilmentymiä käytetään oikeissa projekteissa.
fr: Beaucoup d'informations générales viennent de vous être données en même temps. Cependant, la vocation première de ce tutoriel était de vous faire prendre conscience de la manière dont les scènes et l'instanciation sont utilisées dans de vrais projets.
it: Questo è stato un numero enorme di informazioni di alto livello mostratoti tutto in una volta. Comunque, la parte importante di questo tutorial era creare l'idea di come le scene e l'istanziamento sono usati nei progetti reali.
ja: たくさんの高度な情報が一度に出てきましたね。 ただし、このチュートリアルの重要な部分は、実際のプロジェクトでシーンとインスタンス化がどのように使用されているかを認識することです。
ko: 많은 정보들을 당신이 한번에 이해하긴 어려울 겁니다. 하지만 이 튜토리얼의 핵심은 씬이 프로젝트에서 씬과 인스턴스화가 어떻게 이용되는지를 알면 되는 것입니다.
pl: To było wiele informacji na wysokim poziomie które spadły na wszystkich na raz. Ważną częścią tego samouczka było jednak uświadomienie sobie, jak sceny i instancje są wykorzystywane w rzeczywistych projektach.
pt_br: Esta página fez chover muitas informações de alto nível de uma vez na sua cabeça. Entretanto, a parte importante deste tutorial era conscientizar como as cenas e suas instâncias são usadas em projetos reais.
ru: Было много информации, что навалилась на вас сразу. Тем не менее, важной частью этого урока было освещение вопроса о том, как сцены и создание их экземпляров используются в реальных проектах.
uk: Тут було дуже багато нової інформації, яка звалилася на вас вся відразу. Однак важливою частиною цього уроку було створення усвідомлення того, як сцени та вставка їх екземплярів використовуються в реальних проектах.
zh_cn: 本篇一直涉及到进阶的信息。然而本教程最重要的是让你领悟到实际项目中如何使用场景和实例。
zh_tw: 顯然同時塞了很多高級的資訊給你。然而，這個教學最重要的部分就是要讓你大概瞭解在真實的專案內是如何使用場景與實體化的。

source: Everything discussed here will become second nature to you once you start making games and putting these concepts into practice. For now, don't worry about it too much, and go on to the next tutorial!
cs: Všechno to, o čem se zde diskutuje, se vám stane druhou přirozeností, jakmile skutečně začnete dělat hry a tyto koncepty používat. Prozatím si z toho nedělejte velkou hlavu a pokračujte dalším tutoriálem!
de: Alles, was wir hier beschrieben haben wird mit der Zeit für die ganz natürlich, wenn du anfängst Spiele zu erstellen und die Konzepte in die Praxis umsetzt. Kümmere dich für das erste nicht darum und beginne mit der nächsten Anleitung!
es: Todo lo que se aborda aquí se convertirá en algo natural una vez que empieces a crear juegos y a poner en práctica estos conceptos. Por ahora, no te preocupes demasiado ¡y pasa al siguiente tutorial!
fi: Kaikki tässä keskusteltu tulee olemaan sinulle kuin toinen luonto, kun alat tehdä pelejä ja ottaa nämä konseptit käyttöön. Tällä erää, älä murehdi siitä liikaa, vaan jatka seuraavaan oppaaseen!
fr: Tout ce dont il est question ici deviendra une seconde nature pour vous une fois que vous commencerez à créer des jeux et à mettre ces concepts en pratique. Pour l'instant, ne vous en faites pas trop, et passez au prochain tutoriel !
it: Tutto ciò di cui abbiamo discusso qui, ti diverrà familiare una volta che inizierai a creare videogiochi e metterai in pratica questi concetti. Per ora, non darci troppa importanza, e prosegui con il prossimo tutorial!
ja: ゲームを作成し、これらの概念を実践し始めると、ここで説明したことにすぐに慣れます。なので今のところ、あまり心配する必要はありません。次のチュートリアルに進んでください!
ko: 여기에서 다룬 모든 내용은 게임을 처음 만들게 되면서 자연스럽게 익히게 될 것입니다. 지금은, 너무 걱정하지 마시고, 다음 튜토리얼로 넘어갑시다!
pl: Wszystko, o czym tutaj rozmawiamy, stanie się dla Ciebie drugą naturą, gdy zaczniesz grać i wdrażać te koncepcje w życie. Na razie nie martw się tym za bardzo i przejdź do następnego samouczka!
pt_br: Tudo discutido aqui se tornará natural assim que você começar a fazer jogos e colocar esses conceitos em prática. Por ora, não se preocupe demais com isso e simplesmente prossiga para o próximo tutorial!
ru: Все, что здесь оговаривалось, станет для вас второй натурой, как только вы начнете делать игры и применять эти знания на практике. На данный момент, не беспокойтесь об этом слишком много, и переходите к следующему уроку!
uk: Все, що тут обговорювалося, стане для вас другою суттю, як тільки ви почнете робити ігри та втілювати в життя ці поняття. Поки що не переймайтеся цим, і переходите до наступного уроку!
zh_cn: 一旦你开始制作游戏并将这些理念付诸实践，这里讨论的一切将成为你的“第二天性"。现在，不要太担心，继续下一个教程吧！
zh_tw: 一旦開始製作遊戲並開始實踐這裡討論到的概念，很快就會習慣了。現在，不要想太多，直接進到下一個教學吧！

source: A more flexible alternative to prefabs (and much more powerful given that instances can be nested).
de: Eine flexiblere (und sehr viel mächtigere, durch die Möglichkeit Instanzen zu verschachteln) Alternative zu Prefabs.
ko: 유니티의 프리팹보다 더 유연하게 쓰일 수 있음 (인스턴스는 중첩될 수 있기에 더 강력하기도 합니다).
pl: Bardziej elastyczna alternatywa dla obiektów będących szablonami (i o wiele mocniejsza, biorąc pod uwagę możliwość zagnieżdżenia się instancji).
pt_br: Uma alternativa mais flexível aos prefabs (e muito mais poderosa, já que instâncias podem ser aninhadas).
zh_cn: 一种更灵活的预设（Prefabs）替代方案（基于实例的可嵌套性，会更加强大）。

source: But the greatest strength that comes with instancing scenes is that it works as an excellent design language. This is pretty much what distinguishes Godot from all the other engines out there. Godot was designed from the ground up around this concept.
de: Aber die größte Stärke, wenn es um das Instanziieren von Szenen geht, ist, dass es exellent als Designsprache funktioniert. Das ist die Godot von anderen Engines uunterscheidet. Godot wurde von Anfang an nach diesem Konzept entworfen.
ko: 씬을 인스턴스화하는 것의 가장 강력한 장점은 디자인 언어와 아주 잘 맞는다는 것입니다. 이것이 사실상 Godot와 다른 알려진 엔진들을 구분하는 부분입니다. Godot는 애초에 바닥부터 이러한 컨셉으로 디자인되었습니다.
pl: Jednak największą zaletą scen instancjujących jest to że idealnie nadaje się tworzenia bardzo zaawansowanych scen. To właśnie odróżnia Godota od wszystkich innych silników. Godot został zaprojektowany od podstaw wokół tego konceptu.
pt_br: Mas a maior força que vem de instâncias de cenas é que isso funciona como uma excelente linguagem de concepção. Isso é o que mais distingue Godot de todos os outros motores de jogos existentes por aí afora. O Godot foi todo projetado pensando neste conceito.
ru: Но самое большое достоинство, которое получаем при создании экземпляра сцены заключается в том, что это работает как отличный дизайн. Это в значительной степени отличает Godot от всех других движков. Godot был разработан с нуля вокруг этой концепции.
zh_cn: 但实例场景带来的最大优势在于它可以作为一种优秀的设计语言。这也是Godot区别于其他游戏引擎的主要因素。Godot引擎就是围绕着这个概念从头设计的。
