Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/instancing.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Notice that a grey "revert" button appears next to the adjusted property. When this button is present, it means you modified a property in the instanced scene to override its value in the saved scene. Even if that property is modified in the original scene, the custom value will remain. Pressing the revert button will restore the property to the value in the saved scene.
cs: Všimněte si, že vedle upravené vlastnosti se zobrazí šedé tlačítko „obnovit“. Je-li toto tlačítko k dispozici, znamená to, že jste v instanci scény upravili vlastnost tak, aby přepsala svoji hodnotu v uložených vlastnostech scény. I když je tato vlastnost modifikována ve scéně původni, zde zůstane upravená hodnota. Stisknutím tlačítka pro obnovení vrátíte vlastnost na hodnotu v uložené scéně.
de: Neben der angepassten Eigenschaft erscheint eine graue "Rückgängig"-Schaltfläche. Diese Schaltfläche wird angezeigt, wenn Sie eine Eigenschaft in einer instanziierten Szene bearbeitet haben. Selbst wenn der Wert in der Originalszene angepasst wird behält die Instanz den benutzerdefinierten Wert bei. Durch Drücken der "Rückgängig"-Schalfläche, wird die Eigenschaft auf den Wert der gespeicherten Szene zurückgesetzt.
es: Date cuenta del botón gris de "volver" que aparece junto a la propiedad modificada. Cuando este botón está presente, quiere decir que has modificado una propiedad en la escena instanciada cambiando su valor respecto de la escena guardada. Aunque esa propiedad se modifique en la escena original, el valor modificado permanecerá. Presionando el botón volver restaurará el valor de la propiedad en la escena guardada.
fi: Huomaa, että muokatun ominaisuuden viereen ilmestyy harmaa "palauta" painike. Kun tämä painike on esillä, se tarkoittaa että olet muokannut ominaisuutta skeneilmentymässä ylikirjoittaaksesi sen tallennetussa skenessä olevan arvon. Vaikka ominaisuutta muutetaan alkuperäisessä skenessä, muokattu arvo jää voimaan. Palautuspainikkeen painaminen palauttaa ominaisuuden tallennetun skenen arvoon.
fr: Remarquez qu'un bouton gris "retour en arrière" apparaît à côté de la propriété ajustée. Lorsque ce bouton est présent, cela signifie que vous avez modifié une propriété dans la scène instanciée pour remplacer sa valeur dans la scène sauvegardée. Même si cette propriété est modifiée dans la scène originale, la valeur personnalisée restera. Appuyez sur le bouton de retour en arrière pour rétablir la propriété à la valeur de la scène sauvegardée.
it: Nota che compare un bottone "Annulla" in grigio a fianco alla proprietá modificata. Quando questo bottone é presente significa che é stato modificato un valore che va a sovrascrivere il valore della scena salvata. Il valore personalizzato nell'istanza rimane anche se il valore di quella proprietá viene modificato nella scena originale. Premendo il bottone di annulla riporterá il valore a quello salvato nella scena originaria.
ja: 調整されたプロパティの横に灰色の「元に戻す」ボタンが表示されます。 このボタンが表示されている場合は、インスタンス化されたシーンのプロパティを変更して、保存されたシーンの値を上書きすることを意味します。 そのプロパティが元のシーンで変更されても、カスタム値は残ります。 元に戻すボタンを押すと、保存されているシーンの値にプロパティが復元されます。
ko: 조정한 속성 옆에 회색 "되돌리기(Revert)" 버튼이 나타났습니다. 이 버튼이 있다는 것은 인스턴스된 씬의 속성을 수정하여 저장된 씬에서 값을 다시 정의한 것을 의미합니다. 기존 씬에서 속성을 수정하더라도 맞춤 값은 유지됩니다. 되돌리기 버튼을 누르면 저장된 씬의 값으로 속성을 복원할 수 있습니다.
pl: Zauważ, że obok dostosowanej właściwości pojawia się szary przycisk "przywrócenia". Gdy przycisk ten jest obecny, oznacza to, że zmodyfikowano właściwość instancji w celu zastąpienia jej wartości w zapisanej scenie. Nawet jeśli ta właściwość zostanie zmodyfikowana w oryginalnej scenie, wartość niestandardowa pozostanie. Naciśnięcie przycisku przywracania spowoduje przywrócenie właściwości do wartości zapisanej sceny.
ru: Обратите внимание, что рядом с измененным свойством появляется серая кнопка "вернуться". Наличие этой кнопки означает, что вы изменили свойство в экземпляре сцены, чтобы переопределить его значение в сохраненной сцене. Даже если это свойство будет изменено в исходной сцене, пользовательское значение останется. Нажатие кнопки возврата восстановит старое значение свойства, как в сохраненной сцене.
uk: Зауважте, що поруч із налаштованою властивістю з’являється сіра кнопка «повернутися». Якщо ця кнопка присутня, це означає, що ви змінили властивість у вставленій сцені. Тепер навіть якщо ви зміните цю властивість в початковій збереженій сцені, спеціальне значення залишиться незмінним. Натискання кнопки повернення поверне властивість до значення збереженої сцени.
zh_cn: 可以注意到调整后的属性旁边有一个 :menuselection:`还原(revert)` 按钮。当这个按钮出现，意味着修改了这个实例化场景属性，覆盖了它原有的值。即便再次修改原场景的属性，它的值也会保持不变。按下还原按钮将会把属性值还原为原场景设定值。
zh_tw: 可以注意到在已經調整的屬性旁邊會出現一個灰色的 [還原] 按鈕。如果出現了這個按鈕就代表修改了實體化的場景，而且這個節點的數值覆蓋了原始場景的值。就算再次修改原本的場景，這裡自定的數值還是會保留。點擊 [還原] 按鈕就能把屬性還原成原始場景的值。

source: Conclusion
cs: Závěr
de: Fazit
es: Conclusión
fi: Lopputulos
it: Conclusione
ja: 結論
ko: 결론
pl: Wniosek
ru: Вывод
uk: Висновки
zh_cn: 总结
zh_tw: 結論

source: Instancing can be useful when you want to create many copies of the same object. It is also possible to create instances in code by using GDScript, see :ref:`doc_instancing_continued`.
cs: Vytváření instanci může být velice užitečné pokud chcete vytvořit mnoho kopií stejného objektu. Instance je také možné vytvořit v kódu pomocí GDScriptu, viz :ref:`doc_instancing_continued`.
de: Die Instanziierung kann nützlich sein, wenn Sie viele Kopien desselben Objekts erstellen möchten. Es ist auch möglich, mithilfe von GDScript Instanzen im Code zu erstellen, siehe dazu :ref:`doc_instancing_continued`.
es: Instanciar puede ser útil cuando quieres crear muchas copias de un mismo objeto. También es posible crear instancias desde el código usando GDScript, ver :ref:`doc_instancing_continued`.
fr: L'instanciation peut être utile lorsque vous voulez créer plusieurs copies d'un même objet. Il est également possible de créer des instances dans le code en utilisant GDScript, voir le chapitre :ref:`doc_scripting_continued`.
it: Creare un'istanza può essere utile quando vuoi creare più copie dello stesso oggetto. C'è anche la possibilità di creare istanze dal codice usando GDScript, vedi :ref:`doc_scripting_continued`.
ja: 同じオブジェクトのコピーを作りたいとき、インスタンス化は便利です。またGDScriptを使ってコードでインスタンスを作ることもできます。\ :ref:`doc_instancing`\ を御覧ください。
ko: 인스턴스하는 것은 많은 양의 객체 사본을 만들 때 유용합니다. GDScript로도 인스턴스를 만들 수 있습니다. :ref:`doc_instancing_continued`\ 를 참고하세요.
pl: Instancjonowanie może być przydatne, kiedy chcesz utworzyć wiele kopii tego samego obiektu. Można również tworzyć instancje przy użyciu GDScripta - :ref:`doc_instancing_continued`.
ru: Создавать экземпляры может быть полезно, если вы хотите создать множество копий одного и того же объекта. Также возможно создать экземпляр непосредственно в коде, используя GDScript, см :ref:`doc_scripting_continued`.
uk: Instancing (створення екземплярів) може бути корисним, коли ви хочете створити багато копій одного і того ж об'єкта. Також екземпляри можна створити в коді за допомогою GDScript, дивіться :ref:`doc_instancing_continued`.
zh_cn: 当您想创建同一对象的多个副本时，实例化会非常有用。您也可以使用GDScript创建实例(请参阅 :ref:`doc_scripting_continued`)。
zh_tw: 如果要複製很多個物件的話，實體化應該很有用。也可以通過 GDScript 來用程式建立實體，詳細請參考 :ref:`doc_instancing_continued` 。

source: You can add as many instances as you like to a scene, either by using the "Instance" button again, or by clicking on the ball instance and pressing :kbd:`Ctrl + D` (:kbd:`Cmd + D` on macOS) to duplicate it:
cs: Do scény můžete přidat libovolný počet instancí, buď opětovným použitím tlačítka „Instance“ nebo kliknutím na instanci míčku a stisknutím :kbd:`Ctrl + D` ( :kbd:`Cmd + D` on MacOS) pro duplikování:
de: Sie können einer Szene beliebig viele Instanzen hinzufügen, indem Sie entweder erneut auf die Schaltfläche "Instanz" klicken oder auf die Ballinstanz klicken oder drücken Sie :kbd: `Strg + D` (: kbd:` Cmd + D` auf MacOS) um es zu duplizieren:
ja: 再び[インスタンス]ボタンを使用するかボールインスタンスをクリックして[複製] (:kbd:`Ctrl + D`) を押すことで、好きなだけインスタンスをシーンに追加できます:
pl: Możesz dodać tyle instancji do sceny ile chcesz; poprzez ponowne użycie przycisku "Instancja", albo klikając na instancję piłki i naciskając skrót "Duplikuj" :kbd:`Ctrl + D` (:kbd:`Cmd + D` na systemach macOS):
ru: Вы можете добавить на сцену так много экземпляров объекта, как захотите: либо вновь воспользовавшись кнопкой «Instance», либо выделив экземпляр шарика и нажав :kbd:`Ctrl + D` (:kbd:`Cmd + D` в macOS) чтобы его дублировать:
uk: Ви можете додавати будь-яку кількість екземплярів на сцену за допомогою повторного натискання кнопки "Екземпляр", або натисканням екземпляра кульки із наступним натисканням кнопки "Дублювати" (:kbd:`Ctrl-D`), щоб дублювати його:
zh_cn: 你可以在一个场景中添加任意数量的实例，可以再次使用 "实例化"按钮，也可以点击球的实例，然后按:kbd:`Ctrl + D`（MacOS上按:kbd:`Cmd + D`）复制它:
zh_tw: 我們可以往場景裡新增任意多個的實體，可以用剛才的 [實體] 按鈕，或是點擊已經有的球的實體然後按 :kbd:`Ctrl + D` (或 macOS 上 :kbd:`Cmd+D`) 來拷貝：

source: Open the ``Ball`` scene and add a ``PhysicsMaterial`` by opening the "Physics Material Override" dropdown in the Inspector dock and selecting "New PhysicsMaterial".
uk: Відкрийте сцену ``Ball`` та додайте ``PhysicsMaterial`` (фізичний матеріал), натиснувши стрілку вниз та вибравши "New PhysicsMaterial" ("Новий фізичний матеріал").

source: Open the ``Ball`` scene, expand the ``PhysicsMaterial`` by clicking on it, and set the ``Bounce`` property to ``1``.
cs: Otevřete scénu ``Ball`` poté rozbalte ``PhysicsMaterial`` kliknutím na něj a nastavte vlastnost ``Bounce`` na ``1``.
de: Öffnen Sie die ``Ball`` Szene, klicken auf ``PhysicsMaterial`` um es auszuklappen und setzen die ``Bounce`` Eigenschaft auf ``1``.
ja: ``Ball`` シーンを開き、 ``PhysicsMaterial`` をクリックして展開し、 ``Bounce`` プロパティを ``1`` に設定します。
pl: Otwórz scenę ``Ball``, kliknij ``PhysicsMaterial``aby rozwinąć listę parametrów i ustaw wartość parametru ``Bounce`` na ``1``.
ru: Откройте сцену ``Ball``, найдите в его настройках параметр ``PhysicsMaterial``, нажмите по нему и установите параметр ``Bounce`` (отскок) на значение ``1``.
zh_cn: 打开 ``Ball`` 场景, 点击 ``PhysicsMaterial`` 展开, 然后设置 ``Bounce`` 属性为 ``1``.
zh_tw: 打開 ``Ball`` 場景，點擊 ``PhysicsMaterial`` 來展開，然後將 ``Bounce`` 屬性設為 ``1`` 。

source: You can also adjust individual instances. Set the bounce value back to ``0`` and then in the ``Main`` scene, select one of the instanced balls. Resources like ``PhysicsMaterial`` are shared between instances by default, so we need to make it unique. Click on the tools button in the top-right of the Inspector dock and select "Make Sub-Resources Unique". Set its ``Bounce`` to ``1`` and press "Play".
cs: Můžete také upravit jednotlivé instance zvlášť. Nastavte hodnotu Bounce zpět na ``0`` a poté ve scéně ``Main`` vyberte jednu z instancí balónku. Zdroje jako ``PhysicsMaterial`` jsou primárně sdíleny mezi instancemi, takže je potřeba, udělat tento zdroj jedinečným. Klikněte na šipku dolů a vyberte „Vytvoři unikátní“. Nastavte ``Bounce`` na ``1`` a stiskněte "Hrát".
de: Sie können auch einzelne Instanzen anpassen. Setzen Sie den `Bounce` Wert zurück auf ``0`` und gehen dann in die ``Main`` Szene. Wählen Sie einen instanziierten Ball aus und setze dessen ``Bounce`` Wert auf ``1``. Ressourcen wie ``PhysicsMaterial`` werden zwischen verschiedenen Instanzen geteilt, deshalb wollen wir sie einzigartig machen. Drücken Sie dazu auf den Pfeil nach unten und wählen "Einzigartig machen" aus. Drücken Sie danach auf "Starten".
ja: 個々のインスタンスを調整することもできます。 ``Bounce`` の値を ``0`` に戻して、 ``Main`` シーンでインスタンス化したボールを一つ選んでください。 ``PhysicsMaterial`` のようなリソースは、デフォルトでインスタンス間で共有されます。したがって、それをユニークにする必要があります。下向きの矢印を押して「サブリソースをユニーク化する」を選んでください。その ``Bounce`` を ``1`` にセットしてから「実行」を押してください。
ru: Вы также можете настроить отдельные экземпляры. Установите значение отскока обратно на ``0``, а затем в сцене ``Main`` выберите один из шаров. Такие ресурсы, как ``PhysicsMaterial`` по умолчанию являются общими для всех экземпляров, но мы можем сделать их уникальными. Нажмите на стрелку вниз и выберите пункт "Сделать Уникальным (Make Unique)". Установите для параметра ``Bounce`` значение ``1`` и нажмите «Play».
zh_cn: 也可以只调整个别实例。 先将 ``Bounce`` 设回 ``0`` ，然后在 ``Main`` 场景中，选择一个要修改的球。 默认情况下在实例间共享同一个 ``PhysicsMaterial`` 这样的资源，因此修改前需要使其独立于其他实例。 点击属性面板右上方的工具按钮，选择“转为独立子资源”，并将 ``Bounce`` 设置为 ``1`` ，测试修改后的效果。
zh_tw: 也可以調整個別的實體。我們先把反彈值跳回 ``0`` ，然後回到 ``Main`` 場景選擇其中一個球的實體。由於一些如 ``PhysicsMaterial`` 的資源在各個實體之間是共用的，所以我們要讓這個實體變成獨立的。點擊屬性面板右上角的工具按鈕，然後選擇 [獨立化子資源]。再來把 ``Bounce`` 改成 ``1`` 然後按 [執行]。
