Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/instancing.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Unzip this project anywhere you like. Then open Godot and add this project to the project manager using the 'Import' button:
cs: Rozbalte tento projekt kdekoli chcete. Pak otevřete Godot a přidejte tento projekt do projektového manažera pomocí tlačítka "Importovat":
de: Entpacken Sie dieses Projekt in ein beliebiges Verzeichnis. Öffnen Sie dann Godot und fügen dieses Projekt über die Schaltfläche 'Importieren' dem Projektmanager hinzu:
es: Descomprime el proyecto donde desees. Luego abre Godot y agrega este proyecto al administrador de proyectos usando el botón 'Importar':
fi: Pura tämä projekti minne haluat. Avaa sitten Godot ja lisää projekti projektinhallintaan 'Tuo' (kuvassa 'Import') painikkeella:
fr: Décompressez ce projet où vous le souhaitez. Ensuite, ouvrez Godot et ajoutez ce projet au gestionnaire de projet en utilisant le bouton 'Importer' :
it: Decomprimi questo progetto ovunque tu voglia, quindi apri Godot e aggiungilo al Gestore di Progetti utilizzando il bottone 'Importa':
ja: このプロジェクトを任意の場所で解凍します。次に、Godotを開き、[インポート]ボタンを使用してこのプロジェクトをプロジェクト管理者に追加します:
ko: 원하는 위치에 압축을 푸세요. 그런 다음 Godot를 켜고, 프로젝트 매니저에서 '가져오기(Import)' 버튼으로 이 프로젝트를 추가하세요:
pl: Rozpakuj ten projekt gdziekolwiek chcesz. Następnie otwórz Godot i dodaj ten projekt do menedżera projektu za pomocą przycisku 'Importuj':
ru: Разархивируйте этот проект в любом месте. Затем откройте Godot и добавьте этот проект в менеджер проекта с помощью кнопки 'Импорт':
uk: Розпакуйте цей проект куди завгодно. Потім відкрийте Godot і додайте цей проект до керівника проектів за допомогою кнопки 'Імпортувати':
zh_cn: 解压该项目到任意位置。然后打开Godot，用 :menuselection:`导入(Import)` 按钮将项目添加到到项目管理器中：
zh_tw: 解壓縮到任意處，然後打開 Godot 並在專案管理員裡點擊 [匯入] 按鈕來新增該專案：

source: Browse to the folder you extracted and open the "project.godot" file you can find inside it. After doing this, the new project will appear on the list of projects. Edit the project by pressing the 'Edit' button.
cs: Vyhledejte rozbalenou složku a otevřete soubor „project.godot“, který najdete uvnitř. Po dokončení se nový projekt objeví na seznamu projektů. Upravte projekt stisknutím tlačítka 'Upravit'.
de: Navigieren Sie in den entpackten Ordner und öffnen die darin liegende Datei "project.godot". Danach wird das neue Projekt in der Projektliste angezeigt. Das Projekt kann über den Button 'Bearbeiten' bearbeitet werden.
es: Navega hasta la carpeta donde se extrajo el proyecto y abre el archivo "project.godot" que está dentro. Después de hacer esto, el proyecto nuevo aparecerá en la lista. Edita el proyecto presionando el botón 'Editar'.
fi: Selaa purkamaasi kansioon ja avaa sieltä löytyvä "project.godot" tiedosto. Tämän tehtyäsi uusi projekti ilmestyy projektiluetteloon. Muokkaa projektia painamalla 'Muokkaa' painiketta.
fr: Naviguez jusqu'au dossier que vous avez extrait et ouvrez le fichier "project.godot" que vous pouvez trouver à l'intérieur. Après cela, le nouveau projet apparaîtra dans la liste des projets. Modifiez le projet en appuyant sur le bouton 'Modifier'.
it: Naviga fino alla cartella in cui hai estratto l'archivio e apri il file project.godot che trovi all'interno, a questo punto il progetto apparirá nella lista dei progetti. Modifica il progetto premendo sul bottone 'Modifica'.
ja: 抽出したフォルダを参照し、その中にある「project.godot」ファイルを開きます。これを行うと、新しいプロジェクトがプロジェクトの一覧に表示されます。[編集]ボタンを押してプロジェクトを編集します。
ko: 압축을 푼 폴더를 검색하고 그 안에서 찾은 "project.godot" 파일을 여세요. 그러면 새 프로젝트가 프로젝트 목록에 나타납니다. '편집하기(Edit)' 버튼을 눌러 프로젝트를 편집하세요.
pl: Przejdź do wyodrębnionego folderu i otwórz plik "project.godot", który znajduje się wewnątrz niego. Następnie nowy projekt pojawi się na liście projektów. Edytuj projekt, naciskając przycisk Edytuj.
ru: Перейдите в папку, которую вы извлекли, и откройте файл "project.godot", который вы найдете внутри нее. После этого новый проект появится в списке проектов. Отредактируйте проект, нажав кнопку 'Редактировать'.
uk: Перейдіть до витягнутої папки та відкрийте файл "project.godot", який ви можете знайти в ній. Після цього новий проект з’явиться у списку проектів. Відредагуйте проект, натиснувши кнопку «Редагувати».
zh_cn: 浏览到解压到的文件夹，然后打开可以在其中找到 ``project.godot`` 文件。执行此操作后，新项目将显示在项目列表中。按 :menuselection:`编辑(Edit)` 按钮编辑项目。
zh_tw: 可以在解壓縮後的資料夾裡找到一個「project.godot」檔案，打開這個檔案。之後專案列表就會顯示出新的專案。按 [編輯] 來編輯專案。

source: This project contains two scenes: "Ball.tscn" and "Main.tscn". The ball scene uses a :ref:`RigidBody2D <class_RigidBody2D>` to provide physics behavior while the main scene has a set of obstacles for the ball to collide with (using :ref:`StaticBody2D <class_StaticBody2D>`).
cs: Tento projekt obsahuje dvě scény: „Ball.tscn“ a „Main.tscn“. Scéna míčku používá :ref:`RigidBody2D <class_RigidBody2D>` k zajištění fyzikálního chování, zatímco hlavní scéna obsahuje řadu překážek, s nimiž se může míč srazit (pomocí :ref:`StaticBody2D <class_StaticBody2D>`).
de: Das Projekt enthält zwei Szenen: "Ball.tscn" und "Main.tscn". Die Ballszene verwendet einen :ref:`RigidBody2D <class_RigidBody2D>`für das physikalische Verhalten, während die Hauptszene ein paar Hindernisse für den Ball enthält, mit denen dieser (durch die Verwendung von :ref:`StaticBody2D <class_StaticBody2D>`) kollidieren kann.
es: Este proyecto contiene dos escenas: "Ball.tscn" y "Main.tscn". La escena ``Ball`` usa un :ref:`RigidBody2D <class_RigidBody2D>` para otorgar un comportamiento físico mientras que la escena ``Main`` tiene una serie de obstáculos para que la bola colisione con ellos (usando :ref:`StaticBody2D <class_StaticBody2D>`).
fi: Projekti sisältää kaksi skeneä: "Ball.tscn" ja "Main.tscn". Palloskene käyttää :ref:`RigidBody2D <class_RigidBody2D>` solmua tarjoamaan fysiikkamallinnusta ja pääskenessä on joukko esteitä, joihin pallo törmäilee (käyttäen :ref:`StaticBody2D <class_StaticBody2D>` solmua).
fr: Ce projet contient deux scènes : "Ball.tscn" et "Main.tscn". La scène de la balle utilise un :ref:`RigidBody2D <class_RigidBody2D>` pour fournir un comportement physique pendant que la scène principale dispose d'un ensemble d'obstacles (utilisant des :ref:`StaticBody2D <class_StaticBody2D>`) pour que le balle entre en collision avec.
it: Questo progetto contiene due scene: "Ball.tscn" e "Main.tscn". La scena ``Ball`` usa un :ref:`RigidBody2D <class_RigidBody2D>` per simulare un comportamento fisicamente corretto, mentre la scena principale contiene un insieme di ostacoli su cul la palla possa collidere (utilizzando :ref:`StaticBody2D <class_StaticBody2D>`).
ja: このプロジェクトには、「Ball.tscn」と「Main.tscn」の2つのシーンがあります。ボール シーンは\ :ref:`RigidBody2D <class_RigidBody2D>`\ を使用して物理動作(のシミュレート)を提供し、メイン シーンにはボールが衝突する障害物のセットがあります (\ :ref:`StaticBody2D <class_StaticBody2D>`\ を使用)。
ko: 이 프로젝트는 두 개의 씬을 갖고 있습니다: "Ball.tscn"과 "Main.tscn"입니다. Ball 씬에는 물리적인 동작을 주는 :ref:`RigidBody2D <class_RigidBody2D>`\ 를 사용했고, Main 씬에는 (:ref:`StaticBody2D <class_StaticBody2D>`\ 를 사용해서) 공과 충돌하는 장애물 세트가 있습니다.
pl: Projekt ten składa się z dwóch scen: "Ball.tscn" i "Main.tscn". Scena z piłką używa :ref:`RigidBody2D <class_RigidBody2D>` do zapewnienia poprawnego zachowania fizyki, podczas gdy główna scena ma zestaw przeszkód dla piłki do zderzania się (używając :ref:`StaticBody2D <class_StaticBody2D>`).
ru: Этот проект содержит две сцены: "Ball.tscn" и "Main.tscn". Сцена мяча использует :ref:`RigidBody2D <class_RigidBody2D>`, чтобы обеспечить физическое поведение, в то время как основная сцена имеет множество препятствий для столкновения мяча (используя :ref:`StaticBody2D <class_StaticBody2D>`).
uk: Цей проект містить дві сцени: "Ball.tscn" і "Main.tscn". Сцена м'яча ("Ball.tscn") використовує :ref:`RigidBody2D <class_RigidBody2D>` (тверде тіло 2D) для забезпечення фізичної поведінки, тоді як головна сцена («Main.tscn») має набір перешкод для зіткнення з м'ячем (використовується :ref:`StaticBody2D <class_StaticBody2D>` (статичне тіло 2D)).
zh_cn: 该项目包含两个场景：``Ball.tscn`` 和 ``Main.tscn``。 ball 场景使用 :ref:`RigidBody2D <class_RigidBody2D>` 来提供物理行为，而主场景有一组用于与球碰撞的障碍物(使用 :ref:`StaticBody2D <class_StaticBody2D>`)。
zh_tw: 這個專案包含了兩個場景：「Ball.tscn」與「Main.tscn」。Ball 場景使用了 :ref:`RigidBody2D <class_RigidBody2D>` 來做物理行為。而主場景則有一組用來讓球碰撞的障礙物 (使用了 :ref:`StaticBody2D <class_StaticBody2D>` )。

source: Open the ``Main`` scene, and then select the root node:
cs: Otevřete scénu ``Main`` a vyberte kořenový uzel:
de: Öffnen Sie die ``Main`` Szene und wählen den Wurzelnode aus:
es: Abre la escena ``Main`` y luego selecciona el nodo raíz:
fi: Avaa ``Main`` skene ja valitse juurisolmu:
fr: Ouvrez la scène ``Main``, puis sélectionnez le nœud racine :
it: Apri la scena ``Main`` e seleziona il nodo radice:
ja: ``Main`` シーンを開き、ルート ノードを選択します:
ko: ``Main`` 씬을 열고 루트 노드를 선택하세요:
pl: Otwórz scenę ``Main``, a następnie wybierz węzeł główny:
ru: Откройте сцену ``Main`` и затем выберите корневой узел:
uk: Відкрийте сцену ``Main`` та виберіть кореневий вузол:
zh_cn: 打开 ``Main`` 场景，然后选择根节点：
zh_tw: 打開 ``Main`` 場景，然後選擇根節點：

source: We want to add an instance of the ``Ball`` scene as a child of ``Main``. Click the "link"-shaped button (its hover-text says "Instance a scene file as a Node.") and select the ``Ball.tscn`` file.
cs: Chceme přidat instanci scény ``Ball`` jako potomka ``Main``. Klikněte na tlačítko ve tvaru linku (jeho bublinková nápověda říká "Vytvoř instanci souboru scény jako uzel.") A vyberte soubor ``Ball.tscn``.
de: Wir wollen der ``Main`` Szene eine Instanz der ``Ball`` Szene hinzufügen. Klicken Sie auf den kettenförmig Schaltfläche (dessen Hover-text "Instantiiere eine Szenendatei als Node." lautet) und wählen die Datei ``Ball.tscn`` aus.
es: Queremos agregar la instancia de la escena ``Ball`` como hija de ``Main``. Click en el botón con forma de "cadena" (su texto emergente dice "Instanciar un archivo de escena como Nodo.") y selecciona el archivo ``Ball.tscn``.
fi: Haluamme lisätä ilmentymän ``Ball`` skenestä ``Main`` skenen alisolmuksi. Napsauta "ketjun" muotoista painiketta (sen vihjetekstissä lukee "Luo skenetiedostosta ilmentymän solmuksi.") ja valitse ``Ball.tscn`` tiedosto.
fr: Nous voulons ajouter une instance de la scène ``Ball`` en tant qu'enfant de "Main". Cliquez sur le bouton en forme de "lien" (son texte en survol indique "Instancier un fichier de scène en tant que nœud.") et sélectionnez le fichier ``Ball.tscn``.
it: Quello che vogliamo é aggiungere un'istanza della scena ``Ball`` come figlia di ``Main``, fai click sulla bottone a forma di catena (il testo in sovrimpressione dice "Istanzia un file scena come nodo.") e seleziona il file ``Ball.tscn``.
ja: ``Main`` の子として ``Ball`` シーンのインスタンスを追加したいと思います。「リンク」の形のボタン(ホバーテキストに「シーンファイルをノードとしてインスタンス設定する」と表示)をクリックし、 ``Ball.tscn`` ファイルを選択します。
ko: ``Ball`` 씬의 인스턴스를 ``Main`` 씬의 자식으로 추가할 것입니다. "사슬" 모양 버튼을 클릭하세요 (마우스를 올리면 "씬 파일을 노드로 인스턴스해요."라고 뜹니다), 그리고 ``Ball.tscn`` 파일을 선택하세요.
pl: Chcemy dodać przykład sceny ``Ball`` jako dziecko ``Main``. Kliknij przycisk w kształcie "linku" (po nakierowaniu wyświetla się tekst "Instancjuj scenę jako węzeł") i wybierz plik ``Ball.tscn``.
ru: Мы хотим добавить экземпляр сцены ``Ball`` в качестве дочернего узла ``Main``. Нажмите кнопку в виде "цепи" (во всплывающей подсказке сказано: "Добавить файл сцены как узел.") и выберите файл ``Ball.tscn``.
uk: Ми хочемо додати екземпляр сцени ``Ball`` в якості нащадка до сцени ``Main``. Натисніть іконку "ланцюжка" (при наведенні на неї курсора спливе підказка "Створити екземпляр файла сцени як вузол.") і виберіть файл ``Ball.tscn``.
zh_cn: 我们要添加一个 ``Ball`` 场景的实例，作为 ``Main`` 场景的子节点。点击“链接”形状的按钮(悬浮框写着 ``实例化场景文件作为节点。``)然后选择 ``Ball.tscn`` 文件。
zh_tw: 我們想要把 ``Ball`` 的實體新增到 ``Main`` 場景作為子節點。點擊「鎖鏈」形狀的按鈕 (滑鼠移上去會顯示「實體化場景檔案作為節點。」)。然後選擇 ``Ball.tscn`` 檔案。

source: The ball will be placed at the top-left corner of the screen area (this is ``(0, 0)`` in screen coordinates). Click and drag the ball somewhere near the top-center of the scene:
cs: Míč bude umístěn v levém horním rohu obrazovky (to je ``(0, 0)`` v souřadnicích obrazovky). Klikněte a přetáhněte míč někam blízko středu scény:
de: Der Ball wird in der oberen linken Ecke des Bildschirmbereiches (dies entspricht den Koordinaten ``(0, 0)``) plaziert. Bewege den Ball durch drücken und ziehen der Maustasten in die obere Mitte der Szene:
es: La bola se colocará en la esquina superior izquierda del área de pantalla (esto es ``(0, 0)`` en coordenadas de pantalla). Haz clic y arrastra la bola cerca de la parte superior central de la escena:
fi: Pallo sijoitetaan ruutualueen vasempaan yläkulmaan (joka on ``(0, 0)`` kuvaruudun koordinaatteina). Napsauta ja vedä pallo jonnekin lähelle skenen ylä-keskiosaa:
fr: La balle sera placée dans le coin supérieur gauche de la zone de l'écran (correspondant à ``(0, 0)`` en coordonnées de l'écran). Cliquez et faites glisser la balle quelque part près du centre supérieur de la scène :
it: La palla sará piazzata nell'angolo in alto a sinistra dell'area di schermo (questa é la posizione ``(0, 0)`` in coordinate sullo schermo). Fai click e trascina la palla in una posizione in alto e centrale della scena:
ja: ボールは画面領域の左上隅に配置されます(画面座標では ``(0,0)`` です)。ボールをクリックし、シーンの上部中央付近にドラッグします:
ko: Ball은 화면 영역의 왼쪽 위에 있습니다 (그 곳이 화면 좌표에서 ``(0, 0)``\ 인 곳입니다). 공을 클릭하고 화면 가운데의 조금 위로 드래그하세요:
pl: Piłka zostanie umieszczona w lewym górnym rogu obszaru ekranu (jest to ``(0, 0)`` we współrzędnych ekranu). Kliknij i przeciągnij piłkę gdzieś na środku u góry sceny:
ru: Мяч будет помещен в верхний левый угол области экрана (это ``(0, 0)`` в координатах экрана). Нажмите и перетащите мяч куда-нибудь рядом с верхним центром сцены:
uk: М'яч буде розміщений у верхньому лівому куті області екрана (це (0, 0)в координатах екрана). Клацніть по ньому та помістіть десь біля верхнього центру сцени:
zh_cn: 这个球会被放置在屏幕区域的左上角(即屏幕坐标 ``(0, 0)``)。点击并将球拖到场景顶部中心附近的某处：
zh_tw: 球會被放到螢幕區域的左上角 (也就是螢幕座標的 ``(0, 0)``)。點擊並把那顆球拖到靠近場景中間上方的地方：

source: Press "Play" and watch the ball fall to the bottom of the screen:
cs: Stiskněte tlačítko "Hrát " (Spustit projekt) a sledujte, jak míč spadne do spodní části obrazovky:
de: Drücken Sie "Starten" und schauen zu wie der Ball in den unteren Teil der Szene fällt:
es: Presiona "Reproducir" y verás la bola caer hasta la parte inferior de la pantalla:
fi: Napsauta "Pelaa" ja katso, kun pallo putoaa ruudun alalaitaan:
fr: Appuyez sur "Jouer" et regardez la balle tomber en bas de l'écran :
it: Premi "Play" e guarda la palla cadere verso il fondo dello schermo:
ja: 「再生」を押して、ボールが画面の下部に落ちるのを確認します:
ko: "실행하기(Play)" 버튼을 눌러서 공이 화면 아래로 떨어지는지 확인하세요:
pl: Naciśnij przycisk Odtwórz i obserwuj, jak piłka opada na dół ekranu:
ru: Нажмите «Play» и посмотрите, как мяч упадёт вниз:
uk: Натисніть «Відтворити» і спостерігайте, як м'яч падає в нижню частину екрана:
zh_cn: 按下 :menuselection:`运行(Play)`，会看到球落到场景底部：
zh_tw: 按下 [執行] 按鈕，就可以看到球落到畫面的底部：

source: Multiple instances
cs: Násobné instance
de: Mehrere Instanzen
es: Instancias múltiples
fi: Useat ilmentymät
fr: Instances multiples
it: Istanze multiple
ja: 複数のインスタンス
ko: 여러 인스턴스
pl: Wielokrotne instancje
ru: Множественное создание экземпляров
uk: Додавання декількох екземплярів
zh_cn: 多个实例
zh_tw: 多個實體

source: You can add as many instances as you like to a scene, either by using the "Instance" button again, or by clicking on the ball instance and pressing "Duplicate" (Ctrl-D):
es: Puedes añadir tantas instancias como desees a una escena, ya sea usando el botón "Instancia" nuevamente, o haciendo clic en la instancia de la bola y presionando "Duplicar" (Ctrl-D):
fi: Voit lisätä skeneen niin monta ilmentymää kuin haluat, joko käyttämällä "Ilmentymä"-painiketta uudelleen tai napsauttamalla palloilmentymää ja painamalla "Kahdenna" (Ctrl-D):
fr: Vous pouvez ajouter autant d'instances que vous le souhaitez à une scène, soit en utilisant à nouveau le bouton "Instancier", soit en cliquant sur l'instance de la balle et en appuyant sur "Dupliquer" (Ctrl-D) :
it: Puoi aggiungere quante istanze vuoi in una scena, sia premendo sul bottone "Istanzia" di nuovo o facendo click sull'istanza della palla e premendo il "Duplica" (Ctrl+D):
ko: 씬에 원하는 만큼 많은 인스턴스를 추가할 수 있습니다. 다시 "인스턴스(Instance)" 버튼을 누르거나, 공 인스턴스를 클릭하고 "복제하기(Duplicate)" (Ctrl-D)를 누르면 됩니다:

source: Run the scene again and all of the balls will fall.
cs: Spusťte scénu znovu a všechny míče budou padat najednou.
de: Wenn Sie die Szene erneut starten, werden all Bälle fallen.
es: Ejecuta la escena de nuevo y todas las bolas caerán.
fi: Aja skene uudestaan ja katso pallojen putoavan.
fr: Exécutez à nouveau la scène et toutes les balles tomberont.
it: Esegui la scena di nuovo e tutte le palle cadranno.
ja: シーンを再び実行すると、ボールのすべてが落下します。
ko: 씬을 다시 실행하면 모든 공이 떨어질 것입니다.
pl: Uruchom scenę ponownie i wszystkie piłki spadną.
ru: Запустите сцену снова, и все шары упадут.
uk: Знову запустіть сцену і усі кульки впадуть.
zh_cn: 再次运行场景，这些球都会落下来。
zh_tw: 再執行一次場景，然後看看所有球掉下來的樣子。

source: Editing instances
cs: Úpravy instancí
de: Instanzen bearbeiten
es: Editar instancias
fi: Ilmentymien muokkaus
fr: Éditer des instances
it: Modificare le istanze
ja: インスタンスの編集
ko: 인스턴스 편집하기
pl: Edytowanie instancji
ru: Редактирование экземпляров
uk: Редагування екземплярів
zh_cn: 编辑实例
zh_tw: 編輯實體

source: Open the ``Ball`` scene and add a ``PhysicsMaterial`` by clicking on the down arrow and selecting "New PhysicsMaterial".
es: Abre la escena ``Ball`` y agrega un ``PhysicsMaterial`` haciendo click en la flecha y seleccionado "Nuevo PhysicsMaterial".
fr: Ouvrez la scène ``Ball`` et ajoutez un ``PhysicsMaterial`` en cliquant sur la flèche vers le bas et en sélectionnant "New PhysicsMaterial".
it: Apri la scena ``Ball`` ed aggiungi un ``PhysicsMaterial`` cliccando sulla freccia verso il basso e selezionando "New PhysicsMaterial".
ko: ``Ball`` 씬을 열고 아래 화살표를 클릭하고 "새 PhysicsMaterial"을 선택해서 ``PhysicsMaterial``\ 을 추가하세요.

source: Then, expand the material by clicking on it, and set the ``Bounce`` property to ``1``.
es: Luego, expande el material haciendo click en este, y asigna ``1`` a la propiedad ``Bounce``.
fr: Ensuite, développez le contenu en cliquant dessus et définissez la propriété ``Bounce`` sur ``1``.
it: Poi, espandi il materiale cliccando su di esso, ed imposta la proprietà ``Bounce`` ad ``1``.
ko: 그 후 PhysicsMaterial을 클릭해서 펼친 후, ``Bounce`` 속성을 ``1``\ 로 설정합니다.
uk: Потім розгорніть матеріал, натиснувши на нього, і встановіть властивість ``Bounce`` (відскок) на ``1``.

source: Press "Play" and notice that all of the instanced balls are now much more bouncy. Because the instanced balls are based on the saved scene, changes to that scene will affect all instances.
cs: Stiskněte tlačítko "Hrát" a všimněte si, že všechny instance balónků jsou nyní mnohem živější. Protože jednotlivé instance míčků jsou založeny na uložené scéně Ball, změny této scény ovlivní všechny její instance.
de: Drücken Sie auf "Starten". Sie werden bemerken, dass alle Instanzen des Balles stärker springen. Da die instantiierten Bälle auf der gespeicherten Szene basieren, betreffen alle Änderungen in dieser Szene auch alle Instanzen.
es: Presiona "Play" y observa que todas las bolas instanciadas ahora rebotan mucho más. Debido a que las bolas instanciadas están basadas en la escena guardada, los cambios en esa escena afectarán a todas las instancias.
fr: Appuyez sur "Play" et remarquez que toutes les balles instanciées sont maintenant beaucoup plus rebondissantes. Comme les balles instanciées sont basées sur la scène sauvegardée, les modifications apportées à cette scène affecteront toutes les instances.
it: Premi ''Play'' e ti renderai conto che tutte quelle sfere instanziate adesso rimbalzano di più. Questo perché le sfere instanziate si basano sulla scena salvata, e le modifiche a quella scena affliggeranno tutte le sue istanze.
ja: Playを押してください。インスタンス化された全部のボールがより弾むようになりました。インスタンス化されたボールはセーブした同じシーンに基づくので、そのシーンを変更するとすべてのインスタンスに影響を与えます。
ko: "실행하기(Play)"를 누르면 모든 인스턴스된 공이 이제 더 많이 튕기는 것을 볼 수 있습니다. 인스턴스된 공은 저장한 씬 기반이기 때문에 씬의 변경사항도 인스턴스에 영향을 줍니다.
pl: Wciśnij "Graj". Zauważysz, że wszystkie piłki będące instancjami odbijają się mocniej. Jako, że bazują one na zapisanej scenie, zmiany w niej mają wpływ na wszystkie instancje.
ru: Нажмите "Play" (Играть) и вы убедитесь в том, что добавленные шары теперь более упругие. Так как эти шары основаны на сохраненной сцене, изменения этой сцены подействуют на другие экземпляры шаров.
uk: Натисніть «Відтворити». Зверніть увагу, що всі м'ячі тепер стрибають сильніше. Оскільки всі м'ячі створені на основі збереженої сцени, то зміни в цій сцені впливатимуть на всі екземпляри м'ячів.
zh_cn: 按下 :menuselection:`播放(Play)`，请注意现在所有被实例化的球会变得更有弹性。因为被实例化的球基于保存过的场景，更改该场景会影响所有实例。
zh_tw: 按 [執行]，然後就能注意到所有球的實體都變得更有彈性了。這是因為實體化的球是由剛才保存的場景所產生，所以我們對那個場景的改動都會反映到實體上。

source: You can also adjust individual instances. Set the bounce value back to ``0`` and then in the ``Main`` scene, select one of the instanced balls. Resources like ``PhysicsMaterial`` are shared between instances by default, so we need to make it unique. Click on the down arrow and select "Make Unique". Set its ``Bounce`` to ``1`` and press "Play".
fr: Vous pouvez également ajuster individuellement les instances. Remettez la valeur de rebond sur ``0``. Puis dans la scène ``Main``, sélectionnez l'une des balles instanciées et réglez son ``Bounce`` sur ``1``. Enfin appuyez sur "Jouer".
it: Puoi anche modificare istanze individuali. Riporta il valore di ``Bounce`` a 0, poi nella scena ``Main``, seleziona una della palle istanziate e modifica il suo valore ``Bounce`` a ``1`` e premi "Play".
ko: 개개의 인스턴스도 조절할 수 있습니다. Bounce 값을 ``0``\ 으로 돌려 놓고 ``Main`` 씬으로 돌아간 뒤, 인스턴스된 Ball 하나를 선택하세요. ``PhysicsMaterial``\ 과 같은 리소스도 기본적으로 인스턴스끼리 공유합니다. 따라서 먼저 이 Ball의 리소스를 유일하게 만들어야 합니다. 아래 화살표를 클릭하고 "유일하게 만들기(Make Unique)"를 선택하세요. ``Bounce`` 값을 ``1``\ 로 설정하고 "실행하기(Play)"를 누르세요.
uk: Ви також можете налаштувати окремі екземпляри. Встановіть значення Bounce (відскок) назад на ``0``, а потім, у сцені ``Main``, виберіть один із створених м'ячів. Такі ресурси, як ``PhysicsMaterial`` (фізичний матеріал) за замовчуванням поширюються на всі екземпляри, тому нам потрібно зробити його унікальним. Клацніть стрілку вниз і виберіть "Зробити унікальним". Встановіть його ``Bounce`` (відскок) в ``1`` і натисніть кнопку «Відтворити».
