Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/instancing_continued.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: A lot of time spent in programming games (or software in general) is on designing an architecture and fitting game components to that architecture. Designing based on scenes replaces that approach and makes development much faster and more straightforward, allowing you to concentrate on the game logic itself. Because most game components map directly to a scene, using a design-based on scene instantiation means little other architectural code is needed.
de: Beim Programmieren von Spielen (oder Software allgemein) wird viel Zeit dafür investiert eine Architektur zu erstellen und die Spielekomponenten dieser anzupassen. Das Entwerfen anhand von Szenen ersetzt diese Herangehensweise und macht damit das Entwickeln schneller und mehr gerade hinaus. Dies erlaubt es sich mehr auf die eigentliche Spiellogik zu konzentrieren. Da die meisten Spielekomponenten direkt in eine Szene gesetzt werden, erlaubt der Entwurf rund um Szeneninstanzierung, dass wenig architektonischer Code nötig ist.
ko: 게임을 프로그래밍할 때, 혹은 일반적으로 소프트웨어를 짤 때 가장 오래 걸리는 부분은 구조를 디자인하고 게임의 컴포넌트들을 그 구조에 알맞게 끼워넣는 것입니다. 씬을 기반으로 디자인하는 것은 이 방법을 대체하기에 게임의 로직 자체에 신경 쓸 수 있게 되어 개발을 좀 더 빠르고, 간단하게 만듭니다. 대부분의 게임 컴포넌트가 그대로 씬으로 되기 때문에 씬 인스턴화를 사용하게 되면 구조 디자인에 따른 구조적인 코드가 딱히 필요하지 않습니다.
pl: Wiele czasu spędzanego w grach (lub ogólnie w oprogramowaniu) to projektowanie architektury i dopasowywanie komponentów gier do tej architektury. Projektowanie w oparciu o sceny zastępuje to podejście i znacznie przyspiesza i upraszcza rozwój, pozwalając skupić się na samej logice gry. Ponieważ większość komponentów gry oddziałuje bezpośrednio na scenę, zastosowanie instancji opartej na projekcie oznacza, że nie jest potrzebny żaden inny kod architektoniczny.
pt_br: Muito do tempo gasto em programação de jogos (ou de softwares em geral) é projetando uma arquitetura e fazendo os componentes do jogo se encaixar nela. Projeto baseado em cenas substitui essa abordagem e torna o desenvolvimento muito mais rápido e mais direto, lhe permitindo se concentrar na lógica do jogo em si. Pelo fato de a maioria dos componentes do jogo serem mapeados diretamente a uma cena, usar projeto baseado em instâncias de cena significa que se faz necessário pouco código extra para arquitetura.
zh_cn: 开发游戏（或者是通用软件）的大部分时间被花费在设计结构并把游戏组件适配到这个结构当中。基于场景的设计方法替代了它并使开发变得更快更直接，并允许你关注游戏逻辑本身。由于大多数游戏组件直接映射到场景中，所以使用基于场景实例的设计手段意味着很少需要其他结构的代码。
