Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/intro_to_the_editor_interface.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: The next time you open the project manager, you'll see your new project in the list. Double click on it to open it in the editor.
cs: Při příštím otevření správce projektu se váš nový projekt zobrazí v seznamu. Dvojitým kliknutím na něj ho otevřete v editoru.
de: Das nächste Mal wenn Sie Godot starten, werden Sie Ihr neues Projekt in der Liste stehen sehen. Klicken Sie es mit einem Doppelklick an, um es im Editor zu öffnen.
es: La próxima vez que abras el administrador de proyectos, verás tu nuevo proyecto en la lista. Haz doble clic sobre él para abrirlo en el editor.
fr: La prochaine fois que vous ouvrirez le gestionnaire de projets, vous verrez votre nouveau projet dans la liste. Double-cliquez dessus pour l'ouvrir dans l'éditeur.
it: La prossima volta che aprirai Godot, vedrai il nuovo progetto nella lista. Fai doppio click per aprirlo nell'editor.
ja: 次回以降プロジェクトマネージャーを開くと、リストに新しいプロジェクトが表示されます。ダブルクリックしてエディタで開きます。
pl: Następnym razem, gdy otworzysz menedżer projektów, zobaczysz swój nowy projekt na liście. Kliknij na niego dwukrotnie, aby otworzyć go w edytorze.
ru: В следующий раз, когда вы откроете менеджер проекта, вы увидите ваш новый проект в списке. Дважды кликните по нему, чтобы открыть его в редакторе.
uk: Наступного разу, коли ви відкриєте менеджер проєкту, ви побачите ваш новий проєкт в списку. Двічі клікніть по ньому, щоб відкрити його в редакторі.
zh_tw: 下次打開專案管理員的時候就會在清單上看到新專案了。點兩下就能在編輯器中打開。

source: You can import existing projects in a similar way, using the Import button. Locate the folder that contains the project or the ``project.godot`` file to import and edit it.
cs: Existující projekty můžete načíst podobným způsobem pomocí tlačítka Import. Pro otevření a editaci vyhledejte složku, která obsahuje projekt nebo soubor ``project.godot``.
de: Sie können bereits bestehende Projekte auf ähnliche Weise importieren. Suchen Sie dazu den Ordner, welcher das Projekt oder die Datei "project.godot" enthält um sie zu importieren und zu bearbeiten.
es: Se pueden importar proyectos existentes del mismo modo, usando el botón Importar. Localiza la carpeta que contiene el proyecto o el archivo ``project.godot`` para importarlo y editarlo.
fi: Voit tuoda olemassa olevia projekteja samaan tapaan käyttämällä Tuo painiketta. Etsi kansio, joka sisältää projektin tai ``project.godot`` tiedoston, tuodaksesi projektin ja muokataksesi sitä.
fr: Vous pouvez importer des projets existants de manière similaire, en utilisant le bouton Importer. Localisez le répertoire contenant le projet ou le fichier ``project.godot`` pour l'importer et le modifier.
it: Si possono importare progetti esistenti in maniera simile, utilizzando il bottone Importa. Trova la cartella che contiene il progetto o il file ``project.godot`` per importarlo e modificarlo.
ja: 他のプロジェクトをインポートするには、インポートボタンを使います。 ``project.godot`` ファイルの入っているフォルダに移動し、 ``project.godot`` ファイルを選択すると、インポートを行い編集できます。
ko: 이와 비슷하게, 가져오기(Import) 버튼으로도 존재하는 프로젝트를 가져올 수 있습니다. 프로젝트나 ``project.godot`` 파일이 들어있는 폴더 위치를 지정하면 가져오고 편집합니다.
pl: W podobny sposób można zaimportować istniejące projekty, używając przycisku Importuj. Znajdź folder, który zawiera projekt lub plik ``project.godot``, aby go zaimportować i edytować.
pt_br: Você pode importar projetos existentes de maneira similar, usando o botão Importar. Localize a pasta que contém o projeto ou o arquivo ``project.godot`` para importá-lo e editá-lo.
ru: Вы можете импортировать существующие проекты аналогичным образом, используя кнопку Import (Импорт). Укажите папку, содержащую проект или файл ``project.godot``, чтобы его импортировать и редактировать.
uk: Ви можете імпортувати наявні проєкти аналогічним чином, використовуючи кнопку Імпортувати. Знайдіть теку, яка містить проєкт або файл ``project.godot``, щоб імпортувати та редагувати його.
zh_cn: 您可以用类似方式导入现有项目。点击导入按钮，找到含有 ``project.godot`` 文件的项目目录就可以导入并编辑它了。
zh_tw: 也可以用類似的方法來匯入現有的專案。按 [匯入] 按鈕，找到專案所在的資料夾或是 ``project.godot`` 檔案來匯入或編輯。

source: When the folder path is correct, you'll see a green checkmark.
cs: Když je cesta ke složce správná, zobrazí se zelená fajfka.
de: Wenn der Dateipfad zum Ordner korrekt ist, sehen Sie einen grünen Haken.
es: Cuando la ruta a la carpeta es correcta, se verá la marca verde.
fi: Kun projektin polku on oikein, näet vihreän oikein-merkin.
fr: Lorsque le chemin du dossier est valide, une coche verte est affichée.
it: Se il percorso della cartella è corretto vedrai un segno di spunta verde.
ja: フォルダパスが正しいときには、緑色のチェックマークが表示されます。
ko: 폴더 경로가 올바르다면 초록색 체크 표시가 나타납니다.
pl: Jeśli ścieżka do katalogu będzie poprawna, zobaczysz zielony znacznik.
pt_br: Quando o caminho da pasta está correto, você vê uma marca verde de confirmação.
ru: Когда путь к папке будет указан верно, вы увидите зеленую галочку.
uk: Якщо шлях до теки вірний, ви побачите зелену галочку.
zh_cn: 如果目录路径正确您会看到绿色的对号。
zh_tw: 如果資料夾路徑正確，就會看到一個綠色勾勾。

source: Your first look at Godot's editor
cs: Váš první pohled na Godotův editor
de: Ein erster Blick auf Godots Editor
es: Una primera mirada al editor de Godot
fr: Votre premier coup d’œil à l'éditeur de Godot
it: La tua prima occhiata all'editor di Godot
ja: はじめてのGodotエディタ
pl: Twoje pierwsze spojrzenie na edytor Godota
ru: Первый взгляд на редактор Godot
uk: Перший погляд на редактор Godot
zh_tw: 初步認識 Godot 編輯器

source: Welcome to Godot! With your project open, you should see the editor's interface with menus along the top of the interface and docks along the far extremes of the interface on either side of the viewport.
cs: Vítejte v Godotu! Po otevření projektu byste měli vidět rozhraní editoru s nabídkami podél horní části rozhraní a doky po obou jeho stranách.
de: Willkommen bei Godot! Sobald Sie Ihr Projekt geöffnet haben, sollten Sie die Oberfläche des Editors mit den Menüs ganz oben und den Werkzeugleisten am linken und rechten Rand des Arbeitsbereichs sehen.
es: ¡Bienvenido a Godot! Con un proyecto abierto, deberías ver la interfaz del editor con menús a lo largo de la parte superior de la interfaz y los paneles a lo largo de los extremos más lejanos de la interfaz a ambos lados de la ventana gráfica.
fr: Bienvenue dans Godot ! Lorsque votre projet est ouvert, vous devriez voir l'interface de l'éditeur avec des menus en haut de l'interface et des docks aux extrémités de l'interface de chaque côté de la fenêtre d'affichage.
it: Benvenuti in Godot! Con il progetto aperto dovreste vedere l'interfaccia dell'editor con i menu lungo la parte superiore dell'interfaccia e le dock lungo gli estremi dell'interfaccia su ambo i lati della viewport.
ja: Godotへようこそ！ プロジェクトを開くとエディタのインターフェイスが表示され上部にはメニューが、そしてビューポートを挟んだ両側にはドックがあるはずです。
pl: Witamy w Godocie! Po otwarciu projektu, powinien ci się pokazać interfejs edytora, z różnymi menu na górze interfejsu oraz dokami wzdłuż końca każdego boku głównego widoku sceny.
ru: Добро пожаловать в Godot! Открыв свой проект, вы увидите интерфейс редактора с меню в верхней части интерфейса и панелями, расположенными по обе стороны от окна обзора.
uk: Ласкаво просимо в Godot! Відкривши свій проєкт, ви побачите інтерфейс редактора з меню у верхній частині інтерфейсу і панелями, розташованими по обидва боки від ескізу.
zh_tw: 歡迎來到 Godot！打開專案後應該就能看到編輯器界面。選單在畫面的上方，而 Dock 則在檢視區的兩側。

source: At the top, from left to right, you can see the **main menus**, the **workspaces**, and the **playtest buttons**.
cs: V horní části zleva doprava jsou zobrazeny **hlavní nabídky**, ** pracovní plochy **a** tlačítka pro spouštění projektu **.
de: Auf der oberen Leiste von links nach rechts sehen Sie die **Hauptmenüfelder**, dann die **Arbeitsbereiche** und zuletzt die Kontrollschaltflächen zum **Testen und Debuggen des Projekts**.
es: En la parte superior, de izquierda a derecha, se pueden ver el **menú principal**, los **espacios de trabajo**, y los **botones de ejecución de prueba**.
fi: Ylhäällä, vasemmalta oikealle luettuna, voit nähdä **valikot (main menus)**, **työtilat (workspaces)** ja **pelitestauspainikkeet (playtest buttons)**.
fr: En haut, de gauche à droite, vous voyez les **menus principaux**, les **fenêtres d'affichage**, et les **boutons de test**.
it: In alto, da sinistra a destra, sono visibili i **menù principali**, gli **spazi di lavoro**, e i **bottoni di playtest**.
ja: 上から順番に、左から右へ\ **メインメニュー**\ 、\ **ワークスペース**\ 、そして\ **テストプレイボタン**\ があります。
ko: 맨 위에 있는 메뉴들은 왼쪽부터 **기본 메뉴(main menus)**, **작업 공간(workspaces)**, **실행 및 테스트 버튼(playtest buttons)**\ 입니다.
pl: Na górze, od lewej do prawej, można zobaczyć **menu główne**, **powierzchnie robocze** oraz **przyciski odtwarzacza**.
pt_br: No topo, da esquerda para a direita, você pode ver os **menus principais**, as **workspaces** e os **botões de teste**.
ru: В верхней части слева направо вы можете увидеть **главное меню**, **рабочие области** и **кнопки воспроизведения**.
uk: Угорі, зліва направо, ви бачите **основні меню**, **робочі області** та **кнопки відтворення**.
zh_cn: 在顶部，从左到右，您可以看到 **主菜单** 、**工作区** 以及 **各调试按钮** 。
zh_tw: 上方從左到右分別是 **主選單**、**工作區**、以及 **執行測試按鈕**。

source: The **FileSystem dock** is where you'll manage your project files and assets.
cs: Dok **Souborový systém** je místo, kde budete spravovat soubory a zdroje projektu.
de: Im **Dateisystem-Dock** werden Projektdateien sowie Nutzerinhalte verwaltet.
es: El ** Panel de sistema de archivos** es donde gestionas los archivos y los activos del proyecto.
fr: Le **dock FileSystem** est l'endroit où vous gérerez les fichiers et les ressources(assets) de votre projet.
it: Il dock **FileSystem** è dove potrai gestire i file e le risorse del tuo progetto.
ja: **ファイルシステムドック** は、プロジェクトファイルとアセットを管理する場所です。
pl: W **Doku systemu plików** będziesz zarządzać plikami i zasobami swojego projektu.
ru: В док-панели **FileSystem** (Файловая система) вы можете управлять файлами и ресурсами вашего проекта.
uk: У док-панелі **FileSystem** (Файлова система) ви можете керувати файлами та ресурсами вашого проєкту.
zh_tw: **檔案系統 Dock** 是用來管理專案檔案與素材的地方。

source: The **Scene dock** lists the active scene's content and the **Inspector** allows for the management of the properties of a scene's content.
cs: Dok **Scéna** ukazuje složení aktivní scény a **Inspektor** umožňuje editaci vlastností položek scény.
de: Das **Szenen-Dock**listet den Inhalt der aktuellen Szene auf und der **Inspektor** erlaubt das Verwalten der Eigenschaften des Szeneninhalts.
es: El **Panel de escena** lista el contenido de la escena activa y el **Inspector** permite la gestión de las propiedades del contenido de la escena.
fr: Le **Dock de scène** répertorie le contenu de la scène active et l'**Inspecteur** permet de gérer les propriétés d'une scène.
ja: **シーン ドック** には開いているシーンの中身がリストされており、 **インスペクタ** ではそれらのプロパティを管理できます。
pl: **Dok sceny** listuje zawartość aktywnej sceny, a **Inspector** pozwala na zarządzanie właściwościami zawartości sceny.
ru: Док-панель **Scene** (Сцена) включает в себя перечень содержимого текущей сцены, в то время как **Inspector** (Инспектор) позволяет управлять свойствами её содержимого.
uk: Док-панель **Scene** (Сцена) включає в себе перелік вмісту поточної сцени, в той час як **Inspector** (Інспектор) дозволяє управляти властивостями її вмісту.
zh_tw: **場景 Dock** 列出了開啟的場景的內容，**屬性面板** 則可以控制場景內容的屬性。

source: In the center, you have the **Toolbar** at the top, where you'll find tools to move, scale or lock your scene's objects. It changes as you jump to different workspaces.
cs: Uprostřed máte nahoře **Nástrojový pruh**, kde najdete nástroje pro přesun, škálování nebo zamknutí objektů scény. Mění se při přechodu na různé pracovní plochy.
de: Oben im Arbeitsbereich ist die **Toolbar** untergebracht. Dort finden Sie Werkzeuge zum Bewegen, Skalieren oder Sperren der Objekte Ihrer aktuellen Szene. Die Werkzeuge ändern sich, sobald Sie zu einem anderen Arbeitsbereich wechseln.
es: En el centro, arriba, está la **Barra de herramientas**, donde se encuentran las herramientas para mover, escalar o bloquear objetos de la escena. Esta barra cambia en función de los distintos espacios de trabajo.
fr: Au centre en haut, vous avez la **Barre d'outils**, où vous trouverez des outils pour déplacer, mettre à l'échelle ou verrouiller les objets de votre scène. Elle est différente pour chaque espace de travail.
it: Al centro, in alto, hai la **Toolbar**, dove si potranno trovare gli strumenti per muovere, scalare o bloccare gli oggetti nella scena. La **Toolbar** cambia le sue funzioni quando si passa tra differenti spazi di lavoro.
ja: 中央上部にある **ツールバー** には、シーン内のオブジェクトを動かしたりサイズ変更やこれらをロックするためのツールが並んでいます。それらはワークスペースごとに違うものに変わります。
pl: Na górze na środku jest **Pasek narzędzi**, gdzie znajdziesz narzędzia do przesuwania, skalowania czy blokowania obiektów sceny. Zmienia się on kiedy przechodzisz między różnymi obszarami roboczymi.
ru: В центре сверху у вас есть **панель инструментов**, где вы найдете инструменты для перемещения, масштабирования или блокировки ваших объектов сцены. Она изменяется, когда вы переключаетесь между различными рабочими областями.
uk: У центрі зверху у вас є **панель інструментів**, де ви знайдете інструменти для переміщення, масштабування або блокування ваших об'єктів сцени. Вона змінюється, коли ви переключаєтеся між різними робочими областями.
zh_tw: 畫面的中間上方有 **工具列**，其中有用來移動、縮放或是鎖定場景中物件的工具。這裡的工具會依據所在工作區的不同而改變。

source: The **Bottom Panel** is the host for the debug console, the animation editor, the audio mixer… They are wide and can take precious space. That's why they're folded by default.
cs: **Dolní Panel** je hostitelem pro ladicí konzole, editor animace, audio mixer ... Tyto panely sou široké a mohou zabírat drahocenný prostor. To je důvod, proč jsou ve výchozím nastavení složeny.
de: In der **Bodenleiste** befindet sich die Debug-Konsole, der Animations-Editor, Audiomixer etc. Sie ist relativ breit und kann wertvollen Platz einnehmen. Daher ist sie in der Regel zusammengeklappt.
es: El **Panel inferior** es el contenedor de la consola de depuración, el editor de animaciones, el mezclador de audio... Estos elementos son anchos y pueden ocupar espacio valioso, es por eso que se encuentran ocultos por defecto.
fr: La **panneau du bas** contient la console de débogage, l'éditeur d'animations, le mixeur audio… Ils sont larges et peuvent occuper un espace précieux, c'est pourquoi ils sont repliés par défaut.
it: Il **Pannello Inferiore** è dedicato alla console di debug, all'editor per le animazioni e il mixer audio... Visto che occupano molto spazio, vengono mantenuti chiusi di default.
ja: **下パネル**\ はデバッグコンソール、アニメーションエディタ、オーディオミキサーなどのためにあります。これらは幅広で貴重なスペースを消費するため、既定では折りたたまれています。
pl: **Dolny Panel** mieści konsolę debugowania, edytor animacji, mikser audio... Są one szerokie i mogą zabrać cenne miejsce. Dlatego są domyślnie zwinięte.
ru: **Нижняя панель** включает в себя консоль отладки, редактор анимации, аудиомикшер... Они широкие и могут занимать много драгоценного пространства, поэтому по умолчанию они свернуты.
uk: **Нижня панель** включає в себе консоль налагодження, редактор анімації, аудіомікшер... Вони широкі і можуть займати багато дорогоцінного простору, тому за замовчуванням вони згорнуті.
zh_tw: **底部面板** 裡有除錯主控台、動畫編輯器、音效混合器…等。這些東西很多且佔用很多空間，所以預設會摺疊起來。

source: The workspaces
cs: Pracovní plochy
de: Die Arbeitsbereiche
es: Los espacios de trabajo
fi: Työtilat
fr: Les fenêtres d'affichage
it: Gli spazi di lavoro
ja: ワークスペース
ko: 작업 공간(Workspace)
pl: Przestrzenie robocze
pt_br: Os Espaços de Trabalho
ru: Рабочие пространства
uk: Робочі простори
zh_cn: 工作区
zh_tw: 工作區

source: You can see four workspace buttons at the top: 2D, 3D, Script and AssetLib.
cs: Nahoře jsou vidět čtyři tlačítka pro změnu pracovní plochy: 2D, 3D, Skript a AssetLib.
de: Oben befinden sich die vier Arbeitsumgebungen: 2D, 3D, Script, und AssetLib.
es: Se pueden observar botones de cuatro espacios de trabajo en la parte superior: 2D, 3D, Script y AssetLib.
fi: Ylhäällä näet painikkeet neljälle työtilalle: 2D, 3D, Script ja AssetLib.
fr: Vous pouvez voir quatre boutons de fenêtres d'affichage en haut : 2D, 3D, Script et AssetLib.
it: Nella parte superiore sono visibili quattro pulsanti dell'area di lavoro: 2D, 3D, Script e AssetLib.
ja: 上に４個あるのがワークスペースのボタンです。(2D、3D、Script、およびAssetLib)。
ko: 위에서 4개의 작업 공간 버튼을 볼 수 있습니다: 2D, 3D, Script 그리고 AssetLib.
pl: Na górze edytora znajdują się cztery przyciski : 2D, 3D, Skrypt i Biblioteka Zasobów.
pt_br: Você pode ver quatro botões de espaços de trabalho no topo: 2D, 3D, Script e AssetLib.
ru: Вверху вы можете увидеть четыре кнопки рабочего пространства: 2D, 3D, Script и AssetLib.
uk: Зверху ви можете побачити чотири кнопки робочого простору: 2D, 3D, Script і AssetLib.
zh_cn: 您可以看到顶部有四个工作区按钮:2D、3D、脚本和资源馆。
zh_tw: 上方有四個工作區按鈕：[2D]、[3D]、[腳本]、[素材庫] 等。

source: You'll use the **2D workspace** for all types of games. In addition to 2D games, the 2D workspace is where you'll build your interfaces. Press :kbd:`F1` (or :kbd:`Alt + 1` on macOS) to access it.
cs: Pracovní plochu **2D** budete používat pro všechny typy her. Kromě 2D her je 2D pracoviště také místem, kde budete vytvářet uživatelské rozhraní pro vaše hry. Pro rychlý přístup stiskněte klávesy: kbd: `F1` (nebo: kbd:`Alt + 1` v systému MacOS) .
de: Den **2D-Arbeitsbereich** werden Sie für sämtliche Arten von Spielen benutzen. Zusätzlich zu den 2D-Spielen werden Sie dort Ihre Benutzeroberflächen erstellen. Drücken Sie :kbd:`F1` (oder :kbd:`Alt + 1` auf MacOS) um darauf zuzugreifen.
it: Userai lo **Spazio di Lavoro 2D** per tutti i tipi di giochi. Oltre ai giochi 2D, è qui che potrai creare le tue interfacce. Premi :kbd:`F1` (o :kbd:`Alt + 1` su macOS) per accedervi.
ja: すべてのタイプのゲームに **2Dワークスペース** を使用します。2Dゲームに加えて、2Dワークスペースはインターフェイスを構築する場所です。\ :kbd:`F1` (またはmacOSでは :kbd:`Alt + 1`) を押してアクセスします。
pl: **Przestrzeni roboczej 2D** będziesz korzystać we wszystkich typach gier. Poza grami 2D, przestrzeń robocza 2D jest miejscem gdzie budujesz swój interfejs. Naciśnij :kbd:`F1` (lub :kbd:`Alt + 1` na macOS), aby uzyskać do niej dostęp.
ru: Вы будете использовать **рабочее пространство 2D** для всех типов игр. Кроме непосредственно 2D-игр, там вы будете создавать свои интерфейсы. Нажмите :kbd:`F1` (или :kbd:`Alt + 1` на macOS) для доступа к нему.
zh_tw: 所有類型的遊戲都會用到 **2D 工作區**。而 2D 工作區除了製作 2D 遊戲以外，也用來製作界面。按 :kbd:`F1` (或是 macOS 上 :kbd:`Alt + 1`) 來打開。

source: In the **3D workspace**, you can work with meshes, lights, and design levels for 3D games. Press :kbd:`F2` (or :kbd:`Alt + 2` on macOS) to access it.
cs: Na **3D** pracovní ploše můžete pracovat s mřížkou a osvětlením při návrhu úrovní pro 3D hry. Otevřete ji stisknutím klávesy: kbd: `F2` (nebo: kbd:` Alt + 2` v systému MacOS) .
de: Im **3D-Arbeitsbereich** arbeiten Sie mit Meshes und Lichtobjekten und erstellen Design-Ebenen für 3D-Spiele. Drücken Sie :kbd:`F2` (oder :kbd:`Alt + 2` auf MacOS), um hierauf zuzugreifen.
it: Nello **Spazio di lavoro 3D** puoi utilizzare modelli, luci e progettare livelli per giochi 3D. Premi :kbd:`F2` (oppure :kbd:`Alt + 2` su macOS) per accedervi.
ja: **3Dワークスペース**\ では、メッシュや光源への作業や、3Dゲームのレベルデザインが行えます。\ :kbd:`F2` (macOSでは :kbd:`Alt + 2`) を押すと開けます。
pl: W **obszarze roboczym 3D** możesz pracować z siatkami, światłami i projektować poziomy dla gier 3D. Naciśnij `F2` (lub :kbd:`Alt + 2` na macOS), aby uzyskać do niego dostęp.
ru: В **рабочем пространстве 3D** вы можете работать с сетками (mesh), освещением и проектированием уровней для 3D-игр. Нажмите :kbd:`F2` (или :kbd:`Alt + 2` на macOS) для доступа к нему.
zh_tw: **3D 工作區** 可以建立網格、光照以及設計 3D 遊戲的關卡。按 :kbd:`F2` (或 macOS 上 :kbd:`Alt + 2`) 來打開。

source: Notice the perspective button under the toolbar, it opens a list of options related to the 3D viewport.
cs: Všimněte si tlačítka Perspektivní pod panelem nástrojů, otevírá seznam možností souvisejících s 3D pohledem.
de: Beachten Sie die Schaltfläche [Perspektive] unterhalb der Werkzeugleiste. Darüber lässt sich ein Menü mit Einstell-Optionen für die 3D-Ansicht öffnen.
es: Fijese en el botón perspectiva debajo de la barra de herramientas, este abre una lista de opciones relacionadas con la vista 3D.
fr: Remarquez le bouton perspective sous la barre d'outils, il ouvre une liste d'options liées au viewport 3D.
it: Si noti il tasto [Prospettiva] sotto la barra degli strumenti: apre una lista di opzioni in relazione alla vista 3D.
ja: ツールバーの下の透視投影ボタンに注目してください。3Dビューポートに関連するオプションのリストが開きます。
pl: Zwróć uwagę na przycisk perspektywy pod paskiem narzędzi, otwiera listę opcji związanych z widokiem 3D.
ru: Обратите внимание на кнопку *Perspective* (Перспективный) под панелью инструментов. Она открывает меню настроек 3D-обзора.
uk: Зверніть увагу на кнопку Перспектива на панелі інструментів, вона відкриває список параметрів, пов'язаних із тривимірним вікном перегляду.
zh_tw: 另外請注意工具列下方的 [透視] 按鈕，可以打開與 3D 檢視區相關的選項列表。

source: Read :ref:`doc_introduction_to_3d` for more detail about **3D workspace**.
cs: Přečtěte si :ref:`doc_introduction_to_3d` pro více informací o ** 3D pracovní ploše **.
de: Lese :ref:`doc_introduction_to_3d` für weitere Informationen zum **3D-Arbeitsbereich**.
es: Lee :ref:`doc_introduction_to_3d` para mas detalles sobre **Espacio de trabajo 3D**.
fr: Lisez :ref:`doc_introduction_to_3d` pour plus de détails à propos de **l'espace de travail 3D**.
it: Leggi :ref:`doc_introduction_to_3d` per più dettagli riguardo l'area di lavoro **3D**.
ja: **3Dワークスペース**\ の詳細については\ :ref:`doc_introduction_to_3d`\ をご覧ください。
ko: **3D 작업 공간**에 대해 더 알아보려면 :ref:`doc_introduction_to_3d`\ 을 읽어보세요.
pl: Przeczytaj :ref:`doc_introduction_to_3d` aby dowiedzieć się więcej szczegółów o **przestrzeni roboczej 3D**.
pt_br: Leia :ref:`doc_introduction_to_3d` para saber mais sobre **Espaço de Trabalho 3D**.
ru: Прочитайте :ref:`doc_introduction_to_3d` для более подробной информации о **3D workspace**.
uk: Прочитайте :ref:`doc_introduction_to_3d` для більш детальної інформації про **3D робочий простір**.
zh_cn: 更多关于 **3D 工作区** 的细节，请查看 :ref:`doc_introduction_to_3d`。
zh_tw: 關於 **3D 工作區** 的詳細介紹請參考 :ref:`doc_introduction_to_3d`。

source: The **Script** workspace is a complete code editor with a debugger, rich auto-completion, and built-in code reference. Press :kbd:`F3` (or :kbd:`Alt + 3` on macOS) to access it, and :kbd:`Shift + F1` to search the reference.
cs: Pracovní plocha **Skript** je kompletní editor kódu s debuggerem, bohatým automatickým dokončováním a vestavěnou referenční dokumentací Stiskněte: kbd: `F3` (nebo: kbd:` Alt + 3` v systému MacOS) pro přístup na plochu a: kbd: `Alt + F1` pro hledání v referenční dokumentaci.
de: Der **Skript** Arbeitsbereich ist ein vollständiger Code-Editor mit einem Debugger, einer umfassenden automatischen Vervollständigung und einer integrierten Code-Referenz. Drücken Sie: kbd: `F3` (oder: kbd:` Alt + 3` unter MacOS), um darauf zuzugreifen, und: kbd: `Shift + F1`, um die Referenz zu durchsuchen.
it: Lo spazio di lavoro **Script** è un editor di codice completo, con un debugger, auto-completamento e documentazione integrata. Premi :kbd:`F3` (o :kbd:`Alt + 3` su macOS) per accedervi, e :kbd:`F4` per cercare nella documentazione.
ja: **Script** ワークスペースは、デバッガー、豊富な自動補完、および組み込みのコードリファレンスを備えた、完全なコードエディタです。\ :kbd:`F3` ( macOSでは :kbd:`Alt + 3`)で開くことができ、また :kbd:`Shift + F1` でリファレンスを検索できます。
pl: Obszar roboczy **Script** to kompletny edytor kodu z debugerem, rozbudowanym autouzupełnianiem i wbudowaną referencją kodu. Naciśnij :kbd:`F3` (lub :kbd:`Alt + 3` w systemie macOS) aby uzyskać do niego dostęp, i :kbd:`Shift + F1` aby przeszukać referencję klas.
ru: Рабочее пространство **Script** представляет собой полноценный редактор кода с отладчиком, расширенным автозаполнением и встроенной справкой. Нажмите :kbd:`F3` (или :kbd:`Alt + 3` в macOS) для доступа к нему и :kbd:`Shift + F1` для поиска по справке.
zh_tw: **腳本** 工作區是一個完整的程式碼編輯器，有除錯工具、完整的自動補全、以及內建的程式碼參照功能。按 :kbd:`F3` (或 macOS 上 :kbd:`Alt + 3` ) 來打開，:kbd:`F4` 可以搜尋參照。
