Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/intro_to_the_editor_interface.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Introduction to Godot's editor
cs: Úvod do Godotova editoru
de: Einführung in den Godot-Editor
es: Introducción al editor de Godot
fr: Introduction à l'éditeur de Godot
it: Introduzione all'editor di Godot
ja: Godotエディタ・イントロダクション
pl: Wprowadzenie do edytora silnika Godot
ru: Введение в редактор кода Godot
uk: Введення в редактор коду Godot
zh_tw: Godot 編輯器簡介

source: This tutorial will run you through Godot's interface. We're going to look at the **Project Manager, docks, workspaces** and everything you need to know to get started with the engine.
cs: Tento tutoriál vás provede Godotovým rozhraním. Podíváme se na ** Správce projektu, doky, pracovní plochy** a vše, co potřebujete vědět, abyste mohli začít s enginem.
de: Die folgende Anleitung veranschaulichen Ihnen die Oberfläche von Godot. Wir werden einen Blick auf die **Projektverwaltung, andockbare Bereiche, Arbeitsbereiche** werfen und alles andere, was Sie zum Loslegen mit der Engine wissen müssen.
es: Este tutorial te llevará a través de la interfaz de Godot. Veremos el **Administrador de Proyectos, paneles, espacios de trabajo** y todo lo que necesitas saber para comenzar a utilizar el motor.
fr: Ce tutoriel va vous présenter l'interface de Godot. Nous allons voir **le Gestionnaire de projets, les docks, les espaces de travail** et tout ce que vous avez besoin de savoir pour démarrer avec le moteur.
it: Questo tutorial ti guiderà attraverso l'interfaccia di Godot. Vedremo le schermate di **Gestione Progetto, docks, spazi di lavoro** e tutto quello che c'è da sapere per iniziare ad usare Godot.
ja: このチュートリアルでは、Godotのインターフェースを駆け足で紹介していきます。具体的には\ **プロジェクトマネージャー、ドック、ワークスペース**\ など、エンジンを使い始めるのに必要なものすべてを見ていきます。
pl: Ten samouczek poprowadzi cię przez interfejs Godota. Przyjrzymy się **menedżerowi projektów, dokom, przestrzeniom roboczym** i wszystkiemu, co musisz wiedzieć, by zacząć pracę z silnikiem.
ru: Это руководство проведет вас через интерфейс Godot. Мы рассмотрим **Менеджер проектов, доки, рабочие области** и все, что вам нужно знать, чтобы начать работу с движком.
uk: Це керівництво проведе вас через інтерфейс Godot. Ми розглянемо **Менеджер проєктів, доки, робочі області** і все, що вам потрібно знати, щоб почати роботу з движком.
zh_tw: 本教學將簡介 Godot 界面。我們將會看到 **專案管理員、Dock、工作空間** 以及所有入門 Godot 所需要的東西。

source: You can `download Godot Engine here <https://godotengine.org/download/>`_.
cs: Můžete si stáhnout Godot Engine zde <https://godotengine.org/download/> `_.
de: Sie können die `Godot Engine hier runterladen <https://godotengine.org/download/>`_.
es: Puedes `descargar Godot Engine aquí <https://godotengine.org/download/>`_.
fr: Vous pouvez `télécharger le moteur Godot ici <https://godotengine.org/download/>`_.
ru: Вы можете `скачать Godot Engine здесь <https://godotengine.org/download/>` _.
uk: Ви можете `завантажити Godot Engine тут <https://godotengine.org/download/>`_.
zh_tw: 可以 `從此處下載 Godot Engine <https://godotengine.org/download/>`_ 。

source: Project manager
cs: Správce projektu
de: Projektverwaltung
es: Administrador de proyectos
fi: Projektinhallinta
fr: Gestionnaire de projets
it: Gestore di Progetto
ja: プロジェクトマネージャー
ko: 프로젝트 매니저(Project Manager)
pl: Menedżer projektów
pt_br: Gerenciador de Projetos
ru: Менеджер проекта
uk: Керівник проєкту
zh_cn: 项目管理器
zh_tw: 專案管理員

source: When you launch Godot, the first window you'll see is the Project Manager. Since you have no projects there will be a popup asking if you want to open the asset library, just click cancel, we'll look at it later.
cs: Když spustíte Godot, první okno, které uvidíte, je Správce projektu. Protože nemáte žádné projekty, objeví se vyskakovací okno s dotazem, zda chcete otevřít knihovnu zdrojů, stačí kliknout na tlačítko Zrušit, podíváme se na to později.
de: Wenn Sie Godot starten, erscheint als erstes Fenster die Projektverwaltung. Weil Sie noch keine Projekte angelegt haben, wird ein Popup mit der Frage erscheinen, ob Sie die Bestandsbibliothek öffnen möchten. Klicken Sie einfach auf Abbrechen, wir schauen uns das später an.
es: Cuando inicies a Godot, la primera ventana que verás es la del Administrador de Proyectos. Como no tienes proyectos, aparecerá una ventana emergente que te preguntará si quieres abrir la biblioteca de assets, sólo tienes que hacer clic en cancelar, ya lo veremos más tarde.
fr: La première fenêtre que vous voyez en ouvrant Godot est le Gestionnaire de projets. Comme vous n'avez pas de projets, une fenêtre s'ouvre pour vous demander si vous voulez ouvrir la bibliothèque d'assets. Il vous suffit de cliquer sur annuler, nous y reviendrons plus tard.
it: Quando avvii Godot, la prima finestra che vedi è il gestore dei progetti. Siccome non hai progetti, comparirà un popup che ti chiederà se vuoi aprire la libreria degli asset. Per ora clicca cancella, ci daremo un occhiata successivamente.
ja: Godotを起動すると、最初に表示されるウィンドウはプロジェクトマネージャーです。まだプロジェクトがないため、アセットライブラリを開くかどうかを確認するポップアップが表示されます。これについては後で見ていくので、今はキャンセルをクリックしましょう。
pl: Po uruchomieniu Godota, pierwszym oknem, które zobaczysz, jest Menedżer Projektów. Ponieważ nie masz projektów, pojawi się okienko pytające, czy chcesz otworzyć bibliotekę zasobów. Po prostu kliknij anuluj, przyjrzymy się jej później.
ru: Когда вы запускаете Godot, первое окно, которое вы увидите, - это менеджер проекта. Поскольку у вас нет проектов, появится всплывающее окно с запросом, хотите ли вы открыть библиотеку ассетов - просто нажмите кнопку "Отмена", мы вернёмся к этому позже.
uk: Коли ви запускаєте Godot, перше вікно, яке ви побачите, - це менеджер проєкту. Оскільки у вас немає проєктів, з'явиться спливаюче вікно із запитом, чи хочете ви відкрити бібліотеку Ассет - просто натисніть кнопку "Скасувати", ми повернемося до цього пізніше.
zh_tw: 啟動 Godot 後看到的第一個視窗就是專案管理員了。由於目前還沒有專案，所以會出現一個彈窗詢問是否開啟素材庫，這裡先點 [取消]，我們晚點再回來看。

source: Now you should see the project manager. It lets you create, remove, import or play game projects.
cs: Nyní byste měli vidět správce projektu. Umožňuje vytvářet, mazat, importovat nebo spouštět herní projekty.
de: Jetzt sollten Sie den Projekt Manager sehen, in diesem können Sie Projekte erstellen, entfernen, importieren oder Spielen.
es: Ahora deberías ver el administrador de proyectos. Te permite crear, borrar, importar o ejecutar proyectos de juegos.
fr: Vous devriez maintenant voir le gestionnaire de projets. Il vous permet de créer, supprimer, importer ou lancer les projets.
it: Ora dovresti vedere il Gestore dei Progetti. Esso ti permette di creare, rimuovere, importare o giocare i vari progetti.
ja: これで、プロジェクトマネージャーが表示されます。ゲームプロジェクトを作成、削除、インポート、またはプレイできます。
pl: Teraz powinien się pokazać menedżer projektów. Pozwala ci on tworzyć, usuwać, importować lub uruchamiać projekty gier.
ru: Теперь вы должны увидеть менеджер проектов. Он позволяет создавать, удалять, импортировать или запускать игровые проекты.
uk: Тепер ви повинні побачити «Керування проєктами». За його допомогою можна створювати, видаляти, імпортувати або відтворювати ігрові проєкти.
zh_tw: 現在應該可以看到專案管理員了。這裡可以建立、移除、匯入或是執行遊戲專案。

source: In the top-right corner you'll find a drop-down menu to change the editor's language.
cs: V pravém horním rohu najdete rozbalovací nabídku pro změnu jazyka editoru.
de: In der rechten oberen Ecke finden Sie ein Aufklappmenü, um die Sprache des Editors zu ändern.
es: En la esquina superior derecha encontrarás un menú desplegable que permite cambiar el idioma del editor.
fr: Dans le coin en haut à droite vous trouverez un menu déroulant pour changer la langue de l'éditeur.
it: Nell'angolo in alto a destra vedrai un menù a tendina per cambiare la lingua dell'editor.
ja: ウィンドウ右上の角にエディタの言語を変更するドロップダウンメニューが見えるでしょう。
pl: W prawym górnym rogu znajduje się rozwijane menu do zmiany języka edytora.
ru: В правом верхнем углу вы найдете выпадающее меню для изменения языка интерфейса редактора.
uk: У правому верхньому куті ви знайдете меню, що випадає для зміни мови інтерфейсу редактора.
zh_tw: 右上角可以找到切換編輯器語言的選單。

source: From the **Templates** tab you can download open source project templates and demos from the Asset Library to help you get started faster. Just select the template or demo you want, click download, once it's finished downloading click install and choose where you want the project to go. You can learn more about it in :ref:`doc_what_is_assetlib`.
cs: Pro rychlejší začátek si můžete na kartě **Šablony** stáhnout open-source šablony a dema z Knihovny zdrojů. Stačí vybrat požadovanou šablonu nebo ukázku, kliknout na stažení, po dokončení stahování, zvolte nainstalovat a vyberte, kam chcete projekt uložit. Více se můžete dozvědět v :ref:`doc_what_is_assetlib`.
de: Aus dem **Vorlagen**-Tab können Sie öffentliche Projektvorlagen und Demos herunterladen, die Ihnen einen schnelleren Einstieg ermöglichen. Wählen Sie dazu die herunterladbare Projektvorlage oder Demo aus, drücken auf Herunterladen, und, sobald es fertig ist, wählen Sie den Installationsort aus. Mehr hierzu erfahren Sie in :ref:`doc_what_is_assetlib`.
es: En la pestaña **Plantillas** podrás descargar plantillas de código abierto y demos de proyectos en la Biblioteca de Assets que te ayudarán a comenzar rápidamente. Solo selecciona la plantilla o demo que prefieras, haz clic en descargar, una vez haya finalizado de descargar, haz clic en instalar y elige dónde quieres que este el proyecto. Puedes aprender más al respecto en :ref:`doc_what_is_assetlib`.
fr: Depuis l'onglet **Modèles** vous pouvez télécharger des modèles de projet open source et des démos depuis l'Asset Library (librairie de ressources) pour vous aider à démarrer plus rapidement. Sélectionnez simplement le modèle ou la démo que vous voulez, cliquez sur télécharger, une fois le téléchargement terminé, cliquez sur installer et choisissez l'emplacement du projet. Vous pouvez en apprendre plus à ce sujet dans :ref:`doc_what_is_assetlib`.
it: Dalla scheda **Templates** puoi scaricare dei progetti open source e dei progetti dimostrativi per iniziare più in fretta. Semplicemente seleziona il template o la demo che vuoi, clicca download e quando ha finito di scaricare clicca installa e scegli dove vuoi salvare il progetto.
ja: **テンプレート** タブに表示されるアセットライブラリから、オープンソースのプロジェクトテンプレートとデモをダウンロードして、より迅速に作業を開始できます。目的のテンプレートまたはデモを選択し、[ダウンロード] をクリックするだけで、ダウンロードが完了したら [インストール] をクリックし、プロジェクトを配置する場所を選択します。詳細については、\ :ref:`doc_what_is_assetlib` を参照してください。
pl: Z zakładki **Szablony** możesz pobrać otwartoźródłowe szablony projektów i dema z Biblioteki Zasobów, by pomóc ci szybciej rozpocząć pracę. Wybierz po prostu szablon lub demo, które chcesz i kliknij pobierz. Kiedy pobieranie się skończy, kliknij instaluj i wybierz, gdzie chcesz, żeby projekt się znalazł. Możesz dowiedzieć się o tym więcej w :ref:`doc_what_is_assetlib`.
ru: Во вкладке **Templates** вы можете скачать шаблоны проектов с открытым исходным кодом и демо из библиотеки шаблонов, которые помогут вам начать работу быстрее. Просто выберите шаблон или демо, которое хотите, кликните "загрузить", после завершения скачивания нажмите кнопку "установить" и выберите место, куда вы хотите поместить проект. Вы можете узнать больше об этом в :ref:`doc_what_is_assetlib`.
uk: На вкладці **Шаблони** ви можете завантажити шаблони проєктів та демонстрації з відкритим кодом з бібліотеки активів, що допоможе вам швидше розпочати роботу. Просто виберіть потрібний шаблон, або демонстрацію, натисніть кнопку "Завантажити", після закінчення завантаження натисніть "Встановити" і виберіть, куди ви хочете встановити проєкт. Ви можете дізнатися більше про це у :ref:`doc_what_is_assetlib`.
zh_tw: **[樣板]** 標籤內可以從素材庫中下載開放原始碼專案樣板與範例專案，讓你能快速入門。只需要選擇想要的樣板或範例，點擊 [下載]，等待下載完成後再點擊 [安裝] 並選擇專案放置的位置。可以在 :ref:`doc_what_is_assetlib` 瞭解更多。

source: Create or import a project
cs: Vytvoření nebo import projektu
de: Erzeugen oder Importieren eines Projekts
es: Crear o importar un proyecto
fi: Luo tai tuo projekti
fr: Créer ou importer un projet
it: Creare o importare un progetto
ja: プロジェクトの作成もしくはプロジェクトのインポート
ko: 프로젝트를 만들거나 가져오기
pl: Utwórz lub zaimportuj projekt
pt_br: Criar ou importar um projeto
ru: Создание или импортирование проекта
uk: Створення або імпортування проєкту
zh_cn: 创建或导入项目
zh_tw: 建立或匯入專案

source: To create a new project, click the ``New Project`` button on the right. Here you give it a name, choose an empty folder on your computer to save it to, and choose a renderer.
cs: Chcete-li vytvořit nový projekt, klikněte vpravo na tlačítko `` Nový projekt``. Zde jej pojmenujete, vyberte prázdnou složku v počítači, do které jej chcete uložit, a vyberte vykreslovací modul (renderer).
de: Um ein neues Projekt zu erstellen, klicken Sie auf ``Neues Projekt`` auf der rechten Seite. Geben Sie dem Projekt einen Namen und wählen ein leeres Verzeichnis auf Ihrem Computer aus, um es dort anzulegen.
es: Para crear un nuevo proyecto, haz clic en el botón ``Nuevo proyecto`` a la derecha. Dale un nombre, elige una carpeta vacía en tu ordenador para guardarlo y elige un renderizador.
fr: Pour créer un nouveau projet, cliquez sur le bouton ``Nouveau projet`` sur la droite. Donnez-lui un nom, choisissez un répertoire vide sur votre ordinateur où le sauvegarder et sélectionnez un moteur de rendu.
it: Per creare un nuovo progetto, clicca il tasto ``Nuovo Progetto`` sulla destra. Dagli un nome, scegli una cartella vuota nel tuo computer per salvarlo e scegli il motore di rendering.
ja: 新しいプロジェクトを作成するには、右側の ``新規プロジェクト`` ボタンをクリックします。ここで名前を付け、保存先のコンピュータ上の空のフォルダを選択し、レンダラーを選択します。
pl: Aby utworzyć nowy projekt, kliknij przycisk ``Nowy projekt`` po prawej stronie. Nadaj mu nazwę, wybierz pusty folder na komputerze, aby go zapisać oraz wybierz renderer.
ru: Чтобы создать новый проект, нажмите кнопку ``New Project`` справа. Дайте ему имя, выберите пустую папку для сохранения на вашем компьютере и выберете программу исполнения.
uk: Щоб створити новий проєкт, натисніть кнопку ``Новий проєкт`` справа. Вкажіть назву проєкту і виберіть порожню теку на вашому комп'ютері для зберігання даних проєкту.
zh_tw: 要建立新的專案，請點擊右邊的 ``[新增專案]`` 按鈕。接著設定專案名稱、選擇電腦上的空白資料夾，然後選擇算繪器。

source: Click the Browse button to open Godot's file browser and pick a location or type the folder's path in the Project Path field.
cs: Klepnutím na tlačítko Procházet otevřete prohlížeč souborů Godota a vyberte umístění nebo zadejte cestu ke složce do pole Cesta k projektu.
de: Klicken Sie auf "Durchsuchen", um Godots Dateibrowser zu öffnen und wählen einen Ort oder tippen einen Pfad zum Zielverzeichnis im Projektpfadfeld ein.
es: Haz clic en el botón Examinar para abrir el explorador de archivos de Godot y selecciona una ubicación o escribe la ruta de la carpeta en el campo Ruta del proyecto.
fr: Cliquez sur le bouton Parcourir pour ouvrir le navigateur de fichiers de Godot, puis choisissez un emplacement ou tapez le chemin du répertoire dans le champ Chemin du projet.
it: Fai clic sul pulsante Sfoglia per aprire il browser dei file di Godot e scegli una posizione o digita il percorso della cartella nel campo Percorso del Progetto.
ja: BrowseボタンをクリックするとGodotのファイルブラウザが開かれ、場所を選択するかフォルダパスをプロジェクトパスに入力します。
pl: Kliknij przycisk Przeglądaj, aby otworzyć Godotową przeglądarkę plików i wybierz lokalizację lub wpisz ścieżkę do folderu w polu Ścieżka projektu.
ru: Нажмите кнопку Browse (Обзор), чтобы открыть файловый менеджер Godot и выбрать расположение папки или введите путь к ней в поле Project Path (Путь к проекту).
uk: Натисніть кнопку Browse (Огляд), щоб відкрити файловий менеджер Godot і вибрати розташування папки або введіть шлях до неї в поле Project Path (Шлях до проєкту).
zh_tw: 點擊 [瀏覽] 按鈕來打開 Godot 檔案瀏覽器，再選擇位置或是直接在 [專案位置] 一欄輸入資料夾路徑。

source: When you see the green tick on the right, it means the engine detects an empty folder. You can also click the ``Create Folder`` button next to your project name and an empty folder will be created with that name for the project.
cs: Když uvidíte zelenou fajku napravo, znamená to, že engine detekoval prázdnou složku. Můžete také kliknout na tlačítko ``Vytvořit složku`` vedle názvu projektu a vytvoří se prázdná složka s tímto názvem pro projekt.
de: Wenn Sie das grüne Häkchen rechts sehen, erkennt die Engine einen leeren Ordner. Sie können auch auf die Schaltfläche ``Ordner erstellen`` neben Ihrem Projektnamen klicken. Daraufhin wird ein leerer Ordner mit diesem Namen für das Projekt erstellt.
es: Cuando veas la marca verde a la derecha significa que el motor detecta una carpeta vacía. También puedes hacer clic en el botón ``Crear Carpeta`` junto al nombre del proyecto y se creará una carpeta vacía con dicho nombre automáticamente.
fr: Lorsque vous voyez la coche verte à droite, cela signifie que Godot a détecté un répertoire vide. Vous pouvez également cliquer sur le bouton ``Créer un Dossier`` à côté du nom de votre projet et un dossier vide portant le même nom sera créé.
it: Quando vedi la spunta verde sulla destra, significa che l'engine rileva una cartella vuota . Puoi anche cliccare il tasto "Crea" di fianco al nome del tuo progetto e una cartella vuota verrà creata con quel nome.
ja: 右側に緑色のチェックマークが表示されている場合は、エンジンが空のフォルダを検出します。プロジェクト名の横にある ``フォルダを作成`` ボタンをクリックすると、プロジェクトの名前で空のフォルダが作成されます。
pl: Kiedy zobaczysz zielony haczyk po prawej, oznacza to, że silnik wykrywa pusty folder. Możesz także kliknąć przycisk ``Utwórz katalog`` obok nazwy twojego projektu i zostanie utworzony pusty folder z nazwą projektu.
ru: В случае если вы видите зеленую галочку справа, это означает, что движок обнаружил пустую папку. Вы также можете нажать кнопку ``Create Folder`` (Создать папку) рядом с названием вашего проекта, тогда для проекта будет создана пустая папка с таким же именем.
uk: Якщо ви бачите зелену позначку праворуч, значить редактор виявив порожню теку. Ви також можете натиснути кнопку ``Створити теку`` поруч із назвою проєкту і тоді, для проєкту буде створена порожня тека з назвою проєкту.
zh_tw: 如果右邊出現綠色勾勾，就代表 Godot 偵測到資料夾是空的。也可以點擊專案名稱旁邊的 ``[建立資料夾]`` 按鈕，Godot 會根據專案名稱建立資料夾。

source: Finally, you need to choose which renderer to use (OpenGL ES 3.0 or OpenGL ES 2.0). The advantages and disadvantages of each are listed to help you choose, and you can refer to :ref:`doc_gles2_gles3_differences` for more details. Note that you can change the backend from the project settings if you change your mind later on. For this tutorial either backend is fine.
cs: Nakonec je třeba zvolit, který vykreslovací modul se má použít (OpenGL ES 3.0 nebo OpenGL ES 2.0). Pro usnadnění výběru jsou zde rovnou uvedeny výhody a nevýhody každého z nich .Více informací najdete na :ref:`doc_gles2_gles3_differences` . Pokud později změníte názor, můžete změnit backend z nastavení projektu. Pro tento tutoriál se nemůžete splést ani s jedním z nich.
de: Sie können auch das grafische Backend (OpenGL ES 3.0 oder OpenGL ES 2.0) festlegen. Die Vor- und Nachteile der beiden Optionen sind dort ebenfalls aufgelistet, eine detaillierte Liste finden Sie unter :ref:`doc_gles2_gles3_differences`. Sie können diese Einstellung später jederzeit ändern. Für diese Anleitung spielt diese Einstellung keine Rolle.
es: Finalmente, hay que elegir el motor de render que se quiere usar (OpenGL ES 3.0 u OpenGL ES 2.0). Las ventajas y desventajas de cada uno se enumeran para ayudarte a elegir y puedes consultar: `doc_gles2_gles3_differences` para obtener más detalles. Ten en cuenta que puedes cambiar el método desde la configuración del proyecto si cambias de opinión más adelante. Para este tutorial, cualquier método está bien.
fr: Enfin Vous devez choisir le système de rendu à utiliser (OpenGL ES 3.0 ou OpenGL ES 2.0). Les avantages et inconvénients de chacun sont listés pour vous aider à choisir, et vous pouvez consulter :ref:`doc_gles2_gles3_differences` pour plus de détails. Notez que vous pouvez changer de système de rendu dans les paramètres du projet si vous changez d'avis plus tard. Pour ce tutoriel vous pouvez choisir n'importe lequel des deux.
it: A questo punto puoi scegliere il backend per il rendering (OpenGL ES 3.0 or OpenGL ES 2.0). I vantaggi e gli svantaggi di ognuno sono elencati per aiutarti a scegliere, e puoi fare riferimento a :ref:`doc_gles2_gles3_differences` per ulteriori dettagli. Nota che puoi cambiare il backend dalle impostazioni del progetto se cambi idea più avanti. Per questo tutorial entrambi vanno bene.
ja: 最後に、使用するレンダラーを選択する必要があります(OpenGL ES 3.0またはOpenGL ES 2.0)。それぞれの長所と短所は、選択しやすいようにリストされています。詳細については、\ :ref:`doc_gles2_gles3_differences` を参照してください。後で気が変わった場合は、プロジェクト設定からバックエンドを変更できることを覚えておいてください。このチュートリアルでは、どちらのバックエンドでも問題ありません。
pl: Na samym końcu musisz wybrać, z którego renderera będziesz korzystać (OpenGL ES 3.0 czy OpenGL ES 2.0). By pomóc ci w wyborze zalety i wady każdego z nich są opisanie, możesz przejść do :ref:`doc_gles2_gles3_differences` po więcej szczegółów. Pamiętaj, że możesz zmienić backend w ustawieniach projektu, jeśli zmienisz zdanie w trakcie tworzenia projektu. Dla tego tutorialu każdy backend jest w porządku.
ru: Наконец, вам нужно выбрать какой отрисовщик использовать (OpenGL ES 3.0 или OpenGL ES 2.0). Преимущества и недостатки каждого перечислены ниже, чтобы облегчить вам выбор, вы можете обратиться к :ref:`doc_gles2_gles3_differences` за подробностями. Обратите внимание, что вы можете сменить движок в настройках проекта, если позже вы передумаете. Для этого урока подойдёт любой.
uk: Нарешті, вам потрібно вибрати, який обробник використовувати (OpenGL ES 3.0, чи OpenGL ES 2.0). Переваги та недоліки кожного з них перераховані нижче, щоб полегшити ваш вибір, і ви можете ознайомитися з :ref:`doc_gles2_gles3_differences` для отримання більш детальної інформації. Зауважте, що згодом ви можете змінити свій вибір в параметрах проєкту, якщо передумаєте. Для цього уроку чудово підійде будь-який вибір.
zh_tw: 最後，需要選擇要使用哪個算繪器（OpenGL ES 3.0 或 OpenGL ES 2.0）。我們列出了這兩種算繪器各自的優缺點來讓你自己選擇，也可以參考 :ref:`doc_gles2_gles3_differences` 瞭解更多詳細資訊。而就算之後改變心意了也可以從 [專案設定] 裡更改。本篇教學可適用於兩種算繪器。

source: Once you are done click ``Create & Edit``. Godot will create the project for you and open it in the editor.
cs: Po dokončení klikněte na ``Vytvořit a editovat``. Godot pro vás vytvoří projekt a otevře jej v editoru.
de: Wenn Sie fertig sind klicken Sie auf ``Create & Edit`` und Godot erstellt das Projekt für Sie und öffnet es im Editor.
es: Cuando hayas terminado haz clic en ``Crear y editar ``. Godot creará el proyecto y lo abrirá en el editor.
fr: Une fois terminé, cliquez sur ``Créer et ouvrir``. Godot créera le projet pour vous et l'ouvrira dans l'éditeur.
it: Una volta fatto premi su ``Crea & Modifica``. Godot creerà il progetto per te e lo aprirà nell'editor.
ja: 完了したら、\ ``作成して編集`` をクリックします。Godot によってプロジェクトが作成され、エディタで開きます。
pl: Kiedy skończysz kliknij ``Utwórz i edytuj`. Godot utworzy dla ciebie projekt i otworzy go w edytorze.
ru: Когда всё готово, нажмите ``Create & Edit`` (Создать и редактировать). Godot создаст для вас проект и откроет его в редакторе.
uk: Після завершення натисніть кнопку ``Створити та змінити``. Godot створить для вас проєкт і відкриє його в редакторі.
zh_tw: 好了之後點擊 ``建立並編輯``，Godot 會建立專案並在編輯器打開。
