Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/intro_to_the_editor_interface.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: You’ll use the **2D workspace** for all types of games. In addition to 2D games, the 2D workspace is where you'll build your interfaces. Press F1 to access it.
fi: Tulet käyttämään **2D-työtilaa** kaiken tyyppisille peleille. 2D-pelien lisäksi rakennat siinä myös pelisi käyttöliittymät. Paina F1 päästäksesi tilaan.
ko: 모든 종류의 게임을 만들려면 **2D 작업 공간(2D workspace)**\ 을 사용하게 될 겁니다. 2D 게임 외에도 인터페이스를 만들려고 말이죠. F1 키를 눌러 들어갑니다.
pt_br: Você usará o **Espaço de trabalho 2D** para todos os tipos de jogos. Além de jogos 2D, ele é onde você constrói suas interfaces. Pressione F1 para acessá-lo.
zh_cn: 您将对所有类型的游戏使用 **2D 工作区** 。除了2d 游戏外, 2D 工作区也是构建接口的地方。按 F1 访问它。

source: In the **3D workspace**, you can work with meshes, lights, and design levels for 3D games. Press F2 to access it.
fi: **3D-työtilassa** voit työskennellä meshien, valojen ja kenttäsuunnittelun parissa. Paina F2 mennäksesi siihen.
ko: **3D 작업 공간(3D workspace)**\ 에서는 3D 게임 용 메시와 조명, 레벨 설계를 할 수 있습니다. F2 키를 눌러 들어갑니다.
pt_br: No **Espaço de Trabalho 3D**, você pode trabalhar com malhas e luzes e projetar de níveis para jogos 3D. Pressione F2 para acessá-lo.
zh_cn: 在 **3D工作区** 里，您可以使用网格、光照并设计3D游戏关卡。按下F2切换。

source: Notice the text [perspective] under the toolbar, it is a button that opens a list of options related to the 3D viewport.
fi: Huomaa myös teksti [Perspektiivi] työpalkin alla; se on painike, joka avaa luettelon 3D-ikkunaan liittyviä vaihtoehtoja.
ko: 툴바 아래에 [원근보기] 텍스트를 보십시오, 이것은 3D 뷰포트와 관련된 설정 목록 버튼입니다.
pt_br: Repare o texto [perspectiva] abaixo da barra de ferramentas: é um botão que abre uma lista de opções relacionadas para a vista 3D.
zh_cn: 注意工具栏下面的[透视]，这是一个按钮，用于选择与3D视图有关的选项。

source: The **Script** workspace is a complete code editor with a debugger, rich auto-completion, and built-in code reference. Press F3 to access it, and F4 to search the reference.
fi: **Script** työtila on kokonainen koodieditori debuggerilla, monipuolisella automaattitäydennyksellä ja sisäänrakennetulla koodin lähdeaineistolla varustettuna. Paina F3 mennäksesi siihen, ja F4 hakeaksesi lähdeaineistosta.
ko: **Script** 작업 공간은 디버거, 많은 자동 완성 기능, 내장 코드 참조가 있는 완전한 코드 편집기입니다. F3 키로 들어가고, F4 키로 참조를 검색합니다.
pt_br: O espaço de trabalho **Script** é um editor de código completo, com um depurador, uma rica completação automática e referência de código embutida. Pressione F3 para acessá-lo e F4 para pesquisar na referência.
zh_cn: **脚本** 工作区是一个完整的代码编辑器，有着调试器、自动补全和内置的代码参阅。按下F3切换。

source: Finally the **AssetLib** is a library of Free add-ons, scripts and assets to use in your projects.
fi: Lopulta, **AssetLib** on kirjasto vapaita lisäosia, skriptejä ja assetteja, joita voit käyttää projekteissasi.
ko: 마지막으로 **AssetLib**\ 은 프로젝트에 쓸 무료 애드온, 스크립트 그리고 애셋이 있는 라이브러리입니다.
pt_br: Finalmente, o **AssetLib** é uma biblioteca de complementos, scripts e ativos gratuitos para usar nos seus projetos.
zh_cn: 最后， **资源馆** 有免费的插件、脚本、资源可以用到您的项目中。

source: Godot’s interface lives in a single window. You cannot split it across multiple screens although you can work with an external code editor like Atom or Visual Studio for instance.
fi: Godotin käyttöliittymä elelee yhdessä ikkunassa. Et voi jakaa sitä useille näytöille, vaikkakin voit työskennellä ulkoisen koodieditorin, kuten esimerkiksi Atomin tai Visual Studion, kanssa.
ko: Godot의 인터페이스는 하나의 창에 있습니다. 비록 여러 개의 창으로 나눌 수는 없지만, 대신 Atom이나 Visual Studio와 같은 외부 코드 편집기를 사용할 수 있습니다.
pt_br: A interface do Godot fica em uma única janela. Você não pode dividi-la para várias telas, embora possa trabalhar com um editor de código externo como Atom ou Visual Studio, por exemplo.
zh_cn: Godot界面存在于单一窗口中。您不能把它分离到多个屏幕中，不过您可以使用外置的代码编辑器如Atom或Visual Studio。

source: From the **Templates** tab you can download open source project templates and demos to help you get started faster.
zh_cn: 在 **模板** 选项卡里您可以下载开源的项目模板和示例来帮助您更快入门。
