Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/intro_to_the_editor_interface.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: To search for information about a class, method, property, constant, or signal in the engine while you are writing a script, press the "Search Help" button at the top right of the Script workspace.
cs: Chcete-li hledat informace o třídě, metodě, vlastnosti, konstantě nebo signálu v enginu během psaní skriptu, stiskněte tlačítko „Hledat Nápověda“ v pravém horním rohu pracovní plochy skriptu.
de: Um während des Schreibens eines Skripts in der Engine nach Informationen über eine Klasse, Methode, Eigenschaft, Konstante oder ein Signal zu suchen, drücken Sie die Schaltfläche "Hilfe durchsuchen" oben rechts im Skript-Arbeitsbereich.
es: Para buscar información sobre una clase, método, propiedad, constante o señal en el motor mientras escribes un script, pulsa el botón "Buscar ayuda" en la parte superior derecha del espacio de trabajo del Script.
fr: Pour rechercher des informations à propos d'une classe, d'une méthode, d'une propriété, d'une constante ou d'un signal dans le moteur pendant que vous écrivez un script, appuyez sur le bouton "Rechercher dans l'aide" en haut à droite de l'espace de travail Script.
it: Per cercare informazioni riguardanti una classe, metodo, proprietà, costante o segnale nell'engine mentre stai scrivendo uno script, premi il bottone "Cerca aiuto" in alto a destra nella Script workspace.
ja: スクリプトを書いている間にエンジン内のクラス、メソッド、プロパティ、定数、またはシグナルに関する情報を検索するには、スクリプト ワークスペースの右上にある「ヘルプを検索」ボタンを押します。
pl: By wyszukać informacje o klasie, metodzie, właściwości, stałej albo sygnale w silniku podczas pisana skryptu, wciśnij przycisk "Wyszukaj w pomocy" w prawym górnym rogu przestrzeni roboczej skryptu.
ru: Чтобы найти информацию о классе, методе, свойстве, константе или сигнале, когда вы пишете скрипт нажмите кнопку "Справка" в верхнем правом углу окна редактора скриптов.
uk: Для пошуку інформації про клас, метод, властивість, константу або сигнал у движку під час написання скрипту, використовуйте кнопку "Пошук довідки" у верхньому правому куті робочої області Script.
zh_tw: 撰寫腳本時若要在引擎內搜尋有關類別、方法、屬性、常數或訊號的資訊，請點擊腳本工作區右上角的 [搜尋說明] 按鈕。

source: A new window will pop up. Search for the item that you want to find information about.
cs: Objeví se nové okno. Vyhledejte položku, o které chcete najít informace.
de: Es öffnet sich ein neues Fenster. Suchen Sie nach dem Element, über den Sie Informationen finden möchten.
es: Aparecerá una nueva ventana . Busca el ítem sobre el que quieres encontrar información.
fr: Une nouvelle fenêtre s'ouvrira. Cherchez l'élément sur lequel vous souhaitez obtenir des informations.
it: Comparirà una nuova finestra. Cerca l'elemento di cui vuoi trovare informazioni a riguardo.
ja: 新しいウィンドウがポップアップします。情報を探したい項目を検索してください。
pl: Pojawi się nowe okno. Wyszukaj pozycję, o której chcesz znaleźć informacje.
ru: Появится новое окно. Введите название объекта, о котором хотите найти информацию.
uk: З'явиться нове вікно. В пошуковому вікні введіть назву елемента інформацію про який хочете знайти.
zh_tw: 接著會開啟新視窗，請搜尋想瞭解的項目。

source: Click on the item you are looking for and press open. The documentation for the item will be displayed in the script workspace.
cs: Klikněte na hledanou položku a stiskněte Otevřít. Dokumentace k položce se zobrazí v pracovní ploše skriptu.
de: Klicken Sie auf das gesuchte Element und drücken Sie auf Öffnen. Die Dokumentation zu dem Artikel wird im Skript-Arbeitsbereich angezeigt.
es: Haz clic en el ítem que está buscando y presione abrir. La documentación del ítem se mostrará en el espacio de trabajo del script.
fr: Cliquez sur l'élément que vous recherchez et appuyez sur ouvrir. La documentation relative à l'élément s'affichera dans l'espace de travail script.
it: Clicca sull'elemento che stavi cercando e clicca apri. La documentazione dell'elemento verrà mostrata nella Script workspace.
ja: 探している項目をクリックして[開く]を押します。項目のドキュメントがスクリプトワークスペースに表示されます。
pl: Kliknij pozycję, której szukasz i wciśnij otwórz. Dokumentacja dla tej pozycji pojawi się w obszarze roboczym skryptów.
ru: Нажмите на нужный элемент и нажмите кнопку "Открыть". Документация по этому элементу будет отображаться в рабочей области скрипта.
uk: Клацніть на потрібний елемент у списку та натисніть відкрити. Документація для елемента буде виведена в робочій області Скрипт.
zh_tw: 搜尋在尋找的項目並點擊 [開啟]。接著會在腳本工作區顯示相應的文件。

source: Finally, the **AssetLib** is a library of free and open source add-ons, scripts and assets to use in your projects.
cs: A konečně, **AssetLib** je knihovna bezplatných a otevřených doplňků, skriptů a zdrojů, které lze použít ve vašich projektech.
de: Abschließend die **AssetLib**: eine Bibliothek mit kostenlosen Add-ons, Skripten und Inhalten, die Sie in Ihren Projekten verwenden können.
es: Finalmente, **AssetLib** es la librería de add-ons, scripts y recursos gratuitos para utilizar en los proyectos.
fr: Enfin, **AssetLib** est une bibliothèque d'extensions, de scripts et d'assets gratuits à utiliser dans vos projets.
it: Infine, la **AssetLib** è una libreria di componenti aggiuntivi, script e risorse gratuiti e open source da utilizzare nei tuoi progetti.
ja: 最後に **AssetLib** はあなたのプロジェクトで使えるフリーのアドオン、スクリプトやアセットをそろえたライブラリです。
pl: Wreszcie, **Biblioteka zasobów** jest biblioteką darmowych i otwartoźródłowych dodatków, skryptów i zasobów, do wykorzystania w twoich projektach.
ru: Наконец, **AssetLib** - это библиотека бесплатных аддонов, скриптов и ассетов для использования в ваших проектах.
uk: Нарешті, **AssetLib** - це бібліотека безкоштовних додатків, скриптів та ресурсів, для використання у ваших проєктах.
zh_tw: 最後，**素材庫** 內提供自由開源的擴充套件、腳本與素材，可以在專案中使用。

source: Modify the interface
cs: Úprava rozhraní
de: Oberfläche anpassen
es: Modificando la interfaz
fi: Muokkaa käyttöliittymää
fr: Modifier l'interface
it: Modificare l'interfaccia
ja: インターフェースのカスタマイズ
ko: 인터페이스 수정
pl: Modyfikuj interfejs
pt_br: Modificar a interface
ru: Изменение интерфейса
uk: Зміна інтерфейсу
zh_cn: 调整界面
zh_tw: 調整界面

source: Godot's interface lives in a single window. You cannot split it across multiple screens although you can work with an external code editor like Atom or Visual Studio Code for instance.
cs: Godotovo rozhraní obývá jedno okno. Nelze jej rozdělit na více obrazovek, i když můžete pracovat s externím editorem kódu, jako je Atom nebo Visual Studio Code.
de: Godot nutzt ein einzelnes Programmfenster und kann somit nicht auf mehrere Bildschirme aufgeteilt werden. Es ist allerdings möglich einen externen Code–Editor, wie z.B. Atom oder Visual Studio Code zu benutzen.
es: La interfaz de Godot se encuentra en una ventana única. No puedes separarla en múltiples pantallas pero se puede trabajar con editor de código externo como por ejemplo Atom o Visual Studio.
fr: L'interface de Godot vit dans une seule fenêtre. Vous ne pouvez pas la diviser sur plusieurs écrans bien que vous puissiez travailler avec un éditeur de code externe comme Atom ou Visual Studio par exemple.
it: L'interfaccia di Godot risiede in un'unica finestra. Non è possibile dividerla in più schermate, anche se è possibile lavorare con un editor di codice esterno come per esempio Atom o Visual Studio.
ja: Godotのインターフェースは全て1つのウィンドウにあります。これを複数のウィンドウに分割することはできません。しかし、例えば Atom や Visual Studio Code のような外部コードエディタを使って作業することはできます。
pl: Interfejs Godota żyje w jednym oknie. Nie można go podzielić na kilka ekranów, chociaż można pracować z zewnętrznym edytorem kodu, takim jak na przykład Atom, Visual Studio.
ru: Весь интерфейс Godot располагается в одном окне. Вы не можете разделить его на несколько экранов, хотя вы можете работать с внешним редактором кода, такими, как, например Atom или Visual Studio Code.
uk: Інтерфейс Godot розміщений в одному вікні. Ви не можете розділити його на кілька екранів, хоча ви можете працювати із зовнішнім редактором коду, наприклад, Atom, або Visual Studio Code.
zh_tw: Godot 的界面都在單一視窗內，沒辦法拆分開來顯示在不同螢幕上。但可以使用如 Atom 或 Visual Studio Code 等外部編輯器。

source: Move and resize docks
cs: Přesunutí a velikost doků
de: Docks verschieben und skalieren
es: Mover y cambiar el tamaño de los paneles
fi: Telakoiden siirtäminen ja koon muuttaminen
fr: Déplacer et redimensionner les docks
it: Spostare e ridimensionare i pannelli
ja: ドックの移動とサイズ変更
ko: 독의 이동과 크기 조절
pl: Przesuwaj i zmieniaj wielkość panelów
pt_br: Mover e redimensionar painéis
ru: Перемещение и изменение размеров пенелей
uk: Переміщення і зміна розмірів панелей
zh_cn: 移动、修改面板大小
zh_tw: 移動與調整 Dock 大小

source: Click and drag on the edge of any dock or panel to resize it horizontally or vertically.
cs: Kliknutím a přetažením na okraji libovolného doku nebo panelu jej změníte vodorovně nebo svisle.
de: Klicken Sie und ziehen den Rand eines beliebigen Dockfensters oder Panels, um die Größe horizontal bzw. vertikal zu ändern.
es: Haz clic y arrastra el borde de cualquier panel para cambiar su tamaño horizontal o verticalmente.
fi: Napsauta ja vedä minkä tahansa telakan tai paneelin reunasta muuttaaksesi sen kokoa vaaka- tai pystysuunnassa.
fr: Cliquez sur le bord de n'importe quel dock ou panneau et faites le glisser pour le redimensionner horizontalement ou verticalement.
it: Fare clic e trascinare sul bordo di qualsiasi pannello per ridimensionarlo orizzontalmente o verticalmente.
ja: ドックやパネルの縁をクリックしてドラッグすると、水平および垂直方向にサイズ変更できます。
ko: 독이나 패널의 크기를 조절하려면 모서리를 클릭한 뒤 드래그하세요.
pl: Kliknij i przeciągnij krawędź panelu, aby zmienić ich rozmiar w poziomie lub w pionie.
pt_br: Clique e arraste na borda de qualquer painel para redimensioná-lo horizontal ou verticalmente.
ru: Нажмите на край любого дока или панели и потяните в сторону для изменения размера по горизонтали или вертикали.
uk: Для зміни розмірів будь-якої панелі, чи вкладки, натисніть на її край і потягніть по горизонталі, чи вертикалі.
zh_cn: 点击并拖动面板边缘可以修改水平或垂直大小。
zh_tw: 點擊並拖移任意 Dock 或面板的邊緣來水平或垂直地縮放大小。

source: Click the three-dotted icon at the top of any dock to change its location.
cs: Pro změnu umístění libovolného doku klikněte na ikonu se třemi tečkami v jeho horní části.
de: Klicken Sie auf das dreigepunktete Symbol am oberen Rand eines beliebigen Docks, um seine Position zu ändern.
es: Haz clic en el icono con tres puntos situado en la parte superior de cualquier panel para cambiar su ubicación.
fi: Napsauta minkä tahansa telakan ylälaidassa olevaa kolmipisteistä kuvaketta muuttaaksesi sen sijoittelua.
fr: Cliquez sur l'icône à trois points en haut de n'importe quel dock pour changer son emplacement.
it: Fare clic sull'icona con i tre punti nella parte superiore di qualsiasi dock per modificarne la posizione.
ja: ドックの上部にある３つの点のアイコンをクリックすると、位置を変更できます。
ko: 독의 위에 있는 점 세 개로 된 아이콘을 누르면 독의 위치를 바꿀 수 있습니다.
pl: Kliknij ikonę z trzema kropkami u góry panelu, aby zmienić jego lokalizację.
pt_br: Clique no ícone de três-pontos no topo de qualquer painel para alterar sua localização.
ru: Нажмите значок с тремя точками на верхней части любого дока, чтобы изменить его местоположение.
uk: Натисніть іконку трьох крапок в верхній частині любої панелі, щоб змінити її розташування.
zh_cn: 按下面板上方的三点标志可以改变位置。
zh_tw: 點擊任意 Dock 上方的三個點的按鈕來更改位置。

source: Go to the ``Editor`` menu and ``Editor Settings`` to fine-tune the look and feel of the editor.
cs: Přejděte do nabídky ``Editor`` a ``Nastavení editoru`` pro doladění vzhledu a přívětivosti editoru.
de: Klicken Sie im Menü auf ``Editor``, dann ``Editoreinstellungen``, um das Aussehen des Editors anzupassen.
es: En la opción ``Ajustes del editor`` dentro del menú `Editor` se puede ajustar el estilo visual del editor.
fi: Mene ``Editori`` valikkoon and valitse ``Editorin asetukset`` säätääksesi editorin ulkoasua.
fr: Allez dans le menu ``Éditeur`` et ``Paramètres de l'éditeur`` pour peaufiner l'apparence de l'éditeur.
it: Andare al menu ``Editor`` e ``Editor Settings`` per ottimizzare l'aspetto dell'editor.
ja: ``エディタ`` メニューの ``エディタ設定`` から、エディタの見た目を細かく調整できます。
ko: 보기 좋은 편집기를 만들고 싶다면 ``편집기(Editir)`` 메뉴의 ``편집기 설정(Editor Settings)``\ 으로 가세요.
pl: Przejdź do menu ``Edytor`` i ``Opcje Edytora``, aby dostroić wygląd edytora.
pt_br: Vá para o menu **Editor** > **Configurações do Editor** para um ajuste fine na aparência e comportamento.
ru: Перейдите в меню ``Editor`` (Редактор) и ``Editor Settings`` (Настройки редактора), чтобы настроить в соответствии со своими предпочтениями внешний вид и работу редактора.
uk: Перейдіть до меню ``Редактор`` і ``Параметри редактора`` щоб зручно налаштувати вигляд редактора.
zh_cn: 转到 ``编辑器`` 菜单和 ``编辑器设置`` 可以微调编辑器的外观。
zh_tw: 前往 ``[編輯器]`` 選單並選擇 ``[編輯器設定]`` 可微調編輯器的外觀。

source: You'll use the **2D workspace** for all types of games. In addition to 2D games, the 2D workspace is where you'll build your interfaces. Press :kbd:`Ctrl + F1` (or :kbd:`Alt + 1` on macOS) to access it.
es: Utilizarás el **Espacio de trabajo 2D** para todo tipo de juegos. Además de los juegos en 2D, es allí donde construirás tus interfaces. Presiona :kbd:`Ctrl + F1` (ó :kbd:`Alt + 1` en macOS) para acceder a este espacio.
fr: Vous utiliserez l'**espace de travail 2D** pour tous les types de jeux. En plus des jeux en 2D, c'est dans l'espace de travail 2D que vous construirez vos interfaces. Appuyez sur :kbd:`Ctrl + F1` (ou :kbd:`Alt + 1` sur macOS) pour y accéder.

source: In the **3D workspace**, you can work with meshes, lights, and design levels for 3D games. Press :kbd:`Ctrl + F2` (or :kbd:`Alt + 2` on macOS) to access it.
es: En el **Espacio de trabajo 3D**, se puede trabajar con mallas, luces y diseño de niveles para juegos 3D. Presione :kbd:`Ctrl + F2` (ó :kbd:`Alt + 2` en macOS) para acceder a este modo.
fr: Dans l'**espace de travail 3D**, vous pouvez travailler avec des maillages, des lumières et concevoir des niveaux pour les jeux en 3D. Appuyez sur :kbd:`Ctrl + F2` (ou :kbd:`Alt + 2` sur macOS) pour y accéder.

source: The **Script** workspace is a complete code editor with a debugger, rich auto-completion, and built-in code reference. Press :kbd:`Ctrl + F3` (or :kbd:`Alt + 3` on macOS) to access it, and :kbd:`F1` (or :kbd:`Alt + Space` on macOS) to search the reference.
es: El área de trabajo **Script** es un editor de código completo con depurador, autocompletado y referencias de código integradas. Pulsa :kbd:`Ctrl + F3` (o :kbd:`Alt + 3`en macOS) para acceder a él y :kbd:`F1` (o :kbd:`Alt+Space` en macOS) para buscar la referencia.
fr: L'espace de travail **Script** est un éditeur de code complet avec un débogueur, une riche auto-complétion et une référence de code intégrée. Appuyez sur :kbd:`Ctrl + F3` (ou :kbd:`Alt + 3` sur macOS) pour y accéder, et kbd:`F1` (ou :kbd:`Alt + Space` sur macOS) pour rechercher dans la référence.

source: Introduction to Godot’s editor
fi: Tutustuminen Godotin editoriin
ko: Godot 편집기 소개
pt_br: Introdução ao editor do Godot
zh_cn: Godot编辑器介绍

source: This tutorial will run you through Godot’s interface. We’re going to look at the **Project Manager, docks, workspaces** and everything you need to know to get started with the engine.
fi: Tämä opas kuljettaa sinut läpi Godotin käyttöliittymän. Läpikäytävänä ovat **Projektinhallinta, telakat ja työtilat** sekä kaikki mitä sinun tarvitsee tietää voidaksesi aloittaa pelimoottorin parissa.
ko: 이 튜토리얼에서는 Godot의 인터페이스에 대하여 알아봅니다. 먼저 **프로젝트 매니저, 독, 작업 공간**/을 알아보고, 그 후 엔진을 시작하려면 알아야 할 것들을 알아봅니다.
pt_br: Este tutorial vai lhe apresentar a interface do Godot. Vamos dar uma olhada no **Gerenciador de Projetos, painéis, workspaces** e tudo que você precisa conhecer para começar a usar a engine .
zh_cn: 这篇教程将带您过一遍Godot的界面。我们来看一下 **项目管理器、 各面板、 工作区** 以及开始使用引擎所需的一切。

source: When you launch Godot, the first window you’ll see is the Project Manager. It lets you create, remove, import or play game projects.
fi: Käynnistäessäsi Godotin, ensimmäinen ikkuna, jonka näet on Projektinhallinta. Se antaa sinun luoda, poistaa, tuoda tai pelata peliprojekteja.
ko: Godot를 실행해서 처음에 보이는 화면은 프로젝트 매니저입니다. 여기서 게임 프로젝트를 만들고, 삭제하고, 가져오거나 게임을 실행할 수 있습니다.
pt_br: Quando você executa o Godot, a primeira janela que vê é o Gerenciador de Projetos. Ele lhe permite criar, remover, importar e jogar projetos.
zh_cn: 当您启动Godot，看到的第一个窗口就是项目管理器。它可以让您创建、移除、导入或运行游戏项目。

source: In the top-right corner you’ll find a drop-down menu to change the editor’s language.
fi: Oikeasta yläkulmasta löydät alasvetovalikon editorissa käytettävän kielen vaihtamiseksi.
ko: 오른쪽 위에는 편집기의 언어를 바꿀 수 있는 드롭 다운 메뉴가 있습니다.
pt_br: No canto superior direito, você encontra um menu suspenso para alterar o idioma do editor.
zh_cn: 您可以在右上角找到下拉菜单切换编辑器语言。

source: From the **Templates** tab you can download open source project templates and demos to help you get started faster. Just select the template or demo you want, click download, once it's finished downloading click install and choose where you want the project to go.
ko: **템플릿(Templates)** 탭에서 빠르게 시작할 수 있는 오픈 소스 프로젝트 템플릿을 다운로드할 수 있습니다. 간단히 원하는 템플릿이나 데모를 선택하고 다운로드(Download)를 클릭하세요. 다운로드가 끝났으면 설치하기(Install)을 클릭하고 프로젝트를 설치할 위치를 정하세요.
pt_br: A partir da guia **Modelos**, você pode baixar modelos e demonstrações de projeto de código aberto para lhe ajudar a aprender mais rápido. Apenas selecione o modelo ou demo desejado, clique em baixar, uma vez que tenha terminado de baixar, clique em instalar e escolha onde você quer que o projeto fique.

source: To create a new project, click the ``New Project`` button on the right. Give it a name and choose an empty folder on your computer to save it.
fi: Luodaksesi projektin, napsauta oikealla sijaitsevaa ``Uusi projekti`` painiketta. Anna sille nimi ja valitse tietokoneeltasi tyhjä hakemisto, jonne se tallennetaan.
ko: 새 프로젝트를 만들려면, 오른쪽의 ``새 프로젝트(New Project)`` 버튼을 누르세요. 이름을 지어주고 컴퓨터의 빈 폴더를 선택하여 저장하세요.
pt_br: Para criar um novo projeto, clique no botão ``Novo Projeto`` à direita. Dê um nome e escolha uma pasta vazia do seu computador para salvá-lo.
zh_cn: 要创建新项目，点击右侧的 ``New Project`` 按钮。起一个名字然后选择一个空目录来保存它。

source: Click the Browse button to open Godot’s file browser and pick a location or type the folder’s path in the Project Path field.
fi: Napsauta Selaa-painiketta avataksesi Godotin tiedostoselaimen ja valitse sijainti, tai kirjoita kansion polku Projektin polku -kenttään.
ko: 찾아보기(Browse) 버튼을 눌러서 Godot 파일 브라우저를 열어서 위치를 지정하거나, 프로젝트 경로 영역에 폴더의 경로를 입력하세요.
pt_br: Clique no botão ``Navegar`` para abrir o navegador de arquivos e escolher um local, ou digite o caminho da pasta no campo Caminho do Projeto.
zh_cn: 点击浏览按钮，打开Godot文件浏览器并选择位置。或者直接在路径一栏输入目录路径。

source: When you see the green tick on the right, it means the engine detects an empty folder and you may click ``Create``. Godot will create the project for you and open it in the editor.
fi: Kun näet vihreän merkin oikealla, se tarkoittaa, että hakemisto on tunnistettu tyhjäksi ja voit napsauttaa ``Luo ja muokkaa``. Godot luo sinulle projektin ja avaa sen editoriin.
ko: 오른쪽에 초록불이 들어오면, 엔진이 빈 폴더를 감지했다는 것입니다. ``만들기(Create)`` 를 클릭하세요. Godot는 프로젝트를 만들고 편집기에서 이 프로젝트를 열 수 있습니다.
pt_br: Quando vir uma marca verde à direita, significa que o motor detectou uma pasta vazia, e você pode clicar em ``Criar``. O Godot vai criar o projeto para você e abri-lo no editor.
zh_cn: 当您看到右侧出现绿色对号，表明引擎检测到了这个空目录，点击 `创建` ，Godot会为您创建项目并打开编辑器。

source: The next time you’ll open Godot, you’ll see your new project in the list. Double click on it to open it in the editor.
fi: Seuraavan kerran kun avaat Godotin, näet uuden projektisi luettelossa. Kaksoisnapsauta sitä avataksesi sen editoriin.
ko: 다음 번에 Godot를 키게 된다면, 새 프로젝트가 목록에 있습니다. 더블 클릭으로 프로젝트를 열 수 있습니다.
pt_br: Na próxima vez que abrir o Godot, você verá seu novo projeto na lista. Um clique duplo nele fará abri-lo no editor.
zh_cn: 下次打开Godot时，就可以看到列表里有您的新项目了。双击它可以打开编辑器。

source: Your first look at Godot’s editor
fi: Ensimmäinen katsauksesi Godotin editoriin
ko: Godot 편집기와의 첫 만남
pt_br: Seu primeiro olhar no editor do Godot
zh_cn: 初识Godot编辑器

source: Welcome to Godot! With your project open, you should see the editor’s interface with the 3D viewport active. You can change the current workspace at the top of the interface. Click on 2D to switch to the 2D workspace.
fi: Tervetuloa Godotiin! Nyt kun projektisi on avoinna, sinun pitäisi nähdä editorin käyttöliittymä ja aktiivisena oleva 3D-ikkuna. Voit vaihtaa nykyistä työtilaa käyttöliittymän ylälaidasta. Napsauta 2D vaihtaaksesi 2D-työtilaan.
ko: Godot에 온 것을 환영합니다! 프로젝트를 열어 본다면 3D 뷰포트로 되어있는 편집기의 인터페이스를 보고 있겠군요. 인터페이스 상단에서 현재 작업 공간을 바꿀 수 있습니다. 2D를 클릭해서 2D 작업 공간으로 바꾸세요.
pt_br: Bem-vindo ao Godot! Com seu projeto aberto, você vai ver a interface do editor com a vista 3D ativa. Você pode alterar o espaço de trabalho atual no topo da interface. Clique no 2D para trocar para o espaço de trabalho 2D.
zh_cn: 欢迎来到Godot！随着您的项目打开，您应该能看到编辑器界面正处于3D视图状态。您可以在界面顶部切换当前工作区。点击2D切换到2D工作区。

source: Now you should see this interface, with empty docks on the right side.
fi: Nyt sinun pitäisi nähdä tällainen käyttöliittymä, ja oikeassa laidassa tyhjiä telakoita.
ko: 이제 인터페이스에는 오른편에 빈 독이 있는 것을 볼 수 있습니다.
pt_br: Agora você consegue ver esta interface, com os painéis vazios no lado direito.
zh_cn: 现在您应该能看到这个界面，在右侧有着空面板。

source: On the left side, you have the **FileSystem dock**, where you’ll manage your project files and assets.
fi: Vasemmassa laidassa on **Tiedostojärjestelmän telakka (FileSystem dock)**, jossa voit hallinnoida projektisi tiedostoja ja varoja.
ko: 왼편에는 **파일 시스템 독(FileSystem dock)**\ 이 있습니다. 여기서 프로젝트 파일이나 애셋을 관리할 수 있습니다.
pt_br: À esquerda, você tem o **Painel Arquivos**, por onde você gerencia seus arquivos e ativos do projeto.
zh_cn: 在左侧您可以看到 **文件系统面板** ，在这里您可以管理您的项目文件和资源。

source: On the right side, you’ll find the **Scene dock**, which lists the active scene’s content and the **Inspector** in the bottom right corner.
fi: Oikeasta laidasta löydät **Skene-telakan (Scene dock)**, joka listaa aktiivisen skenen sisällön, ja oikeasta alakulmasta **Tarkastelun (Inspector)**.
ko: 오른편에는 현재 씬의 내용을 나열해주는 **씬 독(Scene dock)**\ 이 있고 오른쪽 아래에는 **인스펙터(Inspector)**\ 가 있습니다.
pt_br: À direita, você encontra o **Painel de cenas**, que lista o conteúdo da cena ativa, e também o **Inspetor**, no canto inferior direito.
zh_cn: 在右侧您可以找到 **场景面板**，列出了场景的内容。还可以找到 **属性面板**，在右下方。

source: In the center, you have the **Toolbar** at the top, where you’ll find tools to move, scale or lock your scene’s objects. It changes as you jump to different workspaces.
fi: Keskellä ylhäällä käytössäsi on **Työkalupalkki (Toolbar)**, josta löydät työkaluja siirtämiseen, koon muuttamiseen ja skenesi objektien lukitsemiseen. Sen sisältö vaihtuu, kun hypit työtilasta toiseen.
ko: 가운데 바로 위에는 이동, 크기 조절, 씬 객체 잠금을 할 수 있는 **툴바(Toolbar)**\ 가 있습니다. 툴바는 작업 공간마다 달라집니다.
pt_br: No centro, você tem a **Barra de Ferramentas** no topo, onde você encontra as ferramentas para mover, redimensionar ou travar objetos da sua cena. A barra se altera conforme você alterna entre diferentes workspaces.
zh_cn: 中间上方有 **工具栏**，您可以用它移动、缩放或锁定您的场景物件。它会随着工作区的不同而切换。

source: The **Bottom Panel** is the host for the debug console, the animation editor, the audio mixer… They are wide and can take precious space. That’s why they’re folded by default.
fi: **Alapaneeli** on debuggauskonsolia, animaatioeditoria, audiomikseria, ym. varten. Ne ovat leveitä ja vievät arvokasta tilaa. Sen vuoksi ne ovat aluksi suljettuna.
ko: **하단 패널(Bottom Panel)**\ 은 디버그 콘솔이나 애니메이션 편집, 오디오 믹서 등이 있고... 그렇다 보니 많은 공간을 차지합니다. 때문에 기본적으로 닫혀 있는 상태입니다.
pt_br: O **Painel Inferior** é o anfitrião para o console de depuração, o editor de animação, o mixer de áudio… Eles são amplos e podem ocupar um espaço precioso. Esse é o motivo que eles ficam recolhidos por padrão.
zh_cn: **底部栏** 有调试台、动画编辑器、混响器…它们比较宽，会占用宝贵的空间。所以它们默认是折叠状态。
