Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/nodes_and_scenes.po
Languages: pt_br

source: Nodes and Scenes
pt_br: Nós e cenas

source: In :ref:`doc_key_concepts_overview`, we saw that a Godot game is a tree of scenes and that each scene is a tree of nodes. In this lesson, we explain a bit more about them. You will also create your first scene.
pt_br: No :ref:`doc_key_concepts_overview`, nós vimos que um jogo Godot é uma árvore de cenas e que cada cena é uma árvore de nós. Nessa aula, nós vamos explicar um pouco mais sobre eles. Você também vai criar sua primeira cena.

source: Nodes
pt_br: Nós

source: **Nodes are the fundamental building blocks of your game**. They are like the ingredients in a recipe. There are dozens of kinds that can display an image, play a sound, represent a camera, and much more.
pt_br: **Nós são um conceito fundamental do seu jogo**. Eles são como ingredientes numa receita. Tem um monte de nós que podem mostrar uma image, tocar um som, representar uma câmera, e muito mais.

source: All nodes have the following attributes:
pt_br: Todos os nós têm os seguintes atributos:

source: A name.
pt_br: Um nome.

source: Editable properties.
pt_br: Propriedades editáveis.

source: They receive callbacks to update every frame.
pt_br: Eles recebem retornos de chamada para atualizar cada quadro.

source: You can extend them with new properties and functions.
pt_br: Você pode estendê-los com novas propriedades e funções.

source: The last attribute is key. **Together, nodes form a tree**, which is a powerful feature to organize projects. Since different nodes have different functions, combining them produces more complex behavior. As we saw before, you can build a playable character the camera follows using a kinematic body node named "Character", a sprite node, a camera node, and a collision shape node.
pt_br: O último atributo é um ponto-chave. **Juntos, nós formam uma árvore**, que é um jeito poderoso de organizar seus projetos. Já que nós diferentes tem diferentes funcionalidades, combinando eles conseguimos comportamentos mais complexos. Como vimos anteriormente, você pode construir um personagem jogável que a câmera segue usando um KinematicBody chamado "Character", um nó de sprite, um nó de câmera, e um nó de forma de colisão.

source: Scenes
pt_br: Cenas

source: When you organize nodes in a tree, like our character, we call this construct a scene. Once saved, scenes work like new node types in the editor, where you can add them as a child of an existing node. In that case, the instance of the scene appears as a single node with its internals hidden.
pt_br: Quando você organiza nós numa árvore, como nosso personagem, nós chamamos isso de construir uma cena. Uma vez que salvo, cenas funcionam como nós no editor, como pode adicioná-las como filho de um nó existente. Nesse caso, a instância da cena aparece como um único nó com os nós internos escondidos.

source: Scenes allow you to structure your game's code however you want. You can **compose nodes** to create custom and complex node types, like a game character that runs and jumps, a life bar, a chest with which you can interact, and more.
pt_br: Cenas permitem que você estruture o código do seu jogo do jeito que quiser. Você pode **compor nós** para criar nós personalizados e complexos, como um personagem de um jogo que corre e pula, uma barra de vida, um baú que você interage, e mais.

source: The Godot editor essentially is a **scene editor**. It has plenty of tools for editing 2D and 3D scenes, as well as user interfaces. A Godot project can contain as many of these scenes as you need. The engine only requires one as your application's **main scene**. This is the scene Godot will first load when you or a player runs the game.
pt_br: Basicamente, o editor do Godot é um **editor de cena**. Ele tem um monte de ferramentas para edição de cenas 2D e 3D, assim como interfaces com usuário. Um projeto Godot pode conter tantas cenas quanto você precisar. O Motor apenas necessita de uma cena principal para sua aplicação. Esta será a cena que o Godot vai carregar primeiro quando você ou um jogador executar o jogo

source: On top of acting like nodes, scenes have the following attributes:
pt_br: Além de agirem como nós, cenas tem os seguintes atributos:

source: They always have one root node, like the "Character" in our example.
pt_br: Elas sempre tem um nó raiz, como o "Character" no nosso exemplo.

source: You can save them to your hard drive and load them later.
pt_br: Você pode salvá-las no seu disco e carregar elas depois.

source: You can create as many instances of a scene as you'd like. You could have five or ten characters in your game, created from your Character scene.
pt_br: Você pode criar quantas instâncias de uma cena quiser. Você pode ter cinco ou dez personagens no seu jogo, criados a partir da sua cena Personagem.

source: Creating your first scene
pt_br: Criando sua primeira Cena

source: Let's create our first scene with a single node. To do so, you will need to create a new project first. After opening the project, you should see an empty editor.
pt_br: Bora criar sua primeira cena com um único nó. Para isso, você precisa primeiro criar um novo projeto. Depois de abrir seu projeto, você deve ver um editor vazio.

source: We're going to add a single Label node to our scene. Its function is to draw text on the screen.
pt_br: Vamos adicionar um único nó de Label na nossa cena. Sua função é desenhar texto na tela.

source: Press the "Add Child Node" button or "Other Node" to create a root node.
pt_br: Clique no botão "Adicionar Nó Filho" ou "Outro Nó" para criar um nó raiz.

source: The Create Node dialog opens, showing the long list of available nodes.
pt_br: A caixa de diálogo Criar Nó é aberta, mostrando a longa lista de nós disponíveis.

source: Select the Label node. You can type its name to filter down the list.
pt_br: Selecione o nó Label. Você pode digitar seu nome para filtrar a lista.

source: Click on the Label node to select it and click the Create button at the bottom of the window.
pt_br: Clique no nó Label para selecioná-lo e clique no botão Criar na parte inferior da janela.

source: A lot happens when you add a scene's first node. The scene changes to the 2D workspace because Label is a 2D node type. The Label appears, selected, in the top-left corner of the viewport. The node appears in the Scene dock on the left, and the node's properties appear in the Inspector dock on the right.
pt_br: Muito coisa acontece quando você adiciona o primeiro nó da cena. A cena muda pra área de trabalho 2D porque Label é um nó do tipo 2D. A Label aparece, selecionada, no canto superior esquerda da tela (viewport). O nó aparece no Dock de Cenas à esquerda, e as propriedades do nó aparecem na Dock de Inspeção à direita.

source: The next step is to change the Label's "Text" property. Let's change it to "Hello World".
pt_br: O próximo passo é mudar a propriedade "Text" do Label. Vamos alterá-la para "Olá, mundo!".

source: Head to the Inspector dock on the right of the viewport. Click inside the field below the Text property and type "Hello World".
pt_br: Vá para a Dock de Inspeção à direita da viewport. Clique dentro do campo abaixo da propriedade de Texto e digite "Olá Mundo".

source: You will see the text draw in the viewport as you type.
pt_br: Você vai ver o texto aparecer na viewport enquanto você digita.

source: You can move your Label node in the viewport by selecting the move tool in the toolbar.
pt_br: Você pode mover seu nó Label na viewport selecionando a ferramenta de mover na barra de ferramentas (toolbar).

source: With the Label selected, click and drag anywhere in the viewport to move it to the center of the view delimited by the rectangle.
pt_br: Com a Label selecionada, clique e arraste para qualquer lugar na viewport para movê-la para o centro da janela delimitada pelo retângulo.

source: A popup invites you to save the scene, which is required to run it.
pt_br: Um popup vai te convidar a salvar a cena, que é necessário para rodá-la.

source: Click the Yes button, and in the file browser that appears, press the Save button to save it as "Label.tscn".
pt_br: Clique no Botão de Sim, e no gerenciador de arquivos que aparecer, pressione o botão de Salvar para salvá-la como "Label.tscn".

source: The Save Scene As dialog, like other file dialogs in the editor, only allows you to save files inside the project. The ``res://`` path at the top of the window represents the project's root directory and stands for "resource path". For more information about file paths in Godot, see :ref:`doc_filesystem`.
pt_br: O diálogo de Salvar Cena, como outros diálogos de arquivos no editor, só deixam você salvar arquivos dentro do projeto. O ``res://`` no topo da janela representa o diretório raiz do projeto e significa "Caminho dos Recursos". Para mais informações sobre o caminho dos arquivos no Godot, veja :ref:`doc_filesystem`.

source: The application should open in a new window and display the text "Hello World".
pt_br: A aplicação deve abrir uma nova janela e mostrar o texto "Olá Mundo".

source: Close the window or press :kbd:`F8` to quit the running scene.
pt_br: Feche a janela ou pressione :kbd:`F8`para fechar a cena que está rodando.

source: A popup window appears and invites you to select the main scene.
pt_br: Uma janela popup aparecerá, te convidando para selecionar a cena principal.

source: Click the Select button, and in the file dialog that appears, double click on Label.tscn.
pt_br: Clique o botão Selecionar, e no dialógo de arquivo que aparece, clique duas vezes em Label.tscn.

source: The demo should run again. Moving forward, every time you run the project, Godot will use this scene as a starting point.
pt_br: A demo deve rodar novamente. No futuro, toda vez que rodar seu projeto, Godot vai usar essa cena como um ponto de partida.

source: The editor saves the main scene's path in a project.godot file in your project's directory. While you can edit this text file directly to change project settings, you can also use the "Project -> Project Settings" window to do so.
pt_br: O editor salva o caminho para a cena principal no arquivo project.godot na pasta do seu projeto. Enquanto você pode editar esse arquivo de texto diretamente para mudar as configurações do project, você também pode usar a janela "Project->Configurações de Projeto" para fazer isso.

source: In the next part, we will discuss another key concept in games and in Godot: creating instances of a scene.
pt_br: Na próxima parte, discutiremos outro conceito chave em jogos e em Godot: criar instâncias de uma cena.

source: Translation status
pt_br: Estado da Tradução
