Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/resources.po
Languages: es, fr, ko, pl, zh_cn

source: Resources and Dictionaries are also different in that both are passed by reference, but only Resources are reference-counted. This means that if a Dictionary is passed between objects, and the first object is deleted, it will invalidate the second object's variable. This is not so for Resources which won't free their memory until *all* instances are gone.
fr: Les ressources et les dictionnaires sont également différents en ce que les deux sont passés par référence, mais seules les ressources sont comptées par références. Cela signifie que si un dictionnaire est passé entre des objets et que le premier objet est supprimé, la variable du second objet sera invalidée. Ce n'est pas le cas pour les ressources qui ne libéreront pas leur mémoire tant que *toutes* les instances n'auront pas disparu.
zh_cn: 资源和字典也是不同的, 因为两者都是通过引用传递的, 但只有资源是引用计数。这意味着, 如果在对象之间传递字典, 并且删除第一个对象, 它将使第二个对象变量无效。对于资源来说, 情况并非如此, 因为在所有实例消失之前, 资源不会释放他们的内存。

source: If the script's language supports `script classes <https://godot.readthedocs.io/en/latest/getting_started/step_by_step/scripting_continued.html#register-scripts-as-classes>`__, then it streamlines the process. Defining a name for your script alone will add it to the Inspector's creation dialog. This will auto-add your script to the Resource object you create.
zh_cn: 如果脚本语言支持脚本类, 则简化了过程。仅定义脚本的名称会将其添加到检查器创建对话框中。这将自动将脚本添加到您创建的资源对象中。

source: So far, :ref:`Nodes <class_Node>` have been the most important datatype in Godot as most of the behaviors and features of the engine are implemented through them. There is another datatype that is equally important: :ref:`Resource <class_Resource>`.
es: Hasta ahora, los :ref:`Nodos <class_Node>` han sido el tipo de datos más importante en Godot, ya que la mayoría de los comportamientos y características del motor se implementan a través de ellos. Hay otro tipo de datos que es igualmente importante :ref:`Recursos <class_Resource>`.

source: Where *Nodes* focus on behaviors, such as drawing a sprite, drawing a 3D model, physics, GUI controls, etc,
es: Donde los *Nodos* se enfocan en comportamientos como dibujar un sprite, dibujar un modelo 3D, física, controles GUI, etc,
pl: Gdy *Węzły* skupiają się na zachowaniach, takich jak rysowanie spritów, modeli 3D, fizyki, elementów sterujących GUI itp.,

source: **Resources** are mere **data containers**. This means that they don't do any action nor process any information. Resources just contain data.
es: Los **Recursos** son simples **contenedores de datos**. Esto significa que no realizan ninguna acción ni procesan ninguna información. Los recursos sólo contienen datos.
pl: **Zasoby** są jedynie **kontenerami danych**. Oznacza to, że nie wykonują one żadnych działań ani nie przetwarzają żadnych informacji. Zasoby po prostu zawierają dane.

source: Examples of resources are :ref:`Texture <class_Texture>`, :ref:`Script <class_Script>`, :ref:`Mesh <class_Mesh>`, :ref:`Animation <class_Animation>`, :ref:`AudioStream <class_AudioStream>`, :ref:`Font <class_Font>`, :ref:`Translation <class_Translation>`, etc.
es: Ejemplos de recursos son :ref:`Texture <class_Texture>`, :ref:`Script <class_Script>`, :ref:`Mesh <class_Mesh>`, :ref:`Animation <class_Animation>`, :ref:`AudioStream <class_AudioStream>`, :ref:`Font <class_Font>`, :ref:`Translation <class_Translation>`, etc.
pl: Przykładami zasobów są: :ref:`Texture <class_Texture>`, :ref:`Script <class_Script>`, :ref:`Mesh <class_Mesh>`, :ref:`Animation <class_Animation>`, :ref:`AudioStream <class_AudioStream>`, :ref:`Font <class_Font>`, :ref:`Translation <class_Translation>`, itp.

source: When Godot saves or loads (from disk) a scene (.tscn or .scn), an image (png, jpg), a script (.gd) or pretty much anything, that file is considered a resource.
es: Cuando Godot guarda o carga (desde el disco) una escena (.tscn o.scn), una imagen (png, jpg), un script (.gd) o casi cualquier cosa, ese archivo se considera un recurso.
pl: Kiedy Godot zapisuje lub ładuje (z dysku) scenę (.tscn lub .scn), obraz (png, jpg), skrypt (.gd) albo wiele innych rzeczy, to plik ten jest uważany za zasób.

source: When a resource is loaded from disk, **it is always loaded once**. That means, if there is a copy of that resource already loaded in memory, trying to load the resource again will return the same copy again and again. This corresponds with the fact that resources are just data containers, so there is no need to have them duplicated.
es: Cuando se carga un recurso desde el disco, **siempre se carga una vez**. Esto significa que, si hay una copia de ese recurso ya cargado en la memoria, intentar cargar el recurso de nuevo devolverá la misma copia una y otra vez. Esto se corresponde con el hecho de que los recursos son sólo contenedores de datos, por lo que no es necesario duplicarlos.
pl: W przypadku wczytania zasobu z dysku **jest on zawsze wczytywany raz**. Oznacza to, że jeśli kopia tego zasobu jest już wczytana do pamięci, próba wczytania zasobu ponownie zwróci tę samą kopię za każdym razem tą samą. Odpowiada to temu, że zasoby są tylko kontenerami na dane, więc nie ma potrzeby duplikowania ich.

source: Typically, every object in Godot (Node, Resource, or anything else) can export properties. Properties can be of many types (like a string, integer, Vector2, etc) and one of those types can be a resource. This means that both nodes and resources can contain resources as properties. To make it a little more visual:
es: Normalmente, cada objeto en Godot (Nodo, Recurso, o cualquier otra cosa) puede exportar propiedades, las propiedades pueden ser de muchos tipos (como un string, integer, Vector2, etc) y uno de esos tipos puede ser un recurso. Esto significa que tanto los nodos como los recursos pueden contener recursos como propiedades. Para hacerlo un poco más visual:
pl: Zazwyczaj każdy obiekt w Godocie (Węzeł, Zasób lub cokolwiek innego) może eksportować właściwości. Właściwości może być wiele typów (np. string, integer, Vector2 itd.), a jeden z tych typów może być nawet zasobem. Oznacza to, że zarówno węzły, jak i zasoby mogą zawierać inne zasoby jako właściwości. Aby uczynić to trochę bardziej zrozumiałym:

source: The resource properties can reference resources in two ways, *external* (on disk) or **built-in**.
es: Las propiedades del recurso pueden hacer referencia a los recursos de dos maneras, *externo* (en disco) o **integrado**.

source: Pressing the ">" button on the right side of the preview allows us to view and edit the resources properties. One of the properties (path) shows where it comes from. In this case, it comes from a png image.
es: Pulsando el botón ">" a la derecha de la vista previa podemos ver y editar las propiedades de los recursos. Una de las propiedades (path) muestra de dónde proviene. En este caso, proviene de una imagen png.
pl: Naciśnięcie przycisku ">" po prawej stronie podglądu umożliwia nam przeglądanie i edycję właściwości zasobów. Jedna z właściwości (path) pokazuje skąd pochodzi. W tym przypadku pochodzi on z obrazu png.

source: When the resource comes from a file, it is considered an *external* resource. If the path property is erased (or it never had a path to begin with), it is considered a built-in resource.
es: Cuando el recurso proviene de un archivo, se considera un recurso *externo*. Si la propiedad path es eliminada (o nunca tuvo una ruta de inicio), se considera un recurso integrado.
pl: Gdy zasób pochodzi z pliku, jest uważany za zasób *zewnętrzny*. Jeśli właściwość ścieżki zostanie skasowana (lub nigdy nie miała ustawionej ścieżki), jest ona traktowana jako wbudowany zasób.

source: For example, if the path \`"res://robi.png"\` is erased from the "path" property in the above example, and then the scene is saved, the resource will be saved inside the .tscn scene file, no longer referencing the external "robi.png". However, even if saved as built-in, and even though the scene can be instanced multiple times, the resource will always be loaded only once. That means, different Robi robot scenes instanced at the same time will still share the same image.
es: Por ejemplo, si la ruta \`"res://robi.png"\` es eliminada de la propiedad "path" en el ejemplo anterior, y la escena es grabada, el recurso se grabará dentro del archivo de escena .tscn, no referenciando más al "robi.png" externo. Sin embargo, aún guardada como built-in, aunque la escena sea instanciada muchas veces, el recurso será cargado sólo una vez. Esto significa que diferentes escenas del robot Robi pueden ser instanciadas al mismo tiempo y compartirán la imagen.
pl: Na przykład, jeśli ścieżka \`"res://robi.png"\` zostanie skasowana z właściwości "path" w powyższym przykładzie, a następnie scena zostanie zapisana, zasób zostanie zapisany jako wewnątrz pliku sceny .tscn, nie odwołując się już do zewnętrznego "robi.png". Jednak nawet jeśli scena zostanie zapisana jako wbudowana i mimo że można ją wielokrotnie instancjować, zasób zawsze zostanie załadowany tylko raz. Oznacza to, że różne sceny robotów Robi wyświetlane w tym samym czasie nadal będą miały ten sam obraz.

source: Loading resources from code is easy. There are two ways to do it. The first is to use load(), like this:
es: Cargar recursos desde código es simple. Hay dos modos de hacerlo, el primero es usar load(), de este modo:
pl: Ładowanie zasobów z kodu jest łatwe. Można to zrobić na dwa sposoby. Pierwszym z nich jest użycie load() w ten sposób:

source: The second way is more optimal, but only works with a string constant parameter because it loads the resource at compile-time.
es: La segunda forma es más óptima, pero sólo funciona con una cadena constante como parámetro, porque carga el recurso en tiempo de compilación.
pl: Drugi sposób jest bardziej optymalny, ale działa tylko ze stałym parametrem łańcucha znaków, ponieważ ładuje zasób w czasie kompilacji.

source: Scenes are also resources, but there is a catch. Scenes saved to disk are resources of type :ref:`PackedScene <class_PackedScene>`. This means that the scene is packed inside a resource.
es: Las escenas también son recursos, pero hay una trampa. Las escenas guardadas en el disco son recursos del tipo :ref:`PackedScene <class_PackedScene>`. Esto significa que la escena está empaquetada dentro de un recurso.
pl: Sceny są również zasobami, ale jest pewien haczyk. Sceny zapisane na dysku to zasoby typu :ref:`PackedScene <class_PackedScene>`. Oznacza to, że scena jest zapakowana wewnątrz zasobu.

source: To obtain an instance of the scene, the method :ref:`PackedScene.instance() <class_PackedScene_instance>` must be used.
es: Para obtener una instancia de la escena, se debe usar el método :ref:`PackedScene.instance() <class_PackedScene_instance>`.
pl: Aby uzyskać przykład sceny, należy użyć metody :ref:`PackedScene.instance() <class_PackedScene_instance>`.

source: This method creates the nodes in the scene's hierarchy, configures them (sets all the properties) and returns the root node of the scene, which can be added to any other node.
es: Este método crea nodos en la estructura de la escena, los configura (asigna las propiedades) y retorna el nodo raíz de la escena, el cual puede ser agregado a cualquier otro nodo.
pl: Metoda ta tworzy węzły w hierarchii sceny, konfiguruje je (ustawia wszystkie właściwości) i zwraca węzeł główny sceny, który można dodać do dowolnego innego węzła.

source: The approach has several advantages. As the :ref:`PackedScene.instance() <class_PackedScene_instance>` function is pretty fast, adding extra content to the scene can be done efficiently. New enemies, bullets, effects, etc can be added or removed quickly, without having to load them again from disk each time. It is important to remember that, as always, images, meshes, etc are all shared between the scene instances.
es: Este enfoque tiene muchas ventajas. Como la función :ref:`PackedScene.instance() <class_PackedScene_instance>` es bastante rápida, agregar contenido extra a la escena puede hacerse de manera eficiente. Nuevos enemigos, balas, efectos, etc. pueden ser agregados o eliminados rápidamente si tener que cargarlos nuevamente de disco cada vez. Es importante recordar que, como siempre, imágenes, mallas, etc. son compartidas entre las instancias de escena.
pl: Podejście to ma kilka zalet. Ponieważ funkcja :ref:`PackedScene.instance() <class_PackedScene_instance>` jest dość szybka, dodawanie dodatkowej zawartości do sceny może być wykonane wydajnie. Nowi wrogowie, kule, efekty, itp. mogą być szybko dodawane lub usuwane, bez konieczności ponownego ładowania ich za każdym razem z dysku. Należy pamiętać, że jak zawsze obrazy, siatki itp. są współdzielone pomiędzy instancjami sceny.

source: Resource extends from :ref:`Reference <class_Reference>`. As such, when a resource is no longer in use, it will automatically free itself. Since, in most cases, Resources are contained in Nodes, scripts or other resources, when a node is removed or freed, all the children resources are freed too.
es: El recurso se extiende desde :ref:`Referencia <class_Reference>`. Como tal, cuando un recurso ya no está en uso, se liberará automáticamente. Dado que, en la mayoría de los casos, los Recursos están contenidos en Nodos, scripts u otros recursos, cuando un nodo es eliminado o liberado, todos los recursos hijos también son liberados.
pl: Zasoby pochodzą z :ref:`Reference <class_Reference>`. W związku z tym, gdy zasób nie jest już używany, zwolni automatycznie się. Ponieważ w większości przypadków zasoby znajdują się w węzłach, skryptach lub innych zasobach, gdy węzeł jest usuwany lub uwalniany, wszystkie zasoby dzieci również są uwalniane.

source: Like any object in Godot, not just nodes, resources can be scripted, too. However, there isn't generally much of an advantage, as resources are just data containers.
es: Como cualquier objeto en Godot, no sólo nodos, Resources pueden contener scripts también. Sin embargo, no hay mucha ventaja ya que los recursos son sólo contenedores de datos.
pl: Jak każdy obiekt w Godocie, nie tylko węzły, również zasoby mogą być oskryptowane. Generalnie to nie daje zbyt dużo, ponieważ zasoby są tylko kontenerami na dane.

source: Scripting
pl: Skrypty
