Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/resources.po
Languages: es, fr, ko, pl, zh_cn

source: Resources
es: Recursos
fr: Ressources
ko: 리소스
pl: Zasoby
zh_cn: 资源

source: Nodes and resources
es: Nodos y recursos
fr: Nœuds et ressources
ko: 노드와 리소스
pl: Węzły i zasoby
zh_cn: 节点和资源

source: Up to this tutorial, we focused on the :ref:`Node <class_Node>` class in Godot as that's the one you use to code behavior and most of the engine's features rely on it. There is another datatype that is just as important: :ref:`Resource <class_Resource>`.
ko: 지금까지, :ref:`Node <class_Node>` 클래스는 Godot에서 가장 중요한 데이터 형식으로 엔진 내 대부분의 기능과 작동이 이것으로 이루어 졌다는 것에 초점을 두었습니다. 이와 똑같이 중요한 데이터 형식이 있습니다: :ref:`Resource <class_Resource>` 입니다.

source: *Nodes* give you functionality: they draw sprites, 3D models, simulate physics, arrange user interfaces, etc. **Resources** are **data containers**. They don't do anything on their own: instead, nodes use the data contained in resources.
ko: *노드*\ 는 다음과 같은 기능을 제공합니다: 스프라이트를 그려주고 3D 모델링을 해주며 물리 시뮬레이션을 해주고, 유저 인터페이스 정리 등을 해줍니다. **리소스**\ 는 **데이터 컨테이너**\ 입니다. 리소스 그 자체로는 아무 일도 하지 않습니다: 대신에 노드가 리소스에 포함되어 있는 데이터를 사용합니다.

source: When the engine loads a resource from disk, **it only loads it once**. If a copy of that resource is already in memory, trying to load the resource again will return the same copy every time. As resources only contain data, there is no need to duplicate them.
ko: 리소스가 디스크에서 불러올 때, **항상 한번만 불러옵니다**. 즉, 메모리에서 이미 불러온 리소스의 복사본이 있다면, 다시 리소스를 불러 오려고 해도 같은 복사본을 계속해서 반환될 것입니다. 리소스는 오직 데이터 컨테이너로 복사할 필요가 없습니다.

source: Every object, be it a Node or a Resource, can export properties. There are many types of Properties, like String, integer, Vector2, etc., and any of these types can become a resource. This means that both nodes and resources can contain resources as properties:
ko: 노드가 될 수 있는 모든 대상은 속성을 내보낼 수 있습니다. 속성은 문자열, 정수, Vector2, 등과 같은 많은 타입이 될 수 있고, 그 유형들 중 하나가 리소스가 될 수 있습니다. 이는 노드와 리소스가 모두 리소스를 속성으로 가질 수 있다는 것을 의미합니다:

source: External vs built-in
es: Externo vs built-in
fr: Externe vs intégré
ko: 외부(External) vs 내장(built-in)
pl: Zewnętrzne a wbudowane
zh_cn: 外部与内置

source: There are two ways to save resources. They can be:
ko: 리소스를 저장하는 두 가지 방법이 있습니다. 이렇게 될 수 있습니다:
zh_cn: 有两种方法可以保存资源。它们可以是：

source: **External** to a scene, saved on the disk as individual files.
fr: **Externe** à une scène, enregistrés sur le disque en tant que fichiers individuels.
ko: 씬의 **외부**에 개별 파일로 저장.
zh_cn: 场景的 **外部** , 作为单个文件保存在磁盘上。

source: To be more specific, here's a :ref:`Texture <class_Texture>` in a :ref:`Sprite <class_Sprite>` node:
es: Para ser más específico, aquí tenemos :ref:`Texture <class_Texture>` en un nodo :ref:`Sprite <class_Sprite>`:
fr: Pour être plus spécifique, voici une :ref:`Texture <class_Texture>` dans un nœud :ref:`Sprite <class_Sprite>` :
ko: 보다 구체적으로는, :ref:`Sprite <class_Sprite>` 노드의 :ref:`Texture <class_Texture>` 가 있습니다:
pl: Mówiąc dokładniej, mamy tu węzeł :ref:`Texture <class_Texture>` w węźle :ref:`Sprite <class_Sprite>`:
zh_cn: 更具体地说, 这里有一个:ref:`精灵 <class_Sprite>`节点中的:ref:`纹理 <class_Texture>`：

source: Clicking the resource preview allows us to view and edit the resource's properties.
ko: 리소스 미리보기를 클릭해서 리소스를 보고 속성을 편집합니다.

source: The path property tells us where the resource comes from. In this case, it comes from a PNG image called ``robi.png``. When the resource comes from a file like this, it is an external resource. If you erase the path or this path is empty, it becomes a built-in resource.
ko: 경로 속성은 리소스가 어디에서 오는 지를 알려줍니다. 이 경우에 리소스는 ``robi.png``\ 라 부르는 PNG 이미지에서 왔습니다. 리소스가 이와 같은 파일에서 올 때, 그것은 외부 리소스 입니다. 경로를 지우거나 경로가 비어있다면, 그것은 내장 리소스가 됩니다.

source: Even if you save a built-in resource, when you instance a scene multiple times, the engine will only load one copy of it.
fr: Même si vous enregistrez une ressource intégrée, lorsque vous créez une scène plusieurs fois, le moteur n'en charge qu'une copie.
ko: 씬을 여러 번 인스턴스 할 때, 내장 리소스를 저장하더라도 엔진은 오직 하나의 사본으로만 불러옵니다.
zh_cn: 即使你把某个资源保存成内置资源，当你用这个场景创建多个实例时，引擎只会将资源加载一次。

source: Loading resources from code
es: Cargando recursos desde código
fr: Chargement de ressources à partir du code
ko: 코드에서 리소스를 불러오기
pl: Ładowanie zasobów z kodu
zh_cn: 从代码中加载资源

source: There are two ways to load resources from code. First, you can use the ``load()`` function anytime:
fr: Il existe deux manières de charger des ressources depuis un code. Tout d’abord, vous pouvez utiliser la fonction ``load()`` à tout moment :
ko: 코드에서 리소스를 불러오는 두 가지 방법이 있습니다. 첫 번째로, 언제든지 ``load()`` 함수를 사용할 수 있습니다:
zh_cn: 你可以用两种方式在代码中加载资源。首先，您可以随时使用``load()``函数：

source: You can also ``preload`` resources. Unlike ``load``, this function will read the file from disk and load it at compile-time. As a result, you cannot call preload with a variable path: you need to use a constant string.
fr: Vous pouvez également ``preload`` (précharger) des ressources. Contrairement à ``load`` (charger), cette fonction lira le fichier à partir du disque et le chargera au moment de la compilation. Par conséquent, vous ne pouvez pas appeler le préchargement avec un chemin variable: vous devez utiliser une chaîne constante.
ko: 또한 리소스를 ``미리 불러올 수(preload)`` 있습니다. ``load`` 와는 다르게, 이 함수는 디스크에서 파일을 읽고 컴파일 시간에 파일을 불러옵니다. 그 결과, 변수 경로로 미리 불러오기를 호출할 수 없습니다: 상수 문자열을 사용해야 합니다.
zh_cn: 您也可以预加载资源。与``load``不同，``preload``会从硬盘中读取文件，并在编译的时候加载它。因此调用``preload``时你不能用变量当做文件路径，你只能用固定的字符串。

source: Loading scenes
es: Cargando escenas
fr: Chargement de scènes
ko: 씬 불러오기
pl: Ładowanie scen
zh_cn: 加载场景

source: Scenes are also resources, but there is a catch. Scenes saved to disk are resources of type :ref:`PackedScene <class_PackedScene>`. The scene is packed inside a resource.
ko: 씬 또한 리소스 입니다, 하지만 함정이 있습니다. 씬은 디스크에 :ref:`PackedScene <class_PackedScene>` 타입의 리소스로 저장됩니다. 씹은 리소스 안에 압축됩니다.
zh_cn: 场景也是资源, 但也有一个陷阱。保存到磁盘的场景是:ref:`打包场景 <class_PackedScene>`类型的资源。场景被打包在资源内部。

source: To get an instance of the scene, you have to use the :ref:`PackedScene.instance() <class_PackedScene_method_instance>` method.
ko: 씬의 인스턴스를 얻기 위해, :ref:`PackedScene.instance() <class_PackedScene_method_instance>` 메서드를 사용해야 합니다.

source: This method creates the nodes in the scene's hierarchy, configures them, and returns the root node of the scene. You can then add it as a child of any other node.
ko: 이 메서드는 씬의 계층 구조에 노드들을 만들고, 그들을 구성하고, 씬의 루트 노드로 반환합니다. 그런 뒤 이것을 다른 노드의 자식으로 추가할 수 있습니다.
zh_cn: 此方法在场景层次结构中创建节点, 对其进行配置, 并返回场景的根节点。然后, 您可以将其添加为任何其他节点的子节点。

source: The approach has several advantages. As the :ref:`PackedScene.instance() <class_PackedScene_method_instance>` function is fast, you can create new enemies, bullets, effects, etc. without having to load them again from disk each time. Remember that, as always, images, meshes, etc. are all shared between the scene instances.
ko: 이 접근은 여러 장점이 있습니다. :ref:`PackedScene.instance() <class_PackedScene_method_instance>` 함수가 꽤 빠르기 때문에, 씬에 새로운 적, 총알, 효과 등이 빠르게 추가되고 삭제될 수 있습니다, 각각을 디스크에서 불러올 필요가 없다는 것입니다. 항상 그래왔듯, 이미지, 메시 등은 모두 씬 인스턴스와 공유한다는 것을 명심하세요.

source: Freeing resources
es: Liberando recursos
fr: Libérer des ressources
ko: 리소스 해제(Free)하기
pl: Zwalnianie zasobów
zh_cn: 释放资源

source: When a ``Resource`` is no longer in use, it will automatically free itself. Since, in most cases, Resources are contained in Nodes, when you free a node, the engine frees all the resources it owns as well if no other node uses them.
ko: ``리소스``\ 가 더 이상 사용되지 않을 때, 그것은 자동으로 스스로를 해제(Free)합니다. 대부분의 경우, 리소스는 노드, 스크립트 혹은 다른 리소스에 포함되어 있기 때문에, 노드를 해제할 때, 엔진은 이 노드 외에 다른 노드가 더 이상 쓰지 않는 리소스도 해제합니다.
zh_cn: 当``资源``不再使用时, 它将自动释放自己。因为, 在大多数情况下, 资源包含在节点中, 当您释放节点时, 如果没有其他节点使用它所拥有的所有资源, 引擎也会释放它们。

source: Creating your own resources
ko: 자신의 리소스 만들기
zh_cn: 创建自己的资源

source: Like any Object in Godot, users can also script Resources. Resource scripts inherit the ability to freely translate between object properties and serialized text or binary data (/*.tres, /*.res). They also inherit the reference-counting memory management from the Reference type.
fr: Comme tout objet de Godot, les utilisateurs peuvent également scripter les ressources. Les scripts de ressources héritent de la possibilité de traduire librement entre les propriétés d'objet et le texte sérialisé ou les données binaires (/*.tres, /*.res). Ils héritent également de la gestion de la mémoire de comptage de références du type Référence.
ko: Godot에서 어느 객체와 마찬가지로, 사용자는 리소스를 작성할 수 있습니다. 리소스 스크립트는 객체 속성간의 자유로운 변환과 텍스트 또는 이진 데이터 (/*.tres, /*.res)를 직렬화하는 기능을 상속합니다. 그리고 참조 타입으로부터 참조 계산 메모리 관리를 상속합니다.
zh_cn: 与 godot 中的任何对象一样, 用户也可以编写参考资料脚本。资源脚本继承了在对象属性和序列化文本或二进制数据(/*.tres, /*.res)之间自由转换的能力。它们还继承引用类型的引用计数内存管理。

source: This comes with many distinct advantages over alternative data structures, such as JSON, CSV, or custom TXT files. Users can only import these assets as a :ref:`Dictionary <class_Dictionary>` (JSON) or as a :ref:`File <class_File>` to parse. What sets Resources apart is their inheritance of :ref:`Object <class_Object>`, :ref:`Reference <class_Reference>`, and :ref:`Resource <class_Resource>` features:
ko: JSON, CSV, 혹은 커스텀 TXT 파일로 이루어진 이것은 대체 데이터 구조를 넘어서 많은 뚜렷한 이점을 제공합니다. 사용자는 이 애셋을 문법 분석하기 위해 :ref:`Dictionary <class_Dictionary>` (JSON) 혹은 :ref:`File <class_File>`\ 로만 가져올 수 있습니다. 리소스는 :ref:`Object <class_Object>`, :ref:`Reference <class_Reference>`, 그리고 :ref:`Resource <class_Resource>` 기능의 상속을 통해 구분합니다:

source: They can define constants, so constants from other data fields or objects are not needed.
fr: Ils peuvent définir des constantes. Ainsi, les constantes d'autres champs de données ou d'objets ne sont pas nécessaires.
ko: 그들은 상수를 정의할 수 있기 때문에, 다른 데이터 필드나 객체의 상수는 필요하지 않습니다.
zh_cn: 它们可以定义常量, 因此不需要其他数据字段或对象中的常量。

source: They can define methods, including setter/getter methods for properties. This allows for abstraction and encapsulation of the underlying data. If the Resource script's structure needs to change, the game using the Resource need not also change.
fr: Ils peuvent définir des méthodes, y compris des méthodes setter/getter pour les propriétés. Cela permet l’abstraction et l’encapsulation des données sous-jacentes. Si la structure du script de ressource doit être modifiée, le jeu utilisant la ressource ne nécessite pas de changement aussi.
ko: 그들은 속성을 위한 setter/getter 메서드를 포함한 메서드를 정의할 수 있습니다. 이것으로 기본 데이터의 추출과 캡슐화를 할 수 있습니다. 리소스 스크립트의 구조가 변경되어야 하더라도, 리소스를 사용하는 게임이 변경되지 않아도 됩니다.
zh_cn: 它们可以定义方法, 包括属性的 setter getter 方法。这允许对基础数据进行抽象和封装。如果资源脚本结构需要更改, 则使用 "资源" 的游戏也不需要更改。

source: They can define signals, so Resources can trigger responses to changes in the data they manage.
fr: Ils peuvent définir des signaux afin que les ressources puissent déclencher des réactions aux modifications des données qu’elles gèrent.
ko: 그들은 시그널을 정의할 수 있기 때문에, 리소스는 관리한 데이터의 변경에 대한 응답을 트리거 할 수 있습니다.
zh_cn: 它们可以定义信号, 因此资源可以触发对其管理的数据更改的响应。

source: They have defined properties, so users know 100% that their data will exist.
fr: Ils ont des propriétés définies, de sorte que les utilisateurs savent à 100% que leurs données existeront.
ko: 그들은 속성을 정의하기 때문에, 사용자는 데이터가 존재한다는 것을 100% 압니다.
zh_cn: 他们定义了属性，所以用户100%知道他们的数据将存在。

source: Resource auto-serialization and deserialization is a built-in Godot Engine feature. Users do not need to implement custom logic to import/export a resource file's data.
fr: L’auto-sérialisation et la dé-sérialisation des ressources est une fonctionnalité intégrée du moteur Godot. Les utilisateurs n'ont pas besoin d'implémenter une logique personnalisée pour importer/exporter les données d'un fichier de ressources.
ko: 리소스 자동 직렬화와 비 직렬화는 Godot 엔진 내장 기능입니다. 사용자는 리소스 파일의 데이터를 가져오기/내보내기 위해 커스텀 로직을 구현할 필요가 없습니다.
zh_cn: 资源自动序列化和反序列化是一个内置的 godot 引擎功能。用户不需要实现自定义逻辑来导入/导出资源文件数据。

source: Resources can even serialize sub-Resources recursively, meaning users can design even more sophisticated data structures.
fr: Les ressources peuvent même sérialiser les sous-ressources de manière récursive, ce qui signifie que les utilisateurs peuvent concevoir des structures de données encore plus sophistiquées.
ko: 리소스는 심지어 하위 리소스를 재귀적으로 직렬화 할 수 있습니다, 즉 사용자는 훨씬 더 정교한 데이터 구조를 설계할 수 있습니다.
zh_cn: 资源甚至可以递归序列化子资源, 这意味着用户可以设计更复杂的数据结构。

source: Users can save Resources as version-control-friendly text files (\*.tres). Upon exporting a game, Godot serializes resource files as binary files (\*.res) for increased speed and compression.
fr: Les utilisateurs peuvent enregistrer des ressources sous forme de fichiers textes de contrôle de version conviviaux (\*.tres). Lors de l'exportation d'un jeu, Godot sérialise les fichiers de ressources sous forme de fichiers binaires (\*.res) pour une vitesse et une compression accrues.
ko: 사용자는 리소스를 버전 제어 친화적 텍스트 파일 (\*.tres)로 저장할 수 있습니다. 게임을 내보낼 때, Godot는 리소스 파일을 이진 파일 (\*.res)로 직렬화 하여 속도와 압축을 증가시킵니다.
zh_cn: 用户可以将资源另存为版本控制友好的文本文件(\*.tres)。导出游戏后, godot 将资源文件序列化为二进制文件(\*.res), 以提高速度和压缩。

source: Godot Engine's Inspector renders and edits Resource files out-of-the-box. As such, users often do not need to implement custom logic to visualize or edit their data. To do so, double-click the resource file in the FileSystem dock or click the folder icon in the Inspector and open the file in the dialog.
fr: L'inspecteur de Godot Engine rend et édite les fichiers de ressources immédiatement. En tant que tels, les utilisateurs n'ont souvent pas besoin de mettre en œuvre une logique personnalisée pour visualiser ou éditer leurs données. Pour ce faire, double-cliquez sur le fichier de ressources dans le dock Système de Fichiers ou cliquez sur l'icône de dossier dans l'inspecteur et ouvrez le fichier dans la boîte de dialogue.
ko: Godot 엔진의 인스펙터(Inspecter)는 리소스 파일을 즉시 렌더링하고 편집합니다. 이와 같이, 사용자는 종종 데이터를 시각화 하거나 편집하기 위한 커스텀 로직을 구현할 필요가 없습니다. 그러기 위해서, 파일 시스템 독에서 리소스를 더블 클릭하거나 인스펙터(Inspecter)에서 폴더 아이콘을 클릭하고 대화 상자에서 파일을 엽니다.
zh_cn: godot 引擎检查器用开箱即用的方式呈现和编辑资源文件。因此, 用户通常不需要实现自定义逻辑来可视化或编辑其数据。为此, 请双击文件系统停靠中的资源文件, 或单击检查器中的文件夹图标, 然后在对话框中打开该文件。

source: They can extend **other** resource types besides just the base Resource.
fr: Ils peuvent étendre **d'autres** types de ressources, outre la ressource de base.
ko: 그들은 기본 리소스 외에도 **다른** 리소스 타입도 확장할 수 있습니다.
zh_cn: 除了基本资源之外, 它们还可以扩展**其他**资源类型。

source: Godot makes it easy to create custom Resources in the Inspector.
fr: Godot facilite la création de ressources personnalisées dans l'inspecteur.
ko: Godot는 인스펙터(Inspecter)에서 커스텀 리소스를 만들기 쉽게 합니다.
zh_cn: godot 使在检查器中创建自定义资源变得很容易。

source: Create a plain Resource object in the Inspector. This can even be a type that derives Resource, so long as your script is extending that type.
ko: 인스펙터(Inspecter)에서 순수한 리소스를 만듭니다. 스크립트가 해당 타입을 확장하는 동안, 이것은 심지어 리소스를 파생하는 타입일 수 있습니다.
zh_cn: 在检查器中创建一个普通的资源对象。这甚至可以是派生资源的类型, 只要您的脚本扩展该类型。

source: Set the ``script`` property in the Inspector to be your script.
fr: Définissez la propriété ``script`` dans l'inspecteur comme étant votre script.
ko: 인스펙터(Inspecter)에서 ``script`` 속성을 당신의 스크립트로 설정합니다.
zh_cn: 将检查器中的脚本属性设置为``script``。

source: The Inspector will now display your Resource script's custom properties. If one edits those values and saves the resource, the Inspector serializes the custom properties too! To save a resource from the Inspector, click the Inspector's tools menu (top right), and select "Save" or "Save As...".
fr: L'inspecteur affiche désormais les propriétés personnalisées de votre script de ressources. Si on modifie ces valeurs et enregistre la ressource, l'inspecteur sérialise également les propriétés personnalisées ! Pour enregistrer une ressource de l'inspecteur, cliquez sur le menu Outils de l'inspecteur (en haut à droite), puis sélectionnez "Enregistrer" ou "Enregistrer sous ...".
ko: 인스펙터(Inspecter)는 이제 리소스 스크립트의 커스텀 속성을 보여줍니다. 이 값을 편집하고 리소스를 저장하면, 인스펙터(Inspecter)는 커스텀 속성 역시 직렬화 합니다! 인스펙터(Inspecter)에서 리소스를 저장하기 위해, 인스펙터(Inspecter)의 도구 메뉴 (우측 상단)를 클릭하고, "저장하기"나 "다른 이름으로 저장..."을 선택합니다.
zh_cn: 检查器现在将显示您的资源脚本自定义属性。如果编辑了这些值并保存了资源, 检查器也会序列化自定义属性若要从检查器中保存资源, 请单击 "检查器工具" 菜单 (右上角), 然后选择 "保存" 或 "另存为..."。

source: If the script's language supports :ref:`script classes <doc_scripting_continued_class_name>`, then it streamlines the process. Defining a name for your script alone will add it to the Inspector's creation dialog. This will auto-add your script to the Resource object you create.
ko: 스크립트의 언어가 :ref:`스크립트 클래스 <doc_scripting_continued_class_name>`\를 지원한다면, 프로세스가 간소화됩니다. 스크립트에 이름만 정의하는 것으로 인스펙터(Inspecter)의 생성 대화 상자에 리소스를 추가할 것입니다. 이렇게 하면 생성된 리소스 객체에 스크립트가 자동으로 추가됩니다.

source: Let's see some examples.
ko: 몇 가지 예를 살펴보겠습니다.
zh_cn: 让我们看看一些例子。

source: Resource scripts are similar to Unity's ScriptableObjects. The Inspector provides built-in support for custom resources. If desired though, users can even design their own Control-based tool scripts and combine them with an :ref:`EditorPlugin <class_EditorPlugin>` to create custom visualizations and editors for their data.
fr: Les scripts de ressources sont similaires à ScriptableObjects de Unity. L'Inspecteur fournit un support intégré pour les ressources personnalisées. Si nécessaire, les utilisateurs peuvent même concevoir leurs propres scripts d’outils basés sur Contrôle, et les combiner avec un :ref:`EditorPlugin <class_EditorPlugin>` pour créer des visualisations et des éditeurs personnalisés pour leurs données.
ko: 리소스 스크립트는 Unity의 ScriptableObjects(스크립트 가능한 객체)와 유사합니다. 인스펙터(Inspecter)는 커스텀 리소스를 위한 내장 지원을 제공합니다. 그래도 원한다면, 사용자는 자신만의 제어 기반 도구 스크립트를 설계하고 그들을 :ref:`EditorPlugin <class_EditorPlugin>`\ 으로 결합하여 커스텀 시각화와 데이터를 위한 편집기를 만들 수 있습니다.
zh_cn: 资源脚本类似于Unity的脚本对象。检查器提供对自定义资源的内置支持。如果需要, 用户甚至可以设计自己的基于控件的工具脚本, 并将它们与:ref:`EditorPlugin <class_EditorPlugin>`结合起来, 为其数据创建自定义可视化和编辑器。

source: Unreal Engine 4's DataTables and CurveTables are also easy to recreate with Resource scripts. DataTables are a String mapped to a custom struct, similar to a Dictionary mapping a String to a secondary custom Resource script.
fr: Les DataTables et CurveTables de Unreal Engine 4 sont également faciles à recréer à l'aide de scripts de Resources. Les DataTables sont une chaîne mappée à une structure personnalisée, similaire à un dictionnaire mappant une chaîne à un script de ressource personnalisé secondaire.
ko: 언리얼 엔진 4의 DataTables와 CurveTables 또한 리소스 스크립트로 쉽게 재생성 할 수 있습니다. DataTables은 커스텀 구조체에 매핑된 문자열로, 이차적인 커스텀 리소스 스크립트에 문자열을 매핑하는 딕셔너리와 유사합니다.
zh_cn: 虚幻4引擎的数据表和 CurveTables 也很容易使用资源脚本重新创建。数据表是映射到自定义结构的字符串, 类似于将字符串映射到辅助自定义资源脚本的字典。

source: Instead of just inlining the Dictionary values, one could also, alternatively...
fr: Au lieu de simplement aligner les valeurs du dictionnaire, on pourrait aussi, alternativement ...
ko: 딕셔너리 값을 inlining(인라이닝)하는 대신, 또 다른 할 수 있는 대안으로...
zh_cn: 而不是只是内联字典值, 你也可以, 或者..。

source: Import a table of values from a spreadsheet and generate these key-value pairs, or...
fr: Importer une table de valeurs à partir d'une feuille de calcul et générer ces paires clé-valeur, ou ...
ko: 스프레드 시트에서 테이블 값을 가져오고 키 값 쌍을 생성합니다, 혹은...
zh_cn: 从电子表格导入值的表, 并生成这些键值对, 或..。

source: Design a visualization within the editor and create a simple plugin that adds it to the Inspector when you open these types of Resources.
fr: Concevez une visualisation dans l'éditeur et créez un plug-in simple qui l'ajoutera à l'inspecteur lorsque vous ouvrirez ces types de ressources.
ko: 편집기 내에서 시각화를 설계하고 해당 타입 리소스를 열 때 인스펙터(Inspecter)에 리소스를 추가하는 간단한 플러그인을 제작합니다.
zh_cn: 在编辑器中设计可视化, 并创建一个简单的插件, 当您打开这些类型的资源时, 将其添加到检查器中。

source: CurveTables are the same thing, except mapped to an Array of float values or a :ref:`Curve <class_Curve>`/:ref:`Curve2D <class_Curve2D>` resource object.
ko: 두 가지 방법이 항상 호환되는 것은 아닙니다. 컨테이너는 자식을 제어하기 때문에, 레이아웃 메뉴를 그것들에게 사용할 수 없습니다. 각 컨테이너는 특정한 효과를 갖고 있으므로 당신은 제대로 동작하는 인터페이스를 얻기 위해 그들을 중첩(nest)할지도 모릅니다. 레이아웃 접근을 사용하는 경우 자식들을 아래계층에서 위계층 방향으로 작업합니다. 씬에 추가적이 컨테이너를 사용하지 않으므로 더 깨끗한 계층 구조를 만들 수 있지만, 항목을 행이나 열, 격자 등으로 배열하기는 더 어렵습니다.

source: Beware that resource files (\*.tres/\*.res) will store the path of the script they use in the file. When loaded, they will fetch and load this script as an extension of their type. This means that trying to assign a subclass, i.e. an inner class of a script (such as using the ``class`` keyword in GDScript) won't work. Godot will not serialize the custom properties on the script subclass properly.
fr: Attention, les fichiers de ressources (\*.tres/\*.res) vont stocker le chemin du script qu'ils utilisent dans le fichier. Une fois chargés, ils vont chercher et charger ce script comme une extension de leur type. Cela signifie que tenter d’affecter une sous-classe, c’est-à-dire une classe interne à un script (comme l’utilisation du mot clé ``class`` dans GDScript) ne fonctionnera pas. Godot ne sérialisera pas correctement les propriétés personnalisées sur la sous-classe de script.
ko: 리소스 파일 (\*.tres/\*.res)이 파일에서 사용하는 스크립트의 경로를 저장한다는 점에 주의하세요. 스크립트를 불러올 때, 이 스크립트를 가져와서 해당 타입의 확장으로 불러옵니다. 다시 말해 하위 클래스, 즉 스크립트의 내부 클래스 (GDScript에서 ``class`` 키워드를 사용하는 것)를 할당할 수 없습니다. Godot는 스크립트 하위 클래스에 커스텀 속성을 정확하게 직렬화 하지 않을 것입니다.
zh_cn: 请注意, 资源文件(\*.tres/\*.res)将存储在文件中的脚本的路径。加载时, 它们将提取并加载此脚本作为其类型的扩展。这意味着尝试分配一个子类, 即脚本的内部类 (例如在 gdscript 中使用``类``关键字) 是不起作用的。godot 不会正确序列化脚本子类上的自定义属性。

source: In the example below, Godot would load the ``Node`` script, see that it doesn't extend ``Resource``, and then determine that the script failed to load for the Resource object since the types are incompatible.
fr: Dans l'exemple ci-dessous, Godot chargerait le script ``Nœud``, verrait qu'il n'étend pas ``Ressource``, puis déterminerait que le script n'a pas pu être chargé pour l'objet Ressource car les types sont incompatibles.
ko: 아래 예시에서, Godot는 ``Node`` 스크립트를 불러오고, ``Resource``\ 를 확장(extend)하지 않음을 확인합니다, 그런 다음 타입이 맞지 않으면 스크립트가 리소스 객체에 대해 불러오지 못했음을 확인합니다.
zh_cn: 在下面的示例中, godot 将加载``节点``脚本, 查看它不会扩展``资源``, 然后确定该脚本未能为资源对象加载, 因为这些类型不兼容。

source: Anything Godot saves or loads from disk is a resource. Be it a scene (a .tscn or an .scn file), an image, a script... Here are some ``Resource`` examples: :ref:`Texture <class_Texture>`, :ref:`Script <class_Script>`, :ref:`Mesh <class_Mesh>`, :ref:`Animation <class_Animation>`, :ref:`AudioStream <class_AudioStream>`, :ref:`Font <class_Font>`, :ref:`Translation <class_Translation>`.
zh_cn: Godot从磁盘保存或加载的任何内容都是一种资源。无论它是场景 (.tscn 或 .scn 文件)、图像、脚本..。下面是一些``资源``示例： :ref:`Texture <class_Texture>`, :ref:`Script <class_Script>`, :ref:`Mesh <class_Mesh>`, :ref:`Animation <class_Animation>`, :ref:`AudioStream <class_AudioStream>`, :ref:`Font <class_Font>`, :ref:`Translation <class_Translation>`。

source: **Built-in**, saved inside the \*.tscn or the \*.scn file they're attached to.
fr: **Intégrés**, enregistrés dans le fichier \*.tscn ou le fichier \*.scn auquel ils sont attachés.
zh_cn: **内置**, 保存在他们所附加的\*.tscn或\*.scn文件中。

source: The switch between built-in and external resources happens when you save the scene. In the example above, if you erase the path \`"res://robi.png"\` and save, Godot will save the image inside the .tscn scene file.
fr: Le basculement entre les ressources intégrées et externes se produit lorsque vous enregistrez la scène. Dans l'exemple ci-dessus, si vous effacez le chemin \`"res://robi.png"\`et que vous sauvegardez, Godot sauvegardera l'image dans le fichier de scène .tscn.
zh_cn: 内置和外部资源之间的切换发生在保存场景时。在上面的示例中，如果去掉路径\`"res://robi.png"\`并且保存，Godot将把图片保存在.tscn场景文件中。

source: To get an instance of the scene, you have to use the :ref:`PackedScene.instance() <class_PackedScene_instance>` method.
zh_cn: 要获取场景的实例，您必须使用:ref:`PackedScene.instance() <class_PackedScene_instance>`方法。
