Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scenes_and_nodes.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: This tutorial talked about "scenes and nodes", but so far there has been only *one* scene and *one* node! Don't worry, the next tutorial will expand on that...
cs: Tento tutoriál vyprávěl o „scénách a uzlech“, ale zatím existovala v našem projektu pouze *jedna* scéna a *jeden* uzel! Nebojte se, další tutoriál to rozvede ...
de: In dieser Anleitung haben wir von "Szenen und Nodes" gesprochen, aber bisher haben wir nur mit *einer* Szene und *einem* Node gearbeitet! Keine Sorge, im der nächsten Anleitung werden wir genau da ansetzen…
es: Este turorial habla sobre "escenas y nodos", pero hasta ahora hemos tenido solo *una* escena y *un* nodo. No te preocupes, el siguiente tutorial ampliará eso...
fi: Tämä opas kertoi "skeneistä ja solmuista", mutta tähän saakka niitä on ollut vain *yksi* skene ja *yksi* solmu! Älä huoli, seuraava opas kertoo enemmän siitä...
fr: Ce tutoriel parle "des scènes et des nœuds", mais jusqu'à présent il n'y a eu qu'*une* seule scène et qu'*un* seul nœud ! Ne vous inquiétez pas, le prochain tutoriel s'étendra sur ce sujet...
it: Questo tutorial parla di "scene e nodi", ma finora ci sono stati solo *una* scena e *un* nodo! Non preoccuparti, il prossimo tutorial spiegherá piú approfonditamente questo argomento...
ja: このチュートリアルはシーンとノードについて説明しました。ここまでは、まだ一つのシーンと一つのノードだけしかありませんが、心配いりません。次のチュートリアルではこれを拡張します。
ko: 이 튜토리얼은 "씬과 노드"에 대해서 설명했습니다. 그런데 지금까지는 단 *하나의* 씬과 *하나의* 노드만 설명했습니다! 걱정하지 마세요. 다음 튜토리얼로 가서 개념을 넓혀봅시다...
pl: Ten samouczek mówił o "scenach i węzłach", ale jak dotąd była tylko *jedna* scena i *jeden* węzeł! Nie martw się, następny samouczek będzie poświęcony temu zagadnieniu....
pt_br: Este tutorial foi um guia sobre "cenas e nós", mas até agora só tivemos *uma* cena e *um* nó! Não se preocupe, o próximo tutorial vai ampliar seu conhecimento sobre isso…
ru: В этом уроке рассказывалось о "сценах и узлах", но до сих пор была только *одна* сцена и *один* узел! Не волнуйтесь, следующий урок будет шире...
uk: Цей урок розповідав про "сцени та вузли", але поки що була лише *одна* сцена та *один* вузол! Не хвилюйтеся, наступний урок розширить цю тему ...
zh_cn: 这篇教程谈论了“场景和节点”，但是目前为止，还只有 *一个* 场景和 *一个* 节点！别担心，下一篇教程将会展开讨论…
zh_tw: 本教學討論了有關「場景與節點」的部分，但目前我們還只有 **一個** 節點與 **一個** 場景！別擔心，下一個章節會繼續增加的…

source: Open the project you made in :ref:`doc_intro_to_the_editor_interface`, or create a new one. This will open the Godot editor:
cs: Otevřete projekt, ve kterém jste vytvořili :ref:`doc_intro_to_the_editor_interface`, nebo vytvořte nový. Otevře se editor Godot:
de: Zum öffnen des Godot Editor, öffnen Sie ein bestehendes Projekt oder erstellen ein neues:
es: Abre el proyecto que creaste en :ref:`doc_intro_to_the_editor_interface`, o crea uno nuevo. El editor de Godot se abrirá:
it: Aprire il progetto creato in :ref:`doc_intro_to_the_editor_interface`, o crearne uno nuovo. Questo aprirà l'editor di Godot:
ja: :ref:`doc_intro_to_the_editor_interface` で作成したプロジェクトを開くか、新しいプロジェクトを作成します。これにより、Godotエディタが開きます。
pt_br: Abra o projeto que você fez em :ref:`doc_intro_to_the_editor_interface`, ou crie um novo. Isso vai abrir o editor Godot:
ru: Откройте проект, который вы сделали в :ref:`doc_intro_to_the_editor_interface`, или создайте еще один. Это откроет редактор Godot:
uk: Відкрийте проект, який ви зробили в :ref:`doc_intro_to_the_editor_interface`, або створіть новий. Це відкриє редактор Godot:
zh_cn: 打开您在 :ref:`doc_intro_to_the_editor_interface`中创建的项目，或创建一个新项目。这将打开Godot编辑器：
zh_tw: 打開在 :ref:`doc_intro_to_the_editor_interface` 建立的專案或是建立一個新專案。這樣一來就會打開 Godot 編輯器：

source: The node appears in the scene tree editor in the Scene dock, and the label properties appear in the Inspector dock.
cs: Uzel se zobrazí v editoru stromu scény v doku Scény a vlastnosti popisku se zobrazí v doku Inspektoru.
de: Das Node wird im Szenenbaum-Editor im Szenendock angezeigt, und die Beschriftungseigenschaften werden im Inspektor-Dock angezeigt.
es: El nodo aparece en el editor del árbol de escenas (panel Escena situado en la esquina superior izquierda), y las propiedades de la etiqueta aparecerán en el Inspector (panel situado en la esquina inferior derecha).
it: Il nodo appare nell'editor dell'albero della scena nel dock Scena, e le proprietà della Label appaiono nel dock Ispettore.
ja: ノードはシーンドックのシーンツリーエディタに表示され、ラベルプロパティはインスペクタドックに表示されます。
ru: Узел появляется в редакторе дерева сцены в панели "Сцена", а свойства узла "Label" отобразятся в панели "Инспектор".
uk: Вузол з’являється в редакторі дерева сцени в панелі Сцена, а властивості мітки з’являються в Інспекторі.
zh_tw: 節點會顯示在場景 Dock 中的場景樹編輯器中，Label 的屬性會顯示在屬性面板 Dock 裡。

source: Ok, everything's ready to run the scene! Press the PLAY SCENE Button on the top bar (or hit :kbd:`F6`):
cs: Dobře, všechno je připraveno na spuštění scény! Stiskněte tlačítko Přehrát scénu na horním panelu (nebo stiskněte :kbd:`F6`):
de: OK, jetzt ist alles bereit um die Szene abzuspielen! Klicken Sie auf "Szene starten" in der oberen Leiste (die kleine Filmklappe mit dem Play-Symbol) oder drücken :kbd:`F6`:
es: Ok, todo está listo para ejecutar la escena. Presione el botón *reproducir escena* en la barra superior derecha (o presione F6):
it: Ok, tutto è pronto per eseguire la scena! Premi il tasto ESEGUI SCENA nella barra in alto (o premi F6):
ja: さて、シーンを実行する準備がすべて整いました！トップバーの[シーンを実行]ボタンを押します (または :kbd:`F6` を押します):
ru: Отлично, сцена готова к запуску! Нажмите кнопку "Воспроизвести" в правой верхней панели (или нажмите :kbd:`F6`):
uk: Гаразд, все готово для запуску сцени! Натисніть кнопку ВІДТВОРИТИ СЦЕНУ на верхній панелі (або натисніть :kbd:`F6`):
zh_tw: 好了，現在可以執行場景了！點擊上方工具列的 **播放場景** 按鈕 (或是按 :kbd:`F6`)：

source: To create a new project, click the "New Project" option. Choose and create a path for the project and specify the project name "New Project":
fr: Pour créer un nouveau projet, cliquez sur l'option "Nouveau projet". Choisissez et créez un chemin pour le projet et spécifiez le nom du projet "Nouveau projet" :
pl: Aby utworzyć nowy projekt, kliknij na opcji "Nowy projekt". Wybierz i utwórz ścieżkę dla projektu oraz określ nazwę projektu "Nowy projekt":

source: To do this, press the "New Node" button (which looks like a plus symbol):
fr: Pour ce faire, appuyez sur le bouton "New Node" (qui ressemble à un symbole plus) :
pl: W tym celu należy nacisnąć przycisk "Nowy węzeł" (który wygląda jak symbol plusa):

source: And here's when something funny happens. The file dialog is a special file dialog, and only allows you to save inside the project. The project root is "res://" which means "resource path". This means that files can only be saved inside the project. For the future, when doing file operations in Godot, remember that "res://" is the resource path, and no matter the platform or install location, it is the way to locate where resource files are from inside the game.
fr: Et voilà quand quelque chose de drôle arrive. La boîte de dialogue de fichier est une boîte de dialogue spéciale, et vous permet seulement d'enregistrer à l'intérieur du projet. La racine du projet est "res://" qui signifie "chemin des ressources". Cela signifie que les fichiers ne peuvent être sauvegardés qu'à l'intérieur du projet. Pour l'avenir, lorsque vous effectuez des opérations de fichiers dans Godot, rappelez-vous que "res://" est le chemin des ressources, et peu importe la plateforme ou l'emplacement d'installation, c'est le moyen de localiser où se trouvent les fichiers de ressources à l'intérieur du jeu.
pl: I właśnie wtedy dzieje się coś ciekawego. Okno dialogowe pliku jest specjalnym oknem dialogowym pliku i pozwala tylko na zapisanie plików w folderze projektu. Korzeń projektu to "res://", co oznacza "ścieżkę zasobu". Oznacza to, że pliki mogą być zapisywane tylko wewnątrz projektu. W przyszłości, wykonując operacje plików w Godot, pamiętaj, że "res://" jest ścieżką zasobów i bez względu na platformę lub lokalizację instalacji, jest to sposób, aby zlokalizować gdzie pliki zasobów znajdują się wewnątrz gry.

source: In an empty scene (without root node), the scene dock shows several options to quickly add a root node to the scene. "2D Scene" adds a Node2D node, "3D Scene" adds a Spatial node, "User Interface" adds a Control node, and "Other Node" which lets you select any node (so it is equivalent to pressing the "Add Child Node" button). You can also press the star-shaped icon to toggle the display of your favorited nodes.
cs: V prázdné scéně (bez kořenového uzlu) dok scény zobrazuje několik možností, jak rychle přidat do scény kořenový uzel . „2D scéna“ přidá uzel Node2D, „3D scéna“ přidá prostorový uzel, „Uživatelské rozhraní“ přidá řídící uzel a „Vlastní uzel“, který vám umožní vybrat jakýkoli uzel (takže je ekvivalentní stisknutí tlačítka „Přidat podřízený uzel“ ). Můžete také stisknout ikonu ve tvaru hvězdy a přepnout zobrazení oblíbených uzlů.
de: In einer leeren Szene (ohne Wurzel-Node) zeigt das Szenen-Dock verschiedene Optionen, um der Szene schnell einen Wurzel-Node hinzuzufügen. "2D-Szene" fügt einen 2D-Node hinzu, "3D-Szene" fügt einen räumlichen Node hinzu, "Benutzeroberfläche" fügt einen Kontroll-Node hinzu und "Anderer Node", mit dem Sie einen beliebigen Node auswählen können (dies entspricht dem Drücken des "Untergeordneten Node hinzufügen" -Taste). Sie können auch das sternförmige Symbol drücken, um die Anzeige Ihrer bevorzugten Nodes umzuschalten.
ru: В пустой сцене (без корневого узла) панель сцены содержит несколько способов быстрого добавления корневого узла в сцену. "2D Scene" добавит узел Node2D, "3D Scene" добавит узел Spatial, "User Interface" добавит узел Control, а "Other Node" допускает выбор вами любого узла (так что он эквивалентен нажатию кнопки "Add Child Node" (Добавить дочерний узел). Вы также можете нажать на значок-звёздочку, чтобы переключить отображение на экране ваших избранных узлов.
zh_tw: 在空白的場景中 (也就是沒有根節點的場景)，場景 Dock 會顯示好幾個選項，用來快速新增根節點到場景中。[2D 場景] 可以新增 Node2D 節點，[3D 場景] 可以新增 Spatial 節點，[使用者介面] 會新增 Control 節點，[自定節點] 可以選擇任何一種節點 (就跟點擊「新增子節點」的效果一樣)。也可以點擊星形的圖示來顯示或關閉我的最愛裡的節點。

source: Now, to add a label node to this scene you can click on the Other Node button or the Add Node button at the top. In scenes that aren't empty you use the add node button to create every child node.
cs: Nyní, pokud chcete do této scény přidat uzel popisu (Label), můžete kliknout na tlačítko Vlastní uzel nebo na tlačítko Přidat uzel nahoře. Ve scénách, které nejsou prázdné, pomocí tlačítka Přidat uzel vytvoříte libovolný podřízený uzel.
de: Um nun einen Label-Node zu dieser Szene hinzuzufügen, können Sie auf die Schaltfläche Custom Node oder den Plus-Button oben links klicken. In nicht leeren Szenen verwenden Sie die Schaltfläche Node hinzufügen, um Unter-Nodes zu erstellen.
ru: Теперь, чтобы добавить узел метки в эту сцену, вы можете нажать на кнопку "Other Node" (Другой узел) или кнопку "Add Node" (Добавить узел) в верхней части. В непустых сценах используется кнопка "Add Node" (Добавить узел) для создания каждого дочернего узла.
zh_tw: 現在，我們可以點擊 [自定節點] 按鈕或畫面上方的 [新增節點] 按鈕來新增 Label 節點。如果場景不是空白的話，就得用新增節點按鈕來新增子節點。

source: It can be added to other nodes as a child.
fr: Il peut être ajouté à d'autres nœuds en tant qu'enfant.

source: If you run the godot executable outside of a project, the Project Manager appears. This helps developers manage their projects.
fr: Si vous lancer l'exécutable godot en dehors d'un projet, le Project Manager apparaît. Cela aide les développeurs à gérer leurs projets.

source: Scenes need to be saved to be run, so save the scene to something like hello.tscn in Scene -> Save:
fr: Les scènes doivent être sauvegardées pour être exécutées, alors enregistrez la scène sur quelque chose comme hello.tscn dans Scène -> Enregistrer :

source: Once the window opens, let's select a main scene. Locate the `Application/Run/Main Scene` property and click on it to select 'hello.tscn'.
fr: Une fois la fenêtre ouverte, sélectionnons une scène principale. Localisez la propriété `Application/Run/Main Scene` et cliquez dessus pour sélectionner 'hello.tscn'.
