Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scenes_and_nodes.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Don't worry if this doesn't click yet. We will continue to explore this over the next few sections. The most important fact to remember for now is that nodes exist and can be arranged this way.
cs: Jestli ti to teď nedává zrovínka dvakrát smysl, nic si s toho nedělej. Nejdůležitější je si uvědomit, že v Godotu existují uzly a že se dají seskupovat (do stromů).
de: Mach Sie sich keine Sorgen, wenn Sie noch nicht alles komplett verstanden haben. Wir werden in den nächsten Abschnitten die Konzepte vertiefen. Das Wichtigste, dass Sie sich im Moment merken sollten ist, dass Spiele in Godot aus Nodes aufgebaut sind und diese in einer Baumstruktur angeordnet werden können.
es: No te preocupes si esto aún no te hace clic. Continuaremos explorando esto en las siguientes secciones. El hecho más importante para recordar por ahora es que los nodos existen y se pueden organizar de esta manera.
fi: Älä murehdi, jos tämä ei vielä loksahda. Jatkamme tämän tutkiskelua muutamien seuraavien lukujen ajan. Tärkein asia toistaiseksi muistaa on, että solmuja on olemassa ja että niitä voidaan järjestää tähän tapaan.
fr: Ne vous inquiétez pas si cela ne vous percute pas encore. Nous continuerons d'explorer cette question au cours des prochaines sections. Le fait le plus important à retenir pour l'instant est que les nœuds existent et peuvent être arrangés de cette façon.
it: Non preoccuparti se ciò non ti è ancora chiaro. Continueremo ad occuparci di ciò nei prossimi capitoli. La cosa più importante da ricordare è che i nodi possono essere sistemati in questo modo.
ja: これについては次の何節かにわたって掘り下げていくので、まだうまく掴めなくても大丈夫です。今はただ、ノードというものが存在し、このように配置できるという重要点のみを覚えておいてください。
ko: 와닿지 않더라도 걱정하지 마세요. 앞으로 몇 몇 섹션에서 계속 노드에 대해 알아볼 것입니다. 여기서 기억할 점은 노드가 있고 이런 방식으로 서로 배열될 수 있는 점입니다.
pl: Nie martw się, jeśli jeszcze nie rozumiesz tego. Będziemy wyjaśniać tę sprawę w kolejnych sekcjach. Najważniejszym faktem, o którym należy pamiętać na razie, jest to, że węzły istnieją i mogą być rozmieszczone w ten sposób.
pt_br: Não se preocupe se ainda não entendeu. Continuaremos a explorar esse conceitos nas próximas seções. O fato mais importante para lembrar por ora é que nós existem e eles podem ser organizados desta forma.
ru: Не беспокойтесь, если не разобрались в этом. Мы продолжим изучение этого в следующих нескольких разделах. Самое важное, что нужно запомнить на данный момент - это то, что узлы существуют и могут быть организованы таким вот образом.
uk: Не хвилюйтесь, якщо ще не зрозуміли цього. Ми продовжимо вивчати це протягом кількох наступних розділів. Найважливіший факт, про який слід пам'ятати, - це те, що вузли існують і їх можна упорядкувати таким чином.
zh_cn: 如果现在没有领悟它，不要担心。我们会再接下来几节里继续探讨。目前要记住最重要的一点是：有节点这个东西存在，并且能够按这种方式来编排。
zh_tw: 如果你還不懂，別擔心，接下來幾個章節我們會繼續深入瞭解。只要記得最重要的是：有個東西叫節點，然後能用樹狀形式排列這些節點。

source: Scenes
cs: Scény
de: Szenen
es: Escenas
fi: Skenet
fr: Les scènes
it: Scene
ja: シーン
ko: 씬(Scene)
pl: Sceny
pt_br: Cenas
ru: Сцены
uk: Сцени
zh_cn: 场景
zh_tw: 場景

source: Now that the concept of nodes has been defined, the next logical step is to explain what a Scene is.
cs: Teď, když jsme si definovali koncept uzlů, můžeme vysvětlit co je to vlastně scéna.
de: Nachdem das Konzept von Nodes geklärt ist, wenden wir uns nun den Szenen zu.
es: Ahora que se ha definido el concepto de nodos, el siguiente paso lógico es explicar qué es una escena.
fi: Nyt kun solmujen käsite on määritetty, seuraava looginen askel on selostaa mikä Skene on.
fr: Maintenant que le concept de nœuds a été défini, l'étape logique suivante consiste à expliquer ce qu'est une scène.
it: Adesso che il concetto di nodo è chiaro, il prossimo passo logico è spiegare cosa è una Scena.
ja: ノードの概念を定義したので、つぎはシーンについて説明するべきでしょう。
ko: 이제 노드의 개념이 정리되었으니, 다음 이론은 씬이 무엇인가에 대해 설명해 보겠습니다.
pl: Teraz, gdy zdefiniowano pojęcie węzłów, kolejnym logicznym krokiem jest wyjaśnienie, czym jest scena.
pt_br: Agora que o conceito de nós foi definido, o próximo passo lógico é explicar o que é uma Cena.
ru: Теперь, когда концепция узлов определена, следующим логическим шагом является объяснение того, что такое Сцена.
uk: Тепер, коли концепція вузлів визначена, наступним логічним кроком є пояснення, що таке Сцена.
zh_cn: 既然现在已经定义了节点的概念，那么下一个合逻辑的步骤就是解释场景是什么了。
zh_tw: 現在我們已經知道節點的概念了，那麼下一個該說明的就是場景了。

source: A scene is composed of a group of nodes organized hierarchically (in tree fashion). Furthermore, a scene:
cs: Scéna se skládá ze skupiny uzlů seřazených hiearchicky (do stromové struktury). Mimoto scéna:
de: Eine Szene besteht aus einer Reihe von Nodes, die hierarchisch organisiert sind (wie ein Baum verzweigt). Ferner gilt für eine Szene:
es: Una escena se compone de un grupo de nodos organizados jerárquicamente (en forma de árbol). Además, una escena:
fi: Skene muodostuu joukosta solmuja hierarkisesti järjestettynä (puun tapaan). Lisäksi:
fr: Une scène est composée d'un groupe de nœuds organisés hiérarchiquement (en arborescence). En outre, une scène :
it: Una scena è composta da un gruppo di nodi organizzati in una gerarchia (simile ad un albero). Inoltre una scena:
ja: シーンは、ツリーの形で階層構造をしたノードのグループから構成されます。それに加え、シーンは:
ko: 씬은 계층 구조로 (트리 형식으로) 조직된 노드 그룹으로 구성됩니다. 또한 씬은:
pl: Scena składa się z grupy węzłów zorganizowanych hierarchicznie (w sposób drzewiasty). Co więcej, scena:
pt_br: Uma cena é composta por um grupo de nós organizados hierarquicamente (no estilo árvore). Além disso, uma cena:
ru: Сцена состоит из группы узлов, организованных иерархически (в виде дерева). Кроме того, сцена:
uk: Сцена складається з групи вузлів, організованих ієрархічно (в формі дерева). Крім того, сцена:
zh_cn: 一个场景是由一组分层组织(以树形方式)的节点组成。此外，一个场景：
zh_tw: 場景是有一組由一組節點所組成的，這些節點以樹狀結構排列。然後，場景還…：

source: always has one root node.
cs: má vždycky jeden kořenový uzel.
de: Sie hat stets einen Wurzel-Node.
es: siempre tiene un solo nodo raíz.
fi: on aina yksi juurisolmu.
fr: a toujours un seul nœud racine.
it: ha sempre un nodo radice (root).
ja: 常にルートノードをひとつ持ちます。
ko: 항상 하나의 루트 노드를 갖습니다.
pl: zawsze ma jeden węzeł główny.
pt_br: sempre tem um único nó raiz.
ru: всегда имеет только один корневой нод.
uk: завжди має тільки один кореневий вузол.
zh_cn: 始终有 **一个** 根节点。
zh_tw: 場景永遠都有一個根節點。

source: can be saved to disk and loaded back.
cs: může být uložena na disk a nahrána zpět.
de: Sie kann abgespeichert und wieder geladen werden.
es: Se puede guardar en disco y cargarse de nuevo.
fi: Skene voidaan tallentaa levylle ja ladata takaisin.
fr: peut être sauvegardé sur disque et chargé à nouveau.
it: può essere salvato su disco e caricato da esso.
ja: ディスクに保存でき、それをまた読み込めます。
ko: 디스크에 저장하고 다시 불러올 수 있습니다.
pl: można zostać zapisane na dysku i wczytane z powrotem.
pt_br: pode ser salva no disco e carregada posteriormente.
ru: может быть сохранена на диск и загружена обратно.
uk: може бути збережена на диск і завантажена назад.
zh_cn: 能够被保存到磁盘上，也能被载入回来。
zh_tw: 場景可以保存在硬碟上，之後可以再讀取進來。

source: can be *instanced* (more on that later).
cs: může být vytvořena její instance (bude vysvětleno později).
de: Sie kann *instanziiert* werden (dazu später mehr).
es: Se puede *Instanciar* (explicado más adelante).
fi: Skenestä voidaan luoda *ilmentymiä* (siitä lisää myöhemmin).
fr: peut être *instanciées* (plus de détails plus tard).
it: può essere *istanziato* (maggiori spiegazioni a breve).
ja: *インスタンス化*\ できる(詳しくは後で)。
ko: *인스턴스(Instance)*\ 될수 있습니다 (더 자세한 설명은 나중에).
pl: może być *instancjonowany* (więcej na ten temat później).
pt_br: pode ser *instanciada* (mais sobre isso depois).
ru: может быть *инстанцирована* (т. е. использована несколько раз через создание её экземпляров, подробнее об этом позже).
uk: може бути *вставлена* (більше про це пізніше).
zh_cn: 能够被 *实例化* (稍后详细说明)。
zh_tw: 場景可以被 **實體化** (稍後會再說明)。

source: Running a game means running a scene. A project can contain several scenes, but for the game to start, one of them must be selected as the main scene.
cs: Běh hry znamená běh scény. Projekt může obsahovat několik scén, ale aby mohla být hra spuštěna, jedna ze scén musí být označena jako tzv. hlavní scéna.
de: Ein Spiel zu starten, heißt, eine Szene zu starten. Ein Projekt kann mehrere Szenen enthalten, aber um ein Spiel zu starten, muss eine davon als Haupt-Szene (Main Scene) festgelegt werden.
es: Ejecutar un juego significa ejecutar una escena. Un proyecto puede contener varias escenas, pero para que comience el juego, se debe seleccionar una de ellas como la escena principal.
fi: Pelin ajaminen tarkoittaa skenen ajamista. Projekti voi sisältää useita skenejä, mutta jotta peli voi käynnistyä, yksi niistä täytyy valita pääskeneksi.
fr: Exécuter un jeu signifie exécuter une scène. Un projet peut contenir plusieurs scènes, mais pour que le jeu se lance, l'une d'entre elles doit être sélectionnée comme scène principale.
it: Eseguire un gioco significa eseguire una scena. Un progetto puó contentere varie scene, ma per far partire il gioco una di queste deve essere selezionata come scena principale.
ja: ゲームを走らせることは、シーンを走らせることです。プロジェクトは複数のシーンを持てますが、ゲームを開始するためには、どれか一つをメインシーンに指定する必要があります。
ko: 게임을 실행한다는 것은 씬을 실행하는 것입니다. 한 프로젝트는 여러 씬으로 이루어지지만, 게임을 시작하면 그 중 하나의 씬만 메인 씬으로 선택됩니다.
pl: Uruchomienie gry oznacza uruchomienie sceny. Projekt może zawierać kilka scen, ale aby gra mogła się rozpocząć, jedna z nich musi być wybrana jako scena główna.
pt_br: Executar um jogo significa executar uma cena. Um projeto pode conter muitas cenas, mas, para o jogo começar, uma delas deve ser selecionada como cena principal.
ru: Запуск игры означает запуск сцены. Проект может содержать несколько сцен, но для начала игры одна из них должна быть выбрана в качестве главной сцены.
uk: Запуск гри означає запуск сцени. Проект може містити кілька сцен, але для старту гри одна з них повинна бути обрана як головна сцена.
zh_cn: 运行一个游戏意味着运行一个场景。一个项目可以有多个场景，但是为了游戏的启动，必须有一个作为主场景。
zh_tw: 執行遊戲，就是執行場景。一個專案可以有多個場景，但要開始遊戲則必須要先把其中一個場景設為主場景。

source: Basically, the Godot editor is a **scene editor**. It has plenty of tools for editing 2D and 3D scenes as well as user interfaces, but the editor is based on the concept of editing a scene and the nodes that compose it.
cs: V podstatě je editor Godotu **editorem scén**. Má spoustu nástrojů pro editaci 2D a 3D scén a uživatelských rozhraní, ale editor sám je založen na konceptu úpravy scény a uzlů, které tu scénu tvoří.
de: Grundsätzlich ist der Godot-Editor ein **Szenen-Editor**. Er verfügt über zahlreiche Werkzeuge zur Bearbeitung von 2D- und 3D-Szenen sowie Benutzeroberflächen, aber der Editor basiert auf dem Konzept der Bearbeitung einer Szene und den Nodes, aus denen sie besteht.
es: Básicamente, el editor de Godot es un **editor de escena**. Tiene muchas herramientas para editar escenas 2D y 3D, así como también interfaces de usuario, pero el editor se basa en el concepto de edición de una escena y los nodos que la componen.
fi: Pohjimmiltaan Godotin editori on **skene-editori**. Siinä on runsaasti työkaluja 2D- ja 3D-skenejen sekä käyttöliittymien editointiin, mutta editori pohjautuu skenejen ja solmujen editoinnin periaatteeseen.
fr: Fondamentalement, l'éditeur Godot est un **éditeur de scènes**. Il dispose de nombreux outils pour éditer des scènes 2D et 3D ainsi que des interfaces utilisateur, mais l'éditeur est basé sur le concept d'édition d'une scène et des nœuds qui la composent.
it: Fondamentalmente, l'editor di Godot é un **editor di scene**. Contiene molti strumenti per modificare scene 2D e 3D cosí come interfacce utente, ma l'editor é basato sul concetto di manipolare una scena e i nodi che la compongono.
ja: 基本的に、Godotエディタは\ **シーンエディタ**\ です。2Dおよび3Dのシーンや、ユーザーインターフェースを編集するツールを多く備えていますが、基礎としているのは、シーンやそれを構成するノードを編集するという概念だけです。
ko: 기본적으로 Godot 편집기는 **씬 편집기**\ 입니다. 사용자 인터페이스말고도 2D와 3D 씬을 편집하기 위한 도구가 많이 있지만, 편집기는 씬을 편집하는 것과 씬을 구성하는 노드들이란 개념으로 있습니다.
pl: Zasadniczo, Godot jest **edytorem scen**. Posiada wiele narzędzi do edycji scen 2D i 3D oraz interfejsu, ale edytor opiera się na koncepcji edycji sceny i węzłów, które ją tworzą.
pt_br: Basicamente, o editor do Godot é um **editor de cena**. Ele tem um monte de ferramentas para edição de cenas 2D e 3D, assim como interfaces com usuário, mas o editor é baseado no conceito de editar uma cena e os nós que a compõem.
ru: В целом, редактор Godot является **редактором сцены**. Он имеет множество инструментов для редактирования 2D и 3D-сцен, а также пользовательских интерфейсов, но основан он на концепции редактирования сцены и узлов, которые ее составляют.
uk: В основному редактор Godot - це **редактор сцен**. У ньому є безліч інструментів для редагування 2D та 3D сцен, а також інтерфейсів користувача, але редактор заснований на концепції редагування сцени та вузлів, які її складають.
zh_cn: 本质上，Godot编辑器就是一个 **场景编辑器** 。它有很多用于编辑2D和3D场景以及用户界面的工具，但是编辑器是基于编辑场景及构成场景的节点的概念的。
zh_tw: 基本上來說，Godot 編輯器就是一個 **場景編輯器**，有著各種能夠編輯 2D 與 3D 場景以及使用者介面的工具。但編輯器基本上就只是用來編輯場景以及編輯構成場景的節點。

source: Creating a new project
fi: Uuden projektin luominen
fr: Créer un nouveau projet
ko: 새 프로젝트 만들기
pl: Tworzenie nowego projektu

source: Let's make these abstract concepts more concrete with an example. Following a long tradition in tutorials, we'll start with a "Hello World" project. This will introduce us to using the editor.
fi: Tehdäänpä näistä abstrakteista käsitteistä kouriintuntuvampia esimerkin avulla. Noudattaen pitkää perinnettä, aloitamme "Hello World" projektilla. Se esittelee meille editorin käyttöä.
fr: Rendons ces concepts abstraits plus concrets à l'aide d'un exemple. Suivant une longue tradition dans les tutoriels, nous commencerons par un projet "Hello World". Ceci nous initie à l'utilisation de l'éditeur.
ko: 예제를 통해 이런 추상적인 개념들을 더 구체화해봅시다. 튜토리얼의 오랜 전통에 따라 "Hello World" 프로젝트를 시작하겠습니다. 이를 통해 편집기를 사용하는 법을 알게 될 것입니다.
pl: Zróbmy te abstrakcyjne pojęcia bardziej konkretne ilustrując je na przykładzie. Zgodnie z długą tradycją poradników, zaczynamy od projektu "Hello World". To wprowadzi nas do korzystania z edytora.

source: If you run the Godot executable outside of a project, the Project Manager appears. This helps developers manage their projects.
fi: Jos käynnistät Godotin projektin ulkopuolella, ilmestyy esiin Projektinhallinta. Se auttaa pelikehittäjiä hallitsemaan projektejaan.
ko: 프로젝트 외부에서 Godot 실행 파일을 실행하면, 프로젝트 매니저가 뜹니다. 개발자는 프로젝트 매니저로 프로젝트들을 관리할 수 있습니다.
pl: Jeśli uruchomisz plik wykonawczy Godota poza projektem, pojawi się Menadżer Projektu. Pomaga to developerom w zarządzaniu projektem.

source: To create a new project, click the "New Project" option. Choose and create a path for the project and specify the project name.
ko: 새 프로젝트를 만들려면 "새 프로젝트(New Project)" 버튼을 클릭하세요. 프로젝트의 경로를 지정하고 프로젝트 이름을 지정하세요.

source: You can also select the rendering backend at this stage (OpenGL ES 3.0 or OpenGL ES 2.0). The advantages and disadvantages of each are listed to help you choose, and you can refer to :ref:`doc_gles2_gles3_differences` for more details. Note that you can change the backend from the project settings if you change your mind later on. For this tutorial either backend is fine.
ko: 그리고 이 곳에서 렌더링 백엔드를 선택할 수도 있습니다 (OpenGL ES 3.0 또는 OpenGL ES 2.0). 각자 장단점이 있고 선택하는데 도움이 될 것입니다. 그리고 더 자세한 정보는 :ref:`doc_gles2_gles3_differences`\ 을 참고해 볼 수 있습니다. 나중에 마음이 바뀌면 프로젝트 설정(Project Settings)에서 백엔드를 바꿀 수 있습니다. 이 튜토리얼에서는 양 쪽 다 괜찮습니다.

source: Editor
fi: Editori
fr: Éditeur
ja: エディタ
ko: 편집기
pl: Edytor
ru: Редактор
uk: Редактор
zh_cn: 编辑器
zh_tw: 編輯器

source: Once you've created the "New Project", then open it. This will open the Godot editor:
fi: Kun olet luonut "New Project" projektin, avaa se. Tämä aukaisee Godotin editorin:
fr: Une fois que vous avez créé le "Nouveau Projet", ouvrez-le. Ceci ouvrira l'éditeur Godot :
ko: "Nee Project"를 만들고 프로젝트를 엽니다. 그러면 Godot 편집기가 열립니다:
pl: Po utworzeniu "nowego projektu" otwórz go. Otworzy się w ten sposób edytor Godota:

source: As mentioned before, making games in Godot feels like being in a kitchen, so let's open the refrigerator and add some fresh nodes to the project. We'll begin with a "Hello World" message that we'll put on the screen.
cs: Jak již bylo zmíněno, dělat hry v Godotu je jako připravovat jídlo v kuchyni, takže pojďme otevřít chladničku a přidat do projektu nějaké ty čerstvé voňavoučké uzly. Začneme zprávou „Hello World“, kterou umístíme na obrazovku.
de: Wie bereits erwähnt, fühlt sich die Spieleentwicklung in Godot so an, als würde man in einer Küche hantieren. Also öffnen wir mal den Kühlschrank und fügen dem Projekt ein paar frische Nodes hinzu. Wir beginnen mit einer "Hello World"-Nachricht, die wir auf dem Bildschirm ausgeben werden.
es: Como se mencionó anteriormente, hacer juegos en Godot es como estar en una cocina, así que vamos a abrir el refigerador y agregar algunos nodos nuevos al proyecto. Comenzaremos con un mensaje "¡Hola mundo!" que pondremos en la pantalla.
fi: Kuten mainittu aiemmin, pelien luonti Godotissa tuntuu kuin olisi keittiössä, joten avataanpa jääkaappi ja lisätää projektiin muutama tuore solmu. Aloitamme "Hello World" viestillä, jonka asetamme ruudulle.
fr: Comme mentionné précédemment, fabriquer des jeux dans Godot, c'est comme être dans une cuisine : ouvrons le réfrigérateur et ajoutons de nouveaux nœuds au projet. Nous commencerons par un message "Hello World!" que nous afficherons à l'écran.
it: Come detto prima, creare giochi con Godot é come essere in una cucina, per cui apriamo il nostro frigo e aggiungiamo alcuni nodi freschi al nostro progetto. Inizieremo con un messaggio "Hello World" che mostriamo sullo schermo.
ja: 前述の通り、Godotでのゲーム作りはキッチンで作業している感覚に似ています。では冷蔵庫を開けて、いくつか新鮮なノードをプロジェクトに加えてみましょう。まずは画面に表示する「Hello World」のメッセージから始めます。
ko: 앞서 말했듯이, Godot로 게임을 만드는 것은 주방에 있는 것과 같은 느낌입니다. 그렇다면 한번 냉장고를 열고 프로젝트에 신선한 노드들을 추가해 봅시다. 실행을 누르면 "Hello World!"가 화면에 나오게 할 것입니다.
pl: Jak wspomniano wcześniej, tworzenie gier w Godocie przypomina gotowanie, tak więc otwórz lodówkę i dodaj trochę świeżych węzłów do projektu. Na początek wyświetlimy na ekranie komunikat "Hello World!" (Witaj Świecie!).
pt_br: Como mencionado antes, fazer jogos no Godot é como estar em uma cozinha. Então vamos abrir a geladeira e adicionar uns nós frescos ao projeto. Vamos começar com uma mensagem "Olá, mundo!" que vamos colocar na tela.
ru: Как упоминалось ранее, создание игр в Godot похоже на работу на кухне, поэтому давайте откроем холодильник и добавим свежие узлы в проект. Мы начнем с сообщения "Hello World!", которое поместим на экран.
uk: Як вже згадувалося раніше, створення ігор в Godot схоже на приготування страв на кухні, тому давайте відкриємо холодильник і додамо до проекту кілька свіжих вузлів. Почнемо з повідомлення "Hello World", яке ми помістимо на екран.
zh_cn: 正如前面提到的，在Godot做游戏感觉就像在厨房，所以让我们打开冰箱，为项目添加一些新的节点。我们将以在屏幕上显示“Hello World”消息开始。
zh_tw: 就像剛才說的，在 Godot 製作遊戲就像在廚房裡一樣。讓我們打開冰箱往專案裡加一點新鮮的節點吧！我們先從在螢幕上顯示「Hellow World」開始。

source: To do this we need to add a Label node. Press the "Add Child Node" button at the top left of the scene dock (the icon represents a plus symbol). This button is the main way to add new nodes to a scene, and will always add the chosen node as a child of the currently selected node (or, in an empty scene, as the "root" node).
cs: K tomu musíme přidat uzel Label. Stiskněte tlačítko „Přidat podřízený uzel“ vlevo nahoře v doku scény (ikona představuje symbol plus). Toto tlačítko je hlavním způsobem přidání nových uzlů do scény a vždy přidá vybraný uzel jako podřízený aktuálně vybraného uzlu (nebo v prázdné scéně jako „kořenový“ uzel).
de: Um dies zu erreichen, müssen wir eine "Label"-Node hinzufügen. Clicke dafür den "Node hier anhängen"-Button (Plus-Symbol) oben links im "Szene"-Fenster. Diese Schaltfläche ist die Hauptmethode zum Hinzufügen neuer Nodes zu einer Szene und fügt den ausgewählten Node immer als untergeordnetes Element des aktuell ausgewählten Nodes (oder in einer leeren Szene als Wurzel-Node) hinzu.
es: Para hacer esto, necesita añadir un nodo Label. Presiona el botón "Añadir nodo hijo" en la esquina superior izquierda de la ventana "Escenas" (el icono representa un símbolo +). Este botón es el modo principal de añadir nodos a una escena, y siempre agregará el nodo elegido como hijo del nodo seleccionado actualmente (o, en una escena vacía, como el nodo "raíz").
it: Per fare questo dobbiamo aggiungere un nodo Label. Premi il pulsante "Aggiungi Nodo Figlio" in alto a sinistra del riquadro Scena (il bottone presenta il simbolo +). Questo pulsante è il modo principale per aggiungere nuovi nodi ad una scena ed aggiungerà sempre il nuovo nodo scelto come figlio del nodo selezionato (o, in caso di una scena vuota, come nodo "root").
ja: これを行うためには、ラベルノードを追加する必要があります。シーンドックの左上にある「子ノードを追加する」ボタン(プラスアイコン)を押してください。このボタンが新規ノードをシーンに追加する主な方法です。選ばれたノードは常にいま選択中のノードの子ノード(空のシーンの場合はルートノードとして)として追加されます。
ko: 작업을 하려면 Label 노드를 추가해야 합니다. 씬 독의 왼쪽 위에 있는 "자식 노드 추가하기(Add Child Node" 버튼을 클릭하세요 (더하기 아이콘처럼 생겼습니다). 이 버튼은 씬에 새 노드를 추가하는 기본 방법입니다. 그리고 자식을 추가하면 항상 현재 선택된 노드의 자식으로 노드가 추가됩니다 (비어있는 씬의 경우 노드는 "루트" 노드로 추가됩니다).
pt_br: Para fazer isso, precisamos criar um Nó do tipo Label. Pressione o botão "Adicionar Nó Filho" no canto superior esquerdo do painel da cena (o ícone é representado por um sinal de mais). Este botão é a maneira principal para se adicionar Nós a cena, e vai sempre adicionar o Nó escolhido como filho do Nó selecionado (ou, no caso de uma cena vazia, será adicionado como o Nó "raiz").
ru: Чтобы сделать это, нам надо добавить узел Label . Нажмите кнопку "Add Child Node" в верхнем левом углу панели сцены (значок с символом плюса). Эта кнопка — основной метод добавления новых узлов в сцену, и она всегда добавит указанный узел в качестве потомка выбранного в настоящий момент узла (или, в случае пустой сцены, в качестве "корневого" узла - "root").
uk: Для цього нам потрібно додати вузол Label (Мітка). Натисніть кнопку "Додати вузол нащадок" у верхньому лівому куті панелі Сцена (піктограма являє собою символ плюс). Ця кнопка є основним способом додавання нових вузлів до сцени, і завжди додаватиме вибраний вузол нащадком до поточного вибраного вузла (або, як "кореневий", в порожній сцені).
zh_cn: 为此，我们需要添加 Label（标签）节点。点击场景面板左上角的“添加子节点”按钮（加号图标）。这是往场景中添加新节点的主要方式，会把新建的节点加到当前所选节点下，成为其子节点（如果是空场景，新建节点则会成为根节点）。
zh_tw: 我們需要 Label (標籤) 節點。點擊場景 Dock 左上角的 [新增子節點] 按鈕 (加號圖示)。這個按鈕是往場景裡新增節點的主要方法，這個按鈕會把選擇的節點新增成目前節點的子節點，在空白的場景中則會新增為「根」節點。
