Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scenes_and_nodes.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: In an empty scene (without root node), the scene dock shows several options to quickly add a root node to the scene. "2D Scene" adds a Node2D node, "3D Scene" adds a Spatial node, "User Interface" adds a Control node, and "Custom Node" which lets you select any node (so it is equivalent to pressing the "Add Child Node" button). You can also press the star-shaped icon to toggle the display of your favorited nodes.
it: In una scena vuota (senza il nodo root), il riquadro Scena mostra diverse opzioni per aggiungere rapidamente un nodo root alla scena. "Scena 2D" aggiunge un nodo Node2D, "Scena 3D" aggiunge un nodo Spatial, "Interfaccia Utente" aggiunge un nodo Control e "Nodo Personalizzato" permette di scegliere qualunque nodo (quindi è equivalente al tasto "Aggiungi Nodo Figlio"). Puoi anche premere l'icona a forma di stella per mostrare i tuoi nodi preferiti.
ja: (ルートノードを除いて)空のシーンの場合、素早くルートノードをシーンに追加する方法がいくつかシーンドックにあります。例えば「2Dシーン」はNode2Dノードを、「3Dシーン」はSpatialノードを、「ユーザーインターフェイス」はControlノードを、そして「カスタムノード」は好きなノード(この場合は「子ノードを追加」ボタンと一緒です)をそれぞれ追加します。また、星の形のアイコンをを押すことでフェイバリットノードの表示と非表示を切り替えることもできます。
ko: (루트 노드가 없는) 비어있는 씬에서, 씬 독은 씬에 루트 노드를 빠르게 추가하는 여러 설정을 보여줍니다. "2D 씬(2D Scene)"은 Node2D 노드를, "3D 씬(3D Scene)"은 Spatial 노드를, "사용자 인터페이스(User Interface)"는 Control 노드를 추가합니다. 그리고 "맞춤 노드(Custom Node)"는 선택한 아무 노드든지 추가합니다 (즉, "자식 노드 추가하가(Add Child Node)" 버튼을 누른 것과 같습니다). 또한 자주 쓰는 노드를 창에 표시하려면 별 모양 아이콘을 누르면 됩니다.
pt_br: Em uma cena vazia (sem um Nó raiz), o painel de cena mostra varias opções para rapidamente adicionar um Nó a cena. "Cena 2D" adiciona um Nó do tipo Node2D, "Cena 3D" adiciona um Nó do tipo Spatial, "Interface de Usuário" adiciona um Nó do tipo Control, e "Nó Personalizado" deixa que você selecionar qualquer Nó (é equivalente a pressionar o botão "Adicionar Nó Filho"). Você pode também pressionar o botão com formato de estrela para ativar ou desativar a exibição de seus Nós favoritos.
uk: У порожній сцені (без кореневого вузла) панель сцена має кілька варіантів для швидкого додавання кореневого вузла до сцени. "Плоска сцена" додає вузол Node2D (Вузол 2D), "Просторова сцена" додає просторовий вузол, "Інтерфейс користувача" додає вузол керування та "Інший вузол", який дозволяє вибрати будь-який вузол (його вибір еквівалентний натисканню "Додати вузол нащадок" "). Ви також можете натиснути піктограму у формі зірки, щоб увімкнути показ вибраних вузлів.
zh_cn: 在（没有根节点的）空场景中，场景面板会显示一些快速添加根节点的选项。“2D 场景”会添加 Node2D 节点，“3D 场景”会添加 Spatial 节点，“用户界面”会添加 Control 节点，“自定义节点”则会让你自己选择节点类型（所以和点击“添加子节点”按钮的效果是一致的）。点击星形按钮可以切换是否显示收藏的节点。

source: Note that these presets are here for convenience and are not mandatory for the different types of scenes. Not every 3D scene needs a Spatial node as its root node, likewise not every GUI or 2D scene needs a Control node or Node2D as their root node.
cs: Tyto předvolby jsou zde pro lepší přehlednost a nejsou povinné pro různé typy scén. Ne každá 3D scéna potřebuje jako svůj kořenový uzel prostorový uzel, stejně jako ne každá GUI nebo 2D scéna potřebuje jako svůj kořenový uzel řídicí uzel nebo Node2D.
de: Beachte, dass diese Voreinstellungen hier der Einfachheit halber aufgeführt sind und für die verschiedenen Szenentypen nicht zwingend erforderlich sind. Nicht jede 3D-Szene benötigt eine Spatial-Node als Haupt-Node, ebenso wenig wie jede GUI- oder 2D-Szene eine Control-Node oder Node2D als Haupt-Node braucht.
es: Tenga en cuenta que estos ajustes preestablecidos están aquí por conveniencia y no son obligatorios para los diferentes tipos de escenas. No todas las escenas 3D necesitan un nodo espacial como nodo raíz, del mismo modo, no todas las escenas GUI o 2D necesitan un nodo de control o Node2D como nodo raíz.
it: Notare che questi preset sono qui solo per convenienza e non sono obbligatori per i differenti tipi di scena. Non tutte le scene 3D necessitano di un nodo Spatial come nodo base, come anche non tutte le GUI o scene 2D necessitano di un nodo Control o Node2D come loro nodo base.
ja: これらのプリセットは利便性のためにここにあり、シーンの異なる型の為に必ず設定しなければならないわけではなりません。全ての3DシーンがルートノードとしてSpatialノードを必要としているわけではありません。同様に全てのGUIシーンや2Dシーンが、コントロールノードやNode2Dノードをルートノードに必要としているわけではありません。
ko: 이 프리셋은 편의를 위해 있는 것이지 다른 유형의 씬에서까지 필수적인 것은 아닙니다. 모든 3D 씬의 루트 노드가 Spatial 노드인 것이 아닙니다. 마찬가지로 모든 GUI나 2D 씬의 루트 노드가 Control 노드나 Node2D 노드인 것이 아닙니다.
pt_br: Note que estas predefinições estão aqui para sua conveniência e não são obrigatórias para os diferentes tipos de cena. Nem toda Cena 3D necessita de um Nó Spatial como seu Nó raiz, da mesma maneira que nem toda GUI ou Cena 2D necessita de um Nó Control ou Node2D como seus Nós raiz.
ru: Обратите внимание, что эти пресеты приведены здесь для удобства и не являются обязательными для различных типов сцен. Не каждая 3D-сцена должна иметь Spatial (пространственный) узел в качестве корневого, а также не каждый графический интерфейс пользователя или 2D сцена нуждается в Control node (узел управления) или Node2D в качестве корневого узла.
uk: Зауважте, що ці варіанти є тут для зручності і не є обов'язковими для різних типів сцен. Не кожній 3D-сцені потрібен просторовий вузол в якості кореневого, також не кожен графічний інтерфейс, або 2D сцена, потребує вузла управління, або Node2D, в якості кореневого вузла.
zh_cn: 此处的预设仅仅是为了方便，而不是对各类场景的强制要求。不是所有的 3D 场景都要以 Spatial 节点为根节点，同样，GUI 和 2D 场景的根节点也不一定要是 Control 节点和 Node2D 节点。
zh_tw: 這些預設選項只是為了方便而存在的，並非各類場景強制要求的：並不是所有 3D 場景都需要以 Spatial 作為根節點。同樣地，並不是所有圖形界面或 2D 節點都需要以 Control 或 Node2D 作為根節點。

source: Now, to add a label node to this scene you can click on the Custom Node button or the Add Node button at the top. In scenes that aren't empty you use the add node button to create every child node.
it: Ora, per aggiungere un nodo Label a questa scena puoi cliccare sul tasto Nodo Personalizzato o sul tasto Aggiungi Nodo nella parte superiore della finestra. Nelle scene che non sono vuote si usa il tasto Aggiungi Nodo per creare tutti i nodi figli.
ja: 今、このシーンにラベルノードを追加するために、「カスタムノード」ボタンか、上にある「ノードを追加」ボタンををクリックすることができます。空ではないシーンでは子ノードを作る際に「ノードを追加」ボタンを使うことが出来ます。
ko: 그러면 이 씬에 Label 노드를 추가하려면 맞춤 노드(Custom Node)를 클릭하거나 위의 노드 추가하기(Add Node) 버튼을 클릭하세요. 비어있는 씬이 아니라면 노드 추가하기 버튼으로 선택한 노드의 자식 노드를 추가할 수 있습니다.
pt_br: Agora, para adicionar um Nó do tipo Label para esta cena, você pode clicar em Nó Personalizado ou Adicionar Nó Filho na parte superior. Em cenas que não estão vazias, o botão de criar Nós será usado para criar todos os Nós filhos.
uk: Щоб додати вузол Label до цієї сцени, можна натиснути кнопку Інший вузол або кнопку Додати вузол вгорі. У сценах, які не порожні, ви використовуєте кнопку додавання вузла, щоб створити кожен вузол нащадок.
zh_cn: 所以，往这个场景里添加标签节点的话，无论是点击自定义节点按钮，还是点击顶部的添加节点按钮都可以。而如果是往非空场景里添加子节点，就得使用添加节点按钮。

source: This will open the Create Node dialog, showing the long list of nodes that can be created:
cs: Otevře se dialog Vytvořit uzel, kde se zobrazí dlouhý seznam uzlů, které lze vytvořit:
de: Daraufhin öffnet sich der Dialog "Node erstellen", in dem die lange Liste der Nodes angezeigt wird, die erzeugt werden können:
es: Esto abrirá el cuadro de diálogo Crear nuevo nodo, que muestra la larga lista de nodos que se pueden crear:
fi: Tämä avaa Luo solmu -ikkunan, näyttäen pitkän luettelon solmuista, joita voidaan luoda:
fr: Cela ouvrira la boîte de dialogue Créer un nœud, montrant la longue liste des nœuds qui peuvent être créés :
it: Questo aprirá la finestra pop-up Crea nodo con all'interno una lista dei nodi che possono essere creati:
ja: するとノード作成のダイアログが開いて、作成できるノードの長いリストが表示されます:
ko: 그러면 노드 만들기(Create Node) 대화 상자가 열립니다. 만들 수 있는 노드가 길게 나열되어 있죠:
pl: Spowoduje to otwarcie okna dialogowego Utwórz węzeł, pokazującego długą listę węzłów, które można utworzyć:
pt_br: Isso abre o diálogo Criar Nó, mostrando a longa lista de nós que podem ser criados:
ru: Откроется диалоговое окно Создания Узла, показывающее длинный список узлов, которые могут быть созданы:
uk: Це відкриє діалогове вікно Створити вузол, де буде довгий список вузлів, які можна створити:
zh_cn: 这将会打开创建节点对话框，展示了一长串能够被创建的节点列表：
zh_tw: 如此一來會打開新增節點對話框，會顯示一串長長的列表，包含了所有可以建立的節點：

source: From there, select the "Label" node first. Searching for it is probably the fastest way:
cs: Odtud nejprve vyberte uzel „Popisek“. Hledání je pravděpodobně nejrychlejším způsobem:
de: Wählen Sie aus der Liste den "Label"-Node aus. Am schnellsten finden Sie den Node wahrscheinlich durch die Suche:
es: Desde aquí, primero selecciona el nodo "Label". La forma más rápida es buscandolo:
fi: Sieltä, valitse ensin "Label" solmu. Hakeminen on luultavasti nopein tapa löytää se:
fr: Sélectionnez d'abord le nœud "Label". La recherche est probablement le moyen le plus rapide :
it: Dalla lista seleziona il nodo "Label" per prima cosa. Utilizzare la una ricerca é probabilmente il modo piú veloce:
ja: そこからまず「Label」ノードを選択します。検索するのが恐らく一番早いでしょう:
ko: 거기서 "Label" 노드를 먼저 선택하세요. 검색이 가장 빠른 방법일 것입니다:
pl: Z tego poziomu, wybierz węzeł "Etykieta". Najszybciej będzie użyć wyszukiwarki:
pt_br: Nele, selecionamos o nó "Label" (rótulo). Pesquisar por ele é provavelmente o jeito mais rápido:
ru: Здесь выберите узел "Label". Найти его через поиск, вероятно, самый быстрый способ:
uk: Звідти виберіть вузол "Label" (Мітка). Найшвидший спосіб знайти його використати пошуковий рядок:
zh_cn: 在这里，先选择 ``Label`` 节点。直接搜索它可能是最快捷的方式：
zh_tw: 這裡我們先選擇「Label」節點。最快的方法大概就是直接用搜尋的：

source: And finally, create the Label! A lot happens when Create is pressed:
cs: A konečně vytvořte Popisek! Stane se toho opravdu hodně, když stisknete tlačítko Vytvořit:
de: Jetzt nur noch auf "Erstellen" drücken! Nach einem Druck auf die Schaltfläche passiert eine ganze Menge:
es: Y finalmente, ¡crea el nodo Label! Suceden muchas cosas cuando se pulsa Crear:
fi: Ja lopulta, luo Label-solmu! Paljon tapahtuu, kun Luo-painiketta painetaan:
fr: Et enfin, créez le Label ! Il se passe beaucoup de choses lorsque vous appuyez sur Créer :
it: E infine, crea la Label. Molte cose accadono quando si preme il tasto Crea:
ja: 最後に、Labelを作ります！作成ボタンを押したときに、色々なことが起こります:
ko: 마지막으로 Label을 만드세요! 만들기(Create) 버튼을 누르는 순간 많은 일이 일어납니다:
pl: I na koniec, stwórz Label! Wiele dzieje się po naciśnięciu przycisku Utwórz:
pt_br: E, finalmente, criamos o rótulo! Um monte de coisa acontece quando Criar é pressionado:
ru: И наконец, создайте Label! Многое происходит, при нажатии кнопки "Создать":
uk: І нарешті створіть Мітку! Натисніть кнопку Створити. При цьому багато чого трапиться:
zh_cn: 最终，创建了一个标签！当创建按钮被按下时，很多事情就发生了：
zh_tw: 最後，建立 Label！當按下 [建立] 按鈕的時候會發生許多事情：

source: First of all, the scene changes to the 2D editor (because Label is a 2D Node type), and the Label appears, selected, at the top left corner of the viewport.
cs: Nejprve se scéna změní na 2D editor (protože Popisek je typ 2D uzlu) a v levém horním rohu výřezu se zobrazí vybraný popisek.
de: Zunächst einmal wechselt die Szene zum 2D-Editor (da "Label" ein 2D-Node-Typ ist), und das Label erscheint, vorausgewählt, in der oberen linken Ecke des Ansichtsfensters.
es: En primer lugar, la escena cambia al editor 2D (porque Label es un tipo de nodo 2D), y la etiqueta aparece, seleccionada, en la esquina superior izquierda de la ventana de visualización.
fi: Ensinnäkin, skene vaihtuu 2D-editoriin (koska Label on 2D-tyyppinen solmu), ja Label ilmestyy valittuna ikkunan oikeaan yläkulmaan.
fr: Tout d'abord, la scène passe à l'éditeur 2D (parce que Label est un type de nœud 2D), et le Label apparaît, sélectionné, dans le coin supérieur gauche de la fenêtre.
it: Prima di tutto la scena cambia sull'editor 2D (perché Label é un nodo 2D), quindi la Label appare, selezionata, nell'angolo in alto a sinistra dell'area di visualizzazione.
ja: まず初めに、シーンが2Dエディタに切り替わり(Labelは2Dノードのため)、選択された状態でLabelがビューポート左上の角にあらわれます。
ko: 먼저 (Label이 2D 노드 유형이기 때문에) 씬이 2D 편집기로 바뀝니다. 그리고 Label은 선택한 상태로 뷰포트의 왼쪽 위에 나타납니다.
pl: Najpierw widok zmieni się na tryb 2D (ponieważ Label jest typem węzła 2D), a Label pojawi się, wybrany, w lewym górnym rogu widoku.
pt_br: Primeiramente, a cena se altera para o editr 2D (porque Label é um tipo de nó 2D), e então o rótulo aparece, selecionado, no canto superior esquerdo da vista.
ru: В первую очередь, сцена меняется на 2D-редактор (потому что Label является 2D Узлом) и в верхнем левом углу окна просмотра появляется Label.
uk: Перш за все, сцена змінюється на 2D-редактор (оскільки Label - це тип 2D вузла), а Мітка з'являється, вибрана, у верхньому лівому куті вікна перегляду.
zh_cn: 首先，场景更改为2D编辑器(因为标签是一个2D节点类型)，并且标签出现在视图的左上角，处于选中状态。
zh_tw: 首先，場景變成了 2D 編輯器 (因為 Label 是 2D 節點型別)，然後 Label 以選中的狀態出現在畫面檢視區的左上角。

source: The node appears in the scene tree editor (box in the top right corner), and the label properties appear in the Inspector (box in the bottom right corner).
fi: Solmu ilmestyy skenepuun editoriin (oikeassa yläkulmassa oleva laatikko), ja viestin (Label) ominaisuudet ilmestyvät Tarkastelijaan (laatikko oikeassa alakulmassa).
fr: Le nœud apparaît dans l'éditeur de l'arbre de scène (boîte dans le coin supérieur droit), et les propriétés du label apparaissent dans l'inspecteur (boîte dans le coin inférieur droit).
ko: 노드는 씬 트리 편집기에 나타납니다 (오른쪽 위 상자), 그리고 Label 속성은 인스펙터(Inspector)에 나타납니다 (오른쪽 아래 상자).
pl: Węzeł zostanie wyświetlony w edytorze drzewa sceny (pole w prawym górnym rogu), a właściwości Label w inspektorze (pole w prawym dolnym rogu).
pt_br: O nó aparece no editor de árvore da cena (caixa no canto superior direito), e as propriedades do rótulo aparecem no Inspetor (caixa no cano inferior direito).

source: The next step will be to change the "Text" Property of the label. Let's change it to "Hello World":
cs: Dalším krokem bude změna vlastnosti „Text“ popisku. Pojďme to změnit na „Hello World“:
de: Mit dem nächsten Schritt wird die "Text"-Eigenschaft des Labels geändert. Ändern wir es zu "Hello World":
es: El siguiente paso será cambiar la propiedad "Text" de la etiqueta. Vamos a cambiarlo por "¡Hola Mundo!":
fi: Seuraava toimenpide on muuttaa viestin "Text" ominaisuutta. Muutetaanpa siihen "Hello, World":
fr: L'étape suivante sera de modifier la propriété "Text" de l'étiquette. Changeons cela en "Hello, World!" :
it: Il prossimo passo sará quello di cambiare la proprietá "Text" della Label. Cambiamolo in "Hello World":
ja: 次の一歩はLabelの「Text(テキスト)」プロパティを変更することです。「Hello world」に変えてみましょう:
ko: 다음 단계는 Label의 "Text" 속성을 바꾸는 것입니다. Text 속성에 "Hello World!"를 입력해봅시다:
pl: Następnym krokiem będzie zmiana właściwości "Tekst" etykiety. Zmieńmy to na "Witaj Świecie":
pt_br: O próximo passo é mudar a propriedade "Texto" do rótulo. Vamos alterá-la para "Olá, mundo!":
ru: Следующим шагом будет изменение свойства «Text». Изменим его на «Hello, World!»:
uk: Наступним кроком буде зміна властивості мітки "Text". Давайте змінимо її на "Hello World":
zh_cn: 下一步就是去改变标签的 ``文本`` 属性了，我们来把它改成“Hello,World!”：
zh_tw: 下一步我們要修改標籤的「Text (文字)」屬性。來把它改成「Hello World」：

source: Ok, everything's ready to run the scene! Press the PLAY SCENE Button on the top bar (or hit F6):
fi: Ok, kaikki on valmista skenen ajamista varten! Paina yläpalkissa olevaa Pelaa skeneä -painiketta (tai paina F6):
fr: Ok, tout est prêt pour la scène ! Appuyez sur le bouton *Lancer la scène* sur la barre supérieure (ou appuyez sur F6) :
ko: 좋아요. 씬을 실행할 준비가 됐습니다! 상단 메뉴에서 버튼 중 씬 실행(PLAY SCENE) 버튼을 누르세요 (혹은 F6 키를 누르세요):
pl: W porządku, wszystko jest gotowe do otworzenia sceny! Naciśnij przycisk ODTWÓRZ SCENĘ na górnym pasku (lub naciśnij klawisz F6):
pt_br: Certo, tudo está pronto para executar a cena! Pressione o botão RODAR CENA na barra superior (ou pressione F6):

source: Aaaand... Oops.
cs: Aaaand ... Jejda.
de: Uuuund... Ups.
es: y..... Ups!.
fi: Jaaaaa... Hups.
fr: Eeeeet... Oups.
it: Eee... Oops.
ja: すると……あらら。
ko: 그러며언... 어이쿠.
pl: No i... Wpadka.
pt_br: Eeee… Opa.
ru: Ииии... Ой.
uk: Іііі... Упс.
zh_cn: 然后……哎呀。
zh_tw: 然後…… 哎呀。

source: Scenes need to be saved to be run, so save the scene to something like Hello.tscn in Scene -> Save:
cs: Scény je třeba uložit, aby mohly být spuštěny, takže scénu uložte na něco jako Hello.tscn ve scéně -> Uložit:
de: Szenen müssen abgespeichert sein bevor sie ausgeführt werden können. Speichere also die Szene bspw. als "Hello.tscn" in "Szene" -> "Szene speichern" ab:
es: Las escenas se deben guardar antes de ser ejecutadas, así que guarda la escena con un nombre parecido a Hello.tscn en Scene -> Save:
fi: Skenet täytyy tallentaa ennen kuin ne voidaan ajaa, joten tallenna skene joksikin, kuten Hello.tscn, valikossa Skene -> Tallenna skene:
it: Le scene devono essere salvate per essere eseguite, quindi salva la scena con un nome come Hello.tscn in Scena -> Salva Scena:
ja: シーンを動かすにはまず保存する必要があるので、「シーン → シーンを保存」にて Hello.tscn のような名前を付けてから保存してください:
ko: 씬을 실행하려면 저장을 해야 합니다. 따라서 씬(Scene) -> 저장하기(Save)로 가서 Hello.tscn같은 이름을 짓고 씬을 저장하세요:
pl: Żeby uruchomić scenę, musisz ją najpierw zapisać (Scena -> Zapisz). Możesz użyć dowolnej nazwy, np. Witaj.tscn.
pt_br: As cenas precisam ser salvam para serem executadas, então salve-a com um nome tipo Ola.tscn em Cena -> Salvar:
ru: Сцены должны быть сохранены перед запуском, поэтому сохраните сцену, например, как Hello.tscn через меню Сцена -> Сохранить:
uk: Сцени потрібно зберігати перед запуском, тому збережіть сцену, наприклад Hello.tscn, у Сцені -> Зберегти:
zh_cn: 场景需要被保存才能被运行，所以在 :menuselection:`场景(Scene) --> 保存菜单(Save)` 中将场景保存成文件如Hello.tscn：
zh_tw: 場景必須先保存才能執行，所以先到 [場景] -> [保存] 把場景保存成 Hello.tscn 之類的檔案：

source: And here's when something funny happens. The file dialog is a special file dialog, and only allows you to save inside the project. The project root is ``res://`` which means "resource path". This means that files can only be saved inside the project. For the future, when doing file operations in Godot, remember that ``res://`` is the resource path, and no matter the platform or install location, it is the way to locate where resource files are from inside the game.
cs: A tady je, když se stane něco zábavného. Dialogové okno souboru je speciální soborový dialog a umožňuje pouze uložení v rámci projektu. Kořenový adresář projektu je ``res: //``, což znamená "cesta pro zdroje". Tzn. , že soubory lze ukládat pouze uvnitř projektu. Do budoucna při práci se soubory v Godotu, mějte na paměti, že ``res: //`` je cesta ke zdroji, a to bez ohledu na platformu či umístění instalace. Je to prostě způsob, odkazovat na zdrojové soubory z prostředí hry samotné.
de: Und hier tut sich nun etwas Interessantes auf. Der Dateidialog ist ein besonderer Dateidialog, der es Ihnen ermöglicht, ausschließlich innerhalb des Projekts zu speichern. Das Hauptverzeichnis des Projekts ist "res://", was soviel wie "Ressourcenpfad" bedeutet. Das heißt, Dateien können nur innerhalb des Projektes abgespeichert werden. Behalte das bei zukünftigen Dateioperationen immer im Hinterkopf, dass "res://" für den Ressourcenpfad steht und unabhängig von Plattform oder Installationsort stets dafür genutzt wird, um auf Dateien innerhalb des Spiels heraus zuzugreifen.
es: Y aquí es cuando sucede lo divertido. La ventana de archivo, es una ventana especial que sólo permite escribir dentro del proyecto. La raíz del proyecto es "res://" lo que significa "ruta de recursos". Esto quiere decir que los archivos se podrán guardar solamente dentro del proyecto. Desde ahora, cuando se hagan operaciones con archivos en Godot, recuerda que "res://" es la ruta de recursos y no importa la plataforma o lugar de instalación, es el modo de ubicar dónde están los archivos de recursos dentro del juego.
it: E adesso accade qualcosa di buffo. La finestra che mostra i file è una finestra speciale, che ti permette di salvare soltanto all'interno del progetto. La base o radice del progetto è "res://" che significa "cartella delle risorse". Questo vuol dire che i file possono essere salvati solamente all'interno del progetto. In futuro, quando farai operazioni in Godot, ricorda che "res://" è la cartella delle risorse, indipendentemente dalla piattaforma o dal percorso di installazione, questo è il modo per trovare le varie risorse dall'interno del gioco.
ja: ここで変わったことが起こります。これはプロジェクト内にのみ保存が許される、特殊なファイルダイアログです。プロジェクトのルートは ``res://`` で、『リソースのパス』を意味します。これはプロジェクト内にのみに保存できることを意味します。Godotでファイル操作するときは ``res://`` がリソースのパスであることを覚えておきましょう。プラットフォームやインストール場所にかかわらず、ゲーム内にあるリソースファイルを見つけるための手段です。
ko: 그러면 재미난 일이 일어납니다. 파일 대화 상자는 특별하기 때문에, 프로젝트 안에만 저장할 수 있습니다. 프로젝트의 루트는 "res://"로 "리소스 경로(resource path)"를 의미합니다. 즉, 파일은 프로젝트 안에만 저장할 수 있다는 것입니다. 나중에 Godot에서 파일을 관리할 때 "res://"가 리소스 경로라는 사실을 기억하세요. 이것만 안다면 플랫폼의 종류나 설치 경로와 관계없이 게임 내에서 리소스 파일을 찾을 수 있습니다.
pt_br: E aqui é o ponto que algo curioso acontece. O arquivo de diálogo é um especial, e só te permite salvar dentro do projeto. A raiz do projeto é ``res://``, que significa "caminho dos recursos" ("resource path", em inglês). Isso significa que arquivos só podem ser salvos dentro do projeto. No futuro, quando fizer operações com arquivos no Godot, lembre-se de que ``res://`` é o caminho dos recursos, e não importa a plataforma ou o local de instalação, essa é a maneira de localizar onde os arquivos de recursos estão dentro do jogo.
ru: И вот здесь происходит нечто забавное. Файл диалога является файлом и позволяет сохранить его внутри проекта. Корень проекта - "res: //", что означает "путь ресурса". Это означает, что файлы могут быть сохранены только внутри проекта. В будущем, при выполнении файловых операций в Godot, помните, что "res: //" - это путь к ресурсам, вне зависимости от платформы или места установки, это способ найти файлы ресурсов которые находятся внутри игры.
uk: А тут трапляється щось смішне. Діалогове вікно файлів - це спеціальне діалогове вікно файлу, яке дозволяє зберігати лише всередині проекту. Корінь проекту - ``res://`` це означає "шлях до ресурсу". Це означає, що файли можна зберігати лише всередині проекту. Надалі, виконуючи операції з файлами в Godot, пам'ятайте, що "res://" - це шлях до ресурсів, і незалежно від платформи, чи місця установки, це спосіб знайти, де файли ресурсів знаходяться всередині гри.
zh_cn: 然后，有趣的事情发生了。这个文件对话框是一个特别的文件对话框，只允许保存在项目内。项目根目录是 ``res://``，意为“资源路径”（resource path）。这也就意味着，文件只可以被保存到项目的内部。以后，当在Godot进行文件操作的时候，记住 ``res://`` 就是资源的路径，无论哪种平台和安装位置，它都是定位游戏内部的资源文件位置的方式。
zh_tw: 這裡就是有趣的部分了。檔案對話框是一種特別的對話框，只能把東西保存在專案裡面。專案的根目錄是 ``res://``，代表「資源路徑 (Resource Path)」。這表示檔案只能被保存在專案裡面。當以後要在 Godot 裡進行檔案操作的時候，請記得 ``res://`` 就代表資源路徑，而不需要管平台或安裝的位置，這也是在遊戲裡找到資源檔案的方法。

source: After saving the scene and pressing run scene again, the "Hello World" demo should finally execute:
cs: Po uložení scény a opětovném stisknutí spouštěcí scény by se mělo demo Hello Worldkonečně spustit:
de: Nach dem Abspeichern der Szene und nochmaligen Drücken von "Szene starten" sollte die "Hello World"-Demo nun endlich ausgeführt werden:
es: Después de guardar la escena y presionar *reproducir escena* de nuevo, la demo "¡Hola Mundo!" se ejecutará finalmente:
fi: Tallennettuasi skenen ja painettuasi uudelleen Pelaa, "Hello World" esimerkin pitäisi viimein toimia:
fr: Après avoir sauvegardé la scène et appuyé de nouveau sur Lancer la scène, la démo "Hello, World!" devrait enfin s'exécuter :
it: Dopo aver salvato la scena ed aver premuto esegui scena di nuovo, il demo "Hello World" dovrebbe finalmente partire:
ja: シーンを保存してから、シーン再生をまた押すと、ついに「Hello World」のデモが動くはずです:
ko: 씬을 저장하고 씬을 다시 실행하면, 마침내 "Hello World" 데모가 실행될 것입니다:
pl: Po zapisaniu sceny i naciśnięciu "Uruchom Scenę" ponownie, demo "Witaj Świecie!" powinno działać:
pt_br: Depois de salvar a cena e pressionar para rodar a cena de novo, a demonstração "Olá, mundo!" deve finalmente executar:
ru: После сохранения сцены и повторного ее запуска, демка "Hello, World!" должна, наконец, запуститься:
uk: Після збереження сцени та повторного її відтворення демонстрація "Hello World" повинна нарешті виконатися:
zh_cn: 在保存场景并再一次按下运行场景之后，“Hello World”演示示例应该最终被执行了：
zh_tw: 保存場景後再點擊一次執行場景，「Hello World」範例應該終於執行了：
