Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scene_tree.po
Languages: fr, ko, pt_br, ru, zh_cn

source: SceneTree
fr: L'arbre de scène
pt_br: Árvore de cena
ru: Дерево сцены
zh_cn: 场景树

source: This is where things start getting abstract, but don't panic. There's not much more depth than this.
fr: C'est là où les choses comment à devenir floues, mais ne paniquez pas. Ce n'est pas si complexe que ça.
ko: 여기서 내용이 추상적으로 되기 시작합니다, 하지만 당황하지 마세요. 여기보다 훨씬 더 깊게 보는 곳은 없습니다.
pt_br: É aqui que as coisas começam a ficar abstratas, mas não entre em pânico. Não há muito mais profundidade do que isso.
zh_cn: 这就是事情开始变得抽象的地方, 但不要慌张。没有比这更深入的了。

source: In previous tutorials, everything revolved around the concept of nodes. Scenes are simply a collection of nodes. They become active once they enter the *scene tree*.
fr: Dans le tutoriel précédent, chaque chose tournais autour du concept des nœuds. Chaque scène est simplement une collection de nœud. Elles deviennent actives une fois entrée dans *l'arbre de scène*.
ko: 이전 튜토리얼에서, 모든 것은 노드 개념을 중심으로 돌아갔습니다. 씬은 간단히 노드의 집합입니다. 그들이 *씬 트리(scene tree)* 에 들어가면 활성화됩니다.
pt_br: Nos tutoriais anteriores, tudo girava em torno do conceito de nós. Cenas são simplesmente uma coleção de nós. Elas se tornam ativos quando entram na * árvore de cena *.
zh_cn: 在前面的教程中, 一切都围绕节点的概念展开。场景只是节点的集合。一旦进入 *场景树* , 它们就会被激活。

source: This concept deserves going into a little more detail. In fact, the scene system is not even a core component of Godot as it is possible to skip it and write a script (or C++ code) that talks directly to the servers, but making a game that way would be a lot of work.
fr: Ce concept mérite de se pencher dessus dans le détail. En fait, le système de gestion de scènes ne fait même pas partie des composants de base de Godot car il est possible de ne pas s'en occuper et d'écrire un script (éventuellement du code C++) qui discute directement avec les serveurs, mais fabriquer un jeu de cette façon demanderait beaucoup de travail.
ko: 이 개념은 조금 더 자세히 설명할 가치가 있습니다. 사실, 씬 시스템은 Godot의 핵심 구성 요소도 아니기에 넘어가서 바로 서버와 직접 대화하는 스크립트를 (혹은 C++ 코드를) 쓸 수 있습니다, 하지만 그런 방식으로 게임을 만드는 일은 많은 작업이 될 것입니다.
zh_cn: 这个概念值得更详细一些。事实上, 场景系统甚至不是Godot的核心组件, 因为可以跳过它, 编写一个直接与服务器对话的脚本 (或 C++ 代码), 但以这种方式制作游戏将是一项大量的工作。

source: MainLoop
fr: Boucle événementielle
pt_br: Loop principal
zh_cn: 主循环

source: The way Godot works internally is as follows. There is the :ref:`OS <class_OS>` class, which is the only instance that runs at the beginning. Afterwards, all drivers, servers, scripting languages, scene system, etc are loaded.
fr: La façon dont Godot fonctionne en interne est la suivante : Au départ, la seule instance qui fonctionne est la classe :ref:`OS <class_OS>`, ensuite, tous les pilotes, serveurs, langages de script, système de gestion de scènes ... sont chargés.
ko: Godot가 내부적으로 작동되는 과정은 다음과 같습니다. :ref:`OS <class_OS>` 클래스는 처음에 실행되는 유일한 인스턴스 입니다. 그 이후에, 모든 드라이버, 서버, 스크립트 언어, 씬 시스템 등을 불러옵니다.
ru: То, как Godot работает внутри, выглядит следующим образом. Существует класс :ref:`OS <class_OS>`, который является единственным экземпляром, запускаемым в самом начале. После этого загружаются все драйверы, серверы, скриптовые языки, система сцен и т.д.
zh_cn: Godot内部的工作方式如下所示。有 :ref:`OS <class_OS>` 类, 它是在开始时运行的唯一实例。之后, 加载所有驱动程序、服务器、脚本语言、场景系统等。

source: When initialization is complete, :ref:`OS <class_OS>` needs to be supplied a :ref:`MainLoop <class_MainLoop>` to run. Up to this point, all this is internals working (you can check main/main.cpp file in the source code if you are ever interested to see how this works internally).
fr: Quand l'initialisation est terminée, une :ref:`MainLoop <class_MainLoop>`doit être fournie à :ref:`OS <class_OS>` pour fonctionner. Jusqu'à ce point, tout ceci est du fonctionnement interne (vous pouvez consulter le fichier main/main.cpp dans le code source si jamais vous ètes intéressé de voir comment cela fonctionne en interne).
ko: 초기화를 마칠 때, :ref:`OS <class_OS>` 를 실행하기 위해 :ref:`MainLoop <class_MainLoop>` 가 공급되어야 합니다. 여기까지, 이 모든 것이 내부 작업입니다 (어떻게 내부 작업이 이루어지는지 관심이 있으시다면, 소스 코드의 main/main.cpp 파일에서 이를 확인하실 수 있습니다).
pt_br: Quando a inicialização estiver completa,: ref: `OS <class_OS>` precisa ser fornecido a: ref: `MainLoop <class_MainLoop>` para ser executado. Até este ponto, tudo isso é funcionamento interno (você pode verificar o arquivo main / main.cpp no código-fonte, se você estiver interessado em ver como isso funciona internamente).
zh_cn: 初始化完成后, 需要向 :ref:`OS <class_OS>` 提供一个 :ref:`MainLoop <class_MainLoop>` 来运行。到目前为止, 所有这些都是内部工作 (您可以检查main/main.cpp文件在源代码中, 如果您曾经有兴趣看到它是如何在内部工作)。

source: The user program, or game, starts in the MainLoop. This class has a few methods, for initialization, idle (frame-synchronized callback), fixed (physics-synchronized callback), and input. Again, this is low level and when making games in Godot, writing your own MainLoop seldom makes sense.
fr: Le programme utilisateur, ou le jeu, démarre dans la boucle événementielle. Cette classe a quelques méthodes, pour l'initialisation, l'inactivité (rappel synchronisé par trame), fixe (rappel synchronisé par la physique) et les entrées. Encore une fois, ceci est bas niveau et lorsque vous créez des jeux avec Godot, écrire votre propre boucle événementielle a rarement du sens.
ko: 사용자 프로그램, 게임은 MainLoop에서 시작합니다. 이 클래스는 몇 가지 메소드를 갖고 있는데, 초기화, 휴식(Idle)(프레임 동기화된 콜백), 고정된(fixed)(물리 동기화된 콜백), 그리고 입력입니다. 이것은 로우 레벨이며, Godot에서 게임을 만들 때 당신만의 MainLoop를 만드는 일은 드뭅니다.
pt_br: O programa do usuário, ou jogo, inicia no MainLoop. Essa classe tem alguns métodos, para inicialização, ocioso (retorno de chamada com sincronia de quadros), fixo (retorno de chamada com sincronização física) e entrada. Novamente, isso é de baixo nível e ao fazer jogos na Godot, escrever seu próprio MainLoop raramente faz sentido.
zh_cn: 用户程序或游戏从主循环开始。此类有几个方法, 用于初始化、空闲 (框架同步回调)、固定 (物理同步回调) 和输入。同样, 这是低级别的, 在Godot中制作游戏时, 编写自己的主循环意义不大。

source: One of the ways to explain how Godot works is that it's a high level game engine over a low level middleware.
fr: L'un des manières d'expliquer comment Godot fonctionne est qu'il est un moteur de jeu de haut niveau, construit par-dessus un middleware de bas niveau.
ko: Godot가 어떻게 작동하는지 설명하는 방법으로 이것은 로우 레벨 미들웨어에 비해 높은 수준의 게임 엔진이란 것입니다.
ru: Один из способов объяснить, как работает Godot, звучит так: это высокоуровневый игровой движок над низкоуровневым промежуточным ПО.
zh_cn: 解释Godot如何工作的方法之一是, 它是一个高级的游戏引擎, 超过了一个低级中间件。

source: The scene system is the game engine, while the :ref:`OS <class_OS>` and servers are the low level API.
fr: Le système de gestion de scènes et le "game engine" proprement dit tandis que la :ref:`OS <class_OS>` et les serveurs font partis de l'API de bas niveau.
ko: 씬 시스템은 게임 엔진입니다, 반면에 :ref:`OS <class_OS>` 와 서버는 로우 레벨 API입니다.
pt_br: O sistema de cena é o mecanismo do jogo, enquanto o: ref: `OS <class_OS>` e os servidores são a API de baixo nível.
ru: Система сцены является игровым движком, в то время как :ref:`OS <class_OS>` и сервера являются API низкого уровня.
zh_cn: 场景系统是游戏引擎, 而 :ref:`OS <class_OS>` 和服务器是低级API。

source: In any case, the scene system provides its own main loop to OS, :ref:`SceneTree <class_SceneTree>`. This is automatically instanced and set when running a scene, no need to do any extra work.
fr: Dans tous les cas, le système de scène fournit sa propre boucle principale à l'OS, :ref:`SceneTree <class_SceneTree>`. Ceci est automatiquement instancié et configuré lors de l'exécution d'une scène, aucun travail supplémentaire est nécessaire.
ko: 어쨌든, 씬 시스템은 고유의 메인 루프(main loop)인, :ref:`SceneTree <class_SceneTree>` 를 OS로 보냅니다. 이것은 자동으로 씬이 실행되는 동안 자동으로 인스턴스 되고 설정됩니다, 다른 추가 작업은 필요가 없습니다.
pt_br: Em qualquer caso, o sistema de cena fornece seu próprio loop principal para o SO,: ref: `SceneTree <class_SceneTree>`. Isso é automaticamente instanciado e definido ao executar uma cena, sem necessidade de qualquer trabalho extra.
zh_cn: 在任何情况下, 场景系统都为操作系统 :ref:`SceneTree <class_SceneTree>` 提供了自己的主循环。这是在运行场景时自动进行实例化和设置的, 无需执行任何额外的工作。

source: It's important to know that this class exists because it has a few important uses:
fr: Il est important de savoir que cette classe existe car elle a des utilisations importantes :
ko: 이 클래스가 몇 가지 중요한 용도에 쓰이기 때문에 존재하는 것을 알아야 합니다:
pt_br: É importante saber que essa classe existe porque tem alguns usos importantes:
ru: Важно знать, о существовании этого класса, так как он имеет несколько важных применений:
zh_cn: 重要的是要知道此类的存在, 因为它有几个重要的用途:

source: It contains the root :ref:`Viewport <class_Viewport>`, to which a scene is added as a child when it's first opened to become part of the *Scene Tree* (more on that next)
fr: Elle contient la racine :ref:`Viewport <class_Viewport>`, à laquelle une scène est ajoutée en tant qu'enfant lorsqu'elle est ouverte pour la première fois, afin de faire partie de l'arborescence de scène (*Scene Tree*) (plus d'informations là-dessus par la suite)
ko: 처음 열렸을 때 *씬 트리* 의 일부분이 되도록 씬이 자식으로 추가되는, 루트 :ref:`Viewport <class_Viewport>` 를 포함합니다, (자세한 설명은 다음에)
zh_cn: 它包含根 :ref:`Viewport <class_Viewport>`, 当场景第一次打开时, 场景将作为子对象添加到其中 (接下来会有更多)

source: It contains information about the groups and has the means to call all nodes in a group or get a list of them.
fr: Elle contient des informations sur les groupes et permet d'appeler tous les nœuds d'un groupe ou d'obtenir une liste de ceux-ci.
ko: 그룹에 관한 정보를 포함하고 그룹의 모든 노드를 호출하거나 그룹의 목록을 가져옵니다.
ru: Он содержит информацию о группах и позволяет вызывать все узлы в группе или получать список этих узлов.
zh_cn: 它包含有关组的信息, 并具有调用组中的所有节点或获取它们的列表的方法。

source: It contains some global state functionality, such as setting pause mode or quitting the process.
fr: Elle contient certaines fonctionnalités d'état global, comme le réglage du mode pause ou l'abandon du processus.
ko: 일시 정지 모드 설정이나 프로세스 종료하기와 같은, 일부 전역 상태 기능성을 포함합니다.
ru: Он содержит некоторые глобальные функции состояния, такие как режим паузы или выход.
zh_cn: 它包含一些全局状态功能, 如设置暂停模式或退出进程。

source: When a node is part of the Scene Tree, the :ref:`SceneTree <class_SceneTree>` singleton can be obtained by simply calling :ref:`Node.get_tree() <class_Node_method_get_tree>`.
fr: Lorsqu'un nœud fait partie de l'arbre des scènes, le singleton :ref:`SceneTree <class_SceneTree>` peut être obtenu en appelant simplement :ref:`Node.get_tree() <class_Node_Node_get_tree>`.

source: Root viewport
fr: La fenêtre d'affichage racine
ko: 루트 뷰포트(Root viewport)
pt_br: Viewport raiz
ru: Корневое окно
zh_cn: 根视区

source: The root :ref:`Viewport <class_Viewport>` is always at the top of the scene. From a node, it can be obtained in two different ways:
fr: La racine :ref:`Viewport <class_Viewport>` est toujours en haut de la scène. A partir d'un nœud, elle peut être obtenu de deux manières différentes :
ko: 루트 :ref:`Viewport <class_Viewport>` 는 항상 씬의 맨 위에 있습니다. 노드에서, 두 가지 다른 방법으로 포함할 수 있습니다:
pt_br: A raiz: ref: `Viewport <class_Viewport> está sempre no topo da cena. De um nó, ele pode ser obtido de duas maneiras diferentes:
ru: Корневой :ref:`Viewport <class_Viewport>` всегда находится в верхней части сцены. Из узла его можно получить двумя разными способами:
zh_cn: 根 :ref:`Viewport <class_Viewport>` 始终位于场景的顶部。从节点中, 可以通过两种不同的方式获得它:

source: This node contains the main viewport, anything that is a child of a :ref:`Viewport <class_Viewport>` is drawn inside of it by default, so it makes sense that the top of all nodes is always a node of this type otherwise nothing would be seen!
fr: Ce nœud contient la vue principale, tout ce qui est un enfant d'un :ref:`Viewport <class_Viewport>` est dessiné à l'intérieur de celui-ci par défaut, il est donc logique que le nœud en amont de tous les autres soit toujours un nœud de ce type, sinon rien ne serait vu !
ko: 이 노드는 메인 뷰포트를 갖고 있습니다, 어떤 것이든 :ref:`Viewport <class_Viewport>` 의 자식으로 기본적으로 안에 있습니다, 그래서 모든 노드의 맨 위에는 이 노드가 있고 그렇지 않다면 아무것도 볼 수 없을 것입니다!
zh_cn: 此节点包含主视区, 默认情况下, 任何作为 :ref:`Viewport <class_Viewport>` 子视区的内容都将在其中绘制, 因此, 所有节点的顶部始终是此类型的节点是有意义的, 否则不会看到任何内容！

source: While other viewports can be created in the scene (for split-screen effects and such), this one is the only one that is never created by the user. It's created automatically inside SceneTree.
fr: Alors que d'autres fenêtres d'affichage peuvent être créées dans la scène (pour des effets d'écran partagé et autres), celle-ci est la seule qui n'est jamais créée par l'utilisateur. Elle est créée automatiquement à l'intérieur de SceneTree.
ko: 반면에 다른 뷰포트는 씬에서 만들 수 있지만(분리 화면 효과와 같은 것을 위해), 사용자가 절대 만들 수 없는 유일한 것입니다. 씬 트리에서 자동으로 생성됩니다.
pt_br: Enquanto outras viewports podem ser criadas na cena (para efeitos de tela dividida e tal), esta é a única que nunca é criada pelo usuário. É criado automaticamente dentro do SceneTree.
ru: В то время как в сцене могут быть созданы другие видовые окна (для эффекта раздельного экрана и т.д.), это единственное окно, которое никогда не создается пользователем. Он создается автоматически внутри SceneTree.
zh_cn: 虽然可以在场景中创建其他视区 (用于拆分屏幕效果等), 但这是唯一一个从未由用户创建的视区。它是在“场景树”内自动创建的。

source: Scene tree
fr: Arbre de scène
ko: 씬 트리
pt_br: Árvore de cena
ru: Дерево сцены
zh_cn: 场景树

source: When a node is connected, directly or indirectly, to the root viewport, it becomes part of the *scene tree*.
fr: Lorsqu'un nœud est connecté, directement ou indirectement, à la vue racine, il fait partie de l'arborescence des scènes.
ko: 노드가 뷰포트에 연결될 때, 직접적이든 아니든, 그것은 *씬 트리* 의 일부분이 됩니다.
pt_br: Quando um nó é conectado, direta ou indiretamente, à viewport raiz, ele se torna parte da * árvore de cena *.
ru: Когда узел прямо или косвенно связан с корневым окном, он становится частью *дерева сцены*.
zh_cn: 当节点直接或间接连接到根视区时, 它将成为 *场景树* 的一部分。

source: This means that as explained in previous tutorials, it will get the _enter_tree() and _ready() callbacks (as well as _exit_tree()).
fr: Cela signifie que, comme expliqué dans les tutoriels précédents, il recevra les rappels de _enter_tree() et _ready() (ainsi que _exit_tree()).
ko: 이전 튜토리얼에서 설명했듯이, 그것은 (_exit_tree()과 마찬가지로) _enter_tree()와 _ready() 콜백을 가질 것입니다.
ru: Это означает, что, как объяснялось в предыдущих уроках, он получит обратные вызовы _enter_tree() и _ready(), (а также _exit_tree()).
zh_cn: 这意味着, 正如在前面的教程中所解释的, 它将得到 _enter_tree() 和 _ready() 回调 (以及_exit_tree())。

source: When nodes enter the *Scene Tree*, they become active. They get access to everything they need to process, get input, display 2D and 3D, notifications, play sound, groups, etc. When they are removed from the *scene tree*, they lose access.
fr: Lorsque les nœuds entrent dans l'*arbre de scène*, ils deviennent actifs. Ils ont accès à tout ce dont ils ont besoin pour traiter, obtenir des entrées, afficher des données en 2D et 3D, des notifications, jouer du son, des groupes, etc. Lorsqu'ils sont retirés de l'*arbre de scène*, ils perdent cet accès.
ko: 노드가 *씬 트리* 에 들어오게 되면, 활성화됩니다. 그들은 프로세스, 입력, 2D와 3D 디스플레이, 알림, 소리 재생, 그룹 등 필요로 하는 모든 것을 액세스 합니다. 그들이 *씬 트리* 에서 제거될 때, 액세스를 잃습니다.
pt_br: Quando os nós entram na * Scene Tree *, eles se tornam ativos. Eles têm acesso a tudo o que precisam para processar, obter entrada, exibir 2D e 3D, notificações, reproduzir sons, grupos etc. Quando são removidos da * árvore de cena *, eles perdem o acesso.
zh_cn: 当节点进入 *场景树* 时, 它们将变为活动状态。他们可以访问处理、获取输入、显示2d 和3d、通知、播放声音、组等所需的一切。当它们从 *场景树* 中删除时, 它们将失去访问权限。

source: Tree order
fr: Ordre de l'arborescence
ko: 트리 순서
pt_br: Ordem da árvore
ru: Последовательность в древе
zh_cn: 树顺序

source: Most node operations in Godot, such as drawing 2D, processing, or getting notifications are done in tree order. This means that parents and siblings with a smaller rank in the tree order will get notified before the current node.
fr: La plupart des opérations de nœuds dans Godot, comme le dessin 2D, le traitement ou l'obtention de notifications se font dans l'ordre de l'arborescence. Cela signifie que les parents et les frères et sœurs ayant un rang inférieur dans l'ordre de l'arborescence seront notifiés avant le nœud courant.
ko: 2D 그리기, 프로세싱, 혹은 알림과 같은 대부분의 노드 운영은 트리 순서에서 완료됩니다. 이는 트리 순서에서 부모와 더 낮은 등급의 형제 노드들이 현재 노드 이전에 알림을 받을 것을 의미합니다.
zh_cn: Godot中的大多数节点操作 (如绘制2d、处理或获取通知) 都是按树顺序完成的。这意味着在树顺序中排名较小的家长和兄弟姐妹将在当前节点之前收到通知。

source: "Becoming active" by entering the *Scene Tree*
fr: "Activation" en entrant dans l'*arbre de scène*
ko: *씬 트리* 에 들어가서 "활성화하기"
pt_br: "Tornando-se ativo" entrando na * Scene Tree *
ru: "Становится активным", войдя в *Древо Сцен*
zh_cn: 通过进入 *场景树* "被激活"

source: A scene is loaded from disk or created by scripting.
fr: Une scène est chargée à partir du disque ou créée par un script.
ko: 씬은 디스크에서 불러오거나 스크립트에 의해 만들어집니다.
pt_br: Uma cena é carregada do disco ou criada pelo script.
ru: Сцена загружается с диска или создается с помощью скрипта.
zh_cn: 场景是从磁盘加载或通过脚本创建的。

source: The root node of that scene (only one root, remember?) is added as either a child of the "root" Viewport (from SceneTree), or to any child or grandchild of it.
fr: Le nœud racine de cette scène (une seule racine, vous souvenez-vous ?) est ajouté soit comme un enfant de la fenêtre d'affichage Viewport "racine" (de SceneTree), soit à tout enfant ou petit-enfant de celle-ci.
ko: 씬의 루트 노드 (단 하나의 루트, 기억하시나요?) 는 "루트" 뷰포트의 자식으로, 혹은 노드의 자식으로 (씬 트리에서) 추가됩니다.
zh_cn: 该场景的根节点 (只记得一个根节点？) 被添加为“根”视区 (从场景树) 的子节点, 或添加到该场景的任何子节点或孙子。

source: Every node of the newly added scene, will receive the "enter_tree" notification ( _enter_tree() callback in GDScript) in top-to-bottom order.
fr: Chaque nœud de la scène nouvellement ajoutée recevra la notification "enter_tree" (fonction de rappel _enter_tree() dans GDScript) dans l'ordre haut vers bas.
ko: 새롭게 추가되는 씬의 각 노드는, 위에서 아래 순으로 "enter_tree" 알림을 (GDScript에서 _enter_tree() 콜백을) 받습니다.
pt_br: Cada nó da cena recém-adicionada receberá a notificação "enter_tree" (callback _enter_tree () no GDScript) na ordem de cima para baixo.
ru: Каждый узел новой добавленной сцены получит уведомление "enter_tree" (обратный вызов _enter_tree() в GDScript) в порядке сверху вниз.
zh_cn: 新添加的场景的每个节点都将按从上到底顺序收到“enter_tree”通知(GDScript中的 _enter_tree 回调)。

source: An extra notification, "ready" ( _ready() callback in GDScript) is provided for convenience, when a node and all its children are inside the active scene.
fr: Une notification supplémentaire, "ready" (fonction de rappel _ready() dans GDScript) est fournie par commodité, lorsqu'un nœud et tous ses enfants sont à l'intérieur de la scène active.
ko: 추가 알림으로, 노드와 모든 자식이 활성화된 씬 안에 있을 때, "ready"가 (GDScript에서는 _ready() 콜백이) 편의로 제공됩니다.
pt_br: Uma notificação extra, "ready" (retorno de chamada _ready () no GDScript) é fornecida por conveniência, quando um nó e todos os seus filhos estão dentro da cena ativa.
ru: Дополнительное уведомление, "ready" (обратный вызов _ready() в GDScript ), предоставляется для удобства, когда узел и все его дети находятся внутри активной сцены.
zh_cn: 当节点及其所有子节点位于活动场景中时, 为方便起见, 提供了一个额外的通知, 即“ready”(GDScript中的 _ready() 回调)。

source: When a scene (or part of it) is removed, they receive the "exit scene" notification ( _exit_tree() callback in GDScript) in bottom-to-top order
fr: Quand une scène (ou une partie de celle-ci) est enlevée, ils reçoivent la notification "exit scene" (fonction de rappel _exit_tree() dans GDScript), du nœud le plus bas vers celui le plus haut
ko: 씬(이나 일부분)이 제거될 때, 그들은 아래에서 위 순으로 "exit scene" 알림을 (GDScript에서는 _exit_tree() 콜백을) 받습니다
pt_br: Quando uma cena (ou parte dela) é removida, eles recebem a notificação "exit scene" (retorno de chamada _exit_tree() na GDScript) na ordem de baixo para cima
ru: Когда сцена (или ее часть) удалена, они получают уведомление "exit scene" (обратный вызов _exit_tree() в GDScript) в порядке снизу вверх
zh_cn: 删除场景 (或其中一部分) 后, 它们将按从下到上的顺序收到“退出场景”通知(GDScript中的 _exit_tree() 回调)

source: Changing current scene
fr: Changement de la scène courante
ko: 현재 씬 변경하기
pt_br: Alterando a cena atual
ru: Смена текущей сцены
zh_cn: 更改当前场景

source: After a scene is loaded, it is often desired to change this scene for another one. The simple way to do this is to use the :ref:`SceneTree.change_scene() <class_SceneTree_method_change_scene>` function:
fr: Après qu'une scène soit chargée, il est souvent souhaitable de la remplacer par une autre. La façon la plus simple de le faire est d'utiliser la fonction :ref:`SceneTree.change_scene() <class_SceneTree_method_change_scene>` :

source: Rather than using file paths, one can also use ready-made :ref:`PackedScene <class_PackedScene>` resources using the equivalent function :ref:`SceneTree.change_scene_to(PackedScene scene) <class_SceneTree_method_change_scene_to>`:
fr: Au lieu d'utiliser des chemins de fichiers, vous pouvez aussi utiliser la ressource déjà prête :ref:`PackedScene <class_PackedScene>` en utilisant la fonction équivalente :ref:`SceneTree.change_scene_to(PackedScene scene) <class_SceneTree_method_change_scene_to>` :

source: These are quick and useful ways to switch scenes but have the drawback that the game will stall until the new scene is loaded and running. At some point in your game, it may be desired to create proper loading screens with progress bar, animated indicators or thread (background) loading. This must be done manually using autoloads (see next chapter!) and :ref:`doc_background_loading`.
fr: c'est un moyen rapide de passer d'une scène à une autre mais qui a l'inconvénient suivant : le jeu va devoir attendre jusqu'à ce que la nouvelle scène soit chargée et fonctionne. À un moment donné, dans votre jeu, vous souhaiterez peut-être créer des écrans de chargement avec des barres de progression ou d'autres façons d'indiquer des chargements en tâche de fond. Cela doit être fait manuellement en utilisant des "autoloads" (voir le chapitre suivant !) et :ref:`doc_background_loading`.
zh_cn: 这是一个快速和有用的方式来切换场景, 但有一个缺点, 游戏将停止, 直到新的场景加载并运行。在游戏中的某个时刻, 可能需要创建适当的加载屏幕, 其中包含进度条、动画指示器或线程 (后台) 加载。这必须使用自动加载手动完成 (请参阅下一章) 和 :ref:`doc_background_loading` 。

source: Introduction
ko: 소개
pt_br: Introdução
ru: Введение
zh_cn: 简介

source: When a node is part of the Scene Tree, the :ref:`SceneTree <class_SceneTree>` singleton can be obtained by simply calling :ref:`Node.get_tree() <class_Node_get_tree>`.
ko: 노드가 씬 트리의 일부분일 때, :ref:`SceneTree <class_SceneTree>` 싱글톤(Singleton)은 간단히 :ref:`Node.get_tree() <class_Node_get_tree>` 를 호출해서 포함될 수 있습니다.
pt_br: Quando um nó é parte da Scene Tree, o singleton: ref: `SceneTree <class_SceneTree> pode ser obtido simplesmente chamando: ref:` Node.get_tree () <class_Node_get_tree> `.

source: After a scene is loaded, it is often desired to change this scene for another one. The simple way to do this is to use the :ref:`SceneTree.change_scene() <class_SceneTree_change_scene>` function:
ko: 씬이 불러온 후, 그것을 다른 씬으로 바꾸고 싶을 수 있습니다. 간단한 방법으로 :ref:`SceneTree.change_scene() <class_SceneTree_change_scene>` 함수를 사용하는 것입니다:
pt_br: Depois que uma cena é carregada, muitas vezes é desejado mudar essa cena para outra. A maneira simples de fazer isso é usar a função: ref: `SceneTree.change_scene () <class_SceneTree_change_scene>`:
