Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scenes_and_nodes.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Scenes and nodes
cs: Scény a uzly
de: Szenen und Nodes
es: Escenas y nodos
fi: Skenet ja solmut
fr: Des scènes et des nœuds
it: Scene e nodi
ja: シーンとノード
ko: 씬과 노드(Scenes and nodes)
pl: Sceny i węzły
pt_br: Cenas e nós
ru: Сцены и узлы
uk: Сцени та вузли
zh_cn: 场景与节点
zh_tw: 場景與節點

source: Introduction
cs: Úvod
de: Einführung
es: Introducción
fi: Johdanto
it: Introduzione
ja: はじめに
ko: 소개
pl: Wprowadzenie
pt_br: Introdução
ru: Введение
uk: Вступ
zh_cn: 简介
zh_tw: 簡介

source: Imagine for a second that you are not a game developer anymore. Instead, you're a chef! Change your hipster outfit for a toque and a double breasted jacket. Now, instead of making games, you create new and delicious recipes for your guests.
cs: Představ si na chvilku, že nejsi herní vývojář. Jsi prostě kuchař! Vyměň jsi svůj hipsterský obleček za kuchařský čepec a dvouřadé sako. Teď, místo vytváření her, tvoříš nové a chutné recepty pro své hosty.
de: Stell Sie sich für einen Moment vor, Sie wären kein Spieleentwickler mehr. Stattdessen sind Sie ein Koch! Tauschen Ihr Hipster-Outfit gegen eine Kochmütze und eine Zweireiher-Jacke aus. Statt Spiele zu erstellen, kreieren Sie jetzt neue und leckere Rezepte für Ihre Gäste.
es: Imagina por un segundo que no eres un desarrollador de juegos. En su lugar, eres un chef! Cambia tu atuendo de hipster por un gorro y una chaqueta de botones dobles. Ahora, en lugar de hacer juegos, creas nuevas y deliciosas recetas para tus invitados.
fi: Kuvittele hetki, ettet ole enää pelisuunnittelija. Sen sijaan, olet kokki! Vaihda hipsteriasusi kokinhattuun ja kaksirivinapitettuun kokintakkiin. Nyt, sen sijaan että tekisit pelejä, luotkin uusia ja herkullisia reseptejä asiakkaillesi.
fr: Imaginez une seconde que vous n'êtes plus développeur de jeux. Au lieu de cela, vous êtes un chef ! Changez votre tenue de hipster pour une toque et une veste croisée. Maintenant, au lieu de faire des jeux, vous créez de nouvelles et délicieuses recettes pour vos invités.
it: Immagina per un attimo di non essere più uno sviluppatore di giochi. Invece, sei un cuoco! Cambia il tuo abito da hipster con un cappello bianco ed un grembiule. Ora, invece di fare giochi, crei nuove e deliziose ricette per i tuoi ospiti.
ja: ちょっとの間、ゲーム開発者でない自分を想像してみてください。代わりにあなたは今、シェフです！ヒップスターの服から、コック帽とダブル仕立てのジャケットに着替えましょう。これからゲームをつくる代わりに、ゲストのために新たに美味しいレシピを考えるのです。
ko: 한번 당신이 더 이상 게임 개발자가 아니라고 상상해보세요. 이제 당신은 셰프입니다! 힙스터 복장을 벗어 던지고 토크와 더블 브레스트 재킷을 입는다고요. 이제 게임을 만드는 게 아니라, 손님을 위해 새롭고 맛있는 레시피를 만드는 것입니다.
pl: Wyobraź sobie przez chwilę, że nie jesteś już twórcą gier. Zamiast tego jesteś szefem kuchni! Zmień swój strój na strój kucharza. Teraz zamiast tworzyć gry, tworzysz nowe i pyszne przepisy dla swoich gości.
pt_br: Imagine por um momento que você não é um desenvolvedor de jogos mais. Em vez disso, você é um chef! Troque sua roupa comum por um daqueles longos chapéus e uma daquelas camisas de abotoamento duplo. Agora, no lugar de jogos, você cria novas e deliciosas receitas para seus convidados.
ru: Забудьте на минуту, что вы – разработчик видеоигр и вместо этого представьте себя в роли шеф-повара! Скиньте с себя хипстерский фасон и вместо этого наденьте поварской колпак и жакет. Теперь все, что от вас требуется – это создавать новые и вкусные рецепты для ваших гостей.
uk: Уявіть на секунду, що ви більше не розробник ігор. Натомість ви шеф-кухар! Змініть ваш наряд хіпстера на кухарський ковпак і двобортну куртку. Тепер, замість того, щоб створювати ігри, ви створюєте нові смачні рецепти для своїх гостей.
zh_cn: 试想一下您不再是一个游戏开发者。相反地，您是一位厨师！把您时髦的着装换成无檐帽和双排扣夹克。现在，您是在为您的客人打造一个美味的菜谱而不是在做游戏。
zh_tw: 稍微想像一下自己不再是遊戲開發者，而成為一名廚師了！把時髦的穿著換成廚師帽跟雙釦夾克。現在，不做遊戲了，來為客人們設計一道全新的美味料理食譜。

source: So, how does a chef create a recipe? Recipes are divided into two sections: the first is the ingredients and the second is the instructions to prepare it. This way, anyone can follow the recipe and savor your magnificent creation.
cs: Tak, jak kuchař vytváří předpis? Předpisy jsou rozděleny do dvou částí: v první jsou přísady a ve druhé postup jak pokrm připravit. Takhle může kdokoliv postupovat podle receptu a kochat se tvým velkolepým výkonem.
de: Also wie kreiert der Koch ein Rezept? Rezepte sind in zwei Abschnitte unterteilt: der erste beinhaltet die Zutaten und der zweite die Anleitung. Auf diese Weise kann jeder dem Rezept folgen und Ihre großartige Kreation genießen.
es: Ahora, ¿Cómo hace un chef una receta? Las recetas se dividen en dos secciones: La primera tiene los ingredientes y la segunda tiene las instrucciones de como prepararla. De esta manera, cualquiera puede seguir la receta y saborear tu magnifica creación.
fi: Joten, miten kokki luo reseptinsä? Reseptit on jaettu kahteen osaan: ensin tulevat ainesosat ja toisena ohjeet kuinka valmistaa se. Tällä tapaa kuka tahansa voi seurata reseptiä ja nauttia suurenmoisesta luomuksestasi.
fr: Alors, comment un chef crée-t-il une recette ? Les recettes sont divisées en deux sections : la première est celle des ingrédients et la seconde celle des instructions de préparation. Ainsi, n'importe qui peut suivre la recette et savourer votre magnifique création.
it: Allora, come fa uno chef a creare una ricetta? Le ricette sono divise in due sezioni: la prima sono gli ingredienti e la seconda le istruzioni per la loro preparazione. In questo modo, chiunque può seguire la ricetta e assaporare la tua magnifica creazione.
ja: では、シェフはどうやってレシピをつくるのでしょう？ レシピは２つに分けられます。ひとつは材料の種類で、もうひとつはその調理法です。これにより、レシピに従ってつくれば誰でも、あなたの卓越した料理を味わうことができるのです。
ko: 그럼 어떻게 셰프가 레시피를 만들까요? 레시피는 두 가지 과정으로 나누어 집니다: 첫번째는 재료, 두번째는 요리하는 방법입니다. 이 과정으로 누구나 레시피를 따라서 훌륭한 음식을 맛 볼 수 있을 겁니다.
pl: W jaki sposób szef kuchni tworzy przepis? Przepisy dzielą się na dwie sekcje: pierwsza to składniki, a druga to instrukcje ich przygotowania. W ten sposób każdy może podążać za przepisem i delektować się swoim wspaniałym daniem.
pt_br: E então? Como um chefe de cozinha cria uma receita? Receitas são divididas em duas seções: a primeira são os ingredientes, e a segunda são as instruções de preparo. Desta forma, qualquer um pode acompanhar a receita e saborear sua magnífica criação.
ru: Итак, как именно шеф-повар создает рецепт? Каждый рецепт разделён на две части: в первой приведён список ингредиентов, а во второй – последовательность их приготовления. Таким образом, каждый имеет возможность приготовить блюдо по созданному рецепту и насладиться вашим великолепным творением.
uk: Отже, як шеф-кухар створює рецепт? Рецепти поділяються на два розділи: перший - це список інгредієнтів, а другий - інструкція щодо їх приготування. Таким чином, будь-хто може виконуючи інструкції рецепта приготувати страву та посмакувати ваше чудове творіння.
zh_cn: 那么，厨师如何制作菜谱呢？菜谱分为两个部分：第一部分是成分，第二部分是准备它的说明。这样，任何人都可以按照菜谱来品味你的宏伟创作。
zh_tw: 那麼，廚師是怎麼想出食譜的呢？食譜可以分成兩個部分：首先是材料，再來是說明如何處理食材。這樣一來，人人都能照著食譜來做出這道卓越的料理。

source: Making games in Godot feels pretty much the same way. Using the engine feels like being in a kitchen. In this kitchen, *nodes* are like a refrigerator full of fresh ingredients with which to cook.
cs: Vytváření her v Godotu je nemlich to samé. Používání enginu je jako být v kuchyni. V této kuchyni jsou "uzly" jako lednička plná čerstvých přísad ze kterých se vaří.
de: Spiele in Godot zu entwickeln, fühlt sich ganz ähnlich an. Die Engine ist wie eine Küche. In dieser Küche sind die *Nodes* wie ein Kühlschrank voller frischer Zutaten, mit denen Sie kochen können.
es: Hacer juegos en Godot es más o menos de la misma manera. Usar el motor es como estar en una cocina. En esta cocina, *los nodos* son como un frigorífico lleno de ingredientes frescos para cocinar.
fi: Pelien tekeminen Godotissa tuntuu hyvin pitkälti samalta. Pelimoottorin käyttäminen tuntuu kuin olisi keittiössä. Tuossa keittiössä, *solmut* ovat jääkaappi täynnä tuoreita aineksia, joista kokata.
fr: Faire des jeux dans Godot, c'est à peu près la même chose. L'utilisation du moteur donne l'impression d'être dans une cuisine. Dans cette cuisine, les *nœuds* sont comme un réfrigérateur rempli d'ingrédients frais avec lesquels cuisiner.
it: Creare giochi in Godot ti fa sentire più o meno allo stesso modo. Usando il programma si ha l'impressione di essere in cucina. In essa, i *nodi* sono come un frigorifero pieno di ingredienti freschi con cui cucinare.
ja: Godotでのゲーム作りも、とても似た感覚です。このエンジンを使うときはキッチンにいるような気分になります。このキッチンでは *ノード* が、冷蔵庫にいっぱいの新鮮な料理材料です。
ko: Godot에서 게임을 만드는 것도 꽤나 요리하는 느낌입니다. 엔진은 주방과 같습니다. 주방으로 친다면 *노드(Node)*\ 는 요리를 하기 위해 신선한 재료들이 가득 찬 냉장고로 볼 수 있습니다.
pl: Tworzenie gier w Godocie odczuwa się podobnie. Używanie silnika sprawia wrażenie, jakbyś znajdował się w kuchni. W kuchni tej *węzły* są jak lodówka pełna świeżych składników do gotowania.
pt_br: Fazer jogos no Godot usa a mesma estratégia. Usar o motor é como estar em uma cozinha. Nesta cozinha, os *nós* são como uma geladeira cheia de ingredientes frescos para serem cozidos.
ru: Создание игр в Godot очень похоже на то, что делают на кухне. На этой кухне *узлы* похожи на холодильник, полный свежих ингредиентов, из которых можно готовить блюдо.
uk: Створення ігор в Godot дуже схоже. Використання редактора дозволяє відчути себе кухарем на кухні. В цій кухні *вузли* схожі на холодильник повний свіжих інгредієнтів, з яких можна готувати.
zh_cn: 在Godot中制作游戏感觉和这种方式相同。使用这个引擎感觉就像是在一个厨房里。在这个厨房里，*节点* 就是装满了用于烹饪的新鲜材料的冰箱。
zh_tw: 在 Godot 裡製作遊戲也很像做菜。使用 Godot 就像在廚房裡一樣。而這個廚房裡， **節點** 就像是一台冰箱，裝滿了新鮮食材準備好要進行料理。

source: There are many types of nodes. Some show images, others play sound, other nodes display 3D models, etc. There are dozens of them.
cs: Existuje mnoho typů uzlů. Některé zobrazí obrázky jiné přehrávají zvuky, další uzly zobrazují 3D modely atd. Jsou jich mraky.
de: Es gibt viele Arten von Nodes. Einige zeigen Bilder, andere spielen Töne ab, wieder andere stellen 3D-Modelle dar usw. Es gibt Dutzende von ihnen.
es: Hay muchos tipos de nodos. Algunos muestran imágenes, otros reproducen sonido, otros nodos muestran modelos en 3D, etc. Hay docenas de ellos.
fi: Solmuja on montaa tyyppiä. Jotkut näyttävät kuvia, toiset soittavat ääniä, jotkut solmut esittävät 3D-malleja, jne. Niitä on kymmenittäin.
fr: Il existe de nombreux types de nœuds. Certains montrent des images, d'autres jouent du son, d'autres noeuds affichent des modèles 3D, etc. Il y en a des douzaines.
it: Ci sono molti tipi di nodi. Alcuni mostrano immagini, altri riproducono suoni, altri nodi visualizzano modelli 3D, ecc. Ne esistono decine.
ja: ノードにはたくさんの種類があります。画像を表示するためのものや、音を再生したり、3Dモデルを表示するためのもの等、数十種類があります。
ko: 많은 유형의 노드가 있습니다. 이미지를 보여주는 노드, 소리를 재생하는 노드, 3D 모델을 보여주는 노드 등이 있습니다. 그것도 수십 개나 있습니다.
pl: Istnieje wiele typów węzłów. Niektóre pokazują obrazy, inne odtwarzają dźwięk, inne węzły wyświetlają modele 3D itp. Jest ich dziesiątki.
pt_br: Existem muitos tipos de nós. Alguns mostram imagens, outros nós reproduzem som, outros exibem modelos tridimensionais, etc. Existem dúzias deles.
ru: Существует множество типов узлов. Одни показывают изображения, другие воспроизводят звук, третьи отображают 3D-модели и т.д. Их десятки.
uk: Існує багато типів вузлів. Одні показують зображення, інші відтворюють звук, ще інші вузли показують 3D-моделі тощо. Їх є десятки.
zh_cn: 有很多种类型的节点，有的显示图像、有的播放声音、有的节点显示3D模型等等。它们有数十个。
zh_tw: 節點有很多種，有的節點顯示圖片，有的節點播放聲音，還有的節點顯示 3D 模型，總共還有幾十種的節點。

source: Nodes
cs: Uzly
de: Nodes ("Knoten")
es: Nodos
fi: Solmut
fr: Les nœuds
it: Nodi
ja: ノード
ko: 노드(Node)
pl: Węzły
pt_br: Nós
ru: Узлы (ноды)
uk: Вузли
zh_cn: 节点
zh_tw: 節點

source: But let's start with the basics. Nodes are fundamental building blocks for creating a game. As mentioned above, a node can perform a variety of specialized functions. However, any given node always has the following attributes:
cs: Ale začněme od Adama. Uzly jsou základní stavební bloky pro vytvoření hry. Tak jak už bylo řečeno, uzel může vykonávat velké množství speciálních funkcí. Avšak libovolný uzel má vždycky následůjící vlastnosti (atributy):
de: Aber fangen wir mit den Grundlagen an. Nodes sind die Grundbausteine, aus denen ein Spiel aufgebaut ist. Wie oben erwähnt, gibt es Nodes für eine Vielzahl besonderer Aufgaben. Unabhängig davon haben alle Nodes folgende Attribute gemeinsam:
es: Pero comencemos con lo básico. Los nodos son elementos fundamentales para crear un juego. Como se mencionó anteriormente, un nodo puede realizar una variedad de funciones especializadas. Sin embargo, cualquier nodo utilizado siempre tiene los siguientes atributos:
fi: Mutta aloitetaan perusteista. Solmut ovat pelin luomisen keskeisiä rakennuspalikoita. Kuten mainittu ylempänä, solmu voi suorittaa moninaisia erikoistuneita toimintoja. Joka tapauksessa, millä tahansa solmulla on aina seuraavat piirteet:
fr: Mais commençons par les bases. Les nœuds sont des éléments fondamentaux pour la création d'un jeu. Comme mentionné ci-dessus, un nœud peut exécuter une variété de fonctions spécialisées. Cependant, un nœud donné a toujours les attributs suivants :
it: Ma iniziamo con le basi. I Nodi sono i blocchi fondamentali per creare un gioco. Come menzionato sopra, un nodo può eseguire una varietà di funzioni specializzate. Comunque, qualsiasi nodo ha sempre i seguenti attributi:
ja: まずは基本から始めましょう。ノードはゲームを構築する際に基礎となる要素です。上で触れたように、ノードはさまざまな機能に特化することができます。しかし、どのようなノードも常に以下の性質をもっています:
ko: 일단 기초로 한번 시작해봅시다. 노드는 게임을 만들기 위한 기초 건축 벽돌입니다. 앞서 말했듯이 노드는 다양한 특수 기능을 작업할 수 있습니다. 하지만 어떤 노드든지 항상 이러한 성질을 갖습니다:
pl: Zacznijmy jednak od podstaw. Węzły są fundamentalnym elementem tworzenia gry. Jak wspomniano powyżej, węzeł może wykonywać różne wyspecjalizowane funkcje. Jednak dany węzeł zawsze posiada następujące atrybuty:
pt_br: Mas vamos começar com o básico. Nós são peças fundamentais na criação de um jogo. Como já mencionado, um nó pode desempenhar uma variedade de funções especializadas. Entretanto, todo nó sempre terá os seguintes atributos:
ru: Но давайте начнем с основ. Ноды являются фундаментальными строительными блоками для создания игры. Как упоминалось ранее, нода может выполнять множество специализированных функций. Однако любая используемая нода всегда имеет следующие атрибуты:
uk: Але почнемо з основ. Вузли - це основні будівельні блоки для створення гри. Як було сказано вище, вузол може виконувати різноманітні спеціалізовані функції. Однак будь-який вузол завжди має такі атрибути:
zh_cn: 但让我们从基础开始。节点是创建游戏的基本构建块。如上所述，一个节点可以执行各种特定的功能。但是，任何给定节点始终具有以下属性：
zh_tw: 但，讓我們先從基本的開始。節點就是用來創作遊戲的基本元素。就像剛才提到的，節點可以展現各種各樣特定的功能。然而，任何一個節點都有下列屬性：

source: It has a name.
cs: Má jméno.
de: Er hat einen Namen.
es: Tiene un nombre.
fi: Sillä on nimi.
fr: Il a un nom.
it: Ha un nome.
ja: 名前がある。
ko: 이름이 있습니다.
pl: Ma nazwę.
pt_br: Tem um nome.
ru: У нее есть имя.
uk: Він має ім'я.
zh_cn: 有名字。
zh_tw: 節點有名稱。

source: It has editable properties.
cs: Má editovatelné vlastnosti.
de: Er hat veränderbare Eigenschaften.
es: Tiene propiedades editables.
fi: Sillä on muokattavia ominaisuuksia.
fr: Il a des propriétés éditables.
it: Ha delle proprietà modificabili.
ja: 編集できるプロパティを持つ。
ko: 편집할 수 있는 속성을 갖습니다.
pl: Posiada właściwości które można edytować.
pt_br: Tem propriedade editáveis.
ru: Он имеет редактируемые свойства.
uk: Він має редаговані властивості.
zh_cn: 具有可编辑的属性。
zh_tw: 節點有可編輯的屬性。

source: It can receive a callback to process every frame.
cs: Může obdržet pokyn (callback), aby zpracoval každý snímek (frame).
de: Er kann einen Callback erhalten und diesen in jedem Frame behandeln.
es: Puede recibir una llamada a una función (callback) para procesar cada fotograma.
fi: Se voi saada vastakutsun (callback) käsiteltäväksi jokaisella ruudulla.
fr: Il peut recevoir une fonction de rappel à traiter à chaque trame.
it: Può ricevere una chiamata ad una funzione (callback) per eseguire delle azioni ogni frame.
ja: 毎フレームで処理するコールバックを受け取れる。
ko: 각 프레임을 처리하기 위한 콜백을 받을 수 있습니다.
pl: Może wywoływać zwrot co każdą klatkę.
pt_br: Pode receber uma chamada para processar cada quadro.
ru: Он может получать обратный вызов для обработки каждого кадра.
uk: Він може викликатися в кожному кадрі.
zh_cn: 可以接收回调以处理每个帧。
zh_tw: 節點能接收用來處理每一幀的回呼。

source: It can be extended (to have more functions).
cs: Může být rozšířen o další funkce.
de: Er kann erweitert werden (um weitere Funktionen).
es: Se puede extender (para tener más funciones).
fi: Sitä voidaan laajentaa (jotta se voi saada lisää funktioita).
fr: Il peut être étendu (pour avoir plus de fonctions).
it: Può essere esteso (in modo da dargli più funzionalità).
ja: 拡張できる(機能を追加するため)。
ko: (더 많은 기능을 갖기 위해) 확장될 수 있습니다.
pl: Może być rozbudowywany (aby mieć więcej funkcji).
pt_br: Pode ser estendido (ter mais funções).
ru: Он может быть расширен (чтобы иметь больше функций).
uk: Він може бути розширений (мати більше функцій).
zh_cn: 可以被扩展(以具有更多功能)。
zh_tw: 可以擴充節點（讓節點有更多功能）。

source: It can be added to another node as a child.
cs: Může být přidán do dalšího uzlu jako jeho potomek.
de: Er kann in anderen Nodes als Unterobjekt eingehängt werden.
es: Se puede añadir a otro nodo como un hijo.
fi: Se voidaan lisätä toisen solmun alisolmuksi.
it: Può essere aggiunto ad altri nodi come figlio.
ja: ほかのノードを子に持てる。
ko: 다른 노드의 자식으로 추가될 수 있습니다.
pl: Może być dodany do innego węzła jako dziecko.
pt_br: Pode ser adicionado a outros nós como filho.
ru: Он может быть добавлен к другому узлу (ноду) в качестве дочернего.
uk: Він може бути доданий до іншого вузла в якості нащадка.
zh_cn: 可以作为子节点被添加到其他节点上。
zh_tw: 可以新增節點到另一個節點，變成另一個節點的子節點。

source: The last one is important. Nodes can have other nodes as children. When arranged in this way, the nodes become a **tree**.
cs: Ta poslední vlastnost (dědičnost) je obzvlášť důležitá. Uzly mohou mít jiné uzly jako potomky. Takové uspořádání uzlů nazýváme "stromem".
de: Der letzte Punkt ist besonders wichtig. Ein Node kann weitere Nodes als "Kind"-Objekte enthalten. Werden Nodes in dieser Art und Weise verschachtelt, entstehen **Bäume**.
es: Lo último es importante. Los nodos pueden tener otros como hijos. Cuando se disponen de esta manera, los nodos se convierten en un **árbol**.
fi: Viimeisin on tärkeää. Solmuilla voi olla muita solmuja alisolmuina. Tähän tapaan järjestettynä solmuista muodostuu **puu**.
fr: Le dernier est important. Les nœuds peuvent avoir d'autres nœuds comme enfants. Lorsqu'ils sont disposés de cette façon, les nœuds deviennent un **arbre**.
it: Quest'ultimo è importante. I nodi possono avere altri nodi come figli. Quando sono organizzati in questo modo, i nodi diventano un **albero**.
ja: この最後のものが重要です。ノードは他のノードたちを子に持てます。こうやって配置していくと、ノードは\ **ツリー**\ になります。
ko: 마지막이 중요합니다. 노드는 다른 노드를 자식으로 가질 수 있습니다. 이런 식으로 배열된다면 노드들은 **트리(Tree)**\ 가 됩니다.
pl: Węzły mogą mieć inne węzły jako dzieci. Węzły ułożone w ten sposób stają się **drzewem**.
pt_br: Esse último é importante: nós podem ter outros nós como filhos. Quando arranjados dessa maneira, os nós compõem uma **árvore**.
ru: Еще одно важное замечание. У узлов могут быть другие узлы в качестве дочерних. При расположении таким образом узлы образуют **дерево**.
uk: Останнє важливо. Вузли можуть мати інші вузли в якості нащадків. Упорядковані таким чином вузли утворюють **дерево**.
zh_cn: 最后一点很重要。节点能够持有其他节点作为子节点。以这种方式编排时，这些节点就会变成一棵 **树**。
zh_tw: 最後一點很重要：節點可以有其他節點作為子節點。用這種方式編排的時候，節點就變成了 **樹狀** 的。

source: In Godot, the ability to arrange nodes in this way creates a powerful tool for organizing projects. Since different nodes have different functions, combining them allows for the creation of more complex functions.
cs: V Godotu představuje možnost seskupovat uzly do stromů mocný nástroj pro organizování herního projektu. Protože ruzné uzly umí různé funkce, jejich kombinováním můžeme vytvořit komplexnější chování a nakonec celou hru.
de: Nodes in Godot auf diese Art zu ordnen, ermöglicht es, Projekte übersichtlich zu organisieren. Da verschiedene Nodes über unterschiedliche Funktionen verfügen, können durch ihre Kombination komplexere Funktionen erstellt werden.
es: En Godot, la capacidad de organizar nodos de esta manera crea una poderosa herramienta para organizar proyectos. Como los diferentes nodos tienen diferentes funciones, combinarlos permite la creación de funciones más complejas.
fi: Mahdollisuus järjestää solmuja tähän tapaan Godotissa luo tehokkaan työkalun projektien organisoimiseksi. Koska erilaisilla solmuilla voi olla erilaisia toimintoja, niiden yhdistäminen mahdollistaa vielä monimutkaisempien toimintojen luomisen.
fr: Dans Godot, la capacité d'organiser les nœuds de cette façon crée un outil puissant pour organiser les projets. Comme les différents nœuds ont des fonctions différentes, leur combinaison permet de créer des fonctions plus complexes.
it: In Godot, la possibilitá di disporre i nodi in questa maniera diventa uno strumento molto potente per organizzare i progetti. Siccome diversi nodi hanno differenti funzioni, combinarli permette la creazione di funzionalitá complesse.
ja: Godotでは、このようにノードを配置できることが、プロジェクトを構築するための強力な道具となっています。異なる機能を持った異なるノードを組み合わせれば、さらに複雑な機能を作り出せます。
ko: Godot에서 이런 방식으로 노드들을 배열하는 것은 프로젝트를 조직화하는데 강력한 도구가 됩니다. 각 노드들이 다른 기능을 가지고 있기에, 그들을 묶는 것으로 훨씬 복잡한 기능을 구현할 수 있습니다.
pl: W Godocie umiejętność takiego układania węzłów, to potężna umiejętność pomagająca w organizowaniu projektów. Ponieważ różne węzły mają różne funkcje, ich łączenie pozwala na tworzenie bardziej złożonych funkcji.
pt_br: No Godot, a habilidade de arranjar os nós desta forma cria uma ferramenta poderosa para organizar projetos. Já que diferentes nós têm diferentes funções, combiná-los permite a criação de funções mais complexas.
ru: Способность располагать узлы таким образом создает мощный инструмент для организации проектов. Поскольку разные узлы имеют разные функции, объединение их позволяет создавать более сложные функции.
uk: У Godot, можливість впорядкувати вузли таким чином створює потужний інструмент для організації проектів. Оскільки різні вузли мають різні функції, їх поєднання дозволяє створити більш складні функції.
zh_cn: 在Godot中，以这种方式来编排节点的特点为组织项目创造了一个强有力的工具。因为不同的节点有不同的功能，将它们组合起来则允许创建更多复杂的功能。
zh_tw: 在 Godot 中以樹狀形式編排節點就是組織專案的強力道具。因為不同的節點有不同的功能，將這些節點組合起來就能創造出更複雜的功能。
