Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scenes_and_nodes.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Success!
cs: Úspěch!
de: Geschafft!
es: ¡Éxito!
fi: Onnistui!
fr: Succès !
it: Successo!
ja: 成功！
ko: 성공!
pl: Sukces!
pt_br: Sucesso!
ru: Успех!
uk: Успіх!
zh_cn: 成功！
zh_tw: 成功！

source: If this doesn't immediately work and you have a hiDPI display on at least one of your monitors, go to **Project → Project Settings → Display → Window** then enable **Allow Hidpi** under **Dpi**.
cs: Pokud to nefunguje okamžitě a máte hiDPI displej alespoň na jednom z vašich monitorů, přejděte na **Projekt → Nastavení projektu → Displej → Okno** a poté povolte **Povolit Hidpi** pod **Dpi**.
de: Falls dies nicht sofort funktioniert und ein hiDPI-Display gebraucht wird, kann dies unter **Projekt → Projekteinstellungen → Display → Window** aktiviert werden, indem unter **Dpi**, **Allow Hidpi** eingeschaltet wird.
es: Si esto no funciona de inmediato y tiene una pantalla hiDPI en al menos uno de sus monitores, vaya a **Project → Project Settings → Display → Window** y habilite **Allow Hidpi** en **Dpi**.
it: Se questo non funziona immediatamente e si dispone di un display hiDPI su almeno uno dei monitor, andare a **Project → Project Settings → Project Settings → Display → Window** quindi attivare **Allow Hidpi** sotto **Dpi**.
ja: もし、これがすぐに機能せず、(マルチモニターまたはシングルモニターでの使用環境を問わず)少なくとも1つのモニターに高DPIディスプレイがある場合は、\ **プロジェクト → プロジェクト設定 → Display → Window**\ に進み、\ **Dpi**\ で\ **Allow Hidpi**\ をオンにします。
ko: 데모가 즉시 작동하지 않을 수 있습니다. 모니터 중 하나가 hiDPI 화면으로 설정한 경우, **프로젝트(Project) → 프로젝트 설정(Project Settings) → Display → Window**\ 로 가세요. 그런 다음 **Dpi** 아래에 있는 **Allow Hidpi** 설정을 켜세요.
pt_br: Se isto não funcionar imediatamente e você tem uma tela de DPI alto em ao menos um dos seus monitores, vá até: **Project → Project Settings → Display → Window** e então habilite **Allow Hidpi** em **Dpi**.
ru: Если это не сработает немедленно, и будет дисплей hiDPI хотя бы на одном из ваших мониторов, перейдите в **Проект → Настройки проекта → Экран → Окно (Project → Project Settings → Display → Window)**, затем включите **Allow Hidpi** находящееся под **Dpi**.
uk: Якщо це не спрацює, і у вас є дисплей hiDPI принаймні на одному з моніторів, перейдіть в **Проект → Налаштування проекту → Дисплей → Вікно**, а потім увімкніть **Дозволити Hidpi** під **Dpi**.
zh_cn: 如果这不能立即工作并且在至少一台显示器上有hiDPI显示，请转到 :menuselection:`项目(Project) --> 项目设置(Project Settings) --> 显示(Display) --> 窗口(Window)` 然后在 **Dpi** 下启用 **允许Hidpi**。
zh_tw: 如果沒有馬上運作，而且至少有一部 hiDPI 顯示器時，請前往 **[專案] → [專案設定] → [Display] → [Window]** 然後啟用 **Dpi** 底下的 **Allow Hidpi**。

source: Configuring the project
cs: Konfigurace projektu
de: Konfigurieren des Projekts
es: Configurando el proyecto
fi: Projektin määrittäminen
fr: Configurer le projet
it: Configurare il progetto
ja: プロジェクトの設定
ko: 프로젝트 설정하기
pl: Konfigurowanie projektu
pt_br: Configurando o projeto
ru: Настройка проекта
uk: Налаштування проекта
zh_cn: 配置项目
zh_tw: 設定專案

source: Ok, it's time to configure the project. Right now, the only way to run something is to execute the current scene. Projects, however, may have several scenes, so one of them must be set as the main scene. This is the scene that will be loaded any time the project is run.
cs: Ok, je čas na konfiguraci projektu. Jediným způsobem, jak něco spustit, je právě provedení aktuální scény. Projekty však mohou mít několik scén, takže jedna z nich musí být nastavena jako hlavní scéna. Toto je scéna, která se načte při každém spuštění projektu.
de: OK, es wird Zeit, das Projekt einzurichten. Bisher war die einzige Möglichkeit, etwas auszuführen, die aktuelle Szene zu starten. Projekte können allerdings mehrere Szenen haben, deshalb muss eine davon als Hauptszene bestimmt werden. Das ist die Szene, die gestartet wird, wenn das Projekt ausgeführt wird.
es: Es momento de configurar el proyecto. Ahora, el único modo de ejecutar algo es hacerlo en la escena actual. Sin embargo, los proyectos pueden llegar a tener varias escenas, así que una de ellas se debe asignar como la escena principal. Esta es la escena que se cargará cada vez que se ejecute el proyecto.
fi: Ok, on aika määrittää projekti. Juuri nyt, ainoa tapa ajaa jotakin on käynnistää nykyinen skene. Projekteilla voi kuitenkin olla useita skenejä, jo yksi niistä täytyy valita pääskeneksi. Se on se skene, joka ladataan, kun projekti ajetaan.
fr: Ok, il est temps de configurer le projet. Pour l'instant, la seule façon d'exécuter quelque chose est d'exécuter la scène actuelle. Les projets, cependant, peuvent avoir plusieurs scènes, de sorte que l'une d'entre elles doit être mise en scène principale. C'est la scène qui sera chargée à chaque fois que le projet est exécuté.
it: Ok, é tempo di configurare il progetto. Per ora, l'unico modo per eseguire qualcosa é eseguire la scena corrente. I progetti, peró, possono avere molte scene, per cui una di loro deve essere configurata come scena principale. Questa scena é quella che verrá caricata ogni volta che il progetto sará eseguito.
ja: それでは、プロジェクトの設定に取り掛かりましょう。今のところ、実行できるのは現在のシーンのみです。しかし、プロジェクトは複数のシーンを持つことができるため、メインとなるシーンを決めなければなりません。プロジェクトを実行するときは常にそのシーンから読み込まれます。
ko: 좋아요. 프로젝트를 설정할 시간입니다. 지금 할 수 있는 일은 현재 씬을 실행하는 것 뿐입니다. 하지만 프로젝트는 여러 개의 씬을 갖기 때문에, 어느 한 씬을 메인 씬으로 설정해야 합니다. 프로젝트를 실행하면 언제나 불러오는 씬이죠.
pl: Ok, to jest czas w którym można skonfigurować projekt. Teraz jedynym sposobem, aby uruchomić cokolwiek to uruchomienie bieżącej sceny. Projekty, jednak może mieć kilka scen, więc jeden z nich musi być ustawiona jako główna scena. Jest to scena, który zostanie załadowana, za każdym razem, gdy projekt jest uruchamiany.
pt_br: Pronto, hora de configurar o projeto. No momento, a única forma de rodar alguma coisa é executar a cena atual. Projetos, entretanto, podem ter muitas cenas, então uma delas deve ser definida como sendo a principal. Esta é a cena que será carregada sempre o projeto for executado.
ru: Хорошо, пришло время настроить проект. Прямо сейчас, единственный способ запустить что-то - это запустить текущую сцену. Однако, проекты могут иметь несколько сцен, поэтому одна из них должна быть установлена как главная сцена. Именно эта сцена будет загружаться при каждом запуске проекта.
uk: Гаразд, настав час налаштувати проект. Зараз єдиний спосіб запустити щось - це виконати поточну сцену. Однак у проектів може бути кілька сцен, тому одна з них повинна бути встановлена як головна сцена. Це сцена, яка буде завантажуватися при кожному запуску проекта.
zh_cn: 好了，是时候配置项目了。现在，唯一运行某些东西的方式就是执行当前的场景。然而，可能有多个场景，因此其中一个必须被设定为主场景。这个场景是将会在项目运行时被载入的场景。
zh_tw: 好了，該來設定專案了。目前，要執行某樣東西的唯一方法就是執行場景。然而，專案可能有很多個場景，所以我們必須先將其中一個場景設為主場景。這個場景會在每次執行專案的時候載入。

source: These settings are all stored in a project.godot file, which is a plaintext file in win.ini format (for easy editing). There are dozens of settings that you can change in this file to alter how a project executes. To simplify this process, Godot provides a project settings dialog, which acts as a sort of frontend to editing a project.godot file.
cs: Všechna tato nastavení jsou uložena v souboru project.godot, což je prostý text ve formátu win.ini (pro snadnou editaci). Existují desítky nastavení, která můžete v tomto souboru změnit a změnit tak provádění projektu. Pro zjednodušení tohoto procesu poskytuje Godot dialog nastavení projektu, který slouží jako jakési rozhraní pro editaci souboru project.godot.
de: Diese Einstellungen werden alle in der project.godot-Datei gesichert, die nichts anderes ist als eine gewöhnliche INI-Datei. In dieser Datei werden dutzende Einstellungen gespeichert, die festlegen, wie ein Projekt auszuführen ist. Um das Bearbeiten dieser Einstellungen zu vereinfachen, stellt Godot den "Projekteinstellungen"-Dialog zur Verfügung.
es: Estas configuraciones se guardan en el archivo project.godot, que es un archivo de texto plano en formato win.ini (para editarlo fácilmente). Hay docenas de configuraciones que puedes cambiar en este archivo para modificar cómo se ejecuta el proyecto. Para simplificar este proceso, Godot provee una ventana de diálogo de ajustes de proyecto, la que hace de interfaz para editar el archivo project.godot.
fi: Kaikki nämä asetukset tallennetaan project.godot tiedostoon, joka on win.ini muotoinen tekstitiedosto (helppoa muokkausta varten). Tiedostossa on kymmenittäin muokattavia asetuksia, jotka määrittävät kuinka projekti suoritetaan. Prosessin yksinkertaistamiseksi Godot tarjoaa projektin asetuksille ikkunan, joka toimii eräänlaisena edustana project.godot tiedoston muokkaamista varten.
fr: Ces paramètres sont tous stockés dans un fichier project.godot, qui est un fichier texte en clair au format win.ini (pour faciliter l'édition). Il y a des douzaines de paramètres que vous pouvez modifier dans ce fichier pour modifier la façon dont un projet s'exécute. Pour simplifier ce processus, Godot fournit une boîte de dialogue de paramétrage du projet, qui agit comme une sorte de frontend pour éditer un fichier project.godot.
it: Questi parametri sono tutti memorizzati all'interno del file project.godot, che é un file di testo nel formato win.ini (per facilitá di modifica). Ci sono dozzine di parametri che puoi cambiare in questo file per modificare l'esecuzione del progetto. Per semplificare questo processo, Godot mette a disposizione una finestra "Impostazioni Progetto" che fa da interfaccia per la modifica del file project.godot.
ja: これらの設定はすべて project.godot ファイルに格納されます。これは編集しやすいように win.ini 形式に沿ったプレーンテキストになっていて、プロジェクトの動作を変更するための設定が数十項目あります。それらを簡単に変更できるよう、project.godotファイル編集用フロントエンドともいえる、プロジェクト設定ダイアログがGodotにはあります。
ko: 이 설정은 모두 project.godot 파일에 저장됩니다. (편집을 쉽게 할 수 있도록) win.ini 형식으로 된 텍스트 파일입니다. 이 파일에는 프로젝트를 실행하는 방법을 바꾸는 수 십 개의 설정이 있습니다. Godot는 이 과정을 간소화하기 위해 project.godot 파일을 편집하는 프로젝트 설정(Project Settings) 대화 상자를 제공합니다.
pl: Wszystkie te ustawienia są przechowywane w pliku project.godot, który jest plikiem tekstowym w formacie win.ini (dla łatwiejszej edycji). Istnieje kilkadziesiąt ustawień, które można zmienić w tym pliku, aby zmienić w projekcie. Aby uprościć ten proces, program Godot udostępnia okno dialogowe ustawień projektu.
pt_br: Essas configurações ficam todas armazenadas no arquivo project.godot, que é um arquivo de texto simples no formato win.ini para fácil edição. Existem dúzias de configurações que você pode alterar neste arquivo para mudar como o projeto executa. Para simplificar esse processo, o Godot fornece um diálogo de configurações de projeto, que age como um editor do arquivo project.godot.
ru: Эти настройки хранятся в файле project.godot, который является файлом открытого текста в формате win.ini (для удобства редактирования). Существуют десятки настроек, которые вы можете изменить в этом файле, чтобы изменить способ выполнения проекта. Чтобы упростить этот процесс, Godot предоставляет меню настроек проекта, который действует как своего рода интерфейс для редактирования файла project.godot.
uk: Усі ці параметри зберігаються у файлі project.godot, який є простим текстовим файлом у форматі win.ini (для зручного редагування). У цьому файлі ви можете змінити десятки налаштувань, щоб змінити спосіб виконання проекту. Щоб спростити цей процес, Godot надає діалогове вікно налаштувань проекту, яке виступає як своєрідний інтерфейс для редагування файлу project.godot.
zh_cn: 这些设置将全部被存放在 ``project.godot`` 文件中，一个 ``win.ini`` 格式的普通文本文件(以便编辑)。在这个文件中有数十个设置可以被修改，来更改项目的执行方式。为了简化此过程，Godot提供了项目设置对话框，作为编辑 ``project.godot`` 文件的前端。
zh_tw: 這些設定都會保存於 project.godot 檔案中，該檔案為 win.ini 格式的純文字檔 (才能輕鬆編輯他)。這裡面有很多設定可以修改，可以用來改變專案執行的方式。為了簡化編輯 project.godot 的流程，Godot 提供了一個專案設定對話框，就是編輯 project.godot 檔案的前端。

source: To access that dialog, select Project -> Project Settings. Try it now.
cs: Pro přístup do tohoto dialogu vyberte Projekt -> Nastavení projektu. Zkus to nyní.
de: Um diesen Dialog aufzurufen, wählen Sie im Menü "Projekt" -> "Projekteinstellungen" aus. Versuchen Sie es jetzt einmal.
es: Para acceder al diálogo, seleccione Projecto -> Ajustes del Proyecto. Pruébalo ahora.
fi: Dialogin pääsee valitsemalla valikosta Projekti -> Projektin asetukset. Kokeile sitä nyt.
fr: Pour accéder à cette boîte de dialogue, sélectionnez Projet -> Paramètres du projet. Essayez ceci maintenant.
it: Per accedere a questa finestra, seleziona il menú Progetto -> Impostazioni Progetto. Provalo ora.
ja: ダイアログは『プロジェクト -> プロジェクト設定』からアクセスできます。開いてみてください。
ko: 대화 상자에 접근하려면 프로젝트(Project) -> 프로젝트 설정(Project Settings)을 선택하세요. 지금 해보세요.
pl: Aby uruchomić okno dialogowe, wybierz Projekt -> Ustawienia projektu. Wypróbuj to.
pt_br: Para acessar esse diálogo, selecione Projeto -> Configurações do Projeto. Experimente isso agora.
ru: Чтобы открыть это окно, выберите «Проект -> Настройки проекта» (Project -> Project Settings). Попробуйте сделать это сейчас.
uk: Для доступу до цього діалогового вікна виберіть Проект -> Параметри проекту. Спробуйте зараз.
zh_cn: 要访问这个对话框，选择 :menuselection:`项目(Project) --> 项目设置(Project Settings)``。现在就试试吧。
zh_tw: 選擇 [專案] -> [專案設定] 來打開這個對話框。現在就試試吧。

source: Once the window opens, let's select a main scene. Locate the `Application/Run/Main Scene` property and click on it to select 'Hello.tscn'.
cs: Po otevření okna vybereme hlavní scénu. Vyhledejte vlastnost `Aplikace / Spustit / Hlavní scéna` a kliknutím na ni vyberte 'Hello.tscn'.
de: Nachdem sich das Fenster geöffnet hat, wollen wir die Hauptszene festlegen. Suchen Sie dazu die `Application/Run/Main Scene`-Einstellung auf und klicken rechts auf das kleine Dateisymbol, um die 'Hello.tscn' als Hauptszene zu selektieren.
es: Una vez que se abra la ventana, seleccionaremos una escena principal. Localiza la propiedad `Application/Run/Main Scene` y haz clic en ella para seleccionar 'Hello.tscn'.
fi: Kunhan ikkuna aukeaa, valitkaamme pääskene. Etsi `Application/Run/Main Scene` ominaisuus ja napsauta sitä valitaksesi 'Hello.tscn' tiedoston.
it: Una volta che la finestra si apre, seleziona la scena principale. Trova la proprietá `Application/Run/Main Scene` e clicca per selezionare 'Hello.tscn'.
ja: ウィンドウが開いたら、メインメニューを設定しましょう。\ `Application/Run/Main Scene`\ のプロパティを押してHello.tscnを選んでください。
ko: 창을 열었다면 메인 씬을 선택합시다. 'Application/Run/Main Scene' 속성으로 가서 'hello.tscn'을 선택하세요.
pl: Po otwarciu okna wybierz scenę główną. Znajdź opcję `Aplikacja/Uruchom/Scena Główna` i kliknij na nią, aby wybrać 'Hello.tscn'.
pt_br: Assim que a janela abrir, vamos selecionar uma cena principal. Localize a propriedade `Application/Run/Main Scene` (Aplicação/Execução/Cena Principal) e clique nela para selecionar "ola.tscn".
ru: Как только откроется окно, давайте выберем главную сцену. Найдите свойство `Application/Run/Main Scene` (`Приложение/Запуск/Главная Сцена`) и нажмите на него, чтобы выбрать 'Hello.tscn'.
uk: Як тільки відкриється вікно, давайте виберемо головну сцену. Знайдіть властивість `Application/Run/Main Scene` (`Додаток/Запуск/Головна сцена`) та натисніть на неї, щоб вибрати 'Hello.tscn'.
zh_cn: 窗口打开后，让我们选择一个主场景。定位到 :menuselection:`应用程序(Application) --> 运行(Run) --> 主场景(Main Scene)` 属性然后点击以选择 ``Hello.tscn``。
zh_tw: 視窗打開以後，先來選擇主場景。到 **Application/Run/Main Scene** 屬性，然後點擊並選擇「Hello.tscn」。

source: Now, with this change, when you press the regular Play button (or F5), this scene will run, no matter which scene is actively being edited.
cs: Nyní s touto změnou, vždy když stisknete tlačítko Přehrát (nebo F5), bude spuštěna tato hlavní scéna, bez ohledu na to, která ze scén je právě editována.
de: Mit dieser Änderung wird von nun an beim Drücken des "Starten"-Knopfes (oder F5) diese Szene ausgeführt, ganz gleich, welche Szene Sie gerade bearbeiten.
es: Ahora con éste cambio, puedes presionar el botón normal de *reproducir* (o F5), esta escena se ejecutará no importando qué escena es la que está siendo editada.
fi: Nyt, tämän muutoksen myötä, kun painat tavallista Pelaa-painiketta (tai F5), skene ajetaan riippumatta siitä mitä skeneä ollaan aktiivisesti muokkaamassa.
fr: Maintenant, avec ce changement, lorsque vous appuyez sur le bouton Jouer (ou F5), cette scène sera exécutée, quelle que soit la scène en cours d'édition.
it: Ora, con questa modifica, quando premi il bottone Play (o F5), questa scena verrá eseguita, indipendentemente da quale sia la scena attiva nell'editor.
ja: この変更により、通常の再生ボタン (またはF5) を押すと、どのシーンがアクティブに編集されているかにかかわらず、このシーンが実行されます。
ko: 이렇게 바꾸면 이제 어떤 씬을 편집하는 중이든 간에, 기본 실행(Play) 버튼을 누르면 (혹은 F5 키를 누르면) 설정한 씬이 실행됩니다.
pl: Teraz, po tej zmianie, po naciśnięciu zwykłego przycisku Play (lub F5), ta scena zostanie uruchomiona, bez względu na to, która scena jest aktywnie edytowana.
pt_br: Agora, com esta mudança, ao pressionar o tradicional botão Play (ou F5), esta cena será executada, não importa qual seja a cena que você esteja editando.
ru: Теперь, после этих изменений, когда вы нажимаете кнопку Воспроизвести (или F5), эта сцена будет запускаться независимо от того, какая сцена редактируется в данный момент.
uk: Тепер, із цією зміною, коли ви будете натискати звичайну кнопку Відтворення (або F5), буде запускатися саме ця сцена, незалежно від того, яка сцена редагується на даний момент.
zh_cn: 现在，通过此更改，当您按常规播放按钮(或 :kbd:`F5`)时，无论正在编辑哪个场景，该场景都将运行。
zh_tw: 改了設定之後，只要按下平常使用的執行按鈕 (或是 F5)，不論現在正在編輯哪個場景，都會執行剛才設定的主場景。

source: The project settings dialog provides a lot of options that can be saved to a project.godot file and shows their default values. If you change a value, a tick is marked to the left of its name. This means that the property will be saved to the project.godot file and remembered.
cs: Dialogové okno nastavení projektu poskytuje mnoho možností, které lze uložit do souboru project.godot a zobrazuje jejich výchozí hodnoty. Pokud změníte hodnotu, vlevo od jejího názvu je označena fajfka. To znamená, že vlastnost bude uložena do souboru project.godot a zapamatována.
de: Der Projekteinstellungsdialog bietet eine Vielzahl von Optionen, die in project.godot gespeichert werden und zeigt anfänglich die jeweiligen Standardwerte an. Sobald Sie einen Wert ändern, wird links neben dem Eintrag ein sich gegen den Uhrzeigzeigersinn drehender Pfeil angezeigt. Dieser bedeutet, dass die Eigenschaft in der Datei project.godot gespeichert wird. Ein Klick auf diesen Pfeil setzt den Wert wieder auf Standard.
es: La ventana de diálogo de ajustes de proyecto, provee muchas opciones que se pueden guardar en un archivo project.godot y muestra sus valores por defecto. Si cambias un valor, se añade una marca a la izquierda del nombre. Esto significa que la propiedad se guardará en el archivo project.godot y se recordará .
fi: Projektin asetukset -ikkuna tarjoaa paljon valintoja, jotka voidaan tallentaa project.godot tiedostoon, ja näyttää niiden oletusarvot. Jos muutat arvoa, sen nimen vasemmalle puolelle asetetaan pukki merkiksi siitä. Se tarkoittaa, että ominaisuus tallennetaan project.godot tiedostoon ja muistetaan.
fr: La boîte de dialogue des paramètres du projet offre de nombreuses options qui peuvent être sauvegardées dans un fichier project.godot et affiche leurs valeurs par défaut. Si vous modifiez une valeur, une case est cochée à gauche de son nom. Cela signifie que la propriété sera sauvegardée dans le fichier project.godot et mémorisée.
it: La finestra Impostazioni Progetto contiene molte opzioni che possono essere salvate su un file project.godot e i valori predefiniti. Se cambi uno di questi valori un simbolo di spunta compare alla sinistra del nome e significa che quella proprietá verrá salvata nel file project.godot e ricordata.
ja: プロジェクト設定ダイアログには、project.godotファイルに保存できる多くのオプションが表示され、既定値が表示されます。値を変更すると、目盛りは名前の左側にマークされます。つまり、プロパティはproject.godotファイルに保存され、記憶されます。
ko: 프로젝트 설정 대화 상자는 많은 설정을 제공합니다. 설정은 project.godot 파일에 저장하거나 기본 값으로 되돌릴 수 있습니다. 값을 바꾸면 이름 왼쪽에 체크 표시가 뜹니다. 이는 값을 바꾼 속성이 project.godot 파일에 저장되었다는 뜻입니다.
pl: Okno dialogowe ustawień projektu zawiera wiele opcji, które można zapisać do pliku project.godot i pokazuje ich wartości domyślne. Jeśli zmienisz wartość, po lewej stronie nazwy zostanie zaznaczony haczyk. Oznacza to, że właściwość zostanie zapisana do pliku project.godot i zapamiętana.
pt_br: O diálogo de configurações do projeto fornece um monte de opções que podem ser salvas em um arquivo project.godot e mostra seus valores padrões. Se você alterar um valor, uma marca aparece à esquerda do nome. Isso significa que a propriedade será gravada no arquivo project.godot e lembrada.
ru: Диалог настроек проекта предоставляет множество параметров, которые могут быть сохранены в файле project.godot, и отображает их значения по умолчанию. Если вы измените значение, появится галочка слева от ее имени. Это означает, что свойство будет сохранено в файле project.godot и запомнено.
uk: Діалогове вікно налаштувань проекту надає безліч параметрів, які можна зберегти у файл project.godot та показує їх значення за замовчуванням. Якщо ви змінюєте значення, ліворуч від його імені виникає галочка. Це означає, що властивість буде збережено у файлі project.godot.
zh_cn: 项目设置对话框提供了许多能够被保存至 ``project.godot`` 文件的选项并且显示出了它们的默认值。当您改变了一个值，一个对勾被标记在属性名的左侧。这意味着这个属性将被保存到 ``project.godot`` 文件中并被记住。
zh_tw: 專案設定對話框提供了許多可以被保存為 project.godot 的選項，對話框裡面也會顯示預設值。如果你更改了其中一個數值的話，名稱左邊會有一個勾勾，表示選項會被保存到 project.godot 並被記住。

source: As a side note, it is also possible to add custom configuration options and read them in at run-time using the :ref:`ProjectSettings <class_ProjectSettings>` singleton.
cs: Jako vedlejší poznámku je také možné přidat vlastní možnosti konfigurace a přečíst je za běhu pomocí :ref:`ProjectSettings <class_ProjectSettings>` singleton.
de: Übrigens ist es möglich, benutzerdefinierte Projektparameter hinzuzufügen und diese während der Laufzeit über den :ref:`ProjectSettings <class_ProjectSettings>`-Singelton abzufragen.
es: Como apunte adicional, también es posible añadir opciones de configuración personalizadas y leerlas en tiempo de ejecución usando el singleton :ref:`ProjectSettings <class_ProjectSettings>` .
fi: Sivuhuomautuksena, asetuksiin on myös mahdollista lisätä räätälöityjä valintoja ja lukea ne ajonaikaisesti käyttämällä :ref:`ProjectSettings <class_ProjectSettings>` singletonia.
fr: Comme note complémentaire, il est également possible d'ajouter des options de configuration personnalisées et de les lire au moment de l'exécution en utilisant le singleton :ref:`ProjectSettings <class_ProjectSettings>`.
it: Inoltre è anche possibile aggiungere opzioni personalizzate e leggerle durante l'esecuzione (il run-time), usando il singleton :ref:`ProjectSettings <class_ProjectSettings>`.
ja: ちなみに\ :ref:`プロジェクト設定 <class_ProjectSettings>`\ シングルトンを使って、実行時に、カスタム設定オプションの追加と確認も可能です。
ko: 여담으로 :ref:`ProjectSettings <class_ProjectSettings>` 싱글톤(Singleton)을 사용해서 맞춤 설정을 추가, 이를 런타임 도중 읽게 만들 수도 있습니다.
pl: Można również dodać własne opcje konfiguracyjne i wczytać je w czasie pracy za pomocą :ref:`ProjectSettings <class_ProjectSettings>`.
pt_br: Além disso, também é possível adicionar opções de configuração personalizadas e lê-las em tempo de execução do jogo usando o singleton :ref:`ProjectSettings <class_ProjectSettings>`.
ru: В качестве примечания, также можно добавлять пользовательские параметры конфигурации и считывать их во время выполнения, используя синглтон :ref:`ProjectSettings <class_ProjectSettings>`.
uk: Окрім цього, також можна додати спеціальні параметри конфігурації та прочитати їх під час виконання, використовуючи синглтон :ref:`ProjectSettings <class_ProjectSettings>`.
zh_cn: 另外，还可以使用 :ref:`ProjectSettings <class_ProjectSettings>` 单例在运行时来添加自定义配置选项，并读取它们。
zh_tw: 另外，也可以新增自定組態設定選項，然後在執行的時候使用 :ref:`ProjectSettings <class_ProjectSettings>` 單例讀取出來。

source: To be continued...
cs: Pokračování příště...
de: Fortsetzung folgt...
es: Continuará...
fi: Jatkuu...
fr: À suivre...
it: Continua...
ja: 続く...
ko: 계속...
pl: Ciąg dalszy nastąpi...
pt_br: Continua…
ru: Продолжение следует...
uk: Далі буде...
zh_cn: 未完待续...
zh_tw: 下回待續…
