Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: The "main" languages in Godot, though, are GDScript and VisualScript. The main reason to choose them is their level of integration with Godot, as this makes the experience smoother; both have slick editor integration, while C# and C++ need to be edited in a separate IDE. If you are a big fan of statically typed languages, go with C# and C++ instead.
cs: „Hlavní“ jazyky v Godotu jsou však GDScript a VisualScript. Důvodem proč si tyto dva jazyky vybrat je jejich bezproblémová integrace s Godotem a jeho editorem skriptů, zatímco C# a C++ je třeba upravovat v samostatném IDE. Pokud jste velkým fanouškem staticky psaných jazyků, použijte však raději C# či C++.
es: Sin embargo, los lenguajes "principales" en Godot son GDScript y VisualScript. La razón principal para elegirlos es su nivel de integración con Godot, ya que esto hace que la experiencia sea más agradable; ambos tienen una integración con el editor muy fluida, mientras que con C# y C++ se necesita editarlos en un IDE separado. Si eres un gran fan de los lenguajes de tipado estático, utiliza C# y C++ en su lugar.
fi: Godotin "pääkielet" ovat kuitenkin GDScript ja VisualScript. Tärkein syy valita ne on niiden integroitumisaste Godotiin, sillä se tekee kokemuksesta sutjakkaamman; molemmilla on näppärä integraatio editoriin, kun taas C# ja C++ tarvitsevat erillisen kehitysympäristön editointia varten. Jos olet suuri staattisesti tyypitettyjen kielten kannattaja, valitse sen sijaan silloin C# ja C++.
fr: Les langages "principaux" de Godot sont GDScript et VisualScript. La principale raison de les choisir est leur niveau d'intégration avec Godot, qui rend l'expérience plus fluide ; tous les deux ont une intégration dans l'éditeur très bien huilée, tandis que le C# et C++ doivent être édités dans un IDE séparé. Si vous êtes un adepte des langages à typage statique, optez plutôt pour le C# et le C++.
it: I linguaggi "principali" in Godot, comunque, sono GDScript e VisualScript. Il motivo principale per sceglierli è il loro livello di integrazione con Godot, in quanto ciò rende l'esperienza più fluida: entrambi hanno una brillante integrazione con l'editor, mentre C# e C++ hanno bisogno di un IDE esterno. Se sei un sostenitore dei linguaggi staticamente tipati, prosegui con C# e C++.
ja: ただし、Godotの「主要な」言語はGDScriptとVisualScriptです。それらを選択する主な理由は、Godotとの統合レベルが高いからです。これにより、開発作業がよりスムーズになります。どちらも洗練されたエディタと統合されています。一方、C#とC++は別のIDEで編集する必要があります。もしもあなたが静的に型付けされた言語の大ファンであれば、C#とC++を使用してください。
pl: "Domyślnymi" językami dla Godota są GDScript i VisualScript - są funkcjonalne, wydajne i oferują dobrą integrację z edytorem. Jeśli jesteś wielkim fanem statycznie typowanych języków, możesz użyć C++ lub C#, jednak konieczne jest użycie zewnętrznego IDE.
pt_br: As linguagens "principais" no Godot, entretanto, são a GDScript e a VisualScript. O motivo principal de escolhê-las é seu nível de integração com o Godot, já que isso torna a experiência mais suave; ambas têm uma integração boa com o editor, enquanto que C# e C++ precisam ser editadas em uma IDE separada. Se você é fã de linguagens digitadas estaticamente, vá de C# ou C++.
uk: "Головними" мовами в Godot, однак, є GDScript і VisualScript. Основною причиною їх вибору є рівень їх інтеграції з Godot; обоє мають інтеграцію в редакторі, тоді як C # та C ++ потрібно редагувати в окремому IDE. Якщо ви є великим шанувальником мов статичного типу, використовуйте C # та C ++.
zh_cn: 不过，Godot中的“主要”语言是GDScript和VisualScript。选择它们的主要原因是它们与Godot的整合程度，它们使体验更佳顺畅；两者都有非常好的编辑器集成，而C#和C++需要在外部IDE中进行编辑。如果您是静态语言的忠实粉丝，也可以使用C#和C++。
zh_tw: 雖然，Godot 的「主要」語言是 GDScript 與視覺腳本 (VisualScript)。選擇這兩個語言的主要原因就是與 Godot 的高度整合可以讓開發流程變得更順暢。這兩個語言都有完整的編輯器整合，而 C# 與 C++ 則需要用不同的 IDE 來進行開發。如果你很愛靜態型別語言的話，可以使用 C# 與 C++。

source: :ref:`GDScript<doc_gdscript>` is, as mentioned above, the main language used in Godot. Using it has some positive points compared to other languages due to its high integration with Godot:
cs: :ref:`GDScript <doc_gdscript>` je, jak bylo uvedeno výše, hlavní jazyk Godota. Jeho použití má, vzhledem k jeho vysoké integraci s enginem, ve srovnání s ostaními jazyky několik plusových bodů:
es: :ref:`GDScript<doc_gdscript>` es, como se mencionó anteriormente, el lenguaje principal utilizado en Godot. Su uso tiene algunos puntos positivos en comparación con otros idiomas debido a su alta integración con Godot:
fi: :ref:`GDScript<doc_gdscript>` on, kuten yllä mainittu, Godotin pääkieli. Sen käytöllä on joitakin myönteisiä näkökohtia muihin kieliin nähden johtuen sen korkeasta integraatiosta Godotiin:
it: Il :ref:`GDScript<doc_gdscript>` è, come menzionato sopra, il linguaggio principalmente usato in Godot. Utilizzarlo ha alcuni vantaggi rispetto ad altri linguaggi, data la sua forte integrazione con Godot:
ja: 上記のように、\ :ref:`GDScript <doc_gdscript>` はGodotで使用されるメインの言語です。 Godotとの高度な統合により、他の言語と比較していくつかの利点があります。
pl: :ref:`GDScript<doc_gdscript>` jest, jak wspomniano powyżej, domyślnym językiem dla Godota, głównie ze względu na wysoki stopień integracji z programem. Ma kilka zalet nad innymi językami:
pt_br: :ref:`GDScript<doc_gdscript>` é, como já mencionado, a principal linguagem usada no Godot. Usá-la tem alguns pontos positivos quando comparada às demais dada sua alta integração com o Godot:
uk: Як згадувалося вище, :ref:`GDScript<doc_gdscript>` є основною мовою, що використовується в Godot. Використання його має деякі позитивні моменти порівняно з іншими мовами через високу інтеграцію з Godot:
zh_cn: 如上所述，GDScript是Godot主要的使用语言。由于其与Godot高度整合，使用它较其他语言而言，有一些积极意义：
zh_tw: 就像剛才說的， :ref:`GDScript<doc_gdscript>` 是 Godot 中的主要語言。因為與 Godot 高度整合，用 GDScript 比起其他語言有更多優點：

source: VisualScript
cs: VisualSkript
ja: VisualScript(ビジュアルスクリプト)
zh_cn: 可视化脚本
zh_tw: 視覺腳本 (VisualScript)

source: This language is the best choice for performance and does not need to be used throughout an entire game, as other parts can be written in GDScript or Visual Script. However, the API is clear and easy to use as it resembles, mostly, Godot's actual C++ API.
cs: Tento jazyk je nejlepší volbou pro výkon a nemusí být používán v celé hře, další části lze psát v GDScriptu nebo Visual Scriptu. Nicméně, API je čisté a snadno se používá, většinou se totiž podobá Godotovu skutečnému C ++ API.
ja: この言語はパフォーマンスに最適な選択肢であり、ゲーム全体で使用する必要はありません。他の部分はGDScriptまたはVisual Scriptで作成できるためです。 とはいえこのAPIは、主にGodotの実際のC++ APIに似ているため、明確で使いやすいです。
uk: Ця мова є найкращим вибором для продуктивності, і її не потрібно використовувати у всій грі, оскільки інші частини можуть бути написані в GDScript, або Visual Script. Однак API зрозумілий і простий у використанні, оскільки він нагадує, в основному, фактичний API C++ Godot.
zh_tw: 若要追求效能，GDNative / C++ 是最好的選擇。而且不需要整個遊戲都改用 GDNative / C++，其他部分還是可以用 GDScript 或視覺腳本 (Visual Script) 來寫。話雖如此，GDNative 的 API 還是很清楚簡單的，因為大部分都是直接用 Godot 原生 API。

source: Before continuing, make sure to skim and bookmark the :ref:`GDScript<doc_gdscript>` reference. It's a language designed to be simple, and the reference is structured into sections to make it easier to get an overview of the concepts.
cs: Než budete pokračovat, nezapomeňte přejít na záložku :ref:`GDScript <doc_gdscript>` reference. Je to jazyk navržený tak, aby byl jednoduchý, a dokumentace je strukturována do sekcí, aby bylo snazší získat přehled o jednotlivých pojmech.
ja: 続ける前に、\ :ref:`GDScript <doc_gdscript>`\ の説明を一読し、ブックマークしておきましょう。シンプルに設計された言語であり、説明ページは全体のコンセプトを簡単に把握できるようにセクション分けされています。
zh_tw: 在這之前，請記得要先閱讀 :ref:`GDScript<doc_gdscript>` 參考手冊並將 GDScript 頁面加到瀏覽器書籤內。GDScript 被設計得很簡單，而且這個參考手冊被區分成了多個段落，能夠很容易掌握各種概念。

source: If you still have the "instancing" project open from the previous tutorial, then close that out (Project -> Quit to Project List) and create a New Project.
cs: Pokud stále máte projekt "vytváření instancí" z předchozího kurzu otevřený, zavřete jej (Project -> Quit to Project List) a vytvořte projekt nový.
ja: 前回のチュートリアルで「インスタンス化」プロジェクトを開いたままにしている場合は、そのプロジェクトを閉じて（プロジェクト → 終了してプロジェクト一覧を開く）、それから「新規プロジェクト」を作成します。
zh_tw: 若上一個教學中的「實體化」專案還開著的話，請先關閉該專案 ([專案] -> [退出至專案列表]) 並建立新專案。

source: Use the "Add Child Node" dialogue accessed from the Scene tab (or by pressing :kbd:`Ctrl + A`) to create a hierarchy with the following nodes:
cs: Pomocí dialogu „Přidat podřízený uzel“, který je přístupný z karty Scéna (nebo stisknutím :kbd:`Ctrl + A`), vytvořte hierarchii s následujícími uzly:
ja: シーンタブから「子ノードの追加」ダイアログにアクセスし (または :kbd:`Ctrl + A` を押して)、次のノードを持つ階層を作成します:
pt_br: Use o diálogo "Adicionar nó filho" acessível a partir da aba Cena (ou pressionando :kbd:`Ctrl + A`) para criar uma hierarquia com os seguintes nós:
uk: Використовуйте діалогове вікно "Додати дочірній вузол", доступ до якого здійснюється на панелі Сцена (або натисканням :kbd:`Ctrl+A`), щоб створити ієрархію з такими вузлами:
zh_tw: 從場景分頁 (或是鍵盤 :kbd:`Ctrl + A` ) 裡打開「新增子節點」視窗來建立下列架構的節點：

source: In GDScript, the file itself represents the class, so the class name field is not editable.
cs: V GDScript představuje samotný soubor třídu, takže pole názvu třídy nelze upravovat.
es: En GDScript, el propio archivo representa la clase, por lo que el campo del nombre de la clase no se puede editar.
fi: GDScriptissä tiedosto itse edustaa luokkaa, joten luokan nimikenttä ei ole muokattavissa.
fr: Dans GDScript, le fichier lui-même représente la classe, ce qui rend le nom de la classe non modifiable.
it: Usando GDScript, il file stesso rappresenta la classe, quindi il campo del nome della classe non è modificabile.
ja: GDScriptではファイル自身がクラスを表します。そのためクラス名のフィールドは編集できません。
pl: W GDScript to plik reprezentuje klasę, więc pole nazwy klasy nie jest edytowalne.
pt_br: Na GDScript, o arquivo em si representa a classe, então o campo de nome da classe não é editável.
uk: У GDScript сам файл представляє клас, тому поле імені класу не можна редагувати.
zh_cn: 在GDScript里，文件本身代表了类，所以类名一栏无法编辑。
zh_tw: GDScript 的話，一個檔案就是一個類別，所以 [類別名稱] 欄位會沒辦法編輯。

source: To edit the script, select either of these buttons, both of which are highlighted in the above image. This will bring you to the script editor, where a default template will be included:
cs: Chcete-li skript upravit, vyberte některá z těchto tlačítek, která jsou zvýrazněna na obrázku výše. Tím se dostanete do editoru skriptů, kde bude zahrnuta výchozí šablona:
es: Para editar el script, pulsa cualquiera de estos botones, ambos resaltados en la imagen de arriba. Esto te llevará al editor de scripts, donde se incluirá una plantilla predeterminada:
fi: Skriptin muokkaamiseksi käytä jompaa kumpaa näistä painikkeista, jotka on esitetty korostettuna yllä olevassa kuvassa. Tämä vie sinut skriptieditoriin, johon on lisätty valmis skriptipohja:
fr: Pour éditer le script, sélectionnez l'un ou l'autre de ces boutons, qui sont tous deux surlignés dans l'image ci-dessus. Cela vous emmenera vers l'éditeur de script, où un modèle par défaut sera inclus :
it: Per modificare lo script, seleziona uno dei pulsanti evidenziati nell'immagine qua sopra. Questo ti porterà all'Editor dello Script, che includerà un modello predefinito:
ja: スクリプトを編集するには、上の画像で強調表示されている2つのボタンのいずれかを選択します。これにより、スクリプトエディタにデフォルトのテンプレートが含まれて表示されます:
pl: Aby edytować skrypt, wybierz jeden z tych przycisków, które są podświetlone na powyższym obrazku. Spowoduje to przeniesienie użytkownika do edytora skryptów, gdzie zostanie dołączony domyślny szablon:
pt_br: Para editar o script, selecione um desses botões, ambos destacados na imagem acima. Isso lhe levará ao editor de scripts, onde um modelo padrão será incluído:
uk: Щоб відредагувати скрипт, виберіть будь-яку з цих кнопок, обидві вони виділені на зображенні вище. Це відкриє для вас редактор скриптів, де буде створений шаблон за замовчуванням:
zh_cn: 要编辑脚本，选择上述按钮之一，这两个按钮都在上图中突出显示。这会把您带到脚本编辑器处，其中包含了默认模版:
zh_tw: 上圖這兩個按鈕中的任一個都可以用來編輯腳本。點擊後會打開腳本編輯器，裡面會有預設的腳本樣板：

source: The top of the dialogue displays a list of your scene's nodes with the emitting node's name highlighted in blue. Select the "Panel" node here.
cs: V horní části dialogu je zobrazen seznam uzlů vaší scény s modrým názvem vysílajícího uzlu. Zde vyberte uzel „Panel“.
ja: ダイアログの上部には、シーン中のノードの一覧が表示されており、シグナルを発するノードの名前(今回はButton)が青色でハイライト表示されています。ここで「Panel」ノードを選択します。
pt_br: A parte superior da caixa de diálogo exibe uma lista dos nós da cena com o nome do nó emissor destacado em azul. Selecione o nó "Painel" aqui.
uk: У верхній частині діалогового вікна є список вузлів вашої сцени, синім кольором виділене ім'я вузла, що випромінює сигнал. Тут виберіть вузол "Panel".
zh_tw: 對話框的頂部會顯示出場景中的節點列表，而觸發訊號的節點名稱則會以藍色顯示。這裡先選擇「Panel」節點。

source: The bottom of the dialogue shows the name of the method that will be created. By default, the method name will contain the emitting node's name ("Button" in this case), resulting in ``_on_[EmitterNode]_[signal_name]``.
cs: Ve spodní části dialogu je uveden název metody, která bude vytvořena. Ve výchozím nastavení bude název metody obsahovat název emitujícího uzlu (v tomto případě „Button“), což bude mít za následek ``_[EmitterNode]_[signal_name]`` .
ja: ダイアログの下部には、作成されるメソッドの名前が表示されます。デフォルトでは、メソッド名には発信ノードの名前(この場合は「ボタン」)が含まれ、 ``_ on_ [シグナルを発するノード名] _ [シグナル名]`` になります。
pt_br: A parte inferior da caixa de diálogo mostra o nome do método que será criado. Por padrão, o nome do método conterá o nome do nó emissor ("Botão" neste caso), resultando em `` _on_ [EmitterNode] _ [signal_name] ``.
uk: У нижній частині діалогового вікна вказана назва методу, який буде створено. За замовчуванням ім'я методу буде містити ім'я вузла, що випромінює сигнал (у цьому випадку "Button" ("Кнопка")), в результаті виходить ``_on_[ВипромінюючийВузол]_[назва_сигналу]``.
zh_tw: 對話框底部會顯示正在建立的方法名稱。預設方法名稱會包含觸發訊號的節點名稱 (這個例子中為「Button」)，格式為 ``_on_[觸發節點名]_[訊號名稱]`` 。

source: And that concludes the guide on how to use the visual interface. However, this is a scripting tutorial, so for the sake of learning, let's dive into the manual process!
cs: A tím se uzavírá průvodce užívání vizuálního rozhraní. Jsme zde hlavně ve skriptovacím tutoriálu, takže se v zájmu učení ponořme do manuálního procesu!
es: Y así concluye la guía sobre cómo usar la interfaz visual. Sin embargo, este es un tutorial de scripting, así que por el bien del aprendizaje, ¡vamos a sumergirnos en el proceso manual!
fi: Ja siihen päättyy opastus visuaalisesta kytkennän luonnista. Tämä on kuitenkin skriptausopas, joten oppimisen nimissä, uppoutukaamme manuaaliseen prosessiin!
fr: Ainsi se conclut notre guide sur l'utilisation de l'interface visuelle. Cependant, il s'agit d'un tutoriel de scripting, donc, à titre d'apprentissage, penchons-nous sur la méthode manuelle !
it: E questo conclude la guida su come usare l'interfaccia grafica. Comunque, questo è un tutorial sulla codifica, quindi, per l'amore dell'imparare, approfondiamo il processo manuale!
ja: これで、ビジュアルインターフェイスの使用方法に関するガイドは終了です。ただし、これはスクリプトのチュートリアルなので、学習のために、手動で行う方法に飛び込みましょう!
pl: I na tym kończy się przewodnik, jak korzystać z interfejsu wizualnego. Jest to jednak samouczek skryptowy, więc aby się uczyć, zanurzmy się w podstawy tego procesu zawarte w kodzie!
pt_br: E isso conclui o guia sobre como usar a interface visual. Entretanto, isso é um tutorial de script, então, em nome do aprendizado, vamos mergulhar no processo manual!
uk: І цим закінчується урок про використання візуального інтерфейсу. Однак заради навчання давайте зануримось у ручний процес!
zh_cn: 这就结束了关于如何使用可视界面的指南。然而这是一个脚本教程，所以为了学习，让我们使用代码方法！
zh_tw: 到這裡就是如何使用視覺化界面的教學了。但這篇教學是腳本教學，所以，為了多學一點，來看看如何手動建立訊號連接吧！

source: To accomplish this, we will introduce a function that is probably the most used by Godot programmers: :ref:`Node.get_node() <class_Node_method_get_node>`. This function uses paths to fetch nodes anywhere in the scene, relative to the node that owns the script.
cs: Abychom toho dosáhli, představíme si funkci, která je pravděpodobně nejvíce používána programátory Godotu: :ref:`Node.get_node () <class_Node_method_get_node>`. Tato funkce používá relativní cestu vzhledem k uzlu, ve kterém se script nachází, k načtení libovolného uzlu této scény .
es: Para lograr esto, veremos una función que es probablemente la más usada por los programadores de Godot: :ref:`Node.get_node() <class_Node_method_get_node>`. Esta función utiliza rutas para recuperar nodos en cualquier parte de la escena, en relación con el nodo al que pertenece el script.
fi: Päämäärän saavuttamiseksi esittelemme funktion, joka on todennäköisesti Godot-ohjelmoijien eniten käyttämä funktio: :ref:`Node.get_node() <class_Node_method_get_node>`. Tämä funktio käyttää polkuja noutaakseen solmuja mistä tahansa skenestä, suhteessa solmuun joka omistaa skriptin.
fr: Pour accomplir cela, nous allons introduire une fonction qui est probablement la plus utilisée par les programmeurs Godot : :ref:`Node.get_node() <class_Node_method_get_node>`. Cette fonction utilise des chemins pour récupérer des nœuds n'importe où dans la scène, de manière relative au nœud qui possède le script.
it: Per fare questo, introdurremo una funzione, probabilmente la più utilizzata dai programmatori di Godot: :ref:`Node.get_node() <class_Node_method_get_node>`. Questa funzione utilizza i percorsi per prendere nodi da qualsiasi posto nella scena, relativa al nodo proprietario dello script.
ja: これを実現するために、おそらくGodotプログラマーが最も使用する:\ :ref:`Node.get_node() <class_Node_method_get_node>`\ を導入します。この関数は、パスを使用して、スクリプトを持つノードに関連する、シーン内の任意の場所のノードを見つけます。
pl: Aby to osiągnąć, wprowadzimy funkcję, która jest prawdopodobnie najczęściej używana przez programistów Godota: :ref:`Node.get_node() <class_Node_method_get_node>`. Ta funkcja używa ścieżek do pobierania węzłów w dowolnym miejscu sceny, względem węzła, który jest właścicielem skryptu.
pt_br: Para conseguir isso, nós lhe apresentaremos uma função que é provavelmente a mais usada por programadores Godot: :ref:`Node.get_node() <class_Node_method_get_node>`. Essa função usa caminhos para obter nós em qualquer lugar na cena, relativos ao nó que possui o roteiro.
uk: Для цього ми познайомимося з функцією, яку, мабуть, найбільше використовують програмісти Godot::ref:`Node.get_node() <class_Node_method_get_node>`. Ця функція використовує шляхи для отримання вузлів у будь-якій точці сцени, відносно вузла, якому належить скрипт.
zh_cn: 为了达成目的，我们先介绍一个可能是被Godot程序员使用最多的函数: :ref:`Node.get_node() <class_Node_method_get_node>`。该函数使用路径来获取场景中相对于该脚本的节点的任何位置的节点。
zh_tw: 為了手動建立連接，接下來我們要介紹 :ref:`Node.get_node() <class_Node_method_get_node>` ，這個函式可能所有 Godot 程式設計師最常用的函式。Node.get_node() 可以使用相對於該腳本節點的路徑來取得場景中任一節點。

source: Finally, connect the button's "pressed" signal to ``_on_Button_pressed()`` by using :ref:`Object.connect() <class_Object_method_connect>`.
cs: Nakonec připojte "pressed" signál tlačítka k ``_on_Button_pressed ()`` pomocí :ref:`Object.connect () <class_Object_method_connect>`.
ja: 最後に、\ :ref:`Object.connect() <class_Object_method_connect>` を使用して、ボタンの"pressed"シグナルを ``_on_Button_pressed()`` に接続します。
pt_br: Finalmente, conecte o sinal "pressed" do botão à função ``_ready()`` usando :ref:`Object.connect() <class_Object_method_connect>`.
uk: Нарешті, підключіть сигнал кнопки "pressed" (натиснуто) до ``_on_Button_pressed()``, використовуючи :ref:`Object.connect() <class_Object_method_connect>`.
zh_tw: 最後，通過 :ref:`Object.connect() <class_Object_method_connect>` 方法來把按鈕的「pressed」訊號連接至 ``_on_Button_pressed()`` 函式。

source: The 'advanced' panel of the connect dialogue is for binding specific values to the connected function's parameters. You can add and remove values of different types.
cs: Panel „Advanced“ v dialogu Connect slouží k vazbě specifických hodnot na parametry připojené funkce. Můžete přidávat a odebírat hodnoty různých typů.
ja: 接続ダイアログの右側の「高度な設定」パネルは、接続された関数の引数に特定の値をバインドするためのものです。さまざまな型の値を追加および削除できます。
zh_tw: 連接對話框中的「進階」面板中可用來將特定數值對應成函式參數，可以新增或移除不同型別的數值。

source: GDScript
cs: GDSkript

source: Before continuing, please make sure to read the :ref:`GDScript<doc_gdscript>` reference. It's a language designed to be simple, and the reference is short, so it will not take more than a few minutes to get an overview of the concepts.
es: Antes de continuar, asegúrate de leer la referencia :ref:`GDScript<doc_gdscript>`. Es un lenguaje diseñado para ser simple, y la referencia es corta, por lo que no tomará más que unos pocos minutos para obtener una visión general de los conceptos.
fi: Ennen jatkamista, varmista, että olet lukenut :ref:`GDScript<doc_gdscript>` lähdeaineiston. Se on yksinkertaiseksi suunniteltu kieli ja lähdeaineisto on lyhyt, joten käsitteistä saa yleiskuvan muutamassa minuutissa.
it: Prima di continuare, assicurati di aver letto il riferimento sul manuale del :ref:'GDScript<doc_gdscript>'. Si tratta di un linguaggio progettato per essere semplice, ed il riferimento è breve, quindi non ci vorranno più di pochi minuti per ottenere una panoramica dei concetti.
pl: Zanim przejdziesz dalej, przeczytaj dokument o :ref:`GDScript<doc_gdscript>`. Tekst nie jest długi, a język jest dość prosty, więc zorientowanie się w nim zajmie co najwyżej kilka minut.
pt_br: Antes de continuar, por favor leia a referência da :ref:`GDScript<doc_gdscript>`. É uma linguagem projetada para ser simples e a sua referência é curta, então não levará mais que poucos minutos para ter uma visão geral dos conceitos.
uk: Перш ніж продовжувати, переконайтеся, що прочитали посилання :ref:`GDScript<doc_gdscript>`. Це мова, покликана бути простою, а довідки короткими, тому для огляду термінів не знадобиться більше декількох хвилин.
zh_cn: 在继续之前，请务必阅读GDScript参考。它被设计为一种简单的语言，参考文献很简短，因此阐述这些概念并不会花费几分钟时间。

source: The top-left section displays a list of your scene's nodes with the emitting node's name highlighted in red. Select the "Panel" node here. When you select a node, the NodePath at the bottom will automatically update to point to a relative path from the emitting node to the selected node.
es: La parte superior izquierda muestra una lista de los nodos de la escena con el nombre del nodo emisor resaltado en rojo. Selecciona aquí el nodo "Panel". Cuando seleccionas un nodo, el NodePath en la parte inferior se actualizará automáticamente para apuntar a una ruta relativa desde el nodo emisor al nodo seleccionado.
fr: La section en haut à gauche affiche une liste des nœuds de votre scène avec le nom du nœud émetteur surligné en rouge. Sélectionnez ici le nœud "Panel". Quand vous sélectionnez un nœud, le NodePath en bas se mettra à jour automatiquement pour pointer vers un chemin relatif du nœud émetteur au nœud sélectionné.
it: La sezione in alto a sinistra ci mostra una lista di tutti i nodi della scena con il nome del nodo emittente evidenziato in rosso. Seleziona il nodo "Panel" da qui. Quando selezioni un nodo, la sezione NodePath sul fondo della schermata si aggiornerà automaticamente per puntare una path relativa dal nodo emittente al nodo selezionato.
zh_cn: 左上部分显示了您的场景节点列表，其中触发节点的名称以红色突出显示。在这里选择“Panel”节点。当您选择一个节点时，底部的NodePath将自动更新为触发节点到所选节点的相对路径。

source: Finally, connect the button's "pressed" signal to ``_ready()`` by using :ref:`Object.connect() <class_Object_method_connect>`.
es: Finalmente, conecta la señal "pressed" del botón a ``_ready()`` utilizando :ref:`Object.connect() <class_Object_method_connect>`.
fr: Pour terminer, connectez le signal "pressed" du bouton à ``_ready()`` en utilisant :ref:`Object.connect() <class_Object_method_connect>`.
it: Finalmente, connetti il segnale "pressed" del bottone a ``_ready()``, usando :ref:`Object.connect() <class_Object_method_connect>`.
zh_cn: 最后，通过 :ref:`Object.connect() <class_Object_method_connect>` 来连接按钮的 “pressed” 信号到 ``_ready()`` 。
