Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: It can also be used by programmers to build state machines or custom visual node workflows - for example, a dialogue system.
cs: Programátoři jej také mohou použít k vytváření stavových strojů nebo vlastních postupů pro obrazové uzly - například systému pro dialogy.
de: Es kann auch von Programmieren verwendet werden, um Zustandsautomaten oder eigene grafische Werkzeuge zu entwerfen - zum Beispiel ein Dialog System.
es: También lo pueden utilizar programadores para construir máquinas de estado o flujos de trabajo de nodos visuales personalizados - por ejemplo, un sistema de diálogo.
fi: Ohjelmoijat voivat myös käyttää sitä tilakoneiden tai mukautettujen visuaalisten solmutyönkulkujen, kuten dialogijärjestelmien, rakentamiseen.
fr: Il peut également être utilisé par les programmeurs pour construire des machines à états ou des systèmes de nœuds visuels personnalisés - par exemple, un système de dialogue.
it: Può anche essere usato dai programmatori per creare macchine di stato o diagrammi di nodi personalizzati - un sistema per i dialoghi, ad esempio.
ja: また、プログラマがステートマシンやカスタム・ビジュアルノード・ワークフロー(対話システムなど)を構築するためにも使用できます。
ko: 프로그래머에게는 이걸로 상태 시스템이나 사용자 지정 시각적 노드 워크플로우를 만들 수도 있습니다 - 예를 들면 대화 시스템이죠.
pl: Może być również używany przez programistów do budowania maszyn stanu lub niestandardowych wizualnych węzłów - na przykład systemu dialogowego.
pt_br: Também pode ser usado por programadores para construir máquinas de estado ou fluxos de trabalhos de nós visuais personalizados - por exemplo, um sistema de diálogo.
ru: Он также может использоваться программистами для создания машин состояний или пользовательских визуальных узлов рабочих процессов - например, диалоговой системы.
uk: Він також може бути використаний програмістами для створення машин станів, або спеціальних робочих процесів візуального вузла - наприклад, діалогової системи.
zh_cn: 程序员也可以用它创建状态机或自定义可视节点工作流程，例如对话系统。
zh_tw: 程式設計師也可以用視覺腳本來製作狀態機或是自定視覺節點工作流程 (如：對話框系統)。

source: As Microsoft's C# is a favorite amongst game developers, we have added official support for it. C# is a mature language with tons of code written for it, and support was added thanks to a generous donation from Microsoft.
cs: Protože Microsoft C # je mezi vývojáři her oblíbený, přidali jsme pro něj oficiální podporu. C # je vyspělý jazyk ve kterém jsou napsány tuny aplikaci a podpora byla přidána díky štědrému daru od společnosti Microsoft.
de: Da Microsofts C# eine beliebte Sprache bei Spielentwicklern ist, unterstützen wir sie nun offiziell. C# ist ein ausgewachsene Programmiersprache in der bereits große Mengen Code geschrieben wurden. Die Unterstützung wurde dank einer großzügigen Spende von Microsoft eingefügt.
es: Dado que Microsoft C# es uno de los favoritos entre los desarrolladores de juegos, hemos añadido soporte oficial para él. C# es un lenguaje maduro con una gran cantidad de código escrito para él, y el soporte se añadió gracias a una generosa donación de Microsoft.
fi: Koska Microsoftin C# on suosikki pelikehittäjien keskuudessa, olemme lisänneet sille virallisen tuen. C# on kehittynyt kieli, jolle on kirjoitettu läjäpäin koodia, ja tuki lisättiin kiitos Microsoftin runsaan lahjoituksen.
fr: Comme le C# de Microsoft est populaire parmi les développeurs de jeux, nous en avons ajouté le support officiel. C# est un langage mature avec des tonnes de code écrit pour lui, et son support a été ajouté grâce à un généreux don de Microsoft.
it: Dato che il C# di Microsoft è una preferenza per molti sviluppatori di videogiochi, abbiamo aggiunto il suo supporto ufficiale. Il C# è un linguaggio maturo con un'enorme quantità di codice già scritto, e il suo supporto è stato aggiunto grazie a una generosa donazione da Microsoft.
ja: マイクロソフトのC#はゲーム開発者の間でお気に入りなので、公式サポートを追加しました。C#は、大量のコードが書かれた成熟した言語であり、マイクロソフトからの寛大な寄付のおかげでサポートが追加されました。
ko: 마이크로소프트의 C#은 게임 개발자들 사이에서 사랑받는 언어이기에, 우리는 이걸 공식 지원합니다. C#은 많은 코드들로 작성된 완전한 언어로, 마이크로소프트의 풍부한 도움에 우리는 지원하게 되었습니다.
pl: Jako że C# Microsoftu jest faworytem wśród twórców gier, dodaliśmy oficjalne wsparcie dla niego. C# jest dojrzałym językiem z mnóstwem kodu napisanego w nim, a wsparcie zostało dodane dzięki hojnej darowiźnie od Microsoftu.
pt_br: Como a C# da Microsoft é uma favorita entre desenvolvedores de jogos, adicionamos suporte oficial para ela. C# é uma linguagem madura, com toneladas de código escritos para ela, e cujo suporte foi adicionado graças a uma generosa doação da Microsoft.
ru: Поскольку Microsoft C# является любимцем среди разработчиков игр, мы добавили официальную поддержку для него. C# - зрелый язык с тоннами кода, написанных для него, и его поддержка была добавлена благодаря щедрому пожертвованию от Microsoft.
uk: Оскільки Microsoft C# є улюбленою серед розробників ігор, ми додали офіційну підтримку для неї. C# - це зріла мова, на якій написано багато кодів, і підтримка була додана завдяки щедрій пожертві Microsoft.
zh_cn: 由于微软的C#是游戏开发者的最爱，我们增加了官方支持。C#是一种成熟的语言，人们为它编写了大量代码，而且支持得益于微软的慷慨捐赠。
zh_tw: 微軟的 C# 是很受遊戲開發者歡迎的語言，所以 Godot 也新增了對 C# 的官方支援。C# 是一個成熟的語言，有許多程式都是用 C# 寫的。要感謝微軟慷慨的捐款讓我們能夠支援 C#。

source: It has an excellent tradeoff between performance and ease of use, although one must be aware of its garbage collector.
cs: Představuje vynikající kompromis mezi výkonem a jednoduchostí použití, přesto si však člověk musí být vědom jeho automatické správy paměti.
de: C# hat eine exzellente Gewichtung zwischen Leistung und Nutzerfreundlichkeit. Man sollte sich allerdings seines 'Garbage Collectors' bewusst sein.
es: Tiene un excelente equilibrio entre rendimiento y facilidad de uso, aunque uno debe ser consciente de su recolector de basura.
fi: Se on erinomainen kompromissi suorituskykyä ja helppokäyttöisyyttä, vaikkakin sen roskienkerääjästä on syytä olla tietoinen.
fr: Il a un excellent compromis entre la performance et la facilité d'utilisation, bien que l'on doit être conscient de son ramasse-miettes.
it: Fornisce un eccellente bilanciamento tra performance e semplicità d'utilizzo, sebbene sia necessario essere consapevoli della presenza di un garbage collector.
ja: ガベージコレクタに注意する必要がありますが、パフォーマンスと使いやすさの間には優れたトレードオフがあります。
ko: 비록 가비지 컬랙터에 대해 알아야 하지만, 이것은 퍼포먼스와 사용의 용이성 두가지를 절충하고 있습니다.
pl: Charakteryzuje się doskonałym kompromisem między wydajnością a łatwością obsługi, choć trzeba mieć świadomość, że posiada oczyszczacz pamięci.
pt_br: Ela tem uma excelente relação de compromisso entre desempenho e facilidade de uso, embora tenha que se atentar para seu coletor de lixo.
ru: У него есть превосходный компромисс между производительностью и простотой использования, но нужно знать о его сборщике мусора.
uk: Він має відмінний компроміс між продуктивністю та простотою використання, хоча треба знати про його прибиральник сміття.
zh_cn: 它在性能和易用性之间有很好的折衷，但必须注意它的垃圾收集器。
zh_tw: C# 在易用度與效能間的平衡做得非常優秀，雖然需要注意一下記憶體回收行程。

source: C# is usually the best choice for companies. The large amount of programmers familiar with it means less time can be spent learning Godot and more time can be spent programming with it.
de: Für Unternehmen ist üblicherweise C# die beste Wahl, da viele Programmierer bereits Kenntnisse der Sprache haben. So muss weniger Zeit darauf verwendet werden, Godot kennenzulernen und mehr Zeit kann schneller in die aktive Entwicklung fließen.
ru: C#, как правило, лучший выбор для компаний. Большое количество программистов, знакомых с ним, означает то, что на обучение Godot можно потратить меньше времени, и сконцентрировать свои силы на самом программировании.

source: Since Godot uses the `Mono <https://mono-project.com>`_ .NET runtime, in theory any third-party .NET library or framework can be used for scripting in Godot, as well as any Common Language Infrastructure-compliant programming language, such as F#, Boo or ClojureCLR. In practice however, C# is the only officially supported .NET option.
cs: Protože Godot používá runtime `Mono <https://mono-project.com>`_ .NET, teoreticky lze pro skriptování v Godot i jakoukoli běžnou jazykovou infrastrukturu použít jakoukoli knihovnu nebo framework .NET od třetích stran. kompatibilní programovací jazyk, jako je F #, Boo nebo ClojureCLR. V praxi je však C # jedinou oficiálně podporovanou volbou .NET.
de: Da Godot `Mono <https://mono-project.com>`_ als .NET runtime verwendet, können viele .NET Bibliotheken und Frameworks von Drittanbietern, sowie Common Language Infrastructure-kompatible Programmiersprachen, wie zum Beispiel F#, Boo oder ClojureCLR, in Scripts verwendet werden. C# ist aber die einzige offiziell unterstützte .NET-Option.
es: Puesto que Godot utiliza el runtime `Mono <https://mono-project.com>`_.NET, en teoría cualquier librería o framework .NET de terceros se puede utilizar para scripting en Godot, así como cualquier lenguaje de programación compatible con Common Language Infrastructure, como F#, Boo o ClojureCLR. Sin embargo, en la práctica, C# es la única opción compatible oficialmente con .NET.
fi: Koska Godot käyttää `Mono <https://mono-project.com>`_ .NET ajoympäristöä, teoriassa mitä tahansa kolmannen osapuolen .NET kirjastoa tai kehysympäristöä voidaan käyttää Godotin skriptaamiseen, kuten myös mitä tahansa Common Language Infrastructure yhteensopivaa ohjelmointikieltä, kuten F#, Boo tai ClojureCLR. Käytännössä C# on kuitenkin ainoa virallisesti tuettu .NET vaihtoehto.
fr: Puisque Godot utilise les runtime .NET de `Mono <https://mono-project.com>`_, en théorie, n'importe quelle bibliothèque ou framework .NET tiers peut être utilisé pour scripter dans Godot, ainsi que n'importe quel langage de programmation compatible avec l'infrastructure de langage commun (CLI), comme F#, Boo ou ClojureCLR. En pratique, cependant, C# est la seule option .NET officiellement supportée.
it: Dato che Godot utilizza il runtime `Mono <https://mono-project.com>`_ .NET, teoricamente ogni libreria o framework .NET di terze parti può essere usata per scriptare in Godot, così come ogni altro linguaggio conforme infrastruttura del linguaggio comune, come F#, Boo o ClojureCLR. In pratica, però, il C# è l'unica opzione .NET supportata ufficialmente.
ja: Godotは\ `Mono <https://mono-project.com>`_ .NETランタイムを使用するため、理論的には、サードパーティの.NETライブラリまたはフレームワークをGodotのスクリプトに使用できます。また、F#、Boo、ClojureCLRなどの共通言語インフラストラクチャに準拠したプログラミング言語も使用できます。 ただし、実際には、C#が公式にサポートされている唯一の.NETオプションです。
ko: Godot가 `Mono <https://mono-project.com>`_ .NET 런타임을 사용하기 때문에, 이론적으로 어떤 제 3자 .NET 라이브러리나 프레임워크라도 Godot의 스크립트에 사용될 수 있고, F#, Boo, ClojureCLR와 같은 공용 언어 인프라 호환 프로그래밍 언어 또한 가능합니다. 하지만, 실제로는 C#만 공식으로 지원하는 .NET 옵션입니다.
pl: Odkąd Godot używa `Mono <https://mono-project.com>``_ .NET, w teorii można używać dowolnej biblioteki lub frameworka .NET, jak również dowolnego języka programowania zgodnego z Common Language Infrastructure, takiego jak F#, Boo lub ClojureCLR. W praktyce jednak C# jest jedyną oficjalnie obsługiwaną opcją .NET.
pt_br: Já que o Godot usa plataforma .NET `Mono <https://mono-project.com>`_, em teoria qualquer biblioteca ou infraestrutura .NET terceirizada pode ser usada para roteirizar no Godot, assim como qualquer linguagem de programação compatível com a Infraestrutura de Linguagem Comum (CLI), tais como F#, Boo ou ClojureCLR. Na prática, entretanto, C# é a única opção .NET com suporte oficial.
ru: Поскольку Godot использует среду выполнения `Mono <https://mono-project.com>`_.NET, теоретически любая сторонняя библиотека .NET или программная платформа может использоваться для написания скриптов в Godot, так же как любой CLR-совместимый язык программирования, такой как F#, Boo или ClojureCLR. Однако, на практике C# является единственным официально поддерживаемым .NET вариантом.
uk: Оскільки Godot використовує середовище `Mono <https://mono-project.com>`_ .NET, теоретично будь-яка стороння бібліотека .NET, або фреймворк, може використовуватися для написання скриптів у Godot, а також будь-яка мова програмування, сумісна з загальною мовною інфраструктурою, наприклад F#, Boo, або ClojureCLR. На практиці, однак, C# - єдиний офіційно підтримуваний варіант .NET.
zh_cn: 由于Godot使用 `Mono <https://mono-project.com>`_ .NET运行时，因此理论上任何第三方.NET库或框架都可用于编写Godot脚本，以及任何符合通用语言标准架构的语言，如F#、Boo或ClojureCLR。但实际上，C#是唯一官方支持的.NET选项。
zh_tw: Godot 使用了 `Mono <https://mono-project.com>`_ .NET 執行環境，理論上任一第三方 .NET 函式庫或框架都可以拿來在 Godot 裡使用。同樣的，理論上其他 CLI (Common Language Infrastructure，通用語言基礎結構) 相容的程式語言也都能使用，如 F#, Boo 或是 ClojureCLR。但 C# 是唯一官方支援的 .NET 選項。

source: Finally, one of our brightest additions for the 3.0 release: GDNative allows scripting in C++ without needing to recompile (or even restart) Godot.
cs: A konečně, jeden z našich nejzářivějších přídavků pro verzi 3.0: GDNative umožňuje skriptování v C ++, aniž by bylo nutné překompilovat (nebo dokonce restartovat) Godota.
de: Zu guter Letzt eine unserer cleversten Neuerungen in Version 3.0: GDNative ermöglicht es, Skripte in C++ zu schreiben, ohne Godot zu rekompilieren oder neuzustarten.
es: Finalmente, una de nuestros añadidos más brillantes para la versión 3.0: GDNative permite la creación de scripts en C++ sin necesidad de recompilar (o incluso reiniciar) Godot.
fi: Viimein, yksi loistavimmista lisäyksistämme 3.0 julkaisuun: GDNative mahdollistaa C++ skriptauksen ilman että Godotia tarvitsee kääntää uudelleen (tai edes käynnistää uudelleen).
fr: Enfin, l'un de nos plus brillants ajouts pour la version 3.0 : GDNative permet de scripter en C++ sans avoir besoin de recompiler (ou même de redémarrer) Godot.
it: Infine, una delle nostre aggiunte più brillanti per la versione 3.0: GDNative permette di scriptare in C++ senza il bisogno di ricompilare (o anche solo di riavviare) Godot.
ja: 最後に、3.0リリースにおいて特に輝かしい追加物の1つ: GDNativeを使用すると、Godotを再コンパイル(または再起動すら)しなくてもC++でスクリプトを作成できます。
ko: 마침내 3.0 출시에 가장 빛나는 추가 요소: GDNative는 Godot를 다시 컴파일 하지 않아도 (심지어 재시작을 하지않아도) C++에서 스크립팅 할 수 있게 만듭니다.
pl: Wreszcie, jeden z naszych najjaśniejszych dodatków do wydania 3.0: GDNative umożliwia pisanie skryptów w C++ bez konieczności rekompilowania (a nawet restartu) Godota.
pt_br: Finalmente, uma das nossas adições mais brilhantes à versão 3.0: GDNative permite roteirizar em C++ sem precisar recompilar (ou mesmo reiniciar) o Godot.
ru: Наконец, одно из наших самых ярких дополнений для версии 3.0: GDNative позволяет создавать скрипты на C++ без необходимости перекомпилировать (или даже перезапускать) Godot.
uk: Нарешті, одне з наших найяскравіших доповнень до версії 3.0: GDNative дозволяє створювати скрипти на C ++, не потребуючи перекомпіляції (або навіть перезавантаження) Godot.
zh_cn: 最后是3.0版本的一个亮点:GDNative允许在C++中编写脚本，无需重新编译(甚至都不用重启)Godot。
zh_tw: 最後是 3.0 版所新增的亮點：GDNative。使用 GDNative 就可以在不需要重新編譯 (甚至重新啟動) Godot 的情況下以 C++ 來寫腳本。

source: Any C++ version can be used, and mixing compiler brands and versions for the generated shared libraries works perfectly, thanks to our use of an internal C API Bridge.
cs: Lze použít libovolnou verzi C ++ a mix kompilátorů či verzí pro vygenerované sdílené knihovny funguje perfektně díky našemu použití interního C API.
de: Jede C++ Version kann benutzt werden, und dank unserer internen C API Brücke ist das Mischen verschiedener Compiler und Compiler-Versionen zum Generieren der Programmbibliotheken kein Problem.
es: Se puede utilizar cualquier versión de C++, y la combinación de marcas y versiones de compiladores para las bibliotecas compartidas generadas funciona perfectamente, gracias al uso de nuestro C API Bridge interno.
fi: Mitä tahansa C++ versiota voidaan käyttää, ja eri kääntäjien ja versioiden sekoittaminen jaettujen kirjastojen luomiseksi toimii täydellisesti käyttämämme sisäisen C API sillan ansiosta.
fr: N'importe quelle version de C++ peut être utilisée, et mélanger des compilateurs de divers éditeurs et versions pour les bibliothèques partagées générées fonctionne parfaitement, grâce à l'utilisation d'un bridge interne d'API en C.
it: Qualsiasi versione di C++ può essere usata, e mescolare diversi compilatori e versioni di questi per le librerie generate funziona perfettamente, grazie all'utilizzo interno di un API bridge in C.
ja: 内部C API Bridgeを使用しているため、任意のC++バージョンを使用することができ、生成された共有ライブラリ用のコンパイラブランドとバージョンが混在していても完全に機能します。
ko: 모든 C++버전을 사용할 수 있으며, 내부 C API Bridge를 사용하여 생성된 공유 라이브러리의 컴파일러 브랜드와 버전을 완벽하게 혼합할 수 있습니다.
pl: Można używać każdej wersji C++, a dzięki zastosowaniu wewnętrznego mostu C API Bridge doskonale działa mieszanie kompilatorów i wersji dla generowanych bibliotek współdzielonych.
pt_br: Qualquer versão da C++ pode ser usada, e misturar marcas e versões de compiladores para as bibliotecas compartilhadas geradas funciona perfeitamente; tudo graças ao nosso uso de uma ponte de API C interna.
ru: Любая версия C++ может быть использована, а смешение брендов и версий компиляторов для сгенерированных общих библиотек прекрасно работает благодаря нашему использованию внутреннего C API Моста.
uk: Може бути використана будь-яка версія C++, прекрасно працює змішування брендів та версій компілятора для створення спільних бібліотек, завдяки нашому використанню внутрішнього моста C API.
zh_cn: 任意C++版本都可以使用，由于我们在内部使用了C API Bridge，混合编译器和生成的共享库都可以完美工作。
zh_tw: 可以使用任一版本的 C++。而因為使用了內部 C API Bridge，也可以正常使用由不同編譯器產生的共用函式庫。

source: This language is the best choice for performance and does not need to be used throughout an entire game, as other parts can be written in GDScript or Visual Script. However the API is clear and easy to use as it resembles, mostly, Godot's actual C++ API.
de: Diese Sprache ist die beste Wahl, wenn die Leistung im Vordergrund steht, und muss nicht für die gesamte Entwicklung verwendet werden, da andere Teile in GDScript oder Visual Script realisiert werden können. Allerdings ist die API klar und einfach zu benutzen, denn sie ähnelt Godot's tatsächlicher C++ API stark.
es: Este lenguaje es la mejor opción por rendimiento y no es necesario que se use en todo el juego, ya que otras partes se pueden escribir en GDScript o Visual Script. Sin embargo, la API es clara y fácil de usar, ya que se parece, en su mayoría, a la API C++ actual de Godot.
fr: Ce langage est le meilleur choix pour la performance et n'a pas besoin d'être utilisé tout au long d'un jeu, car d'autres parties peuvent être écrites en GDScript ou en Visual Script. Cependant, l'API est claire et facile à utiliser car elle ressemble, pour la plupart, à l'API C++ de Godot.
it: Questo linguaggio è il migliore in quanto a performance e non deve essere per forza utilizzato in tutto il gioco, in quanto altre parti possono essere scritte in GDScript o Visual Script. In ogni caso l'API è chiara e semplice da usare in quanto somiglia, per lo più, all'effettiva API C++ di Godot.
ko: 이 언어는 훌륭한 성능을 가지며, GDScript또는 VisualScript을 통해 다른 부분을 작성할 수 있으므로 게임 전체에서 사용할 필요는 없습니다. 그러나 이 API는 명확하고 사용하기 쉽습니다. 이 API의 대부분은 Godot의 실제 C++API와 유사하기 때문이죠.
ru: Этот язык является лучшим выбором для производительности и не должен использоваться во всей игре, так как другие части могут быть написаны в GDScript или Visual Script. Однако API ясен и прост в использовании, так как по большей части он похож на C++ API Godot.
zh_cn: 这种语言是性能上的最佳选择，它不需要在整个游戏中都使用，因为其他部分可以用GDScript或Visual Script编写。它的API清晰且易于使用，类似于Godot的C++ API。

source: More languages can be made available through the GDNative interface, but keep in mind we don't have official support for them.
cs: Prostřednictvím rozhraní GDNative lze zpřístupnit více jazyků, ale mějte na paměti, že pro ně nemáme oficiální podporu.
de: Weitere Programmiersprachen können mittels der GDNative Schnittstelle verfügbar gemacht werden, diese werden allerdings nicht offiziell von uns unterstützt.
es: Se podrían utilizar más lenguajes a través de la interfaz de GDNative, pero debes tener en cuenta que no tenemos soporte oficial para ellos.
fi: Useampia kieliä voidaan tehdä saataville GDNative-rajapinnan kautta, mutta pidä mielessä, että niille ei ole virallista tukea.
fr: D'autres langues peuvent être rendues disponibles via l'interface GDNative, mais gardez à l'esprit que nous n'avons pas de support officiel pour eux.
it: Altri linguaggi possono essere resi disponibili attraverso l'interfaccia di GDNative, ma tieni a mente che non avranno supporto ufficiale.
ja: GDNativeインターフェイスを通じて(C++以外の)より多くの言語を利用できますが、正式なサポートはありません。
ko: GDNative 인터페이스를 통해 더 많은 언어를 사용할 수 있지만, 이 인터페이스에 대한 공식적인 지원은 없습니다.
pl: Poprzez interfejs GDNative można udostępnić więcej języków, ale pamiętajmy, że nie mamy dla nich oficjalnego wsparcia.
pt_br: Mais linguagens podem ser disponibilizadas através da interface GDNative, mas tenha em mente que não damos suporte oficial a elas.
ru: Больше языков могут быть доступны через интерфейс GDNative, но имейте в виду, что у нас нет официальной поддержки для них.
uk: Більше мов можна отримати через інтерфейс GDNative, але майте на увазі, що у нас немає офіційної підтримки для них.
zh_cn: 通过GDNative接口可以使用更多语言，但请记住我们没有官方支持。
zh_tw: 還能通過 GDNative 的介面來支援更多語言，但請記得 Godot 對其他語言並無官方支援。

source: Scripting a scene
cs: Skriptování scény
de: Eine Szene skripten
es: Scripting de una escena
fi: Skenen skriptaus
fr: Scripter une scène
it: Scripting di una scena
ja: シーンのスクリプト
ko: 씬 스크립팅 하기
pl: Tworzenie skryptu dla sceny
pt_br: Roteirizando uma cena
ru: Создание сценариев сцены
uk: Написання скриптів сцени
zh_cn: 编写场景脚本
zh_tw: 為場景編寫腳本

source: For the rest of this tutorial we'll set up a GUI scene consisting of a button and a label, where pressing the button will update the label. This will demonstrate:
cs: Po zbytek tohoto tutoriálu vytvoříme scénu GUI, která se skládá z tlačítka a popisku, kde stisknutím tlačítka aktualizuje popisek. To nám ukáže:
de: Für den Rest dieser Einleitung werden wir eine GUI Szene, bestehend aus einem Text und einem Knopf, der bei Betätigung den Text aktualisiert, erstellen. Dies wird demonstrieren:
es: Para el resto de este tutorial configuraremos una escena GUI que consistirá en un botón y una etiqueta, donde al pulsar el botón se actualizará la etiqueta. Esto lo demostrará:
fi: Oppaan jäljellä olevassa osassa rakennamme GUI-skenen, joka koostuu painikkeesta ja selitteestä, ja jossa painikkeen painaminen päivittää selitettä. Tämä havainnollistaa:
fr: Pour le reste de ce tutoriel, nous allons mettre en place une scène GUI composée d'un bouton et d'un label, où le fait d'appuyer sur le bouton mettra à jour le label. Cela démontrera :
it: Per il resto di questo tutorial, creeremo un'interfaccia grafica (GUI), costituita da un pulsante e da un'etichetta, dove premendo il primo si aggiornerà il contenuto della seconda. Questo dimostrerà:
ja: このチュートリアルの残りの部分では、ボタンとラベルで構成されるGUI シーンを設定し、ボタンを押す事でラベルを更新してみます。これは、次のことを示します:
ko: 본 튜토리얼의 나머지 부분에서는 버튼과 레이블로 구성된 GUI 씬을 설정합니다. 여기서 버튼을 누르면 라벨이 업데이트됩니다. 이를 통해 다음을 증명할 수 있습니다:
pl: Na resztę tego samouczka tworzymy scenę GUI składającą się z przycisku(button) i etykiety(label), gdzie naciśnięcie przycisku spowoduje aktualizację etykiety. Tak się to demonstruje:
pt_br: No resto deste tutorial, configuraremos uma cena de interface gráfica contendo um botão e um rótulo, em que pressionar um botão altera o rótulo. Isto será demonstrado:
ru: В оставшейся части этого урока мы настроим сцену с графическим интерфейсом, состоящую из кнопки и ярлыка, где нажатие кнопки будет обновлять ярлык. Продемонстрируем это:
uk: В решті цього уроку ми створимо графічний інтерфейс, що складається з кнопки та мітки, де натискання кнопки оновить мітку. Ми розглянемо:
zh_cn: 在教程剩下的部分里，我们将建立一个GUI场景，包含一个按钮和一个标签，当按下按钮时标签会更新。这将会演示:
zh_tw: 我們會在這篇教學接下來的部分建立一個 GUI 場景，其中有按鈕與標籤。按下按鈕後會更新標籤。我們會示範：
