Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: For the sake of convenience, delete everything underneath ``extends Panel``. You will fill out the rest of the script manually.
cs: Pro větší pohodlí smažte vše pod ``extends Panel``. Zbytek skriptu vyplníte ručně.
de: Einfachheitshalber lösche alles unterhalb von ``extends Panel``. Wir werden den Rest des Skriptes manuell ausfüllen.
es: Para mayor comodidad, borra todo lo que se encuentra debajo de ``extends Panel``. Rellenarás el resto del script manualmente.
fi: Homman helpottamiseksi, poista kaikki ``extends Panel`` alapuolella oleva. Tulet täyttämään loput skriptistä käsin.
fr: Par souci de praticité, supprimez tout en dessous de ``extends Panel``. Vous remplirez le reste du script manuellement.
it: Per convenienza, cancella tutto quanto sotto ``extends Panel``. Riepirai il resto dello script manualmente.
ja: 便宜上、スクリプト内の ``extends Panel`` より下にあるすべてのものを削除します。そしてスクリプトの残りの部分を手動で入力します。
ko: 편의상, ``extend Panel`` 아래에 있는 모든 것을 지우세요. 당신이 나머지를 수동으로 채울 것입니다.
pl: Dla wygody usuwa wszystko pod ``rozszerza Panel``. Resztę skryptu wypełnisz ręcznie.
pt_br: Por conveniência, apague tudo abaixo de ``extends Panel``. Você preencherá o resto do roteiro à mão.
ru: Для удобства удалите все под ``extends Panel``. Вы заполните остальную часть сценария вручную.
uk: Для зручності видаліть усе, що знаходиться під ``extends Panel``. Ви заповните решту частину скрипту вручну.
zh_cn: 为了方便起见，删除 ``extends Panel`` 下的所有内容。您要手动填写脚本的其余部分。
zh_tw: 但為了方便起見，先把所有 ``extends Panel`` 下面所有的東西都刪除。接下來我們要手動填寫剩下的腳本。

source: Because the Button and Label are siblings under the Panel where the script is attached, you can fetch the Button by typing the following underneath the ``_ready()`` function:
cs: Protože Button a Label jsou sourozenci v Panel, ke kterému je skript připojen, můžete Button načíst zadáním následujícího pod funkci ``_ready()``:
de: Da Button und Label Unternodes unter Panel sind, an welches dieses Skript angefügt ist, ist es möglich Button zu finden indem folgendes unter die ``_ready()``-Funktion hinzugefügt wird:
es: Dado que el Botón y la Etiqueta son hermanos en el Panel donde se adjunta el script, puedes recuperar el Botón escribiendo lo siguiente debajo de la función ``_ready()``:
fi: Koska Button ja Label ovat naapurisolmuja Panel-solmun, johon skripti on liitetty, alla, voit noutaa Button solmun kirjoittamalla seuraavan ``_ready()`` funktion alle:
fr: Puisque les noeuds Button et Label sont jumelés sous le Panel où est attaché le script, vous pouvez récupérer le Button en tapant ceci sous la fonction ``_ready()`` :
it: Perché il Button e Label sono entrambi figli di Panel, dove lo script si trova, puoi prendere il Button scrivendo il seguente sotto la funzione ``_ready()``:
ja: ButtonとLabelはスクリプトがアタッチされているPanelの下の兄弟(同じ階層にある子要素)であるため、 ``_ready()`` 関数の下に次のように入力するとButtonをフェッチできます:
ko: 버튼과 라벨은 스크립트가 붙어있는 패널의 자식이기 때문에, 밑의 ``_ready()`` 함수를 따라 타이핑해서 버튼을 가져올 수 있습니다:
pl: Ponieważ Przycisk i Etykieta są spokrewnione w panelu, do którego dołączony jest skrypt, możesz przywołać Przycisk wpisując poniższe zdanie poniżej funkcji ``ready()``:
pt_br: Pelo fato de Botão e Rótulo serem irmãos entre si e filhos de Painel, aonde o roteiro foi anexado, você pode obter o Botão digitando a seguinte função ``_ready()``:
ru: Поскольку Button и Label являются братьями по отношению к Panel, к которой прикреплен сценарий, вы можете выбрать Button, набрав следующее под функцией ``_ready()``:
uk: Оскільки Button (кнопка) та Label (мітка) обоє нащадки Panel (панелі), якій додається скрипт, ви можете отримати кнопку, ввівши в функції ``_ready()`` наступне :
zh_cn: 由于Button和Label是有脚本附加的Panel下的兄弟节点，因此可以通过在 ``_ready()`` 函数下输入以下内容来获取Button引用:
zh_tw: 由於 Button 與 Label 為腳本所附加之 Panel 節點的同級節點，所以可以在 ``_ready()`` 函式中輸入以下內容來取得 Button 節點：

source: Next, write a function which will be called when the button is pressed:
cs: Dále napište funkci, která bude vyvolána po stisknutí tlačítka:
de: Als nächstes schreibe eine Funktion welche aufgerufen wird, wenn auf die Schaltfläche von "Button" geklickt wird:
es: A continuación, escribe una función que se llamará cuando se pulse el botón:
fi: Seuraavaksi, kirjoita funktio, jota kutsutaan, kun painiketta on painettu:
fr: Ensuite, écrivez une fonction qui sera appelée quand le bouton est pressé :
it: Poi, scrivi una funzione che sarà chiamata quando il bottone sarà premuto:
ja: 次に、ボタンを押したときに呼び出される関数を書きます:
ko: 그런 다음 버튼을 누르면 호출되는 기능을 작성합니다:
pl: Następnie należy zapisać funkcję, która zostanie wywołana po naciśnięciu przycisku:
pt_br: Em seguida, escreva uma função que será chamada quando o botão for pressionado:
ru: Затем напишите функцию, которая будет вызываться при нажатии кнопки:
uk: Далі напишіть функцію, яка буде викликана при натисканні кнопки:
zh_cn: 接下来，写一个函数，按钮按下时它会被触发:
zh_tw: 接下來，寫一個按鈕按下後要呼叫的函式：

source: Finally, connect the button's "pressed" signal to ``_ready()`` by using :ref:`Object.connect() <class_Object_connect>`.
de: Abschließend verbinde das "pressed"-Signal in der ``_ready()``-Funktion mit dem Funktionsaufruf :ref:`Object.connect() <class_Object_connect>`.
ko: 마지막으로 버튼의 "누름" 신호를 :ref:`Object.connect() <class_Object_connect>` 을 사용하여 ``_Ready`` 에 연결합니다.
ru: Наконец, подключите сигнал "pressed" к функции ``_ready()``, используя :ref:`Object.connect() <class_Object_connect>`.

source: The final script should look like this:
cs: Výsledný skript by měl vypadat takto:
de: Des endgültige Skript sollte wie folgt aussehen:
es: El script final debería verse así:
fi: Lopullisen skriptin pitäisi näyttää tältä:
fr: Le script final devrait ressembler à ça :
it: Lo script finito dovrebbe essere così:
ja: 最後のスクリプトは次のようになります:
ko: 최종 스크립트는 다음과 같아야 합니다:
pl: Końcowy scenariusz powinien tak wyglądać:
pt_br: O roteiro final deveria se parecer com isto:
ru: В итоге сценарий должен выглядеть так:
uk: Врешті скрипт повинен виглядати так:
zh_cn: 脚本最终看起来是这个样子:
zh_tw: 腳本最終看起來應該長這樣：

source: Run the scene and press the button. You should get the following result:
cs: Spusťte scénu a stiskněte tlačítko. Měli byste získat následující výsledek:
de: Starte die Szene und klick auf die Schaltfläche. Dies sollte zu folgenden Ergebnis führen:
es: Ejecuta la escena y pulsa el botón. Deberías obtener el siguiente resultado:
fi: Aja skene ja paina painiketta. Sinun pitäisi saada seuraava tulos:
fr: Lancez la scène et appuyez sur le bouton. Vous devriez obtenir le résultat suivant :
it: Esegui la scena e premi il pulsante. Dovresti avere il seguente risultato:
ja: シーンを実行し、ボタンを押します。次の結果が得られます:
ko: 씬을 실행하고 버튼을 누르면 다음과 같은 결과를 얻을 수 있습니다:
pl: Uruchom scenę i naciśnij przycisk. Powinieneś otrzymać następujący wynik:
pt_br: Execute a cena e pressione o botão. Você deveria obter o seguinte resultado:
ru: Запустите сцену и нажмите кнопку. Вы должны получить следующий результат:
uk: Запустіть сцену і натисніть кнопку. Ви повинні отримати такий результат:
zh_cn: 运行场景并按下按钮，您应该看到这个结果:
zh_tw: 執行場景然後點擊按鈕，應該會得到下列結果：

source: Why, hello there! Congratulations on scripting your first scene.
cs: Ahoj, ahoj! Gratulujeme k skriptování vaší první scény.
de: Oh, immer noch hier? Glückwunsch zum Skripten der ersten Szene.
es: ¡Vaya, hola! Felicidades por el script de tu primera escena.
fi: No mutta, terve! Onnittelut ensimmäisen skenesi skriptaamisesta.
fr: Eh bien ! Félicitations, vous venez de scripter votre première scène.
it: Hey! Congratulazioni nel codificare la tua prima scena.
ja: あら、hello!と表示されました。最初のシーンのスクリプト作成、おめでとうございます。
ko: 어머, 안녕하세요! 첫번째 씬을 스크립팅 하신 것을 축하 드립니다.
pl: Witaj! Gratulujemy oskryptowania pierwszej sceny.
pt_br: Uau, olha ssó! Parabéns por roteirizar sua primeira cena.
ru: Поздравляем с написанием сценария к вашей первой сцене.
uk: Вітаємо вас із написанням скрипту до вашої першої сцени.
zh_cn: 您好啊！恭喜您完成了您的第一个场景脚本。
zh_tw: 不錯，Hello！恭喜你為第一個場景寫了腳本。

source: A common misunderstanding regarding this tutorial is how ``get_node(path)`` works. For a given node, ``get_node(path)`` searches its immediate children. In the above code, this means that Button must be a child of Panel. If Button were instead a child of Label, the code to obtain it would be:
cs: Častým nedorozuměním ohledně tohoto tutoriálu je to, jak funguje ``get_node (cesta)`` . Pro daný uzel prochází ``get_node (cesta)`` jeho bezprostřední potomky. Ve výše uvedeném kódu to znamená, že Button musí být potomkem Panel. Pokud by Button byl místo toho podřízeným Label, kód pro jeho získání by byl:
de: Ein verbreitetes Missverständnis bezüglich dieser Anleitung ist die Funktionsweise der ``get_node(path)``-Funktion. Für ein gegebenes Node, ``get_node(path)`` sucht die unmittelbaren Unternodes. In dem Programmcode oberhalb bedeutet das, dass Button unterhalb von Panel angehängt sein muss. Wäre Button stattdessen unterhalb von Label angesiedelt, dann müsste der Funktionsaufruf folgendermaßen abgeändert werden:
es: Un malentendido común con respecto a este tutorial es cómo funciona ``get_node(path)``. Para un nodo concreto, ``get_node(path)`` busca a sus hijos inmediatos. En el código anterior, esto significa que Button debe ser hijo de Panel. Si Button fuera en cambio un hijo de Label, el código para obtenerlo sería:
fi: Yleinen väärinkäsitys tätä opasta koskien on, että kuinka ``get_node(path)`` toimii. Mille tahansa annetulle solmulle, ``get_node(path)`` etsii sen välittömistä alisolmuista. Yllä olevassa koodissa tämä tarkoittaa, että Button solmun on oltava Panel solmun alisolmu. Jos Button olisi sen sijaan Label solmun alisolmu, koodi, jolla se noudetaan, olisi:
fr: Une incompréhension fréquente vis-à-vis de ce tutoriel est comment ``get_node(path)`` marche. Pour un noeud donné, ``get_node(path)`` cherche dans ses enfants directs. Dans le code ci-dessus, cela signifie que Button doit être un enfant de Panel. Si Button était plutôt un enfant de Label, le code pour le récupérer serait :
it: Una comune incomprensione riguardante questo tutorial è come ``get_node(path)`` funzioni. Per un nodo dato, ``get_node(path)`` ricerca il proprio figlio immediato. Nel codice soprastante, questo significa che Button deve essere un figlio di Panel. Se Button invece fosse stato figlio di Label, il codice ottenuto sarebbe stato così:
ja: このチュートリアルに関するよくある誤解は、 ``get_node(path)`` の仕組みです。 特定のノードについて、 ``get_node(path)`` はその直接の子を検索します。 上記のコードでは、これはButtonがPanelの子でなければならないことを意味します。 ButtonがLabelの子である場合、取得するコードは次のようになります:
ko: 이 튜토리얼에 관한 흔한 오해는 ``get_node(path)`` 가 작동하는 방법입니다. 주어진 노드의 경우, ``get_node(path)`` 는 직계 자식을 검색합니다. 위 코드에서 버튼은 패널의 자식임을 의미합니다. 만일 버튼이 패널이 아닌 라벨의 하위 항목이라면 얻게 될 코드는 다음과 같습니다:
pt_br: Um engano comum ao acompanhar este tutorial é como ``get_node(caminho)`` funciona. Para um certo nó, ``get_node(caminho)`` busca em seus filhos imediatos. No código acima, isso significa que Botão deve ser um filho de Painel. Se Botão fosse na verdade filho de Rótulo, o código para obtê-lo seria:
ru: Общим недопониманием в отношении этого урока является то, как работает ``get_node(path)``. Для данного узла ``get_node(path)`` ищет своих непосредственных детей. В приведенном выше коде это означает, что Button должен быть дочерним элементом Panel. Если бы Button был дочерним элементом Label, код для его получения выглядел бы так:
uk: Багато-хто з цього уроку не може зрозуміти, як працює ``get_node(path)``. Для заданого вузла ``get_node(path)`` шукає своїх безпосередніх нащадків. У наведеному вище коді це означає, що Button (Кнопка) повинна бути нащадком Panel (Панелі). Якби Кнопка була нащадком Label (Мітки), кодом для її отримання було б:
zh_cn: 本教程的一个常见的误解是 ``get_node(path)`` 的工作原理。对于给定节点， ``get_node(path)`` 搜索它的直接子节点。在上面代码中，Button必须是Panel的子项。如果Button是Label的子项，则获得它的代码是:
zh_tw: 在這個教學中，很對人會誤解 ``get_node(path)`` 的使用方法。在一個節點中， ``get_node(path)`` 會搜尋該節點的直接子代。在上面的程式碼中，Button 必須是 Panel 的子節點。如果 Button 是 Label 的子節點的話，那麼程式碼要寫成這樣：

source: Also, remember that nodes are referenced by name, not by type.
cs: Nezapomeňte také, že na uzly se odkazuje jejich jménem, nikoli typem.
de: Des Weiteren beachte, das Nodes über den Namen referenziert werden und nicht über den Typ.
es: También, recuerda que los nodos se referencian por nombre, no por tipo.
fi: Muista myös, että solmuihin viitataan nimellä, ei tyypillä.
fr: Souvenez-vous aussi que les noeuds sont référencés par nom, pas par type.
it: Inoltre, ricorda che i nodi sono ottenibili dal loro nome, non dal loro tipo.
ja: また、ノードは型ではなく名前で参照される点に注意してください。
ko: 또한 노드는 유형이 아닌 이름으로 참조됩니다.
pl: Pamiętaj, że do referencji danego węzła odnosimy się po jego nazwie, nie typie.
pt_br: Além disso, lembre-se de que os nós são referenciados por nome, e não por tipo.
ru: Кроме того, помните, что узлы ссылаются по имени, а не по типу.
uk: Також пам'ятайте, що вузли посилаються на назву, а не тип.
zh_cn: 另外，注意节点是通过节点名，而不是类型来获取的。
zh_tw: 另外，也請記得參照的是節點名稱而不是型別。

source: The right-hand panel of the connect dialogue is for binding specific values to the connected function's parameters. You can add and remove values of different types.
de: Die rechtsseitige Ansicht im "Signal verbinden"-Dialogfenster ist für die Übergabe spezifischer Werte an den verbundenen Funktionsaufruf. Hier können Werte verschiedener Typen hinzugefügt oder entfernt werden.
es: El panel derecho del diálogo de conexión sirve para vincular valores específicos a los parámetros de la función conectada. Puedes añadir y eliminar valores de diferentes tipos.
fi: Kytkentäikkunan oikeanpuoleinen paneeli on olemassa tiettyjen arvojen liittämiseksi funktion parametreihin. Voit lisätä ja poistaa erityyppisiä arvoja.
fr: Le panneau de droite de la fenêtre de connexion sert à lier des valeurs spécifiques aux paramètres de la fonction connectée. Vous pouvez ajouter et enlever des valeurs de différents types.
it: Il pannello di destra, nella finestra di connessione, serve per associare valori specifici ai parametri della funzione collegata. È possibile aggiungere e rimuovere valori di diversi tipi.
ko: 연결 대화 상자의 오른쪽 패널은 특정 값을 연결된 함수의 매개변수에 바인딩 하기 위한 것입니다. 다른 유형의 값을 추가하거나 제거할 수 있습니다.
pl: Panel, znajdujący się po prawej stronie okna połączeń służy do wiązania określonych wartości do parametrów połączonych funkcji. Możesz dodawać i usuwać wartości różnych typów.
pt_br: O painel à direita do diálogo de conexão é para ligar valores específicos aos parâmetros da função conectada. Você pode adicionar e remover valores de diferentes tipos.
ru: Правая панель диалога подключения предназначена для привязки определенных значений к параметрам подключенной функции. Вы можете добавлять и удалять значения разных типов.
uk: Права панель діалогу підключення призначена для прив'язки конкретних значень до параметрів підключеної функції. Можна додавати та вилучати значення різних типів.
zh_cn: 连接对话框的右侧面板用于将特定值绑定到连接函数的参数。您可以添加和删除不同类型的值。

source: The code approach also enables this with a 4th ``Array`` parameter that is empty by default. Feel free to read up on the ``Object.connect`` method for more information.
cs: Skriptovací přístup toto také umožňuje pomocí 4. parametru ``Array`` , který je ve výchozím nastavení prázdný. Pro více informací si přečtěte o metodě ``Object.connect`` .
de: Die Programmiermethode erlaubt die selbe Funktionalität mit dem vierten Parameter im Funktionsaufruf, welcher Standardmäßig leer ist. Mehr Information dazu kann unter der ``Object.connect``-Funktion nachgelesen werden.
es: El enfoque de código también permite esto con un 4º parámetro ``Array`` que está vacío por defecto. Tómate la libertad de leer sobre el método ``Object.connect`` para más información.
fi: Koodilähestymistapa mahdollistaa tämän myös neljännelle ``Array`` parametrille, joka on oletusarvoisesti tyhjä. Ole hyvä ja lukaise ``Object.connect`` metodin ohje lisätietoja varten.
fr: La méthode par le code permet aussi cela avec un 4ème paramètre de type ``Array`` qui est vide par défaut. N'hésitez pas à vous renseigner sur la méthode ``Object.connect`` pour plus d'informations.
it: L'approccio attraverso il codice permette inoltre l'utilizzo di un quarto parametro di tipo ``Array``che di default è vuoto. Sentiti libero di leggere il metodo `` Object.connect`` per maggiori informazioni.
ja: コードアプローチでは、デフォルトでは空の、4番目の ``Array`` パラメータを使用して、これも有効にします。詳細については、 ``Object.connect`` メソッドをお読みください。
ko: 코드 접근도 기본적으로 비어 있는 4번째 ``배열`` 매개 변수를 사용하여 이를 가능하게 합니다. 더 많은 정보를 원하시면 언제든지 ``Object.connect`` 방법에 대해 읽어 보시기 바랍니다.
pl: Podejście z użyciem kodu również pozwala na takie przypisania poprzez użycie czwartego parametru, ``Array``, którego wartość domyślnie jest pusta. Możesz dowiedzieć się więcej na ten temat, czytając o metodzie ``Object.connect``.
pt_br: A abordagem por código também permite isso com um quarto parâmetro do tipo ``Array``, que é vazio por padrão. Sinta-se livre para ler a referência do método `Object.connect`` para mais informações.
ru: Если реализовывать это в коде, то можно работать с 4-м параметром ``Array``, который по умолчанию пуст. Для получения дополнительной информации не забудьте ознакомиться с методом ``Object.connect``.
uk: В коді це можна реалізувати за допомогою 4-го ``Array`` параметра, який за замовчуванням порожній. Для отримання додаткової інформації можете почитати про метод ``Object.connect``.
zh_cn: 代码方法下可以用默认为空的第四个 ``Array`` 参数来启用额外参数。参阅 ``Object.connect`` 方法以获取更多信息。
zh_tw: 若使用程式碼的方式來連接節點，則可以使用第四個 ``Array`` 型別的參數，這個參數預設為空陣列。更多資訊可以閱讀 ``Object.connect`` 的說明來瞭解。

source: Before Godot 3.0, the only choice for scripting a game was to use :ref:`GDScript<doc_gdscript>`. Nowadays, Godot has four (yes, four!) official languages and the ability to add extra scripting languages dynamically!
cs: Před Godotem 3.0 byl jedinou volbou pro skriptování hry :ref:`GDScript <doc_gdscript>`. V současné době podporuje Godot čtyři (ano, čtyři!) programovací jazyky a schopnost dynamicky přidávat další!
es: Antes de Godot 3.0, la única opción para scripting en un juego era usar :ref:`GDScript<doc_gdscript>`. Hoy en día, Godot tiene cuatro (¡sí, cuatro!) idiomas oficiales ¡y la capacidad de añadir lenguajes de script adicionales de forma dinámica!
fi: Ennen Godotin versiota 3.0 ainoa vaihtoehto pelin skriptaukseen oli käyttää :ref:`GDScript<doc_gdscript>` kieltä. Nykyään Godotissa on neljä (kyllä, neljä!) virallista kieltä sekä mahdollisuus lisätä ylimääräisiä skriptikieliä dynaamisesti!
it: Prima di Godot 3.0, l'unico modo per scriptare un gioco era usare il :ref:`GDScript<doc_gdscript>`. Oggi, Godot ha quattro (esatto, quattro!) linguaggi di programmazione ufficiali, e la possibilità di aggiungerne altri dinamicamente!
ja: Godot 3.0以前は、ゲームのスクリプトを作成するための唯一の選択肢はGDScriptを使用することだけでした。現在、Godotには4つの(そうです、4つも！)公式言語と、追加のスクリプト言語を動的に追加する機能があります！
pl: Przed wersją 3.0 Godota, :ref:`doc_gdscript` był jedynym językiem, którego można było użyć do oskryptowania gry. Obecnie Godot wspiera cztery (tak, cztery!) języki, a także możliwość dynamicznego dodawania innych języków skryptowych!
pt_br: Antes do Godot 3.0, a única maneira de roteirizar um jogo era usar :ref:`doc_gdscript`. Agora, Godot tem quatro (sim, quatro!) linguagens oficiais e a habilidade de adicionar linguagens de roteirização extras dinamicamente!
uk: До Godot 3.0 для написання скриптів гри можна було використовувати тільки :ref:`GDScript<doc_gdscript>`. На сьогоднішній день у Godot є чотири (так, чотири!) офіційних мови та можливість додавати додаткові мови скриптів!
zh_cn: 在Godot 3.0版本之前，编写游戏脚本的唯一选择是使用GDScript。 如今，Godot已经有四种（没错，是四种！）官方语言，可以动态添加额外脚本语言！
zh_tw: 在 3.0 版以前的 Godot 中只能使用 :ref:`GDScript<doc_gdscript>` 來為遊戲編寫程式。但現在 Godot 有四種 (沒錯，四種！) 官方語言，且還可以動態新增其他腳本語言！

source: This is great, mostly due to the large amount of flexibility provided, but it also makes our work supporting languages more difficult.
cs: To je skvělé, většinou kvůli velké flexibilitě, ale na druhou stranu to ztěžuje naši práci při podpoře jazyků.
es: Esto es genial, sobre todo debido a la gran cantidad de flexibilidad proporcionada, pero también hace que nuestro trabajo de apoyo a los idiomas sea más difícil.
fi: Tämä on erinomaista, pääasiassa sen tarjoaman suuren joustavuuden vuoksi, mutta se tekee myös työstämme kielien tukemiseksi vaikeampaa.
fr: Ceci est formidable, surtout en raison de la grande flexibilité offerte, mais cela rend aussi notre travail de support des langages plus difficile.
it: Questo è fantastico, soprattutto a causa della grande flessibilità fornita, ma rende anche il nostro lavoro per supportare i linguaggi più complicato.
ja: これは素晴らしいことです。提供される柔軟性が大きくなるからです。ですがその反面、それぞれの言語をサポートする作業がより困難になります。
pl: To wspaniałe, głównie ze względu na dużą elastyczność, jednak im więcej języków, tym więcej pracy trzeba włożyć w ich utrzymanie.
pt_br: Isso é ótimo, principalmente por causa da enorme flexibilidade oferecida, mas também dificulta nosso trabalho de dar suporte a linguagens.
uk: Це чудово, головним чином завдяки великій гнучкості, але це також ускладнює нашу роботу щодо підтримки мов.
zh_cn: 这很好，主要在于提供了大量的灵活性，但也使得我们对语言的支持工作变得更加困难。
zh_tw: 這樣很棒，因為這樣彈性就更大了，但另一方面，要支援各個語言也需要做更多的工作。
