Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Scripting
cs: Skriptování
fi: Skriptaus
fr: Les scripts
ja: スクリプト
ko: 스크립팅(Scripting)
pl: Skrypty
ru: Написание сценариев (скриптов)
uk: Скриптинґ
zh_cn: 编写脚本
zh_tw: 撰寫腳本

source: Introduction
cs: Úvod
de: Einführung
es: Introducción
fi: Johdanto
it: Introduzione
ja: はじめに
ko: 소개
pl: Wprowadzenie
pt_br: Introdução
ru: Введение
uk: Вступ
zh_cn: 简介
zh_tw: 簡介

source: Before Godot 3.0, the only choice for scripting a game was to use :ref:`doc_gdscript`. Nowadays, Godot has four (yes, four!) official languages and the ability to add extra scripting languages dynamically!
de: Vor Godot 3.0 gab es zum Programmieren von Spielen nur eine Programmiersprache zur Auswahl, nämlich :ref:`doc_gdscript`. Heutzutage unterstütz Godot vier (ja, vier!) offizielle Programmiersprachen und bietet die Möglichkeit zusätzliche Sprachen dynamisch hinzuzufügen!
fr: Avant Godot 3.0, le seul choix pour scripter un jeu était d'utiliser :ref:`doc_gdscript`. À présent, Godot a quatre (oui, quatre !) langages officiels et la possibilité d'ajouter dynamiquement des langages de script supplémentaires !
ko: Godot 3.0 이전에는, 스크립팅 하는 법이 :ref:`doc_gdscript` 뿐 이었습니다. 지금은, Godot는 4개를 (그래요, 4개!) 공식 언어로 갖고 있고 추가로 스크립트 언어를 추가하는 기능도 있습니다!
ru: До Godot 3.0, единственным выбором для написания скриптов игры был :ref:`doc_gdscript`. В настоящее время Godot официально поддерживает четыре (да, четыре!) языка и имеет возможность динамически добавлять дополнительные скриптовые языки!

source: This is great, mostly due the large amount of flexibility provided, but it also makes our work supporting languages more difficult.
de: Das ist großartig, da die große Anzahl Sprachen mehr Flexibiliät bieten, aber es macht unsere Arbeit, diese zu unterstützen, auch schwerer.
ru: Это здорово, из-за большей гибкости, но также это затрудняет нашу работу по поддержке различных языков.

source: The "Main" languages in Godot, though, are GDScript and VisualScript. The main reason to choose them is their level of integration with Godot, as this makes the experience smoother; both have slick editor integration, while C# and C++ need to be edited in a separate IDE. If you are a big fan of statically typed languages, go with C# and C++ instead.
de: Die "Haupt-" Sprachen in Godot, sind GDScript und VisualScript. Der Hauptgrund diese beiden zu wählen ist, die tiefe Integration mit Godot, da das die Erfahrung reibungsloser macht; beide sind im Editor integriert, wo hingegen C# und C++ in einer seperaten IDE bearbeitet werden müssen. Falls du ein großer Fan von statisch typisierten Sprachen bist, wähle stattdessen C# und C++.
ru: Однако "основными" языками в Godot остаются GDScript и Visual Script. Основной причиной такого выбора является их уровень интеграции с Godot, так как это делает процесс более плавным; они оба имеют полную интеграцию с редактором, в то время как для С# и С++ необходимо использовать отдельную IDE. Если вы большой поклонник статически типизированных языков, то используйте C# и С++.

source: :ref:`doc_gdscript` is, as mentioned above, the main language used in Godot. Using it has some positive points compared to other languages due to its high integration with Godot:
de: :ref:`doc_gdscript` ist, wie oben erwähnt, die Hauptsprache in Godot. Diese zu verwenden hat ein paar Vorteile gegenüber anderer Sprachen in Godot, da sie gut in Godot integriert ist:
fr: :ref:`doc_gdscript` est, comme indiqué ci-dessus, le langage principal utilisé dans Godot. Son utilisation a quelques points positifs par rapport à d'autres langues en raison de sa forte intégration avec Godot :
ko: :ref:`doc_gdscript` 는 앞에서 말했듯, Godot에서 사용되는 메인 언어입니다. 이 언어는 다른 언어들에 비해 Godot와의 높은 통합성으로 인해 갖는 장점이 있습니다:
ru: :ref:`doc_gdscript` является, как упоминалось выше, основным языком, используемым в Godot. Использование его имеет некоторые положительные моменты по сравнению с другими языками из-за его высокой интеграции с Godot:

source: It's simple, elegant, and designed to be familiar for users of other languages such as Lua, Python, Squirrel, etc.
cs: Je jednoduchý, elegantní a navržený tak, aby se v něm uživatelé jazyků jako je např. Lua, Python, Squirrel ... cítili jako doma.
de: Sie ist simpel, elegant und ähnelt Sprachen wie Lua, Python, Squirrel, etc.
es: Es simple, elegante, y diseñado para que resulte muy familiar a los usuarios de otros idiomas como Lua, Python, Squirrel, etc.
fi: Se on yksinkertainen, elegantti ja suunniteltu olemaan tuttu sellaisten kielten, kuten Lua, Python, Squirrel, jne. käyttäjille.
fr: Il est simple, élégant et conçu pour être familier aux utilisateurs d'autres langages telles que Lua, Python, Squirrel, Squirrel, etc.
it: È semplice, elegante, e studiato per essere familiare agli utilizzatori di altri linguaggi come Lua, Python, Squirrel, ecc.
ja: シンプルでエレガントで、Lua、Python、Squirrelなどの他の言語のユーザーになじみがあるように設計されています。
ko: 간단하고, 우아하고, 그리고 디자인 면에서도 Lua, Python, Squirrel 등과 같은 다른 언어들과 비슷합니다.
pl: Jest prosta, elegancka i zaprojektowana tak, aby być przypominała, konstrukcję innych języków, użytkownikom, takich jak Lua, Python, Squirrel, itp.
pt_br: É simples, elegante e projetada para ser familiar aos usuários de outras linguagens como Lua, Python, Squirrel, etc.
ru: Он прост, элегантен и разработан, чтобы быть понятным для пользователей, знающих другие языки программирования, таких как Lua, Python, Squirrel и т. д.
uk: Він простий, елегантний та розроблений так, щоби бути знайомим для користувачів інших мов, таких як Lua, Python, Squirrel тощо.
zh_cn: 简单，优雅，设计上为Lua、Python、Squirrel等语言用户所熟悉。
zh_tw: GDScript 很簡單、優雅，而且對於其他語言的使用者如 Lua, Python, Squirrel…等來說會感到很親切。

source: Loads and compiles blazingly fast.
cs: Nahrává se a kompiluje opravdu velmi rychle.
de: Läd und kompiliert unheimlich schnell.
es: Carga y compila a toda velocidad.
fi: Latautuu ja kääntyy huikean nopeasti.
fr: Charge et compile avec une rapidité fulgurante.
it: Viene caricato e compilato alla velocità della luce.
ja: 読み込みとコンパイルが非常に高速です。
ko: 매우 빠르게 불러오고 컴파일됩니다.
pl: Szybko się ładuje i kompiluje.
pt_br: Carrega e compila rapidamente.
ru: Загружает и компилирует невероятно быстро.
uk: Завантажує і компілює надзвичайно швидко.
zh_cn: 加载和编译速度飞快。
zh_tw: 超快速的載入與編譯。

source: The editor integration is a pleasure to work with, with code completion for nodes, signals, and many other items pertaining to the scene being edited.
cs: Díky integrovanému editoru je potěšením pracovat s automatickým dokončováním kódu pro uzly, signály a ostaní prvky právě editované scény.
de: Durch die Integration im Editor, der Codevervollständigung für Nodes, Signale und andere Elemente innerhalb einer Szene ist es eine Freude mit der Sprache zu arbeiten.
es: Es un placer trabajar con la integración del editor, con completado de código para nodos, señales y muchos otros elementos relacionados con la escena que se está editando.
fi: Solmujen, signaalien ja monien muiden skeneen liittyvien juttujen kooditäydennyksen sisältävän editori-integraation kanssa on miellyttävä työskennellä.
fr: L'intégration de l'éditeur est un plaisir à travailler avec, avec une complétion de code pour les nœuds, les signaux et de nombreux autres éléments relatifs à la scène en cours d'édition.
it: È un piacere lavorare con la sua integrazione nell'editor, con completazione del codice per i nodi, segnali, e molti altri elementi appartenenti alla scena che sta venendo editata.
ja: エディタの統合は、ノード、シグナル、および編集中のシーンに関連する他の多くの項目のコード補完を使用してくれるので作業するのが楽しいです。
ko: 에디터 통합은 노드, 시그널, 그리고 작업 중인 씬과 관련된 많은 항목들의 코드 완성을 작업하는 즐거움입니다.
pl: Integracja edytora, pokazuje przyjemność z jaką można z nim pracować, z uzupełnianiem kodu dla węzłów, sygnałów i wielu innych elementów związanych z edytowaną sceną.
pt_br: A integração com o editor é agradável de trabalhar, com completação de código para nós, sinais e muitos outros itens pertinentes à cena em edição.
ru: Интеграция с редактором позволяет с удовольствием работать, с написанием кода для узлов, сигналов и многих других элементов, относящихся к редактируемой сцене.
uk: Інтеграція з редактором дозволяє із задоволенням писати код для вузлів, сигналів та багатьох інших елементів, що стосуються сцени, яка редагується.
zh_cn: 编辑器集成非常令人愉快，有节点、信号、其它场景相关项目的代码完成。
zh_tw: 編輯器整合讓作業過程變得更開心。節點、訊號以及其他與正在編輯的場景有關的項目都能進行程式碼補全。

source: Has vector types built-in (such as Vectors, transforms, etc.), making it efficient for heavy use of linear algebra.
cs: Má vestavěné vektorové typy (například vektory, transformace atd.), Díky čemuž je efektivní pro náročné použití lineární algebry.
de: Hat eingebaute Vektortypen ( wie Vectors, transforms, etc.), was sie effizient für die Arbeit mit linearer Algebra macht.
es: Tiene tipos de vectores propios (tales como Vector, transforms, etc.), haciéndolo eficiente para el uso intensivo del álgebra lineal.
fi: Sisältää sisäänrakennetut vektorityypit (kuten Vector-luokat, transformaatiot, jne.), tehden kovasta lineaarialgebran käytöstä tehokasta.
fr: Possède des types vectoriels intégrés (tels que vecteurs, transformations, etc.), ce qui le rend efficace pour l'utilisation intensive de l'algèbre linéaire.
it: Ha i tipi per i vettori integrati (come i Vector, Transform, ecc), in modo da rendere efficiente l'uso intensivo dell'algebra lineare.
ja: ベクトル型(ベクトル、幾何学変換など)が組み込まれており、線形代数を大量に使用する場合に効率的です。
ko: (Vectors, transforms 등과 같은) 많은 벡터 타입을 지니고 있어서, 선형 대수를 많이 사용하는데 효율적입니다.
pl: Ma wbudowane typy wektorowe (takie jak wektory, transformacje itp.), co czyni go wydajnym do intensywnego wykorzystania algebry liniowej.
pt_br: Tem tipos de vetores embutidos (como Vectors, transformações, etc.), tornando-a eficiente para uso pesado de álgebra linear.
ru: Имеет встроенные векторные типы (например, Vectors, transforms и т. д.), что делает использование линейной алгебры эффективным.
uk: Має вбудовані векторні типи (наприклад, Вектори, перетворення тощо), що робить його ефективним для використання лінійної алгебри.
zh_cn: 有内建向量类型(比如Vector、Transform等)，大量使用线性代数时非常有效。
zh_tw: 有內建 Vector 型別 (如 Vector, Transform…等)，當需要大量線性代數運算時更有效率。

source: Supports multiple threads as efficiently as statically typed languages - one of the limitations that made us avoid VMs such as Lua, Squirrel, etc.
cs: Podporuje více vláken stejně efektivně jako staticky psané jazyky - jedno z omezení, díky kterému jsme se vyhnuli jazykům, jako je Lua, Squirrel atd.
de: Unterstützt mehrere Threads, so effizient wie statisch typifizierter Sprachen - was der Grund ist warum wir andere VM's wie Lua, Squirrel, etc mieden.
es: Soporta múltiples hilos de forma tan eficiente como los lenguajes de tipado estático - una de las limitaciones que nos hizo evitar VMs como Lua, Squirrel, etc.
fi: Tukee useita säikeitä yhtä tehokkaasti kuin staattisesti tyypitetyt kielet - yksi niistä rajoituksista, jotka saivat meidät välttämään sellaisia virtuaalikoneita kuten Lua, Squirrel, jne.
fr: Supporte plusieurs threads aussi efficacement que les langages à typage statique - une des limitations qui nous a fait éviter les VMs comme Lua, Squirrel, etc.
it: Supporta thread multipli efficientemente quanto i linguaggi staticamente tipati - una delle limitazioni che ci ha fatto evitare l'uso di VM come Lua, Squirrel, ecc.
ja: 静的に型指定された言語と同じくらい効率的に複数のスレッドをサポートします - Lua、SquirrelなどのVMを避けた理由のひとつはスレッド処理に制限があるからです。
ko: 정적 언어처럼 효율적인 여러 스레드를 지원합니다 - 이것이 Lua, Squirrel 등의 가상 머신을 피하게 만든 이유입니다.
pl: Wspiera wielowątkowość równie wydajnie jak języki typowane statycznie - jest to jedno z ograniczeń, przez które unikamy maszyn wirtualnych, jak Lua, Squirrel itd.
pt_br: Suporte a múltiplas threads tão eficientemente quanto como em linguagens tipadas estaticamente – uma das limitações que nos fez evitar máquinas virtuais como Lua, Squirrel, etc.
ru: Поддерживает несколько потоков так же эффективно, как статически типизированные языки - это одно из ограничений, которое заставило нас избегать виртуальных машин, таких как Lua, Squirrel и т. д.
uk: Підтримує декілька потоків так само ефективно, як і статичні мови - одне з обмежень, яке змусило нас уникати таких машин, як Lua, Squirrel тощо.
zh_cn: 支持多线程，像静态类型语言一样有效 - 这是我们避免使用诸如Lua、Squirrel等虚拟机的原因之一。
zh_tw: 跟靜態型別語言一樣支援多執行緒 — 這是我們不選擇使用如 Lua, Squirrel…等語言 VM 的其中一個原因。

source: Uses no garbage collector, so it trades a small bit of automation (most objects are reference counted anyway), by determinism.
cs: Nepoužívá automatickou garbage collector (způsob automatické správy paměti,) takže principielně nahrazuje tu trochu automatizace (většina objektů je stejně řízena počítáním referencí) determinismem.
de: Nutzt keinen Garbage Collector, also handelt es sich um ein kleines Stück Automatisierung (die meisten Objekte werden sowieso gezählt), durch Determinismus.
es: No utiliza ningún recolector de basura, por lo que intercambia un poco de automatización (de todos modos, la mayoría de objetos son pasados por referencia), por determinismo.
fi: Ei käytä roskienkeruuta, joten pieni määrä automaatiota (useimpien objektien viittauksista pidetään joka tapauksessa kirjaa) on korvattu determinismillä.
fr: N'utilise pas de ramasse-miettes, usant donc d'un petit peu d'automatisation (la plupart des objets sont de toute façon comptés par référence), par déterminisme.
it: Non utilizza un gargabe collector, quindi baratta una piccola parte di automazione (la maggior parte degli oggetti sono a riferimenti contati in ogni caso), per il determinismo.
ja: ガベージコレクタを使用しないため、決定論によって多少の自動化(ほとんどのオブジェクトはいずれにしても参照としてカウントされる)を犠牲にします。
ko: 가비지 컬렉터를 쓰지 않아서, 작업이 약간의 자동화를 버리는 대신 결정론적으로 처리됩니다 (어쨌든 대부분의 오브젝트들은 참조 카운트됩니다).
pl: Nie używa kolektora śmieci, więc jest jedynie lekko zautomatyzowany (większość obiektów i tak jest liczona jako odniesienie), przez determinizm.
pt_br: Não usa coletor de lixo, então ele troca um pouquinho de automação (a maioria dos objetos usa referencias contadas, de qualquer forma) por determinismo.
ru: Не использует сборщик мусора, поэтому он располагает небольшой автоматизацией (в любом случае большинство объектов подсчитываются ссылками), детерминизмом.
uk: Не використовує прибиральник сміття, тому він торгує (trades) невеликим шматочком автоматизації (більшість об'єктів все одно рахуються по посиланнях), детермінізмом.
zh_cn: 不使用垃圾回收器，所以它确定性地自动处理之这部分(大多数对象都是引用计数)。
zh_tw: 不使用記憶體回收行程。以決定性 (Determinism) 取代一小部分的自動化 (大部分物件都使用引用計數)。

source: Its dynamic nature makes it easy to optimize sections of code in C++ (via GDNative) if more performance is required, all without recompiling the engine.
cs: Jeho dynamická povaha usnadňuje optimalizaci částí kódu v C ++ (prostřednictvím GDNative), pokud je vyžadován větší výkon, a to vše bez nové kompilace enginu.
de: Ihre dynamische Natur macht es einfach, Bereiche des Codes in C++ zu optimieren (via GDNative), falls mehr Leistung nötig ist. Und das alles ohne die Engine neu zu kompilieren.
es: Su naturaleza dinámica hace que sea fácil optimizar secciones de código en C++ (vía GDNative) si se requiere más rendimiento, todo ello sin recompilar el motor.
fi: Jos parempaa suorituskykyä tarvitaan, sen dynaaminen luonne tekee koodiosioiden korvaamisesta C++:lla helppoa (GDNativen kautta), ilman että koko pelimoottori täytyy kääntää uudelleen.
fr: Sa nature dynamique facilite l'optimisation de sections de code en C++ (via GDNative) si plus de performance est requise, le tout sans recompiler le moteur.
it: La sua natura dinamica rende semplice ottimizzare sezioni di codice in C++ (attraverso GDNative) se sono richieste performance più elevate, il tutto senza ricompilare il motore di gioco.
ja: その動的な性質により、より高いパフォーマンスが必要な場合には、エンジンを再コンパイルすることなく、コードの一部をC++ (GDNative経由) で簡単に最適化することができます。
ko: 더 많은 퍼포먼스가 필요하다면, 엔진을 전부 다시 컴파일하지 않아도 (GDNative를 통해) C++의 코드 섹션을 쉽게 최적화할 수 있습니다.
pl: Jego dynamiczny charakter ułatwia optymalizację sekcji kodu w C++ (poprzez GDNative), jeśli wymagana jest większa wydajność, bez konieczności ponownego kompilowania silnika.
pt_br: Sua natureza dinâmica torna fácil otimizar seções de código em C++ (via GDNative) se mais desempenho for necessário, sem ter que recompilar o motor de jogo.
ru: Его динамическая природа упрощает оптимизацию разделов кода на C++ (через GDNative), если требуется большая производительность, без перекомпиляции движка.
uk: Його динамічний характер дозволяє легко оптимізувати розділи коду в C ++ (за допомогою GDNative), якщо потрібна більша продуктивність, все без перекомпіляції двигуна.
zh_cn: 它的动态特性使其需要提高性能时，可以很容易地优化C++代码段(通过GDNative)，而这些不需要重新编译引擎。
zh_tw: 由於動態特性，需要更高性能時可以把一部分程式碼用 C++ 來最佳化 (通過 GDNative)，且不用重新編譯整個引擎。

source: If you're undecided and have experience with programming, especially dynamically typed languages, go for GDScript!
cs: Pokud jste nerozhodnutí a máte zkušenosti s programováním, zejména s dynamicky typovanými jazyky, jděte do GDScriptu!
de: Falls du unentschlossen bist und Erfahrung mit dem Programmieren, besonders mit dynamischen Programiersprachen besizt, verwende GDScript!
es: Si estás indeciso y tienes experiencia en programación, especialmente con lenguajes de tipado dinámico ¡decídete por GDScript!
fi: Jos olet epävarma ja sinulla on kokemusta ohjelmoinnista, eritoten dynaamisesti tyypitetyistä kielistä, valitse GDScript!
fr: Si vous êtes indécis et que vous avez de l'expérience en programmation, en particulier dans les langages à typage dynamique, optez pour GDScript !
it: Se sei incerto e hai esperienza nella programmazione, specialmente con i linguaggi dinamici, GDScript è la scelta giusta!
ja: もしあなたがどの言語を使用するかをまだ決めておらず、プログラミング、特に動的型付け言語の経験があるなら、GDScriptを選んでください!
ko: 아직 프로그래밍에 경험이 없고 특히 동적 언어를 정하지 않았다면, GDScript로 시작해보세요!
pl: Jeśli jesteś niezdecydowany i masz doświadczenie w programowaniu, szczególnie dynamicznie typowanych języków, wybierz GDScript!
pt_br: Se está indeciso e tiver experiência com programação, especialmente com linguagens tipada dinamicamente, opte por GDScript!
ru: Если вы не определились с выбором языка, но имеете опыт программирования, особенно на динамически типизированных языках, попробуйте GDScript!
uk: Якщо ви не визначились і маєте досвід програмування, особливо в мовах динамічних типів, спробуйте GDScript!
zh_cn: 如果您还没决定好，并且对编程有经验，特别是动态类型语言，那就选择GDScript吧！
zh_tw: 如果你還沒決定好要用哪個語言，而且有過寫程式的經驗——特別是動態型別語言，選擇 GDScript 吧！

source: Beginning with 3.0, Godot offers :ref:`Visual Scripting<doc_what_is_visual_script>`. This is a typical implementation of a "blocks and connections" language, but adapted to how Godot works.
cs: Počínaje verzí 3.0, Godot nabízí :ref:`Visual Scripting <doc_what_is_visual_script>`. Je to typická implementace jazyka „bloků a spojení“, ale přizpůsobená architektuře Godotu..
de: Seit Version 3.0 unterstüzt Godot :ref:`Visual Scripting<doc_what_is_visual_script>`. Dies ist eine typische Implementierung einer "blocks and connections" Sprache, die aber an die funktionsweise von Godot angepasst wurde.
es: A partir de la versión 3.0, Godot ofrece :ref:`Visual Scripting<doc_what_is_visual_script>`. Esta es una implementación típica de un lenguaje de "bloques y conexiones", pero adaptado a cómo funciona Godot.
fi: Alkaen versiosta 3.0, Godot tarjoaa :ref:`Visuaalisen skriptauksen<doc_what_is_visual_script>`. Tämä on tyypillinen toteutus "lohkot ja yhteydet" kielestä, mutta mukautettu Godotin toimintatapoihin.
fr: A partir de la version 3.0, Godot propose le :ref:`Visual Scripting<doc_what_is_visual_script>`. Il s'agit d'une implémentation typique d'un langage de "blocs et connexions", mais adapté au fonctionnement de Godot.
it: A partire dalla versione 3.0, Godot offre il :ref:`Visual Scripting<doc_what_is_visual_script>`. È una tipica implementazione di un linguaggio a "blocchi e connessioni", ma adattato a come funziona Godot.
ja: Godotは3.0から、\ :ref:`ビジュアルスクリプト <doc_what_is_visual_script>`\ を提供しています。これは「ブロックと接続」言語の典型的な実装ですが、Godotの動作に適合しています。
ko: 3.0을 시작하면서, Godot는 :ref:`Visual Scripting<doc_what_is_visual_script>` 을 제공합니다. 이것은 "블록과 연결" 언어의 일반적인 구현이지만, Godot의 작동 방식에 맞게 조정됬습니다.
pl: Począwszy od wersji 3.0, Godot oferuje :ref:`Wizualne programowanie <doc_what_is_visual_scriptum>`. Jest to typowa implementacja języka "bloków i połączeń", ale zaadaptowana do tego, jak działa Godot.
pt_br: A partir da versão 3.0, o Godot oferece :ref:`Visual Scripting<doc_what_is_visual_script>`. Esta é uma implementação típica de uma linguagem de "blocos e conexões", mas adaptada para o jeito que o Godot funciona.
ru: Начиная с версии 3.0, Godot предлагает :ref:`Визуальный Скриптинг<doc_what_is_visual_script>`. Это типичная реализация языка "блоков и соединений", но адаптированная к тому, как работает Godot.
uk: Починаючи з 3.0, Godot пропонує :ref:`Visual Scripting<doc_what_is_visual_script>`. Це типова реалізація мови "блоків та з'єднань", але адаптована до роботи Godot.
zh_cn: 从3.0开始，Godot开始支持 :ref:`可视化脚本<doc_what_is_visual_script>`。这是典型的“节点和连线”语言的实现，但适用于Godot的开发方式。
zh_tw: Godot 從 3.0 版開始提供 :ref:`視覺腳本 (VisualScript) <doc_what_is_visual_script>` 。視覺腳本是一種典型的「方塊與連接 (Blocks and Connections)」語言實作，只是改成了 Godot 版。

source: Visual scripting is a great tool for non-programmers, or even for experienced developers who want to make parts of the code more accessible to others, like game designers or artists.
cs: Vizuální skriptování je skvělý nástroj pro neprogramátory nebo dokonce i pro zkušené vývojáře, kteří chtějí zpřístupnit části kódu ostatním, například návrhářům her nebo umělcům.
de: Visual Scripting ist ein großartiges Werkzeug für Menschen ohne Programmierkenntnisse, aber auch für erfahrene Prorammierer, die Teile ihres Codes für andere, beispielsweise Designer oder Künstler, verständlicher machen wollen.
es: Visual scripting es una gran herramienta para no-programadores, o incluso para desarrolladores experimentados que quieren hacer partes del código más accesibles a otros, como diseñadores o artistas de juegos.
fi: Visuaalinen skriptaus on mainio työkalu ei-ohjelmoijille ja jopa kokeneemmille kehittäjille, jotka haluavat tehdä osasta koodia helpommin lähestyttävää muille, kuten pelisuunnittelijoille ja artisteille.
fr: Le Visual Scripting est un excellent outil pour les non-programmeurs, ou même pour les développeurs expérimentés qui veulent rendre certaines parties du code plus accessibles à d'autres, comme les concepteurs de jeux ou les artistes.
it: Lo scripting visuale è un grande strumento per chi non è un programmatore, o anche per programmatori con esperienza che vogliono rendere alcune parti di codice più accessibilli agli altri, come a game designer o a artisti.
ja: ビジュアルスクリプトは、プログラマ以外のユーザーや、ゲームデザイナーやアーティストなどの他のユーザーに、コードの一部を容易にアクセスさせたい経験豊富な開発者にとっても最適なツールです。
ko: Visual scripting은 비 프로그래머 뿐만 아니라 경험 있는 프로그래머도 게임 디자이너나 아티스트와 같은 사람들이 코드 일부분을 보기 쉽게 만들어 주는 멋진 도구입니다.
pl: Wizualne programowanie jest doskonałym narzędziem dla nie programistów, a nawet dla doświadczonych programistów, którzy chcą uczynić części kodu bardziej dostępnymi dla innych, takich jak projektanci gier czy artyści.
pt_br: Roteirização visual é uma ótima ferramenta para não programadores, ou mesmo para desenvolvedores experientes que queira tornar partes do código mais acessíveis para outros, como projetistas de jogos e artistas.
ru: Визуальный скриптинг - это отличный инструмент для непрограммистов или для опытных разработчиков, которые хотят сделать части кода более доступными для других, например, дизайнеров игр или художников.
uk: Visual scripting - це чудовий інструмент для не програмістів, та і для досвідчених розробників, які хочуть зробити частини коду більш доступними для інших, наприклад, дизайнерів ігор, або художників.
zh_cn: 对非程序员来说，可视化编程是一个很好的工具，甚至对于经验丰富的开发人员来说也是如此，他们想让部分代码易于被他人访问，比如游戏设计师和美术工作者。
zh_tw: 對於非程式設計師來說，以圖形化寫程式是一個很好用的工具。甚至對於有經驗的程式設計師來說，當想要讓其他如遊戲設計師或是美術家之類的人接觸程式碼時也很有用。
