Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_continued.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, zh_cn, zh_tw

source: Scripting (continued)
cs: Skriptování (pokračování)
de: Skripten (Fortsetzung)
es: Scripting (continuación)
fi: Skriptaus (jatkuu)
fr: Scripting (suite)
it: Scripting (continuazione)
ja: スクリプト(続き)
ko: 스크립팅 (계속)
pl: Pisanie Skryptów (kontynuacja)
pt_br: Roteirizando (continuação)
ru: Написание сценариев (продолжение)
zh_cn: 编写脚本（续）
zh_tw: 撰寫程式 (續)

source: Processing
cs: Zpracování procesů
de: Prozessverarbeitung
es: Procesamiento
fi: Prosessointi
fr: Traitement
it: Elaborazione
ja: プロセシング
ko: 처리(Process)하기
pl: Przetwarzanie
pt_br: Processamentos
ru: Обработка
zh_cn: 处理
zh_tw: 處理

source: Several actions in Godot are triggered by callbacks or virtual functions, so there is no need to write code that runs all the time.
cs: Některé z akci Godota jsou spouštěny tzv. callbacky (funkce předana jako parametr jiné funkci) nebo virtuálními funkcemi (funkce vybíraná za běhu programu podle volajícího objektu), proto není třeba psát kód, který běží neustále.
de: Mehrere Aktionen in Godot werden durch Rückrufe (Callbacks) oder virtuelle Funktionen ausgelöst, sodass kein Code geschrieben werden muss, der ständig ausgeführt wird.
es: Varias acciones en Godot se activan por llamadas de retorno o funciones virtuales, así que no hay necesidad de escribir código que se ejecute todo el tiempo.
fi: Useat toiminnot Godotissa suoritetaan takaisinkutsuina (callback) tai virtuaalifunktioina, joten jatkuvasti suoritettavaa koodia ei ole tarvetta kirjoittaa.
fr: Plusieurs actions dans Godot sont déclenchées par des callbacks ou des fonctions virtuelles, il n'y a donc pas besoin d'écrire du code qui s'exécute en permanence.
it: Molte azioni in Godot sono eseguite tramite callback di funzioni virtuali, non c'è necessità di scrivere codice che viene eseguito in ogni momento.
ja: Godotのいくつかのアクションはコールバックまたは仮想関数によってトリガーされるため、常に実行されるコードを記述する必要はありません。
ko: Godot에서 여러 작업은 콜백 또는 가상 함수로 조작됩니다. 그래서 항상 실행되는 코드를 작성할 필요가 없습니다.
pl: Wiele akcji w Godot jest uruchamianych poprzez wywołania zwrotne i funkcje wirtualne, dla tego nie ma też potrzeby pisać kodu, który działa bez przerwy.
pt_br: Muitas ações no Godot são disparadas por funções virtuais ou de retorno, então não há necessidade de escrever um código que execute o tempo todo.
ru: Некоторые действия в Godot инициируются обратными вызовами или виртуальными функциями, поэтому нет необходимости писать код, который работает все время.
zh_cn: Godot中的多个动作是由回调或虚函数触发的，因此无需编写始终运行的代码。
zh_tw: 在 Godot 中有許多行為是通過回呼函式 (Callback) 或虛擬函式 (Virtual Function) 觸發的，所以不需要撰寫要持續執行的程式碼。

source: However, it is still common to need a script to be processed on every frame. There are two types of processing: idle processing and physics processing.
cs: Nicméně, stále potřebuje skript, který bude zpracováván v každém framu. Existují dva druhy tohoto zpracování: "volnoběžné" zpracování a zpracování fyziky.
de: Es ist jedoch immer noch üblich, dass für jeden Frame ein Skript verarbeitet werden muss. Es gibt zwei Arten der Verarbeitung: Leerlaufverarbeitung und Physikverarbeitung.
es: Sin embargo, todavía es común necesitar un script para que se procese en cada frame. Hay dos tipos de procesamiento: procesamiento en tiempo de espera y procesamiento físico.
fi: On silti tavallista, että skripti täytyy prosessoida jokaisella ruudunpäivityksellä. Prosessointia on kahdentyyppistä: joutoprosessointia ja fysiikkaprosessointia.
fr: Cependant, il est fréquent d'avoir besoin qu'un script soit exécuté à chaque rafraichissement. Il y a deux types de traitements : les traitements passifs et les traitements physiques.
it: In ogni caso, è comune che ci sia la necessità di eseguire uno script ad ogni frame. Ci sono due tipi di esecuzioni: durante il processo di inattività e durante il processo fisico.
ja: ただし、すべてのフレームでスクリプトを処理する必要がある場合もあります。処理には、アイドル処理と物理処理の2種類があります。
ko: 하지만 여전히 모든 프레임에서 처리하는 스크립트가 필요한 경우가 많습니다. 처리(Process)에는 두가지 유형이 있습니다: 정적 처리(Idel Processing)와 동적 처리(Physics Processing).
pl: Jednakże często zdarza się, że skrypt musi być przetworzony co każdą klatkę. Istnieją dwa rodzaje przetwarzania: bezczynne (idle processing) oraz procesów fizycznych (physics processing).
pt_br: Entretanto, ainda é comum precisar que um roteiro seja processado a cada quadro. Existem dois tipos de processamento: o ocioso e o físico.
ru: Однако, бывает необходимо, чтобы скрипт обрабатывался в каждом кадре. Существует два типа обработки: обработка простоя и обработка физики.
zh_cn: 但是，在每一帧上都需要处理脚本仍然很常见。有两种处理类型：空闲处理和物理处理。
zh_tw: 但是，會需要在每一幀上都執行的腳本還是很常見。有兩種處理方法：閒置處理 (Idle Processing) 與物理處理 (Physics Processing)。

source: Idle processing is activated when the method :ref:`Node._process() <class_Node_method__process>` is found in a script. It can be turned off and on with the :ref:`Node.set_process() <class_Node_method_set_process>` function.
cs: Volnoběžné zpracování je aktivováno, když je ve skriptu nalezena metoda: ref: `Node._process () <class_Node_method__process>`. Lze jej vypnout a zapnout pomocí funkce: ref: `Node.set_process () <class_Node_method_set_process>`.
de: Die Leerlaufverarbeitung wird aktiviert, wenn die Methode :ref:`Node._process() <class_Node_method__process>` in einem Skript gefunden wird. Sie kann mit der Funktion :ref:`Node.set_process() <class_Node_method_set_process>` ein- und ausgeschaltet werden.
es: El procesamiento en tiempo de espera (idle) se activa cuando el método :ref:`Node._process() <class_Node_method__process>` se encuentra en un script. Se puede apagar y encender con la función :ref:`Node.set_process() <class_Node_method_set_process>`.
fi: Joutoprosessointi aktivoituu, kun skriptistä löytyy :ref:`Node._process() <class_Node_method__process>` metodi. Se voidaan kytkeä päälle ja pois :ref:`Node.set_process() <class_Node_method_set_process>` funktiolla.
fr: Le traitement passif est activé lorsque la méthode :ref:`Node._process() <class_Node_method__process>` se trouve dans un script. Il peut être activé ou désactivé avec la fonction :ref:`Node.set_process() <class_Node_method_set_process>`.
it: Il processo d'inattività si attiva quando il metodo :ref:`Node._process() <class_Node_method__process>` viene trovato nello script. Può essere attivato o fermato con la funzione :ref:`Node.set_process() <class_Node_method_set_process>`.
ja: メソッド:ref:`Node._process() <class_Node_method__process>`\ がスクリプトに存在すると、アイドル処理がアクティブになります。:ref:`Node.set_process() <class_Node_method_set_process>`\ 関数を使用して、オンとオフを切り替えることができます。
ko: 정적 처리는 스크립트에서 메서드 :ref:`Node._process() <class_Node_method__process>`\ 가 발견되면 활성화됩니다. :ref:`Node.set_process() <class_Node_method_set_process>`\ 를 사용해서 이 기능을 껐다 켰다 할 수 있습니다.
pl: Bezczynne przetwarzanie jest aktywowane, gdy w skrypcie znajduje się metoda :ref:`Node._process() <class_Node_method__process>`. Może być ono włączane i wyłączane za pomocą funkcji :ref:`Node.set_process() <class_Node_method_set_process>`.
pt_br: Processamento ocioso é ativado quando o método :ref:`Node._process() <class_Node_method__process>` é encontrado em um roteiro. Ele pode ser desativado e reativado com a função :ref:`Node.set_process() <class_Node_method_set_process>`.
ru: Обработка простоя начинается, когда метод :ref:`Node._process() <class_Node_method__process>` найден в скрипте. Его можно отключить и включить с помощью функции :ref:`Node.set_process() <class_Node_method_set_process>`.
zh_cn: 当在脚本中找到 :ref:`Node._process() <class_Node_method__process>` 方法时，将激活空闲处理。可以通过 :ref:`Node.set_process() <class_Node_method_set_process>` 函数来打开或关闭。
zh_tw: 閒置處理會在腳本中有 :ref:`Node._process() <class_Node_method__process>`方法時候啟動。可以通過 :ref:`Node.set_process() <class_Node_method_set_process>` 方法來開啟或關閉閒置處理。

source: This method will be called every time a frame is drawn:
cs: Tato metoda bude volaná vždy když je vykreslen snímek (frame):
de: Diese Methode wird jedesmal aufgerufen, wenn ein Bild gezeichnet wurde:
fi: Tätä metodia kutsutaan jokaisella ruudun piirtokerralla:
fr: Cette méthode sera appelée à chaque fois qu'une image(frame) est dessinée :
it: Questo metodo verrà chiamato ogni volta che viene disegnato un frame:
ja: このメソッドはフレームが描画されるたびに呼ばれます。
ko: 이 메서드는 매 프레임마다 호출됩니다:
pl: Ta metoda wykona się za każdym razem, kiedy rysowana jest klatka:
pt_br: Esse método será chamado toda vez que um quadro é desenhado:
ru: Этот метод будет вызван каждый раз в момент прорисовки фрейма:
zh_cn: 这个方法将在每次绘制帧时被调用：
zh_tw: 該方法會在繪製每一幀時呼叫：

source: It's important to bear in mind that the frequency with which ``_process()`` will be called depends on how many frames per second (FPS) your application is running at. This rate can vary over time and devices.
cs: Je důležité mít na paměti, že frekvence, se kterou bude `` _process () `` vyvolávána, závisí na tom, na jakém FPS (snímky za sekundu) vaše aplikace běží. Tato rychlost může kolísat jak v průběhu času tak vzhledem k rozdílnému výkonu jednotlivých zařízení.
de: Es ist wichtig im Hinterkopf zu behalten, dass die Häufigkeit in der die ``_process()`` Methode aufgerufen wird, davon abhängt, mit wie vielen Bildern pro Sekunde (FPS) die Anwendung läuft. Diese Rate kann auf verschiedenen Geräten oder auch über Zeit variieren.
fi: On hyvä pitää mielessä, että taajuus jolla ``_process()`` metodia kutsutaan riippuu siitä kuinka monta ruutua per sekunti (FPS) sovelluksesi kykenee käsittelemään. Tämä nopeus voi vaihdella eri hetkillä ja laitteilla.
fr: La fréquence a laquelle la méthode ``_process()`` est appelée, est synchronisée avec le nombre d'images par seconde (FPS) de votre application. Il est important de noter que le nombre d'images par seconde peut varier avec le temps et selon les supports.
ja: 次の事を心に留めておく事は重要です。_process()が呼び出される頻度は、アプリケーションが実行されている1秒あたりのフレーム数（FPS）に依存します。このレートは、時間とデバイスによって異なります。
ko: ``_process()``\ 가 호출되는 비중은 응용 프로그램이 초 당 몇 프레임 (FPS)으로 실행되는지에 따라 다르다는 것을 마음에 새기는 것이 중요합니다. 이 비율은 시간과 기기에 따라 다를 수 있습니다.
pt_br: É importante ter em mente que a frequência em que a função ``_process()`` será chamada depende de quantos quadros por segundo (FPS) sua aplicação está rodando. Essa taxa pode variar com o tempo e dispositivos.
ru: Важно помнить, что частота, с которой будет вызываться функция ``_process()``, зависит от количества кадров в секунду (FPS), на котором работает ваше приложение. Эта скорость может изменяться с течением времени и устройствами.
zh_cn: 重要的是要记住，调用 ``_process()`` 的频率取决于应用程序运行的每秒帧数（FPS）。该速率会随着时间和设备的不同而变化。
zh_tw: 有一點很重要的是， ``_process()`` 的呼叫頻率會依據應用程式在執行時的 FPS (Frames Per Second，每秒幀數) 而定。這個頻率在不同設備下可能會不同。

source: To help manage this variability, the ``delta`` parameter contains the time elapsed in seconds as a floating-point number since the previous call to ``_process()``.
cs: Aby bylo možno ošetřit tuto variabilitu, je k dispozici ``delta`` parametr typu float, který vyjadřuje čas uběhlý od předchozího volání ``_process()``.
de: Zur Berücksichtigung dieser Variabilität, enthält der ``delta`` Parameter die vergangene Zeit in Sekunden als Fließkommazahl (float) seit dem letzten Aufruf von ``_process()``.
fr: Pour aider à gérer cette variabilité, le paramètre ``delta`` contient le temps écoulé en secondes, en virgule flottante, depuis l'appel précédent de ``_process()``.
zh_tw: 為了解決各裝置上 FPS 不同的問題，可以使用 ``delta`` (時間差) 參數。該參數會包含上次呼叫 ``_process()`` 到目前為止的時間，單位為浮點數的秒。

source: This parameter can be used to make sure things always take the same amount of time, regardless of the game's FPS.
cs: Tento parametr lze použít k zajištění toho, aby věci vždy zabíraly stejné množství času, bez ohledu na FPS hry.
de: Dieser Parameter kann verwendet werden, um sicherzustellen, dass Dinge unabhängig von den FPS des Spiels immer dieselbe Zeit in Anspruch nehmen.
es: Este parámetro se puede utilizar para asegurarse de que las cosas siempre tardan la misma cantidad de tiempo, independientemente de los FPS del juego.
fi: Parametria käyttämällä voidaan pitää huoli siitä, että asiat vievät aina saman verran aikaa, riippumatta pelin FPS-nopeudesta.
fr: Ce paramètre peut être utilisé pour garantir que les actions prendront le même temps, quelque soit le nombre d'images par secondes du jeu.
it: Questo parametro può essere usato per essere sicuri che gli oggetti abbiano la stessa quantità di tempo, incurante degli FPS del gioco.
ja: このパラメータを使用すると、ゲームのFPSに関係なく、常に同じ時間がかかるようにすることができます。
ko: 이 매개 변수를 사용하면 게임의 초 당 프레임 수와 관계 없이, 항상 동일한 시간이 소요되도록 할 수 있습니다.
pl: Ten parametr jest stosowany by być zawsze pewnym, że czynność zawsze będzie trwała określony czas, bez względu na ilość FPS.
pt_br: Este parâmetro pode ser usado para garantir que as coisas sempre levem a mesma quantidade de tempo, independentemente do taxa de quadros (FPS) do jogo.
ru: Этот параметр можно использовать для того, чтобы различные операции всегда занимали одинаковое количество времени, независимо от FPS игры.
zh_cn: 此参数可用于确保事物始终花费相同的时间，从而与游戏的FPS无关。
zh_tw: delte 參數可以用來確保一些東西花費的時間不會因為 FPS 而有所不同。

source: For example, movement is often multiplied with a time delta to make movement speed both constant and independent of the frame rate.
cs: Například pohyb(vektor rychlosti) je často násoben touto časovou deltou, aby byla rychlost pohybu konstantní a nezávislá na obnovovací frekvenci.
de: Zum Beispiel wird die Bewegung oft mit einem Zeit-Delta multipliziert, um die Bewegungsgeschwindigkeit sowohl konstant als auch unabhängig von der Bildrate zu halten.
fr: Par exemple, le mouvement est souvent multiplié par un temps delta pour que la vitesse de mouvement soit constante et indépendante de la fréquence de rafraîchissement.
zh_tw: 舉例來說，移動的距離通常會使用 Delta 來計算，這樣可以確保移動速度相同，而且也不會因為幀率而變化。

source: Physics processing with ``_physics_process()`` is similar, but it should be used for processes that must happen before each physics step, such as controlling a character. It always runs before a physics step and it is called at fixed time intervals: 60 times per second by default. You can change the interval from the Project Settings, under Physics -> Common -> Physics Fps.
cs: Zpracování fyziky pomocí `` _physics_process () `` je podobné, ale mělo by být použito pro akce, které musí nastat před každým fyzikálním krokem, jako je například ovládání postavy. Vždy běží před zpracováním kroku fyziky a je volán ve fixních časových intervalech: standardně 60krát za sekundu. Interval můžete změnit z Nastavení projektu v části Fyzika -> Společné -> Fyzika Fps.
de: Die Physikverarbeitung mit ``_physics_process()`` ist ähnlich, sollte jedoch für Prozesse verwendet werden, die vor jedem physikalischen Schritt ausgeführt werden müssen, z.B. zum Steuern eines Charakters. Sie läuft immer vor einem physikalischen Schritt ab und wird in festen Zeitabständen aufgerufen: standardmäßig 60-mal pro Sekunde. Sie können das Intervall in den Projekteinstellungen unter Physik -> Allgemein -> Physik Fps ändern.
es: El procesamiento de la física con ``_physics_process()`` es similar, pero se debería usar para procesos que deben ocurrir antes de cada paso de la física, como el control de un personaje. Siempre se ejecuta antes de un paso de física y se llama en intervalos de tiempo fijos: 60 veces por segundo por defecto. Puedes cambiar el intervalo desde la Configuración del proyecto, en Physics -> Common -> Physics Fps.
fi: Fysiikkaprosessointi ``_physics_process()`` funktiolla on samanlaista, mutta sitä tulisi käyttää sellaiseen käsittelyyn, jonka täytyy tapahtua jokaisen fysiikkapäivityksen yhteydessä, kuten hahmon ohjaaminen. Se suoritetaan aina ennen fysiikkavaihetta ja sitä kutsutaan tasaisin väliajoin: oletusarvoisesti 60 kertaa sekunnissa. Voit muuttaa aikaväliä projektin asetuksista, kohdasta Physics -> Common -> Physics Fps.
fr: Le traitement physique avec ``_physics_process()`` est similaire, mais devrait être utilisé pour des traitements qui doivent se produire avant chaque étape physique, comme lorsqu'on contrôle un personnage. Il est toujours exécuté avant une étape physique et est appelé à intervalles fixes : 60 fois par secondes par défaut. Vous pouvez changer l'intervalle dans les paramètres du projet sous Physics -> Common -> Physics Fps.
it: Il processo fisico con `` _physics_process () `` è simile, ma dovrebbe essere usato per processi che devono accadere prima di ogni step fisico, come controllare un personaggio. Viene sempre eseguito prima di un step fisico e viene chiamato a intervalli regolari: 60 volte al secondo di default. Puoi cambiare l'intervallo da Project Settings, sotto Physics -> Common -> Physics Fps.
ja: ``_physics_process()`` での物理処理は似ていますが、これはキャラクタの制御など、各物理ステップの前に実行する必要がある処理に使用する必要があります。常に物理ステップの前に実行され、固定時間間隔(デフォルトでは毎秒60回)で呼び出されます。この間隔は、Physics->Common->Physics FpsのProject Settingsで変更できます。
ko: ``_physics_process()``\ 를 이용한 동적 처리도 이와 유사합니다. 하지만 이것은 각 동적 단계 이전에서 발생해야 하는 과정에서 사용해야 합니다. 예를 들면 캐릭터 조종하는 것이 있죠. 이것은 항상 동적 단계 이전에 실행되며 고정된 시간 간격으로 호출됩니다: 기본은 초 당 60회. 프로젝트 설정(Project Settings)에서 Physics -> Common -> Physics Fps에서 시간 간격을 변경할 수 있습니다.
pl: Przetwarzanie operacji fizycznych w ``_physics_process()`` jest podobne, ale powinno być używane do procesów, które muszą wystąpić przed każdym obliczeniem fizyki, takich jak kontrolowanie postaci. Zawsze działa przed obliczaniem fizyki i jest wywoływany w ustalonych odstępach czasu: domyślnie 60 razy na sekundę. Można zmienić odstęp czasu pomiędzy wywoływaniem funkcji ``_physics_process()`` ustawieniami projektu, przechodząc do zakładki Physics -> Common -> Physics Fps.
pt_br: Processamento físico com ``_physics_process()`` funciona similar, mas deveria ser usado para processo que tenham que acontecer antes de cada passo da física, tais como controlar um personagem. Ele sempre é executado antes de um passo da física e é chamado a intervalos fixos de tempo: 60 vezes por segundo por padrão. Você pode alterar o intervalo nas Configurações do Projeto, em Physics -> Common -> Physics Fps (Física -> Comum -> Fps Física).
ru: Обработка физики с помощью ``_physics_process()`` аналогична, но она должна использоваться для процессов, которые должны выполняться до каждого этапа физики, такого как управление персонажем. Она всегда запускается до этапа физики и вызывается с фиксированными временными интервалами: 60 раз в секунду по умолчанию. Вы можете изменить интервал в настройках проекта, в разделе Физика -> Общие -> Физическая Fps.
zh_cn: 用 ``_physics_process()`` 进行物理处理是相似的，但应将其用于必须在每个物理步骤之前进行的处理，例如控制角色。它始终在物理步骤之前运行，并且以固定的时间间隔调用：默认为每秒60次。您可以从“项目设置”的“物理”->“通用”->“物理Fps”下更改时间间隔。
zh_tw: 使用 ``_physics_process()`` 來進行物理處理，但物理處理是在每個物理步驟前使用的，如控制角色。物理處理永遠都在物理步驟之前執行，而且會以相同的間隔呼叫，預設為每秒 60 次。可以在專案設定中的 [Physics] -> [Common] -> [Physics FPS] 來更改這個間隔。

source: The function ``_process()``, however, is not synced with physics. Its frame rate is not constant and is dependent on hardware and game optimization. Its execution is done after the physics step on single-threaded games.
cs: Funkce `_process ()` `však není synchronizována s fyzikou. Její obnovovací frekvence není konstantní a závisí na hardwaru a optimalizaci hry. U jednovláknových her je spouštěna až po dokončení fyzikálního kroku.
de: Die Funktion ``_process()`` ist jedoch nicht mit der Physik synchronisiert. Die Bildrate ist nicht konstant und hängt von der Hardware- und Spieloptimierung ab. Die Ausführung erfolgt nach dem physikalischen Schritt bei Single-Threaded-Spielen.
es: La función ``_process()``, sin embargo, no está sincronizada con la física. Su frecuencia de imagen no es constante y depende de la optimización del hardware y del juego. Su ejecución se realiza después del paso de la física en los juegos de un solo subproceso.
fi: ``_process()`` funktio ei kuitenkaan ole synkronoitu fysiikan kanssa. Sen päivitysnopeus ei ole vakio ja riippuu laitteistosta ja pelin optimoinneista. Yksisäikeisissä peleissä sen suoritus tehdään fysiikkavaiheen jälkeen.
fr: La fonction ``_process()``, cependant, n'est pas synchronisée avec la physique. Son taux de rafraîchissement n'est pas constant et dépend de l'optimisation du hardware et du jeu. Son exécution se fait après le traitement de la physique sur les jeux mono-threadés.
it: La funzione ``_process()``, però, non è sincronizzata con la fisica. I frame rateo non è costante ed esso dipende dall'hardware e dalla ottimizzazione del gioco. L'esecuzione avviene dopo i processi della fisica nei giochi a thread singolo.
ja: ただし、 ``_process()`` 関数は物理学と同期されません。フレームレートは一定ではなく、ハードウェアとゲームの最適化に依存します。その実行は、シングルスレッドのゲームの物理ステップの後に行われます。
ko: 그러나 ``_proceed()`` 함수는 동적과 동기화되지 않습니다. 프레임 비율이 일정하지 않고 하드웨어와 게임 최적화에 의존하기 때문이죠. 이것은 단일 스레드 게임의 동적 단계를 거친 후에 실행됩니다.
pl: Funkcja ``_process()`` nie jest jednak zsynchronizowana z fizyką. Częstotliwość odświeżania nie jest stała i zależy od optymalizacji sprzętu i gier. Jej wykonanie następuje po obliczeniu fizyki w grach jednowątkowych.
pt_br: A função ``_process()``, contudo, não é sincronizado com a física. Sua taxa de quadros não é constante e depende do hardware e da otimização do jogo. Sua execução é feita depois do passo da física em jogos de thread única.
ru: Однако, функция ``_process()`` не синхронизируется с физикой. Ее частота кадров не является постоянной и зависит от аппаратной и игровой оптимизации. В однопоточных играх ее выполнение осуществляется после этапа физики.
zh_cn: 然而，函数 ``_process()`` 不与物理同步。它的帧率不是恒定的，并且取决于硬件和游戏优化。在单线程游戏中它的执行是在的物理步骤之后完成的。
zh_tw: 然而，``_process()`` 函式並不與物理處理同步。_process() 的幀率並不固定，且會根據硬體與遊戲的最佳化而有所不同。在單一執行緒的遊戲上，_process() 會在物理步驟後才被執行。

source: A simple way to see the ``_process()`` function at work is to create a scene with a single Label node, with the following script:
cs: Jednoduchý způsob, jak vidět funkci `_process()` při práci je vytvořit scénu s jediným Label uzlem s následujícím skriptem:
de: Eine einfache Möglichkeit die ``_process()``-Funktion bei der Arbeit zu sehen besteht darin, eine Szene mit einem einzelnen Label-Node zu erstellen. Sie können dies mit dem folgendem Skript erledigen:
fi: Yksinkertainen tapa nähdä ``_process()`` funktio toiminnassa, on luoda skene, jossa on yksittäinen Label solmu seuraavalla skriptillä varustettuna:
fr: Une façon simple de voir la fonction ``_process()`` au travail est de créer une scène avec un seul nœud Label, avec le script suivant :
it: Un semplice modo per vedere la funzione ``_process()`` al lavoro è creando una scena con un singolo nodo Etichetta, con il seguente script:
ja: 次のスクリプトを使用して、ひとつのLabelノードを持つシーンを作成すると、動作中の_process()関数を簡単に確認できます:
ko: 간단하게 ``_process()`` 함수가 작동하는 것을 보려면 Label 노드 하나로 된 씬을 만들고, 다음 스크립트를 넣습니다:
pt_br: Uma maneira simples de ver a função ``_process()`` funcionando é criar uma cena com um único nó Label, com o seguinte roteiro:
ru: Простой способ посмотреть метод ``_process()`` в работе, это создать сцену с одной нодой типа Label и со следующим скриптом:
zh_cn: 在作品中查看 ``_process()`` 函数的一种简单方法是创建具有单个Label节点的且带有以下脚本的场景：
zh_tw: 有一個簡單的方法可以讓我們瞭解 ``_process()``。先建立一個有 Label 節點的場景，然後使用下列腳本：

source: Which will show a counter increasing each frame.
cs: Ukáže nám to počítadlo, které se s každým dalším framem (snímkem) zvyšuje.
de: Es zeigt einen Zähler, der die Frameanzahl erhöht.
es: Lo que mostrará un contador aumentando cada fotograma.
fi: Se näyttää kunkin ruudunpäivityksen yhteydessä kasvavan laskurin.
fr: Ce qui montrera un compteur s'incrémentant à chaque image.
it: Il quale mostrerà un contatore che incrementa ad ogni frame.
ja: これにより、各フレームが増加するカウンタが表示されます。
ko: 위 스크립트는 프레임 당 증가하는 카운터를 보여 줍니다.
pl: Który będzie pokazywał licznik zwiększający każdą klatkę.
pt_br: Que vai mostrar um contador aumentando a cada quadro.
ru: Он будет показывать счетчик, который будет увеличиваться на каждом кадре.
zh_cn: 这将显示一个每帧增加的计数器。
zh_tw: 這樣就會顯示一個每一幀都會增加的計數器。

source: Groups
cs: Skupiny
de: Gruppen
es: Grupos
fi: Ryhmät
fr: Groupes
it: Gruppi
ja: グループ
ko: 그룹
pl: Grupy
pt_br: Grupos
ru: Группы
zh_cn: 编组
zh_tw: 群組
