Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_continued.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, zh_cn, zh_tw

source: To delete a node, be it inside or outside the scene, ``free()`` must be used:
cs: Pro smazání uzlu, ať už uvnitř nebo vně scény, musí být použito `` free () ``:
de: Um ein Node zu löschen, egal ob innerhalb oder außerhalb der Scene, muss ``free()`` verwendet werden:
es: Para eliminar un nodo, ya sea dentro o fuera de la escena, se debe usar ``free()``:
fi: Solmun tuhoamiseksi, oli se sitten skenen sisällä tai ulkopuolella, on käytettävä ``free()`` metodia:
fr: Pour supprimer un nœud, que ce soit à l'intérieur ou à l'extérieur de la scène, il faut utiliser ``free()`` :
it: Per eliminare un nodo, che sia dentro o fuori la scena, deve essere usato ``free()``:
ja: シーンの内部または外部にあるノードを削除するには、 ``free()`` を使用する必要があります:
ko: 씬 내부 또는 외부에 있는 노드를 삭제하려면 ``free()``\ 를 사용해야 합니다:
pl: Aby usunąć węzeł, zarówno wewnątrz, jak i na zewnątrz sceny, należy użyć ``free()``:
pt_br: Para excluir um nó, esteja ele dentro ou fora da cena, deve-se usar ``free()``:
ru: Для удаления узла, будь он внутри или снаружи сцены, необходимо использовать метод ``free()``:
zh_cn: 要删除节点，无论是在场景内还是场景外，都必须使用 ``free()``：
zh_tw: 不論是在節點的場景內還是場景外刪除節點都要使用 ``free()`` ：

source: When a node is freed, it also frees all its child nodes. Because of this, manually deleting nodes is much simpler than it appears. Free the base node and everything else in the subtree goes away with it.
cs: Když je uzel uvolněn, uvolní také všechny jeho podřízené uzly. Z tohoto důvodu je ruční mazání uzlů mnohem jednodušší, než se zdá. Uvolněte základní uzel a všechno ostatní v podstromu zmizí spolu s ním.
de: Wird ein Node freigegeben, so werden auch all seine untergeordneten Nodes freigegeben. Aus diesem Grund ist das manuelle Löschen von Nodes viel einfacher als es scheint. Geben Sie den Basis-Node frei und alles andere im Teilbaum verschwindet damit.
fi: Kun solmu vapautetaan, myös kaikki sen alisolmut vapautetaan. Tästä johtuen solmujen manuaalinen tuhoaminen on paljon helpompaa kuin miltä se vaikuttaa. Vapauta pohjasolmu ja kaikki muu alipuussa menee sen mukana.
fr: Lorsqu'un nœud est libéré, il libère également tous ses nœuds enfants. Pour cette raison, la suppression manuelle des nœuds est beaucoup plus simple qu'il n'y paraît. Libérez le nœud de base et tout le reste dans le sous-arbre disparaît avec lui.
it: Quando un nodo viene liberato, vengono liberati anche i suoi nodi figli. Per questo motivo, eliminare manualmente i nodi è più semplice di quanto sembri. Libera il nodo base ed ogni suo sotto-nodo lo seguerà.
ja: ノードが解放されると、そのすべての子ノードも解放されます。このため、ノードを手動で削除するのは見た目よりずっと簡単です。ベースノードを解放すると、サブツリー内のその他すべてのものがなくなります。
ko: 노드가 삭제되면 모든 하위 노드도 삭제됩니다. 따라서 수동으로 노드를 삭제하는 것이 수동으로 나타내는 것보다 훨씬 간단합니다. 기본 노드를 삭제하면 하위 트리에 있는 다른 모든 것이 삭제됩니다.
pt_br: Quando um nó é liberado da memória, ele também libera todos os seus nós filhos. Por isso, excluir nós manualmente é mais simples do que parece. Libere o nó base e todo o resto vai embora junto com ele.
ru: Когда узел удаляется, он также удаляет все свои дочерние узлы. Из-за этого удаление узлов вручную намного проще, чем кажется. Удалите базовый узел, и все остальные узлы будут удалены вместе с ним.
zh_cn: 当一个节点被释放时, 它也会释放其所有子节点。因此, 手动删除节点比看起来简单得多。释放基节点, 那么子树中的其他所有东西都会随之消失。
zh_tw: 釋放節點後，也會把該節點的所有子節點都釋放。由此可知刪除節點其實很簡單。只要刪除一個節點，在樹狀結構下的所有子節點也都會一起被刪除。

source: A situation might occur where we want to delete a node that is currently "blocked", because it is emitting a signal or calling a function. This will crash the game. Running Godot with the debugger will often catch this case and warn you about it.
cs: Může nastat situace, kdy chceme odstranit uzel, který je aktuálně „blokován“, protože vysílá signál nebo volá funkci. Tím dojde ke zhroucení hry. Spuštění Godota s debuggerem tento případ často zachytí a upozorní vás na to.
de: Es kann vorkommen, dass wir einen Node löschen möchten, der gerade "blockiert" ist, weil er ein Signal sendet oder eine Funktion aufruft. Dies führt zum Absturz des Spiels. Wenn Sie Godot mit dem Debugger ausführen wird dieser Fall häufig erkannt und Sie werden gewarnt.
es: Puede ocurrir una situación en la que queramos borrar un nodo que esté actualmente "bloqueado", porque esté emitiendo una señal o llamando a una función. Esto interrumpirá el juego. Ejecutar Godot con el depurador a menudo detectará este caso y te advertirá al respecto.
fi: Sellainen tilanne voi sattua, että haluamme poistaa solmun, joka on parhaillaan "estetty", koska se on lähettämässä signaalia tai kutsumassa funktiota. Tämä kaataa pelin. Godotin ajaminen debuggerissa pyydystää usein tämäntyyppisen tapauksen ja varoittaa sinua siitä.
fr: Une situation peut se produire dans laquelle nous voulons supprimer un nœud qui est actuellement "bloqué", parce qu'il émet un signal ou appelle une fonction. Ceci fera planter le jeu. Lancer Godot avec le débogueur permet souvent de détecter ce cas et de vous en avertir.
it: Potrebbe verificarsi una situazione in cui noi vogliamo eliminare un nodo che è attualmente "bloccato", perchè sta emettendo un segnale o chiamando una funzione. Questo causerà il crash del gioco. Il debugger di Godot scoverà spesso queste situazioni e ti avvertirà.
ja: シグナルを発信している、または関数を呼び出しているために、現在 "blocked" になっているノードを削除したい場合があります。これはゲームをクラッシュさせます。デバッガでGodotを実行すると、このケースを検出して警告することがよくあります。
ko: 현재 "차단된" 노드를 삭제하려는 상황이 발생할 수 있습니다. 차단된 노드는 시그널을 방출하고 있거나 함수를 호출하고 있죠. 이것은 게임을 망칠 것입니다. 디버거(Debugger)로 Godot를 실행하면 이 경우를 발견하고 경고를 표시하는 경우가 많습니다.
pl: Może się zdarzyć, że chcemy usunąć węzeł, który jest obecnie "zablokowany", ponieważ emituje sygnał lub wywołuje funkcję. To wywoła błąd gry. Uruchomienie Godota z debuggerem często wyłapuje tą sytuację ostrzega przed nią.
pt_br: Uma situação pode acontecer quando queremos excluir um nó que está "bloqueado" atualmente, por estar emitindo um sinal ou chamando uma função. Isso quebra o jogo. Executar o Godot com o depurador irá pegar esse caso frequentemente e lhe alertar sobre isso.
ru: Может возникнуть ситуация, когда мы хотим удалить узел, который в настоящее время "заблокирован", так как он излучает сигнал или вызывает функцию. Это приведет к сбою игры. Запуск Godot с отладчиком будет отлавливать такие ситуации и предупреждать вас об этом.
zh_cn: 当我们要删除当前“阻塞”的节点时，可能会发生这种情况，因为该节点正在发出信号或正在调用函数。这会导致游戏崩溃。使用调试器运行Godot通常能捕获这种情况并向您发出警告。
zh_tw: 但有可能會發生一個狀況，就是我們要刪除的節點可能會被「封鎖 (Block)」，因為這個節點可能正在傳送訊號或是呼叫函式。如果把這個節點刪除了遊戲可能會當掉。而當有開啟 Godot 的除錯工具時通常會偵測到此一情況，並且會顯示相關警告。

source: The safest way to delete a node is by using :ref:`Node.queue_free() <class_Node_method_queue_free>`. This erases the node safely during idle.
cs: Nejbezpečnější způsob, jak odstranit uzel, je pomocí: ref: `Node.queue_free () <class_Node_method_queue_free>`. Toto bezpečně vymaže uzel během jeho nečinnosti.
de: Die sicherste Methode zum Löschen eines Nodes ist die Verwendung von :ref:`Node.queue_free() <class_Node_method_queue_free>`. Dadurch wird der Node im Ruhezustand des Spiels sicher gelöscht.
es: La forma más segura de eliminar un nodo es usando :ref:`Node.queue_free() <class_Node_method_queue_free>`. Esto borra el nodo de forma segura mientras está inactivo.
fi: Turvallisin tapa solmun tuhoamiseksi on käyttää :ref:`Node.queue_free() <class_Node_method_queue_free>` metodia. Tämä poistaa solmun turvallisesti toimettomalla hetkellä.
fr: La façon la plus sûre de supprimer un nœud est d'utiliser :ref:`Node.queue_free() <class_Node_method_queue_free>`. Ceci efface le nœud en toute sécurité pendant la période d'inactivité.
it: Il modo più sicuro per eliminare un nodo è usando :ref:`Node.queue_free() <class_Node_method_queue_free>`. Questo cancella i nodi in modo sicuro quando non vengono usati.
ja: ノードを削除する最も安全な方法は、 :ref:`Node.queue_free() <class_Node_method_queue_free>`\ を使用することです。これにより、アイドル中にノードが安全に消去されます。
ko: 노드를 삭제하는 가장 안전한 방법은 :ref:`Node.queue_free() <class_Node_method_queue_free>`\ 를 사용하는 것입니다. 이것은 대기 상태일 때 노드를 안전하게 삭제합니다.
pt_br: A forma mais segura de excluir um nó é usando :ref:`Node.queue_free() <class_Node_method_queue_free>`. Isso apaga o nó com segurança durante o tempo ocioso.
ru: Самый безопасный способ удалить узел - это использовать функцию :ref:`Node.queue_free() <class_Node_method_queue_free>`. Это безопасно удаляет узел во время его бездействия.
zh_cn: 删除节点的最安全方法是使用 :ref:`Node.queue_free() <class_Node_method_queue_free>`。 这将在空闲期间安全地删除节点。
zh_tw: 要刪除一個節點最安全的方法是使用 :ref:`Node.queue_free() <class_Node_method_queue_free>` 。這個方法會在閒置的時候安全地刪除節點。

source: Instancing scenes
cs: Vytvoření instance scény
de: Szenen in­s­tan­zi­ie­ren
es: Instanciación de escenas
fi: Skenejen instantiointi
fr: Instancier des scènes
it: Istanziare scene
ja: シーンのインスタンス化
ko: 씬 인스턴스하기
pl: Instancjowanie scen
pt_br: Criando instâncias de cenas
ru: Инстанцирование сцен
zh_cn: 实例化场景
zh_tw: 實體化場景

source: Instancing a scene from code is done in two steps. The first one is to load the scene from your hard drive:
cs: Instalace scény z kódu se provádí ve dvou krocích. Prvním je načtení scény z pevného disku:
de: Szenen werden in zwei Schritten in­s­tan­zi­ie­rt. Zuerst muss die Szene von der Festplatte geladen werden:
es: La instanciación de una escena a partir de código se realiza en dos pasos. El primero es cargar la escena desde el disco duro:
fi: Skenejen instantiointi koodissa tehdään kahdessa vaiheessa. Ensiksi skene ladataan kiintolevyltä:
fr: Instancier une scène depuis le code se fait en deux étapes. La première est de charger la scène à partir de votre disque dur :
it: Istanziare una scena da codice viene fatto in due passaggi. Il primo è caricare la scena dal tuo hard drive:
ja: コードからシーンをインスタンス化するには、2つの手順があります。 まず最初にハードドライブからシーンをロードします:
ko: 코드에서 씬을 인스턴스하는 작업은 두 단계로 이루어집니다. 첫 번째 방법은 하드 드라이브에서 씬을 불러오는 것입니다:
pl: Instancjowanie sceny z kodu odbywa się w dwóch krokach. Pierwszym z nich jest wczytanie sceny z dysku twardego:
pt_br: Criar uma instância de cena a partir do código é feito em duas estapas. A primeira é carregar a cena do seu disco rígido:
ru: Инстанцирование сцены из кода выполняется в два этапа. Первый - загрузить сцену с жесткого диска:
zh_cn: 从代码实例化场景分两个步骤完成。第一步是从硬盘驱动器加载场景：
zh_tw: 使用程式碼來建立節點可以區分為兩個步驟。第一個步驟是從硬碟中載入場景：

source: Preloading it can be more convenient, as it happens at parse time (GDScript only):
cs: Předběžné načtení může být pohodlnější, protože k tomu dochází v době parsování (přípravy)skriptu(pouze GDScript):
de: Das Vorladen kann bequemer sein, da dies zur Analysezeit geschieht (gilt nur für GDScript):
es: La precarga puede ser más conveniente, ya que ocurre en tiempo de análisis (sólo GDScript):
fi: Sen esilataaminen saattaa olla sopivampaa, koska se tapahtuu skriptin jäsennysaikana (vain GDScript):
fr: Le préchargement peut être plus pratique, car il se produit lors de l'analyse du code (GDScript uniquement) :
it: Il precaricamento può essere più conveniente, siccome accade nella fase di analisi (solo GDScript):
ja: プリロードは解析時に動作するため便利です（GDScriptのみ）:
ko: (GDScript인 경우라면) 구문 분석 시간 동안 프리로드(Preload)를 할 수 있어서 더 편리합니다:
pl: Wstępne ładowanie (preloading) może być wygodniejsze, gdyż ma miejsce podczas parsowania (tylko GDScript):
pt_br: Pré-carregamento pode ser mais conveniente, já que acontece durante o tempo de análise (apenas para GDScript):
ru: Предварительная загрузка может быть более удобной, т.к. происходит во время парсинга (только для GDScript):
zh_cn: 预加载可以更方便，因为它是在解析时发生的（仅适用于GDScript）：
zh_tw: 把場景預先載入進來可能會更方便，因為預載是在解析時執行的 (僅可用於 GDScript)：

source: But ``scene`` is not yet a node. It's packed in a special resource called :ref:`PackedScene <class_PackedScene>`. To create the actual node, the function :ref:`PackedScene.instance() <class_PackedScene_method_instance>` must be called. This will return the tree of nodes that can be added to the active scene:
cs: Ale „scéna“ ještě není uzlem. Je zabalena do speciálního zdroje s názvem: ref: `PackedScene <class_PackedScene>`. Pro vytvoření skutečného uzlu je třeba zavolat funkci: ref: `PackedScene.instance () <class_PackedScene_method_instance>`. Ta vrátí strom uzlů, který lze přidat k aktivní scéně:
de: ``scene`` ist noch kein Node. Er ist in einer speziellen Ressource verpackt :ref:`PackedScene <class_PackedScene>`. Um den tatsächlichen Node zu erstellen, muss die Funktion :ref:`PackedScene.instance() <class_PackedScene_method_instance>` aufgerufen werden. Dies gibt die Struktur der Nodes zurück, die der aktiven Szene hinzugefügt werden können:
es: Pero ``scene`` todavía no es un nodo. Está empaquetado en un recurso especial llamado :ref:`PackedScene <class_PackedScene>`. Para crear el nodo se debe llamar a la función :ref:`PackedScene.instance() <class_PackedScene_method_instance>`. Esto retornará el árbol de nodos que se puede añadir a la escena activa:
fi: Mutta ``scene`` ei ole vielä solmu. Se on pakattu erityiseen :ref:`PackedScene <class_PackedScene>` nimiseen resurssiin. Varsinaisen solmun luomiseksi täytyy kutsua :ref:`PackedScene.instance() <class_PackedScene_method_instance>` funktiota. Tämä palauttaa solmupuun, joka voidaan lisätä aktiiviseen skeneen:
fr: Mais ``scene`` n'est pas encore un nœud. Elle est emballée dans une ressource spéciale appelée :ref:`PackedScene <class_PackedScene>`. Pour créer le nœud, la fonction :ref:`PackedScene.instance() <class_PackedScene_method_instance_PackedScene_instance>` doit être appelée. Cela retournera l'arborescence des nœuds qui peuvent être ajoutés à la scène active :
it: Ma ``scene`` non è ancora un nodo. È impacchettato in una risorsa speciale chiamata :ref:`PackedScene <class_PackedScene>`. Per creare il nodo, bisogna chiamare la funzione :ref:`PackedScene.instance() <class_PackedScene_method_instance>`. Questo ritorna l'albero di nodi che possono essere aggiunti alla scena attiva:
ja: しかし、``シーン``はまだノードではありません。 :ref:`PackedScene <class_PackedScene>`\ と呼ばれる特別なリソースにパックされています。実際のノードを作成するには、:ref:`PackedScene.instance() <class_PackedScene_method_instance>`\ 関数を呼び出す必要があります。これにより、アクティブシーンに追加できるノードのツリーが返されます:
ko: 그러나 ``씬(Scene)``\ 은 아직 노드가 아닙니다. 이것은 :ref:`PackedScene <class_PackedScene>`\(포장된 씬)이라는 특수 리소스에 들어 있습니다. 실제 노드를 만들려면 :ref:`PackedScene.instance() <class_PackedScene_method_instance>` 함수를 호출해야 합니다. 그러면 PackedScene은 활성 씬에 추가할 수 있는 노드 트리를 반환합니다:
pl: Ale ``scene`` nie jest jeszcze węzłem. Jest zapakowany w specjalny zasób o nazwie :ref:`PackedScene <class_PackedScene>`. Aby utworzyć węzeł należy wywołać funkcję :ref:`PackedScene.instance() <class_PackedScene_method_instance>`. Spowoduje to zwrócenie drzewa węzłów, które można dodać do aktywnej sceny:
pt_br: Mas ``cena`` ainda não é um nó. Ela está empacotada em um recurso especial chamado :ref:`PackedScene <class_PackedScene>`. Para criar um nó de fato, é preciso chamar a função :ref:`PackedScene.instance() <class_PackedScene_method_instance>`. Ela vai retornar a árvore de nós que pode ser adicionada à cena ativa:
ru: Но ``scene`` еще не является узлом. Она упакована в специальный пакет, называемый :ref:`PackedScene <class_PackedScene>`. Чтобы создать настоящий узел, необходимо вызвать функцию :ref:`PackedScene.instance() <class_PackedScene_method_instance>`. Это вернет дерево узлов, которое можно добавить в активную сцену:
zh_cn: 但是 ``scene`` 还不是一个节点。它被打包在一个称为 :ref:`PackedScene <class_PackedScene>` 的特殊资源中。要想创建实际的节点，就必须调用函数 :ref:`PackedScene.instance() <class_PackedScene_method_instance>`。这将返回可以添加到活动场景的节点树：
zh_tw: 但 ``scene`` (場景) 還不是節點，目前還打包在一個叫做 :ref:`PackedScene <class_PackedScene>` (打包場景) 的特殊資源內。要真正建立節點，必須呼叫 :ref:`PackedScene.instance()` 函式。這個函式會回傳一個可以被新增到有效場景內的節點樹：

source: The advantage of this two-step process is that a packed scene may be kept loaded and ready to use so that you can create as many instances as desired. This is especially useful to quickly instance several enemies, bullets, and other entities in the active scene.
cs: Výhodou tohoto dvoustupňového procesu je, že zabalená scéna může být nahrána a připravena k použití, takže jste schopni vytvořit libovolný počet instancí. To je užitečné zejména při rychlém nasazení několika nepřátel, kulek a dalších entit do aktivní scény.
de: Der Vorteil dieses zweistufigen Prozesses besteht darin, dass eine gepackte Szene geladen bleibt und verwendet werden kann, sodass Sie beliebig viele Instanzen erstellen können. Dies ist besonders nützlich um schnell mehrere Feinde, Geschosse und andere Objekte in der aktiven Szene zu instanziieren.
es: La ventaja de este proceso de dos pasos es que una escena empaquetada se puede mantener cargada y lista para usar para que puedas crear tantas instancias como desees. Esto es especialmente útil para identificar rápidamente varios enemigos, balas y otras entidades en la escena activa.
fi: Tämän kaksivaiheisen prosessin etu on, että pakattu skene voidaan pitää ladattuna ja käyttövalmiina, niin että siitä voidaan luoda niin monta ilmentymää kuin on tarpeen. Se on käytännöllistä varsinkin useiden vihollisten, ammusten ja muiden yksiköiden luomisessa aktiiviseen skeneen.
fr: L'avantage de ce processus en deux temps est qu'une scène emballée peut être chargée et prête à l'emploi afin que vous puissiez créer autant d'instances que vous le souhaitez. C'est particulièrement utile pour instancier rapidement plusieurs ennemis, balles et autres entités dans la scène active.
it: Il vantaggio di questo processo diviso in due passaggi è che la PackedScene potrebbe essere caricata e pronta all'uso così che tu possa creare quante istanze desideri. È molto utile per istanziare velocemente un grande numero di nemici, proiettili e altre entità nella scena attiva.
ja: この2段階のプロセスの利点は、パックされたシーンをロードして使用できる状態に保ち、必要なだけインスタンスを作成できることです。 これは、アクティブシーン内の複数の敵、弾丸、その他の存在をすばやくインスタンス化するのに特に便利です。
ko: 이 두 단계 처리의 이점은 PackedScene이 불러온 상태로 유지되고 언제나 사용될 준비를 합니다. 이렇게 해서 인스턴스를 원하는 만큼 만들 수 있습니다. 이것은 특히 활성 씬에서 많은 적, 총알, 그 외 다른 개체를 신속하게 인스턴스하는 데 유용합니다.
pl: Zaletą tego dwuetapowego procesu jest to, że zapakowana scena może być załadowana i gotowa do użycia, dzięki czemu można utworzyć dowolną liczbę instancji. Jest to szczególnie przydatne do szybkiego wywołania kilku wrogów, pocisków i innych podmiotów na aktywnej scenie.
pt_br: A vantagem deste processo de duas etapas é que uma cena empacotada pode ser mantida carregada e pronta para uso, de forma que você possa gerar quantas instâncias desejar. É útil especialmente para, rapidamente, criar instâncias de vários inimigos, balas e outras entidades na cena ativa.
ru: Преимущество этого двухэтапного процесса заключается в том, что упакованная сцена может быть загружена и готова к использованию, так что вы можете создать сколько угодно экземпляров. Это особенно полезно для быстрого инстанцирования нескольких врагов, пуль и других объектов в активной сцене.
zh_cn: 此两步过程的优点在于，打包的场景可以保持加载状态并可以随时使用，以便您可以根据需要创建尽可能多的实例。这对于在活动场景中快速实例化多个敌人、子弹、和其他实体特别有用。
zh_tw: 拆成「載入 - 實體化」兩個步驟的優點是，載入過打包場景後就可以維持已載入的狀態，隨時拿來使用。這樣一來我們就可以根據需要建立任意數量的實體。特別適用於需要在有效場景內快速實體化多個敵人、子彈或是其他實體的情況。

source: Register scripts as classes
cs: Registrace skriptu jako třídy
de: Skripte als Klassen registrieren
es: Registrar scripts como clases
fi: Skriptien rekisteröinti luokiksi
fr: Enregistrer des scripts en tant que classes
it: Registra script come classi
ja: スクリプトをクラスとして登録する
ko: 스크립트를 클래스로 등록하기
pl: Rejstrowanie skryptów jako klasy
pt_br: Registre scripts como classes
ru: Регистрация сценариев в качестве классов
zh_cn: 将脚本注册为类
zh_tw: 將腳本註冊為類別

source: Godot has a "Script Class" feature to register individual scripts with the Editor. By default, you can only access unnamed scripts by loading the file directly.
cs: Godot má vlastnost "ScriptClass" pro registraci jednotlivých skriptů v Editoru. Ve výchozím nastavení máte přístup pouze k nepojmenovaným skriptům po přímém načtení souboru.
de: Godot verfügt über eine "Skript-Klassen" -Funktion, um einzelne Skripte im Editor zu registrieren. Standardmäßig können Sie nur auf unbenannte Skripte zugreifen, indem Sie die Datei direkt laden.
es: Godot tiene una funcionalidad de "Script Class" para registrar codigos individuales con el Editor. Por defecto, solo puedes accesar codigos sin nombre cargando el archivo directamente.
fi: Godotissa on "skriptiluokka"-ominaisuus yksittäisten skriptien rekisteröintiin editorissa. Lähtökohtaisesti pääset käsiksi nimeämättömiin skripteihin vain lataamalla tiedoston suoraan.
fr: Godot fournit une fonctionnalité "Script Class" permettant d'enregistrer des scripts depuis l'éditeur. Par défaut, l'accès au scripts anonymes n'est possible qu'en chargeant le fichier directement.
it: Godot ha una funzione "Script Class" per registrare singoli script con l'editor. Di default, puoi accedere agli script senza nome solo caricando direttamente il file.
ja: Godotには、エディターに個々のスクリプトを登録するための「スクリプトクラス」機能があります。デフォルトでは、ファイルを直接ロードすることでのみ名前のないスクリプトにアクセスできます。
ko: Godot는 편집기의 각 스크립트를 등록하기 위한 "스크립트 클래스(Script Class)" 기능을 갖고 있습니다. 기본적으로 이름이 없는 스크립트에 접근하려면 파일을 직접 불러와야 합니다.
pt_br: Godot tem uma função "Classe Script" para registrar scripts individuais com o editor. Por padrão, você só pode acessar scripts sem nome ao carregar o arquivo diretamente.
ru: Godot имеет "Script Class" для регистрации отдельных скриптов в редакторе. По умолчанию доступ к безымянным сценариям можно получить только загрузив файл напрямую.
zh_cn: Godot有一个“脚本类”的功能，可以使用编辑器注册单个脚本。默认情况下，您只能通过直接加载文件访问未命名的脚本。
zh_tw: Godot 有一個「腳本類別」功能，可以在編輯器內註冊個別腳本。預設情況下，要存取未命名的腳本，就只能直接載入檔案。
