Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_continued.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, zh_cn, zh_tw

source: You can name a script and register it as a type in the editor with the ``class_name`` keyword followed by the class's name. You may add a comma and an optional path to an image to use as an icon. You will then find your new type in the Node or Resource creation dialog.
cs: Můžete pojmenovat skript a zaregistrovat jej jako typ v editoru pomocí klíčového slova `class_name`` následovaného názvem třídy. Můžete přidat čárku a volitelnou cestu k obrázku, který lze použít jako ikonu. Poté najdete svůj nový typ v dialogu pro vytvoření uzlu nebo prostředků.
de: Sie können ein Skript benennen und als Typ im Editor mit dem Schlüsselwort ``class_name``, gefolgt von dem Namen der Klasse, registrieren. Gefolgt von einem Komma können Sie optional einen Pfad zu einer Bilddatei hinzufügen. Sie finden Ihren neuen Typen dann im Dialogfeld "Nodes- oder Ressourcenerstellung".
es: Puedes nombrar un script y registrarlo como un tipo en el editor con la palabra clave ``class_name`` seguida por el nombre de la clase. Puedes agregar una coma y una dirección opcional a una imagen para usarla como ícono. De esta forma encontrarás un nuevo tipo en la ventana Node o Resource creation.
fr: Vous pouvez nommer un script et l'enregistrer comme type dans l'éditeur avec le mot-clé ``class_name`` suivi par le nom de la classe. Vous pouvez ajouter une virgule et un éventuel chemin vers une image pour l'utiliser en tant qu’icône. Vous trouverez alors votre nouveau type dans la boîte de dialogue de création de nœuds ou de ressources.
it: Puoi nominare uno script e registrarlo come un tipo nell'editor con la parola chiave ``class_name`` seguita dal nome della classe. Puoi aggiungere una virgola ed opzionalmente un percorso ad un'immagine da usare come icona. Potrai ora trovare il tuo nuovo tipo nella finestra di creazione di nodi o risorse.
ja: ``class_name``キーワードの後にクラスの名前を付けた後に、スクリプトに名前を付け、エディターにタイプとして登録できます。カンマを追加した後にアイコンとして使用する画像のパスを追加できます。これで、ノードまたはリソース作成ダイアログで新しいタイプを見つける事ができます。
ko: 스크립트에 이름을 짓고 클래스의 이름을 뜻하는 ``class_name`` 키워드로 스크립트를 유형으로 등록할 수 있습니다. 쉼표와 이미지로 향하는 경로를 선택적으로 추가하면 아이콘으로도 사용할 수 있습니다. 그런 다음 노드(Node)나 리소스(Resource) 만들기 대화 상자에서 당신의 새 유형을 찾을 수 있습니다.
pt_br: Você pode nomear um script e o registrar como um tipo no editor com a palavra chave ``class_name`` seguido pelo nome da classe. Você pode adicionar uma vírgula e um caminho opcional a uma imagem para usar como ícone. Então, você encontrará seu novo tipo na janela de criação de Nodes e recursos.
ru: Вы можете назвать скрипт и зарегистрировать его как тип в редакторе с ключевым словом "class_name", в котором нужно указать имя класса. Также, через запятую вы можете указать путь к иконке. Затем вы найдете свой новый тип в диалоговом окне создание узла или ресурса.
zh_cn: 您可以命名脚本，并在编辑器中使用 ``class_name`` 关键字并后跟类名将其注册为类型。您可以添加逗号和可选的图像路径以用作图标。然后，您将在节点或资源创建对话框中找到您的新类型。
zh_tw: 但我們可以為一個腳本起名字，就可以將腳本註冊成編輯器裡的型別，只需要寫上 ``class_name`` 關鍵字，並在後方接上類別名稱。也可以選擇在名稱後接上逗號與圖片路徑來設定圖片。接著在建立節點或資源的對話框中就可以找到這個新型別。

source: In Godot 3.1:
cs: V Godotu 3.1:
es: En Godot 3.1:
fi: Godot 3.1 versiossa:
fr: Dans Godot v3.11 :
ja: Godot 3.1の場合:
ko: Godot 3.1에서는:
pl: W Godot 3.1:
pt_br: Em Godot 3.1:
ru: В Godot 3.1:
zh_cn: 在Godot 3.1中：
zh_tw: 在 Godot 3.1 中：

source: Only GDScript and NativeScript, i.e., C++ and other GDNative-powered languages, can register scripts.
cs: Skripty mohou registrovat pouze GDScript a NativeScript, tj. C ++ a další jazyky podporované GDNative.
de: Nur GDScript und Sprachen die NativeScript-fähig sind(z.B. C++) können Skripte registrieren.
es: Únicamente GDScript o NativeScript, en otras palabras, C++ y otros lenguajes basandos en GDNative, pueden registrar scripts.
fi: Vain GDScript ja NativeScript, eli C++ ja muut GDNative-käyttöiset kielet, voivat rekisteröidä skriptejä.
fr: Seuls GDScript et NativeScript, c'est-à-dire C ++ et d'autres langages liés par GDNative, peuvent enregistrer des scripts.
it: Solo GDScript e NativeScript, cioè, C++ e altri linguaggi ramificati da GDNative, possono registrare gli script.
ja: スクリプトを登録できるのは、GDScriptおよびNativeScript、つまりC++およびその他のGDNativeを使用した言語のみです。
ko: 오직 GDScript와 NativeScript만 가능합니다. 즉, C++와 다른 GDNative의 영향을 받는 언어만 스크립트를 등록할 수 있습니다.
pl: Tylko GDScript i NativeScript, tj. C++ i inne języki wspierane przez GDNative, mogą rejestrować skrypty.
pt_br: Apenas GDScript e NativeScript (ex: C++) e outras linguagens baseadas em GDNative, podem registrar scripts.
ru: Только при помощи GDScript и NativeScript (C++ и другие) могут зарегистрировать такие скрипты.
zh_cn: 只有GDScript和NativeScript，即C ++和其他GDNative支持的语言，可以注册脚本。
zh_tw: 只有 GDScript 與 NativeScript 如 C++ 等使用 GDNative 的語言可以註冊腳本。

source: Only GDScript creates global variables for each named script.
cs: Pouze GDScript vytváří globální proměnné pro každý pojmenovaný skript.
de: Ausschließlich GDScript erstellt globale Variablen für jedes benannte Skript.
es: Únicamente GDScript crea variables globales para cada script nombrado.
fi: Vain GDScript luo globaaleja muuttujia kullekin nimetylle skriptille.
fr: Seul GDScript crée des variables globales pour chaque script nommé.
it: Solo GDScript crea variabili globali per ogni script nominato.
ja: GDScriptのみが、名前付きスクリプトごとにグローバル変数を作成します。
ko: 오직 GDScript만 각 이름이 있는 스크립트에 전역 변수를 만듭니다.
pl: Tylko GDScript tworzy globalne zmienne dla każdego nazwanego skryptu.
pt_br: Apenas GDScript pode criar variáveis globais para cada script nomeado.
ru: Только GDScript создает глобальные переменные для каждого именованного скрипта.
zh_cn: 只有GDScript为每个命名脚本创建全局变量。
zh_tw: 只有 GDScript 才會為每個已命名的腳本建立全域變數。

source: To help manage this variability the ``delta`` parameter contains the time elapsed in seconds, as a floating point, since the previous call to ``_process()``.
it: Per aiutare a gestire questa variabilità, il parametro ``delta`` contiene il tempo passato in secondi, come floating point, dalla precedente chiamata di ``_process()``.
ja: この変動を管理しやすくするために、``delta``パラメーターには、``_process()``の前回の呼び出し以降の経過秒数が浮動小数点として含まれています。
pl: Parametr delta to liczba zmiennoprzecinkowa, zawierająca czas w sekundach, jaki upłynął od poprzedniego wywołania ``_process()``.
pt_br: Para ajudar a gerenciar essa variabilidade o parâmetro ``delta`` contém o tempo decorrido em segundos, sendo um número decimal, desde a chamada anterior de ``_process()``.
zh_cn: 为了帮助管理这种可变性，``delta`` 参数包含自上次调用 ``_process()`` 以来经过的以秒为单位的时间，以浮点数表示。

source: For example, movement is often multiplied with a time delta to make movement speed both constant and independent from the frame rate.
es: Por ejemplo, el movimiento a menudo se multiplica por un tiempo delta para que la velocidad de movimiento sea constante e independiente de la velocidad de fotogramas.
it: Per esempio, i movimenti sono spesso moltiplicati al tempo DELTA per rendere la velocità di movimento sia costante che indipendente dal frame rate.
ja: たとえば、移動速度を一定にし、フレームレートから独立させるために、移動が時間デルタで乗算されることがよくあります。
pl: Na przykład, ruch jest często mnożony przez czas od ostatniej klatki, aby prędkość ruchu była stała i niezależna od częstotliwości odświeżania.
pt_br: Por exemplo, é frequente multiplicar o movimento pelo delta para tornar a velocidade de movimento constante independente da taxa de quadros.
zh_cn: 例如，运动经常与时间增量相乘，以使运动速度既恒定又独立于帧速率。

source: The documentation of each class in the :ref:`Class Reference <toc-class-ref>` shows the notifications it can receive. However, in most cases GDScript provides simpler overrideable functions.
es: La documentación de cada clase en la :ref:`Referencia de Clases <toc-class-ref>` muestra las notificaciones que puedes recibir. Sin embargo, en la mayoría de los casos, GDScript proporciona funciones anulables más simples.
it: La documentazione di ogni classe presente in :ref:`Class Reference <toc-class-ref>` mostra le notifiche che possono ricevere. Però, in molti casi GDScript fornisce funzioni più semplici e ignorabili.
ja: :ref:`Class Reference<toc-class-ref>`\ の各クラスのドキュメントには、受信可能な通知が記載されています。しかし、ほとんどの場合、GDScriptはより単純なオーバーライド可能な関数を提供します。
pl: Dokumentacja każdej klasy w :ref:`Class Reference <toclass-ref>` pokazuje powiadomienia, które może otrzymać. Jednak w większości przypadków GDScript zapewnia prostsze, możliwe do nadpisania funkcje.

source: Overrideable functions
es: Funciones anulables
it: Funzioni sovrascrivibili
ja: オーバーライド可能な関数
pl: Funkcje możliwe do nadpisania

source: Such overrideable functions, which are described as follows, can be applied to nodes:
es: Estas funciones, que se describen a continuación, se pueden aplicar a los nodos:
it: Tali funzioni sovrascrivibili, le quali sono descritte di seguito, possono essere applicate ai nodi:
ja: このようなオーバーライド可能な関数は、下記のような記述でノードに適用できます:
pl: Takie możliwe do nadpisania funkcje, opisane poniżej, mogą być stosowane do węzłów:

source: This method will be called every time a frame is drawn, so it's fully dependent on how many frames per second (FPS) the application is running at:
es: Este método se llamará cada vez que se dibuje un cuadro, por lo que depende totalmente del número de cuadros por segundo (FPS) en los que se esté ejecutando la aplicación:

source: The delta parameter contains the time elapsed in seconds, as a floating point, since the previous call to ``_process()``.
es: El parámetro delta contiene el tiempo transcurrido en segundos, como punto flotante, desde la llamada anterior a ``_process()``.

source: A simple way to test this is to create a scene with a single Label node, with the following script:
es: Una forma sencilla de comprobar esto es crear una escena con un único nodo Label, con el siguiente script:

source: Nodes can be added to groups, as many as desired per node, and is a useful feature for organizing large scenes. There are two ways to do this. The first is from the UI, from the Groups button under the Node panel:
es: Los nodos se pueden añadir a los grupos, tantos como se desee por nodo, y es una función útil para organizar escenas de gran tamaño. Hay dos maneras de hacerlo. La primera es desde la UI, desde el botón Grupos bajo el panel Nodos:

source: And the second way is from code. One example would be to tag nodes which are enemies:
es: Y la segunda forma es por código. Un ejemplo sería etiquetar nodos que representan a los enemigos ('enemies'):

source: The :ref:`SceneTree <class_SceneTree>` class provides many useful methods, like interacting with scenes, their node hierarchy and groups of nodes. It allows you to easily switch scenes or reload them, to quit the game or pause and unpause it. It even comes with interesting signals. So check it out if you got some time!
es: La clase :ref:`SceneTree <class_SceneTree>` proporciona muchos métodos útiles, como la interacción con escenas, su jerarquía de nodos y grupos de nodos. Te permite cambiar escenas o recargarlas fácilmente, salir del juego o pausar y despausar el juego. Incluso viene con señales interesantes ¡Así que échale un vistazo si tienes tiempo!

source: When a node is freed, it also frees all its children nodes. Because of this, manually deleting nodes is much simpler than it appears. Free the base node and everything else in the subtree goes away with it.
es: Cuando un nodo se libera, también libera todos sus nodos hijos. Debido a esto, el borrado manual de nodos es mucho más sencillo de lo que parece. Libera el nodo base y todo lo demás en el subárbol desaparecerá con él.
