Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_continued.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, zh_cn, zh_tw

source: Groups in Godot work like tags you might have come across in other software. A node can be added to as many groups as desired. This is a useful feature for organizing large scenes. There are two ways to add nodes to groups. The first is from the UI, using the Groups button under the Node panel:
cs: Skupiny v Godotu pracují jako štítky(tagy), s nimiž jste se mohli setkat v jiném softwaru. Uzel lze přidat do libovolného počtu skupin. Toto je užitečná vlastnost pro organizování velkých scén. Existují dva způsoby, jak přidat uzly do skupin. První je pomocí uživatelského rozhraní pomocí tlačítka Skupiny na panelu Uzel:
de: Gruppen in Godot funktionieren wie Tags, auf die Sie in anderen Softwares gestoßen sein könnten. Ein Node kann beliebig vielen Gruppen hinzugefügt werden. Dies ist eine nützliche Funktion zum Organisieren großer Szenen. Es gibt zwei Möglichkeiten, Nodes zu Gruppen hinzuzufügen. Die erste ist über die Benutzeroberfläche über den Gruppenknopf unter dem Node-Panel:
fi: Ryhmät Godotissa toimivat kuin tägit joihin olet voinut törmätä muissa ohjelmistoissa. Solmu voidaan lisätä niin moneen ryhmään kuin halutaan. Tämä on hyödyllinen ominaisuus laajojen skenejen järjestelemiseksi. On kaksi tapaa lisätä solmu ryhmään. Ensimmäinen on käyttöliittymästä, Ryhmät-painikkeesta Solmu-paneelilla:
fr: Les groupes dans Godot fonctionnent comme les étiquettes que vous pouvez trouver dans d'autres logiciels. Un nœud peut appartenir a plusieurs groupes. Pour organiser de grosses scènes il peut être utile de grouper les nœuds. Il y a deux façons de grouper des nœuds, la première en utilisant le bouton Groupes sous le panneau Nœud via l'interface utilisateur :
ja: Godotのグループは、他のソフトウェアのタグのように機能します。ノードは、必要な数だけグループに追加できます。これは、大きなシーンを整理するのに便利な機能です。グループにノードを追加するには2つの方法があります。 1つ目は、[ノード]パネルの下の[グループ]ボタンを使用したUIからです。
ko: Godot에서 그룹은 다른 소프트웨어에서 접했을 법한태그와 비슷합니다. 노드는 많은 그룹에 원하는 만큼 추가될 수 있습니다. 이는 거대한 씬을 조직하는데 유용한 기능입니다. 노드를 그룹에 추가하는 두 가지 방법이 있습니다. 먼저 첫 번째는 UI에서 하는 것입니다. 노드(Node) 패널 하단의 그룹(Groups) 버튼을 사용합니다:
pt_br: Grupos no Godot funcionam como tags que você pode encontrar em outros softwares. 'Nós', podem ser adicionados a grupos, a quantidade que desejar por nó, e isso é uma funcionalidade útil para organizar cenas grandes. Há duas formas de fazer isso. A primeira é pela interface gráfica, a partir do botão Grupos dentro do painel Nó:
ru: Группы в Godot работают как теги, с которыми вы могли столкнуться в других программах. Узел может быть добавлен в любое количество групп по желанию. Это полезная функция для организации больших сцен. Существует два способа добавления узлов в группы. Первый - из пользовательского интерфейса, с помощью кнопки Группы под панелью Узел(Node):
zh_cn: Godot中的编组的工作方式类似于您可能在其他软件中遇到的标记。一个节点可以根据需要添加到任意多个编组。这是组织大型场景的一个有用特性。有两种方法可以向编组中添加节点。第一个是从UI，使用 ``节点`` 面板下的 ``Groups`` 按钮：
zh_tw: Godot 中的群組就類似其他軟體中的標籤 (Tag)。一個節點可以被新增到多個群組裡面。群組功能對於管理大型場景很實用。把節點新增進群組有兩種方法。第一種方法是通過圖形界面，使用節點面板中的 [群組] 按鈕：

source: And the second way is from code. The following script would add the current node to the ``enemies`` group as soon as it appeared in the scene tree.
cs: A druhý způsob je pomocí kódu. Následující skript by přidal aktuální uzel do skupiny `` nepřátelé ', jakmile se objeví ve stromu scény.
de: Die zweite Möglichkeit erfolgt via Code. Das folgende Script fügt die aktuelle Node zur Gruppe "enemies" wenn sie im Scenetree erstellt wurden.
fi: Toinen tapa on koodista käsin. Seuraava skripti lisää nykyisen solmun ``enemies`` ryhmään heti kun se ilmestyy skenepuuhun.
fr: Et le second moyen est à partir du code. Le script suivant ajouterait le nœud actuel au groupe ``enemies`` dès qu'il apparaît dans l'arborescence.
it: ed il secondo modo è dal codice. Il seguente Script voule aggiungere al nodo corrente appartenente al gruppo "enemies" non appena esso appare nell'altero della scena.
ja: 2番目の方法はコードからです。次のスクリプトは、シーンツリーに表示されるとすぐに現在のノードを``enemies``グループに追加します。
ko: 두 번째 방법은 코드에서 하는 것입니다. 다음 스크립트는 현재 노드가 씬 트리에 나타나면 ``enemies``\ 라는 그룹에 노드가 추가되는 스크립트입니다.
pl: A drugą z poziomu kodu. Skrypt poniżej dodałby aktualny węzeł do grupy ``enemies``, gdy tylko pojawi się w drzewie sceny.
pt_br: E a segunda maneira é por código. O sequinte script adicionará o nó atual ao grupo ``enemies`` assim que aparecesse na árvore de cena.
ru: И второй способ сделать это с помощью кода. Следующий скрипт добавит текущий Узел к группе ``enemies`` как только она появится в дереве сцены.
zh_cn: 第二种方法是从代码。下面的脚本会在当前节点出现在场景树中后立即将其添加到 ``enemies`` 编组中。
zh_tw: 第二種方法則是使用程式碼。下面這個腳本會在目前節點一進入場景樹後立刻把它新增到 ``enemies`` (敵人) 群組中。

source: This way, if the player is discovered sneaking into a secret base, all enemies can be notified about its alarm sounding by using :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>`:
cs: Například, pokud je hráč objeven, jak se plíží do tajné základny, všichni nepřátelé mohou být najednou upozorněni na jeho přítomnost pomocí: ref: `SceneTree.call_group () <class_SceneTree_method_call_group>`:
de: Wird der Spieler dabei entdeckt, wie er sich in eine Geheimbasis schleicht, können alle Gegner über einen Alarmton informiert werden indem :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>` benutzt wird:
es: De esta manera, si se descubre al jugador entrando a escondidas en una base secreta, se puede avisar a todos los enemigos de que está sonando la alarma usando :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>`:
fi: Tällä tapaa, jos pelaaja jää kiinni hiipiessään salaiseen tukikohtaan, kaikille vihollisille voidaan antaa tieto hälytyksen soimisesta käyttämällä :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>` funktiota:
fr: De cette façon, si le joueur est découvert en s'infiltrant dans une base secrète, tous les ennemis peuvent être avertis de l'alarme qu'il déclenche en utilisant :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>` :
it: In questa maniera, se il giocatore è scoperto ad entrare furtivamente all'interno di una base nemica, tutti i nemici possono essere notificati del suono dell'allarme usando :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>`:
ja: このようにして、プレイヤーが秘密の基地に忍び込んでいることが発見された場合、 :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>`\ を使用して、すべての敵にアラーム音を通知する事が出来ます:
ko: 이렇게 하면 플레이어가 비밀 기지에 몰래 들어간 것이 발각될 경우, :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>`\ 을 사용하여 모든 적이 경보가 울린다는 사실을 인지할 수 있습니다:
pl: W ten sposób, jeśli gracz zostanie wykryty podczas skradania się do tajnej bazy, wszyscy wrogowie zostaną powiadomieni za pomocą :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>`:
pt_br: Desta maneira, se o jogador é descoberto se esgueirando pela base secreta, todos os inimigos podem ser notificados por alarme sonoro usando :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>`:
ru: Таким образом, если игрок обнаружен крадущимся на секретной базе, все враги могут быть уведомлены об этом звуковым сигналом тревоги с помощью функции :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>`:
zh_cn: 这样，如果发现玩家潜入秘密基地，则可以使用 :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>` 发出警报声来通知所有敌人：
zh_tw: 這樣一來，一旦玩家潛入祕密基地被發現，就能通過 :ref:`SceneTree.call_group() <class_SceneTree_method_call_group>` 來讓所有敵人聽到警報聲：

source: The above code calls the function ``player_was_discovered`` on every member of the group ``enemies``.
cs: Výše uvedený kód volá funkci "player_was_discovered" pro každého člena skupiny ''nepřátelé''.
de: Der Code oben ruft die Funktion ``player_was_discovered`` bei jedem Mitglied der Gruppe ``enemies`` auf.
es: El código anterior llama a la función ``player_was_discovered`` en cada miembro del grupo ``enemies``.
fi: Yllä oleva koodi kutsuu ``player_was_discovered`` funktiota ``enemies`` ryhmän jokaiselle jäsenelle.
fr: Le code ci-dessus appelle la fonction ``player_was_discovered`` sur chaque membre du groupe ``enemies``.
it: Il codice qua sopra chiama la funzione ``player_was_discovered`` su ogni membro del gruppo ``enemies``.
ja: 上記のコードはグループ `` enemies`` のすべてのメンバーに対して関数 `` player_was_discovered``を呼び出します。
ko: 위의 코드는 그룹 ``enemies``\ 의 모든 구성원이``player_was_discovered`` 함수를 호출합니다.
pl: Powyższy kod wywołuje funkcję ``wykryto_gracza``(player_was_discovered) w kodzie każdego członka grupy ``przeciwnicy``(enemies).
pt_br: O código acima chama a função ``player_was_discovered`` ("jogador_foi_descoberto") de cada membro do grupo `enemies`` ("inimigos").
ru: Вышеупомянутый код вызывает функцию ``player_was_discovered`` для каждого члена группы ``enemies``.
zh_cn: 上面的代码在 ``enemies`` 编组的每个成员上调用函数 ``player_was_discovered``。
zh_tw: 上面的程式碼會呼叫群組 ``enemies`` 裡所有成員的 ``player_was_discovered`` 方法。

source: It is also possible to get the full list of ``enemies`` nodes by calling :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`:
cs: Je také možné získat úplný seznam uzlů `` nepřátel 'voláním: ref: `SceneTree.get_nodes_in_group () <class_SceneTree_method_get_nodes_in_group>`:
de: Es ist auch möglich, die vollständige Liste der ``Feinde``-Nodes durch Aufrufen von :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>` zu erhalten:
es: También es posible obtener la lista completa de nodos ``enemies`` llamando a :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`:
fi: On myös mahdollista saada kokonainen lista ``enemies`` solmuista kutsumalla :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>` funktiota:
fr: Il est également possible d'obtenir la liste complète des nœuds ``enemies`` en appelant :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>` :
it: È anche possibile acquisire la lista completa di nodi ``enemies`` chiamando :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`:
ja: また:ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`\ を呼び出して、敵のノードの完全なリストを取得することもできます:
ko: 또한 :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`\ 을 호출하여 ``enemies`` 노드의 전체 목록을 가져올 수도 있습니다:
pl: Możliwe jest również uzyskanie pełnej listy węzłów z grupy ``wrogowie`` przez wywołanie :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`:
pt_br: É também possível conseguir a lista completa de nós ``inimigos`` chamando :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`:
ru: Также можно получить полный список узлов ``enemies``, вызвав функцию :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`:
zh_cn: 也可以通过调用 :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>` 获得 ``enemies`` 节点的完整列表：
zh_tw: 另外，也可以通過呼叫 :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>` 來取得所有 ``enemies`` 群組下的節點：

source: The :ref:`SceneTree <class_SceneTree>` class provides many useful methods, like interacting with scenes, their node hierarchy and groups of nodes. It allows you to easily switch scenes or reload them, to quit the game or pause and unpause it. It even comes with interesting signals. So check it out if you have some time!
cs: Třída: ref: `SceneTree <class_SceneTree>` poskytuje mnoho užitečných metod pro například interakci se scénami, jejich hierarchii uzlů a skupinami uzlů. To vám umožní snadno přepínat nebo znovu načíst scény, ukončit nebo pozastavit či zrušit pozastavení hry. Dodává se dokonce se zajímavými signály. Takže se podívejte do dokumentace, jestli máte truchu času!
de: Die :ref:`SceneTree <class_SceneTree>` -Klasse stellt viele nützliche Methoden bereit, z.B. die Interaktion mit Szenen, deren Node-Hierarchie und Node-Gruppen. Sie können Szenen einfach wechseln oder neu laden, das Spiel beenden, pausieren und fortsetzen. Sie kommt sogar mit interessanten Signalen. Also schauen Sie sich dies an wenn Sie Zeit haben!
fi: :ref:`SceneTree <class_SceneTree>` luokka tarjoaa monia hyödyllisiä metodeja, kuten skenejen, niiden solmuhierarkian ja solmuryhmien käsittelyä. Se sallii sinun vaihtaa tai uudelleenladata skenejä helposti, ja lopettaa, keskeyttää tai palauttaa pelin ajamisen. Sen mukana tulee myös mielenkiintoisia signaaleja. Joten vilkaise sitä, jos sinulla on aikaa!
fr: La classe :ref:`SceneTree <class_SceneTree>` fournit de nombreuses méthodes utiles, comme l'interaction avec les scènes, leur hiérarchie de nœuds et leur groupes de nœuds. Elle vous permet de changer facilement de scènes ou de les recharger, de quitter le jeu ou de le mettre en pause, de mettre fin à la pause. Elle contient même des signaux intéressants. Alors allez voir si vous avez le temps !
it: La classe :ref:`SceneTree <class_SceneTree>` fornisce molte funzioni utili, come l'integrazione con le scene, la gerarchia dei loro nodi ed anche un gruppo di nodi. Essa permette di spostare facilmente le scene, oppure di ricaricarle, o anche di chiudere il gioco, metterlo in pausa o rimuoverlo dalla pausa. Può anche venire usato con segnali di interesse. Quindi, se hai tempo, prova a dargli una occhiata!
ja: :ref:`SceneTree <class_SceneTree>`\ クラスは、シーン、ノードの階層、ノードのグループとの対話など、多くの便利なメソッドを提供します。シーンを簡単に切り替えたり、リロードしたり、ゲームを終了したり、一時停止したり、一時停止を解除したりできます。興味深いシグナルもあります。時間があればぜひご覧ください！
ko: :ref:`SceneTree <class_SceneTree>` 클래스는 씬끼리, 노드 계층끼리, 그리고 노드의 그룹끼리 상호작용하는 많은 유용한 메서드를 제공합니다. 이것으로 쉽게 씬을 바꾸거나 다시 불러올 수 있고, 게임을 끄거나 일시정지를 켜고 끄는 행위를 할 수 있습니다. 심지어 흥미로운 시그널도 함께 제공됩니다. 시간이 된다면 한번 확인해보세요!
pl: Klasa :ref:`SceneTree <class_SceneTree>` dostarcza wielu przydatnych metod, takich jak interakcja ze scenami, ich hierarchią i grupami węzłów. Pozwala w łatwy sposób przełączać sceny, przeładowywać je, kończyć grę lub spauzować i odpauzować ją. Sprawdź to, jeśli masz trochę czasu!
pt_br: A classe :ref:`SceneTree <class_SceneTree>` fornece muitos métodos úteis, como interagir com cenas, suas hierarquias e grupos de nós. Ela lhe permite facilmente trocar ou recarregar cenas, sair do jogo ou pausa-lo ou retomá-lo. Ela até vem com sinais interessantes. Então dê uma olhada nela se tiver um tempo!
ru: Класс :ref:`SceneTree <class_SceneTree>` предоставляет множество полезных методов, таких как взаимодействие со сценами, иерархия узлов и групп узлов. Он позволяет вам легко переключать сцены или перезагружать их, выходить из игры или делать паузу и продолжать далее. У него также есть интересные сигналы. Ознакомьтесь с ним, когда будет время!
zh_cn: :ref:`SceneTree <class_SceneTree>` 类提供了许多有用的方法，例如与场景、其节点层次结构、及节点编组交互。它使您可以轻松切换场景或重新加载场景，退出游戏或暂停和取消暂停游戏。它还有一些有趣的信号，如果您有空可以详细去查看！
zh_tw: :ref:`SceneTree <class_SceneTree>` 類別還提供了很多實用的方法，例如與場景、節點架構、群組等互動。也可以使用 SceneTree 來輕鬆切換場景、重新載入場景、結束遊戲、暫停以及取消暫停。SceneTree 甚至有一些很有趣的訊號。有空的話記得去看看 SceneTree 的手冊！

source: Notifications
cs: Oznámení
de: Benachrichtigungen
es: Notificaciones
fi: Ilmoitukset (notifications)
it: Notifiche
ja: 通知
ko: 알림(Notification)
pl: Powiadomienia
pt_br: Notificações
ru: Уведомления
zh_cn: 通知
zh_tw: 通知

source: Godot has a system of notifications. These are usually not needed for scripting, as it's too low-level and virtual functions are provided for most of them. It's just good to know they exist. For example, you may add an :ref:`Object._notification() <class_Object_method__notification>` function in your script:
cs: Godot má systém oznámení. Obvykle nejsou pro skriptování zapotřebí, protože jsou příliš zanořeny do systému a pro většinu z nich jsou k dispozici virtuální funkce. Je prostě dobré vědět, že existují. Například můžete do skriptu přidat funkci: ref: `Object._notification () <class_Object_method__notification>`:
de: Godot verfügt über ein Benachrichtigungssystem. Diese wird in der Regel nicht für das Schreiben von Skipten benötigt, da auf einem niedrigen Niveau ist und für die meisten Funktionen virtuelle Funktionen zur Verfügung stehen. Trotzdem ist es gut zu wissen, dass dieses Benachrichtigungssystem existiert. Sie können beispielsweise die Funktion :ref:`Object._notification() <class_Object_method__notification>` in Ihrem Skript einfügen:
es: Godot tiene un sistema de notificaciones. Por lo general, no son necesarios para la creación de scripts, ya que es de muy bajo nivel y se proporcionan funciones virtuales para la mayoría de estas. Pero es bueno saber que existen. Por ejemplo, puedes añadir una función :ref:`Object._notification() <class_Object_method__notification>` en tu script:
fi: Godotissa on järjestelmä ilmoituksille. Niitä ei yleensä tarvita skriptauksessa, koska ne ovat liian alhaisen tason koodia ja useimmille on tarjolla vastaava virtuaalifunktio. On silti hyvä olla tietoinen niiden olemassaolosta. Voit esimerkiksi lisätä :ref:`Object._notification() <class_Object_method__notification>` funktion skriptiisi:
fr: Godot possède un système de notifications. Celles-ci ne sont généralement pas nécessaires pour le scripting, car elles sont de trop bas niveau et des fonctions virtuelles sont fournies pour la plupart d'entre elles. C'est cependant bien de savoir qu'elles existent. Par exemple, vous pouvez ajouter une fonction :ref:`Object._notification() <class_Object_method__notification>` dans votre script :
it: Godot ha un suo sistema di notifiche. Solitamente non sono necessarie per lo scripting, siccome è a basso livello e vengono fornite le funzioni virtuali. È comunque buono sapere che esistono. Per esempio, tu potresti aggiungere la funzione :ref:`Object._notification() <class_Object_method__notification>` al tuo script:
ja: Godotには通知システムがあります。これらは低レベルであり、それらのほとんどに仮想k関数が提供されているため、通常はスクリプトには必要ありません。それらが存在することを知っていれば良いのです。例えば、スクリプトに :ref:`Object._notification() <class_Object_method__notification>` \ 関数を追加できます:
ko: Godot에는 알림 시스템이 있습니다. 보통은 스크립팅에 쓰이지 않습니다. 너무 로우 레벨이며 대부분은 가상 함수에서 제공하기 때문이죠. 그냥 존재한다는 것 만으로도 좋은 일입니다. 예를 들어 스크립트에 :ref:`Object._notification() <class_Object_method__notification>` 함수를 추가할 수 있습니다:
pt_br: O Godot tem um sistema de notificações. Elas não costumam ser necessárias para roteirizar, já que são programação de baixo nível e se provê funções virtuais para a maioria delas. Mas é bom saber que elas existem. Por exemplo, você pode adicionar uma função :ref:`Object._notification() <class_Object_method__notification>` ao seu roteiro:
ru: Godot имеет систему уведомлений. Они, как правило, не нужны для сценариев, так как они слишком низкоуровневые и для большинства из них есть виртуальные функции. Просто приятно знать, что они существуют. Например, можно добавить :ref:`Object._notification() <class_Object_method__notification>` в вашем сценарии:
zh_cn: Godot 有一个通知系统。这个是非常底层的虚函数，通常不需要放入脚本代码里。只需要知道有这个系统的存在。例如，您可以在您的脚本里添加 :ref:`Object._notification() <class_Object_method__notification>` 函数：
zh_tw: Godot 中有通知系統。雖然因為這個功能太底層，而且通知的大部分功能都可以在虛擬函式中找到，所以這個功能通常在編寫腳本時用不到。但知道有通知這東西還是好處的。例如，可以為腳本新增一個 :ref:`Object._notification() <class_Object_method__notification>` 函式：

source: The documentation of each class in the :ref:`Class Reference <toc-class-ref>` shows the notifications it can receive. However, in most cases GDScript provides simpler overridable functions.
cs: Dokumentace každé třídy v: ref: `Class Reference <toc-class-ref>` zobrazuje oznámení, která může třída přijímat. Ve většině případů však GDScript poskytuje jednodušší přetěžovatelné funkce.
de: Die Dokumentation jeder Klasse in der :ref:`Class Reference <toc-class-ref>` zeigt die Benachrichtigungen an, die sie erhalten kann. In den meisten Fällen bietet GDScript jedoch einfachere überschreibbare Funktionen.
fr: La documentation de chaque classe dans la :ref:`Class Reference <toc-class-ref>` montre les notifications qu'elle peut recevoir. Cependant, dans la plupart des cas, GDScript fournit des fonctions de surchargeable plus simples.
ko: :ref:`Class Reference <toc-class-ref>`\ 에서 각 클래스의 문서에서는 받을 수 있는 알림을 보여줍니다. 하지만 대부분의 경우, GDScript에서 다시 정의하는 것을 더 간단하게 할 수 있는 함수를 제공합니다.
ru: В документации каждого класса в :ref:`Class Reference <toc-class-ref>` описаны уведомления, которые он может получить. Однако в большинстве случаев GDScript предоставляет более простые переопределяемые функции.
zh_tw: :ref:`類別參考手冊 <toc-class-ref>` 中有寫出各個類別能接收什麼通知。然而，大部分情況下 GDScript 都提供了更簡單的可複寫函式。

source: Overridable functions
cs: Přetěžovatelné (overridable) funkce
de: Überschreibbare Funktionen
fr: Fonctions surchargeables
ko: 다시 정의할 수 있는 함수
ru: Переопределяемые функции
zh_tw: 可複寫函式

source: Such overridable functions, which are described as follows, can be applied to nodes:
cs: Takové přetěžovatelné funkce, které může uzel využívat, jsou popsány dále:
de: Solche überschreibbaren Funktionen, welche im Folgenden beschrieben werden, können auf Nodes angewendet werden:
fr: De telles fonctions surchargeables, décrites comme suit, peuvent être appliquées aux nœuds :
ko: 아래에서 설명하는 다시 정의할 수 있는 함수는 노드에 적용할 수 있습니다:
ru: Такие переопределяемые функции, которые описываются ниже, могут быть применены к узлам:
zh_tw: 下列可複寫函式可用於節點：

source: As mentioned before, it's better to use these functions instead of the notification system.
cs: Jak již bylo zmíněno dříve, je lepší použít tyto funkce místo oznamovacího systému.
de: Wie bereits erwähnt ist es besser, diese Funktionen anstatt des Benachrichtigungssystems zu verwenden.
es: Como se mencionó anteriormente, es mejor utilizar estas funciones que el sistema de notificación.
fi: Kuten mainittu aikaisemmin, on parempi käyttää näitä funktioita ilmoitusjärjestelmän sijaan.
fr: Comme mentionné précédemment, il est préférable d'utiliser ces fonctions plutôt que le système de notification.
it: Come menzionato precedentemente, è meglio usare queste funzioni anziché il sistema di notifiche.
ja: 前述したように、通知システムの代わりにこれらの機能を使用することをお勧めします。
ko: 앞서 언급했듯이, 이러한 함수는 알림 시스템 대신 사용하는 것이 좋습니다.
pl: Jak wspomniano wcześniej, lepiej jest używać tych funkcji zamiast systemu powiadomień.
pt_br: Como já mencionado, é melhor usar essas funções ao invés do sistema de notificações.
ru: Как упоминалось ранее, лучше использовать эти функции вместо системы уведомлений.
zh_cn: 如前所述，最好使用这些函数代替通知系统。
zh_tw: 如同稍早提到的，建議使用這些函式來代替通知系統。

source: Creating nodes
cs: Vytváření uzlů
de: Nodes erstellen
es: Creación de nodos
fi: Solmujen luonti
fr: Création de nœuds
it: Creare nodi
ja: ノード作成
ko: 노드 만들기
pl: Tworzenie węzłów
pt_br: Criando nós
ru: Создание узлов
zh_cn: 创建节点
zh_tw: 建立節點

source: To create a node from code, call the ``.new()`` method, like for any other class-based datatype. For example:
cs: Chcete-li vytvořit uzel v kódu, volejte metodu `` .new () ``, tak jako pro jakýkoli jiný datový typ třídy. Například:
de: Um einen Node im Code zu erstellen, rufe die Methode ``.new()`` auf, genau wie für jeden anderen klassenbasierten Datentyp auch. Zum Beispiel:
es: Para crear un nodo desde código, se debe llamar al método ``.new()``, como en cualquier otro tipo de dato basado en una clase. Por ejemplo:
fi: Luodaksesi uuden solmun koodissa, kutsu ``.new()`` metodia, kuten minkä tahansa luokkapohjaisen tietotyypin tapauksessa. Esimerkiksi:
fr: Pour créer un nœud à partir du code, appelez la méthode ``.new()``, comme pour tout autre type de données de classe. Par exemple :
it: Per creare un nodo nel codice, usare il metodo ``.new()``, come per ogni altro class-based datatype. Per esempio:
ja: コードからノードを作成するには、他のクラスベースのデータ型と同様に、``.new()``メソッドを呼び出します。例えば:
ko: 다른 클래스 기반 데이터 유형과 마찬가지로, 코드로 노드를 만들려면 ``.new()`` 메서드를 호출해야 합니다. 예를 들어:
pl: Aby utworzyć węzeł w kodzie, należy wywołać metodę ``.new()``, tak jak w przypadku każdego innego zbioru danych opartego na klasie. Na przykład:
pt_br: Para criar um nó a partir do código, chame o método ``.new()``, assim como faria para qualquer tipo de dado baseado em classe. Por exemplo:
ru: Чтобы создать узел из кода вызовите метод ``.new()`` как и для любого другого типа данных на основе классов. Например:
zh_cn: 要通过代码创建节点，请像其他任何基于类的数据类型一样，调用 ``.new()`` 方法。 例如：
zh_tw: 與其他以類別為基礎的資料型別一樣，可以呼叫 ``.new()`` 方法來用程式碼建立節點。例如：
