Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_languages.po
Languages: pt_br

source: This lesson will give you an overview of the available scripting languages in Godot. You will learn the pros and cons of each option. In the next part, you will write your first script using GDScript.
pt_br: Esta lição lhe dará uma visão geral das linguagens de scripting disponíveis no Godot. VocÊ vai aprender os prós e os contras de cada opção. Na parte seguinte, você irá escrever o seu primeiro script utilizando GDScript.

source: **Scripts attach to a node and extend its behavior**. This means that scripts inherit all functions and properties of the node they attach to.
pt_br: **Os scripts anexam-se a um nó e estendem o seu comportamento**. Isto significa que os scripts herdam todas as funções e propriedades do nó a que se anexam.

source: You can use multiple languages in a single project. For instance, in a team, you could code gameplay logic in GDScript as it's fast to write, let level designers script quests in the graphical language VisualScript, and use C# or C++ to implement complex algorithms and maximize their performance. Or you can write everything in GDScript or C#. It's your call.
pt_br: Você pode usar múltiplas linguagens de programação em um único projeto. Por exemplo, em um time, você pode usar o código de lógica de jogo em GDScript já que é rápido de escrever, deixe que os level designers programem as missões na linguagem visual VisualScript, e use C# ou C++ para implementar algoritmos complexos e maximizar a performance. Ou você pode até escrever tudo em GDScript ou C#. A decisão é sua.

source: We provide this flexibility to answer the needs of different game projects and developers.
pt_br: Nós oferecemos esta flexibilidade para atender as necessidades de diferentes projetos de jogos e desenvolvedores.

source: `Godot 4.0 will remove VisualScript from core entirely. <https://godotengine.org/article/godot-4-will-discontinue-visual-scripting>`__ As a result, creating new projects using visual scripting in Godot is not recommended. Future Godot 4.x releases may have VisualScript reimplemented as an extension.
pt_br: `Godot 4.0 vai remover o VisualScript de toda sua base. <https://godotengine.org/article/godot-4-will-discontinue-visual-scripting>`__Como resultado, criar novos projetos utilizando visual script no Godot não é recomendado. Futuras versões do Godot 4.x podem ter o VisualScript reimplementado como uma extensão.

source: While Godot 3.x will keep VisualScript supported, we recommend :ref:`trying out GDScript <toc-learn-scripting-gdscript>` instead, especially if you intend to migrate your project to Godot 4.
pt_br: Apesar do Godot 3.x manter o suporte ao VisualScript, é recomentado ao :ref:`experimentar GDScript <toc-learn-scripting-gdscript>` especialmente se você pretende migrar seu projeto para o Godot 4.

source: If you're a beginner, we recommend to **start with GDScript**. We made this language specifically for Godot and the needs of game developers. It has a lightweight and straightforward syntax and provides the tightest integration with Godot.
pt_br: Se você é um iniciante, nós recomendamos **começar com GDScript**. Nós fizemos esta linguagem especificamente para o Godot e para as necessidades de desenvolvedores de jogos. Tem uma sintaxe simples e direta, e fornece a melhor integração com Godot.

source: For C#, you will need an external code editor like `VSCode <https://code.visualstudio.com/>`_ or Visual Studio. While C# support is now mature, you will find fewer learning resources for it compared to GDScript. That's why we recommend C# mainly to users who already have experience with the language.
pt_br: Para C#, você irá precisar de um editor de código externo como `VSCode <https://code.visualstudio.com/>`_ ou Visual Studio. Apesar do suporte para C# estar consolidado, você vai achar menos recursos de aprendizado para C# comparado a GDScript. É por isso que recomendamos C# principalmente para usuários que já tem experiência com a linguagem.

source: Let's look at each language's features, as well as its pros and cons.
pt_br: Vamos dar uma olhada nos recursos de cada linguagem, assim como seus prós e contras.

source: :ref:`GDScript<doc_gdscript>` is an `object-oriented <https://en.wikipedia.org/wiki/Object-oriented_programming>`_ and `imperative <https://en.wikipedia.org/wiki/Imperative_programming>`_ programming language built for Godot. It's made by and for game developers to save you time coding games. Its features include:
pt_br: :ref:`GDScript<doc_gdscript>` é uma linguagem de programação `orientada a objetos <https://pt.wikipedia.org/wiki/Programa%C3%A7%C3%A3o_orientada_a_objetos>`_ e `imperativa <https://pt.wikipedia.org/wiki/Programa%C3%A7%C3%A3o_imperativa>`_ feita para a Godot. É feita por e para desenvolvedores de jogos para economizar seu tempo programando jogos. Seus recursos incluem:

source: A simple syntax that leads to short files.
pt_br: Uma sintaxe simples que resulta a arquivos pequenos.

source: Blazing fast compilation and loading times.
pt_br: Tempos de compilação e carregamento extremamente rápidos.

source: No `garbage collection <https://en.wikipedia.org/wiki/Garbage_collection_(computer_science)>`_, as this feature eventually gets in the way when creating games. The engine counts references and manages the memory for you in most cases by default, but you can also control memory if you need to.
pt_br: Não há `coletor de lixo <https://pt.wikipedia.org/wiki/Coletor_de_lixo_(inform%C3%A1tica)>`_, já que esse recurso eventualmente atrapalha o processo de criação de jogos. A engine conta as referências e gerencia a memória pra você na maioria dos casos por padrão, mas você também pode controlar a memória caso necessário.

source: `Gradual typing <https://en.wikipedia.org/wiki/Gradual_typing>`_. Variables have dynamic types by default, but you also can use type hints for strong type checks.
pt_br: `Tipagem gradual (Gradual Typing) <https://en.wikipedia.org/wiki/Gradual_typing>`_. As variáveis tem tipos dinâmicos por padrão, mas você também pode usar dicas de tipo para fortes verificações do tipo da variável.

source: GDScript looks like Python as you structure your code blocks using indentations, but it doesn't work the same way in practice. It's inspired by multiple languages, including Squirrel, Lua, and Python.
pt_br: GDScript se parece com o Python ao passo que você estrutura seus blocos de código usando identações, mas não funciona da mesma maneira na prática. Ela é inspirada em várias linguagens, incluindo Squirrel, Lua e Python.

source: Why don't we use Python or Lua directly?
pt_br: Por quê não usamos Python ou Lua diretamente?

source: Years ago, Godot used Python, then Lua. Both languages' integration took a lot of work and had severe limitations. For example, threading support was a big challenge with Python.
pt_br: Anos atrás, Godot usava Python, depois Lua. A integração de ambas as linguagens deu muito trabalho e tinha limitações severas. Por exemplo, suporte a threading era um grande desafio com Python.

source: Developing a dedicated language doesn't take us more work and we can tailor it to game developers' needs. We're now working on performance optimizations and features that would've been difficult to offer with third-party languages.
pt_br: Desenvolver uma linguagem dedicada não nos dá mais trabalho e podemos adaptá-la às necessidades dos desenvolvedores de jogos. Agora estamos trabalhando em otimizações de desempenho e recursos que seriam difíceis de oferecer com linguagens de terceiros.

source: You must use the Mono edition of the Godot editor to script in C#. You can download it on the Godot website's `download <https://godotengine.org/download/>`_ page.
pt_br: Você deve usar a edição Mono do editor Godot para poder programar em C#. Você pode fazer download na `página de download <https://godotengine.org/download/>`_ no website do Godot.

source: GDScript code itself doesn't execute as fast as compiled C# or C++. However, most script code calls functions written with fast algorithms in C++ code inside the engine. In many cases, writing gameplay logic in GDScript, C#, or C++ won't have a significant impact on performance.
pt_br: Um código em GDScript não é executado tão rapidamente quanto um em C# ou C++ compilados. No entanto, a maioria dos códigos de script chama funções escritas com algoritmos rápidos em código C++ dentro da engine. Em muitos casos, escrever a lógica do jogo em GDScript, C# ou C++ não terá um impacto significativo no desempenho.

source: :ref:`Visual Scripting<doc_what_is_visual_script>` is a graph-based visual programming language where you connect blocks. It can be a great tool for non-programmers like game designers and artists.
pt_br: :ref:`Visual Scripting<doc_what_is_visual_script>` é uma linguagem de programação visual baseada em gráficos onde você conecta blocos. Pode ser uma ótima ferramenta para não-programadores, como designers de jogos e artistas.

source: You can use other languages to create custom blocks that are specific to your game, for example, to script AIs, quests, or dialogues. That's where the strength of VisualScript lies.
pt_br: Você pode utilizar outras linguagens para criar blocos customizados que são específicos para seu jogo, por exemplo, para programar IAs, missões, ou diálogos. É aí que reside a força do VisualScript.

source: While it provides all the basic building blocks you need to code complete games, we do not recommend to use VisualScript this way. Programming everything with it is slow compared to using other programming languages.
pt_br: Embora a linguagem forneça todos os blocos de construção básicos necessários para fazer jogos completos, nós não recomendamos o uso do VisualScript dessa maneira. Programar tudo com ele é lento em comparação ao uso de outras linguagens de programação.

source: For more information, see :ref:`Getting started with VisualScript <doc_getting_started_visual_script>`.
pt_br: Para mais informações, veja :ref:`Introdução ao VisualScript <doc_getting_started_visual_script>`.

source: C and C++ via GDNative
pt_br: C e C++ via GDNative

source: When working with GDNative, the available types, functions, and properties closely resemble Godot's actual C++ API.
pt_br: Ao trabalhar com GDNative, os tipos, funções e propriedades disponíveis se assemelham muito à API C++ real de Godot.

source: Summary
pt_br: Resumo

source: Scripts are files containing code that you attach to a node to extend its functionality.
pt_br: Scripts são arquivos contendo código que você anexa a um nó para estender sua funcionalidade.

source: Godot supports five official scripting languages, offering you flexibility between performance and ease of use.
pt_br: Godot suporta cinco linguagens de programação oficiais, oferecendo a flexibilidade entre desempenho e facilidade de uso.

source: You can mix languages, for instance, to implement demanding algorithms with C or C++ and write most of the game logic with GDScript or C#.
pt_br: Você pode misturar linguagens, por exemplo, para implementar algorítimos exigentes com C ou C++ e escrever a maior parte da lógica do jogo com GDScript ou C#.

source: Translation status
pt_br: Estado da Tradução
