Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: A script adds behavior to a node. It is used to control how the node functions as well as how it interacts with other nodes: children, parent, siblings, and so on. The local scope of the script is the node. In other words, the script inherits the functions provided by that node.
cs: Skript přidává do uzlu chování. Používá se k ovládání toho, jak uzel funguje a jak interaguje s jinými uzly: potomky, rodiči, sourozenci atd. Lokálním rozsahem skriptu je uzel. Jinými slovy, skript zdědí funkce poskytované tímto uzlem.
de: Das Skript fügt Verhalten zu dem Node hinzu. Es wird dazu verwendet, um die Funktion des Nodes als auch Interaktion mit anderen Objekten, wie Ober-, Unter- oder Nebennodes, zu steuern. Der lokale Aufgabenbereich des Skripts ist das Node. Anders ausgedrückt, das Skript erbt die Funktionen welche das Node zur Verfügung stellt.
es: Un script agrega comportamiento al nodo. Este se utiliza para controlar cómo se quiere que el nodo funcione y cómo debe interactuar con otros nodos: hijos (children), padre (parent), hermanos, etc. El ámbito local del script es el nodo. En otras palabras, el script hereda las funciones provistas por ese nodo.
fi: Skripti lisää solmulle toiminnallisuutta. Sitä käytetään ohjaamaan sitä kuinka solmu toimii, sekä myös sitä kuinka se kommunikoi muiden solmujen kanssa: alisolmujen, yläsolmun, rinnakkaisten solmujen, ja niin edelleen. Skriptin paikallinen näkyvyysalue on solmu itse. Toisin sanoen, skripti perii solmun tarjoamat funktiot.
fr: Un script ajoute un comportement à un nœud. Il est utilisé pour contrôler le fonctionnement du nœud ainsi que son interaction avec d'autres nœuds : enfants, parents, frères, etc. La portée locale du script est le nœud. En d'autres termes, le script hérite des fonctions fournies par ce nœud.
it: Uno script aggiunge un comportamento ad un nodo. E' usato per controllare come il nodo funziona e anche come interagisce con gli altri nodi: figli, genitore, fratelli, e così via. Il campo di azione (scope) locale dello script è il nodo. In altre parole, lo script eredita le funzioni fornite da quel nodo.
ja: スクリプトは、ノードに動作を追加します。ノードの機能方法、およびノードが他のノード(子、親、兄弟など)とどのように相互作用するかを制御するために使用されます。スクリプトのローカルスコープはノードです。つまり、スクリプトはそのノードによって提供される関数を継承します。
ko: 스크립트는 노드에 동작을 추가합니다. 노드가 작동하는 방식뿐만 아니라 하위 노드, 상위 노드, 형제 노드 등과 상호 작용하는 방식을 제어하는 데 사용됩니다. 스크립트는 노드에게, 그 노드의 함수들을 상속해줍니다.
pl: Skrypt dodaje zachowanie do węzła. Służy do kontrolowania sposobu działania węzła oraz jego interakcji z innymi węzłami: dziećmi, rodzicami, rodzeństwem itd. Lokalnym zakresem skryptu jest węzeł. Innymi słowy, skrypt dziedziczy funkcje tego węzła.
pt_br: Um roteiro adiciona comportamento a um nó. É usado para controlar como o nó funciona e também como ele interage com outros nós: filhos, pais, irmãos e assim por diante. O escopo local do roteiro é o nó. Em outras palavras, o roteiro herda as funções fornecidas por tal nó.
ru: Сценарий добавляет узлу поведение. Он используется для управления функционированием узла, а также его взаимодействия с другими узлами: дочерними, родительскими, родственными и т.д. Локальная область сценария - это узел. Другими словами, сценарий наследует функции, предоставляемые этим узлом.
uk: Скрипт додає до вузла поведінку. Він використовується для управління функціональністю вузла та його взаємодією з іншими вузлами: нащадками, предками, братами і сестрами тощо. Локальна область дії скрипту - вузол. Іншими словами, скрипт успадковує функції, надані цим вузлом.
zh_cn: 脚本为节点添加行为。它用于控制节点的功能以及它如何与其他节点交互:子节点、父节点、同级节点等。脚本的作用域是(它附着的)节点。换句话说，该脚本继承了该节点提供的功能。
zh_tw: 腳本可以增加節點的行為、控制節點的功能以及與決定如何與其他節點互動 (子節點、母節點、同級節點等)。腳本的區域作用域 (Local Scope) 為節點。換句話說，腳本會繼承節點的功能。

source: Handling a signal
cs: Obsluha signálu
de: Signalbehandlung
es: Manejando una señal
fi: Signaalin käsittely
fr: Traitement d'un signal
it: Gestire un segnale
ja: シグナルの処理
ko: 시그널 다루기
pl: Obsługa sygnału
pt_br: Manipulando um sinal
ru: Обработка сигнала
uk: Обробка сигналу
zh_cn: 处理信号
zh_tw: 處理訊號

source: Signals are "emitted" when some specific kind of action happens, and they can be connected to any function of any script instance. Signals are used mostly in GUI nodes, although other nodes have them too, and you can even define custom signals in your own scripts.
cs: Signály jsou „vysílány“, když nastane nějaký konkrétní druh akce, a mohou být spojeny s funkcí jakékoliv skriptu libovolné instance. Signály se používají většinou v uzlech GUI, i když je mají i jiné uzly, a dokonce můžete definovat vlastní signály ve vlastních skriptech.
de: Signale werden "ausgesendet", wenn eine bestimmte Arten von Aktion stattfindet, welche mit beliebigen Funktionen in jeglicher Skriptinstanz verbunden sein können. Signale werden hauptsächlich in Nodes für grafische Benutzeroberflächen verwendet, obgleich andere Nodes diese auch besitzen können und es sogar möglich ist eigene Signale in Skripten zu definieren.
es: Las señales son "emitidas" cuando alguna acción específica sucede, y se pueden conectar a cualquier función de cualquier instancia de script. Las señales se utilizan sobre todo en nodos de la IGU, aunque otros nodos también tienen señales, e incluso puedes definir señales en tu propio script.
fi: Signaaleja "lähetetään", kun jokin tietyn tyyppinen toiminto tapahtuu, ja ne voidaan yhdistää minkä tahansa skriptin mihin tahansa funktioon. Signaaleja käytetään pääasiassa käyttöliittymäsolmuissa, joskin muillakin solmuilla on niitä, ja voit jopa määritellä omia signaaleja omissa skripteissäsi.
fr: Les signaux sont "émis" lorsqu'une action spécifique se produit, et ils peuvent être connectés à n'importe quelle fonction de n'importe quelle instance de script. Les signaux sont surtout utilisés dans les nœuds de l'interface graphique, bien que d'autres nœuds en aient aussi, et vous pouvez même définir des signaux personnalisés dans vos propres scripts.
it: I segnali sono "emessi" quando avviene qualche tipo specifico di azione, e possono essere associati ad ogni funzione di ogni script istanziato. I segnali sono usati per lo più per i nodi di interfaccia utente (GUI), sebbene possano essere usati anche per altri nodi e potete persino definire dei segnali personalizzati nei vostri script.
ja: シグナルは、特定の種類のアクションが発生したときに「出力」され、任意のスクリプトインスタンスの任意の関数に接続できます。シグナルは主にGUIノードで使用されますが、他のノードにもシグナルが含まれ、独自のスクリプトでカスタムシグナルを定義することもできます。
ko: 시그널은 특정한 종류의 작업이 발생할 때 "방출(emit)" 되며 스크립트 인스턴스의 모든 기능에 연결될 수 있습니다. 시그널은 대부분 GUI노드에서 사용되며, 다른 노드에도 시그널이 있고 사용자 스크립트에서 커스텀 시그널을 정의할 수도 있습니다.
pl: Sygnały są "emitowane" w momencie wystąpienia określonego rodzaju akcji i można je podłączyć do dowolnej funkcji dowolnej instancji skryptu. Sygnały są używane głównie w węzłach GUI, choć inne węzły również je posiadają, a w własnych skryptach można nawet definiować własne sygnały.
pt_br: Sinais são "emitidos" quando algum tipo específico de ação acontece, e eles podem ser conectados a qualquer função de qualquer instância de script. Sinais são usados majoritariamente em nós de interface gráfica – embora outros nós também os tenha – e você pode até mesmo definir sinais personalizados em seus próprios roteiros.
ru: Сигналы "излучаются", когда происходит определенный вид действий, и они могут быть подключены к любой функции любого экземпляра сценария. Сигналы используются в основном в GUI-узлах, хотя они также есть и в других узлах, и вы даже можете определить пользовательские сигналы в своих собственных сценариях.
uk: Сигнали "випромінюються", коли відбувається певний вид дії, і їх можна підключити до будь-якої функції будь-якого екземпляра скрипту. Сигнали використовуються здебільшого у вузлах GUI, хоча інші вузли їх також мають, і ви навіть можете визначити власні сигнали у власних скриптах.
zh_cn: 当某种特定行为发生时，信号会被“触发”，并且它们可以连接到任意脚本实例的任意函数。信号主要用于GUI节点，不过其他节点也有信号，您甚至可以在自己的脚本里定义自定义信号。
zh_tw: 當特定類型的動作發生後，會「發送」一個訊號，我們可以通過訊號來將這個動作與任何一個腳本實體函式連在一起。訊號通常在 GUI 節點內使用，但其他節點也會有訊號。甚至可以在腳本內自定訊號。

source: In this step, we'll connect the "pressed" signal to a custom function. Forming connections is the first part and defining the custom function is the second part. For the first part, Godot provides two ways to create connections: through a visual interface the editor provides or through code.
cs: V tomto kroku propojíme „pressed“ signál s uživatelskou funkcí. První část je vytvoření spojení a druhá část pak definování vlastní funkce. Pro první část Godot poskytuje dva způsoby vytvoření připojení: prostřednictvím vizuálního rozhraní, které editor poskytuje, nebo pomocí kódu.
de: In diesem Schritt werden wir das "pressed()"-Signal mit einer eigenen Funktion verbinden. Erstellen der Verbindung ist der erste Schritt und definieren der neuen Funktion der zweite. Für den ersten Schritt stellt Godot zwei mögliche Wege zur Verfügung: durch ein grafisches Interface oder programmiertechnisch.
es: En este paso, conectaremos la señal ``pressed`` a una función personalizada. Formar conexiones es la primera parte y definir la función personalizada es la segunda parte. Para la primera parte, Godot proporciona dos maneras de crear conexiones: a través de una interfaz visual que proporciona el editor o a través del código.
fi: Tässä vaiheessa kytkemme "pressed" signaalin itse luotuun funktioon. Kytkentöjen tekeminen on ensimmäinen osio ja funktion luominen on toinen osio. Ensimmäistä varten Godot tarjoaa kaksi tapaa luoda kytkennän: editorin visuaalisen rajapinnan tai koodin kautta.
fr: Dans cette étape, nous allons connecter le signal "pressed" à une fonction personnalisée. Créer les connexions constitue la première partie, et définir la fonction la seconde. Pour la première partie, Godot fournit deux moyens de créer des connexions : au travers d'une interface visuelle incluse dans l'éditeur, ou au travers du code.
it: In questo pass, connettiamo il segnale "pressed" a una funzione personalizzati. Formare connessioni è la prima parte e la definizione della funzione personalizzata è la seconda parte. Per la prima parte, Godot fornisce due modi per creare connessioni: attraverso una interfaccia visuale fornita dall'editor o attraverso il codice.
ja: このステップでは、「pressed」シグナルをカスタム関数に接続します。最初のパートは接続の形成で、2番目のパートはカスタム関数の定義です。最初のパートでは、Godotは接続を作成する2つの方法を提供します: エディタが提供するビジュアルインタフェースを使用する方法と、コードを使用する方法です。
ko: 이 단계에서 우리는 "pressed" 시그널을 커스텀 기능에 연결할 겁니다. 먼저 연결 형식을 지정한 후에 두 번째로 커스텀 기능을 정의합니다. Godot에서는 연결하기 위한 2가지 방법을 제공합니다: 에디터에서 제공하는 시각적 인터페이스나 코드를 통해 사용자 지정 기능에 연결할 수 있습니다.
pl: W tym kroku sygnał "wciśnięty" zostanie podłączony do funkcji niestandardowej. Tworzenie połączeń jest pierwszą częścią, a definiowanie funkcji niestandardowych drugą częścią. W pierwszej części, Godot przewiduje dwa sposoby tworzenia połączeń: poprzez wizualny interfejs edytora lub poprzez kod.
pt_br: Neste passo, conectaremos o sinal "pressed" ("pressionado") a uma função personalizada. Formar conexões é a primeira etapa e definir a função personalizada é a segunda. Para o primeiro estágio, o Godot provê duas maneiras de criar conexões: através da interface visual que o editor possui ou através de código.
ru: На этом этапе мы подключим сигнал "pressed" ("нажато") к пользовательской функции. Формирование соединений - это первая часть, а определение пользовательской функции - вторая. Для первой части Godot предоставляет два способа создания соединений: через визуальный интерфейс, который редактор предоставляет, или через код.
uk: На цьому кроці ми підключимо сигнал "pressed" ("натиснуто") до власної функції. Формування з'єднань - перша частина, а визначення власної функції - друга частина. У першій частині Godot надає два способи створення з'єднань: через візуальний інтерфейс, який надає редактор, або через код.
zh_cn: 在这一步中，我们将“pressed(按下)”信号连接到一个自定义函数上。形成连接是第一部分，定义自定义函数是第二部分。对于第一部分，Godot提供了两种创建连接的方式:通过编辑器的可视化界面或通过代码。
zh_tw: 在這個步驟，我們要把「按下 (Pressed)」訊號連接到自定義函式。第一個部分是構成連接，第二個部分則是要定義函式。Godot 中有兩個方法可以建立連線，第一個方法是通過編輯器視覺化界面，第二個方法則是通過程式碼。

source: While we will use the code method for the remainder of this tutorial series, let's cover how the editor interface works for future reference.
cs: I když pro zbytek této série tutoriálů použijeme metodu kódu, pojďme se nejprve podívat, jak funguje rozhraní editoru.
de: Während wir die Programmiermethode für den Rest dieser Anleitung verwenden, lass uns das grafisch Interface für zukünftige Verweise abdecken.
es: Aunque usaremos el método de código para el resto de esta serie de tutoriales, cubriremos cómo funciona la interfaz del editor para futuras referencias.
fi: Vaikkakin käytämme koodimenetelmää tämän oppaan loppuajan, käydään silti vastaisuuden varalle läpi kuinka editorin käyttöliittymä toimii.
fr: Bien que nous utiliserons la méthode du code pour le reste de cette série de tutoriels, voyons comment l'interface de l'éditeur fonctionne pour future référence.
it: Mentre useremo il metodo del codice per il resto di questa serie di tutorial, parliamo di come funziona l'interfaccia dell'editor per riferimenti futuri.
ja: このチュートリアルの残りの部分ではコードを使用しますが、今後のためにエディタインターフェースがどのように機能するかについて説明します。
ko: 이 튜토리얼 시리즈의 나머지 부분에서는 코드 메서드를 사용하겠습니다만, 나중에 참고하기 위한 에디터 인터페이스가 어떻게 작동하는지에 대해서는 설명하겠습니다.
pl: Mimo że będziemy tworzyć nasze połączenia poprzez kod przez resztę tego samouczka, na przyszłość przyjrzyjmy się jak dodać połączenie, korzystając z interfejsu edytora.
pt_br: Embora iremos usar o método do código para o resto desta série de tutoriais, vamos cobrir aqui como a interface do editor funciona para referência futura.
ru: Хоть мы и будем использовать метод написания кода для оставшейся части этой серии уроков, давайте рассмотрим как работает интерфейс редактора, для дальнейшего использования.
uk: Хоча ми будемо використовувати метод коду для решти уроків цієї серії, давайте розповімо про те, як працює інтерфейс редактора для подальшого використання.
zh_cn: 虽然我们会在本系列教程的其余部分中使用代码方法，但现在还是介绍一下如何用编辑器界面操作以供将来参考。
zh_tw: 雖然在這個教學中接下來的部分我們都會使用程式碼，但這裡還是來介紹一下要如何用編輯器界面來建立連接。

source: Select the Button node in the scene tree and then select the "Node" tab. Next, make sure that you have "Signals" selected.
cs: Vyberte uzel Button ve stromové struktuře scény a poté zvolte kartu „Uzel“. Dále se ujistěte, že máte vybranou možnost „Signály“.
de: Wähle das Button Node im Szenenbaum und dann klicke auf das "Node"-Tab. Als nächstes, stelle sicher, dass "Signale" ausgewählt ist.
es: Selecciona el nodo Button en el árbol de escenas y luego selecciona la pestaña ``Nodo``. A continuación, asegúrate de que has seleccionado ``Señales``.
fi: Valitse Button solmu skenepuusta ja valitse sitten "Solmu"-välilehti. Varmista seuraavaksi, että "Signaalit" on valittuna.
fr: Sélectionnez le node Button dans l'arbre de scène puis l'onglet "Node". Assurez-vous ensuite que "Signaux" est sélectionné.
it: Seleziona il nodo Button nella Scene Tree e seleziona a quel punto l'etichetta "Node". Successivamente assicurati di aver selezionato "Signals".
ja: シーンツリーでボタンノードを選択し、「ノード」タブを選択します。次に、「シグナル」が選択されていることを確認します。
ko: 씬 트리에서 버튼 노드를 고르고 "노드" 탭을 선택하세요. 그런 후, "시그널"이 선택되어 있는지 확인하세요.
pl: Zaznacz węzeł "Przycisk" na drzewie scen, a następnie wybierz kartę "Węzeł". Następnie upewnij się, że wybrano opcję "Sygnały".
pt_br: Selecione o nó Botão na árvore da cena e selecione o guia "Nó". Em seguida, assegure-se que selecionou "Sinais".
ru: Выберите узел Кнопка (Button) в дереве сцен и затем выберите вкладку "Узел". Далее, убедитесь, что вы выбрали "Сигналы".
uk: Виберіть вузол Button (Кнопка) в дереві сцени, а потім виберіть вкладку "Вузол". Далі переконайтесь, що вибрано “Сигнали”.
zh_cn: 在场景树中选择Button节点，然后选择“Node”选项卡。接下来，确保您选中了“Signals”选项。
zh_tw: 從場景樹中選擇 Button 節點，然後再按 [節點] 分頁。接下來，確定一下有選中 [訊號] 選項。

source: If you then select "pressed()" under "BaseButton" and click the "Connect..." button in the bottom right, you'll open up the connection creation dialogue.
cs: Pokud poté v části „BaseButton“ vyberete „pressed()“ a klikněte na tlačítko „Připojit ...“ v pravém dolním rohu, otevře se dialog pro vytvoření připojení.
de: Wenn dann "pressed()" unter "BaseButton" ausgewählt und auf die "Verbinden..."-Schaltfläche im unteren rechten Bereich geklickt wird, erscheint eine Dialog, mit dem Signalverbindungen erstellt werden können.
es: Si seleccionas "pressed()" en "BaseButton" y haces clic en el botón "Conectar... " en la parte inferior derecha, se abrirá el cuadro de diálogo de creación de la conexión.
fi: Jos siten valitset "pressed()" kohdan "BaseButton" osiosta ja napsautat "Yhdistä..." painiketta oikeassa alakulmassa, avaat kytkennänluonti-ikkunan.
fr: Si vous sélectionnez ensuite "pressed()" sous "BaseButton" et cliquez sur le boutton "Connecter..." en bas à droite, vous allez ouvrir la fenêtre de création de connexion.
it: Se poi selezioni "pressed()" sotto "BaseButton" e premi il bottone "Connect..." in basso a destra, aprirai la finestra per la creazione delle connessioni.
ja: 次に、「BaseButton」の下の「pressed()」を選択し、右下の「接続...」ボタンをクリックすると、接続作成ダイアログが開きます。
ko: "BaseButton" 밑에 있는 "pressed()"를 고르고 오른쪽 아래 "연결하기..." 버튼을 누르신다면, 연결 생성 대화 상자가 열립니다.
pl: Jeśli wybierzesz "wciśnij()"(pressed()) pod "BaseButton" i klikniesz przycisk "Connect..." w prawym dolnym rogu, otworzysz okno dialogowe tworzenia połączenia.
pt_br: Se você agora selecionar "pressed()" dentro de "BaseButton" e clicar no botão "Conectar..." no canto inferior direito, você abrirá o diálogo de criação de conexão.
ru: Затем, если выберете "pressed()" в разделе "BaseButton" и нажмете кнопку "Подключить..." в правом нижнем углу, откроется диалог создания соединения.
uk: Якщо ви виберете "pressed()" під "BaseButton" і натиснете кнопку "Підключити ..." в нижньому правому куті, ви відкриєте діалог створення з'єднання.
zh_cn: 选择“BaseButton”下的“pressed()”然后点击右下方的“Connect...(连接)”，会打开连接创建对话框。
zh_tw: 接下來選擇「BaseButton」底下的「pressed()」，然後點擊右下角的 [連接…] 打開建立連接對話框。

source: In the bottom-left are the key things you need to create a connection: a node which implements the method you want to trigger (represented here as a NodePath) and the name of the method to trigger.
de: Im unteren linken Bereich sind die Schlüsselstellen für das Erstellen einer Verbindung zu finden: ein Node, welches den Funktionsaufruf implementiert der ausgelöst wird (dargestellt als "Pfad zur Node") und der Name des Funktionsaufrufes.
es: En la parte inferior izquierda se encuentran los elementos clave que necesitas para crear una conexión: un nodo que implementa el método que quieres activar (representado aquí como un NodePath) y el nombre del método a activar.
fr: En bas à gauche se situent les éléments importants dont vous avez besoin pour créer une connexion : un noeud qui implémente la méthode que vous voulez déclencher (représenté ici par un NodePath) et le nom de la méthode à déclencher.
it: In basso a sinistra ci sono gli elementi chiave necessari per creare una connessione: un nodo che implementa il metodo che vuoi attivare (qui rappresentato con un NodePath) e il nome del metodo da attivare.
ko: 왼쪽 아래에 당신이 연결을 만드는데 필요한 핵심 사항이 있습니다: 사용하길 원하는 메서드를 실행할 (NodePath로 정의된) 하나의 노드와 그 메서드의 이름입니다.
ru: В левом нижнем углу находятся ключевые поля, необходимые для создания соединения: узел, реализующий метод, который вы хотите вызвать (представлен здесь как NodePath), и имя метода для запуска.
zh_cn: 左下方是创建连接所需的关键:实现您想要触发方法的节点(在此用NodePath表示)以及要触发的方法的名字。

source: The top-left section displays a list of your scene's nodes with the emitting node's name highlighted in red. Select the "Panel" node here. When you select a node, the NodePath at the bottom will automatically update to point a relative path from the emitting node to the selected node.
de: Der obere linke Bereich zeigt eine Liste mit den Nodes in der Szene, mit der Signalquelle hervorgehoben in Rot. Wähle hier das Panel Node aus. Nach der Auswahl des Nodes wird der "Pfad zur Node" automatisch auf den relativen Pfad von der Signalquelle zum ausgewählten Node aktualisiert.
ru: В левом верхнем разделе отображается список узлов вашей сцены, где имя излучающего узла выделено красным цветом. Выберите узел "Panel". Когда вы выбираете узел, NodePath внизу будет автоматически обновляться, указывая относительный путь от излучающего к выбранному узлу.

source: By default, the method name will contain the emitting node's name ("Button" in this case), resulting in "_on_[EmitterNode]_[signal_name]". If you do have the "Make Function" check button checked, then the editor will generate the function for you before setting up the connection.
de: Als Standard enthält der Funktionsaufruf den Namen des Nodes von welchem das Signal ausgeht (in diesem Fall "Button"), was in "_on_[SignalNode]_[SignalName]" resultiert. Wenn "Funktion erstellen" ausgewählt ist, dann wird automatisch ein Funktion generiert bevor die Signalverbindung hergestellt wird.
fr: Par défaut, le nom de la méthode contiendra le nom du noeud émetteur ("Button" dans notre cas), ce qui donnera "_on_[NodeEmetteur]_[nom_du_signal]". Si vous avez le bouton "Créer une fonction" coché, alors l'éditeur générera la fonction pour vous avant de mettre en place la connexion.
it: Per default, il nome del metodo conterrà il nome del nodo emittente ("Button", in questo caso), risultando in "_on_[EmitterNode]_[signal_name]". Se hai il tasto a due vie "Make function" su attivato, allora l'editor genererà la funzione per te, prima di impostare la connessione col nodo selezionato.
ko: 기본적으로, 메서드의 이름은 방출하는 노드의 이름에 포함되어서 "_on_[EmitterNode]_[signal_name]"으로 표시됩니다 (이 경우에는 "Button"이죠). 만일 "함수 만들기" 버튼이 체크되어 있다면, 에디터는 연결을 설정하기 전에 함수를 생성할 겁니다.
ru: По умолчанию имя метода будет содержать имя излучающего узла (в данном случае - "Button"), в результате чего "_on_[EmitterNode]_[signal_name]". Если у вас включена кнопка "Сделать функцию", то редактор будет генерировать эту функцию перед настройкой соединения.

source: And that concludes the guide on how to use the visual interface. However, this is a scripting tutorial, so for the sake of learning, let's dive in to the manual process!
de: Und damit schließt der Leitfaden für das grafische Interface ab. Da dies eine Skriptanleitung ist, lass uns nun die Programmiermethode abdecken!
ru: На этом завершим наше обучение по использованию визуального интерфейса. Всё же, это урок по сценариям, поэтому, ради изучения, давайте погрузиться в ручной процесс!

source: To accomplish this, we will introduce a function that is probably the most used by Godot programmers: :ref:`Node.get_node() <class_Node_get_node>`. This function uses paths to fetch nodes anywhere in the scene, relative to the node that owns the script.
de: Um dies zu erreichen werden wir eine Funktion benutzen, welche wahrscheinlich eine der meist genutzten Funktionen bei Godot Programmierern ist: :ref:`Node.get_node() <class_Node_get_node>`. Diese Funktion benutzt Pfade um Nodes überall in der Szene, relative zu dem Node mit dem aufrufendem Skript zu finden.
ko: 이것을 달성하기 위해서, 우리는 Godot 프로그래머들이 가장 잘 사용하는 기능을 소개하겠습니다: :ref:`Node.get_node() <class_Node_get_node>` 입니다. 이 기능은 스크립트를 소유한 노드라면 씬 내 어느 위치라도 경로를 사용해서 노드를 가져옵니다.
ru: Для этого мы познакомимся с функцией, которая, вероятно, наиболее часто используется программистами Godot: :ref:`Node.get_node() <class_Node_get_node>`. Эта функция использует пути для извлечения узлов из любого места сцены, относительно узла, которому принадлежит сценарий.
