Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Writing a script and attaching it to a node.
cs: Psaní skriptu a jeho připojení k uzlu.
de: Ein Skript schreiben und es einem Node hinzufügen.
es: Escribir un script y añadirlo a un nodo.
fi: Skriptin kirjoittamista ja sen liittämistä solmuun.
fr: Ecrire un script et l'attacher à un nœud.
it: Scrivere uno script e allegarlo a un nodo.
ja: スクリプトを作成し、ノードにアタッチします。
ko: 스크립트를 작성하여 노드에 연결함.
pl: Pisanie skryptu i dołączanie go do węzła.
pt_br: Escrever um roteiro e anexá-lo a um nó.
ru: Написание сценария и его привязку к узлу.
uk: Написання скрипту та приєднання його до вузла.
zh_cn: 编写脚本并附加到节点上。
zh_tw: 撰寫腳本並把腳本附加到節點上。

source: Hooking up UI elements via signals.
cs: Zapojení prvků uživatelského rozhraní pomocí signálů.
de: UI Elemente mit Signalen verknüpfen.
es: Conexión de los elementos de la UI mediante señales.
fi: Käyttöliittymäelementtien kytkemisen signaaleilla.
fr: Raccordement des éléments de l’UI via des signaux.
it: Connettere gli elementi dell'interfaccia utente (UI) attraverso i segnali.
ja: シグナルを介して UI 要素をフックします。
ko: 시그널을 통해 UI 요소들을 연결함.
pl: Odtwarzanie elementów interfejsu użytkownika za pomocą sygnałów.
pt_br: Conectar elementos de interface via sinais.
ru: Подключение элементов пользовательского интерфейса через сигналы.
uk: Підключення елементів інтерфейсу через сигнали.
zh_cn: 通过信号来连接到UI元素。
zh_tw: 通過訊號 (Signal) 來串聯 UI 元素。

source: Writing a script that can access other nodes in the scene.
cs: Psaní skriptu, který má přístup k dalším uzlům ve scéně.
de: Ein Skript schreiben welches Zugriff auf andere Nodes in der Szene hat.
es: Escribir un script que pueda acceder a otros nodos de la escena.
fi: Muita skenen solmuja käsittelevän skriptin kirjoittamista.
fr: Ecrire un script qui peut accéder à d'autres nœuds de la scène.
it: Scrivere uno script che può accedere agli altri nodi della scena.
ja: シーン内の他のノードにアクセスできるスクリプトを作成します。
ko: 씬의 다른 노드에 액세스 할 수 있는 스크립트를 작성함.
pl: Pisanie skryptu umożliwiającego dostęp do innych węzłów sceny.
pt_br: Escrever um roteiro que pode acessar outros nós na cena.
ru: Написание сценария, который может получать доступ к другим узлам в сцене.
uk: Написання скрипту, який може отримати доступ до інших вузлів сцени.
zh_cn: 编写脚本，使其能访问场景中的其它节点。
zh_tw: 撰寫能夠存取場景中其他節點的腳本。

source: Before continuing, please make sure to read the :ref:`doc_gdscript` reference. It's a language designed to be simple, and the reference is short, so it will not take more than a few minutes to get an overview of the concepts.
de: Bitte lesen Sie die :ref:`doc_gdscript` Referenz bevor sie fortfahren. Die Sprache ist konzipiert um einfach zu sein, und die Referenz ist kurz, es wird also höchstens einige Minuten dauern einen Überblick über die Konzepte zu erlangen.
fr: Avant de continuer, assurez-vous de lire la référence :ref:`doc_gdscript`. C'est un langage conçu pour être simple, et la référence est courte, de sorte qu'il ne faudra pas plus de quelques minutes pour obtenir une vue d'ensemble des concepts.
ko: 계속하기 전에 :ref:`doc_gdscript` 레퍼런스를 반드시 읽어 보시기 바랍니다. 이 언어는 간단하게 설계되었고, 참조가 짧기 때문에 개념을 파악하는 데 몇 분 정도 밖에 걸리지 않습니다.
ru: Прежде чем продолжить, обязательно почитайте о :ref:`doc_gdscript`. Это простой язык, и справочный материал для него не объемный, поэтому для обзора концепций потребуется не более нескольких минут.

source: Scene setup
cs: Nastavení scény
de: Eine Szene aufsetzen
es: Configuración de la escena
fi: Skenen järjestely
fr: Configuration de la scène
it: Impostazione della scena
ja: シーンの設定
ko: 씬 설정하기
pl: Konfiguracja sceny
pt_br: Configuração da cena
ru: Настройка сцены
uk: Налаштування сцени
zh_cn: 建立场景
zh_tw: 場景設定

source: Use the "Add Child Node" dialogue accessed from the Scene tab (or by pressing ``Ctrl+A``) to create a hierarchy with the following nodes:
de: Benutze den "Node hier anhängen" Dialog, zugänglich über den Szenentab (oder mit der Tastaturkombination ``Strg+A``), um eine Hierarchie mit den folgenden Nodes zu erstellen:
es: Utiliza el cuadro de diálogo "Añadir nodo hijo" al que se accede desde la pestaña Escena (o pulsando ``Ctrl+A``) para crear una jerarquía con los siguientes nodos:
fr: Utilisez la boîte de dialogue "Ajouter un nœud enfant" accessible depuis l'onglet Scène (ou en appuyant sur ``Ctrl+A``) pour créer une hiérarchie avec les nœuds suivants :
it: Clicca su "Aggiungi Nodo Figlio" accedendo dal menu Scena (o premendo ``Ctrl+A``) per creare una gerarchia con i seguenti nodi:
ko: 씬 탭에서 액세스 하는 "하위 노드 추가" 대화 상자를 사용하여 (아니면 ``Ctrl+A`` 를 눌러), 다음 노드로 계층을 생성합니다:
ru: Используйте диалог "Добавить дочерний узел", доступ к которому осуществляется из вкладки "Сцена" (или нажатием ``Ctrl+A``), чтобы создать иерархию со следующими узлами:
zh_cn: 使用场景(Scene)选项卡来访问“添加子节点”(Add Child Node)对话框(或者按下 ``Ctrl+A``)，创建以下节点结构:

source: Panel
fr: Panneau
it: Pannello
ko: 패널(Panel)
pt_br: Painel
ru: Панель
uk: Панель
zh_cn: 面板
zh_tw: 面板

source: Label
it: Etichetta
ko: 라벨(Label)
pt_br: Rótulo
ru: Ярлык
uk: Мітка
zh_cn: 标签
zh_tw: 標籤

source: Button
cs: Tlačítko
de: Schaltfläche
es: Botón
fr: Bouton
it: Pulsante
ko: 버튼(Button)
pl: Przycisk
pt_br: Botão
ru: Кнопка
uk: Кнопка
zh_cn: 按钮
zh_tw: 按鈕

source: The scene tree should look like this:
cs: Strom scény by měl vypadat takto:
de: Der Szenenbaum sollte so aussehen:
es: El árbol de la escena debería verse así:
fi: Skenepuun pitäisi näyttää tältä:
fr: L'arbre de scène devrait ressembler à ceci :
it: L'albero della scena dovrebbe essere simile a questo:
ja: シーン ツリーは次のようになります:
ko: 씬 트리는 다음과 같아야 합니다:
pl: Drzewo sceny powinno tak wyglądać:
pt_br: A árvore da cena deveria se parecer assim:
ru: Дерево сцены должно выглядеть так:
uk: Дерево сцени має виглядати так:
zh_cn: 场景树看起来应该是这个样子:
zh_tw: 場景樹應該會長這樣：

source: Use the 2D editor to position and resize the Button and Label so that they look like the image below. You can set the text from the Inspector tab.
cs: Pomocí 2D editoru umístěte a změňte velikost Tlačítka(Button) a Popisku(Label) tak, aby vypadaly jako na obrázku níže. Text můžete nastavit na kartě Inspektor.
de: Verwende den 2D-Editor um den Button und das Label so zu positionieren, wie im folgenden Bild dargestellt. Der Text kann im Inspektortab eingefügt werden.
es: Utiliza el editor 2D para situar y redimensionar el Botón y la Etiqueta para que se parezcan a la imagen de abajo. Puedes configurar el texto desde la pestaña Inspector.
fi: Käytä 2D-editoria asemoidaksesi ja muuttaaksesi Button ja Label solmujen koot niin, että ne näyttävät samalta kuin alla olevassa kuvassa. Voit asettaa tekstin Tarkastelu-välilehdellä.
fr: Utilisez l'éditeur 2D pour positionner et redimensionner le bouton et le label afin qu'ils ressemblent à l'image ci-dessous. Vous pouvez définir le texte à partir de l'onglet Inspecteur.
it: Usa l'editor 2d per posizionare e ridimensionare il Pulsante e l'Etichetta così che possano assomigliare all'immagine qui sotto. Puoi impostare il testo dalla tab Inspector.
ja: 2Dエディタを使用して、ボタンとラベルを下の画像のように配置およびサイズ変更します。インスペクタ タブからテキストを設定できます。
ko: 2D 에디터를 사용하여 Button 과 Label을 아래 이미지와 같이 배치하고 크기를 조정합니다. 인스펙터 탭에서 텍스트를 설정할 수 있습니다.
pl: Edytor 2D służy do pozycjonowania i zmiany rozmiaru przycisków i etykiet tak, aby wyglądały jak obrazek poniżej. Tekst można ustawić w zakładce Inspektor.
pt_br: Use o editor 2D para posicionar e redimensionar o Botão (Button) e o Rótulo (Label) para que eles se pareçam com a imagem a seguir. Você pode definir o texto a partir da aba Inspetor.
ru: Используйте 2D-редактор для позиционирования и изменения размера Кнопки и Ярлыка, чтобы они выглядели как на изображении ниже. Вы можете набрать текст во вкладке "Инспектор".
uk: Використовуйте 2D-редактор для розміщення та зміни розміру кнопки та мітки так, щоб вони виглядали як на зображенні нижче. Ви можете встановити текст на панелі «Інспектор».
zh_cn: 使用2D编辑器定位并调整按钮和标签的大小，使其看起来像下面的样子。您可以在属性面板(Inspector)选项卡中设置文字。
zh_tw: 使用 2D 編輯器來調整 Button 跟 Label 的位置與大小，讓這兩個節點看起來像下面這樣。可以從屬性面板裡設定文字內容。

source: Finally, save the scene with a name such as ``sayhello.tscn``.
cs: Nakonec scénu uložte pod názvem ``sayhello.tscn``.
de: Anschließend speichere die Szene unter den namen ``sayhello.tscn``.
es: Finalmente, guarda la escena con un nombre como ``sayhello.tscn``.
fi: Lopuksi tallenna skene nimellä kuten esimerkiksi ``sayhello.tscn``.
fr: Enfin, sauvegardez la scène avec un nom tel que ``sayhello.tscn``.
it: Infine, salva la scena con un nome come ``sayhello.tscn``.
ja: 最後に、シーンを ``sayhello.tscn`` などの名前で保存します。
ko: 마지막으로, ``sayhello.tscn`` 와 같은 이름으로 씬을 저장합니다.
pl: Na koniec zapisz scenę o nazwie ``sayhello.tscn``.
pt_br: Por fim, salve a cena com um nome como ``digaoi.tscn``.
ru: Наконец, сохраните сцену с именем ``sayhello.tscn``.
uk: Нарешті, збережіть сцену під назвою ``sayhello.tscn``.
zh_cn: 最后，保存场景，用例如 ``sayhello.tscn`` 这样的名字。
zh_tw: 最後，保存場景為 ``sayhello.tscn`` 之類的名稱。

source: Adding a script
cs: Přidání skriptu
de: Ein Skript hinzufügen
es: Añadir un script
fi: Skriptin lisäys
fr: Ajouter un script
it: Aggiungi uno script
ja: スクリプトの追加
ko: 스크립트 추가하기
pl: Dodawanie skryptu
pt_br: Adicionando um script
ru: Добавление сценария
uk: Додавання скрипту
zh_cn: 添加脚本
zh_tw: 新增腳本

source: Right click on the Panel node, then select "Attach Script" from the context menu:
cs: Klikněte pravým tlačítkem myši na uzel Panel, pak vyberte "Připojit Skript" z kontextového menu:
de: Rechtsklicke auf das Panel Node und wähle "Skript hinzufügen" von dem Kontextmenü:
es: Haz clic con el botón derecho del ratón en el nodo Panel y selecciona " Añadir Script " en el menú contextual:
fi: Napsauta oikealla Panel solmusta ja valitse "Liitä skripti" pikavalikosta:
fr: Cliquez avec le bouton droit sur le nœud Panel, puis sélectionnez "Attacher un script" dans le menu contextuel :
it: Clicca con il tasto destro sul nodo Pannello, quindi seleziona "Attacca Script" dal menù contestuale:
ja: パネルノードを右クリックし、コンテキストメニューから「スクリプトをアタッチ」を選択します:
ko: 패널 노드에서 마우스 오른쪽 버튼을 클릭하고, 메뉴에서 "스크립트 붙이기"를 선택합니다:
pl: Kliknij prawym przyciskiem myszy na węzeł Panel, a następnie wybierz z menu kontekstowego opcję "Dołącz skrypt":
pt_br: Clique com o botão direito do mouse no nó Painel e selecione "Adicionar um Script" a partir do menu de contexto:
ru: Щелкните правой кнопкой мыши на узел Panel и выберите "Прикрепить скрипт" в контекстном меню:
uk: Клацніть правою кнопкою миші на вузлі Panel (Панель), а потім виберіть "Долучити скрипт" у спадному меню:
zh_cn: 右击Panel节点， 在弹出菜单中选择“附加脚本(Attach Script)”:
zh_tw: 右鍵點擊 Panel 節點，然後在右鍵選單中選擇 [附加腳本]：

source: The script creation dialog will pop up. This dialog allows you to set the script's language, class name, and other relevant options.
cs: Otevře se dialogové okno pro vytvoření skriptu. Toto dialogové okno umožňuje nastavit jazyk skriptu, název třídy a další relevantní možnosti.
de: Es erscheint ein Dialogfenster um Skripte zu erstellen. Dieser Dialog erlaubt die Auswahl der Skriptsprache, Klassenname und weitere relevante Optionen.
es: Aparecerá el cuadro de diálogo de creación del script. Este cuadro de diálogo permite definir el idioma del script, nombre de la clase y otras opciones relevantes.
fi: Skriptinluonti-ikkuna aukeaa. Tässä ikkunassa voit asettaa skriptin kielien, luokan nimen ja muita oleellisia asetuksia.
fr: La boîte de dialogue de création de script apparaîtra. Cette boîte de dialogue vous permet de définir le langage du script, le nom de la classe et d'autres options.
it: Apparirà la finestra di creazione dello script. Questa finestra ti permetterà di impostare il linguaggio dello script, il nome della classe e altre opzioni pertinenti.
ja: スクリプト作成ダイアログが表示されます。このダイアログボックスを使用すると、スクリプトの言語、クラス名、およびその他の関連するオプションを設定できます。
ko: 노드 스크립트 붙이기 대화 상자가 나타날 겁니다. 여기서 스크립트 언어, 클래스 명 및 기타 관련 옵션을 설정할 수 있습니다.
pl: Pojawi się okno dialogowe tworzenia skryptu. To okno dialogowe umożliwia ustawienie języka skryptu, nazwy klasy i innych opcji.
pt_br: O diálogo de criação de roteiro irá aparecer. Este diálogo permite configurar a linguagem do roteiro, o nome da classe e outras opções relevantes.
ru: Откроется диалоговое окно создания сценария. В этом диалоговом окне вы можете указать язык сценария, имя класса и другие параметры.
uk: З'явиться діалогове вікно створення скрипту. Це діалогове вікно дозволяє встановити мову скрипту, назву класу та інші відповідні параметри.
zh_cn: 脚本创建对话框会弹出。这个对话框允许您设置脚本语言、类名和其它相关选项。
zh_tw: 接著會彈出腳本建立視窗。在這個視窗裡可以設定腳本所使用的語言、類別名稱以及其他相關設定。

source: In GDScript the file itself represents the class, so the class name field is not editable.
de: In GDScript bestimmt der Dateiname die Klasse, daher ist der Klassenname nicht editierbar.
ru: В GDScript сам файл представляет собой класс, поэтому поле имени класса не редактируется.

source: The node we're attaching the script to is a panel, so the Inherits field will automatically be filled in with "Panel". This is what we want, as the script's goal is to extend the functionality of our panel node.
cs: Uzel, ke kterému připojujeme skript, je Panel, takže pole Dědí z bude automaticky vyplněno „Panel“. To chceme, protože cílem skriptu je rozšířit funkčnost našeho uzlu Panel.
de: Wir fügen das Skript zu dem Node Panel hinzu, weshalb das Vererbungsfeld "Erbt" automatisch mit "Panel" gefüllt wurde. In diesem Fall ist dies erwünscht, da unser Skript eine funktionale Erweiterung von Panel ist.
es: El nodo al que estamos añadiendo el script es un panel, por lo que el campo ``Hereda`` se rellenará automáticamente con "Panel". Esto es lo que queremos, ya que el objetivo del script es ampliar la funcionalidad de nuestro nodo panel.
fi: Solmu, johon olemme liittämässä skriptiä, on paneeli, joten Perii-kenttään täytetään automaattisesti "Panel". Näin haluammekin, sillä skriptin tavoite on laajentaa paneelisolmumme toiminnallisuutta.
fr: Le nœud auquel nous attachons le script est un panneau, donc le champ "hérite" sera automatiquement rempli avec "Panneau". C'est ce que nous voulons, car le but du script est d'étendre la fonctionnalité de notre nœud panneau.
it: Il nodo al quale stiamo attaccando lo script è un pannello, quindi il campo Eredita si riempirà automaticamente con "Pannello". Questo è quello che vogliamo, dato che l'obiettivo dello script è quello di estendere le funzionalità del nostro nodo.
ja: スクリプトをアタッチするノードはパネルなので、[継承] フィールドには自動的に「Panel」が入力されます。スクリプトの目的は、パネルノードの機能を拡張することです。
ko: 스크립트를 연결할 노드는 패널이므로 상속받는 위치는 "Panel"로 자동으로 채워집니다. 스크립트의 목표가 패널 노드의 기능을 확장하는 것이기 때문에, 이것이 우리가 원하는 것입니다.
pl: Węzeł, do którego dołączamy skrypt, jest typu Panel, więc pole dziedziczenia zostanie automatycznie wypełnione przyciskiem "Panel". Tego właśnie chcemy, ponieważ celem skryptu jest rozszerzenie funkcjonalności naszego węzła.
pt_br: O nó a que estamos anexando o arquivo é um painel, então o campo ``Herda de`` será preenchido automaticamente com "Panel". Isso é o que queremos, já que o objetivo do roteiro é estender a funcionalidade do nosso nó painel.
ru: Узел, к которому мы прикрепляем сценарий, представляет собой панель, поэтому в поле "Наследование" будет автоматически вписано "Panel". Это то, что нам нужно, поскольку цель сценария заключается в расширении функциональности нашего узла панели.
uk: Вузол, до якого ми приєднуємо скрипт, - це панель, тому поле "Успадковує" автоматично буде вписано «Panel». Цього ми і хочемо, оскільки мета скрипту - розширити функціональність нашого панельного вузла.
zh_cn: 我们要附加脚本的节点是个Panel(面板)，所以继承一栏会被自动填入“Panel”。这是我们想要的，因为脚本的目的就是扩展这个面板节点的功能。
zh_tw: 我們正在把腳本附加到 Panel 節點上，所以 [繼承] 欄位會自動填寫為「Panel」。我們在做的正是使用腳本來擴充 Panel 節點的功能。

source: Finally, enter a path name for the script and select Create:
cs: Nakonec zadejte cestu ke skriptu a vyberte Vytvořit:
de: Wähle einen Dateinamen für das Skript und klicke auf "Erstellen":
es: Finalmente, introduce un nombre de ruta para el script y haz clic en Crear:
fi: Lopuksi, syötä skriptille polun nimi ja valitse Lataa:
fr: Enfin, saisissez un nom de chemin pour le script et sélectionnez Créer :
it: Infine, inserisci un percorso per lo script e seleziona Crea:
ja: 最後に、スクリプトのパス名を入力し、「作成」を選択します:
ko: 마지막으로 스크립트 경로 이름을 입력하고 생성을 선택합니다:
pl: Na koniec wprowadź ścieżkę dla skryptu i wybierz Utwórz:
pt_br: Finalmente, informe o nome do caminho para o roteiro e selecione Criar:
ru: Наконец, введите путь к сценарию и нажмите кнопку "Создать":
uk: Нарешті, введіть назву шляху до скрипту та натисніть Створити:
zh_cn: 最后，输入脚本的路径名然后选择新建(Create):
zh_tw: 最後，輸入腳本路徑然後點擊 [建立]：

source: The script will then be created and added to the node. You can see this as an "Open script" icon next to the node in the Scene tab, as well as in the script property under Inspector:
cs: Skript bude poté vytvořen a přidán do uzlu. Můžete to vidět jako ikonu „Otevřít skript“ vedle uzlu na kartě Scéna a také ve vlastnosti skriptu v Inspektoru:
de: Damit wird das Skript erstellt und zu dem Node Panel hinzugefügt. Dies ist ersichtlich an dem "Skript öffnen"-Symbol rechts von Panel im Szenenbaum und als Skripteigenschaft im Inspektortab:
es: A continuación, se creará el script y se añadirá al nodo. Puedes ver esto como un icono de "Abrir script " al lado del nodo en la pestaña Escena, así como en la propiedad del script en el Inspector:
fi: Tämän jälkeen skripti luodaan ja liitetään solmuun. Voit nähdä tämän solmun vieressä olevana "avoimen käärön" ikonina Skene-välilehdellä, kuten myös Script-ominaisuutena Tarkastelussa:
fr: Le script sera alors créé et ajouté au nœud. Vous pouvez voir ceci par une icône "Ouvrir le script" à côté du nœud dans l'onglet Scène, ainsi que dans la propriété script dans l'Inspecteur :
it: Lo script verrà quindi creato e aggiunto al nodo. Puoi vederlo rappresentato come un'icona "Apri Script" affianco al nodo nella tab "Scene", così come nelle proprietà dello script in Inspector:
ja: その後、スクリプトが作成され、ノードに追加されます。これは、シーンタブのノードの横にある「スクリプトを開く」アイコンと、インスペクタの下のスクリプトプロパティで表示されます:
ko: 그런 다음 스크립트가 생성되어 노드에 추가됩니다. 이 아이콘은 씬 탭의 노드 옆에 있는 "스크립트 열기" 아이콘 뿐만 아니라 인스펙터 아래에 스크립트 속성에서도 볼 수 있습니다:
pl: Skrypt zostanie utworzony i dodany do węzła. Możesz to zobaczyć jako ikonę "Otwórz skrypt" obok węzła w zakładce Scena, jak również we właściwościach skryptu pod Inspektorem:
pt_br: O roteiro será, então, criado e adicionado ao nó. Você pode vê-lo com um ícone "Abrir script" ao lado do nó na aba Cena, assim como na propriedade Script no Inspetor:
ru: После этого сценарий будет создан и добавлен к узлу. Вы можете понять это по значку "Открыть сценарий" рядом с узлом на вкладке "Сцена", а также в свойстве сценария в "Инспекторе":
uk: Скрипт буде створений і доданий до вузла. Ви можете бачити його, як значок "Відкрити скрипт" поруч із вузлом на вкладці Сцена, а також у властивості скрипт в Інспекторі:
zh_cn: 脚本会被创建并将添加至Panel节点上。您可以通过场景选项卡中节点旁边的“打开脚本”图标或属性面板中的Script属性来查看这个脚本:
zh_tw: 新增腳本後會腳本被附加到節點上。在場景分頁裡的節點旁邊會出現「打開腳本」圖示，屬性面板裡的腳本 (Script) 屬性也可以看到相同的選項：

source: To edit the script, select either of these buttons, both of which are highlighted in the above image. This will bring you to the script editor where a default template will be included:
de: Um das Skript zu bearbeiten, wähle eine der erwähnten Schlatflächen, welche im obigen Bild hervorgehoben wurden. Dies wird den Skripteditor mit einer Standardvorlage anzeigen:
ru: Чтобы отредактировать сценарий, нажмите одну из кнопок, которые отмечены в приведенном выше изображении. Это приведет вас к редактору сценариев, в котором будет отображен шаблон сценария по умолчанию:

source: There's not much there. The ``_ready()`` function is called when the node, and all its children, enters the active scene. **Note:** ``_ready()`` is not the constructor; the constructor is instead ``_init()``.
cs: Není toho moc. Funkce ``_ready()`` se volá, když uzel a všechny jeho potomci vstoupí do aktivní scény. **Poznámka:** ``_ready()`` není konstruktor; konstruktorem je ``_init()``.
de: Die Standardvorlage enthält recht wenig. Die ``_ready()``-Funktion wir aufgerufen, wen das Node und alle seine Unterobjekt in die aktive Szene eintreten. **Beachte:** ``_ready()`` ist kein Konstruktor, der Konstruktor ist ``_init()``.
es: No hay mucho allí. La función ``_ready()`` se llama cuando el nodo, y todos sus hijos, entran a la escena activa. **Nota:** ``_ready()`` no es el constructor, ese es ``_init()``.
fi: Siinä ei ole paljoakaan valmiina. ``_ready()`` funktiota kutsutaan, kun solmu ja kaikki sen alisolmut lisätään aktiiviseen skeneen. **Huom:** ``_ready()`` ei ole luokan konstruktori; konstruktori on sen sijaan ``_init()``.
fr: Il n'y a pas grand-chose. La fonction ``_ready()`` est appelée lorsque le nœud et tous ses enfants entrent dans la scène active. **Note** : ``_ready()`` n'est pas le constructeur ; le constructeur est ``_init()``.
it: Non c'è molto qui. La funzione ``_ready()`` è chiamata quando il nodo, e tutti i suoi figli, entrano nella scena attiva. **Nota:** ``_ready()`` non è il costruttore; il costruttore è invece ``_init()``.
ja: テンプレートの内容はそれほど多くはありません。 ``_ready()`` 関数は、ノードとそのすべての子がアクティブなシーンに入ると呼び出されます。\ **注:**\ ``_ready()`` はコンストラクタではありません。コンストラクタは ``_init()`` です。
ko: 안에는 많은 내용이 있지 않습니다. ``_ready()`` 함수는 노드와 모든 자식들이 활성화된 씬으로 들어갈 때 호출됩니다. **참고:** ``_ready()`` 는 생성자가 아닙니다. 대신에 생성자는 ``_init()`` 입니다.
pl: Niewiele jest tam do zrobienia. Funkcja ``ready()`` jest wywoływana, gdy węzeł i wszystkie jego dzieci wejdą w aktywną scenę. **Wyjaśnienie:** ``_ready()`` nie jest konstruktorem; zamiast tego konstruktorem jest ``_init()``.
pt_br: Não há muito por aqui. A função ``_ready()`` é chamada quando o nó, e todos os seus filhos, entrar na cena ativa. **Nota:** ``_ready()`` não é um construtor; o construtor é, na verdade, a função ``_init()``.
ru: Там не так много. Функция ``_ready()`` вызывается, когда узел и все его дочерние элементы входят в активную сцену. **Примечание:** ``_ready()`` не является конструктором; конструктором является ``_init()``.
uk: Там не так багато. Функція ``_ready()`` викликається , коли вузол, і всі його нащадки, входять в активну сцену. **Примітка:** ``_ready()`` не є конструктором; конструктором є ``_init()``.
zh_cn: 这里没有多少内容。 ``_ready()`` 函数在节点及其所有子节点进入活动场景时调用。 **注意:** ``_ready()`` 并不是构造器；构造器是 ``_init()``。
zh_tw: 這裡沒很多東西。節點及其所有子節點進入有效場景後會呼叫 ``_ready()`` 函式。 **請注意：** ``_ready()`` 不是建置函式，建置函式是 ``_init()`` 。

source: The role of the script
cs: Role skriptu
de: Die Rolle des Skriptes
es: El papel del script
fi: Skriptin rooli
fr: Le rôle du script
it: Il ruolo dello script
ja: スクリプトの役割
ko: 스크립트의 역할
pl: Rola skryptu
pt_br: O papel do roteiro
ru: Роль сценария
uk: Роль скрипту
zh_cn: 脚本的作用
zh_tw: 腳本的功能
