Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/signals.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: On the bottom of the window is a field labeled "Method In Node". This is the name of the function in the target node's script that you want to use. By default, Godot will create this function using the naming convention ``_on_<node_name>_<signal_name>`` but you can change it if you wish.
de: Am unteren Rand des Fensters befindet sich ein Feld mit der Bezeichnung "Methode im Knoten". Dies ist der Name der Funktion im Skript des Zielknotens, die Sie verwenden möchten. Standardmäßig erstellt Godot diese Funktion mit der Namenskonvention ``_on_<node_name>_<signal_name>``, aber Sie können sie ändern, wenn Sie möchten.
es: En la parte inferior de la ventana hay un campo llamado "Método en nodo". Este es el nombre de la función en el script del nodo destino que quieres usar. Por defecto, Godot va a crear esta función usando ``_on_<node_name>_<signal_name>`` pero se puede cambiar si asi lo desea.
fr: Au bas de la fenêtre se trouve un champ intitulé "Méthode en Noeud". Il s'agit du nom de la fonction que vous souhaitez utiliser dans le script du nœud cible. Par défaut, Godot créera cette fonction en utilisant la convention de dénomination ``_on_<nom_nœud>_<nom_signal>`` mais vous pouvez la modifier si vous le souhaitez.
ko: 창의 아래쪽을 보시면 "Method In Node"라고 적혀있는 영역이 있습니다. 대상 노드의 스크립트에서 이것을 함수 이름으로 사용합니다. 기본적으로, Godot는 명명 규칙에 따라 ``_on_<노드이름>_<시그널이름>``\ 으로 함수 이름을 만들지만 원한다면 바꿀 수 있습니다.
ru: В нижней части окна находится поле с надписью "Method In Node". Это имя функции в скрипте данного узла, который требуется использовать. По умолчанию Godot создаст эту функцию, используя соглашение об именовании ``_on_<node_name>_<signal_name>``, но вы можете изменить его, если хотите.
zh_cn: 在窗口的底部有一个“节点中的方法”标签。这是您在目标节点脚本中要使用的函数名。默认情况下，Godot将会按命名规则' ' _on_<node_name>_<signal_name> ' ' '创建这个函数，但您可以按您的意愿更改它。

source: Click "Connect" and you'll see that the function has been created in the script:
cs: Klikněte na "Připojit" a uvidíte, že ve skriptu byla vytvořena funkce:
de: Klicke auf "Verbinden" und du siehst, dass die Funktion im Skript erstellt wurde:
es: Haz click en "Conectar" y verás que la función se creo en el script:
fi: Napsauta "Connect"-painiketta ja voit nähdä, että skriptiin on luotu funktio:
fr: Cliquez sur "Connecter" et vous verrez que la fonction a été créée dans le script :
it: Clicca "Connetti" e vedrai che la funzione è stata creata nello script:
ja: 「接続」をクリックすると、スクリプトで関数が作成されたことがわかります:
ko: "연결"을 클릭하면 스크립트 안에 함수가 만들어진 것을 볼 수 있습니다:
pl: Naciśnij przycisk "Połącz". Możesz zobaczyć, że funkcja została utworzona w skrypcie:
pt_br: Clique em "Conectar" e você verá que a função foi criada no script:
ru: Нажмите кнопку "Присоединить", и вы увидите, что функция была создана в скрипте:
uk: Натисніть "З’єднати", і ви побачите, що функція була створена в скрипті:
zh_cn: 单击“Connect”，您将看到该函数已在脚本中创建:
zh_tw: 點擊 [連接] 後，就可以看到腳本中建立了函式：

source: Now we can replace the placeholder code with whatever code we want to run when the signal is received. Let's make the Sprite blink:
cs: Nyní můžeme nahradit pass jakýmkoli kódem, který chceme spustit, když je signál přijat. Ať Sprite mrkne:
de: Jetzt können wir den Platzhalter Code mit beliebigem Code ersetzen, den wir beim Empfangen des Signals ausführen möchten. Lasst uns die Sprite zum Blinzeln bringen:
es: Ahora podemos reemplazar el código de relleno con cualquier código que queramos ejecutar cuando se reciba la señal. Hagamos que el Sprite parpadee:
fi: Nyt oletuskoodi voidaan korvata millä tahansa koodilla, jonka haluamme signaalia vastaanottaessa suorittaa. Laitetaan kuvake välkkymään:
fr: Nous pouvons maintenant remplacer le code de l’espace réservé par le code que nous souhaitons exécuter à la réception du signal. Faisons clignoter le Sprite :
it: Ora possiamo sostituire il codice segnaposto con qualsiasi codice vogliamo eseguire quando il segnale viene ricevuto. Facciamo "lampeggiare" lo sprite:
ja: これで、仮置きのコードを、シグナルの受信時に実行したいコードに置き換えることができます。 スプライトを点滅させましょう:
ko: 이제 자리 표시자 코드는 시그널을 받게 되면 실행시키길 원하는 어떤 코드든지 변환될 수 있습니다. 스프라이트 깜박임을 만들어 봅시다:
pl: Teraz możemy zastąpić tymczasowy kod jakimkolwiek innym, który ma być uruchomiony w momencie odebrania sygnału. Spowodujmy, żeby węzeł Sprite zaczął migać:
pt_br: Agora podemos substituir o código placeholder com qualquer código que deseja executar quando o sinal for recebido. Vamos fazer o Sprite piscar:
ru: Теперь мы можем заменить изначальный код на любой код, который мы хотим запустить при получении сигнала. Давайте заставим спрайт мигать:
uk: Тепер ми можемо замінити початковий код на будь-який код, який ми хочемо запустити, коли сигнал буде отриманий. Давайте змусимо Спрайт блимати:
zh_cn: 现在，我们可以将占位符代码替换为接收到信号时要运行的任何代码。让我们让精灵闪烁:
zh_tw: 現在我們可以把預設代入的程式碼改成收到訊號後要執行的程式。來讓 Sprite 閃爍一下：

source: Run the scene and you'll see the Sprite blinking on and off every second. You can change the Timer's *Wait Time* property to alter this.
cs: Spusťte scénu a každou sekundu uvidíte jak Sprite blikne. Chcete-li prodlevu změnit, změňte vlastnost časovače *Čekací doba*.
de: Führen Sie die Szene aus und Sie werden sehen, wie das Sprite jede Sekunde blinkt. Sie können die Eigenschaft *Wartezeit* des Timers ändern, um dies zu verändern.
es: Ejecuta la escena y verás parpadear al Sprite a cada segundo. Puedes cambiar la propiedad *Wait Time* para cambiar el resultado de este.
fi: Aja skene ja näet, että kuvake välkkyy sekunnin välein. Ajoitusta voi muuttaa Timer-solmun *Wait Time*-ominaisuudella.
fr: Exécutez la scène et vous verrez le Sprite clignoter à chaque seconde. Vous pouvez modifier la propriété *Temps d'Attente* du temporisateur pour modifier cela.
it: Esegui la scena e vedrai lo Sprite che lampeggia ogni secondo. Puoi cambiare il *Tempo di Attesa* del Timer nelle proprietà per alterare questa funzionalità.
ja: シーンを実行すると、スプライトが1秒ごとに点滅します。 これを変更するには、タイマーの\ *Wait Time*\ プロパティを変更します。
ko: 씬을 실행하면 Sprite가 매 초마다 깜박이는 것을 볼 수 있습니다. Timer의 *Wait Time* 속성을 변경하여 주기를 변경할 수 있습니다.
pl: Odtwórz scenę i zwróć uwagę, że węzeł Sprite miga z każdą sekundą. Można kontrolować czas migotania przy użyciu właściwości *Czas oczekiwania*, należącej do węzła Timer.
pt_br: Execute a cena e você verá o Sprite ligando e desligando a cada segundo. Você pode mudar a propriedade *Wait Time* do temporizador para alterar isso.
ru: Запустите сцену, и вы увидите что спрайт мигает и пропадает каждую секунду. Можно изменить свойство таймера *Wait Time*, чтобы изменить частоту мигания.
uk: Запустіть сцену, і ви побачите що Спрайт блимає. Ви можете змінити властивість таймера *Wait Time* (час очікування), щоб змінити час блимання.
zh_cn: 运行这个场景，您会看到精灵每秒钟都在闪烁。您可以更改计时器的 *等待时间* 属性来改变这一点。
zh_tw: 執行場景後就看到 Sprite 一秒閃爍一次。可以修改 Timer 的 **Wait Time** (等待時間) 屬性來更改頻率。

source: Connecting signals in code
cs: Připojení signálů v kódu
de: Signale im Code verbinden
es: Conectar señales en código
fi: Signaalien yhdistäminen koodin kautta
fr: Connecter des signaux dans le code
it: Collegamento di segnali nel codice
ja: コード内でシグナルをを接続する
ko: 노드에서 시그널 연결하기
pl: Podłączanie sygnałów z poziomu kodu
ru: Подключение сигналов в коде
uk: Підключення сигналів у коді
zh_cn: 连接代码中的信号
zh_tw: 使用程式碼來連接訊號

source: You can also make the signal connection in code rather than with the editor. This is usually necessary when you're instancing nodes via code and so you can't use the editor to make the connection.
cs: Připojení signálu můžete také uskutečnit v kódu, nikoliv v editoru. To je obvykle nutné, když vytváříte instance uzlů pomocí kódu a propojení editorem tedy nelze použít.
de: Sie können die Signalverbindung auch im Code und nicht mit dem Editor herstellen. Dies ist normalerweise notwendig, wenn Sie Knoten über Code instanziieren und daher nicht den Editor verwenden können, um die Verbindung herzustellen.
es: También puedes puedes hacer la conexión de señal (signal connection), en código en vez de usar el editor. Esto, por lo general, es necesario cuando estás creando nodos así que no puedes usar el editor para hacer la conexión.
fi: Signaaleja voi yhdistää koodilla editorin sijaan. Tämä on usein tarpeen, kun solmuille luodaan ilmentymiä koodin kautta, eikä yhteyksiä voida luoda editorin avulla.
fr: Vous pouvez également établir la connexion du signal en code plutôt qu'avec l'éditeur. Cela est généralement nécessaire lorsque vous installez des nœuds via du code et vous ne pouvez donc pas utiliser l'éditeur pour établir la connexion.
it: Puoi anche connettere i segnali da codice invece che dall'editor. Questo è di solito necessario quando stai instanziando nodi da codice e quindi non puoi usare l'editor per fare la connessione.
ja: エディタではなくコードでシグナル接続を行うこともできます。 これは通常、コードを介してノードをインスタンス化するときに必要であり、エディタを使用して接続することはできません。
ko: 에디터에서 뿐만 아니라 코드에서도 시그널 연결을 만들 수 있습니다. 보통은 코드를 통해 노드를 인스턴스할 때 필요하기 때문에 에디터에서 이런 시그널 연결을 만들 수는 없습니다.
pl: Możesz także połączyć sygnał z poziomu kodu zamiast w edytorze. Jest to zazwyczaj niezbędne przy korzystaniu z Węzłów tworzonych w kodzie, w takim przypadku użycie edytora do stworzenia połączenia jest niemożliwe.
ru: Вы также можете присоединить сигнал в коде, а не в редакторе. Это обычно необходимо при создании экземпляров узлов с помощью кода и поэтому невозможно использовать редактор для подключения.
uk: Ви також можете при'єднати сигнал в коді, а не з редактора. Зазвичай це потрібно, коли ви створюєте екземпляри вузлів за допомогою коду, і тому ви не можете використовувати редактор для встановлення з'єднання.
zh_cn: 您还可以在代码中进行信号连接而不是在编辑器中。当您通过代码实例化节点时，您并不能使用编辑器进行连接，因此这通常是必要的。
zh_tw: 除了使用編輯器界面，也可以使用程式碼來建立訊號連接。如果用程式碼來實體化節點的話，通常也必須使用程式碼來建立訊號連接，因為這種情況下沒辦法用編輯器界面。

source: First, disconnect the signal by selecting the connection in the Timer's "Node" tab and clicking disconnect.
cs: Nejprve odpojte signál výběrem připojení na kartě časovače „Uzel“ a kliknutím na tlačítko Odpojit.
de: Trennen Sie zunächst das Signal, indem Sie die Verbindung auf der Registerkarte "Knoten" des Timers auswählen und auf Trennen klicken.
es: Primero, desconecta la señal seleccionando la conexión en la pestaña "Node" del temporizador (Timer), y haz click en desconectar (disconnect).
fi: Irrota ensin signaali valitsemalla yhteys Timer-solmun "Node"-välilehdessä ja napsauttamalla "Disconnect"-painiketta.
fr: Commencez par déconnecter le signal en sélectionnant la connexion dans l'onglet "Nœud" de la minuterie et en cliquant sur Déconnecter.
it: Per prima cosa, sconnetti il segnale selezionando la connessione nella tab "Node" del nodo timer e fai click su sconnetti.
ja: まず、タイマーの[ノード]タブで接続を選択し、[切断]をクリックして、シグナルを切断します。
ko: 먼저, Timer의 "노드" 탭에서 연결 끊기를 클릭해서 시그널의 연결을 풉니다.
pl: Najpierw odłącz sygnał wybierając połączenie z zakładki "Węzeł", należącej do węzła Timer i kliknij *odłącz*.
pt_br: Primeiro, desconecte o sinal selecionando a conexão na aba "Nó" do timer e clicando em desconectar.
ru: Во-первых, отключите сигнал, выбрав подключенный сигнал таймера на вкладке "Узел" и нажав Отсоединить.
uk: По-перше, відключіть сигнал, вибравши підключений сигнал таймера на вкладці "Вузол" та натиснувши Роз'єднати.
zh_cn: 首先，在计时器的“节点”选项卡中选中’链接‘，并单击’断开连接‘来断开信号。
zh_tw: 首先，要先把 Timer 的訊號斷開。選擇 Timer 節點後，打開 [節點] 分頁，選擇連接並點擊 [中斷]。

source: To make the connection in code, we can use the ``connect`` function. We'll put it in ``_ready()`` so that the connection will be made on run. The syntax of the function is ``<source_node>.connect(<signal_name>, <target_node>, <target_function_name>)``. Here is the code for our Timer connection:
cs: Pro navázání spojení v kódu použijeme funkci ``connect``. Vložíme ji do ``_ready()``, aby se spojení navázalo při spuštění. Syntaxe funkce je ``<source_node>.connect(<signal_name>,<target_node>,<target_function_name>)``. Zde je kód pro naše připojení časovače:
es: Para realizar la conexión en código, podemos usar la función ``connect``. La establecemos en ``_ready()`` para que la conexión se cree en ejecución. La sintaxis de la función es ``<source_node>.connect(<signal_name>, <target_node>, <target_function_name>)``. Aquí está el código para la conexión de nuestro Timer:
fi: Yhteyden muodostaminen koodilla onnistuu ``connect``-funktion avulla. Laitetaan se ``_ready()``-funktioon, jotta yhteys muodostetaan ajon aikana. Funktion syntaksi on muodossa ``<lähdesolmu>.connect(<signaalin_nimi>, <kohdesolmu>, <kohdefunktion_nimi>)``. Timer-solmun yhteyden koodi näyttää tältä:
fr: Pour établir la connexion en code, nous pouvons utiliser la fonction ``connecter``. Nous allons la mettre dans `_ready()` `afin que la connexion soit établie lors de l'exécution. La syntaxe de la fonction est ``<nœud_source>.connecter(<nom_signal>, <nœud_cible>, <nom_fonction_ cible>)``. Voici le code pour la connexion de notre minuterie :
it: Per creare la connessione da codice, possiamo utilizzare la funzione ``connect``. La inseriremo in ``_ready()`` cosi che la connessione venga creata durante l'esecuzione. La sintassi della funzione è ``<source_node>.connect(<signal_name>, <target_node>, <target_function_name>)``. Qui c'è il codice per la connessione del nostro Timer:
ja: コードで接続するために、\ ``connect``\ 関数を使用できます。接続が実行時に行われるように、その関数を\ ``_ready()``\ に入れます。関数の構文は ``<source_node>.connect(<signal_name>, <target_node>, <target_function_name>)`` です。タイマー接続のコードは次のとおりです:
ko: 코드에서 연결을 만들기 위해, ``connect`` 함수를 사용할 수 있습니다. ``_ready()``\ 안에 이 함수를 넣으면 연결을 실행하는 준비가 된 것입니다. 함수의 문법은 ``<소스_이름>.connect(<시그널_이름>, <대상_이름>, <대상_함수_이름>)``\ 입니다. 이것이 Timer 연결을 위한 코드입니다:
pl: Aby dodać połączenie z poziomu kodu, może skorzystać z funkcji ``connect``. Wstawimy tę funkcję do metody ``_ready()`` po to, żeby połączenie zostało nawiązane zaraz po uruchomieniu. Składnia tej funkcji wygląda następująco: ``<wezel_zrodlowy>.connect(<nazwa_sygnalu>, <docelowy_wezel>, <nazwa_funkcji_docelowej>)``. Poniżej znajduje się kod dla połączenia węzła Timer:
ru: Чтобы присоединить сигнал в коде, мы можем использовать функцию ``connect``. Мы поставим его в ``_ready()`` так, что соединение будет сделано сразу при запуске сцены. Синтаксис функции ``<source_node>.connect(<signal_name>, <target_node>, <target_function_name>)``. Вот код для подключения нашего таймера:
uk: Щоб встановити з'єднання в коді, ми можемо використовувати функцію ``connect``. Ми поставимо її в ``_ready()`` тому з'єднання буде здійснено при запуску. Синтаксис функції ``<сигнальний_вузол>.connect(<ім'я_сигналу>, <цільовий_вузол>, <ім'я_цільової_функції>)``. Ось код для підключення нашого таймера:
zh_cn: 要在代码中进行连接，我们可以使用 ``connect`` 函数。我们将把它放在 ``_ready()`` 函数中，这样连接就会在运行时进行。函数的语法是 ``<source_node>.connect(<signal_name>, <target_node>, <target_function_name>)`` 。下面是我们的计时器连接的代码:
zh_tw: 要使用程式碼建立連接，可以使用 ``connect`` 函式。我們寫在 ``_ready()`` 函式內，這樣一來連接就會在執行的時候建立。這個函式的語法是 ``<來源節點>.connect(<訊號名稱>, <目標節點>, <目標函式名稱>)`` 。下列程式碼會建立本例中的 Timer 連接：

source: Custom signals
cs: Vlastní signály
de: Benutzerdefinierte Signale
es: Señales personalizadas
fi: Mukautetut signaalit
fr: Signaux personnalisés
it: Segnali personalizzati
ja: カスタムシグナル
ko: 커스텀 시그널
pl: Niestandardowe sygnały
ru: Пользовательские сигналы
uk: Власні сигнали
zh_cn: 自定义信号
zh_tw: 自定訊號

source: You can also declare your own custom signals in Godot:
cs: V Godotu můžete také deklarovat své vlastní signály:
de: Sie können auch Ihre eigenen benutzerdefinierten Signale in Godot erzeugen:
es: También puedes declarar tus propia señales (signal) personalizadas dentro de Godot:
fi: Voit määritellä myös omia mukautettuja signaaleja Godotissa:
fr: Vous pouvez également déclarer vos propres signaux personnalisés dans Godot :
it: Puoi anche dichiarare i tuoi segnali personalizzati in Godot:
ja: Godotでは独自のカスタムシグナルを宣言することもできます:
ko: Godot에 당신의 커스텀 시그널을 선언할 수 있습니다:
pl: W Godot możesz także zadeklarować własne niestandardowe sygnały:
pt_br: Você também pode declarar seus próprios sinais na Godot:
ru: Вы также можете объявить свои собственные пользовательские сигналы в Godot:
uk: Ви також можете оголосити власні сигнали в Godot:
zh_cn: 您也可以在Godot中声明您的的自定义信号:
zh_tw: Godot 中可以宣告自定訊號：

source: Once declared, your custom signals will appear in the Inspector and can be connected in the same way as a node's built-in signals.
cs: Po deklaraci se vaše vlastní signály se objeví v inspektoru a lze je připojit stejným způsobem jako vestavěné signály uzlu.
de: Nach der Deklaration erscheinen Ihre benutzerdefinierten Signale im Inspektor und können wie die eingebauten Signale eines Knotens verbunden werden.
es: Una vez declaradas, tus señales (signal) personalizadas aparecerán en el Inspector y podrán ser conectadas de la misma forma que las señales integradas del nodo.
fi: Kun mukautetut signaalit on määritelty, ilmestyvät ne myös Inspector-välilehteen ja niitä voidaan yhdistää solmun sisäänrakennettujen signaalien tavoin.
fr: Une fois déclarés, vos signaux personnalisés apparaîtront dans l'inspecteur et pourront être connectés de la même manière que les signaux intégrés d'un nœud.
it: Una volta dichiarati, i tuoi segnali personalizzati appariranno nell'Ispettore e potranno essere connessi nello stesso modo di un segnale pre-costruito.
ja: 一度宣言すると、カスタムシグナルがインスペクタに表示され、ノードの組み込みシグナルと同じ方法で接続できます。
ko: 시그널은 선언하면, 커스텀 시그널은 인스펙터에 나타나고 노드의 내장 시그널과 같은 방식으로 연결할 수 있습니다.
pl: Raz zadeklarowane, twoje niestandardowe sygnały pojawią się w Inspektorze i będą mogły być podłączone w taki sam sposób jak sygnały wbudowane w węzeł.
pt_br: Quando declarado, seus sinais personalizados aparecerão no Inspetor e podem ser conectados da mesma forma que os sinais pré-incorporados em um node.
ru: После объявления ваши пользовательские сигналы будут появляться в инспекторе и могут быть соединены так же, как и встроенные сигналы узла.
uk: Після оголошення ваші сигнали з'являться в Інспекторі і можуть бути підключені так само, як і вбудовані сигнали вузла.
zh_cn: 一旦声明，您的自定义信号就会出现在属性面板中，并且可以用与节点内置信号以相同的方式进行连接。
zh_tw: 宣告後，自定訊號會出現在屬性面板上，並可以用與內建訊號相同的方式建立連接。

source: To emit a signal via code, use the ``emit`` function:
de: Um ein Signal per Code auszusenden, verwenden Sie die Funktion ``emit``:
es: Para emitir una señal por código, usa la función ``emit``:
fr: Pour émettre un signal par le code, utilisez la fonction ``emit`` :
ko: 코드를 통해 시그널을 방출하기 위해선, ``emit`` 함수를 사용합니다:
pt_br: Para emitir um sinal por código, use a função ``emit``:
ru: Чтобы выпустить сигнал через код, используйте функцию ``emit``:
zh_cn: 要通过代码发出信号，使用 ``emit`` 函数:

source: Shooting example
es: Ejemplo de disparos
fr: Exemple de tir :
ko: 발사 예제
ru: Пример стрельбы
zh_cn: 射击示例

source: As another example of signal usage, let's consider a player character that can rotate and shoot towards the mouse. Every time the mouse button is clicked, we create an instance of the bullet at the player's location. See :ref:`doc_instancing` for details.
de: Als ein weiteres Beispiel für die Signalverwendung betrachten wir einen Spielercharakter, der sich drehen und auf die Maus schießen kann. Jedes Mal, wenn die Maustaste gedrückt wird, erstellen wir eine Instanz der Kugel am Standort des Spielers. Siehe :ref:`doc_instancing` für Details.
es: Como otro ejemplo de uso de señales, consideremos un personaje que pueda rotar y disparar en dirección al ratón. Cada vez que el botón del ratón sea presionado, creamos una instancia de la bala en la localización del jugador. Vea :ref:`doc_instancing` para más detalles.
fr: Comme autre exemple d’utilisation du signal, considérons un personnage qui peut pivoter et tirer vers la souris. Chaque fois que vous cliquez sur le bouton de la souris, nous créons une instance de la balle à l'emplacement du joueur. Voir :ref:`doc_instancing` pour plus de détails.
ko: 시그널 사용의 다른 예제로, 마우스 방향으로 회전하며 발사할 수 있는 플레이어를 생각해봅시다. 마우스 버튼을 클릭할 때 마다, 플레이어의 위치에 총알의 인스턴스를 만듭니다. 자세한 설명은 :ref:`doc_instancing`\ 를 참고하세요.
pt_br: Um outro exemplo de uso de sinal, vamos considerar um personagem que pode girar e atirar na direção do mouse. Toda vez que o botão do mouse é clicado, nós criamos uma instância da bala na posição do player. Veja:ref:`doc_instancing` para mais detalhes.
ru: В качестве еще одного примера использования сигналов, давайте рассмотрим персонажа игрока, который может вращаться и стрелять по направлению к мыши. Каждый раз при нажатии кнопки мыши мы создаем экземпляр пули в местоположении игрока. См. :ref:`doc_instancing` для получения дополнительной информации.
zh_cn: 作为信号使用的另一个示例，让我们考虑一个可以旋转并向鼠标射击的游戏角色角色。每次单击鼠标按钮，我们都会在游戏角色的位置创建子弹的实例。详情请参阅 :ref:`doc_instancing` 。

source: However, if the bullets are added as children of the player, then they will remain "attached" to the player as it rotates:
de: Wenn die Kugeln jedoch als Kinder des Spielers hinzugefügt werden, bleiben sie an den Spieler "gebunden", während er sich dreht:
es: Sin embargo, si las balas son añadidas como hijas del jugador, entonces permanecerán "ligadas" al jugador a medida que gira:
fr: Cependant, si les balles sont ajoutées en tant qu'enfants du joueur, elles resteront "attachées" au joueur lors de sa rotation :
ko: 하지만, 총알이 플레이어의 자식으로 추가된다면, 플레이어가 회전하는 것에 따라 "붙어있는 채로" 남아있을 것입니다:
pt_br: Entretanto, se as balas forem anexadas ao jogador, então elas continuarão "anexadas" ao jogador enquanto ele gira:
ru: Однако, если пули добавятся как дети игрока, то они останутся "привязанными" к тому как игрок вращается (нагляднее ниже):
zh_cn: 然而，如果子弹作为游戏角色的子节点添加，那么当它旋转时，子弹将仍然保持“附着”在游戏角色身上:

source: Instead, we need the bullets to be independent of the player's movement - once fired, they should continue traveling in a straight line and the player can no longer affect them. Instead of being added to the scene tree as a child of the player, it makes more sense to add the bullet as a child of the "main" game scene, which may be the player's parent or even further up the tree.
de: Stattdessen müssen die Kugeln unabhängig von der Bewegung des Spielers sein - einmal abgefeuert, sollten sie sich weiterhin in einer geraden Linie bewegen und der Spieler kann sie nicht mehr beeinflussen. Anstatt als Kind des Spielers in den Szenenbaum aufgenommen zu werden, ist es sinnvoller, die Kugel als Kind der "Haupt"-Spielszene hinzuzufügen, die entweder der Elternteil des Spielers oder sogar weiter oben im Baum sein kann.
es: En su lugar, necesitamos que las balas sean independientes del movimiento del jugador - una vez disparadas, deberían continuar viajando en línea recta y el jugador ya no puede afectarlas. En vez de ser añadidas al árbol de escenas como un hijo del jugador, tiene más sentido añadir la bala como un hijo de la escena de juego "principal", la cual puede ser el padre del jugador o incluso más arriba en el árbol.
fr: Au lieu de cela, nous avons besoin que les balles soient indépendantes du mouvement du joueur - une fois tirées, elles doivent continuer à voyager en ligne droite et le joueur ne peut plus les affecter. Au lieu d'être ajouté à l'arbre de la scène en tant qu'enfant du joueur, il est plus logique d'ajouter la balle en tant qu'enfant de la scène de jeu "principale", qui peut être le parent du joueur ou même plus haut dans l'arbre.
ko: 대신, 총알을 플레이어의 움직임에 독립하도록 해야 합니다 - 일단 발사가 되면, 플레이어가 그것에 영향을 주지 않고 직선으로 계속 나아가야 합니다. 플레이어의 자식으로 씬 트리에 추가하는 대신, 총알을 "메인" 게임 씬의 자식으로 추가하는 것이 더 합리적입니다, 이렇게 하면 총알이 플레이어의 부모나 더 위로 올라갈 수도 있습니다.
ru: Вместо этого, нам нужно чтобы пули были независимыми от движения игрока после выстрела, они должны продолжать движение по прямой линии, и игрок больше не должен влиять на них. Вместо того, чтобы быть добавлены к дереву сцены в качестве ребенка игрока, имеет больше смысла добавить пулю в качестве дочернего элемента "основной" игровой сцены, которая может быть родителем игрока или даже дальше выше по дереву сцен.
zh_cn: 相反，我们需要子弹独立于游戏角色的移动——一旦发射，子弹就会继续沿着直线运动，游戏角色就不能再影响它们了。与其作为游戏角色的子节点被添加到场景树中，不如将子弹作为“主”游戏场景的子节点添加上去更有意义，后者可能是游戏角色的父节点，甚至可能是更高层级的树。
