Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/signals.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: You could do this by adding the bullet directly:
de: Sie können dies tun, indem Sie die Kugel direkt hinzufügen:
es: Tu podrías hacer esto directamente agregando la bala:
fr: Vous pouvez le faire en ajoutant directement la balle :
ko: 총알에 직접 이 코드를 추가하는 것으로 가능합니다:
pt_br: Você pode fazer isso adicionando a bala diretamente:
ru: Это можно сделать, добавив пулю непосредственно к главной сцене:
zh_cn: 您可以通过直接添加子弹来做到这一点:

source: However, this will lead to a different problem. Now if you try and test your "Player" scene independently, it will crash on shooting, because there is no parent node to access. This makes it a lot harder to test your player code independently and also means that if you decide to change your main scene's node structure, the player's parent may no longer be the appropriate node to receive the bullets.
de: Dies führt jedoch zu einem anderen Problem. Wenn Sie nun versuchen, Ihre "Spieler"-Szene unabhängig voneinander zu testen, stürzt sie beim Schießen ab, da kein übergeordneter Knoten zum Zugriff vorhanden ist. Dies macht es viel schwieriger, Ihren Spieler-Code unabhängig zu testen und bedeutet auch, dass, wenn Sie sich entscheiden, die Knotenstruktur Ihrer Hauptszene zu ändern, das übergeordnete Element des Spielers möglicherweise nicht mehr der geeignete Knoten ist, um die Kugeln zu erhalten.
es: Sin embargo, esto conducirá a un problema diferente. Ahora, si intenta probar su escena "Player" de forma independiente, se bloqueará al disparar, porque no hay ningún nodo padre al que pueda acceder. Esto hace que sea mucho más difícil probar el código del jugador de forma independiente y también significa que si decides cambiar la estructura del nodo de la escena principal, es posible que el padre del jugador ya no sea el nodo apropiado para recibir las balas.
fr: Cependant, cela conduira à un problème différent. Maintenant, si vous essayez de tester votre scène "Player" de manière indépendante, elle se bloquera lors du tir, car il n’y a pas de nœud parent auquel accéder. Cela rend beaucoup plus difficile le test indépendant du code de votre joueur et signifie également que si vous décidez de modifier la structure des nœuds de votre scène principale, le parent du joueur risque de ne plus être le nœud approprié pour recevoir les balles.
ko: 그러나 이것은 다른 문제를 불러올 수 있습니다. 이제 "Player" 씬을 독립적으로 테스트해 보신다면, 액세스할 부모 노드가 없기 때문에, 발사를 할 때 팅길 것입니다. 이는 플레이어 코드를 독립적으로 테스트하기가 더 까다로울 뿐만 아니라, 메인 씬의 노드 구조를 바꾸기로 한다면 플레이어의 부모는 더 이상 총알을 받기에 적절한 노드가 아니게 됩니다.
ru: Однако это приведет к другой проблеме. Теперь, если вы запустите и протестируете саму сцену "Player", она аварийно завершится при выстреле, так как не существует родительского узла. Это намного усложняет возможность независимой проверки кода Игрока, а также означает, что если вы решите изменить структуру узла основной сцены, родитель сцены "Player" может больше не быть узлом, обрабатывающим попадание пуль.
zh_cn: 然而，这将导致一个不同的问题。现在如果您尝试独立测试您的“游戏角色”场景，它会在射击时崩溃，因为没有父节点可以访问。这使得独立测试游戏角色角色代码变得更加困难，也意味着如果您决定改变主场景的节点结构，游戏角色的父节点可能不再是接收子弹的合适节点。

source: The solution to this is to use a signal to "emit" the bullets from the player. The player then has no need to "know" what happens to the bullets after that - whatever node is connected to the signal can "receive" the bullets and take the appropriate action to spawn them.
es: La solución a esto es usar una señal para "emitir" las balas desde el jugador. El jugador entonces no tiene necesidad de "saber" qué pasa con las balas después de eso - cualquier nodo que esté conectado a la señal puede "recibir" las balas y tomar la acción apropiada para generarlas.
fr: La solution consiste à utiliser un signal pour "émettre" les balles du joueur. Le joueur n'a alors pas besoin de "savoir" ce qu'il advient des balles après cela. Quel que soit le nœud connecté au signal, il peut "recevoir" les balles et prendre les mesures appropriées pour les générer.
ko: 해결책은 플레이어로부터 총알을 "방출"하는 시그널을 사용하는 것입니다. 그렇게 하면 플레이어는 총알이 어떻게 되는지 "알" 필요가 없습니다 - 이 시그널에 연결된 어떤 노드라도 총알을 "받을" 수 있고 총알을 스폰하기 위한 적절한 행동을 취해줄 수 있습니다.
pt_br: A solução para isso é usar um sinal para "emitir" as balas do jogador. Com isso não há mais necessidade do jogador "saber" o que acontece com as balas depois de disparadas - qualquer nó que estiver conectado ao sinal pode "receber" as balas e tomar a ação apropriada para gerar elas.
ru: Решение заключается в использовании сигнала, сообщающего об "испускании" пули от игрока. Игроку не нужно "знать", что происходит с пулями. Узел подключенный сигналом может "получить" пули и предпринять соответствующие действия для их порождения.
zh_cn: 解决这个问题的方法是使用一个信号来“发射”游戏角色的子弹。游戏角色不需要“知道”子弹在那之后发生了什么——任何连接到信号的节点都可以“接收”子弹并采取适当的行动来产生它们。

source: Here is the code for the player using signals to emit the bullet:
es: Este es el código para el jugador usando señales para emitir la bala:
fr: Voici le code pour le joueur utilisant des signaux pour émettre la balle :
ko: 이것이 시그널을 사용해 플레이어가 총알을 방출하는 코드입니다:
pt_br: Aqui está o código para o jogador usar sinais para emitir a bala:
ru: Вот код для игрока с использованием сигналов для испускания пуль:
zh_cn: 下面是游戏角色使用信号发射子弹的代码:

source: In the main scene, we then connect the player's signal (it will appear in the "Node" tab).
es: En la escena princial, contectaremos la señal del jugador(aparecerá en la pestaña "Nodo").
fr: Dans la scène principale, nous connectons ensuite le signal du joueur (celui-ci apparaîtra dans l'onglet "Nœud").
ko: 메인 씬에서, 이제 플레이어의 시그널을 연결합니다 ("노드" 탭에 나타날 것입니다).
pt_br: Na cena principal, conectamos então o sinal do jogador (aparecerá na guia "Nó").
ru: В главной сцене, мы подключим сигнал игрока (он появится на вкладке "Узел").
zh_cn: 在主场景中，我们连接游戏角色的信号(它将出现在“Node”选项卡中)。

source: Now the bullets will maintain their own movement independent of the player's rotation:
es: Ahora las balas mantendrán su propio movimiento independiente de la rotación del jugador:
fr: Maintenant, les balles conserveront leur propre mouvement indépendamment de la rotation du joueur :
ko: 이제 총알은 움직임을 유지한 채로 플레이어의 회전에 독립을 유지할 것입니다:
pt_br: Agora as balas terão seu movimento conservado independente da rotação do jogador:
ru: Теперь пули будут продолжать свое собственное движение независимо от вращения игрока:
zh_cn: 现在子弹将保持自己的运动独立于游戏角色的旋转:

source: Conclusion
cs: Závěr
de: Fazit
es: Conclusión
fi: Lopputulos
it: Conclusione
ja: 結論
ko: 결론
pl: Wniosek
pt_br: Conclusão
ru: Вывод
uk: Висновки
zh_cn: 总结
zh_tw: 結論

source: Many of Godot's built-in node types provide signals you can use to detect events. For example, an :ref:`Area2D <class_Area2D>` representing a coin emits a ``body_entered`` signal whenever the player's physics body enters its collision shape, allowing you to know when the player collected it.
cs: Mnoho vestavěných typů uzlů Godota poskytuje signály, které můžete použít pro detekci událostí. Například :ref:`Area2D <class_Area2D>` představující minci vydává signál ``body_entered``, kdykoli tělo hráče (uzel Physicsbody) vstoupí do jejího kolizního tvaru, což vám umožní zaznamenat okamžik, kdy hráč minci sebere.
es: Muchos de los tipos de nodos incorporados en Godot proporcionan señales que puedes utilizar para detectar eventos. Por ejemplo, un :ref:`Area2D <class_Area2D>`, el cual representa una moneda, emite una señal del tipo ``body_entered`` cada vez que el cuerpo físico del jugador entra a su forma de colisión, permitiéndote saber cuando el jugador la ha recolectado.
fi: Monista Godotin valmiista solmutyypeistä löytyy signaaleja tapahtumien havaitsemiseen. Esimerkiksi kolikkoa ilmentävä :ref:`Area2D <class_Area2D>`-solmu lähettää ``body_entered`-signaalin kun pelihahmon fysiikkakappale siirtyy sen törmäysmuodon sisään. Tämän avulla saadaan selville milloin pelaaja on kerännyt kolikon.
fr: De nombreux types de nœuds intégrés de Godot fournissent des signaux que vous pouvez utiliser pour détecter des événements. Par exemple, un :ref:`Area2D <class_Area2D>` représentant une pièce de monnaie émet un signal ``body_entered`` chaque fois que le corps physique du joueur entre en collision avec, ce qui vous permet de savoir quand le joueur la récupère.
it: Tanti dei Nodi di Godot forniscono segnali che puoi usare per rilevare eventi. Per esempio, un :ref:`Area2D <class_Area2D>` che rappresenta una moneta emette un segnale ``body_entered`` quando il corpo del giocatore entra nella sua collision shape, facendoti capire quando il giocatore l'ha raccolta.
ja: Godotの組み込みノードタイプの多くは、イベントの検出に使用できる信号を提供します。 たとえば、コインの見た目をした\ :ref:`Area2D <class_Area2D>`\ は、プレイヤーの物理ボディが衝突形状(コリジョンシェイプ)に入るたびに ``body_entered`` シグナルを発し、プレイヤーがそれを収集したタイミングを知ることができます。
ko: Godot의 내장 노드 타입의 대다수는 이벤트를 감지하는 데 사용할 수 있는 시그널을 제공합니다. 예를 들어, 동전 하나를 나타내는 :ref:`Area2D <class_Area2D>`는 플레이어의 물리 바디가 충돌 모양에 들어갈 때마다 ``body_entered`` 시그널을 방출하며, 이를 통해 플레이어가 동전을 언제 먹었는 지를 알 수 있습니다.
pl: Godot ma wiele wbudowanych typów węzłów, które dostarczają sygnałów aby wykrywać wydarzenia. Na przykład, :ref:`Area2D <class_Area2D>` reprezentująca monetę emituje sygnał ``body_entered``, kiedy fizyczne ciało gracza wchodzi w jej kształt kolizyjny, co daję Tobie znać kiedy gracz ją zebrał.
pt_br: Na Godot, muitos dos nós embutidos proporcionam sinais que você pode usar para detectar eventos. Por exemplo, um :ref:`Area2D <class_Area2D>`representando uma moeda emite um sinal ``body_entered`` sempre quando o corpo físico do jogador entra na forma de colisão, permitindo você saber quando o jogador coletou ela.
ru: Многие встроенные типы узлов в Godot предоставляют сигналы, которые можно использовать для обнаружения событий. Например, монетка, созданная в виде объекта :ref:`Area2D <class_Area2D>`, излучает сигнал ``body_entered`` в момент касания физическим телом игрока формы столкновения монетки, позволяя понять, когда игрок её собрал.
uk: Багато вбудованих типів вузлів Godot надають сигнали, які можна використовувати для виявлення подій. Наприклад, :ref:`Area2D <class_Area2D>`, у вигляді монети, випромінює сигнал ``body_entered`` кожного разу, коли стикається з фізичним тілом гравця, що дозволяє вам знати, що гравець її зібрав.
zh_cn: Godot的许多内置节点类型都提供可以用来检测事件的信号。例如，代表硬币的 :ref:`Area2D <class_Area2D>` 在游戏角色的物理体进入碰撞形状时发出 ``body_entered`` 信号，让您知道游戏角色什么时候收集它。
zh_tw: 許多 Godot 內建的型別都提供各種訊號可用來偵測事件。例如，當金幣 :ref:`Area2D <class_Area2D>` 物件送出 ``body_entered`` 訊號，就表示玩家物理形體進入了金幣的碰撞區域，代表玩家蒐集到金幣。

source: In the next section, :ref:`doc_your_first_game`, you'll build a complete game including several uses of signals to connect different game components.
cs: V následující sekci :ref:`doc_your_first_game` vytvoříte kompletní hru,která ukáže využití signálů pro vzájené spojení různých herních komponent.
es: En la siguiente sección, :ref:`doc_your_first_game`, construirás un juego completo que incluirá varios usos de señales para conectar diferentes componentes del juego.
fi: Seuraavassa osiossa, :ref:`doc_your_first_game`, rakennamme kokonaisen pelin, jossa signaaleja käytetään monin eri tavoin yhdistämään pelin eri komponentteja.
fr: Dans la section suivante :ref:`doc_your_first_game`, vous construirez un jeu complet comprenant plusieurs utilisations de signaux pour connecter différents composants du jeu.
it: Nella prossima sezione, :ref:`doc_your_first_game`, creerai un gioco completo includendo l'uso di segnali per connettere differenti componenti di gioco.
ja: 次のセクション\ :ref:`doc_your_first_game`\ では、さまざまなゲームコンポーネントを接続するシグナルのいくつかの使用法を含む、完全なゲームを構築します。
ko: 다음 섹션은, :ref:`doc_your_first_game`\ 으로, 서로 다른 게임 구성 요소들을 여러 시그널을 사용하여 연결하는 것을 포함한 완전한 게임을 만들 것입니다.
pl: W następnej sekcji, :ref:`doc_your_first_game` zbudujesz kompletną grę z wykorzystaniem sygnałów, aby połączyć różne elementy gry.
ru: В следующем разделе :ref:`doc_your_first_game`, вы будете делать готовую игру, с использованием некоторых видов сигналов для подключения различных игровых компонентов.
uk: У наступному розділі, :ref:`doc_your_first_game`, ви побудуєте повну гру, з використанням кількох різних сигналів для підключення різних ігрових компонентів.
zh_cn: 在下一节 :ref:`doc_your_first_game` 中，您将构建一个完整的游戏，其中包括连接不同游戏组件的几种信号用法。
zh_tw: 在下一個章節 :ref:`doc_your_first_game` 中，我們將製作一個完整的遊戲，其中會用到訊號來連接各個不同的遊戲元件。

source: Signal
cs: Signál
fi: Signaali
it: Segnale
pl: Sygnał
zh_tw: 訊號

source: You can read more about the observer pattern here: https://gameprogrammingpatterns.com/observer.html
cs: Více informací o vzoru Observer najdete zde: https://gameprogrammingpatterns.com/observer.html
it: Puoi leggere di più relativamente agli observer pattern qui: http://gameprogrammingpatterns.com/observer.html
pl: O wzorcu projektowym "obserwator", możesz przeczytać więcej tutaj: https://gameprogrammingpatterns.com/observer.html
zh_tw: 欲瞭解更多有關觀察者模式的資訊，請參考：https://gameprogrammingpatterns.com/observer.html

source: Signals are a way to *decouple* your game objects, which leads to better organized and more manageable code. Instead of forcing game objects to expect other objects to always be present, they can instead emit signals that all interested objects can subscribe to and respond to.
cs: Signály jsou způsob, jak *oddělit* herní objekty, což vede k lepší organizaci a udržovatelnosti kódu. Místo toho, aby byly herní objekty nuceny očekávat, že jiné objekty budou neustále přítomny, mohou v případě potřeby vysílat signály, které mohou všechny zainteresované objekty odebírat a reagovat na ně.
fi: Signaalien avulla pelin objektit voidaan *erottaa* toisistaan, mikä johtaa paremmin järjestettyyn ja hallittavampaan koodiin. Sen sijaan, että objektien on pakko olettaa, että muut objektit ovat aina läsnä, ne voivat lähettää signaaleja, joita kaikki kiinnostuneet objektit voivat kirjautua kuuntelemaan ja vastaamaan.
it: I segnali sono un modo per disaccoppiare i tuoi oggetti di gioco, il che comporta un codice meglio organizzato e più gestibile. Al posto di forzare gli oggetti di gioco ad aspettarsi che altri oggetti siano sempre presenti, possono invece emettere segnali che tutti gli oggetti interessati possono ascoltare e rispondere.
ja: シグナルは、ゲーム オブジェクトを\ *分離*\ する方法であり、コードの整理と管理が容易になります。常に複数のゲーム オブジェクト同士を強制的に会わせるのではなく、代わりにオブジェクトはシグナルを発信でき、関係するすべてのオブジェクトは予約および応答ができます。
pl: Sygnały są sposobem na *rozdzielenie* Twoich obiektów, co powoduje, że pisany kod jest lepiej zorganizowany i łatwiej nim zarządzać. Zamiast wymuszać na obiektach, żeby zawsze spodziewały się określonych obiektów, mogą zamiast tego emitować sygnały, na które zareagują wszystkie zainteresowane obiekty.
uk: Сигнали - це спосіб *розтягнути* ваші ігрові об'єкти, що призводить до краще організованого та більш керованого коду. Замість того, щоб змушувати ігрові об'єкти постійно перебирати всі присутні інші об'єкти, вони можуть просто випромінювати сигнали, на які реагуватимуть тільки ті об'єкти в яких прописана реакція на ці сигнали.
zh_tw: 訊號是一種 **解耦** 遊戲物件的方法，可以更好地組織與管理程式碼。不需要強制讓某個遊戲物件去配合數個物件，而是讓物件發出訊號，所有需要反應的物件都可以訂閱訊號並進行回應。

source: To see how signals work, let's try using a :ref:`Timer <class_Timer>` node. Create a new scene with a Node2D and two children: a Timer and a :ref:`Sprite <class_Sprite>`. In the Scene dock, rename Node2D to TimerExample.
cs: Abychom viděli, jak signály fungují, zkusme použít uzel :ref:`Timer <class_Timer>`. Vytvořte novou scénu s Node2D a dvěma dětmi: Timer a a :ref:`Sprite <class_Sprite>`. V doku Scéna přejmenujte Node2D na TimerExample.
it: Per vedere come funzionano i segnali, proviamo ad usare un nodo :ref:`Timer <class_Timer>`. Creiamo una nuova scena con un Node2D e due figli: un Timer e un nodo :ref:`Sprite <class_Sprite>`. Nel pannello della scena, rinomina Node2D con TimerExample.
ja: シグナルがどのように機能するかを見るために、\ :ref:`Timer <class_Timer>`\ ノードを使用してみましょう。 Node2Dと2つの子:Timerと\ :ref:`Sprite <class_Sprite>`\ で新しいシーンを作成します。 Sceneドックで、Node2Dの名前をTimerExampleに変更します。
pl: Żeby zobaczyć, jak działają sygnały, użyjmy węzła :ref:`Timer <class_Timer>`. Utwórz nową scenę z węzłem typu Node2D oraz jego dwoma węzłami-dziećmi: węzłem Timer oraz a :ref:`Sprite <class_Sprite>`. W doku Sceny, zmień nazwę węzła z Node2D na TimerExample.
uk: Щоб побачити, як працюють сигнали, спробуємо використати вузол :ref:`Timer <class_Timer>` (Таймер). Створіть нову сцену з вузлом Node2D та двома нащадками: Timer та :ref:`Sprite <class_Sprite>`. На панелі Сцена перейменуйте Node2D на TimerExample (Зразок Таймера).
zh_tw: 為了瞭解訊號怎麼運作的，來試試看 :ref:`Timer <class_Timer>` (計時器) 節點。先建立場景，並設定一個 Node2D 與兩個子節點：Timer 與 :ref:`Sprite <class_Sprite>` 。接著在場景 Dock 內把 Node2D 重命名為 TimerExample (計時器範例)。

source: For the Sprite's texture, you can use the Godot icon, or any other image you like. Do so by selecting ``Load`` in the Sprite's Texture attribute drop-down menu. Attach a script to the root node, but don't add any code to it yet.
cs: Pro texturu Sprite můžete použít ikonu Godotu nebo jakýkoli jiný obrázek, který se vám líbí. Toto provedete výběrem ``Load`` v rozbalovací nabídce atributu Sprite's Texture. Připojte skript ke kořenovému uzlu, ale zatím k němu nepřidávejte žádný kód.
fi: Spriten tekstuurille voit käyttää Godotin ikonia, tai mitä tahansa muuta kuvatiedostoa. Tee niin valitsemalla ``Load`` spriten tekstuuri attribuutin pudotusvalikosta. Lisää skripti root solmuun, mutta älä lisää siihen vielä mitään koodia.
it: Per la texture dello Sprite, puoi usare l'icona di Godot, o qualsiasi altra immagine ti piaccia. Puoi farlo selezionando ``Load`` tra gli attibuti nel menu a tendina della Texture del nodo Sprite. Attacca uno script al nodo radice, ma non aggiungere nessun codice per ora.
ja: スプライトのテクスチャには、Godotアイコン、またはその他の好きな画像を使用できます。そのためには、スプライトのテクスチャ属性ドロップダウンメニューで ``読込み`` を選択します。ルートノードにスクリプトをアタッチしますが、まだコードを追加しないでください。
pl: Dla tekstury węzła Sprite, możesz użyć ikony Godota lub jakiegokolwiek innego obrazu. Żeby to zrobić, naciśnij przycisk ``Załaduj`` w menu rozwijalnym atrybutu Tekstura, należącym do węzła Sprite. Dodaj skrypt do głównego węzła, ale nie dodawaj do niego jeszcze żadnego kodu.
uk: Для текстури Спрайта можна використовувати значок Godot, або будь-яке інше зображення, яке вам подобається. Зробіть це, вибравши ``Завантажити`` у спадному меню атрибута Спрайта Texture. Приєднайте скрипт до кореневого вузла, але не додавайте до нього коду.
zh_tw: 可以用 Godot 的圖示或其他喜歡的圖片來設定 Sprite 紋理貼圖。要設定紋理貼圖，請在 Sprite 的 Texture (紋理貼圖) 下拉選單內選擇 [載入] 。之後在根節點上附加腳本，但在這裡先不要新增任何程式碼。

source: Click on the "timeout()" signal and click "Connect..." at the bottom of the signals panel. You'll see the following window, where you can define how you want to connect the signal:
cs: Klikněte na signál „timeout ()“ a klikněte na „Připojit ...“ ve spodní části panelu signálů. Uvidíte následující okno, kde můžete definovat, jak chcete signál připojit:
it: Clicca sul segnale "timeout()" e poi clicca "Connect..." situato nella parte inferiore del pannello dei segnali. Vedrai la seguente finestra, dove puoi definire come connettere il segnale:
ja: シグナルパネルの下にある「timeout()」シグナルをクリックし、「接続...」をクリックします。 次のウィンドウが表示され、信号の接続方法を定義できます:
pl: Kliknij na sygnał "timeout()" i wybierz "Połącz..." na dole panelu z sygnałami. Zobaczysz wtedy okno, w którym będziesz mógł zdefiniować, w jaki sposób chcesz połączyć sygnał:
uk: Клацніть на сигнал "timeout ()" і натисніть "Приєднати ..." внизу панелі сигналів. Ви побачите наступне вікно, де можна визначити, як ви хочете підключити сигнал:
zh_tw: 點擊「timeout()」訊號，然後選擇訊號面板下方的 [連接...]。接下來會看到下面這個視窗，可以設定要如何連接訊號：

source: On the left side, you'll see the nodes in your scene and can select the node that you want to "listen" for the signal. Note that the Timer node is blue, this is a visual indication that it's the node that is emitting the signal. Select the root node.
cs: Na levé straně uvidíte uzly ve vaší scéně a můžete vybrat uzel, který by měl signálu "naslouchat". Všimněte si, že uzel časovače je modrý, což je vizuální indikace, že je to uzel, který vysílá signál. Vyberte kořenový uzel.
it: Nella parte sinistra, vedrai i nodi presenti nella scena e potrai selezionare quale vuoi che "ascolti" per il segnale. Nota che il nodo Timer è evidenziato in blu, proprio per indicare quale nodo sta attualmente emettendo il segnale. Seleziona il nodo base.
ja: 左側でシーンのノードを見ることができます。信号として「監視」したいノードを選択できます。タイマーノードは青色で、ノードが信号を発していること意味します。ルートノードを選択してください。
pl: Po lewej stronie znajdują się węzły w Twojej scenie - możesz wybrać węzeł, który chcesz aby "nasłuchiwał" na nasz sygnał. Zauważ, że węzeł Timer jest zaznaczony na niebiesko - to informacja, że jest to węzeł, który emituje ten sygnał. Wybierz główny węzeł (TimerExample).
uk: Ліворуч ви побачите вузли у вашій сцені і з них ви можете вибрати вузол для "прослуховування" сигналу. Зауважте, що вузол Timer синій, це візуальна ознака того, що саме цей вузол випромінює сигнал. Виберіть кореневий вузол.
zh_tw: 視窗左邊是場景中的節點，可以選擇一個節點來「監聽」訊號。請注意，Timer 節點顯示為藍色的，這代表 Timer 是送出訊號的節點。這裡先選擇根節點。

source: If you toggle the Advanced menu, you'll see on the right side that you can bind an arbitrary number of arguments of (possibly) different types. This can be useful when you have more than one signal connected to the same method, as each signal propagation will result in different values for those extra call arguments.
cs: Pokud přepnete nabídku Pokročilé, uvidíte na pravé straně, že můžete svázat libovolný počet argumentů různých typů. To může být užitečné, pokud máte ke stejné metodě připojen více než jeden signál a každé šíření signálu bude předávat různé argumenty.
it: Se attivi il menu Avanzato, vedrai sul lato destro che puoi associare un numero arbitrario di argomenti di (possibilmente) tipi diversi. Questo può essere utile quando hai più di un segnale collegato allo stesso metodo, poiché ogni propagazione del segnale comporterà valori diversi per quegli argomenti di chiamata extra.
pl: Jeżeli rozwiniesz Zaawansowane menu, po prawej stronie zobaczysz, że możesz przypisać dowolną liczbę argumentów (różnych) typów. To może być użyteczne w momencie kiedy masz więcej niż jeden sygnał połączony do tej samej metody, ponieważ każdy dodatkowy argument spowoduje podział na różne wartości dla każdego sygnału.
zh_tw: 如果打開「進階」選單，就可以看到右邊能選擇要綁定的引數數量以及引數 (可用) 的型別。這個功能適用於同一個方法連接多個不同訊號的情況，因為每個訊號在傳遞時都會依據這裡設定的額外呼叫引數來代入不同的值。
