Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/signals.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: On the bottom of the window is a field labeled "Receiver Method". This is the name of the function in the target node's script that you want to use. By default, Godot will create this function using the naming convention ``_on_<node_name>_<signal_name>`` but you can change it if you wish.
cs: V dolní části okna je pole označené „Metoda příjemce“. Toto je název funkce ve skriptu cílového uzlu, který chcete použít. Ve výchozím nastavení Godot vytvoří tuto funkci pomocí konvence pojmenování ``_on_ <název_uzlu> _ <jméno_signálu>``, ale můžete ji změnit, pokud si budete přát.
it: Nella parte bassa della finestra c'è un campo di testo "Metodo Ricevitore". Questo è il nome della funzione che vuoi usare nello script del nodo target. Di default, Godot creerà questa funzione usando le convenzioni ``_on_<node_name>_<signal_name>`` ma puoi cambiarlo se vuoi.
ja: ウィンドウの下部には、「メソッドの選択」というラベルのフィールドがあります。 これは、使用したいターゲットノードのスクリプト内の関数の名前です。 デフォルトでは、Godotは\ ``_on_<ノード名>_<シグナル名>``\ という命名規則を使用してこの関数を作成しますが、必要に応じて変更できます。
pl: Na dole okna znajduje się pole "Metoda odbiorcy". Jest to nazwa funkcji w skrypcie docelowego węzła, której chcesz użyć. Domyślnie Godot utworzy tę funkcję, korzystając z następującej konwencji : ``_on_<nazwa_wezla>_<nazwa_sygnalu>`` . Oczywiście, jeśli chcesz, możesz zmienić tę nazwę według uznania.
uk: У нижній частині вікна розташоване поле з написом "Метод-отримувач". Це ім'я функції в скрипті цільового вузла, яку ви хочете використовувати. За замовчуванням Godot створить цю функцію за допомогою конвенції про іменування ``_on_<node_name>_<signal_name>`` (``_on_<ім'я_вузла>_<ім'я_сигнала>``) але ви можете змінити її, якщо бажаєте.
zh_tw: 視窗底下有一個 [Receiver 方法] 欄位，這個欄位表示目標節點腳本中的接收函式名稱。預設 Godot 會使用 ``_on_<節點名稱>_<訊號名稱>`` 這樣的命名格式，但也可以自己修改 Receiver 方法名稱。

source: To emit a signal via code, use the ``emit_signal`` function:
cs: Chcete-li vyslat signál pomocí kódu, použijte funkci ``emit_signal``:
fi: Signaalin lähettämiseksi koodin kautta, käytä ``emit``-funktiota:
it: Per emettere un segnale da codice, usa la funzione ``emit_signal``:
ja: コードを介してシグナルを発信するには、\ ``emit_signal`` 関数を使用します:
pl: Aby wyemitować sygnał poprzez kod, użyj funkcji ``emit_signal``:
uk: Щоб випромінювати сигнал за допомогою коду, використовуйте функцію ``emit_signal``:
zh_tw: 使用 ``emit_signal`` 函式來通過程式碼送出訊號：

source: A signal can also optionally declare one or more arguments. Specify the argument names between parentheses:
cs: Signál může také volitelně deklarovat jeden nebo více argumentů. Názvy argumentů zadejte mezi závorkami:
it: Un segnale può anche opzionalmente dichiarare uno o più argomenti. Specifica i nomi degli argomenti tra parentesi:
ja: シグナルは任意により複数の引数を付けて宣言できます。カッコの中に引数の名前を指定します:
pl: "Sygnał" może również opcjonalnie deklarować jeden lub więcej argumentów. Nazwy argumentów umieść w nawiasie rozdzielając je przecinkiem:
uk: Сигнал може також (необов'язково) оголошувати один, або кілька, аргументів. Вкажіть назви аргументів між дужками:
zh_tw: 訊號也可以宣告一個或多個引數。在括號中指定引數的名稱：

source: The signal arguments show up in the editor's node dock, and Godot can use them to generate callback functions for you. However, you can still emit any number of arguments when you emit signals. So it's up to you to emit the correct values.
cs: Argumenty signálu se zobrazují v doku Uzel editoru a Godot je pro vás může použít k vytvoření funkcí zpětného volání. Při vysílání signálů však stále můžete vysílat signály s libovolným počtem argumentů. Je tedy na vás, abyste vyslali ty správné hodnoty.
it: I segnali sono argomenti che vengono visualizzati nel riquadro del nodo dell'editor e Godot può utilizzarli per generare funzioni di callback. Tuttavia, è ancora possibile emettere un numero qualsiasi di argomenti quando si emettono segnali, quindi spetta a te fornire i valori corretti.
ja: シグナル引数はエディタのノードドックに表示され、Godotはそれらを使用してコールバック関数を生成できます。しかしながら、シグナルを発信するときに、任意の数の引数を発行できます。正しい値を出力するのはあなた次第です。
pl: Argumenty Sygnału pojawią się w doku Węzłów edytora, Godot może użyć ich aby wygenerować funkcje zwrotne za ciebie. Jednak wciąż możliwe jest wyemitowanie dowolnej ilości argumentów emitując sygnał samemu. Aczkolwiek to na programiście będzie w tedy spoczywała odpowiedzialność za wyemitowanie poprawnych wartości.
uk: Аргументи сигналу відображаються у панелі вузла редактора, і Godot може використовувати їх для створення функцій зворотного виклику для вас. Однак ви все одно можете випромінювати будь-яку кількість аргументів, разом із сигналами. Ви повинні випромінювати правильні значення.
zh_tw: 訊號的引數會顯示在編輯器的節點 Dock 中。Godot 會使用訊號引數來產生回呼函式。但送出訊號時一樣可以送出任意數量的引數，可自行決定是否要送出正確的數量。

source: To pass values, add them as the second argument to the ``emit_signal`` function:
it: Per passare dei valori aggiungili come secondo argomento alla funzione ``emit_signal``:
ja: 値を渡すには、それらを\ ``emit_signal`` 関数の2番目の引数として追加します:
pl: Aby przekazać wartości dodaj je jako drugi argument funkcji ``emit_signal``:
uk: Щоб випромінювати сигнал за допомогою коду, використовуйте функцію ``emit_signal``:
zh_tw: 若需要傳遞數值，可將數值放在 ``emit_signal`` 函式的第二個引數內：
