Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/signals.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Signals
cs: Signály
de: Signale
es: Señales
fi: Signaalit
fr: Signaux
it: Segnali
ja: シグナル
ko: 시그널
pl: Sygnały
pt_br: Sinais
ru: Сигналы
uk: Сигнали
zh_cn: 信号
zh_tw: 訊號

source: Introduction
cs: Úvod
de: Einführung
es: Introducción
fi: Johdanto
it: Introduzione
ja: はじめに
ko: 소개
pl: Wprowadzenie
pt_br: Introdução
ru: Введение
uk: Вступ
zh_cn: 简介
zh_tw: 簡介

source: Signals are Godot's version of the *observer* pattern. They allow a node to send out a message that other nodes can listen for and respond to. For example, rather than continuously checking a button to see if it's being pressed, the button can emit a signal when it's pressed.
cs: Signály jsou Godot verze návrhového vzoru *observer* . Umožňují uzlu odeslat zprávu, kterou ostatní uzly slyší a na kterou mohou reagovat. Například místo toho, aby tlačítko nepřetržitě kontrolovalo, zda je stisknuto, může při stisknutí vyslat signál.
de: Signale sind Godot's-Version des Beobachtungsmusters. Dies erlaubt es der Node eine Nachricht zu senden, auf diese Nachricht können andere Nodes hören und diese beantworten. Als Beispiel, anstatt dass man die ganze Zeit prüft ob eine Taste gedrückt wurde, könnte diese auch einfach eine Nachricht schicken, wenn Sie gedrückt wurde.
es: Las señales son en Godot una version del "patron del observador". Estas permiten a un nodo enviar un mensaje, que otros nodos pueden escuchar y responder. Por ejemplo, en vez de chequear continuamente si un botón esta siendo presionado, el botón puede emitir una señal cuando esta presionado.
fi: Signaalit ovat Godotin versio *tarkkailija*-mallista. Ne antavat solmun lähettää viestejä, joita muut solmut voivat kuunnella ja joihin ne voivat vastata. Esimerkiksi sen sijaan, että tarkistaisi jatkuvasti onko painiketta painettu, painike voi lähettää signaalin kun sitä on painettu.
fr: Les signaux sont la version de Godot du modèle d'observateur. Ils permettent à un nœud d'envoyer un message que les autres nœuds peuvent écouter et auquel ils peuvent répondre. Par exemple, au lieu de vérifier en continu si un bouton est appuyé, le bouton peut émettre un signal lorsqu'il est appuyé.
it: I segnali sono la versione di Godot degli *observer* pattern. Consentono ad un nodo di inviare un messaggio che un altro nodo può ascoltare e rispondere. Per esempio, piuttosto che controllare in continuazione un bottone per verificare se è premuto, il bottone può emettere un segnale quando è premuto.
ja: シグナルは、\ *observer*\ パターンのGodotバージョンです。これにより、ノードは、他のノードが聞いて応答できるメッセージを発信できます。例えば、ボタンが押されているかどうかを継続的に確認するのではなく、ボタンが押されたときに信号を発することができます。
ko: 시그널은 *옵저버* 패턴의 Godot 버전입니다. 시그널로 노드는 다른 노드로 메시지를 보내고 다른 노드는 이것을 받고 응답할 수 있습니다. 예를 들어, 버튼의 눌림 여부를 파악하기 위해 주기적으로 버튼을 확인하는 대신 버튼이 눌렸을 때 시그널을 방출(emit)할 수 있습니다.
pl: Sygnały w Godot są odpowiednikiem wzorca *obserwatora*. Pozwalają węzłowi na wysyłanie "wiadomości", które inne węzły mogą odczytywać i na nie reagować. Przykładowo, zamiast bez przerwy sprawdzać, czy przycisk został właśnie wciśnięty, to przycisk sam może wyemitować sygnał, kiedy zostanie wciśnięty.
pt_br: Sinais são a versão do Godot do padrão *observador*. Eles permitem que um nó envie uma mensagem que outros nós podem captar e responder. Por exemplo, ao invés de continuamente verificar um botão para saber se ele está sendo pressionado, o botão pode emitir um sinal quando for pressionado.
ru: Сигналы в Godot являются реализацией программного шаблона *наблюдатель*. Они позволяют узлу отправлять сообщения, которые другие узлы могут прослушивать и на которые могут отвечать. Например, вместо того, чтобы постоянно проверять, не нажата ли кнопка, можно просто выдать сигнал при нажатии.
uk: Сигнали в Godot це версія шаблона *спостерігач*. Вони дозволяють вузлу надсилати повідомлення, яке можуть прослуховувати ( та відповідати на нього) інші вузли. Наприклад, замість того, щоб постійно перевіряти кнопку, щоб побачити, чи її натискають, кнопка може видавати сигнал при її натисканні.
zh_cn: 信号是Godot版本的观察者模式。它允许一个节点发送消息到其他节点，令其他节点也可以监听和响应这个消息。举个示例，当按键按下时信号就会发出，而不是不停地检查按键是否被按压。
zh_tw: 訊號是 Godot 版本的 **觀察者** (Observer) 設計模式。使用訊號可以讓一個節點送出訊息，然後讓其他節點能監聽該訊息並進行回應。舉例來說，有了訊號就不需要一直重複檢查同一個按鈕來確認按鈕有沒有被按下，而可以通過讓按鈕送出訊號來通知其他人按鈕被按下了。

source: You can read more about the observer pattern here: http://gameprogrammingpatterns.com/observer.html
de: Du kannst mehr zum Beobachter-Entwurfsmuster hier lesen: http://gameprogrammingpatterns.com/observer.html
es: Puedes leer mas sobre el patron del observador aqui: http://gameprogrammingpatterns.com/observer.html
fr: Vous pouvez en savoir plus sur le modèle d'observateur ici : http://gameprogrammingpatterns.com/observer.html
ko: 옵저버 패턴에 대해 더 알아보려면 다음 주소를 참고하세요: http://gameprogrammingpatterns.com/observer.html
pt_br: Você pode ler mais sobre o padrão observador aqui: http://gameprogrammingpatterns.com/observer.html
ru: Вы можете прочитать больше о шаблоне Наблюдатель здесь: http://gameprogrammingpatterns.com/observer.html
zh_cn: 您可以在这里查看更多关于观察者模式: http://gameprogrammingpatterns.com/observer.html

source: Signals are a way to *decouple* your game objects, which leads to better organized and more manageable code. Instead of forcing game objects to expect other objects to always be present, they can instead emit signals that any interested objects can subscribe to and respond.
de: Signale sind eine Möglichkeit deine Spielobjekte von anderen Objekten *zu lösen*, diese führt zu aufgeräumten und besser organisierten Code. Anstatt dass du Spielobjekte dazu zwingst ständig jedes andere Objekt zu kennen, erstellst du Signale an die sich jedes interessierte Objekt anmelden und darauf antworten kann.
es: Las señales son una forma de desacoplar los objetos de juego, que lleva a tener código mas organizado y mas fácil de gestionar. En vez de forzar a los objetos de juego a esperar que otros objetos siempre esten presentes, pueden emitir señales a las que cualquier objeto interesado puede suscribirse y responder.
fr: Les signaux sont un moyen de rendre vos objets de jeu indépendants, ce qui conduit à un code mieux organisé et plus facile à gérer. Au lieu de forcer les objets du jeu à s'attendre à ce que d'autres objets soient toujours présents, ils peuvent émettre des signaux auxquels tout objet intéressé peut s'abonner et répondre.
ko: 시그널은 게임 객체들을 *분리하는* 도구로, 이를 활용하여 더 체계적이고 관리하기 쉬운 코드를 작성할 수 있습니다. 게임 객체가 다른 객체가 존재하도록 강요하는 대신, 한 객체가 방출한 시그널을 필요로 하는 다른 객체만 구독하거나 응답할 수 있도록 합니다.
pt_br: Sinais são um meio de *desacoplar* seus objetos de jogo, o que leva a um código mais organizado e gerenciável. Ao invés de forçar objetos de jogo a esperar que outros objetos estejam sempre presentes, eles podem emitir sinais para os quais qualquer objeto interessado pode inscrever-se e responder.
ru: Сигналы - это способ *уменьшить зацепление* игровых объектов, приводящий код к более упорядоченному и управляемому виду. Вместо того чтобы принуждать игровые объекты постоянно зависеть от существования других объектов, возможно выдавать сигналы, на которые заинтересованные объекты могут реагировать.
zh_cn: 信号是一种 *解耦* 游戏对象的方法，从而使代码更有条理，更易于管理。他们可以对任何感兴趣的可以订阅的对象发出信号和响应，而不是强制游戏对象去期望其他对象始终存在。

source: Below you can see some examples of how you can use signals in your own projects.
cs: Níže vidíte několik příkladů, jak můžete používat signály ve svých vlastních projektech.
de: Nachfolgend sehen Sie einige Beispiele, wie Sie Signale in Ihren eigenen Projekten verwenden können.
es: Aqui debajo puedes ver algunos ejemplos de como usar señales en tus propios proyectos.
fi: Alla muutamia esimerkkejä siitä, miten voit käyttää signaaleja omissa projekteissasi.
fr: Vous trouverez ci-dessous quelques exemples d'utilisation des signaux dans vos propres projets.
it: Sotto puoi vedere alcuni esempi di come puoi usare i segnali nei tuoi progetti.
ja: 以下に、独自のプロジェクトでシグナルを使用する方法の例をいくつか示します。
ko: 아래에서 여러분의 프로젝트에 시그널을 활용할 수 있는 방법을 담은 예시들을 살펴보겠습니다.
pl: Poniżej możesz zobaczyć przykłady, jak używać sygnałów w swoich projektach.
pt_br: Abaixo, você pode ver alguns exemplos de como você pode usar sinais em seus próprios projetos.
ru: Ниже вы можете увидеть некоторые примеры того, как вы можете использовать сигналы в ваших собственных проектах.
uk: Нижче ви можете побачити приклади того, як можна використовувати сигнали у власних проектах.
zh_cn: 接下来您可以看到一些如何在自己的项目中使用信号的示例。
zh_tw: 下方的例子說明了如何能在專案內使用訊號。

source: Timer example
cs: Příklad časovače
de: Timer Beispiel
es: Ejemplo de temporizador
fi: Ajastin-esimerkki
fr: Exemple de minuterie
it: Esempio di Timer
ja: タイマーの例
ko: 타이머(Timer) 예제
pl: Przykład dla węzła Timer
pt_br: Alguns exemplos
ru: Пример таймера
uk: Приклад таймера
zh_cn: 计时器示例
zh_tw: 計時器範例

source: To see how signals work, let's try using a :ref:`Timer <class_Timer>` node. Create a new scene with a Node and two children: a Timer and a :ref:`Sprite <class_Sprite>`. You can use the Godot icon for the Sprite's texture, or any other image you like. Attach a script to the root node, but don't add any code to it yet.
de: Damit wir einmal sehen wie Signale funktionieren, benutzen wir eine :ref:`Timer <class_Timer>` Knoten. Erstellt eine neue Szene mit einem Knoten und zwei Kindern: einem "Timer" und einer :ref:`Sprite <class_Sprite>`. Du kannst das Godot-Icon für die Sprite-Texture benutzen oder ein anderes Bild, dass dir gefällt.
es: Para visualizar como funcionan las señales, intentemos usando un nodo :ref:`Timer <class_Timer>`. Crea una nueva Escena con un Nodo y dos Hijos: un Timer y un :ref:`Sprite <class_Sprite>`. Puedes usar el ícono de Godot para la textura del Sprite, o cualquier otra imagen que gustes. Adjunta un Script al Nodo Raiz, pero no le agregues codigo todavia.
fr: Pour voir comment fonctionnent les signaux, essayons d'utiliser un noeud :ref:`Timer <class_Timer>`. Créez une nouvelle scène avec un nœud et deux enfants : un Timer et un :ref:`Sprite <class_Sprite>`. Vous pouvez utiliser l'icône Godot pour la texture du Sprite, ou toute autre image que vous souhaitez. Attachez un script au nœud racine, mais n'y ajoutez pas encore de code.
ko: 시그널이 어떻게 작동하는지 알아보기 위해, :ref: `Timer <class_Timer>` 노드를 사용하겠습니다. Node와 두 자식 노드가 있는 씬을 만듭니다: 하나는 Timer이고 다른 하나는 :ref:`Sprite <class_Sprite>`\ 입니다. 스프라이트의 텍스쳐로 Godot 아이콘을 쓸 수도 있고, 원하는 어떤 이미지를 놓아도 좋습니다. 루트 노드에 스크립트를 붙이되, 아직 아무 코드도 넣지 마세요.
pt_br: Para ver como sinais funcionam, vamos tentar usar um nó :ref:`Timer <class_Timer>`. Crie uma nova cena com um Node e dois filhos: um Timer e um :ref:`Sprite <class_Sprite>`. Você pode usar o ícone do Godot para a textura do Sprite, ou qualquer outra imagem que você quiser. Anexe um script no nó raíz, mas não adicione nenhum código a ele ainda.
ru: Чтобы увидеть, как работают сигналы, давайте попробуем использовать узел :ref:`Timer <class_Timer> . Создайте новую сцену с узлом и двумя дочерними узлами: таймер и :ref:`спрайт <class_Sprite>`. Вы можете использовать иконку Godot для текстуры спрайта или любое другое изображение, которое вам нравится. Присоедините скрипт к корневому узлу, но пока не добавляйте в него никакого кода.
zh_cn: 要查看信号是如何工作的，让我们尝试使用 :ref:`Timer <class_Timer>` 节点。使用一个节点和两个子节点来创建一个新场景:一个是:Timer和一个 :ref:`Sprite <class_Sprite>`。您可以使用Godot图标作为Sprite的纹理，或者其他您喜欢的任意图像。

source: Your scene tree should look like this:
cs: Strom scény by měl vypadat takto:
es: Tu árbol de la escena debería verse así:
fi: Skenepuusi pitäisi näyttää tältä:
fr: L'arbre de la scène devrait ressembler à ceci :
it: Il tuo albero di scena dovrebbe essere simile a questo:
ja: シーンツリーは次のようになります:
ko: 씬 트리는 다음과 같아야 합니다:
pl: Drzewo sceny powinno tak wyglądać:
pt_br: Sua árvore da cena deveria se parecer assim:
ru: Дерево сцены должно выглядеть так:
uk: Ваше дерево сцени має виглядати так:
zh_cn: 您的场景树应该是这样的:
zh_tw: 現在，場景樹應該會長這樣：

source: In the Timer node's properties, check the "On" box next to *Autostart*. This will cause the timer to start automatically when you run the scene. You can leave the *Wait Time* at 1 second.
cs: Ve vlastnostech uzlu Timer zaškrtněte políčko „On“ vedle položky *Autostart*. To způsobí automatické spuštění časovače při spuštění scény. *Wait time* můžete nechat 1 sekundu.
de: In den Eigenschaften des Timers, setze ein Häkchen in der "An" Box neben *Autostart*. Dies wird den Timer automatisch starten, wenn du die Szene startest. Die *Wait Time* solltest du bei 1 Sekunde lassen.
es: En las propiedades del nodo temporizador, selecciona la casilla ON en *Autostart*. Esto hace que el temporizador inicie automaticamente cuando se ejecuta la escena. Puedes dejar el *Wait Time* en 1 segundo.
fi: Avaa Timer-solmun ominaisuudet ja napsauta *Autostart*-tekstin viereistä valintaruutua. Tämä käynnistää ajastimen automaattisesti, kun skene ajetaan. *Wait Time*-ominaisuus voi pysyä 1 sekunnissa.
fr: Dans les propriétés du nœud Timer, cochez la case "On" à côté de *Autostart*. Le Timer démarrera automatiquement lorsque vous exécuterez la scène. Vous pouvez laisser le *Wait Time* (temps d'attente) à 1 seconde.
it: Nelle proprietà del nodo Timer, spunta la casella "On" vicino a *Autostart*. Questo farà in modo che il timer parta automaticamente quando viene avviata la scena. Puoi lasciare *Wait Time* impostato ad un secondo.
ja: Timerノードのプロパティで、\ *Autostart*\ の横にある「オン」ボックスをクリックします。これにより、シーンの実行時にタイマーが自動的に開始されます。\ *Wait Time*\ は1秒のままにしておきましょう。
ko: Timer 노드의 속성에서, *Autostart* 옆에 박스를 "On" 하세요. 그렇게 하면 씬을 실행할 때 자동으로 타이머가 실행합니다. 또한 *Wait Time*\ 을 1초로 처리할 수 있습니다.
pl: We właściwościach węzła Timer, zaznacz pole "Tak", znajdujące się obok etykiety "Autostart". To spowoduje, że zegar wystartuje automatycznie, kiedy uruchomisz scenę. Możesz zostawić *Czas oczekiwania* na 1 sekundę.
pt_br: Nas propriedades do nó Timer, marque a caixa "On" próximo a *Autostart*. Isso fará com que o Timer inicie automaticamente quando você executar a cena. Você pode deixar o *Wait Time* em 1 segundo.
ru: В свойствах узла Timer установите флажок "On" рядом с полем *Autostart*. Это приведет к автоматическому запуску таймера при запуске сцены. Вы можете оставить *Wait Time* в 1 секунду.
uk: У властивостях вузла Таймер встановіть прапорець "Увімкнено" біля пункту *Autostart* (Автозапуск). Це призведе до автоматичного запуску таймера під час запуску сцени. Ви можете залишити *Wait Time* (час очікування) 1 секунду.
zh_cn: 在Timer节点的属性中，勾选 *自动启动* 旁边的选框。这会令计时器在您运行场景时自动启动。您可以将 *等待时间* 保留为1秒。
zh_tw: 來看看 Timer 節點的屬性，先把 **Autostart** (自動開始) 旁邊的 [開啟] 勾選框打勾。這樣會讓計時器在場景執行的時候自動開始。而 **Wait Time** (等待時間) 可以保持預設的 1 秒。

source: Next to the "Inspector" tab is a tab labeled "Node". Click on this tab and you'll see all of the signals that the selected node can emit. In the case of the Timer node, the one we're concerned with is "timeout". This signal is emitted whenever the Timer reaches ``0``.
cs: Vedle karty „Inspektor“ je karta označená "Uzel". Klikněte na tuto kartu a uvidíte všechny signály, které může vybraný uzel vysílat. V případě uzlu Timer se jedná o signál "timeout". Tento signál je vysílán vždy, když časovač dosáhne hodnoty ``0``.
de: Neben dem "Inspektor" Tab ist der "Node" Tab, wenn du auf diesen klickst siehst du alle Signale die der ausgewählte Node aktivieren kann. Im Fall der Timer Node interessiert uns gerade das "timeout" Signal, dies wird aktiviert sobald der Timer ``0`` erreicht.
es: Junto a la solapa "Inspector" hay una solapa llamada "Nodo". Haz click en esta solapa y verás todas las señales que el nodo elegido puede emitir. En el caso del nodo temporizador, la que nos ocupa es "timeout". Esta señal es emitida cuando el temporizador llega a ``0``.
fi: Napsauta ”Inspector”-välilehden vieressä olevaa välilehteä ”Node”. Tältä välilehdeltä löytyvät kaikki signaalit, joita valittu solmu voi lähettää. Timer-solmun tapauksessa meitä kiinnostaa ”timeout”. Tämä signaali lähetetään, kun ajastin osoittaa ``0``.
fr: À côté de l'onglet "Inspecteur" se trouve un onglet intitulé "Nœud". Cliquez sur cet onglet et vous verrez tous les signaux que le nœud sélectionné peut émettre. Dans le cas du nœud Timer, celui qui nous intéresse est "timeout". Ce signal est émis chaque fois que la minuterie atteint ``0``.
it: Vicino alla tab "Inspector" ne è presente una chiamata "Node". Clicca questa tab e vedrai tutti i segnali che il nodo selezionato può emettere. Nel caso del nodo Timer, quello che c'interessa è "timeout". Questo segnale viene emesso ogni volta il Timer raggiunge ``0``.
ja: 「インスペクタ」タブの隣には、「ノード」というラベルの付いたタブがあります。 このタブをクリックすると、選択したノードが発信できるすべての信号が表示されます。 Timerノードの場合、関係するのは「timeout」です。 このシグナルは、タイマーが ``0`` に到達するたびに出力されます。
ko: "인스펙터" 탭 옆에 "노드"라는 라벨이 붙은 탭이 있습니다. 이 탭을 클릭하면 선택한 노드에서 방출할 수 있는 모든 시그널이 표시됩니다. Timer 노드의 경우, 주목해야 할 시그널은 "timeout"입니다. 이 시그널은 Timer가 ``0``\ 이 될 때마다 방출합니다.
pl: Obok zakładki "Inspektor" znajduje się zakładka z etykietą "Węzeł". Kliknij na tę zakładkę, żeby zobaczyć wszystkie sygnały, jakie ten węzeł może wyemitować. w przypadku węzła typu Timer, zależy nam na sygnale "timeout". Ten sygnał jest emitowany za każdym razem, kiedy czas Timera osiąga ``0``.
pt_br: Próximo à aba "Inspector" há uma aba chamada "Nó". Clique nessa aba e você verá todos os sinais que o nó selecionado pode emitir. No caso do nó Timer, o que nos importa é o "timeout". Este sinal é emitido sempre que o Timer chegar à ``0``.
ru: Рядом с вкладкой "Инспектор" находится вкладка "Узел". Нажмите на эту вкладку, и вы увидите все сигналы, которые выбранный узел может излучать. В случае с узлом Timer, с которым мы связаны, это "timeout". Этот сигнал генерируется каждый раз, когда таймер достигает ``0``.
uk: Поруч із вкладкою "Інспектор" знаходиться вкладка з написом "Вузол". Перейдіть на цю вкладку, і ви побачите всі сигнали, які може видавати вибраний вузол. У випадку з вузлом Timer, ми маємо справу з "timeout()". Цей сигнал випромінюється щоразу, коли таймер досягає ``0``.
zh_cn: 在 "属性面板" 选项卡旁边是一个标记为 "节点" 的标签。单击此选项卡，您将看到所选节点可以发出的所有信号。在计时器节点的情况下，我们关心的是"超时"。每当计时器到达 ``0`` 时，就会发出这个信号。
zh_tw: 在屬性面板分頁旁邊有一個叫做 [節點] 的分頁。點開這個分頁，會看到目前選擇節點可送出的所有訊號。在本例中，我們需要的是「timeout」訊號。這個訊號會在 Timer 倒數到 0 的時候送出。

source: Click on the "timeout()" signal and click "Connect...". You'll see the following window, where you can define how you want to connect the signal:
de: Klick auf das "timeout()" Signal und danach auf "Verbinden...". Auf dem folgenden Fenster kannst du definieren wie das Signal verbunden werden soll:
es: Haz click en la señal "timeout()" y clickea "Connect...". Verás la siguiente ventana, donde puedes definir como quieres conectar la señal:
fr: Cliquez sur le signal "timeout()" et cliquez sur "Connecter...". Vous verrez la fenêtre suivante dans laquelle vous pouvez définir comment vous voulez connecter le signal :
ko: "timeout()" 시그널을 클릭하고 그리고 "연결하기..."를 누릅니다. 다음과 같은 창이 나타나는데, 여기서 당신은 시그널을 어떻게 연결할 지를 정의할 수 있습니다:
pt_br: Clique no sinal "timeout()" e clique em "Conectar...". Você vai ver a seguinte janela, onde pode definir como você quer conectar o sinal:
ru: Нажмите на сигнал "timeout()" и после на кнопку "Присоединить...". Вы увидите окно, где вы можете определить, как вы хотите подключить сигнал:
zh_cn: 点击 "timeout()" 信号，点击 "Connect..."。您将看到以下窗口，您可以在其中定义如何连接信号:

source: On the left side, you'll see the nodes in your scene and can select the node that you want to "listen" for the signal. Note that the Timer node is red - this is *not* an error, but is a visual indication that it's the node that is emitting the signal. Select the root node.
de: Auf der linken Seite sehen Sie die Knoten in Ihrer Szene und können den Knoten auswählen, den Sie auf das Signal "hören" möchten. Beachten Sie, dass der Timer-Knoten rot ist - dies ist *kein Fehler*, sondern ist eine visuelle Anzeige, dass es der Knoten ist, der das Signal aussendet. Wählen Sie den Wurzelknoten aus.
es: En el margen izquierdo, verás los nodos en la escena y puedes elegir el nodo que quieres que "escuche" la señal. Fijate que el nodo temporizador esta en rojo - esto *no* es un error, sino una indicacion visual de que el nodo esta emitiendo una señal. Selecciona el nodo raiz.
fr: Sur le côté gauche, vous verrez les nœuds de votre scène et pourrez sélectionner le nœud que vous souhaitez "écouter" pour le signal. Notez que le nœud Timer est rouge - ce n'est *pas* une erreur, mais une indication visuelle que c'est le nœud qui émet le signal. Sélectionnez le nœud racine.
ko: 왼쪽에는 씬의 노드가 표시되고 시그널을 "받는" 노드를 선택할 수 있습니다. Timer 노드는 적색입니다 - 이는 오류가 아니며 신호를 방출하는 노드임을 시각적으로 나타냅니다. 루트 노드를 선택합니다.
pt_br: Do lado esquerdo, você verá os nós na sua cena e pode selecionar o nó que você quer que "escute" para o sinal. Note que o nó Timer está vermelho - isso *não* é um erro, mas é uma indicação visual de que é esse o nó o qual está emitindo o sinal. Selecione o nó raiz.
ru: На левой стороне, вы увидите узлы в вашей сцене и можете выбрать узел, который вы хотите использовать для "прослушки" сигнала. Обратите внимание, что узел Timer является красным - это *не* ошибка, а визуальный признак того, что это узел, который излучает сигнал. Выберите корневой узел.
zh_cn: 在左侧，您将看到您场景中的节点，并可以选择您想要“侦听”的节点信号。需要留意的是，定时器节点变红——这不是一个错误，但它是节点发出信号的视觉提示。选择根节点。

source: The target node *must* have a script attached or you'll receive an error message.
cs: Cílový uzel *musí* mít připojený skript, jinak se zobrazí chybová zpráva.
de: Der Zielknoten *muss* mit einem Skript verbunden sein oder es wird eine Fehlermeldung angezeigt.
es: El nodo target *debe* tener un script adjunto o recibirás un mensaje de error.
fi: Kohdesolmuun *täytyy* olla liitettynä skripti, muutoin saat virheilmoituksen.
fr: Le nœud cible *doit* être associé à un script ou vous recevrez un message d'erreur.
it: Il nodo target *deve* avere uno script attaccato altrimenti riceverai un messaggio di errore.
ja: ターゲットノードにはスクリプトがアタッチされている\ *必要*\ があります。そうしないと、エラーメッセージが表示されます。
ko: 대상 노드는 *반드시* 스크립트가 붙게 되고 그렇지 않으면 오류 메시지를 받습니다.
pl: Docelowy węzeł *musi* mieć dołączony skrypt, w przeciwnym wypadku otrzymasz informację o błędzie.
pt_br: O nó alvo *precisa* ter um script anexado ou você vai receber uma mensagem de erro.
ru: На выбранный узел *должен* быть прикреплен скрипт, иначе вы получите сообщение об ошибке.
uk: До вибраного вузла *повинен* бути доданий скрипт, інакше ви отримаєте повідомлення про помилку.
zh_cn: 目标节点 *必须* 附加一个脚本，否则您将收到一条错误消息。
zh_tw: 目標節點 **必須有** 附加腳本，不然會顯示錯誤訊息。
