Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/singletons_autoload.po
Languages: fr, ko, zh_cn

source: Singletons (AutoLoad)
fr: Singletons (Chargement Automatique)
ko: 싱글톤(오토로드)(Singletons(AutoLoad))
zh_cn: 单例模式（自动加载）

source: Introduction
ko: 소개
zh_cn: 简介

source: Godot's scene system, while powerful and flexible, has a drawback: there is no method for storing information (e.g. a player's score or inventory) that is needed by more than one scene.
fr: Bien que puissant et flexible, le gestionnaire de scène de Godot présente un inconvénient : il n'y a pas de moyen de stocker de l'information (comme le score d'un joueur ou son inventaire) nécessaire à plusieurs scènes.
ko: Godot의 씬 시스템은, 강력하고 유연하지만, 단점이 있습니다: 하나 이상의 씬이 필요하기 때문에 정보를 저장할 방법이 없습니다 (예: 플래이어의 점수나 인벤토리).
zh_cn: Godot的场景系统虽然功能强大且灵活, 但有一个缺点：没有一种方法可以存储多个场景所需的信息 (例如玩家的分数或库存)。

source: It's possible to address this with some workarounds, but they come with their own limitations:
fr: Il est possible de résoudre ceci à l'aide de contournements, mais ceux-ci ont leur propres limites :
ko: 이러한 문제들을 해결할 방법은 있지만, 그것만의 한계점이 있습니다:
zh_cn: 可以通过一些变通办法来解决这个问题, 但它们有自己的局限性：

source: You can use a "master" scene that loads and unloads other scenes as its children. However, this means you can no longer run those scenes individually and expect them to work correctly.
fr: Vous pouvez utiliser une scène "maître" qui charge et décharge d'autres scènes comme ses enfants. Toutefois, cela signifie que vous ne pouvez plus exécuter ces scènes individuellement et vous attendre à ce qu'elles fonctionnent correctement.
ko: 다른 씬을 자식으로 불러오거나 그렇지 않을 "마스터" 씬을 사용할 수 있습니다. 하지만 그렇게 하면 바르게 작동하기 위해 더 이상 씬들을 개별적으로 실행할 수 없다는 것을 의미합니다.
zh_cn: 您可以使用 "主" 场景, 该场景作为子场景加载和卸载其他场景。但是, 这意味着您不能再单独运行这些场景, 并期望它们正常工作。

source: Information can be stored to disk in ``user://`` and then loaded by scenes that require it, but frequently saving and loading data is cumbersome and may be slow.
fr: Bien que des informations puissent être enregistrées sur le disque dans ``user://`` et ensuite qu'elles puissent être chargées par les scènes qui en ont besoin, sauvegarder et charger fréquemment des données peut être lourd et éventuellement lent.
ko: 정보를 ``user://`` 에 저장하고 필요할 때 불러올 수 있습니다, 하지만 자주 데이터를 저장하고 불러오는 것은 성가시고 느려질 수 있습니다.
zh_cn: 信息可以存储在 ``user://`` 中的磁盘, 然后由需要它的场景加载, 但经常保存和加载数据很麻烦, 并且可能很慢。

source: The `Singleton Pattern <https://en.wikipedia.org/wiki/Singleton_pattern>`_ is a useful tool for solving the common use case where you need to store persistent information between scenes. In our case it is possible re-use the same scene or class for multiple singletons, so long as they have different names.
fr: Le ` Patron de Conception Singleton <https://fr.wikipedia.org/wiki/Singleton_(patron_de_conception)>`_ est un outil utile pour résoudre le cas d'utilisation courante où vous devez stocker des informations persistantes entre les scènes. Dans notre cas, il est possible de réutiliser la même scène ou classe pour plusieurs singletons, à condition qu'ils aient des noms différents.
ko: `Singleton Pattern <https://en.wikipedia.org/wiki/Singleton_pattern>`_\ 은 씬들 사이에서 지속적인 정보를 저장하는 일반적인 사례를 해결하는 유용한 도구입니다. 우리의 경우에는 서로 다른 이름을 가진 여러가지 싱글톤을 같은 씬이나 클래스에 재사용할 수 있습니다.
zh_cn: `Singleton Pattern（单例模式） <https://en.wikipedia.org/wiki/Singleton_pattern>`_ 是一个有用的工具, 用于解决需要在场景之间存储持久信息的常见用例。在我们的例子中, 可以将同一个场景或类重新用于多个单例, 只要它们有不同的名称。

source: Using this concept, you can create objects that:
fr: En utilisant ce concept, vous pouvez créer des objets qui :
ko: 이 개념을 사용해서, 다음과 같은 객체를 만드실 수 있습니다:
zh_cn: 使用此概念, 您可以创建以下对象：

source: Are always loaded, no matter which scene is currently running
fr: Sont toujours chargées, quelle que soit la scène qui est ouverte dans l'éditeur
ko: 현재 실행 중인 씬과 상관없이, 항상 불러와집니다
zh_cn: 始终加载, 无论当前正在运行的场景是哪个

source: Can store global variables, such as player information
fr: Peut stocker des variables globales, telles que les informations du joueur
ko: 플레이어 정보와 같은, 전역 변수를 저장할 수 있습니다
zh_cn: 可以存储全局变量, 如玩家信息

source: Can handle switching scenes and between-scene transitions
fr: Peut s'occuper des changements de scènes et des transitions
ko: 씬을 바꾸는 것과 씬 전환 사이를 다룰 수 있습니다
zh_cn: 可以处理切换场景和场景之间的过渡

source: Act like a singleton, since GDScript does not support global variables by design
fr: Agit comme un singleton, puisque GDScript ne supporte pas les variables globales du fait de sa conception
ko: GDScript가 전역 변수를 지원하지 않기 때문에 싱글톤처럼 행동합니다
zh_cn: 表现得像一个单例对象，因为GDScript在设计上不支持全局变量

source: Autoloading nodes and scripts can give us these characteristics.
fr: Les nœuds Autoloading et les scripts répondent à ce besoin.
ko: 노드와 스크립트를 Autoload하는 것은 위와 같은 기능을 제공합니다.

source: AutoLoad
ko: 오토로드
zh_cn: 自动加载(AutoLoad)

source: You can use AutoLoad to load a scene or a script that inherits from :ref:`Node <class_Node>`. Note: when autoloading a script, a Node will be created and the script will be attached to it. This node will be added to the root viewport before any other scenes are loaded.
fr: Vous pouvez utiliser AutoLoad pour charger une scène ou un script qui hérite de :ref:`Node <class_Node>`. Note : lors du chargement automatique d'un script, un Nœud sera créé et le script y sera attaché. Ce nœud sera ajouté à la fenêtre d'affichage racine avant le chargement de toute autre scène.
ko: :ref:`Node <class_Node>` 에서 상속하는 씬이나 스크립트를 불러오기 위해 오토로드(AutoLoad)를 사용할 수 있습니다. 주석: 스크립트를 오토로드 할 떄, 노드가 만들어지고 스크립트가 거기에 붙습니다. 이 노드는 다른 씬이 불러오기 전까지 루트 뷰포트에 추가될 것입니다.
zh_cn: 可以使用“自动加载”加载从节点继承的场景或脚本。注意: 自动加载脚本时, 将创建一个节点, 并将脚本附加到该脚本。在加载任何其他场景之前, 此节点将添加到根视口。

source: To autoload a scene or script, select ``Project -> Project Settings`` from the menu and switch to the "AutoLoad" tab.
fr: Pour charger automatiquement une scène ou un script, sélectionnez ``Projet -> Paramètres du projet`` depuis le menu puis allez à l'onglet AutoLoad.
ko: 씬이나 스크립트를 오토로드 하기 위해, 메뉴에서 ``프로젝트 -> 프로젝트 설정`` 을 선택하고 "오토로드" 탭으로 갑니다.
zh_cn: 要自动加载场景或脚本, 请从菜单中选择 "项目-> 项目设置", 然后切换到 "自动加载" 选项卡。

source: Here you can add any number of scenes or scripts. Each entry in the list requires a name, which is assigned as the node's ``name`` property. The order of the entries as they are added to the global scene tree can be manipulated using the up/down arrow keys.
fr: Ici, vous pouvez ajouter un nombre illimité de scènes ou de scripts. Chaque entrée de la liste nécessite un nom, qui est assigné comme propriété ``nom`' du nœud. L'ordre des entrées telles qu'elles sont ajoutées à l'arborescence de scène globale peut être manipulé à l'aide des touches fléchées haut/bas.
ko: 여기서 원하는 씬이나 스크립트를 추가하실 수 있습니다. 목록에서 각 항목에는 노드의 ``name`` 속성으로 지정하는 이름이 필요합니다. 전역 씬 트리에 추가된 항목의 순서는 위/아래 방향키를 사용해 조작할 수 있습니다.
zh_cn: 在这里, 您可以添加任意数量的场景或脚本。列表中的每个条目都需要一个名称, 该名称分配给节点的 ``name`` 属性。可以使用向上箭头键操作添加到全局场景树中的条目的顺序。

source: This means that any node can access a singleton named "PlayerVariables" with:
fr: Cela veut dire que n'importe quel nœud peut accéder à un singleton appelé "PlayerVariables" avec :
ko: 위의 경우, 어느 노드든지 "PlayerVariables" 라는 싱글톤을 액세스 할 수 있습니다:
zh_cn: 这意味着任何节点都可以使用以下方式访问名为“PlayerVariables”的单例：

source: If the "Enable" column is checked (default true) then the singleton can simply be accessed directly:
fr: Si la colonne "Activer" est cochée (vrai par défaut), vous pouvez simplement accéder directement au singleton :
ko: "Enable" 항목이 체크 되어 있다면 (기본값은 true) 싱글톤은 쉽게 직접 액세스 될 수 있습니다:
zh_cn: 如果选中了“Enable”列 (默认为 true), 则只需直接访问单例：

source: Note that autoload objects (scripts and/or scenes) are accessed just like any other node in the scene tree. In fact, if you look at the running scene tree, you'll see the autoloaded nodes appear:
fr: Notez que les objets chargés automatiquement (scripts et/ou scènes) sont accessibles comme n'importe quel autre nœud dans l'arborescence de la scène. En fait, si vous examinez l'arborescence de la scène en cours d'exécution, vous verrez que les nœuds auto-chargés apparaissent :
ko: 씬 트리에서 다른 노드와 마찬가지로 오토로드 객체 (스크립트 혹은 씬)는 액세스됩니다. 사실, 실행하는 씬 트리를 보신다면, 오토로드 된 노드가 나타나는 것을 보실 수 있습니다:
zh_cn: 请注意, 自动加载对象 (脚本和场景) 的访问方式与场景树中的任何其他节点相同。事实上, 如果你查看正在运行的场景树, 你将看到自动加载的节点出现：

source: Custom scene switcher
fr: Sélecteur de scène personnalisé
ko: 커스텀 씬 전환기
zh_cn: 自定义场景切换器

source: This tutorial will demonstrate building a scene switcher using autoload. For basic scene switching, you can use the :ref:`SceneTree.change_scene() <class_SceneTree_method_change_scene>` method (see :ref:`doc_scene_tree` for details). However, if you need more complex behavior when changing scenes, this method provides more functionality.
fr: Ce court tutoriel vous expliquera comment faire un sélecteur de scènes avec l'auto-chargement. Pour une sélection simple de scène, la méthode :ref:`SceneTree.change_scene() class_SceneTree_method_change_scene>` suffit (décrite dans:ref:`doc_scene_tree`), donc cette méthode convient pour des comportements plus complexes lorsqu'il s'agit de jongler entre les scènes.
ko: 이 튜토리얼은 오토로드를 사용해 씬 전환기를 만드는 법을 설명할 것입니다. 기본 씬 전환을 위해, :ref:`SceneTree.change_scene() <class_SceneTree_method_change_scene>` 메서드를 사용할 수 있습니다 (자세한 점은 :ref:`doc_scene_tree`\ 를 참고하세요). 하지만, 씬을 전환할 때 더 복잡한 행동을 원한다면, 이 메서드가 더 많은 기능성을 제공합니다.

source: To begin, download the template from here: :download:`autoload.zip <files/autoload.zip>` and open it in Godot.
fr: D'abord télécharger le modèle à partir d'ici : :download:`autoload.zip <files/autoload.zip>` , ensuite, l'ouvrir dans Godot.
ko: 시작하기 위해, 여기서 템플릿을 다운로드 하시고 :download:`autoload.zip <files/autoload.zip>` 그리고 Godot에서 여세요.
zh_cn: 首先, 从这里下载模板： :download:`autoload.zip <files/autoload.zip>` 然后在Godot中打开它。

source: The project contains two scenes: ``Scene1.tscn`` and ``Scene2.tscn``. Each scene contains a label displaying the scene name and a button with its ``pressed()`` signal connected. When you run the project, it starts in ``Scene1.tscn``. However, pressing the button does nothing.
fr: Le projet contient deux scènes : ``Scene1.tscn`` et ``Scene2.tscn``. Chaque scène contient une étiquette affichant le nom de la scène et un bouton avec son signal ``pressé()`` actif. Quand vous exécutez le projet, il démarre à ``Scene1.tscn``. Cependant, appuyer sur le bouton ne fait rien.
ko: 프로젝트는 두 개의 씬을 갖고 있습니다: ``Scene1.tscn`` 과 ``Scene2.tscn`` 입니다. 각 씬은 씬의 이름을 보여주는 라벨과 ``pressed()`` 시그널이 연결된 버튼이 있습니다. 프로젝트를 실행할 때, ``Scene1.tscn`` 에서 시작합니다. 하지만, 버튼을 눌러도 아무렇지 않습니다.
zh_cn: 该项目包含两个场景： ``Scene1.tscn`` 和 ``Scene2.tscn``。每个场景都包含一个显示场景名称的标签和一个连接了 ``pressed()`` 信号的按钮。当您运行该项目时, 它将从 ``Scene1.tscn``开始。但是, 按下按钮不会执行任何操作。

source: Switch to the "Script" tab and create a new script called Global.gd. Make sure it inherits from ``Node``:
fr: Passez à l'onglet "Script" et créez un nouveau script appelé Global.gd. Assurez-vous qu'il hérite de `` Node`` :
ko: "Script" 탭으로 전환하고 Global.gd 라는 새 스크립트를 만듭니다. ``Node`` 에서 상속하도록 하십시오:
zh_cn: 切换到 "Script" 选项卡, 并创建一个名为“Global.gd”的新脚本。确保它从 ``Node`` 继承：

source: The next step is to add this script to the autoLoad list. Open ``Project > Project Settings`` from the menu, switch to the "AutoLoad" tab and select the script by clicking the ``..`` button or typing its path: ``res://Global.gd``. Press "Add" to add it to the autoload list:
fr: L'étape suivante consiste à ajouter ce script à la liste d'auto-chargement. Ouvrez ``Projet > Paramètres du projet`` dans le menu, allez dans l'onglet "AutoLoad" et sélectionnez le script en cliquant sur le bouton ``..`` ou en tapant son chemin : ``res://Global.gd``. Appuyez sur "Ajouter" pour l'ajouter à la liste d'auto-chargement :
ko: 다음은 이 스크립트를 오토로드 목록으로 추가하는 것입니다. 메뉴에서 ``프로젝트 > 프로젝트 설정`` 을 열고, "오토로드" 탭으로 가서 ``..`` 를 클릭하거나 경로 ``res://Global.gd`` 를 입력해서 스크립트를 선택합니다. "추가"를 눌러 오토로드 목록에 추가하십시오:
zh_cn: 下一步是将此脚本添加到自动加载列表中。从菜单中打开 ``项目 > 项目设置`` , 切换到“自动加载”选项卡, 然后单击 ``..``按钮或键入其路径： ``res://Global.gd``。按“添加”将其添加到自动加载列表：

source: Now whenever we run any scene in the project, this script will always be loaded.
fr: Maintenant, chaque fois que vous lancez n'importe laquelle de vos scènes, le script sera toujours chargé.
ko: 이제 언제든지 우리는 어떤 씬이 프로젝트에서 실행하든지, 이 스크립트가 항상 불러와질 것입니다.
zh_cn: 现在, 每当我们运行项目中的任何场景时, 都会始终加载此脚本。

source: Returning to the script, it needs to fetch the current scene in the `_ready()` function. Both the current scene (the one with the button) and ``global.gd`` are children of root, but autoloaded nodes are always first. This means that the last child of root is always the loaded scene.
fr: Revenant au script, il doit récupérer la scène en cours dans la fonction `_ready ()`. La scène actuelle (celle avec le bouton) et `` global.gd`` sont des enfants de root, mais les nœuds auto-chargés sont toujours les premiers. Cela veut dire que le dernier enfant de root est toujours la scène chargée.
ko: 스크립트로 돌아가서, `_ready()` 함수에서 현재 씬을 가져와야 합니다. (버튼이 있는) 현재 씬과 ``global.gd`` 는 둘 다 루트의 자식이지만, 오토로드 된 노드는 항상 첫 번째 입니다. 즉, 루트의 마지막 자식은 항상 불러온 씬이라는 것입니다.
zh_cn: 返回到脚本, 它需要获取 `_ready()` 函数中的当前场景。当前场景 (带有按钮的场景) 和 ``global.gd`` 都是根的子节点, 但自动加载的节点始终是第一位的。这意味着根的最后一个子项始终是加载的场景。

source: Now we need a function for changing the scene. This function needs to free the current scene and replace it with the requested one.
fr: La prochaine étape est la fonction de changement de scène. Cette fonction libère la scène en cours et la remplace par celle demandée.
ko: 이제, 우리는 씬을 바꾸기 위한 함수가 필요합니다. 이 함수는 현재 씬을 해제하고 요청하는 것으로 바꾸어야 합니다.
zh_cn: 现在我们需要一个用于更改场景的函数。此函数需要释放当前场景, 并将其替换为请求的场景。

source: Using :ref:`Object.call_deferred() <class_Object_method_call_deferred>`, the second function will only run once all code from the current scene has completed. Thus, the current scene will not be removed while it is still being used (i.e. its code is still running).
fr: Avec: ref: `Object.call_deferred () <class_Object_method_call_deferred>`, la deuxième fonction ne sera exécutée que lorsque tout le code de la scène actuelle sera terminé. Ainsi, la scène en cours ne sera pas supprimée tant qu’elle est encore utilisée (c’est-à-dire que son code est toujours en cours d’exécution).
ko: :ref:`Object.call_deferred() <class_Object_method_call_deferred>` 를 사용한다면 두 번째 기능은 현재 씬의 코드가 모두 종료되었을 때 실행된다. 따라서, 현재 씬은 그것이 사용되고 있을 때 까지 제거되지 않을 것이다.

source: Finally, we need to fill the empty callback functions in the two scenes:
fr: Enfin, nous devons remplir les fonctions de rappel vides dans les deux scènes :
ko: 마지막으로, 두 씬에 비어있는 콜백 함수를 채워야 합니다:
zh_cn: 最后, 我们需要在两个场景中填充空回调函数：

source: and
fr: et
ko: 그리고
zh_cn: 以及

source: Run the project and test that you can switch between scenes by pressing the button.
fr: Maintenant, si vous lancez le projet, vous pouvez basculer entre les deux scènes en appuyant sur le bouton.
ko: 프로젝트를 실행하고 버튼을 누를 때 씬이 바뀌는지 확인해보세요.

source: Note: When scenes are small, the transition is instantaneous. However, if your scenes are more complex, they may take a noticeable amount of time to appear. To learn how to handle this, see the next tutorial: :ref:`doc_background_loading`
fr: Remarque: lorsque les scènes sont petites, la transition est instantanée. Cependant, si vos scènes sont plus complexes, leur affichage peut prendre un certain temps. Pour apprendre à gérer cela, consultez le tutoriel suivant : :ref:`doc_background_loading`
ko: 주석: 씬이 작을 때, 전환은 동시에 일어납니다. 하지만 씬이 더 복잡하다면, 눈에 띄는 시간 차가 발생합니다. 어떻게 이를 다루는 지 배우기 위해, 다음 튜토리얼을 확인하세요: :ref:`doc_background_loading`
zh_cn: 注意：当场景较小时, 转换是即时的。但是, 如果您的场景比较复杂, 则可能需要相当长的时间才能显示。若要了解如何处理此问题, 请参阅下一个教程： :ref:`doc_background_loading`

source: Autoloading nodes and scripts caters to this need.
zh_cn: 自动加载节点和脚本可满足这一需求。

source: This tutorial will demonstrate building a scene switcher using autoload. For basic scene switching, you can use the :ref:`SceneTree.change_scene() <class_SceneTree_change_scene>` method (see :ref:`doc_scene_tree` for details). However, if you need more complex behavior when changing scenes, this method provides more functionality.
zh_cn: 本教程将演示如何使用自动加载构建场景切换器。对于基本场景切换, 您可以使用 :ref:`SceneTree.change_scene() <class_SceneTree_change_scene>` 方法（有关详细信息, 请参阅 :ref:`doc_scene_tree` ）。但是, 如果在更改场景时需要更复杂的行为, 此方法将提供更多功能。

source: As mentioned in the comments above, we need to avoid the situation of deleting the current scene while it is still being used (i.e. its code is still running), so using :ref:`Object.call_deferred() <class_Object_call_deferred>` is required at this point. The result is that the second function will run at a later time when any code from the current scene has completed.
zh_cn: 如上面的注释中所述, 我们需要避免在当前场景仍在使用时将其删除的情况 (即其代码仍在运行), 因此此时需要使用 :ref:`Object.call_deferred() <class_Object_call_deferred>` 。其结果是, 第二个函数将在以后当前场景中的任何代码完成后运行。

source: Run the project and test that you can switch between scenes by pressing the button!
zh_cn: 运行项目和测试, 您可以通过按下按钮在场景之间切换!
