Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/splash_screen.po
Languages: cs, de, es, fr, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Splash screen
cs: Úvodní obrazovka
de: Begrüßungsbildschirm
es: Pantalla de introducción
fr: Écran de lancement
ja: スプラッシュ・スクリーン
ko: 스플래시 화면
pl: Ekran powitalny
pt_br: Tela de abertura
ru: Заставка
uk: Вікно привітання
zh_cn: 闪屏
zh_tw: 啟動畫面

source: Tutorial
cs: Tutoriál
fr: Tutoriel
ja: チュートリアル
ko: 튜토리얼
pl: Samouczek
ru: Учебное пособие
uk: Навчання
zh_cn: 教程
zh_tw: 教學

source: This is a simple tutorial to establish the basic idea of how the GUI subsystem works. The goal is to create a simple, static splash screen.
cs: Jedná se o jednoduchý tutoriál, který slouží k vytvoření základní představy o fungování subsystému grafického uživatelského rozhraní. Cílem je vytvořit jednoduchou statickou úvodní obrazovku.
de: Dies ist ein einfaches Tutorial, um die grundlegende Funktionsweise des GUI-Subsystems zu vermitteln. Ziel ist es, einen einfachen, statischen Begrüßungsbildschirm zu erstellen.
es: Este es un tutorial simple para establecer la idea básica de cómo funciona el subsistema de GUI. El objetivo es crear una pantalla de introducción estática simple.
fr: Ceci est un tutoriel simple pour établir l'idée de base du fonctionnement du sous système GUI. Le but est de créer un écran de lancement statique simple.
ja: これは、GUIサブシステムの仕組みの基本的な考え方を確立するための簡単なチュートリアルです。目標は、シンプルで静的なスプラッシュスクリーンを作成することです。
ko: 이것은 어떻게 GUI 서브 시스템이 작동하는 지에 대한 기본 생각을 세우는 간단한 튜토리얼입니다. 목표는 간단한, 정적인 스플래시 화면을 만드는 것입니다.
pl: Jest to prosty samouczek mający na celu ustalenie podstawowej koncepcji działania podsystemu GUI. Celem jest stworzenie prostego, statycznego ekranu powitalnego.
pt_br: Este é um tutorial simples para estabelecer a ideia básica de como o subsistema da GUI funciona. O objetivo é criar uma tela inicial simples e estática.
ru: Это простое руководство по созданию базовой идеи работы подсистемы GUI. Цель заключается в создании простой статической заставки.
uk: Цей простий урок познайомить вас із роботою підсистеми GUI. Мета - створити простий, статичний екран привітання.
zh_cn: 这是一个简单的教程，用来建立GUI子系统如何工作的基本概念。目标是创建一个简单的静态启动屏幕。
zh_tw: 這是一個很簡單的教學，用來讓你理解 GUI 子系統運作的基本概念。教學的目標就是要製作一個簡單的靜態啟動畫面。

source: Following is a file with the assets that will be used. The extracted files can be placed directly in your project folder and Godot will import them automatically.
cs: Následuje soubor se zdroji, které budou použity. Rozbalené soubory můžete umístit přímo do složky projektu a Godot je automaticky importuje.
de: Nachfolgend findest Du eine Datei mit den Assets, die verwendet werden. Die extrahierten Dateien können direkt in Deinem Projektordner abgelegt werden und werden von Godot automatisch importiert.
es: El siguiente archivo contiene los recursos que se utilizarán. Los archivos extraídos pueden colocarse directamente en la carpeta del proyecto y Godot los importará automaticamente.
fr: Ce qui suit est un fichier avec les assets qui seront utilisés. Les fichiers extraits peuvent être placés directement dans votre dossier de projet et Godot va les importer automatiquement.
ja: 以下は、使用する素材のファイルです。 抽出されたファイルはあなたのプロジェクトフォルダに直接置くことができ、Godotはそれらを自動的にインポートします。
ko: 다음은 우리가 사용할 파일과 애셋입니다. 추출된 파일을 직접 프로젝트 폴더에 놓으면 Godot가 자동으로 가져올 것입니다.
pl: Poniżej znajduje się plik z zasobami, które będą używane. Rozpakowane pliki można umieścić bezpośrednio w folderze projektu, a Godot automatycznie je zaimportuje.
pt_br: A seguir, um arquivo com os ativos que serão usados. Os arquivos extraídos podem ser colocados diretamente na pasta do seu projeto e Godot irá importá-los automaticamente.
ru: Ниже приведен файл с файлами, которые будут использоваться. Извлеченные файлы можно поместить непосредственно в папку проекта, и Godot импортирует их автоматически.
uk: Нижче знаходиться файл з ресурсами, які будуть використані. Витягнуті файли можна розмістити безпосередньо у теці проєкту, і Godot імпортує їх автоматично.
zh_cn: 下面是一个包含将要使用的资源的文件。提取的文件可以直接放在项目文件夹中，Godot会自动导入它们。
zh_tw: 下面這個檔案包含了所有要用到的資源。解壓縮後的檔案可以直接放在專案資料夾內，Godot 會自動匯入。

source: :download:`robisplash_assets.zip <files/robisplash_assets.zip>`.
ja: ダウンロード :download:`robisplash_assets.zip <files/robisplash_assets.zip>`.
ru: Скачать: :download:`robisplash_assets.zip <files/robisplash_assets.zip>`.

source: Setting up
cs: Nastavení
de: Einrichtung
es: Configurando
fr: Mise en place
ja: セットアップ
ko: 설정하기
pl: Konfigurowanie
pt_br: Configurando
ru: Настройка
uk: Налаштування
zh_cn: 设置
zh_tw: 設定

source: Set the display resolution to 800x450 in Project Settings, and set up a new scene like this:
cs: V Nastavení projektu nastavte rozlišení displeje na 800x450 a vytvořte novou scénu takto:
de: Stelle die Anzeigeauflösung in den Projekteinstellungen auf 800 x 450 ein und richte eine neue Szene wie folgt ein:
es: Ajusta la resolución de la pantalla a 800x450 en Ajustes del Proyecto y configura una nueva escena como ésta:
fr: Mettez la résolution d'affichage à 800x450 depuis les Paramètre du Projet, et organisez la nouvelle scène comme cela :
ja: Project Settingsで表示解像度を800 x 450に設定し、次のように新しいシーンを設定します:
ko: 프로젝트 설정에서 화면 비율을 800X450으로 설정하세요, 그리고 새 씬을 다음과 같이 설정하세요:
pl: W ustawieniach projektu ustaw rozdzielczość wyświetlacza na 800x450 i skonfiguruj nową scenę w ten sposób:
pt_br: Defina a resolução de exibição para 800x450 em Configurações do projeto e configure uma nova cena como esta:
ru: Установите разрешение экрана 800x450 в Настройках проекта и создайте новую сцену, как та что показана ниже:
uk: Встановіть роздільну здатність екрана в 800x450 у Параметрах проєкту, створіть нову сцену та налаштуйте її за наведеним зразком:
zh_cn: 在项目设置中设置显示分辨率为800x450，新建场景如下:
zh_tw: 在專案設定中將螢幕解析度設為 800x450，並如下設定一個新場景：

source: The nodes "background" and "logo" are of :ref:`TextureRect <class_TextureRect>` type. To display an image, drag the corresponding asset to the texture property.
cs: Uzly ``background`` a ``logo`` jsou typu :ref:`TextureRect <class_TextureRect>`. Chcete-li zobrazit obrázek, přetáhněte odpovídající aktivum do vlastnosti textura.
de: Die Nodes "Hintergrund" und "Logo" sind vom Typ :ref:`TextureRect <class_TextureRect>`. Um ein Bild anzuzeigen, ziehe das entsprechende Asset in die Textur-Eigenschaft.
es: Los nodos "background" y "logo" son del tipo :ref:`TextureRect <class_TextureRect>`. Para mostrar una imagen, arrastra el recurso correspondiente a la propiedad texture.
fr: Les nœuds "background" et "logo" sont du type :ref:`TextureRect <class_TextureRect>`. Pour afficher une image, glissez l'asset correspondant sur la propriété texture.
ja: ノード「背景」と「ロゴ」は\ :ref:`TextureRect <class_TextureRect>`\ 型です。画像を表示するには、対応するアセットをテクスチャプロパティにドラッグします。
ko: "background"와 "logo" 노드는 :ref:`TextureRect <class_TextureRect>` 타입 입니다. 이미지를 보이기 위해, 해당하는 애셋을 텍스처 속성으로 끌어옵니다.
pl: Węzły "background" i "logo" są typu :ref:`TextureRect <class_TextureRect>`. Aby wyświetlić obraz, przeciągnij odpowiedni składnik zasobów na właściwości tekstury.
pt_br: Os nós "background" e "logo" são do tipo: ref: `TextureRect <class_TextureRect>`. Para exibir uma imagem, arraste o ativo correspondente para a propriedade texture.
ru: Узлы "background" и "logo" имеют тип :ref:`TextureRect <class_TextureRect>`. Чтобы отобразить изображение, перетащите соответствующий ресурс в свойство Texture.
uk: Вузли "background" та "logo" мають тип :ref:`TextureRect <class_TextureRect>`. Щоб показати зображення, перетягніть відповідний ресурс до властивості текстури (Texture).
zh_cn: 节点 `background` 和 `logo` 的类型为 :ref:`TextureRect <class_TextureRect>` 类型。若要显示图像，请将对应的资源拖动到纹理属性。
zh_tw: 節點「background」與「logo」為 :ref:`TextureRect <class_TextureRect>` 型別。要顯示圖片，將對應的圖片資源拖移至 texture 屬性內。

source: The node "start" is a :ref:`TextureButton <class_TextureButton>`. It takes several images for different states, but only the normal and pressed will be supplied in this example:
cs: Uzel ``start`` je :ref:`TextureButton <class_TextureButton>`. Přebírá několik obrázků pro různé stavy, ale v tomto příkladu bude dodán pouze normální a stisknutý:
de: Der Node "start" ist ein :ref:`TextureButton <class_TextureButton>`. Es werden mehrere Bilder für verschiedene Zustände benötigt, in diesem Beispiel werden jedoch nur die Bilder für den normalen und gedrückten Zustand verwendet:
es: El nodo "start"es un :ref:`TextureButton <class_TextureButton>`. Utiliza varias imágenes para diferentes estados, pero sólo se usarán la normal y pressed en este ejemplo:
fr: Le nœud "start" est un :ref:`TextureButton <class_TextureButton>`. Il accepte plusieurs images pour différents états, mais nous traiterons uniquement les états "normal" et "pressé" dans cet exemple :
ja: ノード "start" は \ :ref:`TextureButton <class_TextureButton>`\ です。この例では、さまざまな状態の複数のイメージを取得しますが、NormalとPressedのイメージだけが提供されます:
ko: "start" 노드는 :ref:`TextureButton <class_TextureButton>` 입니다. 각기 다른 상태에 따라 여러 이미지를 가질 수 있지만, 이 예제에서는 normal과 pressed만 갖습니다:
pt_br: O nó "start" é um: ref: `TextureButton <class_TextureButton>`. São necessárias várias imagens para estados diferentes, mas somente o estado normal e pressionado serão conhecidos neste exemplo:
ru: Узел "start" представляет собой :ref:`TextureButton <class_TextureButton>`. Он имеет несколько изображений для разных состояний, но только обычные и нажатые будут поставляться в этом примере:
uk: Вузол "start" - це :ref:`TextureButton <class_TextureButton>`. Потрібно кілька зображень для різних станів, але в цьому прикладі подаються лише нормальний та натиснутий:
zh_cn: 节点`start`是 :ref:`TextureButton <class_TextureButton>` 。它为不同的状态拍了几张照片，但是在这个示例中只提供了正常的和按下的图像:
zh_tw: 節點「start」為 :ref:`TextureButton <class_TextureButton>` 。這個節點每個不同的狀態需要不同的圖片，但在這個教學中只用到 normal 與 pressed：

source: Finally, the node "copyright" is a :ref:`Label <class_Label>`.
cs: Konečně uzel ``copyright`` je :ref:`Label <class_Label>`.
de: Zuletzt ist der Node "copyright" ein :ref:`Label <class_Label>`.
es: Finalmente, el nodo "copyright" es un :ref:`Label <class_Label>`.
fr: Enfin, le nœud "copyright" est un :ref:`Label <class_Label>`.
ja: 最後に、ノード "copyright" は \ :ref:`Label <class_Label>` です。
ko: 마지막으로 "copyright" 노드는 :ref:`Label <class_Label>` 입니다.
pl: Wreszcie, węzłem "copyright" jest :ref:`Label <class_Label>`.
pt_br: Finalmente, o nó "copyright" é um: ref: `Label <class_Label>`.
ru: Наконец, узел "copyright" представляет собой :ref:`Label <class_Label>`.
uk: Нарешті, вузол "copyright" - це :ref:`Label <class_Label>`.
zh_cn: 最后，节点 `copyright` 是一个 :ref:`Label <class_Label>`。
zh_tw: 最後，「copyright」節點為 :ref:`Label <class_Label>` 。

source: Your final scene should look something like this.
cs: Vaše finální scéna by měla vypadat přibližně takto.
de: Ihre fertige Szene sollte ungefähr so aussehen.
es: La escena final debería verse similar a esta.
fr: Votre scène finale devrait ressembler à peu près à cela.
ja: 最終的なシーンは次のようになります。
ko: 당신의 최종 씬은 이렇게 보여야 할 것입니다.
pl: Twoja ostatnia scena powinna wyglądać tak.
pt_br: Sua cena final deve ser algo como isto.
ru: В итоге ваша сцена должна выглядеть примерно так.
uk: Ваша заключна сцена повинна виглядати приблизно так.
zh_cn: 您最后的场景应该是这样的。
zh_tw: 最後場景應該長這樣。

source: Go ahead and run the project. If you're satisfied with the results, continue to the next tutorial.
cs: Pokračujte a spusťte projekt. Pokud jste s výsledky spokojeni, pokračujte dalším návodem.
de: Fahre fort in dem Du das Projekt ausführst. Wenn Du mit den Ergebnissen zufrieden bist, fahre mit dem nächsten Tutorial fort.
es: Adelante, ejecuta el proyecto. Si estás satisfecho con los resultados, continúa con el siguiente tutorial.
fr: Lancez le projet. Si vous êtes satisfait des résultats, passez au tutoriel suivant.
ja: プロジェクトを実行します。結果に満足したら、次のチュートリアルに進みます。
ko: 프로젝트를 실행합시다. 결과물에 만족한다면, 다음 튜토리얼을 계속 진행합니다.
pl: Uruchom projekt. Jeśli jesteś zadowolony z rezultatu, przejdź do następnego samouczka.
pt_br: Vá em frente e execute o projeto. Se você estiver satisfeito com os resultados, continue para o próximo tutorial.
ru: Давайте! Запустите проект! Если вы удовлетворены результатом, перейдите к следующему уроку.
uk: Тепер запускайте проєкт. Якщо ви задоволені результатом, переходьте до наступного уроку.
zh_cn: 继续运行这个项目。如果您对结果满意，请继续学习下一个教程。
zh_tw: 接著執行專案。如果你覺得結果不錯的話，請繼續下一個教學。
