Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_code_a_life_bar.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, zh_cn, zh_tw

source: This is typical of how you'd code a game: you implement the core gameplay first, handle the player's death, and only then you'll add the interface. That's because the UI listens to what's happening in the game. So it can't work if other systems aren't in place yet. If you design the UI before you prototype and test the gameplay, chances are it won't work well and you'll have to re-create it from scratch.
cs: To je typický způsob jak by se měly vytvářet hry: nejprve implementujete základní hratelnost, zpracujete smrt hráče a teprve poté přidáte rozhraní. To proto, že uživatelské rozhraní naslouchá tomu, co se děje ve hře. Nemůže tedy fungovat, pokud ještě nejsou zprovozněny ostatní systémy. Pokud navrhnete uživatelské rozhraní dříve, než vytvoříte prototyp hry a otestujete hratelnost, je pravděpodobné, že rozhraní nebude fungovat dobře a budete ho muset vytvořit znovu od začátku.
de: Das ist typisch für jedes Spiel: Als Erstes implementieren Sie die Mechanik, die mit der GUI interagiert, in diesem Fall den Lebensverlust des Spielers, und erst dann fügen Sie die Benutzeroberfläche hinzu. Das liegt daran, dass die UI darauf reagiert was im Spiel geschieht. Somit kann sie nicht korrekt funktionieren, solange der Spielablauf nicht integriert ist und muss unter Umständen von neuem erstellt werden.
es: Esto es típico de como codificarías un juego: primero implementas el núcleo de la mecánica de juego, te encargas del muerto del jugador, y sólo entonces añades la interfaz. Eso es porque la interfaz de usuario escucha lo que pasa en el juego, así que no puede funcionar si los demás sistemas todavía están implementados. Si diseñas la interfaz de usuario antes de construir y probar la mecánica de juego, es probable que no funcionará bien y tendrás que reconstruirlo desde cero.
fr: C'est typique de la façon dont vous codez un jeu : vous implémentez d'abord le gameplay de base, vous gérez la mort du joueur, et seulement ensuite vous ajouterez l'interface. C'est parce que l'interface utilisateur écoute ce qui se passe dans le jeu. Il ne peut donc pas fonctionner si d'autres systèmes ne sont pas encore en place. Si vous concevez l'interface utilisateur avant de prototyper et de tester le gameplay, il y a de fortes chances qu'il ne fonctionnera pas bien et que vous devrez le recréer à partir de zéro.
ja: これは、ゲームのコーディング方法の典型です。まず最初にゲームプレイのコアを実装し、プレイヤー死亡の処理ができてから、ようやくインターフェイスを追加します。なぜなら、UIはゲーム内で起こっていることに耳を傾けているからです。なので、他のシステムがまだ存在していない段階では動きません。ゲームプレイのプロトタイプを作成してテストする前にUIを設計しても、多分うまく機能せずに最初からつくり直すはめになるでしょう。
ko: 이것은 게임을 코딩하는 일반적인 방법입니다: 먼저 핵심 게임 플레이를 구현합니다, 그리고 플레이어의 사망을 다룹니다, 그런 뒤 인터페이스 만을 추가하는 것입니다. UI는 게임에서 무엇이 일어나는지 듣기 때문입니다. 따라서 다른 시스템이 제 자리를 잡지 못한다면 작동할 수 없습니다. 만일 게임 플레이를 테스트하지 않은 채로 UI를 디자인 한다면, 잘 작동하지 않을 수 있으니 처음부터 다시 만들어야 할 수도 있습니다.
pt_br: Isso é típico de como você codificava um jogo: você primeiro implementa a jogabilidade central, controla a morte do jogador e somente então você adicionará a interface. Isso porque a interface do usuário ouve o que está acontecendo no jogo. Portanto, não pode funcionar se outros sistemas ainda não estiverem funcionando. Se você projetar a interface do usuário antes de prototipar e testar a jogabilidade, é provável que ela não funcione bem e você terá que recriá-la do zero.
ru: Это типично для программирования игры: сначала вы реализуете основной геймплей, обрабатываете смерть игрока, и только после вы добавите интерфейс. Это потому, что UI "слушает", что происходит в игре. Поэтому он не может работать, если другие системы еще не готовы. Если вы разработали интерфейс перед созданием прототипа и последующего тестирования игры, скорее всего, он не будет работать хорошо, и вам придется заново создавать его с нуля.
zh_cn: 这是编写游戏代码的典型方式:首先实现核心玩法，处理游戏角色死亡，然后才添加界面。这是因为UI会监听游戏中发生的事情。因此，如果其他系统还没有到位，它就无法工作。如果您在原型和测试游戏玩法之前设计UI，很有可能它不能很好地工作，您必须从头重新创建它。
zh_tw: 這就是我們編寫遊戲程式的典型方法：先實作遊戲的核心，再處理玩家的死亡，然後才新增遊戲界面。這是因為 UI 是監聽遊戲裡發生的事的，所以若其他部分的系統還沒做好 UI 就無法運作。如果在做好遊戲原型與測試遊戲之前就先設計了 UI，那很有可能最後會沒辦法用這個 UI 而需從頭開始重新設計。

source: The scene contains a background sprite, a GUI, and two characters.
cs: Scéna obsahuje sprite pro pozadí, grafické uživatelské rozhraní a dvě postavy.
de: Die Szene enthält einen Hintergrund-Sprite, eine GUI sowie zwei Charaktere.
es: La escena contiene un sprite del fondo, una interfaz gráfica de usuario, y dos personajes.
fr: Cette scène contient un background, une interface graphique, et deux personnages.
ja: シーンには、背景スプライト、GUI、および2つのキャラクターが含まれています。
ko: 씬에는 배경 스프라이트, GUI, 그리고 두 캐릭터가 있습니다.
pt_br: A cena contém uma sprite de fundo, uma GUI e dois caracteres.
ru: Сцена содержит спрайт с фоном игры, графический интерфейс и два персонажа.
zh_cn: 场景包含一个背景精灵、一个GUI和两个角色。
zh_tw: 這個場景包含了一個背景 Sprite、GUI、以及兩個角色。

source: The scene tree, with the GUI scene set to display its children
cs: Strom scén se scénou GUI nastavenou tak, aby zobrazovala své podřízené položky
de: Der Szenenbaum mit der GUI Szene ist so gesetzt, dass die Kinder angezeigt werden
es: El árbol de escena, con la escena GUI puesto para mostrar sus hijos
fr: L'arbre des scènes, avec la scène de l'interface graphique pour afficher ses enfants
ja: シーンツリー (GUIシーンの子を表示するように設定)
ko: GUI 씬이 자식으로 보이게 놓은 씬 트리
pt_br: A árvore de cena, com a cena GUI configurada para exibir seus filhos
ru: Дерево сцены, с GUI которая отображает своих детей
zh_cn: 场景树，用GUI场景设置来显示它的子对象
zh_tw: 場景樹，設定了讓 GUI 場景顯示其子節點

source: The GUI scene encapsulates all of the game's Graphical User Interface. It comes with a barebones script where we get the path to nodes that exist inside the scene:
cs: Scéna GUI obsahuje celé grafické uživatelské rozhraní hry. Je dodávána se základním skriptem, ve kterém získáme cestu k uzlům, které existují uvnitř této scény:
de: Die GUI-Szene kapselt die gesamte grafische Benutzeroberfläche des Spiels ein. Es wird mit einem Barebones-Skript geliefert, in dem der Pfad zu den Nodes in der Szene angegeben wird:
fr: La scène de l'interface graphique contient tous les éléments de l'interface graphique. Elle est attaché à un script permettant de récupérer les informations des différents éléments de la scène :
ja: GUIシーンは、ゲームのすべてのグラフィカル ユーザーインターフェイス(GUI)をカプセル化します。シーン内に存在するノードへのパスを取得するためのベアボーン スクリプトが付属しています:
ko: GUI 씬은 게임 사용자 인터페이스 전체를 캡슐화 합니다. 씬 안에 존재하는 노드의 경로를 얻는 스크립트와 함께 제공됩니다:
ru: Сцена GUI инкапсулирует весь интерфейс игры. Он идет с каркасом скрипта, где мы получаем путь к узлам, которые существуют внутри сцены:
zh_cn: GUI场景封装了所有的游戏用户界面。它附带了一个基本的脚本，我们可以在其中获得到场景中存在的节点的路径:
zh_tw: GUI 場景封裝了所有遊戲的圖形界面，附帶的腳本預先寫好了取得節點路徑的程式：

source: ``number_label`` displays a life count as a number. It's a ``Label`` node
cs: ``number_label`` zobrazuje počet životů jako číslo. Je to uzel ``Label``
de: ``number_label```zeigt einen Lebenszähler als eine Nummer. Es ist eine ``Label``-Node
es: ``number_label`` muestra un contador de las vidas como número. Es un nodo ``Label``
fr: ``number_label`` fait référence à un nœud ``Label``. Il contient le compteur de vie
ja: ``number_label`` は、残り体力を数値として表示します。 これは ``Label`` ノードです
ko: ``number_label`` 은 체력을 숫자로 보여줍니다. ``Label`` 노드입니다
pt_br: `` number_label`` exibe uma contagem de vida como um número. É um nó `` Label``
ru: ``number_label`` отображает количество здоровья в числовом виде. Это узел ``Label``
zh_cn: ``number_label`` 将生命计数显示为数字。它是一个 ``标签`` 节点
zh_tw: ``number_label`` 用來顯示剩餘的生命值。為一個 ``Label`` 節點

source: ``bar`` is the life bar itself. It's a ``TextureProgress`` node
cs: ``bar`` je samotný ukazatel života. Je to uzel ``TextureProgress``
de: ``bar`` ist die Lebensanzeige, ein ``TextureProgress``-Node
es: ``bar`` es la barra de vida misma. Es un nodo ``TextureProgress``
fr: ``bar`` fait référence à un nœud ``TextureProgress``, permettant de contrôler la barre de vie
ja: ``bar`` はライフバーそのものです。 これは ``TextureProgress`` ノードです
ko: ``bar`` 는 체력 막대입니다. ``TextureProgress`` 노드입니다
pt_br: `` bar`` é a própria barra de vida. É um nó `` TextureProgress``
ru: ``bar`` - сама шкала здоровья. Это узел ``TextureProgress``
zh_cn: ``bar`` 是生命条本身。它是一个 ``TextureProgress`` 节点
zh_tw: ``bar`` 是血槽本身。為一個 ``TextureProgress`` 節點

source: ``tween`` is a component-style node that can animate and control any value or method from any other node
cs: ``tween`` je uzel ve stylu komponenty, který může animovat a ovládat jakoukoli hodnotu nebo metodu z jakéhokoli jiného uzlu
de: ``tween`` ist eine Node im Komponentenstil, die man animieren und ihr verschiedene Werte oder Methoden von anderen Nodes zuweisen kann
es: ``tween`` es un nodo estilo-componente que puede controlar y hacer una animación de cualquier valor o método de cualquier otro nodo
fr: ``tween`` est un nœud de type composant qui permet d'animer et contrôler une valeur ou une méthode de n'importe quel autre nœud
ja: ``tween`` はコンポーネント スタイルなノードで、他のノードにある任意の値またはメソッドをアニメーション化および制御できます。
ko: ``tween`` 은 다른 어떤 노드의 값이나 메서드를 제어하고 움직이게 할 수 있는 구성 요소 스타일의 노드입니다
pt_br: `` tween`` é um nó de estilo de componente que pode animar e controlar qualquer valor ou método de qualquer outro nó
ru: ``tween`` - это узел компонентного стиля, который может анимировать и контролировать любое значение или метод из любого другого узла
zh_cn: ``tween`` 是一个组件样式的节点，它可以动画和控制来自任何其他节点的任何值或方法
zh_tw: ``tween`` 是一個類似元件的節點，用來動畫化其他節點或控制其他節點的任何數值或方法

source: The project uses a simple organisation that works for game jams and tiny games.
es: El proyecto utiliza una organización simple que funciona para los game jams y juegos pequeños.
fr: Le projet utilise une organisation simple fonctionnelle pour les Game Jams et les petits jeux.
pt_br: O projeto usa uma organização simples que funciona para competições de jogos e pequenos jogos.
zh_cn: 该项目使用了一个简单的组织，可以用于游戏jams和小型游戏。

source: At the root of the project, in the `res://` folder, you will find the `LevelMockup`. That's the main game scene and the one we will work with. All the components that make up the game are in the `scenes/` folder. The `assets/` folder contains the game sprites and the font for the HP counter. In the `scripts/` folder you will find the enemy, the player, and the GUI controller scripts.
cs: V kořeni projektu, ve složce `res://`, najdete `LevelMockup`. To je hlavní herní scéna, se kterou budeme pracovat. Všechny komponenty, ze kterých se hra skládá, jsou ve složce `scenes/`. Složka `assets/` obsahuje herní sprity a písmo pro počítadlo HP. Ve složce `scripts/` najdete skripty pro nepřítele, hráče a kontrolu grafického rozhraní.
de: Auf der Wurzelebene des Projekts, im `res://`-Verzeichnis, finden Sie `LevelMockup`. Das ist die Hauptszene des Spiels, mit der wir auch arbeiten werden. Sämtliche Komponenten, aus denen das Spiel besteht, befinden sich im `scenes/`-Ordner. Der `assets/`-Ordner enthält alle Sprites und die Schriftart (Font) für die HP-Anzeige. Unter `scripts/` finden Sie die Objekte für Spieler und Gegner sowie die Controller-Skripte der GUI.
es: En la raíz del proyecto, en la carpeta `res://`, encontrará el `LevelMockup`. Esa es la escena principal del juego y con la que trabajaremos. Todos los componentes que componen el juego están en la carpeta `scenes/`. La carpeta `assets/` contiene los sprites del juego y la fuente para el contador de HP. En la carpeta `scripts/` encontrará el enemigo, el jugador y los scripts del controlador GUI.
fr: A la racine du projet, dans le dossier `res://`, vous trouverez le `LevelMockup`. C'est la scène principale du jeu et notre scène de travail. Tous les éléments qui composent notre jeu sont dans le dossier `scenes/`. Le dossier `assets/` contient toute les sprites et la police pour le compteur de vie. Dans le dossier `scripts/, vous trouverez les scripts contrôlant le joueur, de l'ennemi et l'interface graphique du jeu.
ja: プロジェクトのルートの `res ://` フォルダに `LevelMockup` があります。これがメインのゲームシーンであり、ここで作業します。ゲームを構成するすべてのコンポーネントは、 `scenes/` フォルダにあります。 `assets/` フォルダには、ゲームのスプライトとHPカウンタのフォントが含まれています。 `scripts/` フォルダには、敵のスクリプト、プレイヤーのスクリプト、GUIコントローラのスクリプトがあります。
ko: 프로젝트의 뿌리에서, `res://` 폴더에서, `LevelMockup` 을 찾으실 수 있습니다. 이것이 같이 작업할 메인 게임 씬입니다. 게임을 만들기 위한 모든 구성 요소는 `scenes/` 폴더에 있습니다. `assets/` 폴더는 게임 스프라이트와 HP 카운터를 위한 폰트가 들어있습니다. `scripts/` 폴더에서 적, 플레이어, 그리고 GUI 컨트롤러 스크립트를 찾으실 수 있습니다.
pt_br: Na raiz do projeto, na pasta `res: //`, você encontrará o `LevelMockup`. Essa é a cena principal do jogo e a que vamos trabalhar. Todos os componentes que compõem o jogo estão na pasta `scenes /`. A pasta `assets /` contém os sprites do jogo e a fonte do contador de HP. Na pasta `scripts /`, você encontrará o inimigo, o player e os scripts do controlador GUI.
ru: В корне проекта, в папке `res://` вы найдете `LevelMockup`. Это основная игровая сцена с которой мы будем работать. Все компоненты, составляющие игру, находятся в папке `scenes/`. Папка `assets/` содержит игровые спрайты и шрифт для счетчика HP. В папке `scripts/` вы найдете скрипты для врага, игрока и GUI-контроллера.
zh_cn: 在项目的根目录 *res://* 文件夹中，您将找到 *LevelMockup* 。这是主要的游戏场景，也是我们要学习的内容。构成游戏的所有组件都在*scene /*文件夹中。*assets/*文件夹包含游戏精灵和HP计数器的字体。在*scripts/*文件夹中，您会发现敌人、游戏角色和GUI控制器脚本。
zh_tw: 在專案的根目錄 `res://` 資料夾內有一個 `LabelMockup` 。這個場景是我們要處理的遊戲的主要場景。所有構成遊戲的元件都放在 `scenes/` 資料夾內。 `assets/` 資料夾包含了遊戲的 Sprite 以及給 HP 計數器用的字體。 `scripts/` 資料夾內有敵人、玩家、以及 GUI 控制器 (Controller) 腳本。

source: Click the edit scene icon to the right of the node in the scene tree to open the scene in the editor. You'll see the LifeBar and EnergyBar are sub-scenes themselves.
cs: Kliknutím na ikonu upravit scénu napravo od uzlu ve stromu scén otevřete scénu v editoru. Uvidíte, že LifeBar a EnergyBar jsou samy o sobě dílčími scénami.
de: Klicken Sie auf das Szene-Bearbeiten Symbol auf der rechten Seite des Node in dem Szenenbaum um die Szene im Editor zu öffnen. Sie werden eine LifeBar und EnergieBar sehen, die selbst Unter-Szenen sind.
es: Haz clic en el icono de editar escena a la derecha del nodo en el árbol de escenas para abrir la escena en el editor. Verás que LifeBar y EnergyBar son subescenas en sí mismas.
fr: Cliquez sur l'icône d'édition de scène (Clap) à droite du nœud dans l'arbre des scènes pour ouvrir la scène dans l'éditeur. Vous verrez que la barre de vie et d'énergie sont aussi des sous-scènes.
ja: シーンツリーのノードの右側にあるシーン編集アイコンをクリックして、エディタでシーンを開きます。 「LifeBar」と「EnergyBar」はそれ自体サブシーンです。
ko: 편집기에서 씬 트리 오른쪽의 편집 씬 아이콘을 클릭해서 씬을 엽니다. LifeBar와 EnergyBar 가 하위 씬으로 있는 것을 보실 수 있습니다.
pt_br: Clique no ícone de edição de cena à direita do nó na árvore de cena para abrir a cena no editor. Você verá o LifeBar e o EnergyBar como subcenas.
ru: Щелкните на значок редактирования сцены справа от узла в дереве сцены, чтобы открыть сцену в редакторе. Вы увидите, LifeBar и EnergyBar которые являются под-сценами.
zh_cn: 单击场景树中节点右侧的edit scene图标，在编辑器中打开场景。您会看到LifeBar和EnergyBar本身就是子场景。
zh_tw: 點擊場景樹中節點右邊的編輯場景圖示來在編輯器內打開場景。LifeBar 與 EnergyBar 本身就是子場景。

source: The scene tree, with the Player scene set to display its children
cs: Strom scén se scénou Player nastavenou tak, aby se zobrazily její podřízené scény
de: Der Szenenbaum, mit der ausgewählten Spielerszene und den untergeordneten Elementen
es: El árbol de escenas, con la escena Player lista para mostrar a sus hijos
fr: L'arbre des scènes, avec la scène du joueur ``Player`` ouverte pour afficher ses enfants
ja: シーンツリー (Playerシーンの子を表示するように設定)
ko: Player 씬이 자식으로 설정된 씬 트리
pt_br: A árvore de cena, com a cena Player configurada para exibir seus filhos
ru: Дерево сцены с Player и его детьми
zh_cn: 场景树，用游戏角色场景设置来显示它的子节点
zh_tw: 場景樹，Player 場景設定為顯示其子節點

source: Set up the Lifebar with the Player's max\_health
cs: Nastavení ukazatele život na maximální hodnotu zdraví hráče
de: Richte den Lebensbalken mit der maximalen Gesundheit des Spielers ein
es: Configura el Lifebar del Player con max\_health
fr: Initialiser la barre de vie avec la valeur maximale de vie du joueur
ja: プレイヤーのmax\_healthを使用してライフバーをセットアップする
ko: 플레이어의 max\_health로 Lifebar 설정하기
pt_br: Configurar a barra de vida com o máximo de segurança do jogador
ru: Установка параметра Player max\_health (Максимальное здоровье) для LifeBar'a
zh_cn: 用游戏角色的最大生命值设置生命条
zh_tw: 使用玩家的 max\_health 來設定 Lifebar

source: We have to tell the GUI somehow what the player's current health is, to update the lifebar's texture, and to display the remaining health in the HP counter in the top left corner of the screen. To do this we send the player's health to the GUI every time they take damage. The GUI will then update the ``Lifebar`` and ``Number`` nodes with this value.
cs: Musíme grafickému uživatelskému rozhraní (GUI) nějak sdělit, jaké je aktuální zdraví hráče, aktualizovat texturu panelu života a zobrazit zbývající zdraví v počítadle HP v levém horním rohu obrazovky. Za tímto účelem odešleme grafickému uživatelskému rozhraní údaje o zdraví hráče pokaždé, když utrpí poškození. Grafické uživatelské rozhraní pak o tuto hodnotu aktualizuje uzly ``Lifebar`` a ``Number``.
de: Wir müssen der GUI irgendwie mitteilen, wie der aktuelle Gesundheitszustand des Players ist, die Textur des Lebensbalkens aktualisieren und den verbleibenden Gesundheitszustand im HP-Zähler in der oberen linken Ecke des Bildschirms anzeigen. Dazu senden wir die Gesundheit des Spielers bei jedem Schaden an die GUI. Die GUI aktualisiert dann die Nodes ``Lifebar`` und ``Number`` mit diesem Wert.
es: Tenemos que decirle al GUI de alguna manera cuál es la salud actual del jugador, para actualizar la textura de la barra de vida, y para mostrar la salud restante en el contador de HP en la esquina superior izquierda de la pantalla. Para ello enviamos la salud del jugador a la GUI cada vez que sufre un daño. La GUI actualizará los nodos ``Lifebar`` y ``Number`` con este valor.
fr: On doit donner l 'information à l’interface graphique du nombre de points de vie actuel du joueur, pour mettre à jour la texture de la barre de vie, et afficher le nombre de points de vie restant du joueur dans le compteur en dans le coin haut droit de l'écran. Pour faire cela, on envoie la vie du joueur à l’interface graphique à chaque fois que le joueur prends un coup. Une fois reçu, on mets à jour les nœuds ``Lifebar``et ``Number``avec cette valeur.
ja: プレイヤーの現在の状態を何らかの方法でGUIに伝え、ライフバーのテクスチャを更新し、残りの体力を画面左上のHPカウンターに表示する必要があります。そのために、プレイヤーがダメージを受けるたびに、プレイヤーの体力をGUIに送信します。GUIは、この値で ``Lifebar`` ノードと ``Number`` ノードを更新します。
ko: 우리는 GUI가 플레이어의 현재 체력이 어떤지 알려주고, 체력 막대의 텍스처를 업데이트하고, 화면 좌측 상단에서 HP 카운터가 남은 체력을 보여주어야 합니다. 그러기 위해 우리는 플레이어가 피해를 입을 때마다 체력을 GUI로 보내야 합니다. GUI는 ``Lifebar`` 와 ``Number`` 노드를 주어진 값으로 업데이트할 것입니다.
pt_br: Temos que dizer à GUI de alguma forma qual é a saúde atual do player, atualizar a textura da barra de vida e exibir a integridade restante no contador HP no canto superior esquerdo da tela. Para fazer isso, enviamos a saúde do jogador para a GUI toda vez que receberem dano. A GUI irá então atualizar os nós `` Lifebar`` e `` Number`` com este valor.
ru: Мы должны передать в GUI текущее здоровье игрока, чтобы обновить текстуру LifeBar'a, и для отображения оставшегося здоровья в счетчике HP, который находиться в левом верхнем углу экрана. Для этого мы отправляем здоровье игрока в GUI каждый раз, когда они получают урон. GUI будет обновлять узлы ``Lifebar`` и ``Number`` с учетом этого значения.
zh_cn: 我们必须以某种方式告诉GUI游戏角色当前的健康状况，更新生命条的纹理，并在屏幕左上角的HP计数器中显示剩余的健康状况。为了做到这一点，每当游戏角色的生命值受到伤害时，我们就会将他们的生命值发送给GUI。然后GUI将用这个值更新`Lifebar`和`Number`节点。
zh_tw: 我們必須用某種方式告訴 GUI 目前玩家的血量為何，並更新 Lifebar 的貼圖，然後在螢幕左上角的 HP 計數器上顯示剩餘的生命值。要做到這點我們必須在每次玩家受到傷害時將玩家的生命值傳送給 GUI。GUI 接著用收到的值來更新 ``Lifebar`` 與 ``Number`` 節點。

source: We could stop here to display the number, but we need to initialize the bar's ``max_value`` for it to update in the right proportions. The first step is thus to tell the ``GUI`` what the green character's ``max_health`` is.
cs: Mohli bychom se zde zastavit a zobrazit číslo, ale musíme inicializovat hodnotu ``max_value`` sloupce, aby se aktualizoval ve správném poměru. Prvním krokem je tedy sdělit uzlu ``GUI``, jaká je hodnota ``max_health`` zelené postavy.
de: Wir könnten hier anhalten, um die Zahl anzuzeigen, aber wir müssen den ``max_value`` des Balkens initialisieren, damit er in den richtigen Proportionen aktualisiert wird. Der erste Schritt besteht also darin, der ``GUI`` zu sagen, was das ``max_health`` des grünen Zeichens ist.
es: Podríamos parar aquí para mostrar el número, pero necesitamos inicializar el ``max_value`` de la barra para que se actualice en las proporciones correctas. El primer paso es, por lo tanto, decirle al ``GUI`` cuál es el ``max_health`` del personaje verde.
fr: On pourrait s’arrêter là pour afficher la valeur dans le compteur; mais on doit initialiser la valeur maximale ``max_value`` de la barre de vie pour la mettre à jour dans les bonnes proportions. Cette première étape permettra de donner à ``GUI`` quel est la valeur maximale ``max_health`` de vie du joueur.
ja: ここで数字を表示させることもできますが、その前に、正しい比率で更新するため、バーの max_value を初期化する必要があります。なので最初のステップは、緑のキャラクターの ``max_health`` を ``GUI`` に伝えることです。
ko: 여기서 멈추고 숫자를 보여주러 갈 수 있지만, 그 전에 막대의 ``max_value`` 을 초기화해야 정확한 크기로 업데이트할 수 있습니다. 그러므로 먼저 ``GUI`` 가 초록색 캐릭터의 ``max_health`` 가 어느 정도인지 말해야 합니다.
pt_br: Nós poderíamos parar aqui para exibir o número, mas precisamos inicializar o `` max_value`` para que ele seja atualizado nas proporções corretas. O primeiro passo é dizer ao `` GUI`` qual é o `` max_health`` do personagem verde.
ru: Мы могли бы закончить здесь с отображением числа, но нам нужно инициализировать шкалу ``max_value`` для того, чтобы обновлять с правильными пропорциями. Таким образом, первый шаг состоит в том, чтобы сообщить ``GUI``, каково значение ``max_health`` зеленого персонажа.
zh_cn: 我们可以在这里停止来显示数字，但是我们需要初始化bar的 ``max_value`` ，让它以正确的比例进行更新。因此，第一步是告诉 ``GUI`` 绿色角色的 ``max_health`` 是什么。
zh_tw: 我們可以直接來更新顯示的數字，但在此之前必須先初始化計量槽的 ``max_value`` 才能讓更新的比例正確。所以第一步應該是告訴 ``GUI`` 綠色角色的 ``max_health`` 值為何。
