Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_code_a_life_bar.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, zh_cn, zh_tw

source: And that is it. You may now play the game to see the final result!
cs: A to je vše. Nyní si můžete zahrát hru a podívat se na konečný výsledek!
de: Und das war's. Sie mögen nun das Spiel spielen, um das fertige Ergebnis zu sehen!
es: Y eso es todo ¡Ahora puedes jugar el juego para ver el resultado final!
fr: Et voilà c'est tout. Vous pouvez lancer le jeu à présent afin de voir le résultat final !
ja: 以上です。これでゲームをプレイして最終結果を確認できます！
ko: 그리고 됬습니다. 이제 게임을 실행해서 최종 결과물을 봅시다!
pt_br: E é isso. Agora você pode jogar o jogo para ver o resultado final!
ru: И все. Теперь вы можете запустить игру, чтобы увидеть конечный результат!
zh_cn: 就是这样。您现在可以玩游戏，看看最后的结果!
zh_tw: 就這樣。現在可以執行遊戲來看看最終成果了！

source: The final result. Congratulations for getting there!
cs: Konečný výsledek. Gratulujeme, že jste to dokázali!
de: Das fertige Ergebnis. Herzlichen Glückwunsch, dort hinzukommen!
es: El resultado final ¡Felicidades por llegar hasta aquí!
fr: Le résultat final. Félicitations d'être arrivé jusque là !
ja: 最終結果。上手くいきましたね！
ko: 최종 결과물. 여기까지 오신 것에 축하합니다!
pt_br: O resultado, final Parabéns por chegar lá!
ru: Конечный результат. Поздравляю, что добрались сюда!
zh_cn: 最终结果。恭喜您做到了!
zh_tw: 最終成果。恭喜你完成了！

source: Using the exact same techniques, you can change the color of the bar when the Player gets poisoned, turn the bar red when its health drops low, shake the UI when they take a critical hit... the principle is the same: emit a signal to forward the information from the `Player` to the `GUI` and let the `GUI` process it.
cs: Pomocí úplně stejné techniky můžete změnit barvu lišty, když je hráč otráven, změnit ukazatel na červenou, když jeho zdraví klesne, zatřást uživatelským rozhraním, když dostane kritický zásah... princip je stejný: vyšlete signál, který předá informaci z `Hráče` do `GUI` a necháte `GUI`, aby ji zpracovalo.
de: Mit genau denselben Techniken können Sie die Farbe des Balkens ändern, wenn der Spieler vergiftet wird, den Balken rot färben, wenn seine Gesundheit sinkt, die UI schütteln, wenn er einen kritischen Treffer erhält... das Prinzip ist das gleiche: Sie senden ein Signal aus, um die Informationen vom `Spieler` an die `GUI` weiterzuleiten und lassen sie von der `GUI` verarbeiten.
es: Usando exactamente las mismas técnicas, puedes cambiar el color de la barra cuando el jugador se envenena, poner la barra roja cuando su salud baja, sacudir la UI cuando reciben un golpe crítico... el principio es el mismo: emitir una señal para enviar la información del `Player` al `GUI` y dejar que el `GUI` la procese.
fr: En utilisant exactement la même technique, il est possible de changer la couleur de la barre quand le Joueur s’empoisonne, de la rendre rouge quand sa santé est faible, de secouer l'interface utilisateur quand il prend un coup critique ... Le principe est le même : envoyer un signal qui transmet l'information du "Joueur" au "GUI" et laisser le "GUI" traiter ce signal.
ja: まったく同じテクニックを使用して、プレイヤーが毒になったときにバーの色を変更し、体力が低下したときにバーを赤にし、彼らがクリティカルヒットしたときにUIを振動させることができます。 `Player` からの情報を `GUI` に転送し、 `GUI` に処理させます。
ko: 똑같은 기법을 사용해서, Player가 독에 걸렸을 때 막대의 색상을 바꿀 수 있고, 체력이 천천히 줄어들 때 막대가 붉게 바뀌거나, 크리티컬 피해를 입을 때 UI가 흔들리게 하거나... 원리는 같습니다: `Player` 의 정보를 `GUI` 로 보내고 `GUI` 가 이를 처리하는 시그널을 방출합니다.
pt_br: Usando exatamente as mesmas técnicas, você pode mudar a cor da barra quando o jogador é envenenado, transformar a barra em vermelho quando a sua saúde cai, sacudir a interface do usuário quando eles tomam um dano crítico ... o princípio é o mesmo: emitir um sinal para encaminhar as informações do `Player` para o` GUI` e deixar o `GUI` processá-lo.
ru: Используя те же методы, вы можете изменить цвет бара, когда игрока отравляют, сделать бар красным, когда его здоровье падает, потрясти пользовательский интерфейс, когда он получает критический удар... принцип тот же самый: подать сигнал для передачи данных из `Player'a` в `GUI` и дать `GUI` обработать их.
zh_cn: 使用完全相同的技术，当游戏角色中毒时，您可以改变工具条的颜色，当生命值降低时将工具条变成红色，当他们受到致命一击时摇动UI……原理是一样的:发射信号将信息从`Player`转发到`GUI`，然后让`GUI`处理它。
zh_tw: 使用完全相同的基數，也可以在 Player 中毒時更改血槽的顏色、或是在殘血時將血槽改為紅色、更或是當受到致命一擊時晃動 UI……等。這些都是使用相同的概念：通過訊號從 ``Player`` 送出資訊給 ``GUI`` 並讓 ``GUI`` 處理這些資訊。

source: In this tutorial you will connect a character to a life bar and animate the health loss.
pt_br: Neste tutorial, você conectará um personagem a uma barra de vida e animará a perda desta vida.

source: Signals are Godot's version of the Observer pattern. They allow us to send out some message. Other nodes can connect to the object that **emits** the signal and receive the information. It's a powerful tool we use a lot for User Interface and achievement systems. You don't want to use them everywhere though. Connecting two nodes adds some coupling between them. When there's a lot of connections, they become hard to manage. For more information on check out the `signals video tutorial <https://youtu.be/l0BkQxF7X3E>`_ on GDquest.
pt_br: Sinais são a versão Godot do padrão Observador. Eles nos permitem enviar algumas mensagens. Outros nós podem se conectar ao objeto que **emite** o sinal e receber as informações. É uma ferramenta poderosa que usamos muito para Interface de Usuário e sistemas de conquistas. Contudo, você não quer usá-los em todos os lugares. Conectar dois nós adiciona algum acoplamento entre eles. Quando há muitas conexões, elas se tornam difíceis de gerenciar. Para mais informações, consulte o `tutorial em vídeo sobre sinais <https://youtu.be/l0BkQxF7X3E>`_ no GDquest.

source: Load the ``start`` project in Godot. In the ``FileSystem`` dock double click on LevelMockup.tscn to open it. It's an RPG game's mockup where 2 characters face each other. The pink enemy attacks and damages the green square at regular time intervals, until its death. Feel free to try out the game: the basic combat mechanics already work. But as the character isn't connected to the life bar the ``GUI`` doesn't do anything.
pt_br: Carregue o projeto `` start`` na Godot. No dock `` FileSystem`` clique duas vezes em LevelMockup.tscn para abri-lo. É uma maquete de um jogo de RPG onde dois personagens se enfrentam. O inimigo rosa ataca e danifica o quadrado verde em intervalos de tempo regulares, até a sua morte. Sinta-se livre para experimentar o jogo: a mecânica básica de combate já funciona. Mas como o personagem não está conectado à barra de vida, o `` GUI`` não faz nada.

source: The GUI scene encapsulates all of the Game User Interface. It comes with a barebones script where we get the path to nodes that exist inside the scene:
pt_br: A cena GUI encapsula toda a interface do usuário do jogo. Ela vem com um roteiro rascunhado, onde obtemos o caminho para os nós que existem dentro da cena:

source: With this in mind let's connect the ``GUI`` to the ``Player``. Click on the ``Player`` node in the scene dock to select it. Head down to the Inspector and click on the Node tab. This is the place to connect nodes to listen the one you selected.
pt_br: Com isso em mente, vamos conectar a ``GUI`` ao ``Player``. Clique no nó ``Player`` no painel Cena para selecioná-lo. Vá até o Inspetor e clique na guia Nó. Este é o lugar para conectar nós para escutar aquele que você selecionou.

source: Inside the parens after the function name, add a ``player_health`` argument. When the player emits the ``health_changed`` signal it will send its current ``health`` alongside it. Your code should look like:
pt_br: Dentro dos parênteses após o nome da função, adicione um argumento ``player_health``. Quando o jogador emite o sinal ``health_changed``, ele enviará sua ``health`` atual juntamente. Seu código deve se parecer com:

source: The engine does not convert PascalCase to snake_case, for C# examples we'll be using PascalCase for method names & camelCase for method parameters which follows the official `C# naming conventions. <https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/capitalization-conventions>`_
pt_br: A engine não converte PascalCase para snake_case, por exemplos em C # estaremos usando PascalCase para nomes de métodos e camelCase para parâmetros de métodos que seguem as convenções oficiais de nomenclatura `C #. <https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/capitalization-conventions> `_

source: Inside ``_on_Player_health_changed`` let's call a second function called ``update_health`` and pass it the ``player_health`` variable.
pt_br: Dentro de `` _on_Player_health_changed`` vamos chamar uma segunda função chamada `` update_health`` e passar a variável `` player_health``.

source: ``str`` is a built-in function that converts about any value to text. ``Number``'s ``text`` property requires a string so we can't assign it to ``new_value`` directly
pt_br: `` str`` é uma função interna que converte qualquer valor em texto. A propriedade `` text`` do `` Number`` requer uma string, então não podemos atribuí-la ao `` new_value`` diretamente

source: Our interface is functional, but it could use some animation. That's a good opportunity to introduce the ``Tween`` node, an essential tool to animate properties. ``Tween`` animates anything you'd like from a start to an end state over a certain duration. For example it can animate the health on the ``TextureProgress`` from its current level to the ``Player``'s new ``health`` when the character takes damage.
pt_br: Nossa interface é funcional, mas pode usar alguma animação. Essa é uma boa oportunidade para introduzir o nó `` Tween``, uma ferramenta essencial para animar propriedades. `` Tween`` anima tudo o que você quiser desde o início até o final de uma determinada duração. Por exemplo, ele pode animar a saúde no `` TextureProgress`` do seu nível atual para o novo `` health`` do `` Player`` quando o personagem recebe dano.

source: The last two arguments combined correspond to an `easing equation <#>`__. This controls how the value evolves from the start to the end point.
pt_br: Os dois últimos argumentos combinados correspondem a uma equação de atenuação <#> `__. Isso controla como o valor evolui do início ao ponto final.

source: The animation is smooth but the number is broken
pt_br: A animação é suave, mas o número está quebrado

source: By rounding out animated\_health we hit two birds with one stone
pt_br: Ao arredondar animated\_health, acertamos dois coelhos com uma só cajadada

source: ``modulate`` takes a ``Color`` value with 4 channels: red, green, blue and alpha. If we darken any of the first three channels it darkens the interface. If we lower the alpha channel our interface fades out.
pt_br: `` modulate`` recebe um valor `` Color`` com 4 canais: vermelho, verde, azul e alfa. Se escurecermos qualquer um dos três primeiros canais, escurecerá a interface. Se abaixarmos o canal alfa, nossa interface desaparece.

source: This time we change the ``modulate`` property and have it animate from ``start_color`` to the ``end_color``. The duration is of one second, with a linear transition. Here again, because the transition is linear, the easing does not matter. Here's the complete ``_on_Player_died`` method:
pt_br: Desta vez nós mudamos a propriedade `` modulate`` e a animamos de `` start_color`` para `` end_color``. A duração é de um segundo, com uma transição linear. Aqui, novamente, porque a transição é linear, o alívio não importa. Aqui está o método `` _on_Player_died`` completo:

source: Also call ``update_health`` at the end of the ``_ready`` function to initialize the ``Number`` node's ``text`` with the right value at the start of the game. Press :kbd:`F5` to test the game: the life bar updates with every attack!
cs: Na konci funkce ``_ready`` zavolejte také funkci ``update_health``, abyste inicializovali ``text`` uzlu ``Number`` správnou hodnotou na začátku hry. Stiskněte :kbd:`F5` a otestujte hru: ukazatel života se aktualizuje při každém útoku!
de: Rufen Sie auch ``update_health`` am Ende der Funktion ``_ready`` auf, um den ``Nummer``-Node ``Text`` mit dem richtigen Wert zu Beginn des Spiels zu initialisieren. Drücken Sie :kbd:`F5`, um das Spiel zu testen: die Rettungsleiste wird bei jedem Angriff aktualisiert!
ja: また、\ ``_ready`` 関数の最後で ``update_health`` を呼び出して、ゲームの開始時に適切な値で ``Number`` ノードの ``text`` を初期化します。\ :kbd:`F5` を押してゲームをテストします。攻撃を受けるたびにライフバーが更新されます！
ru: Также вызов ``update_health`` в конце функции ``_ready`` инициализировать ``text`` узла ``Number`` с правильным значением в начале игры. Нажмите клавишу :kbd:`F5`, чтобы протестировать игру: жизни обновляются при каждой атаке!
zh_tw: 另外，在 ``_ready`` 的結尾呼叫 ``update_health`` 來在遊戲開始時將 ``Number`` 節點的 ``text`` 屬性初始化為正確的值。按 :kbd:`F5` 來測試遊戲，血槽現在應該會在每次被攻擊時更新了！

source: The project uses a simple organization that works for game jams and tiny games.
cs: Projekt používá jednoduchou organizaci, která funguje pro herní soutěže a drobné hry.
de: Das Projekt ist organisatorisch einfach gestaltet, geeignet für Game Jams und kleinere Spiele.
ru: Проект использует простую организацию, которая работает для игровых джемов и крошечных игр.
zh_tw: 這個專案使用了適合給 Game Jams 或小型遊戲的組織方法。

source: The Observer pattern, that signals derive from, still adds a bit of coupling between node branches. But it's generally lighter and more secure than accessing nodes directly to communicate between two separate classes. It can be okay for a parent node to get values from its children. But you'll want to favor signals if you're working with two separate branches. Read Game Programming Patterns for more information on the `Observer pattern <https://gameprogrammingpatterns.com/observer.html>`_. The `full book <https://gameprogrammingpatterns.com/contents.html>`_ is available online for free.
cs: Vzor Observer, z něhož signály vycházejí, ještě přidává trochu vazby mezi větvemi uzlů. Je však obecně jednodužší a bezpečnější než přímý přístup k uzlům pro komunikaci mezi dvěma samostatnými třídami. Může být v pořádku, že rodičovský uzel získává hodnoty od svých dětí. Pokud však pracujete se dvěma oddělenými větvemi, budete chtít upřednostnit signály. Další informace o vzoru `Observer <https://gameprogrammingpatterns.com/observer.html>`_ najdete v článku Vzory programování her. Celá `kniha <https://gameprogrammingpatterns.com/contents.html>`_ je k dispozici zdarma online.
de: Das Observer-Pattern, von dem die Signals abgeleitet sind, fügt den einzelnen Nodes trotzdem eine kleine Menge an Kopplung hinzu. Aber es erzeugt im Allgemeinen nicht so viel Kopplung und ist sicherer als der direkte Zugriff auf Funktionen anderer Klassen bzw. Nodes. Es kann in Ordnung sein, dass Elternknoten Werte von den Kindknoten erhalten, aber bei der Kommunikation von Knoten in unterschiedlichen Verzweigungen sollten Signals bevorzugt werden. Im kostenlosen Online verfügbaren Buch "Game Programming Patterns", ist das Observer Pattern noch detaillierter beschrieben: <http://gameprogrammingpatterns.com/observer.html>.
ru: Шаблон Observer, из которого исходят эти сигналы, по-прежнему добавляет немного связей между ветвями узла. Но это, как правило, легче и безопаснее, чем доступ к узлам напрямую для связи между двумя отдельными классами. Для родительского узла может быть нормальным получать значения от его дочерних узлов. Но вы захотите отдать предпочтение сигналам, если работаете с двумя отдельными ветвями. Прочитайте шаблоны программирования игр для получения дополнительной информации о `Observer шаблоне <https://gameprogrammingpatterns.com/observer.html>`_. `Полная версия книги <https://gameprogrammingpatterns.com/contents.html>`_ доступна для скачивания бесплатно.
zh_tw: Observer 設計模式——也就是原版的「訊號」功能——也還是會增加節點間的耦合度。但通常來說耦合度更低而且也比為了在兩個不同的類別間通訊而直接存取節點來得安全。如果是從母節點取得子節點的值的話還好，但如果是兩個不同的節點分支則最好還是使用訊號。你可以在 Game Programming Patterns 內瞭解更多有關 `Observer 設計模式（英語） <https://gameprogrammingpatterns.com/observer.html>`_ 的內容。 `全書（英語） <https://gameprogrammingpatterns.com/contents.html>`_ 也可以在線上免費閱讀。

source: First, the ``GUI`` needs to connect to the ``Player``'s ``died`` signal to know when it died. Press :kbd:`Ctrl + F1` to jump back to the 2D Workspace. Select the ``Player`` node in the Scene dock and click on the Node tab next to the Inspector.
cs: Nejprve se musí ``GUI`` připojit k signálu ``Player`` ``died``, aby se dozvěděl, až ``Player`` zemře. Stisknutím :kbd:`Ctrl + F1` přejdete zpět do 2D pracovního prostoru. Vyberte uzel ``Player`` v doku scény a klikněte na kartu Uzel vedle Inspektora.
ru: Во-первых, ``GUI`` необходимо подключиться к сигналу ``died`` у ``Player``, чтобы узнать, когда тот умер. Нажмите :kbd:`Ctrl + F1` для возврата в 2D-среду. Выберите узел ``Player`` в панели Сцен и щелкните на вкладку Узел рядом с Инспектором.

source: This time, we change the ``modulate`` property and have it animate from ``start_color`` to the ``end_color``. The duration is of one second, with a linear transition. Here's the complete ``_on_Player_died`` method:
cs: Tentokrát změníme vlastnost ``modulate`` a necháme ji animovat od ``start_color`` do ``end_color``. Doba trvání je jedna sekunda s lineárním přechodem. Zde je kompletní metoda ``_on_Player_died``:
de: Dieses Mal ändern wir die Eigenschaft ``Modulieren`` und lassen sie von ``start_color`` auf die ``end_color`` animieren. Die Dauer beträgt eine Sekunde, mit einem linearen Übergang. Hier ist die komplette ``_on_Player_died`` Methode:
ru: На этот раз мы меняем свойство ``modulate`` и анимируем его от ``start_color`` к ``end_color``. Продолжительность составляет одну секунду, с линейным переходом. Вот полный метод ``_on_on_Player_died``:
zh_tw: 這次我們需要動畫化的是 ``modulate`` 屬性，從 ``start_color`` 漸變到 ``end_color`` 。持續時間為一秒鐘，並使用線性動畫。完整的 ``_on_Player_died`` 方法長這樣：
