Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_code_a_life_bar.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, zh_cn, zh_tw

source: Animate the loss of life with the Tween node
cs: Animujte ztrátu života pomocí uzlu Tween
de: Animieren Sie den Verlust von Leben mit dem Tween-Node
es: Animar la pérdida de vida con el nodo Tween
fr: Animer la perte de vie avec un nœud Tween
ja: Tweenノードを使用した、自機損失のアニメーション
ko: Tween 노드로 체력이 감소하는 것을 애니메이트하기
pt_br: Animar a perda de vida com o nó Tween
ru: Анимировать смерть с помощью узла Tween
zh_cn: 用渐变节点动画生命的损失
zh_tw: 使用 Tween 節點來動畫化生命受損

source: Our interface is functional, but it could use some animation. That's a good opportunity to introduce the ``Tween`` node, an essential tool to animate properties. ``Tween`` animates anything you'd like from a start to an end state over a certain duration. For example, it can animate the health on the ``TextureProgress`` from its current level to the ``Player``'s new ``health`` when the character takes damage.
cs: Naše rozhraní je funkční, ale potřebovalo by trochu animace. To je dobrá příležitost představit uzel ``Tween``, základní nástroj pro animaci vlastností. Uzel ``Tween`` animuje cokoli, co chcete, od počátečního do konečného stavu po určitou dobu. Může například animovat zdraví na ``TextureProgress`` z jeho aktuální úrovně na nové ``health`` hráče, když postava dostane poškození.
de: Unsere Schnittstelle ist funktional, aber sie könnte eine Animation gebrauchen. Das ist eine gute Gelegenheit, den ``Tween``-Node einzuführen, ein wesentliches Werkzeug zur Animation von Eigenschaften. ``Tween`` animiert alles, was Sie von einem Anfangs- bis zu einem Endzustand über eine bestimmte Dauer haben möchten. Zum Beispiel kann es die Gesundheit auf dem ``TextureProgress`` von seinem aktuellen Level bis zur neuen ``health`` des Spielers animieren, wenn der Charakter Schaden nimmt.
fr: Notre interface est fonctionnel, mais elle pourrait bénéficier d'un peu d'animation. C'est une bonne opportunité d'introduire le nœud ``Tween``, un outil essentiel pour animer des propriété. Ce nœud permet d'animer entre deux état sur une certaine durée. par exemple il peut animer la barre de vie ``TextureProgress`` entre deux états, avant et après le coup.
ja: このインターフェイスは機能していますが、いくつかのアニメーションを使用することができます。これは、プロパティをアニメーション化するために不可欠なツールである ``Tween`` ノードを導入する良い機会です。 ``Tween`` は、一定の期間にわたって開始状態から終了状態まで、必要なものをアニメーション化します。たとえば、キャラクタがダメージを受けたときに、 ``TextureProgress`` の体力(health)を現在のレベルから ``Player`` の新しい ``health`` にアニメートできます。
ko: 인터페이스는 작동하지만, 몇 가지 애니메이션을 사용할 수 있습니다. 지금이 속성을 애니메이트 하는데 필수적인 도구, ``Tween`` 노드를 소개하기에 좋은 순간이네요. ``Tween``\ 은 어떤 것이든 처음부터 끝을 일정 기간 동안 애니메이트 합니다. 예를 들어 캐릭터가 피해를 입을 때 ``Player``\ 의 현재 새로운 ``health``\ 로 ``TextureProgress``\ 에서 체력을 애니메이트 할 수 있습니다.
ru: Интерфейс нашей игры уже вполне рабочий, однако не помешает добавить немного анимаций. В этом нам поможет узел ``Tween`` — незаменимый инструмент для создания анимаций. ``Tween`` может плавно менять значение любого свойства, которого вы только пожелаете. Например, когда игрок ``Player`` получает урон, полоска здоровья ``TextureProgress`` уменьшается до текущего уровня здоровья ``health``.
zh_cn: 我们的界面是功能性的，但它可以使用一些动画。这是引入`Tween`节点的好机会，这是动画属性的一个基本工具。`Tween`在一定的持续时间内，使您从开始到结束的任何状态都具有动画效果。例如，当角色受到伤害时，它可以将`TextureProgress`上的生命值从当前级别激活到`Player`的新`health`。
zh_tw: 界面現在會動了，但我們還可以給他加點動畫。現在是介紹用來動畫化屬性的必要工具 ``Tween`` 節點登場的好時機。 ``Tween`` 可以將任何屬性動畫化，在某段時間內將某個起始點的值逐步增加到結束點。例如，可以使用 Tween 在角色受到攻擊時將 ``TextureProgress`` 上的生命值從目前的狀態動畫化到 ``Player`` 的新 ``health`` 值。

source: The ``GUI`` scene already contains a ``Tween`` child node stored in the ``tween`` variable. Let's now use it. We have to make some changes to ``update_health``.
cs: Scéna ``GUI`` již obsahuje podřízený uzel ``Tween`` uložený v proměnné ``tween``. Nyní jej použijeme. Musíme provést několik změn v ``update_health``.
de: Die ``GUI``` Szene enthält bereits einen ``Tween`` Kind-Node, der in der ``Tween``` Variable gespeichert ist. Lassen Sie uns diese nun verwenden. Wir müssen einige Änderungen an ``update_health`` vornehmen.
es: La escena ``GUI`` ya contiene un nodo hijo ``Tween`` almacenado en la variable ``tween``. Ahora vamos a usarlo. Tenemos que hacer algunos cambios en ``update_health``.
fr: La scène ``GUI`` contient déjà un nœud enfant ``Tween`` qui est assigné à la variable ``tween`` dans notre script. On peut maintenant l'utiliser, nous avons à faire quelques modifications dans notre fonction ``update_health``.
ja: ``GUI`` シーンには、 ``tween`` 変数に格納されている ``Tween`` 子ノードが既に含まれています。それでは、それを使用してみましょう。 ``update_health`` にいくつかの変更を加える必要があります。
ko: ``GUI`` 씬에는 이미 ``tween`` 변수가 저장된 ``Tween`` 노드 갖고 있습니다. 이제 사용할 때입니다. 우리는 ``update_health`` 에 몇 가지 변화를 주어야 합니다.
pt_br: A cena `` GUI`` já contém um nó filho `` Tween`` armazenado na variável `` tween``. Vamos agora usá-lo. Nós temos que fazer algumas mudanças em `` update_health``.
ru: Сцена ``GUI`` уже содержит дочерний узел ``Tween``, хрянящийся в переменной ``tween``. Давайте используем их. Но сначала мы должны произвести некоторые изменения в ``update_health``.
zh_cn: `GUI`场景已经包含一个`Tween`子节点存储在`Tween`变量中。现在让我们使用它。我们必须对`update_health`做一些修改。
zh_tw: ``GUI`` 場景已經包含了一個儲存在 ``tween`` 變數上的 ``Tween`` 子節點了。讓我們來用用它。但我們必須先在 ``update_health`` 上做點修改。

source: We will use the ``Tween`` node's ``interpolate_property`` method. It takes seven arguments:
cs: Použijeme metodu ``interpolate_property`` uzlu ``Tween``. Ta požaduje sedm argumentů:
de: Wir werden die ``Tween```Nodes ``Interpolate_property`` Methode verwenden. diese benötigt sieben Argumente:
es: Usaremos el método ``Tween`` del nodo ``interpolate_property``. Se necesitan siete argumentos:
fr: Nous utiliserons la méthode ``interpolate_property`` du nœud ``Tween``. Elle prend sept paramètres :
ja: ``Tween`` ノードの ``interpolate_property`` メソッドを使用します。引数は7つあります:
ko: ``Tween`` 노드의 ``interpolate_property`` 메서드를 사용할 겁니다. 그것은 일곱 개의 인수들을 가집니다:
pt_br: Nós usaremos o método `` interpolate_property`` do nó `` Tween``. São necessários sete argumentos:
ru: Мы будем использовать метод узла ``Tween``, который называется ``interpolate_property`` и принимает семь аргументов:
zh_cn: 我们将使用`Tween` `node` `interpolate_property`方法。它需要七个参数:
zh_tw: 我們要用到 ``Tween`` 節點的 ``interpolate_property`` 方法，這個方法有七個引數：

source: A reference to the node who owns the property to animate
cs: Odkaz na uzel, který obsahuje vlastnost, kterou chcete animovat
de: Ein Verweis auf den Node, dem die zu animierende Eigenschaft gehört
es: Una referencia al nodo que posee la propiedad para animar
fr: Une référence au nœud dont la propriété est à animer
ja: アニメーションするプロパティを所有するノードへの参照
ko: 애니메이트 할 속성을 소유한 노드에 대한 참조
pt_br: Uma referência ao nó que possui a propriedade para animar
ru: Ссылка на узел, свойство которого мы будем анимировать
zh_cn: 对拥有该属性的节点进行动画的引用
zh_tw: 節點參照，要動畫化的屬性的節點

source: The property's identifier as a string
cs: Identifikátor vlastnosti jako řetězec
de: Der Bezeichner der Eigenschaft als Zeichenkette
es: El identificador de la propiedad es un string
fr: Le nom de la propriété en chaîne de caractère
ja: 文字列としてのプロパティの識別子
ko: 속성 식별자의 문자열
pt_br: O identificador da propriedade como uma string
ru: Идентификатор свойства в виде строки
zh_cn: 属性的标识符作为字符串
zh_tw: 屬性的識別子，以字串傳入

source: The starting value
cs: Počáteční hodnotu
de: Der Start Wert
es: El valor inicial
fr: La valeur initiale
ja: 開始値
ko: 시작 값
pt_br: O valor inicial
ru: Начальное значение
zh_cn: 起始值
zh_tw: 起始值

source: The end value
cs: Konečnou hodnotu
de: Der End-Wert
es: El valor final
fr: La valeur finale
ja: 終了値
ko: 끝 값
pt_br: O valor final
ru: Конечное значение
zh_cn: 端值
zh_tw: 終止值

source: The animation's duration in seconds
cs: Dobu trvání animace v sekundách
de: Die Animationsdauer in Sekunden
es: Duración de la animación en segundos
fr: La durée de l'animation en seconde
ja: アニメーションの継続時間(秒)
ko: 애니메이션의 지속 시간 (초)
pt_br: A duração da animação em segundos
ru: Продолжительность анимации в секундах
zh_cn: 动画以秒为单位的持续时间
zh_tw: 動畫時間，以秒為單位

source: The type of the transition
cs: Typ přechodu
de: Der Typ des Übergangs
es: El tipo de transición
fr: Le type de transition
ja: トランジションのタイプ
ko: 전환(transition) 유형
pt_br: O tipo da transição
ru: Тип перехода
zh_cn: 过渡的类型
zh_tw: 轉場類型

source: The easing to use in combination with the equation.
cs: Uvolnění, které se použije v kombinaci s rovnicí.
de: Die einfache Handhabung in Kombination mit der Gleichung.
es: La facilidad de uso en combinación con la ecuación.
fr: Le lissage à utiliser en combinaison avec l'équation.
ja: 方程式と組み合わせて使用するイージング。
ko: 방정식과 함께 사용하는 완화.
pt_br: O alívio para usar em combinação com a equação.
ru: Легкость использования в сочетании с уравнением.
zh_cn: 与方程结合使用的缓和。
zh_tw: 與方程結合使用的緩動 (Easing) 方式。

source: The last two arguments combined correspond to an easing equation. This controls how the value evolves from the start to the end point.
cs: Poslední dva argumenty dohromady odpovídají uvolňovací rovnici. Ta řídí vývoj hodnoty od počátečního do koncového bodu.
de: Die letzten beiden kombinierten Argumente entsprechen einer Lockerungsgleichung. Das steuert, wie sich der Wert vom Anfang bis zum Ende entwickelt.
fr: Les deux derniers paramètres combinées correspondent à une équation de lissage. Cela permet de contrôler l'évolution de la valeur entre la valeur initiale et finale.
ja: 最後の 2 つの引数を組み合わせると、イージング方程式に対応します。これにより、始点から終点まで間に値がどのように変化するかを制御します。
ko: 마지막 두 인수들은 완화 식(easing equation)으로 동등하게 묶입니다. 이것은 시작에서 끝까지 값이 얼마나 증가하는 지를 제어합니다.
ru: Два последних аргумента в совокупности соответствуют `уравнению плавности <#>`__. Этот параметр определяет, как изменяется значение от начала до конца.
zh_tw: 緩動方程 (Easing Equation) 是由最後兩個引數組合成的。即，用來控制數值如何從起始值變化至終止值。

source: Click the script icon next to the ``GUI`` node to open it again. The ``Number`` node needs text to update itself, and the ``Bar`` needs a float or an integer. We can use ``interpolate_property`` to animate a number, but not to animate text directly. We're going to use it to animate a new ``GUI`` variable named ``animated_health``.
cs: Kliknutím na ikonu skriptu vedle uzlu ``GUI`` jej znovu otevřete. Uzel ``Number`` potřebuje text, aby se mohl aktualizovat, a uzel ``Bar`` pak potřebuje float nebo celé číslo. Pomocí ``interpolate_property`` můžeme animovat číslo, ale ne přímo text. Použijeme ji k animaci nové proměnné ``GUI`` s názvem ``animated_health``.
de: Klicken Sie auf das Skript-Symbol neben dem ``GUI`` Node, um es wieder zu öffnen. Der ``Number``-Node benötigt Text, damit er sich selbst aktualisiert und die ``Bar`` benötigt eine Float- oder Integer-Variable. Wir können ``interpolate_property`` benutzen, um eine Nummer zu animieren, aber nicht direkt den Text. Wir verwenden es stattdessen, um eine neue ``GUI``-Variable namens ``animated_health`` zu animieren.
es: Haz clic en el icono del script junto al nodo ``GUI`` para abrirlo de nuevo. El nodo ``Number`` necesita texto para actualizarse, y ``Bar`` necesita un float o un integer. Podemos usar ``interpolate_property`` para animar un número, pero no para animar texto directamente. Vamos a usarlo para animar una nueva variable ``GUI`` llamada ``animated_health``.
fr: Cliquez sur l'icône de script à côté du nœud ``GUI`` pour l'ouvrir à nouveau. Le nœud ``Number`` a besoin de texte pour se mettre à jour, et ``Bar`` a besoin d'un flottant ou d'un entier. On peut utiliser ``interpolate_property`` pour animer un nombre, mais pas pour animer du texte directement. Nous allons l'utiliser pour animer une nouvelle variable ``GUI`` nommée ``animated_health``.
ja: ``GUI`` ノードの横にあるスクリプト・アイコンをクリックして再度開きます。 ``Number`` ノード自体を更新するにはテキストが必要で、 ``Bar`` には浮動小数点または整数が必要です。 ``interpolate_property`` を使用して数値をアニメーションすることはできますが、テキストを直接アニメーションさせることはできません。これを使用して、 ``animated_health`` という名前の新しい ``GUI変数`` をアニメーション化します。
ko: ``GUI`` 노드 옆에 스크립트 아이콘을 클릭해서 다시 엽니다. ``Number`` 노드는 스스로 업데이트하는 텍스트가 필요합니다, 그리고 ``Bar`` 는 실수 또는 정수가 필요합니다. 우리는 ``interpolate_property`` 를 사용해서 숫자를 애니메이트 할 것입니다, 텍스트에 직접 하진 않을 겁니다. 우리는 이것을 ``animated_health`` 라는 새로운 ``GUI`` 변수를 애니메이트 하는데 이용할 것입니다.
pt_br: Clique no ícone do script ao lado do nó `` GUI`` para abri-lo novamente. O nó `` Number`` precisa de texto para se atualizar, e a `` Bar`` precisa de um float ou um inteiro. Podemos usar `` interpolate_property`` para animar um número, mas não para animar o texto diretamente. Vamos usá-lo para animar uma nova variável `` GUI`` chamada `` animated_health``.
ru: Нажмите на иконку скрипта рядом с узлом ``GUI``, чтобы открыть его снова. Узлу ``Number`` нужен текст для обновления, а узлу ``Bar`` - дробное или целое число. Мы можем использовать ``interpolate_property`` для анимирования числа, но не для текста напрямую. Мы собираемся использовать его для анимирования новой переменной ``GUI`` под названием ``animated_health``.
zh_cn: 单击`GUI`节点旁边的脚本图标，再次打开它。`Number`节点需要文本来更新自己，`Bar`需要一个浮点数或整数。我们可以使用`interpolate_property 插值属性`来动画一个数字，但不能直接动画文本。我们将使用它来动画一个新的`GUI`变量命名为`animated_health`。
zh_tw: 再次點擊 ``GUI`` 節點旁邊的腳本圖示來打開腳本。 ``Number`` 節點需要使用字串來更新自己，而 ``Bar`` 需要的則是浮點數或整數。我們可以使用 ``interpolate_property`` 來動畫化數字，但無法直接動畫化字串。所以我們要用來動畫化 ``GUI`` 上的一個新變數 ``animated_health`` 。

source: At the top of the script, define a new variable, name it ``animated_health``, and set its value to 0. Navigate back to the ``update_health`` method and clear its content. Let's animate the ``animated_health`` value. Call the ``Tween`` node's ``interpolate_property`` method:
cs: V horní části skriptu definujte novou proměnnou, pojmenujte ji ``animated_health`` a nastavte její hodnotu na 0. Přejděte zpět na metodu ``update_health`` a vymažte její obsah. Pro animaci hodnoty ``animated_health``, zavoláme metodu ``interpolate_property`` uzlu ``Tween``:
de: Definieren Sie oben im Skript eine neue Variable, benennen Sie sie ``animated_health``, und setzen Sie ihren Wert auf 0. Navigieren Sie zurück zur Methode ``update_health`` und löschen Sie ihren Inhalt. Lassen Sie uns den Wert von ``animated_health`` animieren. Rufen Sie die Methode ``interpolate_property`` des ``Tween``-Nodes auf:
es: En la parte superior del script, define una nueva variable, llámala ``animated_health``, y establece su valor en 0. Regresa al método ``update_health`` y borra su contenido. Vamos a animar el valor de ``animated_health``. Llama al método ``Tween`` del nodo ``interpolate_property``:
fr: En haut du script, définissez une nouvelle variable, nommez-la ``animated_health``, et mettez sa valeur à 0, puis revenez à la fonction ``update_health`` et effacez son contenu. Animons la valeur "animated_health". Appelez la fonction``interpolate_property`` du nœud ``Tween`` :
ja: スクリプトの先頭で、新しい変数を定義し、 ``animated_health`` という名前を付け、値を0に設定します。 ``update_health`` メソッドに戻り、その内容をクリアします。 ``animated_health`` 値をアニメートします。 ``Tween`` ノードの ``interpolate_property`` メソッドを呼び出します:
ko: 스크립트 맨 위에서, 새 변수를 정의합니다, 이름은 ``animated_health`` 입니다, 그리고 값을 0으로 설정합니다. 다시 ``update_health`` 메서드로 돌아와서 내용물을 지웁니다. ``animated_health`` 값을 애니메이트 해 봅시다. ``Tween`` 노드의 ``interpolate_property`` 메서드를 호출합니다:
pt_br: No topo do script, defina uma nova variável, nomeie-a como `` animated_health`` e defina seu valor como 0. Navegue de volta para o método `` update_health`` e limpe seu conteúdo. Vamos animar o valor `` animated_health``. Chame o método `` interpolate_property`` do nó `` Tween``:
ru: В верхней части скрипта определите новую переменную, назовите ее ``animated_health`` и установите ее значение на 0. Вернитесь к методу ``update_health`` и очистите его содержимое. Давайте анимируем ``animated_health``. Вызываем метод узла ``Tween`` ``interpolate_property``:
zh_cn: 在脚本的顶部，定义一个新变量，将其命名为`animated_health`，并将其值设置为0。导航回`update_health`方法并清除其内容。让我们对`animated_health`值进行动画处理。调用`ween` `node` `interpolate_property`方法:
zh_tw: 在腳本開頭定義一個新變數，命名為 ``animated_health`` ，並將值設為 0。然後回到 ``update_health`` 方法並清空原本的內容。現在我們來動畫化 ``animated_health`` 的值。呼叫 ``Tween`` 節點的 ``interpolate_property`` 方法：

source: Let's break down the call:
cs: Rozebereme si volání této funkce:
de: Lassen Sie uns den Aufruf aufschlüsseln:
es: Vamos a interrumpir la llamada:
fr: Décomposons l'appel :
ja: 呼出を中断しましょう:
ko: 호출한 것을 파헤쳐 봅시다:
pt_br: Vamos dividir a ligação:
ru: Давайте разберем этот вызов поподробнее:
zh_cn: 让我们把调用分解一下:
zh_tw: 讓我們把這段程式碼拆開來看：

source: We target ``animated_health`` on ``self``, that is to say the ``GUI`` node. ``Tween``'s interpolate\_property takes the property's name as a string. That's why we write it as ``"animated_health"``.
cs: Cílíme na ``animated_health`` na ``self``, tedy na uzel ``GUI``. Funkce interpolate\_property v ``Tween`` přebírá název vlastnosti jako řetězec. Proto ji zapisujeme jako ``"animated_health"``.
de: Wir zielen auf die ``animated_health`` auf ``self``, das heißt auf den ``GUI```-Node. Die interpolierende ``Tween``-Eigenschaft nimmt den Namen der Eigenschaft als Zeichenkette an. Deshalb schreiben wir es als ``"animated_health"``.
es: Apuntamos a ``animated_health`` en ``self``, es decir, el nodo ``GUI``. Interpolate_property toma el nombre de la propiedad como un string. Por eso lo escribimos como ``"animated_health"``.
fr: On veut animer dans le nœud ``GUI``, la propriété ``animated_health``, or ce script étant rattaché à ``GUI``, on peut s'y référer avec ``self``. La méthode ``interpolate_property`` du nœud ``Tween`` a besoin du nom de la propriété en chaîne de caractère. C'est pour cela qu'on l'écrit ``"animated_health"``.
ja: ``animated_health`` を ``self`` 、つまり ``GUI`` ノードをターゲットにします。 ``Tween`` の ``interpolation_property`` は、プロパティの名前を文字列として取得します。 ですので ``"animated_health"`` とします。
ko: ``animated_health`` 를, ``self`` 에, 즉 ``GUI`` 노드를 타깃으로 합니다. ``Tween`` 의 interpolate\_property는 속성의 이름을 문자열로 가져옵니다. 이것이 우리가 ``"animated_health"`` 로 쓴 이유입니다.
pt_br: Nosso alvo é `` animated_health`` em `` self``, isto é, o nó `` GUI``. A interpolação de `` Tween`` \ _property toma o nome da propriedade como uma string. É por isso que nós escrevemos como `` "animated_health" ``.
ru: Мы нацеливаем ``animated_health`` на ``self``, то есть на узел ``GUI``. Второе свойство interpolate\_property узла ``Tween`` принимается в виде строки. Вот почему мы пишем это как ``"animated_health"``.
zh_cn: 我们的目标是`self`上的`animated_health`，也就是说`GUI`节点。`Tween`'s的插值\_property将属性的名称作为字符串。这就是为什么我们把它写成`animated_health`。
zh_tw: 我們將目標設為 ``self`` ——也就使 ``GUI`` 節點——上的 ``animated_health`` 。 ``Tween`` 的 interpolate\_property 接受字串形式的屬性名。所以我們需要寫成 ``"animated_health"`` 。

source: The starting point is the current value the bar's at. We still have to code this part, but it's going to be ``animated_health``. The end point of the animation is the ``Player``'s ``health`` after the ``health_changed``: that's ``new_value``. And ``0.6`` is the animation's duration in seconds.
cs: Výchozím bodem je aktuální hodnota sloupce. Tuto část musíme ještě nakódovat, ale bude to ``animated_health``. Koncovým bodem animace je ``Player`` ``health`` po ``health_changed``: to je ``new_value``. A ``0,6`` je doba trvání animace v sekundách.
de: Der Ausgangspunkt ist der aktuelle Wert der Lebensleiste. Wir müssen diesen Teil noch programmieren, aber in unserem Fall verwenden wir ``animated_health``. Der Endpunkt der Animation ist die Gesundheit (``health``) des ``Player`` nach der Änderung (``health_changed``): das ist der neue Wert (``new_value``). Und ``0.6`` ist die Dauer der Animation in Sekunden.
es: El punto de partida es el valor actual de la barra. Todavía tenemos que programar esta parte, pero va a ser ``animated_health``. El punto final de la animación es el valor de ``health`` del ``Player`` después de ``health_changed``: ese es el ``new_value``. Y ``0.6`` es la duración de la animación en segundos.
fr: La valeur initiale est la valeur actuelle de la barre de vie. Il faudra coder cette partie, mais dans notre cas on utilisera ``animated_health``. La valeur finale de l'animation sera la ``new_value`` dans notre fonction ``update_health``. Et ``0.6`` est la durée de l'animation en seconde.
ja: 開始点は、バーの現在の値です。この部分はまだコーディングする必要がありますが、 ``animated_health`` になります。アニメーションの終了点は、 ``health_changed`` 後の ``Player`` の ``health`` 、つまり ``new_value`` です。 ``0.6`` はアニメーションの秒単位の長さです。
ko: 시작 점은 막대의 현재 값입니다. 이 부분도 코딩을 해야 하지만, 곧 ``animated_health`` 가 될 것입니다. 애니메이션의 끝 점은 ``health_changed` 이후의 ``Player`` 의 ``health`` 가 됩니다: 즉, ``new_value`` 입니다. 그리고 ``0.6`` 은 애니메이션의 지속 시간입니다.
pt_br: O ponto de partida é o valor atual em que a barra está. Nós ainda temos que codificar esta parte, mas ela será `` animated_health``. O ponto final da animação é `` health`` do `` Player`` depois do `` health_changed``: é `` new_value``. E `` 0.6`` é a duração da animação em segundos.
ru: Отправной точкой является текущее значение шкалы. Мы все еще должны закодировать эту часть, но это будет ``animated_health``. Конечной точкой анимации является ``health`` игрока после ``health_changed``: это ``new_value``. А ``0.6`` - это длительность анимации в секундах.
zh_cn: 起点是该条的当前值。我们仍然需要对这部分进行编码，但它将是`animated_health`。动画的结束点是在`health_changed`之后的`Player`的`health`:这是`new_value`。`0.6`是动画的持续时间，以秒为单位。
zh_tw: 起始值為目前計量槽的值，這部分還需要寫，但總之這個值會是 ``animated_health`` 。動畫結束點則為 ``Player`` 在 ``health_changed`` 後的 ``health`` 值，也就是 ``new_value`` 。0.6 則為動畫時長，單位為秒。

source: The last two arguments are constants from the ``Tween`` class. ``TRANS_LINEAR`` means the animation should be linear. ``EASE_IN`` doesn't do anything with a linear transition, but we must provide this last argument or we'll get an error.
es: Los dos últimos argumentos son constantes de la clase ``Tween``. ``TRANS_LINEAR`` significa que la animación debe ser lineal. ``EASE_IN`` no hace nada con una transición lineal, pero debemos proporcionar este último argumento si no queremos recibir un error.
fr: Les deux derniers arguments sont des constantes de la classe ``Tween``. ``TRANS_LINEAR`` nous donnera une animation linéaire et ``EASE_IN`` n'a pas d'action sur une animation linéaire, mais on doit donner un dernier argument sinon on aura une erreur.
ja: 最後の2つの引数は、 ``Tween`` クラスの定数です。 ``TRANS_LINEAR`` は、アニメーションがリニアでなければならないことを意味します。 ``EASE_IN`` は線形遷移では何も行いませんが、この最後の引数を指定しないとエラーが発生します。
ko: 마지막 두 인수는 ``Tween`` 클래스의 상수입니다. ``TRANS_LINEAR`` 는 애니메이션이 선형적인 것을 의미합니다. ``EASE_IN`` 선형 변환에선 아무것도 하지 않지만, 꼭 이 마지막 인수를 채워야 에러가 나지 않습니다.
pt_br: Os dois últimos argumentos são constantes da classe `` Tween``. `` TRANS_LINEAR`` significa que a animação deve ser linear. `` EASE_IN`` não faz nada com uma transição linear, mas devemos fornecer este último argumento ou obteremos um erro.
zh_cn: 最后两个参数是`Tween`类中的常量。`TRANS_LINEAR`意味着动画应该是线性的。`EASE_IN`对于线性变换没有任何作用，但我们必须提供最后一个参数，否则会得到一个错误。
