Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_code_a_life_bar.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, zh_cn, zh_tw

source: Control the game's UI with code
cs: Ovládání uživatelského rozhraní hry pomocí kódu
de: Kontrolle der Spiel-Benutzeroberfläche mittels Code
es: Controla la UI del juego con código
fr: Contrôler l'interface utilisateur du jeu avec du code
ja: コードを使用してゲームのUIを制御する
ko: 코드를 통해 게임의 UI를 제어하기
pt_br: Controlar a interface do jogo com código
ru: Управление игровым интерфейсом из кода
zh_cn: 用代码控制游戏UI
zh_tw: 使用程式控制遊戲的 UI

source: Intro
cs: Úvod
de: Einführung
es: Introducción
fr: Introduction
ja: イントロ
ko: 소개
pt_br: Introdução
ru: Введение
zh_cn: 简介
zh_tw: 簡介

source: In this tutorial, you will connect a character to a life bar and animate the health loss.
cs: V tomto tutoriálu spojíte postavu s ukazatelem života a budete animovat úbytek zdraví.
de: In dieser Anleitung werden wir einen Charakter mit einer Lebensleiste verbinden und den Gesundheitsverlust animieren.
fr: Dans ce tutoriel, vous allez connecter un personnage à une barre de vie et animer la perte de vie.
ja: このチュートリアルでは、キャラクターをライフバーに接続し、その健康状態の表示をライブバーで行います。
ko: 이 튜토리얼에서, 당신은 캐릭터를 체력 막대와 연결하고 체력이 줄어드는 것을 구현할 것입니다.
ru: В этом уроке вы присоедините персонажа к шкале жизни и анимируете потерю здоровья.
zh_cn: 在本教程中，您将生命条关联到一个角色，并动画化生命值损失。
zh_tw: 在這篇教學中我們會將角色連接到血槽，並在生命值損失顯示動畫。

source: Here's what you'll create: the bar and the counter animate when the character takes a hit. They fade when it dies.
cs: Tak tohle vytvoříte: Animovaný sloupec a počítadlo zásahů do postavy, který zmizí když postava zemře.
de: Hier ist, was Sie erschaffen werden: eine Bar und einen Zähler werden Sie animieren, wenn der Charakter Schaden nimmt. Sie verblassen, wenn er stirbt.
es: Esto es lo que vas a crear: la barra y el contador se animan cuando el personaje recibe un golpe. Se desvanecen cuando muere.
fr: Voici ce que vous allez créer : la barre et le compteur s'animent lorsque le personnage prend un coup. Ils s'estompent quand il meurt.
ja: ここで作成するのは、キャラクターがヒットを受けたときにバーとカウンターをアニメーションさせるものです。キャラクターが死ぬと徐々に消えます。
ko: 이것이 우리가 만들 것입니다: 캐릭터가 맞을 때 움직이는 막대와 카운터. 캐릭터가 죽으면 서서히 사라집니다.
pt_br: Aqui está o que você vai criar: a barra e o contador que animara quando o personagem recebe um hit. Eles desaparecem quando morre.
ru: Вот что вы создадите: анимацию шкалы и счетчика, когда персонаж получает урон. Они исчезают, когда он умирает.
zh_cn: 下面是您将创建的:当角色受到攻击时，工具条和计数器将显示动画。当它消失的时候，它们就会褪色。
zh_tw: 我們要做的：血槽與數字會在角色被攻擊時播放動畫，且會在角色死亡的時候淡出。

source: You will learn:
cs: Naučíte se:
de: Sie lernen hier:
es: Aprenderás:
fr: Vous apprendrez :
ja: 次の方法について学習します:
ko: 배울 것입니다:
pt_br: Você vai aprender:
ru: Вы узнаете:
zh_cn: 您将学习:
zh_tw: 你將學習：

source: How to **connect** a character to a GUI with signals
cs: Jak **připojit** postavu ke grafickému uživatelskému rozhraní pomocí signálů
de: Wie man einen Charakter mit einer GUI **verbindet**, indem man Signale benutzt
es: Cómo **conectar** un personaje a una GUI mediante señales
fr: Comment **connecter** un personnage à une interface graphique avec des signaux
ja: シグナルを使ってキャラクターをGUIに **接続** する方法
ko: 어떻게 캐릭터를 GUI에 시그널을 통해 **연결** 하는가
pt_br: Como conectar um caractere a uma interface gráfica com sinais
ru: Как **подключить** персонажа к интерфейсу с помощью сигналов
zh_cn: 如何用信号将一个角色 **连接** 到GUI
zh_tw: 如何通過訊號將角色 **連接** 到 GUI

source: How to **control** a GUI with GDscript
cs: Jak **ovládat** grafické uživatelské rozhraní pomocí GDscriptu
de: Wie man eine GUI mit GDScript **kontrolliert**
es: Cómo **controlar** una GUI mediante GDscript
fr: Comment **contrôler** une interface graphique avec GDscript
ja: GDscriptを使用してGUIを **制御する** 方法
ko: 어떻게 GUI를 GDScript를 통해 **제어** 하는가
pt_br: Como **controlar** uma GUI com GDscript
ru: Как **управлять** интерфейсом с помощью GDscript
zh_cn: 如何用GDscript **控制** 一个GUI
zh_tw: 如何使用 GDScript **控制** GUI

source: How to **animate** a life bar with the :ref:`Tween <class_Tween>` node
cs: Jak **animovat** proužek života pomocí uzlu :ref:`Tween <class_Tween>`
de: Wie man eine Lebensbar mit einer :ref:`Tween <class_Tween>`-Node animiert
es: Cómo **animar** una barra de vida con el nodo :ref:`Tween <class_Tween>`
fr: Comment **animer** une barre de vie avec le nœud :ref:`Tween <class_Tween_Tween>`
ja: :ref:`Tween <class_Tween>`\ ノードを使ってライフ バーを\ **アニメーション化する**\ 方法
ko: 어떻게 체력 막대를 :ref:`Tween <class_Tween>` 노드를 통해 **애니메이트(animate)** 하는가
pt_br: Como animar uma barra de vida com o nó: ref: `Tween <class_Tween>`
ru: Как **анимировать** шкалу здоровья с помощью узла :ref:`Tween <class_Tween>`
zh_cn: 如何用 :ref:`Tween <class_Tween>` 节点 **动画化** 生命条
zh_tw: 如何使用 :ref:`Tween <class_Tween>` 節點來 **動畫化** 血條

source: If you want to learn how to set up the interface instead, check out the step-by-step UI tutorials:
cs: Pokud se chcete naučit, jak vytvořit rozhraní, podívejte se na výukové programy uživatelského rozhraní krok za krokem:
de: Wenn Sie stattdessen lernen möchten, wie man ein Interface konfiguriert, werfen Sie einen Blick auf die Schritt-für-Schritt UI-Anleitung:
es: Si deseas aprender a configurar la interfaz en su lugar, echa un vistazo a los tutoriales de UI paso a paso:
fr: Si vous voulez apprendre comment configurer l'interface à la place, consultez les tutoriels pas-à-pas de l'interface utilisateur :
ja: 代わりにインターフェイスを設定する方法を学びたい場合は、ステップバイステップのUIチュートリアルを参照してください:
ko: 어떻게 인터페이스를 설정하는 지를 배우고 싶다면, 단계별 UI 튜토리얼을 참고하세요:
pt_br: Se você quiser aprender como configurar a interface, confira os tutoriais passo a passo da interface do usuário:
ru: Если вместо этого вы хотите узнать, как собственно настроить интерфейс, ознакомьтесь с уроками по UI:
zh_cn: 如果您想学习如何设置界面，请查看按部就班的UI教程:
zh_tw: 如果你想學習有關製作界面，請參考按部就班 UI 教學：

source: Create a main menu screen
es: Crear una pantalla de menú principal
fr: Créer un écran de menu principal
ja: メインメニュー画面の作成
ko: 메인 메뉴 화면 만들기
pt_br: Criar uma tela do menu principal
zh_cn: 创建一个主菜单屏幕

source: Create a game user interface
es: Crear una interfaz de usuario para el juego
fr: Créer une interface utilisateur de jeu
ja: ゲーム ユーザーインターフェイスの作成
ko: 게임 사용자 인터페이스 만들기
pt_br: Crie uma interface de usuário do jogo
zh_cn: 创建一个游戏用户界面

source: When you code a game, you want to build the core gameplay first: the main mechanics, player input, win and loss conditions. The UI comes a bit later. You want to keep all the elements that make up your project separate if possible. Each character should be in its own scene, with its own scripts, and so should the UI elements. This prevents bugs, keeps your project manageable, and allows different team members to work on different parts of the game.
cs: Když programujete hru, chcete nejprve vytvořit její jádro: hlavní mechanismy, vstupy hráčů, podmínky výhry a prohry. Uživatelské rozhraní přijde na řadu o něco později. Všechny prvky, které tvoří váš projekt, chcete mít pokud možno oddělené. Každá postava by měla být ve vlastní scéně s vlastními skripty a stejně tak prvky uživatelského rozhraní. Předejdete tak chybám, udržíte projekt zvládnutelný a umožníte různým členům týmu pracovat na různých částech hry.
de: Wenn Sie mit der Entwicklung beginnen, kümmern Sie sich zunächst um die Kernaspekte des Spiels: die Grundmechaniken, Eingabesteuerung, Sieg- und Verlustbedingungen. Die UI kommt etwas später nach. Halten Sie sämtliche Elemente des Projekts soweit es geht modular. Jeder Charakter sollte in einer eigenen Szene mit dazugehörigen Skripten untergebracht werden. Gleiches gilt für UI-Elemente. Dies beugt potenziellen Bugs vor und hält das Projekt überschaubar und erlaubt es Teammitgliedern, gemeinsam an unterschiedlichen Teilen des Spiels zu arbeiten.
es: Cuando codificas un juego, primero quieres construir el núcleo del juego: la mecánica principal, el comportamiento del jugador, las condiciones de ganancia y pérdida. La UI viene un poco más tarde. Si es posible, debes mantener separados todos los elementos que componen tu proyecto. Cada personaje debe estar en su propia escena, con sus propios scripts, y también los elementos de la interfaz de usuario. Esto previene errores, mantiene su proyecto manejable y permite que diferentes miembros del equipo trabajen en diferentes partes del juego.
fr: Lorsque vous codez un jeu, vous voulez d'abord construire le gameplay de base : les mécaniques principales, les actions du joueur, les conditions de victoire et de défaite. L'interface utilisateur arrive un peu plus tard. Vous voulez que tous les éléments qui composent votre projet soient séparés si possible. Chaque personnage devrait être dans sa propre scène, avec ses propres scripts, de même que pour les éléments de l'interface utilisateur. Cela permet d'éviter les bugs, de garder votre projet gérable, et permet à différents membres de l'équipe de travailler sur différentes parties du jeu.
ja: ゲームをコーディングするときには、最初にゲームプレイのコアとなる部分、つまり動作のメカニズム、プレイヤーの入力、勝敗条件を構築しなければなりません。その後にUIを設計します。可能であれば、プロジェクトを構成するすべての要素を別々にしておきます。各キャラクタは独自のシーンの中に、独自のスクリプトを持って存在する必要があり、UI要素もそれと同様です。これによってバグを防ぎ、プロジェクトを管理しやすくし、異なるチームメンバーがゲームのそれぞれの部分で作業できるようになります。
ko: 게임을 코딩할 때, 당신은 핵심 게임 플레이를 먼저 만들고 싶을 것입니다: 주요 기능, 플레이어 입력, 승패 여부. UI는 나중에나 떠오를 겁니다. 당신은 프로젝트를 만들기 위한 모든 요소들을 가능한 한 분리되도록 하고 싶을 것입니다. 각 캐릭터는 자신의 씬에, 자신의 스크립트를 가지고 있어서, UI 요소가 되어야 합니다. 이것은 버그를 예방하고 프로젝트 관리를 유지하며, 다른 팀 구성원들이 게임의 다른 부분을 작업하도록 만듭니다.
pt_br: Quando você codifica um jogo, você quer construir a jogabilidade central primeiro: a mecânica principal, a entrada do jogador, as condições de vitória e derrota. A interface do usuário vem um pouco depois. Você quer manter todos os elementos que compõem seu projeto separados, se possível. Cada personagem deve estar em sua própria cena, com seus próprios scripts, assim como os elementos da interface do usuário. Isso evita bugs, mantém seu projeto gerenciável e permite que diferentes membros da equipe trabalhem em diferentes partes do jogo.
ru: Когда вы программируете игру, в первую очередь вы должны сделать: основные механики, ввод игрока, условия победы и поражения. UI делается немного позднее. Вам необходимо держать все элементы, которые составляют ваш проект, отдельно, если это возможно. Каждый элемент должен иметь свою сцену, со своими собственными скриптами. Это предотвращает ошибки, обеспечивает управляемость проектом и позволяет разным участникам команды работать с разными частями игры.
zh_cn: 当您编写一款游戏时，您首先要构建核心游戏玩法:主要机制，游戏角色输入，胜败条件。UI要晚一些。如果可能的话，您希望将组成项目的所有元素分开。每个角色都应该在自己的场景中，有自己的脚本，UI元素也应该如此。这可以防止bug，保持项目的可管理性，并允许不同的团队成员在游戏的不同部分工作。
zh_tw: 在編寫遊戲程式碼時，我們通常會先製作遊戲過程的核型程式，如遊戲的主要機制、玩家輸入、判斷勝利與失敗的條件等。UI 通常都是比較後面才會做的。我們通常會希望將遊戲中的各個元素都儘可能拆開來，將每個角色都放在各自的場景中，有各自的腳本。UI 元素也是一樣。這樣一來可以防止 Bug，並讓專案好管理，且能夠讓不同的團隊成員都能各自處理遊戲中不同的部分。

source: Once the core gameplay and the UI are ready, you'll need to connect them somehow. In our example, we have the Enemy who attacks the Player at constant time intervals. We want the life bar to update when the Player takes damage.
cs: Jakmile je hotová základní hra i uživatelské rozhraní, je třeba je nějak propojit. V našem příkladu máme Nepřítele, který na Hráče útočí v konstantních časových intervalech. Chceme, aby se ukazatel života aktualizoval, když Hráč utrpí poškození.
de: Sobald das Kern-Gameplay und die Benutzeroberfläche fertig sind, müssen Sie sie irgendwie verbinden. In unserem Beispiel haben wir den Feind, der den Spieler in konstanten Zeitintervallen angreift. Wir möchten, dass die Lebensleiste aktualisiert wird, wenn der Spieler Schaden nimmt.
es: Una vez que el núcleo del juego y la UI estén listos, tendrás que conectarlos de alguna manera. En nuestro ejemplo, tenemos al Enemy (Enemigo) que ataca al Player (Jugador) a intervalos de tiempo constantes. Queremos que la barra de vida se actualice cuando el Player sufra daños.
fr: Une fois que le gameplay de base et l'interface utilisateur sont prêts, vous devrez les connecter d'une manière ou d'une autre. Dans notre exemple, nous avons l'ennemi qui attaque le joueur à intervalles de temps constants. Nous voulons que la barre de vie se mette à jour lorsque le joueur subit des dégâts.
ja: 中核となるゲームプレイとUIの準備ができたら、何らかの方法でそれらを接続する必要があります。この例では、一定の時間間隔でプレイヤーを攻撃する敵がいます。プレイヤーがダメージを受けたときは、ライフバーには更新してほしいでしょう。
ko: 일단 핵심 게임 플레이와 UI가 준비되었다면, 이 들을 어떤 방법으로 연결해야 합니다. 우리의 예제에서는, 우리는 일정한 시간마다 플레이어를 공격하는 적을 가지고 있습니다. 우리는 플레이어가 피해를 입을 때마다 체력 막대가 업데이트 되길 원합니다.
pt_br: Quando a jogabilidade central e a interface do usuário estiverem prontas, você precisará conectá-las de alguma forma. Em nosso exemplo, temos o inimigo que ataca o jogador em intervalos de tempo constantes. Queremos que a barra de vida seja atualizada quando o jogador sofrer dano.
ru: После того, как основа игры и UI готовы, вам нужно будет соединить их как-то. В нашем примере у нас есть враг, который атакует игрока с постоянными временными интервалами. Мы хотим, чтобы шкала жизни обновлялась когда игрок получает повреждения.
zh_cn: 一旦核心游戏玩法和UI准备就绪，您就需要以某种方式将它们连接起来。在我们的示例中，我们有敌人以固定的时间间隔攻击游戏角色。当游戏角色受到伤害时，我们希望生命条能够更新。
zh_tw: 一旦準備好核心的遊戲功能與 UI，我們就需要用某種方式來把遊戲功能與 UI 連接起來。舉例而言，若我們有敵人會定期攻擊玩家，則我們就要讓血槽會在玩家被攻擊的時候一起更新。

source: To do this, we will use **signals**.
cs: K tomu použijeme **signály**.
de: Dafür benutzt man **Signale**.
es: Para hacer esto, usaremos **señales**.
fr: Pour ce faire, nous utiliserons des **signaux**.
ja: これを行うには、 **シグナル** を使用します。
ko: 그러기 위해서, 우리는 **시그널(signals)** 을 사용할 것입니다.
pt_br: Para fazer isso, usaremos **sinais**.
ru: Для этого мы будем использовать **сигналы**.
zh_cn: 为此，我们将使用 **信号** 。
zh_tw: 要做到這點，我們會使用 **訊號** 。

source: Signals are Godot's version of the Observer pattern. They allow us to send out some message. Other nodes can connect to the object that **emits** the signal and receive the information. It's a powerful tool we use a lot for User Interface and achievement systems. You don't want to use them everywhere, though. Connecting two nodes adds some coupling between them. When there's a lot of connections, they become hard to manage. For more information, check out the `signals video tutorial <https://youtu.be/l0BkQxF7X3E>`_ on GDquest.
cs: Signály jsou Godotovou verzí vzoru Observer. Umožňují nám vyslat nějakou zprávu. Ostatní uzly se mohou připojit k objektu, který **vysílá** signál, a přijmout informaci. Je to mocný nástroj, který často používáme pro uživatelské rozhraní a systémy achievmentů. Nechcete je však používat všude. Propojení dvou uzlů mezi ně přidává určitou vazbu. Když je vazeb hodně, obtížně se spravují. Další informace najdete ve videonávodu `signals <https://youtu.be/l0BkQxF7X3E>`_ na webu GDquest.
de: Signale sind die Implementierung des Beobachter-Entwurfsmusters (Observer) in Godot. Sie erlauben das Absenden von Nachrichten, die von einem anderen Objekt empfangen werden kann. Dazu wird ein Node mit dem Objekt verbunden, welches das Signal **emittiert** und erhält so die Informationen des Signals. Ein mächtiges Werkzeug, vor allem bei der Umsetzung von Benutzeroberflächen und Errungenschaften. Da das Verbinden zweier Nodes gleichzeitig eine gewisse Abhängigkeit voneinander erzeugt, sollten sie allerdings stets mit Bedacht verwendet werden, bei zu vielen Verbindungen kann es schwierig werden, den Überblick zu behalten. Für mehr Informationen, schauen Sie sich das `signals video tutorial <https://youtu.be/l0BkQxF7X3E>`_ von GDquest an.
fr: Les signaux sont la version Godot du patron de conception Observateur. Ils nous permettent d'envoyer un message. D'autres nœuds peuvent se connecter à l'objet qui **émet** le signal et reçoit l'information. C'est un outil puissant que nous utilisons beaucoup pour l'interface utilisateur et les systèmes de succès. Mais vous ne voulez pas les utiliser partout. La connexion de deux nœuds ajoute un certain couplage entre eux. Quand il y a beaucoup de connexions, elles deviennent difficiles à gérer. Plus d'informations sur le tutoriel vidéo `Introduction to signals in the Godot game engine <https://youtu.be/l0BkQxF7X3E>`_ sur GDquest.
ja: シグナルは、ObserverパターンのGodot版です。メッセージを送信することができます。他のノードは、シグナルを **発信** するオブジェクトに接続して、情報を受信できます。これは強力なツールで、ユーザーインターフェイスや実績システムで多用されています。ただし、全ての場面で使用する必要はありません。 2つのノードを接続すると、ノード間の結合度が増します。接続が多いと、それだけ管理するのが難しくなります。詳細については、GDquestの \ `signals video tutorial <https://youtu.be/l0BkQxF7X3E>`_\ (英語)をご覧ください。
ko: 시그널은 옵저버 패턴의 Godot 버전입니다. 그들로 메시지를 전달할 수 있습니다. 다른 노드들은 시그널을 **방출(emits)** 하고 정보를 받을 수 있는 다른 물체와 연결할 수 있습니다. 이것은 사용자 인터페이스와 업적 달성 시스템에 많이 쓰일 강력한 도구입니다. 그러나 그것들을 남용하기를 권하진 않습니다. 두 노드를 연결하면 노드 간의 커플링이 생겨납니다. 많은 연결이 있다면, 관리하기가 어려워집니다. GDquest의 `signals video tutorial <https://youtu.be/l0BkQxF7X3E>`_ 에서 더 많은 정보를 보실 수 있습니다.
ru: Сигналы — это своя версия шаблона Observer в Godot. Они позволяют нам отправить некоторый сигнал. Другие узлы могут подключаться к объекту, который **излучает** сигнал и получать информацию об этом. Это мощный инструмент, который мы часто используем для пользовательского интерфейса (UI) и систем достижений. Вы не обязаны использовать их повсюду. Соединение двух узлов добавляет некоторую связь между ними. Когда есть много связей, ими становятся трудно управлять. Для получения дополнительной информации посмотрите `signals video tutorial <https://youtu.be/l0BkQxF7X3E>`_ on GDquest.
zh_cn: 信号是Godot观察者模式的版本。他们允许我们发出一些信息。其他节点可以连接到 **emits(发出)** 信号并接收信息的对象。这是一个强大的工具，我们经常使用用户界面和成就系统。但是，您不希望在任何地方都使用它们。连接两个节点增加了它们之间的耦合。当有很多联系时，就很难管理了。有关更多信息，请在GDquest查看“信号视频教程`signals video tutorial <https://youtu.be/l0BkQxF7X3E>`_ 。
zh_tw: 訊號就是 Godot 版本的 Observer 設計模式（觀察者模式）。訊號允許我們能送出某種訊息，而其他的節點則可以連接物件來 **送出 (Emit)** 訊號與接收資訊。訊號對於使用者界面與成就系統來說是很強大的工具，但我們通常不會給所有地方都用上訊號。連接兩個節點會增加節點間的耦合度。當有大量的連接時，節點就變得難以管理。更多資訊請參考 GDquest 的 `影片訊號教學（英語）<https://youtu.be/l0BkQxF7X3E>`_ 。

source: Download and explore the start project
cs: Stažení a prozkoumání počátečního projektu
de: Laden und sehen Sie sich das Startprojekt an
es: Descarga y explora el proyecto de inicio
fr: Télécharger et explorer le projet de démarrage
ja: スタートプロジェクトをダウンロードして参照する
ko: 시작 프로젝트를 다운로드하고 탐구하기
pt_br: Baixe e explore o projeto inicial
ru: Скачайте и изучите стартовый проект
zh_cn: 下载并探索启动项目
zh_tw: 下載並摸索起始專案

source: Download the Godot project: :download:`ui_code_life_bar.zip <files/ui_code_life_bar.zip>`. It contains all the assets and scripts you need to get started. Extract the .zip archive to get two folders: `start` and `end`.
cs: Stáhněte si projekt Godot: :download:`ui_code_life_bar.zip <files/ui_code_life_bar.zip>`. Obsahuje všechny prostředky a skripty, které potřebujete pro začátek. Rozbalením archivu .zip získáte dvě složky: `start` a `end`.
de: Laden Sie das Godot-Projekt herunter: :download:`ui_code_life_bar.zip <files/ui_code_life_bar.zip>`. Es enthält sämtliche Nutzerinhalte und Skripte die Sie zum Start benötigen. Entpacken Sie das Zip-Archiv, um diese beiden Ordner zu erhalten: `start` und `end`.
es: Descarga el proyecto Godot: :download:`ui_code_life_bar.zip <files/ui_code_life_bar.zip>`. Contiene todos los recursos y scripts que necesitas para empezar. Extrae el archivo .zip para obtener las dos carpetas:`start` and `end`.
fr: Télécharger le projet Godot : :download:`ui_code_life_bar.zip <files/ui_code_life_bar.zip>`. Il contient toutes les ressources et les scripts dont vous avez besoin pour démarrer. Extraire l'archive .zip pour obtenir deux dossiers : `start` et `end`.
ja: Godotプロジェクトをダウンロード(:download:`ui_code_life_bar.zip <files/ui_code_life_bar.zip>`)してください。チュートリアルに必要なすべての素材やスクリプトが入っています。zipアーカイブを解凍して、2つのフォルダ `start` と `end` を取得します。
ko: Godot 프로젝트를 다운로드 하세요: :download:`ui_code_life_bar.zip <files/ui_code_life_bar.zip>`. 시작할 모든 애셋과 스크립트가 포함되어 있습니다. .zip 파일을 풀고 두 개의 폴더가 나옵니다: `start` 와 `end` 입니다.
pt_br: Baixe o projeto Godot: :download:`ui_code_life_bar.zip <files/ui_code_life_bar.zip>`. Ele contém todos os recursos e scripts de que você precisa para começar. Extraia o arquivo .zip para obter duas pastas: `start` e` end`.
ru: Скачать проект Godot : :download:`ui_code_life_bar.zip <files/ui_code_life_bar.zip>`. Он содержит все ресурсы и скрипты, необходимые для начала работы. Извлеките ZIP-архив, чтобы получить две папки: `start` и `end`.
zh_cn: 下载Godot项目: :download:`ui_code_life_bar.zip <files/ui_code_life_bar.zip>`。它包含启动所需的所有资源和脚本。提取.zip归档文件以获得两个文件夹: *start* 和 *end* 。
zh_tw: 下載這個 Godot 專案： :download:`ui_code_life_bar.zip <files/ui_code_life_bar.zip>` 。這個專案包含了所有需要用到的資源與腳本。解壓縮 .zip 檔會有兩個資料夾： `start` 與 `end` 。

source: Load the ``start`` project in Godot. In the ``FileSystem`` dock, double click on LevelMockup.tscn to open it. It's an RPG game's mockup where 2 characters face each other. The pink enemy attacks and damages the green square at regular time intervals, until its death. Feel free to try out the game: the basic combat mechanics already work. But as the character isn't connected to the life bar, the ``GUI`` doesn't do anything.
cs: Načtení projektu ``start`` v Godotu. V doku ``FileSystem`` jej otevřete poklepáním na soubor LevelMockup.tscn. Jedná se o model RPG hry, kde proti sobě stojí 2 postavy. Růžový nepřítel v pravidelných časových intervalech útočí na zelený čtverec a poškozuje ho, dokud ho nezničí. Neváhejte a vyzkoušejte si hru: základní bojové mechaniky již fungují. Protože však postava není spojena s ukazatelem života, ``GUI`` nic nedělá.
de: Laden Sie das ``start``-Projekt in Godot. Im ``Dateisystem``-Fenster, doppelklicken auf LevelMockup.tscn, um es zu öffnen. Es ist ein RPG-Mock-up in dem sich zwei Charaktere gegenüberstehen. Der rosafarbene Gegner greift das grüne Viereck an und fügt ihm regelmäßig Schaden zu, bis es stirbt. Probieren Sie das Spiel aus: eine grundlegende Kampfmechnik ist bereits enthalten. Allerdings funktioniert die ``GUI`` noch nicht, da der Spieler bisher nicht mit der Lebensanzeige verbunden ist.
fr: Charger le projet ``start`` dans Godot. Dans le dock ``FileSystem``, double-cliquez sur LevelMockup.tscn pour l'ouvrir. C'est une maquette de jeu de rôle où 2 personnages se font face. L'ennemi rose attaque et endommage le carré vert à intervalles réguliers, jusqu'à sa mort. N'hésitez pas à essayer le jeu : les mécanismes de combat de base fonctionnent déjà. Mais comme le personnage n'est pas connecté à la barre de vie, le ``GUI`` ne fait rien.
ja: Godotに ``start`` プロジェクトを読み込みます。 ``ファイルシステム`` ドックで、LevelMockup.tscnをダブルクリックして開きます。 2人のキャラクターが向かい合っているRPGゲームのモックアップです。ピンク色の敵は、死ぬまで一定の時間間隔で緑色の正方形を攻撃し、ダメージを与えます。ゲームを試してみてください: 基本的な戦闘の仕組みはすでに機能しています。ですが、キャラクターはライフバーに接続されていないため、\ ``GUI`` は何もしません。
ko: Godot에서 ``start`` 프로젝트를 불러옵니다. ``파일 시스템`` 독에서 LevelMockup.tscn을 더블 클릭해서 엽니다. 이것은 두 캐릭터가 마주 보고 있는 RPG 게임의 모형입니다. 분홍색 적이 일정하게 공격하고 초록색 사각형이 맞는 것을 반복합니다, 죽을 때 까지 말이죠. 게임을 한번 해보세요: 기본 전투 구조는 이미 작동합니다. 하지만 캐릭터가 체력 막대와 연결되어 있지 않기 때문에 ``GUI``\ 는 아무것도 하지 않습니다.
ru: Загрузите проект ``start`` в Godot. В ``Файловой системе`` дважды щелкните на LevelMockup.tscn, чтобы открыть её. Это макет RPG игры, где 2 персонажа сталкиваются друг с другом. Розовый враг атакует и наносит урон зелёному квадрату через регулярные промежутки времени, вплоть до его смерти. Вы можете опробовать игру: основная боевая механика уже работает. Но так как персонаж не подключен к шкале жизни ``GUI`` никак не изменяется.
zh_cn: 加载Godot中的 ``start`` 项目。在 ``FileSystem`` 面板中双击LevelMockup.tscn打开它。这是一个RPG游戏的模型，两个角色面对面。粉色的敌人定期攻击并破坏绿色的正方形，直到它死亡。请随意尝试游戏:基本的战斗机制已经工作。但由于角色没有连接到生命条，`GUI`什么也做不了。
zh_tw: 在 Godot 中載入 ``start`` 專案。到 ``檔案系統`` Dock 中點兩下來打開 LevelMockup.tscn。這個場景是一個 RPG 遊戲的打樣，裡面有兩個角色面對面。粉紅色的敵人會定期攻擊綠色方塊並造成傷害，直到綠色方塊死亡。你可以試玩一下這個已經有基本戰鬥機制的遊戲。但，角色還沒有與血槽關聯起來， ``GUI`` 沒有任何作用。
