Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_code_a_life_bar.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, zh_cn, zh_tw

source: When the green character dies, it plays a death animation and fades out. At this point, we shouldn't show the interface anymore. Let's fade the bar as well when the character died. We will reuse the same ``Tween`` node as it manages multiple animations in parallel for us.
cs: Když zelená postava zemře, přehraje animaci smrti a zmizí. V tomto okamžiku bychom již neměli zobrazovat rozhraní. Když postava zemře, zmizí i lišta. Znovu použijeme stejný uzel ``Tween``, protože ten pro nás umí spravovat více animací najednou a to paralelně.
de: Wenn die grüne Figur stirbt, spielt sie eine Todesanimation ab und wird ausgeblendet. An diesem Punkt sollten wir das Interface nicht mehr zeigen. Lassen wir auch den Balken ausblenden, wenn der Charakter stirbt. Wir werden denselben ``Tween``-Node wieder verwenden, da er für uns mehrere Animationen parallel verwaltet.
es: Cuando el personaje verde muere, reproduce una animación de muerte y se desvanece. En este punto, no deberíamos mostrar más la interfaz. Desvanezcamos la barra también cuando el personaje muera. Reutilizaremos el mismo nodo ``Tween`` ya que gestiona múltiples animaciones en paralelo por nosotros.
fr: Quand le personnage vert meurt, il joue une animation de mort et disparaît. À ce moment on ne veut plus afficher l'interface. Faisons disparaître la barre quand le personnage meurt. On réutilisera le nœud ``Tween`` puisqu'il peut gérer plusieurs animations en parallèle.
ja: 緑のキャラクタが消滅すると、消滅アニメーションが再生されて消えます。この時点では、インタフェースは表示されません。キャラクターが死んだら、バーも消去しましょう。複数のアニメーションを並行して管理するため、同じ ``Tween`` ノードを再利用します。
ko: 초록색 캐릭터가 죽을 때, 죽음 애니메이션을 재생하고 사라집니다. 이 점에서, 우리는 인터페이스를 더 이상 표시해서는 안됩니다. 캐릭터가 죽을 때 처럼 막대를 사라지게 해봅시다. 우리는 ``Tween`` 노드가 여러 애니메이션을 동시에 관리하므로 같은 노드를 다시 사용할 것입니다.
pt_br: Quando o personagem verde morre, ele executa uma animação de morte e desaparece. Neste ponto, não devemos mais mostrar a interface. Vamos desaparecer também quando o personagem morrer. Vamos reutilizar o mesmo nó `` Tween`` enquanto ele gerencia múltiplas animações em paralelo para nós.
ru: Когда зеленый персонаж умирает, то проигрывается анимация смерти и он пропадает. На данный момент, мы не должны больше показывать интерфейс. Давайте когда персонаж погибает будет скрывать шкалы. Мы будем повторно использовать один и тот же узел ``Tween``, поскольку он управляет несколькими анимациями параллельно для нас.
zh_cn: 当绿色角色死亡时，它会播放死亡动画并淡出。此时，我们不应该再显示界面。当角色死亡时，让我们也淡出栏。我们将重用相同的`Tween`节点，因为它为我们同时管理多个动画。
zh_tw: 當綠色角色死亡時播放死亡動畫並淡出。這時，我們就不該再繼續顯示界面了。讓我們在角色死亡的時候淡出血槽。由於 ``Tween`` 節點可以同時平行處理多個動畫，所以我們會重複使用相同的 ``Tween`` 節點。

source: First, the ``GUI`` needs to connect to the ``Player``'s ``died`` signal to know when it died. Press :kbd:`F1` to jump back to the 2D Workspace. Select the ``Player`` node in the Scene dock and click on the Node tab next to the Inspector.
de: Zunächst muss die ``GUI``` mit dem ``Player`````died''-Signal verbunden werden, um zu wissen, wann er gestorben ist. Drücken Sie :kbd:``F1`, um zurück in den 2D-Arbeitsbereich zu springen. Wählen Sie den Node ``Player`` im Szenen-Dock und klicken Sie auf die Registerkarte "Knoten" neben dem Inspektor.
es: Primero, ``GUI`` necesita conectarse a la señal de ``died`` del ``Player``'s para saber cuándo murió. Pulsa :kbd:`F1` para volver al espacio de trabajo 2D. Selecciona el nodo ``Player`` en el panel de Escenas y haz clic en la pestaña Nodos junto al Inspector.
fr: Tout d'abord l'interface ``GUI`` doit être connecté au signal envoyé à la mort ``died`` du joueur ``Player`. Appuyer sur :kbd:`F1` pour repasser sur l'espace de travail 2D. Sélectionner le nœud ``Player``dans le dock des scène et cliquer dans l'inspecteur sur l'onglet Node.
ja: まず、 ``GUI`` は ``Player`` の ``died`` シグナルに接続して、いつ死亡したかを知る必要があります。 :kbd:`F1` を押して2Dワークスペースに戻ります。シーンドックで ``Player`` ノードを選択し、インスペクタの隣にあるノードタブをクリックします。
ko: 먼저, ``GUI`` 는 ``Player`` 의 ``died`` 시그널에 연결해서 언제 죽었는 지를 알아야 합니다. :kbd:`F1` 키를 눌러 2D 작업 공간으로 돌아갑니다. 씬 독에서 ``Player`` 노드를 선택하고 인스펙터(Inspecter) 옆의 노드 탭을 클릭합니다.
pt_br: Primeiro, o `` GUI`` precisa se conectar ao sinal `` died`` do `` Player`` para saber quando ele morreu. Pressione: kbd: `F1` para voltar ao espaço de trabalho 2D. Selecione o nó `` Player`` na doca Scene e clique na aba Node ao lado do Inspector.
zh_cn: 首先，``GU`` 需要连接到 ``Player`` 的 ``died`` 信号，以知道它何时死亡。按 :kbd:`F1` 跳转回2D工作区。在场景面板中选择 ``Player`` 节点，然后单击属性面板旁边的节点选项卡。
zh_tw: 首先我們需要將 ``GUI`` 連接到 ``Player`` 的 ``died`` 訊號，才能知道玩家何時死掉的。按 :kbd:`F1` 來跳回到 2D 工作區。在場景 Dock 中選擇 ``Player`` 並點擊屬性面板旁邊的節點分頁。

source: Find the ``died`` signal, select it, and click the Connect button.
cs: Najděte signál ``died``, vyberte jej a klikněte na tlačítko Připojit.
de: Suchen das ''died''-Signal, wählen es aus, und klicken Sie auf die Schaltfläche Verbinden.
es: Busca la señal ``died``, selecciónala y haz clic en el botón Conectar.
fr: Trouver et sélectionner le signal ``died``, et cliquer sur le bouton Connect.
ja: ``died`` シグナルを見つけて選択し、接続ボタンをクリックします。
ko: ``died`` 시그널을 찾아서, 선택하고, 연결하기 버튼을 누릅니다.
pt_br: Encontre o sinal `` morreu``, selecione-o e clique no botão Conectar.
ru: Найдите сигнал ``died``, выберите его и нажмите кнопку Connect (Подключить).
zh_cn: 找到 ``died`` 信号，选择它，然后点击连接按钮。
zh_tw: 找到 ``died`` 訊號並選擇，然後點擊連接按鈕。

source: The signal should already have the Enemy connected to it
cs: K signálu by již měl být připojen Enemy
de: Der Feind sollte bereits mit dem Signal verbunden sein
es: La señal ya debería tener al enemigo conectado
fr: Le signal devrait déjà être connecté à l’ennemi
ja: シグナルにはすでに敵が接続しているはずです
ko: 시그널에는 이미 Enemy와 연결되어 있어야 합니다
pt_br: O sinal já deve ter o inimigo conectado a ele
ru: Сигнал уже должен быть подключен к Enemy
zh_cn: 这个信号应该已经连上了敌人
zh_tw: 訊號應該已經連接到 Enemy 上了

source: In the Connecting Signal window, connect to the ``GUI`` node again. The Path to Node should be ``../../GUI`` and the Method in Node should show ``_on_Player_died``. Leave the Make Function option on and click Connect at the bottom of the window. This will take you to the ``GUI.gd`` file in the Script Workspace.
cs: V okně Připojení signálu se znovu připojte k uzlu ``GUI``. Cesta k uzlu by měla být ``../../GUI`` a metoda v uzlu by měla být ``_on_Player_died``. Ponechte zapnutou volbu Make Function a klikněte na Connect v dolní části okna. Tím se dostanete do souboru ``GUI.gd`` v pracovním prostoru skriptu.
de: Stellen Sie im Fenster "Verbindungssignal" wieder eine Verbindung zum Node ``GUI`` her. Der Pfad zum Node sollte ```../../GUI`` sein und die Methode im Node sollte ``_on_Player_died`` anzeigen. Lassen Sie die Option Make Function eingeschaltet und klicken Sie unten im Fenster auf Connect. Dies führt Sie zu der Datei ``GUI.gd`` im Skript-Arbeitsbereich.
es: En la ventana Contectando Señal, conecta de nuevo con el nodo ``GUI``. La ruta al nodo debe ser ``../../GUI`` y el método en el nodo debe mostrar ``_on_Player_died``. Deja la opción Make Function activada y haz clic en Conectar en la parte inferior de la ventana. Esto te llevará al archivo ``GUI.gd`` en el Área de Trabajo de Scripts.
fr: Dans la fenêtre de connexion des signaux, connecter le nœud ``GUI``. Le chemin du nœud devrait être ``../../GUI`` et ``_on_Player_died`` devrait être afficher dans Method in Node . Laisser l'option Make Function activé et cliquer sur Connect au bas de la fenêtre. Cela vous emmènera sur le script ``GUI.gd``.
ja: シグナルの接続ウィンドウで、 ``GUI`` ノードにもう一度接続します。ノードへのパスは ``../../GUI`` 、ノード内のメソッドは ``_on_Player_died`` と表示されます。関数作成オプションをオンのままにして、ウィンドウ下部の接続をクリックします。 これにより、スクリプトワークスペースの ``GUI.gd`` ファイルに移動します。
ko: 시그널 연결 창에서, ``GUI`` 노드를 다시 연결합니다. 노드 경로는 ``../../GUI`` 가 되어야 하고 Method in Node는 ``_on_Player_died`` 가 되어야 합니다. 함수 만들기 설정을 둔 채로 창 아래 연결 버튼을 누릅니다. 이걸로 Script 작업 공간에서 ``GUI.gd`` 파일로 진입하게 됩니다.
pt_br: Na janela Connecting Signal, conecte-se ao nó `` GUI`` novamente. O caminho para o nó deve ser `` ../../ GUI`` e o método no nó deve mostrar `` _on_Player_died``. Deixe a opção Make Function ativada e clique em Connect na parte inferior da janela. Isso levará você ao arquivo `` GUI.gd`` no espaço de trabalho do Script.
ru: В окне Connecting Signal (Подключение сигнала) снова подключитесь к узлу ``GUI``. Путь к узлу должен быть ``../../GUI``, а метод в узле должен показывать ``_on_Player_died``. Оставьте опцию Сделать Функцию включенной и нажмите Подключить в нижней части окна. После этого вы перейдете в ``GUI.gd`` во вкладке Script.
zh_cn: 在连接信号窗口中，再次连接到`GUI`节点。节点的路径应该是`../../GUI`并且节点中的方法应该显示`_on_Player_died`。保留Make函数选项并单击窗口底部的Connect。这将把您带到脚本工作空间中的`GUI.gd`文件中。
zh_tw: 再次在連接訊號視窗中選擇 ``GUI`` 節點。節點路徑應該顯示為 ``../../GUI`` ，而節點中方法應該顯示 ``_on_Player_died`` 。保持建立函式選項勾選，然後點擊視窗底部的連接按鈕。接著會在腳本工作區內打開 ``GUI.gd`` 。

source: You should get these values in the Connecting Signal window
cs: V okně Připojení signálu by se měly zobrazit tyto hodnoty
de: Sie sollten diese Werte im Fenster Verbindungssignal erhalten
es: Se debe obtener estos valores en la ventana Conectando Señal
fr: Vous devriez avoir ces valeurs dans la fenêtre de connexion des signaux
ja: これらの値は、シグナルの接続ウィンドウに表示されます
ko: 시그널 연결 창에서 이 값들을 받아야 합니다
pt_br: Você deve obter esses valores na janela Conectando um sinal
ru: Вы должны получить эти значения в окне Connecting Signal (Подключение сигнала)
zh_cn: 您应该在连接信号窗口中获得这些值
zh_tw: 連接訊號視窗內應該顯示這些值

source: You should see a pattern by now: every time the GUI needs a new piece of information, we emit a new signal. Use them wisely: the more connections you add, the harder they are to track.
cs: Už byste měli vidět pravidlo: pokaždé, když grafické uživatelské rozhraní potřebuje novou informaci, vyšleme nový signál. Používejte signály s rozumem: čím více jich přidáte, tím hůře se budou spravovat.
de: Sie sollten jetzt ein Muster sehen: Jedes Mal, wenn die GUI eine neue Information benötigt, geben wir ein neues Signal aus. Verwenden Sie sie mit Bedacht: Je mehr Verbindungen Sie hinzufügen, desto schwieriger sind sie zu verfolgen.
es: Ya deberías notar un patrón: cada vez que la GUI necesita una nueva información, emitimos una nueva señal. Úsalas sabiamente: mientras más conexiones añadas, serán más difíciles de seguir.
fr: Vous devriez maintenant voir un modèle : chaque fois que le GUI a besoin d'une nouvelle pièce d'informations, nous émettons un nouveau signal. Utilisez-les judicieusement : plus vous ajoutez des connexions, plus elles seront difficiles à suivre.
ja: GUIが新しい情報を必要とするたびに、新しいシグナルを発信します。より多くのコネクションを追加すればするほど、それらを追跡するのは難しくなります。上手く使いましょう。
ko: 지금부터는 패턴을 보아야 합니다: 매 순간 GUI가 새로운 정보가 필요하면, 우리는 새 시그널을 방출합니다. 그들을 현명하게 사용하세요: 더 많은 연결을 추가할수록, 추적하는 일은 더 어려워집니다.
pt_br: Você deve ver um padrão agora: toda vez que a GUI precisar de uma nova informação, emitimos um novo sinal. Use-os com sabedoria: quanto mais conexões você adicionar, mais difícil será rastrear.
ru: Теперь вы должны увидеть закономерность: каждый раз, когда графическому интерфейсу нужна новая информация, мы посылаем новый сигнал. Используйте их разумно: чем больше связей вы добавляете, тем сложнее их отслеживать.
zh_cn: 您现在应该看到一个模式:每当GUI需要一条新的信息时，我们都会发出一个新的信号。明智地使用它们:添加的连接越多，跟踪它们就越困难。
zh_tw: 現在你應該看出模式了：每當 GUI 需要新的資訊時，我們就會發出新訊號。但請小心使用，因為建立越多連接則代表越難追蹤。

source: To animate a fade on a UI element, we have to use its ``modulate`` property. ``modulate`` is a ``Color`` that multiplies the colors of our textures.
cs: Chceme-li animovat stmívání prvku uživatelského rozhraní, musíme použít jeho vlastnost ``modulate``. ``modulate`` je vlastnost ``Color``, která násobí barvy našich textur.
de: Um ein Fade auf einem UI-Element zu animieren, müssen wir seine Eigenschaft ``modulate`` property. ``modulate`` ist eine ``Color``, die unserer Texturen Farben vervielfacht.
es: Para animar el desvanecimiento de un elemento de UI, tenemos que usar su propiedad ``modulate``. ``modulate`` es un ``Color``que multiplica los colores de nuestras texturas.
fr: Pour animer un fondu sur un élément UI, nous devons utiliser la propriété ``modulate``. ``modulate`` est une ``Color`` qui multiplie les couleurs de nos textures.
ja: UI要素でフェードをアニメーションするには、その ``modulate`` プロパティを使用する必要があります。 ``modulate`` はテクスチャの色を乗算する ``Color`` です。
ko: UI 요소가 사라지도록 애니메이트 하기 위해, 우리는 그것의 ``modulate`` 속성을 사용해야 합니다. ``modulate`` 는 ``Color`` 로 텍스처의 색상을 곱합니다.
pt_br: Para animar um fade em um elemento da interface do usuário, temos que usar sua propriedade `` modulate``. `` modulate`` é uma `` Cor`` que multiplica as cores de nossas texturas.
ru: Чтобы анимировать исчезновение на элементе UI, мы должны использовать его свойство ``modulate``. Свойство ``modulate`` - это ``Color``, который умножает цвета наших текстур.
zh_cn: 要使UI元素的淡入动画，我们必须使用它的 ``modulate`` 属性。``modulate`` 是一种 ``Color``，它可以使我们的纹理颜色倍增。
zh_tw: 要讓 UI 元素動畫淡出，我們必須使用 ``modulate`` 屬性。 ``modulate`` 是 ``Color`` 型別，用來將紋理貼圖與給定的顏色相乘。

source: `modulate` comes from the `CanvasItem` class, All 2D and UI nodes inherit from it. It lets you toggle the visibility of the node, assign a shader to it, and modify it using a color with `modulate`.
cs: `modulate` pochází ze třídy `CanvasItem`, z níž dědí všechny 2D a UI uzly. Umožňuje přepínat viditelnost uzlu, přiřadit mu shader a pomocí `modulate` jej upravit pomocí barvy.
de: `modulate` kommt von der `CanvasItem` Klasse, alle 2D und UI Nodes erben von dieser. Es lässt einen die Sichtbarkeit der Node umschalten, einen Shader hinzufügen, und es zu modifizieren, indem eine Farbe für `modulate` verwendet wird.
es: `modulate` proviene de nuestra clase `CanvasItem`, Todos los nodos 2D y de UI heredan de él. Este permite alternar la visiblidad del nodo, asignarle un shader y modificarlo usando un color mediante `modulate`.
fr: `modulate` provient de la classe `CanvasItem`, tous les nœuds 2D et UI en hérite. Cela vous permet de contrôler la visibilité du nœud, d'y assigner un shader, et de le modifier en utilisant une couleur avec `modulate`.
ja: `modulate` は `CanvasItem` クラスから取得され、すべての2DノードとUIノードはこれを継承します。ノードの表示/非表示を切り替え、シェーダを割り当て、 `modulate` で色を使用して修正することができます。
ko: `modulate` 는 `CanvasItem` 클래스에서 나옵니다. 모든 2D와 UI 노드는 여기에 상속됩니다. 이것은 노드의 가시성을 켜고 끌 수 있고, 셰이더를 지정하고, `modulate` 에서 색상을 사용하여 수정할 수 있습니다.
pt_br: `modulate` vem da classe` CanvasItem`, todos os nós 2D e UI são herdados. Ele permite que você alterne a visibilidade do nó, atribua um sombreador a ele e modifique-o usando uma cor com `modulate`.
ru: `modulate` наследуется из класса `CanvasItem`, от него наследуются все 2D и UI узлы. Он позволяет переключать видимость узла, назначать ему шейдер и изменять его цвет с помощью `modulate`.
zh_cn: ``modulate`` 来自 ``CanvasItem`` 类，所有2D和UI节点都继承自它。它允许您切换节点的可见性，给它分配一个着色器，然后用一个带有``modulate`` 的颜色来修改它。
zh_tw: ``modulate`` 繼承自 ``CanvasItem`` 類別，所有的 2D 與 UI 節點都繼承自 CanvasItem。可以使用 ``modulate`` 來設定節點的可見性、指派著色器、或是更改顏色。

source: ``modulate`` takes a ``Color`` value with 4 channels: red, green, blue and alpha. If we darken any of the first three channels it darkens the interface. If we lower the alpha channel, our interface fades out.
cs: ``modulate`` přijímá hodnotu ``Color`` se 4 kanály: červeným, zeleným, modrým a alfa. Pokud ztmavíme některý z prvních tří kanálů, rozhraní ztmavne. Pokud snížíme alfa kanál, naše rozhraní vybledne.
de: ``Modulieren`` nimmt einen ``Farbe`` Wert mit 4 Kanälen an: Rot, Grün, Blau und Alpha. Wenn wir einen der ersten drei Kanäle verdunkeln, verdunkelt das die Schnittstelle. Wenn wir den Alphakanal absenken, wird unser Interface ausgeblendet.
fr: ``modulate`` prend une valeur ``Color`` avec 4 canaux : rouge, vert, bleu et alpha. Si vous assombrissons n'importe lequel des trois premiers canaux, cela assombrit l'interface. Si nous abaissons le canal alpha, notre interface disparaît petit à petit.
ja: ``modulate`` は、赤、緑、青、アルファの4つのチャンネルを持つ ``Color`` 値を取ります。最初の3つのチャネルのいずれかを暗くすると、インターフェイスが暗くなります。アルファチャンネルを下げると、インターフェイスがフェードアウトします。
ko: ``modulate``\ 는 4개의 채널로 ``Color`` 값을 갖습니다: 빨강, 초록, 파랑, 그리고 알파입니다. 처음 세 개의 채널들 중 하나를 어둡게 하면 그것은 인터페이스에서 어두워집니다. 알파 채널을 낮추면 인터페이스는 희미해집니다.
ru: ``modulate`` принимает значение ``Color`` с 4 каналами: красный, зеленый, синий и альфа-канал. Если мы сделаем темнее любой из первых трех каналов, то интерфейс будет темнее. Если мы снизим альфа-канал, наш интерфейс станет прозрачным.
zh_cn: `modulate`具有`Color`值，有4个通道:红色、绿色、蓝色和alpha。如果我们使前三个通道中的任何一个都变暗，它就会使界面变暗。如果我们降低alpha通道，我们的界面就会消失。
zh_tw: ``modulate`` 接受有四個通道的 ``Color`` 值：Red 紅色、Green 綠色、Blue 藍色、與 Alpha 透明度。若將前三個通道變暗，則界面會變暗。若降低 Alpha 通道，則界面會淡出。

source: We're going to tween between two color values: from a white with an alpha of ``1``, that is to say at full opacity, to a pure white with an alpha value of ``0``, completely transparent. Let's add two variables at the top of the ``_on_Player_died`` method and name them ``start_color`` and ``end_color``. Use the ``Color()`` constructor to build two ``Color`` values.
cs: Budeme přecházet mezi dvěma hodnotami barev: od bílé s hodnotou alfa ``1``, tedy s plným krytím, po čistě bílou s hodnotou alfa ``0``, tedy zcela průhlednou. Přidáme dvě proměnné na začátek metody ``_on_Player_died`` a pojmenujeme je ``start_color`` a ``end_color``. Pomocí konstruktoru ``Color()`` vytvoříme dvě hodnoty ``Color``.
de: Wir bewegen uns zwischen zwei Farbwerten: von einem Weiß mit einem Alpha-Wert von ``1``, d.h. bei voller Deckkraft, zu einem reinen Weiß mit einem Alpha-Wert von ``0``, vollständig transparent. Fügen wir zwei Variablen am Anfang der ``_on_Player_died`` Methode hinzu und nennen sie ``start_color`` und ``end_color``. Benutzen Sie den ``Color()`` Konstruktor, um zwei ``Color`` Werte zu erzeugen.
es: Vamos a elegir entre dos valores de color: desde un blanco con un alfa de ``1``, es decir, con opacidad total, hasta un blanco puro con un valor alfa de ``0``, completamente transparente. Añadamos dos variables en la parte superior del método ``_on_Player_died`` y las nombraremos ``start_color`` y ``end_color``. Usa el constructor ``Color()`` para crear dos valores ``Color``.
fr: Nous allons interpoler entre deux couleurs : d'un blanc avec un alpha de ``1`, soit une opacité totale, à un blanc pur avec une valeur alpha de ``0`, complètement transparent. Ajoutons deux variables en haut de la méthode ``_on_Player_died`` et nommons les ``start_color`` et ``end_color``. Utilisez le constructeur ``Color()`` pour créer deux valeurs ``Color``.
ja: 2つのカラー値の間でTweenを行います。1つはアルファが ``1`` の白、つまり完全に不透明な状態、もう1つはアルファが ``0`` の完全に透明な白です。 ``_on_Player_die`` メソッドの先頭に2つの変数を追加し、それぞれに ``start_color`` と ``end_color`` という名前を付けます。 ``Color()`` コンストラクタを使用して、2つの ``Color`` 値を構築します。
ko: 우리는 두 색상 값을 tween할 것입니다: 완전한 불투명을 의미하는, 흰색이고 ``1`` 의 알파 값에서, 완전한 투명을 의미하는, 흰색이지만 ``0`` 의 알파 값까지 입니다. 두 변수를 ``_on_Player_died`` 메서드에 추가하고 이 둘을 각각 ``start_color`` 과 ``end_color`` 라고 이름짓습니다. ``Color()`` 생성자(constructor)를 사용해서 두 ``Color`` 값을 만듭니다.
pt_br: Vamos interpor entre dois valores de cores: de um branco com um alfa de `` 1``, isto é, com opacidade total, a um branco puro com um valor alfa de `` 0``, completamente transparente. Vamos adicionar duas variáveis no topo do método `` _on_Player_died`` e nomea-las `` start_color`` e `` end_color``. Use o construtor `` Color () `` para construir dois valores `` Color``.
ru: Давайте анимировать переход от белого цвета с альфа-каналом ``1``, то есть при полной непрозрачности, к чисто белому со значением альфа ``0``, то есть полностью прозрачному. Добавим две переменные вверху метода ``_on_on_Player_died`` и назовем их ``start_color`` и ``end_color``. Используйте конструктор ``Color()`` для построения двух ``Color`` значений.
zh_cn: 我们将在两个颜色值之间进行渐变:从alpha值为`1`的白色，也就是说完全不透明，到alpha值为`0`的纯白色，完全透明。让我们在`_on_player_die`方法的顶部添加两个变量，并将它们命名为`start_color`和`end_color`。使用`Color()`构造函数构建两个`Color`值。
zh_tw: 我們需要在兩個色彩間 Tween，起始值為 Alpha 為 ``1`` （即完全不透明）的白色，終止值則為 Alpha 值為 ``0`` （即完全透明）的白色。來在 ``_on_Player_died`` 方法最上面新增兩個變數，名為 ``start_color`` 與 ``end_color`` 。使用 ``Color()`` 建構函式來建立兩個 ``Color`` 值。

source: ``Color(1.0, 1.0, 1.0)`` corresponds to white. The fourth argument, respectively ``1.0`` and ``0.0`` in ``start_color`` and ``end_color``, is the alpha channel.
cs: ``Color(1.0, 1.0, 1.0)`` odpovídá bílé barvě. Čtvrtý argument, respektive ``1.0`` a ``0.0`` v ``start_color`` a ``end_color``, je alfa kanál.
de: ``Color(1.0, 1.0, 1.0)`` entspricht hier Weiß. Das vierte Argument, entsprechend ``1.0`` and ``0.0`` in ``start_color`` and ``end_color``, ist der Alphakanal.
es: ``Color(1.0, 1.0, 1.0)`` corresponde a blanco. El cuarto argumento, respectivamente ``1.0`` y ``0.0``en ``start_color`` y ``end_color``, es el canal alfa.
fr: ``Color(1.0, 1.0, 1.0)`` correspond au blanc. Le quatrième argument, respectivement ``1.0`` et ``0.0`` pour ``start_color`` et ``end_color``, est le canal alpha.
ja: ``Color(1.0、1.0、1.0)`` は白に対応します。 4番目の引数、 ``start_color`` と ``end_color`` のそれぞれ ``1.0`` と ``0.0`` は、アルファチャンネルです。
ko: ``Color(1.0, 1.0, 1.0)`` 는 흰색과 같습니다. 네 번째 인수는, ``start_color`` 와 ``end_color`` 에서 각각 ``1.0`` 과 ``0.0`` 인, 알파 채널입니다.
pt_br: `` Color (1.0, 1.0, 1.0) `` corresponde ao branco. O quarto argumento, respectivamente `` 1.0`` e `` 0.0`` em `` start_color`` e `` end_color``, é o canal alfa.
ru: ``Color(1.0, 1.0, 1.0, 1.0)`` соответствует белому цвету. Четвертый аргумент, соответственно ``1.0`` и ``0.0`` в ``start_color`` и ``end_color``, - это альфа-канал.
zh_cn: `Color(1.0, 1.0, 1.0)`对应于白色。第四个参数，分别是`start_color`和`end_color`中的`1.0`和`0.0`，是alpha通道。
zh_tw: ``Color(1.0, 1.0, 1.0)`` 對應為白色。第四個引數，在 ``start_color`` 與 ``end_color`` 中分別為 ``1.0`` 與 ``0.0`` 為 Alpha 通道。

source: We then have to call the ``interpolate_property`` method of the ``Tween`` node again:
cs: Poté musíme znovu zavolat metodu ``interpolate_property`` uzlu ``Tween``:
de: Danach müssen wir die Methode ``interpolate_property`` des ``Tween``-Nodes erneut aufrufen:
es: Luego debemos llamar nuevamente al método ``interpolate_property`` del nodo ``Tween``:
fr: Nous devons ensuite appeler à nouveau la méthode ``interpolate_property`` du noeud ``Tween`` :
ja: 次に、 ``Tween`` ノードの ``interpolate_property`` メソッドをもう一度呼び出す必要があります:
ko: 우리는 ``Tween`` 노드의 ``interpolate_property`` 메서드를 다시 호출해야 합니다:
pt_br: Nós então temos que chamar o método `` interpolate_property`` do nó `` Tween`` novamente:
ru: Затем снова вызываем метод ``interpolate_property`` узла ``Tween``:
zh_cn: 然后我们必须再次调用`Tween`节点的`interpolate_property`方法:
zh_tw: 接著我們需要再次呼叫 ``Tween`` 節點的 ``interpolate_property`` 方法：

source: This time, we change the ``modulate`` property and have it animate from ``start_color`` to the ``end_color``. The duration is of one second, with a linear transition. Here again, because the transition is linear, the easing does not matter. Here's the complete ``_on_Player_died`` method:
fr: Cette fois nous changeons la propriété ``modulate`` et nous faisons une animation à partir de la ``start_color`` jusqu'à la ``end_color``. La durée est d'une seconde, avec une transition linéaire. Ici encore le lissage n'est pas important parce que la transition est linéaire. Voici la méthode ``_on_Player_died`` complète :
ja: 今回は、\ ``modulate`` プロパティを変更し、\ ``start_color`` から ``end_color`` にアニメートします。継続時間は1秒で、線形の遷移があります。ここでも、遷移は線形であるため、イージングは重要ではありません。完全な ``_on_Player_died`` メソッドは次のとおりです:
ko: 이번엔 ``modulate`` 속성을 바꾸고 그것이 ``start_color``\ 에서 ``end_color``\ 로 애니메이트 해야 합니다. 지속 시간은 1초로 선형 전환입니다. 다시 말하지만, 전환이 선형이기 때문에 완화는 아무 문제가 없습니다. 이것이 완전한 ``_on_Player_died`` 메서드 입니다:
zh_cn: 这一次，我们改变了`modulate`属性，并将其从`start_color`动画为`end_color`。持续时间为1秒，线性过渡。再一次，因为过渡是线性的，宽松并不重要。下面是完整的`_on_Player_died`方法:
