Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_code_a_life_bar.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, zh_cn, zh_tw

source: The animation will not play until we activated the ``Tween`` node with ``tween.start()``. We only have to do this once if the node is not active. Add this code after the last line:
cs: Animace se přehraje až po aktivaci uzlu ``Tween`` pomocí ``tween.start()``. To musíme provést pouze jednou, pokud uzel není aktivní. Za poslední řádek přidejte tento kód:
de: Die Animation wird erst abgespielt, wenn wir den ``Tween``-Node mit ``tween.start()`` aktiviert haben. Wir müssen dies nur einmal tun, wenn der Node nicht aktiv ist. Fügen Sie diesen Code nach der letzten Zeile ein:
es: La animación no se reproducirá hasta que activemos el nodo ``Tween`` con ``tween.start()``. Sólo tenemos que hacerlo una vez si el nodo no está activo. Añade este código después de la última línea:
fr: Cette animation étant défini, elle ne sera joué que lorsque le nœud ``Tween``sera activé avec ``tween.start()``. Il suffit de lancer l'animation une fois si le nœud n'est pas actif. Ajoutons ce code à la dernière ligne :
ja: ``tween.start()`` で ``Tween`` ノードをアクティブにするまでアニメーションは再生されません。ノードがアクティブでない場合は、これを一度だけ実行する必要があります。 最後の行の後にこのコードを追加します:
ko: 애니메이션은 ``Tween`` 노드가 ``tween.start()`` 로 활성화되기 전 까지 재생되지 않습니다. 노드가 활성화되어있지 않으면 이 작업만 하면 됩니다. 이 코드를 마지막 줄 이후에 추가하세요:
pt_br: A animação não será reproduzida até que ativemos o nó `` Tween`` com `` tween.start () ``. Nós só temos que fazer isso uma vez se o nó não estiver ativo. Adicione este código após a última linha:
ru: Анимация не будет воспроизводиться, пока мы не запустим узел ``Tween`` с помощью функции `tween.start()``. Это нужно сделать только один раз, если узел не активен. Добавьте этот код после последней строки:
zh_cn: 动画将不会播放，直到我们用`tween.start() `激活`Tween`节点。如果节点不活动，我们只需要这样做一次。在最后一行之后添加以下代码:
zh_tw: 動畫必須要使用 ``tween.start()`` 啟用 ``Tween`` 節點後才會開始播放。如果節點還沒啟用的話，只需要執行一次即可。在最後一行後面加上這段程式碼：

source: Although we could animate the `health` property on the `Player`, we shouldn't. Characters should lose life instantly when they get hit. It makes it a lot easier to manage their state, like to know when one died. You always want to store animations in a separate data container or node. The `tween` node is perfect for code-controlled animations. For hand-made animations, check out `AnimationPlayer`.
cs: Ačkoli bychom mohli animovat vlastnost `health` na `Player`, neměli bychom to dělat. Postavy by měly ztrácet život okamžitě, když dostanou zásah. Usnadní to správu jejich stavu, například poznáme, kdy některá z nich zemřela. Animace je vždy vhodné ukládat do samostatného datového kontejneru nebo uzlu. Uzel `tween` je ideální pro animace řízené kódem. Pro ručně vytvářené animace se podívejte na `AnimationPlayer`.
de: Obwohl wir die Eigenschaft `health` auf dem `Player` animieren könnten, sollten wir es nicht tun. Charaktere sollten sofort Leben verlieren, wenn sie getroffen werden. Das macht es viel einfacher, ihren Zustand zu managen, z.B. zu wissen, wann man gestorben ist. Man möchte Animationen immer in einem separaten Datencontainer oder Node speichern. Der `Tween`-Node ist perfekt für codegesteuerte Animationen. Für handgemachte Animationen sehen Sie sich den `AnimationPlayer` an.
es: Aunque podríamos animar la propiedad `health` en el `Player`, no deberíamos. Los personajes deben perder la vida instantáneamente cuando son golpeados. Hace que sea mucho más fácil manejar su estado, como para saber cuándo ha muerto. Siempre es conveniente almacenar las animaciones en un container data o nodo separado. El nodo `tween` es perfecto para animaciones controladas por código. Para animaciones hechas a mano, echa un vistazo a `AnimationPlayer`.
fr: Même si nous aurions pu animer la propriété `health` de `Player`, ce n'est pas pertinent dans notre cas. Les personnages doivent perdre leur vie instantanément quand ils sont touchés. Cela rend la gestion des états des personnages plus simple, comme savoir si un personnage est mort. Nous voudrons toujours stocker les animations dans des conteneurs de données ou des nœuds séparés. Le nœud `Tween` est parfait pour animer à l'aide d'un script. Pour créer des animations en passant par l'éditeur, il faut utiliser le nœud `AnimationPlayer`.
ja: `Player` の `health` プロパティをアニメートすることはできますが、そうすべきではありません。キャラクターは命中するとすぐにライフを失います。これにより、いつ死亡したかを知りたいなど、状態を管理しやすくなります。アニメーションは常に別のデータ コンテナーまたはノードに格納する必要があります。 `tween` ノードは、コードで制御されたアニメーションに最適です。自作のアニメーションについては、 `AnimationPlayer` をご覧ください。
ko: 비록 `Player` 에서 `health` 속성을 애니메이트 할 수 있을지라도, 그렇게 해서는 안 됩니다. 캐릭터는 피해를 입었을 때 즉시 체력이 줄어야 합니다. 한 명이 언제 죽었는 지 알 수 있는 것처럼, 이 방식이 그들의 상태를 다루기에 훨씬 더 쉽습니다. 당신은 애니메이션이 항상 분리된 데이터 컨테이너나 노드에 있기를 원합니다. `tween` 노드는 코드로 제어되는 애니메이션에 완벽합니다. 수제 애니메이션은, `AnimationPlayer` 를 확인하세요.
pt_br: Embora possamos animar a propriedade `health` no` Player`, não devemos. Personagens devem perder a vida instantaneamente quando são atingidos. Isso torna muito mais fácil gerenciar seu estado, como saber quando um morreu. Você sempre deseja armazenar animações em um contêiner de dados ou nó separado. O nó `tween` é perfeito para animações controladas por código. Para animações feitas à mão, confira `AnimationPlayer`.
ru: Хотя мы могли бы анимировать свойство `health` на `Player'e`, но не будем. Персонажи должны терять жизнь мгновенно, когда они попадают под удар. Это значительно облегчает управление их состоянием, например, знать, когда человек умер. Вы всегда должны хранить анимацию в отдельном контейнере или узле данных. Узел `tween` идеально подходит для анимации с кодовым управлением. Анимацию ручной работы можно посмотреть в разделе "Анимационный проигрыватель".
zh_cn: 虽然我们可以在`Player`上激活`health`属性，但我们不应该。角色一旦被击中就会立即失去生命。这使得管理他们的状态变得容易得多，比如知道他们的死亡时间。您总是希望将动画存储在单独的数据容器或节点中。补间节点非常适合代码控制的动画。对于手工制作的动画，请查看`AnimationPlayer`。
zh_tw: 雖然我們大可直接動畫化 ``Player`` 上的 ``health`` 屬性，但不該這麼做。角色是在收到攻擊後馬上損失生命值的，這樣一來在如判斷角色死亡時機這類的狀態管理會更輕鬆。通常我們都會在另一個資料容器或節點上來做動畫化。 ``Tween`` 節點很適合用來做以程式碼控制的動畫。如果要手動製作動畫，請參考 ``AnimationPlayer`` 。

source: Assign the animated\_health to the LifeBar
cs: Přiřazení animated\_health k panelu života
de: Weisen Sie der LifeBar die animierte _health zu
es: Asignar animated\_health a LifeBar
fr: Assigner animated\_health à la barre de vie
ja: LifeBarにanimated\_healthを割り当て
ko: animated\_health를 LifeBar에 지정하기
pt_br: Atribuir a \ _health animada para o LifeBar
ru: Присоединение animated\_health к шкале здоровья
zh_cn: 将动画\_health分配给LifeBar
zh_tw: 將 animated\_health 指派給 LifeBar

source: Now the ``animated_health`` variable animates but we don't update the actual ``Bar`` and ``Number`` nodes anymore. Let's fix this.
cs: Nyní se proměnná ``animated_health`` animuje, ale skutečné uzly ``Bar`` a ``Number`` jsme přestali aktualizovat. Napravíme to.
de: Jetzt wird die ``animated_health`` Variable animiert, aber wir aktualisieren die eigentlichen ``Bar`` und ``Number``-Node nicht mehr. Lasst uns das in Ordnung bringen.
es: Ahora la variable ``animated_health`` anima pero ya no se actualizan los nodos ``Bar`` y ``Number`` existentes. Solucionemos esto.
fr: Notre variable ``animated_health`` est maintenant animée mais nous ne mettons plus à jour les nœuds ``Bar``et ``Number``. Arrangeons cela.
ja: ``animated_health`` 変数はアニメーションされますが、実際の ``Bar`` ノードと``Number`` ノードは更新されません。これを修正しましょう。
ko: 이제 ``animated_health`` 변수가 애니메이트 하지만 실제 ``Bar`` 와 ``Number`` 노드는 더 이상 업데이트 할 수 없습니다. 이것을 고칩시다.
pt_br: Agora a variável `` animated_health`` anima, mas nós não atualizamos mais os nós `` Bar`` e `` Number``. Vamos consertar isso.
ru: Теперь переменная ``animated_health`` анимирована, но мы больше не обновляем ``Bar`` и ``Number`` узлы. Давай исправим это.
zh_cn: 现在`animated_health`变量会启动，但是我们不再更新实际的`Bar`和`Number`节点。让我们解决这个问题。
zh_tw: 現在 ``animated_health`` 變數已經動畫化了，但我們卻沒去更新真正的 ``Bar`` 與 ``Number`` 節點了。讓我們來修正一下。

source: So far, the update\_health method looks like this:
cs: Metoda update\_health zatím vypadá takto:
de: Bisher sieht die Update-_health-Methode wie folgt aus:
es: Hasta ahora, el método update\_health se ve así:
fr: Jusqu'à maintenant, la fonction update\_health ressemble à cela :
ja: これまでのところ、update\_healthメソッドは次のようになります:
ko: 지금까지, update\_health 메서드는 이렇게 보입니다:
pt_br: Até agora, o método update \ _health se parece com isto:
ru: Пока метод update\_health выглядит следующим образом:
zh_cn: 到目前为止，update\_health方法如下:
zh_tw: 到目前為止，update\_health 方法看起來應該像這樣：

source: In this specific case, because ``number_label`` takes text, we need to use the ``_process`` method to animate it. Let's now update the ``Number`` and ``TextureProgress`` nodes like before, inside of ``_process``:
cs: V tomto konkrétním případě, protože ``number_label`` přebírá text, musíme k jeho animaci použít metodu ``_process``. Nyní aktualizujme uzly ``Number`` a ``TextureProgress`` jako předtím, uvnitř metody ``_process``:
de: In diesem speziellen Fall, weil das ``number_label`` Text erwartet, müssen wir die ``_process``-Methode verwenden, um es zu animieren. Lass uns nun, wie schon zuvor, die ``Number`` und ``TextureProgress``-Node innerhalb von ``_process`` aktualisieren:
es: En este caso en particular, debido a que ``number_label`` recibe texto, necesitamos usar el método ``_process`` para animarlo. Vamos a actualizar los nodos ``Number`` y ``TextureProgress`` como antes, dentro de ``_process``:
fr: Dans ce cas particulier, ``number_label`` prends du texte, nous avons donc besoin d'utiliser la méthode ``_process`` pour l'animer. Nous allons maintenant mettre à jour les nœuds ``Number`` et ``TextureProgress`` comme avant, à l'intérieur de ``_process`` :
ja: この例では、 ``number_label`` はテキストを取るため、 ``_process`` メソッドを使ってアニメーションする必要があります。前と同じように、 ``_process`` 内の ``Number`` ノードと ``TextureProgress`` ノードを更新します:
ko: 특정한 경우에서, ``number_label`` 이 텍스트를 차지하기 때문에, 우리는 ``_process`` 메서드로 그것을 애니메이트 해야 합니다. 이제 ``_process` 안에 ``Number`` 와 ``TextureProgress`` 노드를 전과 같이 업데이트 합시다:
pt_br: Neste caso específico, porque `` number_label`` recebe texto, nós precisamos usar o método `` _process`` para animá-lo. Vamos agora atualizar os nós `` Number`` e `` TextureProgress`` como antes, dentro de `` _process``:
ru: В данном конкретном случае, поскольку ``number_label`` принимает текст, нам нужно использовать метод ``_process`` для его анимирования. Теперь обновим узлы ``Number`` и ``TextureProgress`` как и до этого, внутри метода ``_process``:
zh_cn: 在这种情况下，因为`number_label`接受文本，我们需要使用`_process`方法来动画它。现在让我们更新`Number`和`TextureProgress`节点像以前一样，在`_process`里面:
zh_tw: 在這個例子中，由於 ``numebr_label`` 只接受字串，所以我們需要使用 ``_process`` 方法來動畫化。來像之前一樣更新 ``Number`` 與 ``TextureProgress`` 節點，但這一次在 ``_process`` 中：

source: `number_label` and `bar` are variables that store references to the `Number` and `TextureProgress` nodes.
cs: `number_label` a `bar` jsou proměnné, které uchovávají odkazy na uzly `Number` a `TextureProgress`.
de: `number_label` und `bar`sind Variablen, die Referenzen auf die Nodes `Number`und `TextureProgress` speichern.
es: `number_label` y `bar` son variables que guardan referencias a los nodos `Number` y `TextureProgress`.
fr: `number_label` et `bar` sont des variables qui stocke les références vers les noeuds `Number` et `TextureProgress`.
ja: `number_label` と `bar` は、 `Number` ノードと `TextureProgress` ノードへの参照を格納する変数です。
ko: `number_label` 과 `bar` 는 `Number` 와 `TextureProgress` 노드에 참조로 저장된 변수들입니다.
pt_br: `number_label` e` bar` são variáveis que armazenam referências aos nós `Number` e` TextureProgress`.
ru: Переменные `number_label` и `bar` хранят ссылки на узлы `Number` и `TextureProgress`.
zh_cn: `number_label`和`bar`是存储对`Number`和`TextureProgress`节点的引用的变量。
zh_tw: ``number_label`` 與 ``bar`` 是保存了 ``Number`` 與 ``TextureProgress`` 節點參照的變數。

source: Play the game to see the bar animate smoothly. But the text displays decimal number and looks like a mess. And considering the style of the game, it'd be nice for the life bar to animate in a choppier fashion.
cs: Zahrajte si hru a uvidíte, jak se ukazatel plynule animuje. Text však zobrazuje desetinné číslo a vypadá chaoticky. Vzhledem ke stylu hry by bylo vhodnější, aby se lišta života animovala plynuleji.
de: Spiele das Spiel, um die flüssig animierte Lebensleiste anzuschauen. Allerdings zeigt der Text Dezimalzahlen an und wirkt unaufgeräumt. Und angesichts des Spielstils, wäre es hübsch, die Lebensleiste auf eine abgehacktere Weise zu animieren.
es: Reproduce el juego para ver la barra animada sin problemas. Pero el texto muestra un número decimal y parece un desastre. Tomando en cuenta el estilo del juego, sería bueno que la barra de vida se animara de una manera más atractiva.
fr: Lancez le jeu, vous observez que la barre s'anime sans accroc. Par contre le texte affiche un nombre décimal et fait n'importe quoi. De plus, en considérant le style du jeu, il serait bien que la barre de vie de s'anime d'une façon plus saccadée.
ja: ゲームをプレイして、バーがスムーズにアニメーションされるのを確認します。しかし、テキストに小数点以下が表示され、混乱しているように見えます。また、ゲームのスタイルを考慮すると、ライフバーがより途切れやすい方法でアニメーションされるとよいでしょう。
ko: 게임을 실행하시면 막대가 부드럽게 애니메이트 하는 것을 보실 수 있습니다. 하지만 텍스트는 소수 숫자로 보여지고 난잡해 보입니다. 그리고 게임의 스타일을 고려해서, 체력 막대가 더 멋진 방식으로 움직이면 좋을 것입니다.
pt_br: Jogue o jogo para ver a barra animar suavemente. Mas o texto exibe o número decimal e parece uma bagunça. E considerando o estilo do jogo, seria bom para a barra de vida para animar de uma forma mais bonita.
ru: Запустите игру, чтобы увидеть плавную анимацию шкалы. Но текст отображает дробное число и выглядит не очень. А учитывая стиль игры, было бы неплохо, если бы шкала здоровья анимировалась вертолётной манере.
zh_cn: 玩这个游戏，可以看到条形图的动画是流畅的。但是文本显示的是十进制数，看起来很乱。考虑到游戏的风格，生命条以一种更加起伏不定的方式进行动画是很好的。
zh_tw: 執行遊戲就可以看到動畫很順暢地播放了，但 Text 顯示了十進位數字，而且看起來很亂。另外，考慮到遊戲風格，血槽的動畫效果如果能動得更粗糙一點會更好。

source: The animation is smooth, but the number is broken
cs: Animace je plynulá, ale číslo nevypadá dobře
de: Die Animation ist flüssig, aber die Zahlenanzeige kaputt
fr: L'animation est fluide mais le nombre est cassé
ja: アニメーションは滑らかですが、番号の表示が乱れています
ko: 애니메이션은 부드럽지만 숫자는 망가졌습니다
ru: Анимация гладкая, но число отображается криво
zh_cn: 动画很流畅，但是数字被打破了
zh_tw: 動畫很流暢，但數字壞了

source: We can fix both problems by rounding out ``animated_health``. Use a local variable named ``round_value`` to store the rounded ``animated_health``. Then assign it to ``number_label.text`` and ``bar.value``:
cs: Oba problémy můžeme vyřešit zaokrouhlením ``animated_health``. Pro uložení zaokrouhlené hodnoty ``animated_health`` použijte lokální proměnnou s názvem ``round_value``. Poté ji přiřadíme do ``number_label.text`` a ``bar.value``:
de: Wir können beide Probleme beheben, indem wir ``animated_health`` runden. Benutze eine lokale Variable namens ``round_value``, um die gerundete ``animated_health`` zu speichern. Dann ordne sie ``number_label.txt`` und ``bar.value`` zu:
es: Podemos solucionar ambos problemas redondeando ``animated_health``. Usa la variable local llamada ``round_value`` para guardar el valor redondeado ``animated_health``. Luego asígnalo a ``number_label.text`` y ``bar.value``:
fr: On peut résoudre les deux problèmes en arrondissant la variable ``animated_health``. Utiliser une varible locale ``round_value`` pour stocker l'arrondi. Puis assigner la à ``number_label.text`` et ``bar.value`` :
ja: ``animated_health`` を四捨五入することで両方の問題を解決できます。 ``round_value`` という名前のローカル変数を使用して、丸められた ``animated_health`` を格納します。 それを ``number_label.text`` と ``bar.value`` に割り当てます:
ko: ``animated_health`` 를 반올림해서 이 문제들을 동시에 해결할 수 있습니다. ``round_value`` 라는 지역 변수를 사용해서 반올림 된 ``animated_health`` 를 저장합니다. 그런 뒤 그것을 ``number_label.text`` 와 ``bar.value`` 에 지정합니다:
pt_br: Podemos consertar ambos os problemas, completando `` animated_health``. Use uma variável local chamada `` round_value`` para armazenar o `` animated_health`` arredondado. Em seguida, atribua-o a `` number_label.text`` e `` bar.value``:
ru: Мы можем решить обе проблемы, округлив ``animated_health``. Используйте локальную переменную под названием ``round_value`` для хранения округленной ``animated_health``. Затем присваиваются значения ``number_label.text`` и ``bar.value``:
zh_cn: 我们可以通过舍入`animated_health`来解决这两个问题。使用一个名为`round_value`的局部变量来存储完整的`animated_health`。然后将其赋值给`number_label.text`和`bar.value`:
zh_tw: 這兩個問題都可以通過將 ``animated_health`` 四捨五入來修正。使用區域變數 ``round_value`` 來保存四捨五入後的 ``animated_health`` ，然後再指派給 ``number_label.text`` 與 ``bar.value`` ：

source: Try the game again to see a nice blocky animation.
cs: Zkuste hru spustit znovu a uvidíte pěknou blokovou animaci.
de: Spiele das Spiel erneut, um eine hübsche, klotzige Animation zu betrachten.
es: Intenta jugar de nuevo para ver una bonita animación de bloques.
fr: Essayez le jeu une nouvelle fois pour voir une belle animation blocs par blocs.
ja: もう一度ゲームを実行すると、ブロックのようなアニメーションが表示されます。
ko: 게임을 다시 실행하면 멋진 블록 애니메이션을 볼 수 있습니다.
pt_br: Rode o jogo novamente para ver uma bela animação em blocos.
ru: Запустите игру еще раз, чтобы увидеть хорошую блочную анимацию.
zh_cn: 再次尝试游戏，看看一个不错的方块动画。
zh_tw: 再執行一次遊戲看看，現在動畫變得有點塊狀，很好看。

source: By rounding out animated\_health, we kill two birds with one stone
cs: Zaokrouhlením animated\_health zabijeme dvě mouchy jednou ranou
de: Indem wir animated\_health runden, schlagen wir zwei Fliegen mit einer Klappe
fr: En arrondissant animated\_health, on a fait d'une pierre deux coups
ja: animated\_healthの四捨五入と文字列へ変換を一緒に行えば、一石二鳥です
ko: animated\_health를 반올림 해서 일석이조의 효과를 냈습니다
ru: Округляя animated\_health, мы убиваем двух зайцев одним выстрелом
zh_cn: 通过完成animated\_health，我们达到了一石二鸟的效果
zh_tw: 將 animated\_health 四捨五入，一石二鳥修正了兩個問題

source: Every time the player takes a hit, the ``GUI`` calls ``_on_Player_health_changed``, which in turn calls ``update_health``. This updates the animation and the ``number_label`` and ``bar`` follow in ``_process``. The animated life bar that shows the health going down gradually is a trick. It makes the GUI feel alive. If the ``Player`` takes 3 damage, it happens in an instant.
cs: Pokaždé, když hráč dostane zásah, ``GUI`` zavolá ``_on_Player_health_changed``, který následně provede ``update_health``. Tím se aktualizuje animace a v ``_process`` následují aktualizace ``number_label`` a ``bar``. Animovaný ukazatel života, který ukazuje postupně klesající zdraví, je finesa, díky které grafické uživatelské rozhraní působí jako živé. Pokud ``Player`` obdrží 3 poškození, stane se tak v okamžiku.
de: Jedes Mal, wenn der Spieler einen Treffer erhält, ruft die ``GUI`` ``_auf_Spielgesundheit_geändert`` auf, was wiederum ``Update_Gesundheit`` nennt. Dadurch wird die Animation aktualisiert, und die ``Zahlen-Label`` und ``Balken`` folgen in ``_Prozess``. Der animierte Lebensbalken, der zeigt, wie die Gesundheit allmählich abnimmt, ist ein Trick. Sie gibt dem GUI ein lebendiges Gefühl. Wenn der ``Spieler`` 3 Schaden nimmt, geschieht dies in einem Augenblick.
es: Cada vez que el jugador recibe un golpe, la ``GUI`` llama ``on_Player_health_changed``, que a su vez llama ``update_health``. Esto actualiza la animación y el ``number_label`` y ``bar`` siguen en ``_process``. La barra de vida animada que muestra la salud bajando gradualmente es un truco. Hace que el GUI se sienta vivo. Si el ``Player`` recibe 3 de daño, ocurre en un instante.
fr: À chaque fois que le joueur prends un coup, il envoie le signal ``health_changed``, à partir duquel le nœud ``GUI`` appelle la fonction ``_on_Player_health_changed``, qui appelle la fonction ``update_health``. Cela met à jour la valeur animée et les variables ``number_label`` et ``bar`` dans la fonction ``_process``. Retenez que l'animation de la barre de vie montrant la vie diminuer graduellement est une illusion pour rendre la GUI plus vivante. Si le joueur prends 3 dégâts, c'est immédiat.
ja: プレイヤーがヒットするたびに、 ``GUI`` は ``_on_Player_health_changed`` を呼び出し、その ``_ on_Player_health_changed`` は ``update_health`` を呼び出します。これにより、アニメーションが更新され、 ``_ process`` の ``number_label`` と ``bar`` が更新されます。健康状態が徐々に低下する、アニメーションするライフバーは、単に見た目上のトリックですが、それによってGUIが生き生きと感じられます。もしも ``Player`` が3つのダメージを受けた場合、一瞬で発生します。
ko: 매 시간 플레이어가 피해를 입을 때, ``GUI`` 는 ``_on_Player_health_changed`` 를 호출합니다, 그리고 그것은 ``update_health`` 를 호출합니다. 이것은 애니메이션을 업데이트 하고 ``number_label`` 과 ``bar`` 가 ``_process`` 에서 따라옵니다. 체력이 점차 줄어드는 애니메이트 된 체력 막대는 트릭입니다. 그것은 GUI가 살아있는 것처럼 느끼도록 만듭니다. ``Player`` 가 3 데미지를 입으면, 즉각적으로 발생합니다.
pt_br: Toda vez que o jogador recebe um hit, o `` GUI`` chama `` _on_Player_health_changed``, que por sua vez chama `` update_health``. Isso atualiza a animação e o `` number_label`` e `` bar`` seguem em `` _process``. A barra de vida animada que mostra a saúde diminuindo gradualmente é um truque. Faz a GUI parecer viva. Se o `` Player`` receber 3 de dano, isso acontece em um instante.
ru: Каждый раз, когда игрок получает удар, ``GUI`` вызывает ``_on_Player_health_changed``, который в свою очередь вызывает ``update_health``. Это обновляет анимацию и ``number_label`` и ``bar`` направляются в ``_process``. Анимированная шкала здоровья, показывающий постепенное снижение здоровья. Это делает GUI более оживленным. Если ``Player`` получит 3 удара, это произойдет в одно мгновение.
zh_cn: 每当游戏角色受到攻击时， ``GUI`` 就会调用 ``_on_Player_health_changed`` ，然后调用 ``update_health``。这将更新动画和 ``number_label`` 和 ``bar`` 跟随 ``_process``。显示健康逐渐下降的动画生命条是一个技巧。它让GUI感觉自己是活着的。如果 ``Player`` 受到3点伤害，就会在瞬间发生。
zh_tw: 玩家每次受到攻擊時 ``GUI`` 都會呼叫 ``_on_Player_health_changed`` ，而裡面又會呼叫 ``update_health`` 並更新動畫，隨後在 ``_process`` 內也一併 ``number_label`` 與 ``bar`` 更新。將血條動畫化來讓生命值一點一點減少算是一種技巧，能讓 GUI 更生動。若 ``Player`` 一次受到 3 個傷害，則動畫會瞬間發生。

source: Fade the bar when the Player dies
cs: Vyblednutí ukazatele v případě Hráčovi smrti
de: Blenden den Balken aus, wenn der Spieler stirbt
es: Desvanecer la barra cuando el jugador muere
fr: Réaliser un fondu de la barre quand le joueur meurt
ja: 自機損失時にバーを消す
ko: Player가 죽을 때 막대가 사라지게 하기
pt_br: Clareia a barra quando o jogador morre
ru: Исчезновение шкал, когда игрок умирает
zh_cn: 当游戏角色死亡时，淡出条形栏
zh_tw: Player 死亡時淡出血槽
