Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_code_a_life_bar.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, zh_cn, zh_tw

source: The bar, a `TextureProgress`, has a `max_value` of `100` by default. If you don't need to display the character's health with a number, you don't need to change its `max_value` property. You send a percentage from the `Player` to the `GUI` instead: `health / max_health * 100`.
cs: Sloupec `TextureProgress` má ve výchozím nastavení hodnotu `max_value` `100`. Pokud nepotřebujete zobrazovat zdraví postavy pomocí čísla, nemusíte jeho vlastnost `max_value` měnit. Místo toho odešlete procenta z `Player` do `GUI`: `Zdraví / max_zdraví * 100`.
de: Die Leiste, eine `TextureProgress`, hat standardmäßig einen `Maximalwert` von `100`. Wenn Sie nicht die Gesundheit des Charakters mit einer Number anzeigen wollen, brauchen Sie nicht ihre `Maximalwert` Eigenschaft ändern. Sie senden einen Prozentsatz von dem `Spieler` stattdessen zur `GUI`:..`health/max_health * 100`.
es: La barra, un `TextureProgress`, tiene un `max_value` de `100` por defecto. Si no necesitas mostrar la salud del personaje con un número, no necesitas cambiar su propiedad `max_value`. En su lugar, envía un porcentaje del `Player` al `GUI`: `health / max_health * 100`.
fr: La barre de vie, un noeud `TextureProgress`, dans la section `Range` a la propriété `max_value` à `100` par défaut. Si l'on a pas besoin d'afficher la vie du joueur à l'aide d'un nombre, il n'est pas nécessaire de modifier cette propriété. On enverra, un pourcentage de la vie restante, du joueur `Player` à l'interface `GUI` : `health / max_health * 100` .
ja: `TextureProgress` であるバーは、デフォルトで `max_value` が `100` になっています。 キャラクターの体力を数字で表示する必要がない場合は、その `max_value` プロパティを変更する必要はありません。代わりに、 `Player` から `GUI` にパーセンテージを送信します: \ `health / max_health * 100`\ 。
ko: `TextureProgress` 막대는 `100` 의 `max_value` 를 기본적으로 갖고 있습니다. 캐릭터의 체력을 숫자로 표시하지 않아도 된다면, 그것의 `max_value` 속성을 바꿀 필요가 없습니다. 대신 `Player` 의 퍼센트를 `GUI` 로 보냅니다: `health / max_health * 100`.
pt_br: A barra, `TextureProgress`, tem um` max_value` de `100` por padrão. Se você não precisa exibir a saúde do personagem com um número, não é necessário alterar a propriedade `max_value`. Você envia uma porcentagem do `Player` para o` GUI` em vez disso:`health / max_health * 100`.
ru: Шкала `TextureProgress` имеет значение `max_value` в `100` по-умолчанию. Если вам не нужно отображать здоровье персонажа с числом, вам не нужно менять его свойство `max_value`. Вместо этого Вы отправляете процент от `Player` в `GUI`: `health / max_health * 100`.
zh_cn: 默认情况下，这个名为`TextureProgress`的工具条的max_value为`100`。如果不需要用数字显示角色的健康状态，则不需要更改其`max_value`属性。从`Player`向`GUI`发送一个百分比，而不是`health / max_health * 100`。
zh_tw: 預設情況下，計量槽 `TextureProgress` 的 `max_value` 為 `100` 。若不需要以數字方式顯示玩家的生命值的話則不需要更改 `max_value` 屬性。可以直接改為從 `Player` 傳送百分比給 `GUI` ： `health / max_health * 100` 。

source: Click the script icon to the right of the ``GUI`` in the Scene dock to open its script. In the ``_ready`` function, we're going to store the ``Player``'s ``max_health`` in a new variable and use it to set the ``bar``'s ``max_value``:
cs: Kliknutím na ikonu skriptu vpravo od ``GUI`` v doku scény otevřete jeho skript. Ve funkci ``_ready`` uložíme hodnotu ``max_health`` hráče ``Player`` do nové proměnné a použijeme ji k nastavení hodnoty ``bar``:
de: Klicken Sie das Skript Icon rechts neben ``GUI`` im Szenen Reiter um sein Skript zu öffnen. In der ``_ready`` Funktion werden wir eine neue Variable namens ``max_health`` (maximales leben) für den ``Player`` (Spieler) speichern und ihr den Wert von ``bar``s (Balken) ``max_value`` (maximaler Wert) geben:
es: Haz clic en el icono de script a la derecha de la ``GUI`` en el panel de Escenas para abrir su script. En la función ``_ready``, vamos a guardar el ``Player``'s ``max_health`` en una nueva variable y lo usaremos para establecer el ``bar``'s ``max_value``:
fr: Cliquez sur l'icône de script à droite du nœud ``GUI`` dans l'arbre des scènes pour ouvrir son script dans l'éditeur. Dans la fonction ``_ready``, nous allons récupérer la vie maximale ``max_health`` du joueur ``Player`` et la stocker dans une nouvelle variable ``player_max_health``. Cette variable est ensuite utilisée pour initialiser la valeur maximale ``max_value`` de la barre de vie ``bar`` :
ja: シーンドック内の ``GUI`` の右側にあるスクリプトアイコンをクリックして、スクリプトを開きます。 ``_ready`` 関数にて、プレイヤーの ``max_health`` を新しい変数に格納し、それを使って ``bar`` の ``max_value`` を設定します:
ko: 씬 독에서 ``GUI`` 오른쪽의 스크립트 아이콘을 클릭합니다. ``_ready`` 함수에서, 우리는 ``Player`` 의 ``max_health`` 을 새 변수로 저장하고 그걸로 ``bar`` 의 ``max_value`` 를 설정합니다:
pt_br: Clique no ícone de roteiro à direita da `` GUI`` no painel Cena para abrir seu roteiro. Na função ``_ready``, vamos armazenar ``max_health`` do ``Player`` em uma nova variável e usá-la para definir o ``max_value`` do ``bar``:
ru: Нажмите на значок скрипта справа от ``GUI`` в панели сцен, чтобы открыть его скрипт. В функции ``_ready`` мы собираемся хранить параметр ``max_health`` узла ``Player`` в новой переменной и использовать его для установки значения ``max_value`` узла ``bar``:
zh_cn: 点击场景面板中`GUI`右边的脚本图标，打开脚本。在`_ready`函数中，我们将把`Player`'s`max_health`存储在一个新变量中，并使用它设置`bar`'s`max_value`:
zh_tw: 點擊場景 Dock 中 ``GUI`` 右邊的腳本圖示來打開腳本。 我們要在 ``_ready`` 函式中將 ``Player`` 的 ``Max_health`` 保存在一個新變數裡，然後用這個變數來設定 ``bar`` 的 ``max_value`` ：

source: Let's break it down. ``$"../Characters/Player"`` is a shorthand that goes one node up in the scene tree, and retrieves the ``Characters/Player`` node from there. It gives us access to the node. The second part of the statement, ``.max_health``, accesses the ``max_health`` on the Player node.
cs: Rozebereme si to. ``$"../Characters/Player"`` je zkratka, která přejde o jeden uzel výše ve stromu scény a získá odtud uzel ``Characters/Player``. Tím získáme přístup k uzlu. Druhá část příkazu, ``.max_health``, zpřístupní hodnotu ``max_health`` v uzlu Player.
de: Schauen wir uns das mal genauer an. ``$"../Characters/Player"``` ist eine Abkürzung, die im Szenenbaum einen Node nach oben geht und von dort aus den Node ``Characters/Player`` abruft. Das gibt uns Zugang zum Node. Der zweite Teil der Anweisung, ``.max_health``, greift auf die ``max_health``-Variable auf dem Player-Node zu.
es: Vamos a desglosarlo. ``$"../Characters/Player"`` es una abreviatura que sube un nodo en el árbol de escenas, y recupera el nodo ``Characters/Player`` desde allí. Nos da acceso al nodo. La segunda parte de la declaración, ``.max_health``, accede a ``max_health`` en el nodo Player.
fr: Décomposons ce script. L'instruction ``$"../Characters/Player"`` permet de récupérer, dans le nœud parent ``LevelMockup`` de notre nœud ``GUI`` à l'aide du chemin ``../``, le nœud ``Player`` dans le nœud ``Characters``. Le symbole ``$`` permet de récupérer le nœud. Nous accédons ensuite à la variable ``max_health`` du nœud ``Player`` à l'aide du symbole ``.``. On accèdent donc bien à la valeur maximale de vie du joueur.
ja: 1つずつ見てみましょう。 ``$"../Characters/Player"`` は簡略記法で、シーンツリーで1つ上のノードに移動し、そこから ``Characters/Player`` ノードを取得します。これにより目的のノードにアクセスできます。文の2番目の部分、 ``.max_health`` は、Playerノード上の ``max_health`` にアクセスします。
ko: 분석해봅시다. ``$"../Characters/Player"`` 는 씬 트리의 한 노드를 불러옵니다, 그리고 ``Characters/Player`` 노드를 검색하는 속기입니다. 그것은 노드에게 진입로를 제공합니다. 명령문의 두 번째 부분은, ``.max_health`` 로, Player 노드에 ``max_health`` 를 접근합니다.
pt_br: Vamos acabar com isso. `` $ "../ Characters / Player" `` é uma abreviação que sobe um nó na árvore de cena, e recupera o nó `` Characters / Player`` de lá. Isso nos dá acesso ao nó. A segunda parte da instrução, `` .max_health``, acessa o `` max_health`` no nó do Player.
ru: Давайте рассмотрим его. ``$"../Characters/Player"`` является сокращением, которое поднимается на один узел вверх в дереве сцен, и извлекает ``Characters/Player`` оттуда. Это дает нам доступ к узлу. Вторая часть заявления, ``.max_health``, обращается к параметру ``max_health`` узла Player.
zh_cn: 让我们把它分解一下。`$"../Characters/Player"`是场景树中一个节点的简写，从那里检索`Characters/Player`节点。它允许我们访问节点。陈述的第二部分，`.max_health`，访问游戏角色节点上的`max_health`。
zh_tw: 讓我們把它拆開來看。 ``$"../Characters/Player"`` 是取得節點的簡寫，先從節點樹上的上一層開始搜尋，然後找到 ``Characters/Player`` 節點。陳述式的第二個部分 ``.max_health`` 表示在 Player 節點上存取 ``max_health`` 屬性。

source: The second line assigns this value to ``bar.max_value``. You could combine the two lines into one, but we'll need to use ``player_max_health`` again later in the tutorial.
cs: Druhý řádek přiřadí tuto hodnotu souboru ``bar.max_value``. Tyto dva řádky můžete spojit do jednoho, ale později v návodu budeme muset znovu použít ``hráč_max_health``.
de: Die zweite Zeile weist den Wert ``bar.max_value`` zu. Die zwei Zeilen könnten auch zu einer Kombiniert werden, doch ``player_max_health`` wird später in der Anleitung noch gebraucht werden.
es: La segunda línea asigna este valor a ``bar.max_value``. Se podrían combinar las dos líneas en una sola, pero necesitaremos usar ``player_max_health`` más adelante en el tutorial.
fr: La seconde ligne assigne cette valeur à ``bar.max_value``. On pourrait combiner ces deux lignes en une seule mais on a besoin de cette valeur plus tard dans ce tutoriel, il donc plus judicieux de la stocker dans une variable``player_max_health``.
ja: 2行目は、この値を ``bar.max_value`` に割り当てます。 この2行を1つにまとめることもできますが、チュートリアルの後半でもう一度 ``player_max_health`` を使う必要があります。
ko: 두 번째 줄을 ``bar.max_value`` 의 값을 지정합니다.이 두 줄을 하나로 묶을 수도 있습니다, 하지만 이 튜토리얼에서 ``player_max_health`` 를 나중에도 사용해야 할 것입니다.
pt_br: A segunda linha atribui este valor a `` bar.max_value``. Você pode combinar as duas linhas em uma, mas precisaremos usar `` player_max_health`` novamente mais tarde no tutorial.
ru: Вторая строка присваивает это значение к ``bar.max_value``. Вы могли бы объединить две строки в одну, но мы должны будем использовать ``player_max_health`` снова позже в этом уроке.
zh_cn: 第二行将该值赋给`bar.max_value`。您可以将这两行合并为一行，但是我们需要在本教程后面再次使用`player_max_health`。
zh_tw: 第二行將剛才取得的值賦值給 ``bar.max_value`` 。雖然可以把這兩行簡寫成一行，但因為這個教學之後還會用到 ``player_max_health`` ，所以我們先這樣寫。

source: ``Player.gd`` sets the ``health`` to ``max_health`` at the start of the game, so we could work with this. Why do we still use ``max_health``? There are two reasons:
cs: ``Player.gd`` nastaví ``health`` na ``max_health`` na začátku hry, takže bychom s tím mohli pracovat. Proč stále používáme ``max_health``? Důvody jsou dva:
de: Am Anfang des Spieles wird ``health`` auf ``max_health`` gesetzt, damit wir es gebrauchen können. Warum brauchen wir ``max_health`` immer noch? Es gibt zwei Gründe:
es: ``Player.gd`` establece ``health`` en ``max_health`` al principio del juego, para que podamos trabajar con esto. ¿Por qué seguimos usando ``max_health``? Hay dos razones:
fr: Le script associée au nœud joueur``Player.gd`` initialise la valeur de vie ``health`` à la valeur de vie maximale ``max_health`` au début du jeu. Alors pourquoi utiliser la variable ``max_health``? Il y a deux raisons :
ja: ``Player.gd`` はゲーム開始時に ``health`` を ``max_health`` に設定するので、このまま作業できます。なぜ ``max_health`` を使用しているのでしょう？ これには 2つの理由があります:
ko: ``Player.gd`` 는 게임 시작 시 ``health`` 를 ``max_health`` 로 설정합니다, 따라서 이것으로 작업할 수 있었습니다. 왜 여전히 ``max_health`` 를 사용하냐고요? 두 가지 이유가 있습니다:
pt_br: `` Player.gd`` define o `` health`` para `` max_health`` no início do jogo, então podemos trabalhar com isso. Por que ainda usamos `` max_health``? Existem dois motivos:
ru: ``Player.gd`` устанавливает ``health`` в ``max_health`` в начале игры, поэтому мы могли бы работать с ним. Почему мы по-прежнему используем ``max_health``? Есть две причины:
zh_cn: `Player.gd`在游戏开始时设置`health`到`max_health`，所以我们可以使用这个。为什么我们仍然使用`max_health`？有两个原因:
zh_tw: ``Player.gd`` 在遊戲開始時將 ``health`` 設定成了 ``max_health`` ，所以我們可以直接用 ``health`` 。但為什麼我們後面還要用到 ``max_health`` 呢？有兩個原因：

source: We don't have the guarantee that ``health`` will always equal ``max_health``: a future version of the game may load a level where the player already lost some health.
cs: Nemáme záruku, že ``helath`` se bude vždy rovnat ``max_health``: v budoucí verzi hry se může načíst úroveň, kde hráč již ztratil nějaké zdraví.
de: Wir können nicht davon ausgehen, dass ``health`` in jedem Fall ``max_health`` entspricht: Eine spätere Version des Spiels könnte beispielsweise einen Level laden, in welchem der Spieler bereits etwas Gesundheit verloren hat.
es: No tenemos la garantía de que ``health`` sea siempre igual a la ``max_salud``: una futura versión del juego puede cargar un nivel en el que el jugador ya haya perdido algo de salud.
fr: On a pas la garantie que la vie actuelle``health` sera toujours égal à la vie maximale``max_health`: une version future du jeu pourrait charger un niveau où le joueur a déjà perdu de la vie.
ja: ``health`` が常に ``max_health`` と等しい保証はありません。このゲームの将来バージョンでは、プレイヤーが体力をいくらか失った状態でも、次のレベルを読み込めるようにするかもしれません。
ko: ``health`` 가 항상 ``max_health`` 와 같다는 보장은 없습니다: 게임의 미래 버전에서는 플레이어가 이미 체력을 잃은 채로 레벨을 불러올 지도 모릅니다.
pt_br: Nós não temos a garantia de que `` health`` será sempre igual a `` max_health``: uma versão futura do jogo pode carregar um nível em que o jogador já perdeu alguma vida.
ru: Вы не можете быть уверены, что ``health`` всегда будет равен ``max_health``: будущая версия игры может загрузить уровень, где игрок уже потерял некоторое количество здоровья.
zh_cn: 我们不能保证`health`总是等于`max_health`:未来版本的游戏可能会加载一个游戏角色已经失去健康的关卡。
zh_tw: 我們沒辦法保證 ``health`` 的值永遠與 ``max_health`` 相同，遊戲之後可能會出一個新版本是關卡載入時玩家的生命值就已經受損。

source: When you open a scene in the game, Godot creates nodes one by one, following the order in your Scene dock, from top to bottom. `GUI` and `Player` are not part of the same node branch. To make sure they both exist when we access each other, we have to use the `_ready` function. Godot calls `_ready` right after it loaded all nodes, before the game starts. It's the perfect function to set everything up and prepare the game session. Learn more about _ready: :doc:`scripting_continued`
cs: Když ve hře otevřete scénu, Godot vytvoří uzly jeden po druhém podle pořadí v doku scény shora dolů. `GUI` a `Hráč` nejsou součástí stejné větve uzlů. Abychom se ujistili, že oba existují, když k nim přistupujeme, musíme použít funkci `_ready`. Godot zavolá `_ready` hned po načtení všech uzlů, ještě před spuštěním hry. Je to ideální funkce pro nastavení všeho a přípravu herní relace. Další informace o funkci _ready: :doc:`scripting_continued`
de: Wenn Sie eine Szene im Spiel öffnen, kreiert Godot Nodes einen nach dem anderen, in der Reihenfolge des Szenen Reiters, von oben nach unten. `GUI` und `Player` sind nicht teil des selben Node-Zweiges. Um sicherzustellen, dass beide existieren wenn wir auf sie zugreifen, benutzen wir die `_ready` Funktion. Godot führt `_ready` genau dann aus, wenn es alle Nodes geladen hat, bevor das Spiel startet. Es ist die perfekte Funktion um alles einzustellen und die Spiel Sitzung vorzubereiten. Mehr zu _ready: :doc:`scripting_continued`
es: Cuando abres una escena en el juego, Godot crea nodos uno a uno, siguiendo el orden de tu panel de Escenas, de arriba a abajo. GUI` y `Player` no son parte de la misma rama del nodo. Para asegurarnos de que ambos existen cuando accedemos el uno al otro, tenemos que usar la función `_ready`. Godot llama `_ready` justo después de haber cargado todos los nodos, antes de que el juego comience. Es la función perfecta para configurar todo y preparar la sesión de juego. Más información about _ready: :doc:`scripting_continued`
fr: Quand vous ouvrez une scène dans le jeu, Godot créer les nœuds un par un, en suivant l 'ordre donnée dans votre arbre des scènes, du haut vers le bas. `GUI` et `Player`ne font pas partis de la même branche de nœud. Pour être sûr, qu'elles existent lorsqu'on y accèdent, on doit utiliser la fonction `_ready`. Godot appelle ces fonctions `_ready` après avoir chargé tous les nœuds, avant que le jeu commence. C'est la fonction parfaite pour initialiser notre jeu et préparer le jeu. Vous apprendrez plus sur cette fonction `_ready`dans : :doc:`scripting_continued`
ja: ゲーム内でシーンを開くと、Godotはシーンドック内の順序に従って、上から下にノードを1つずつ作成していきます。 `GUI` と `Player` は、同じノードブランチの一部ではありません。これらが相互にアクセスするときに両方とも存在することを確認するには、 `_ready` 関数を使用する必要があります。Godotは、すべてのノードをロードした直後、ゲームを開始する前に `_ready` を呼び出します。これは、すべてを設定してゲームセッションを準備するには最適な関数です。\ _ready の詳細については\ :doc:`scripting_continued`\ を参照して下さい。
ko: 게임에서 씬을 열 때,Godot는 씬 독에서 위에서 아래로, 순서에 따라, 하나 씩 노드를 만들어 냅니다. `GUI` 와 `Player` 는 같은 노드 분기에 있지 않습니다. 실행 시에 그들이 함께 있게 만들기 위해선, 우리는 `_ready` 함수를 사용해야 합니다. Godot는 게임이 시작하기 전, 모든 노드를 불러온 후에 `_ready` 를 부릅니다. 모든 것을 설정하고 게임 세션을 준비하기에 최고의 함수입니다. _ready 에 대해서는 :doc:`scripting_continued` 를 참고하세요
pt_br: Quando você abre uma cena no jogo, Godot cria os nós um por um, seguindo a ordem no seu painel Cena, de cima para baixo. `GUI` e `Player` não fazem parte do mesmo ramo de nó. Para ter certeza de que ambos existem quando nós os acessamos, temos que usar a função `_ready`. Godot chama `_ready` logo após carregar todos os nós, antes do jogo começar. É a função perfeita para configurar tudo e preparar a sessão do jogo. Saiba mais sobre _ready: :doc:`scripting_continued`
ru: Когда вы открываете сцену в игре, Godot создает узлы один за одним, следуя заказу в вашей панели сцен, сверху вниз. `GUI` и `Player` не являются частью той же ветви узла. Чтобы убедиться, что они оба существуют, когда мы получаем доступ к ним, мы должны использовать функцию `_ready`. Godot вызывает `_ready` сразу после того, как он загрузил все узлы, до начала игры. Это идеальная функция, чтобы установить все и подготовить сессию игры. Узнайте больше о _ready: :doc:`scripting_continued`
zh_cn: 当您在游戏中打开一个场景时，Godot会按照您的场景面板的顺序，从上到下依次创建节点。`GUI`和`Player`不是同一个节点分支的一部分。为了确保当我们访问对方时它们都存在，我们必须使用`_ready`函数。Godot在加载所有节点之后，在游戏开始之前调用`_ready`。这是一个完美的功能来设置和准备游戏会话。了解关于_ready: :doc:`scripting_continued`的更多信息
zh_tw: 當在遊戲內打開場景時，Godot 會以場景 Dock 內由上而下的順序來依次建立節點。 `GUI` 與 `Player` 並不再相同的節點分支上，所以為了保證我們在存取這兩個節點時他們都存在，我們要用 `_ready` 函式。Godot 會在所有節點都載入後與遊戲開始之間呼叫 `_ready` ，所以這裡便是設定所有東西與準備遊戲流程的最佳時機。有關 _ready 的更多資訊請參考 :doc:`scripting_continued`

source: Update health with a signal when the player takes a hit
cs: Aktualizace stavu zdraví pomocí signálu, když hráč dostane zásah
de: Aktualisieren Sie die Gesundheit mit einem Signal, wenn der Spieler einen Treffer erhält.
es: Actualizar la salud con una señal cuando el jugador recibe un golpe
fr: Mettre à jour la santé avec un signal lorsque le joueur prend un coup
ja: プレイヤーがヒットしたときにシグナルで体力を更新する
ko: 플레이어가 피해를 입었을 때 시그널로 체력을 업데이트하기
pt_br: Atualize a vida com um sinal quando o jogador leva um golpe
ru: Обновление здоровья с помощью сигнала при получении урона
zh_cn: 当游戏角色受到攻击时，用信号更新生命值
zh_tw: 當玩家收到傷害時使用訊號來更新生命值

source: Our GUI is ready to receive the ``health`` value updates from the ``Player``. To achieve this we're going to use **signals**.
cs: Naše grafické uživatelské rozhraní je připraveno přijímat aktualizace hodnot ``health`` od ``Player``. K tomu použijeme **signály**.
de: Unsere GUI ist bereit um Aktualisierungen der ``health`` Werte vom ``Player`` zu bekommen.
es: Nuestra GUI está lista para recibir las actualizaciones de valor de ``health`` desde ``Player``. Para lograr esto vamos a usar **señales**.
fr: Notre interface graphique est prête à recevoir les mises-à-jour de la valeur de ``health`` de ``Player``. Pour ce faire, nous allons utiliser des **signaux**.
ja: GUIは ``Player`` から ``health`` の更新値を受け取る準備ができています。これを実現するために、\ **シグナル**\ を使用します。
ko: 우리의 GUI는 ``Player`` 에서 ``health`` 을 받을 준비가 되었습니다. 그러기 위해 우리는 **시그널(signals)** 을 사용합니다.
pt_br: Nossa GUI está pronta para receber as atualizações do valor `` health`` do `` Player``. Para conseguir isso, vamos usar ** sinais **.
ru: Наш GUI готов к получению обновляемых значений ``health`` из ``Player``. Для этого мы собираемся использовать **сигналы**.
zh_cn: 我们的GUI已经准备好接收来自`Player`的`health`值更新。为了实现这一点，我们将使用 **信号** 。
zh_tw: GUI 已經準備要來接收 ``Player`` 傳來更新過的 ``health`` 值了。我們要使用 **訊號** 來實作。

source: There are many useful built-in signals like `enter_tree` and `exit_tree`, that all nodes emit when they are respectively created and destroyed. You can also create your own using the `signal` keyword. On the `Player` node, you'll find two signals we created for you: `died` and `health_changed`.
cs: Existuje mnoho užitečných vestavěných signálů, například `enter_tree` a `exit_tree`, které všechny uzly vysílají při svém vytvoření a ukončení. Můžete si také vytvořit vlastní pomocí klíčového slova `signal`. V uzlu `Player` najdete dva signály, které jsme pro vás vytvořili: `died` a `health_changed`.
de: Es gibt viele nützliche eingebaute Signale wie `enter_tree` und `exit_tree`, die alle Nodes aussenden, wenn sie jeweils erzeugt und zerstört werden. Sie können auch Ihre eigenen mit dem Schlüsselwort `signal` erstellen. Auf dem Node `Player` finden Sie zwei Signale, die wir erstellt haben: `died` und `health_changed`.
es: Hay muchas señales útiles incorporadas como `enter_tree` y `exit_tree`, que todos los nodos emiten cuando son creados y destruidos respectivamente. También puedes crear el tuyo propio usando la palabra clave `signal`. En el nodo `Player`, encontrarás dos señales que hemos creado para ti: `died` y `health_changed`.
fr: Il existe de nombreux signaux intégrés utiles comme `enter_tree` et `exit_tree`, que tous les nœuds émettent lorsqu'ils sont respectivement créés et détruits. Vous pouvez également créer votre propre signal en utilisant le mot-clé `signal`. Sur le nœud `Player`, vous trouverez deux signaux que nous avons créés pour vous : `died` et `health_changed`.
ja: たくさんの便利な組み込みシグナルがあり、たとえば全てのノードが持つ\ `enter_tree` と `exit_tree` は、それぞれ作成されたときと破棄されたときに発信します。\ `signal` キーワードを使用すれば、独自のシグナルを作成することもできます。 `Player` ノードには、そうして用意された2つのシグナル `died` と `health_changed` がすでにあります。
ko: 많은 유용한 내장 시그널이 있습니다, `enter_tree` 와 `exit_tree` 는 모든 노드가 각각 만들어지고 없어질 때 방출하는 것입니다. 또한 자신만의 `시그널` 키워드를 만들어 사용할 수 있습니다. `Player` 노드에서 두 개의 시그널을 찾으실 수 있습니다: `died` 와 `health_changed` 입니다.
pt_br: Existem muitos sinais internos úteis como `enter_tree` e` exit_tree`, que todos os nós emitem quando são respectivamente criados e destruídos. Você também pode criar seus próprios usando a palavra-chave `signal`. No nó `Player`, você encontrará dois sinais que criamos para você:` died` e `health_changed`.
ru: Есть много полезных встроенных сигналов, таких как `enter_tree` и `exit_tree`, они вызываются, когда узлы соответственно создаются и уничтожаются. Вы также можете создать свой собственный сигнал с помощью ключевого слова `signal`. На узле `Player` вы найдете два сигнала, которые мы создали для вас: `died` и `health_changed`.
zh_cn: 有许多有用的内置信号，如`enter_tree`和`exit_tree`，当它们分别被创建和销毁时，所有节点都会发出这些信号。您也可以使用`signal`关键字创建您自己的。在`Player`节点上，您会发现我们为您创建的两个信号:`died`和`health_changed`。
zh_tw: Godot 內有許多實用的內建訊號，如 ``enter_tree`` 與 ``exit_tree`` 這兩個訊號分別會在任何節點建立與銷毀時發出。我們也可以通過 ``signal`` 關鍵字來建立自定訊號。你可以在 ``Player`` 節點內看到兩個我們預先幫你做好的訊號： ``died`` 與 ``health_changed`` 。
