Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_code_a_life_bar.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, zh_cn, zh_tw

source: At the bottom of the window you will find the path to the node you selected. We're interested in the second row called "Method in Node". This is the method on the ``GUI`` node that gets called when the signal is emitted. This method receives the values sent with the signal and lets you process them. If you look to the right, there is a "Make Function" radio button that is on by default. Click the connect button at the bottom of the window. Godot creates the method inside the ``GUI`` node. The script editor opens with the cursor inside a new ``_on_Player_health_changed`` function.
cs: Ve spodní části okna najdete cestu k vybranému uzlu. Nás zajímá druhý řádek s názvem "Metoda v uzlu". Jedná se o metodu v uzlu ``GUI``, která se zavolá při vyslání signálu. Tato metoda přijímá hodnoty zaslané se signálem a umožňuje je zpracovat. Pokud se podíváte vpravo, je zde přepínač "Make Function", který je ve výchozím nastavení zapnutý. Klepněte na tlačítko připojit v dolní části okna. Godot vytvoří metodu uvnitř uzlu ``GUI``. Otevře se editor skriptů s kurzorem uvnitř nové funkce ``_on_Player_health_changed``.
de: Am unteren Rand des Fensters finden Sie den Pfad zu dem von Ihnen ausgewählten Nodes. Wir sind an der zweiten Zeile "Methode im Knoten" interessiert. Dies ist die Methode auf dem ``GUI```-Node, die aufgerufen wird, wenn das Signal ausgegeben wird. Dieses Verfahren empfängt die mit dem Signal gesendeten Werte und ermöglicht deren Verarbeitung. Rechts gibt es einen Button "Make Function", der standardmäßig eingeschaltet ist. Klicken Sie auf den Button Verbinden am unteren Rand des Fensters. Godot erstellt die Methode innerhalb des ``GUI`` Nodes. Der Skripteditor öffnet sich mit dem Cursor innerhalb einer neuen ``_on_Player_health_changed`` Funktion.
es: En la parte inferior de la ventana se encuentra la ruta al nodo seleccionado. Nos interesa la segunda fila llamada "Method in Node". Este es el método en el nodo ``GUI`` que se llama cuando se emite la señal. Este método recibe los valores enviados con la señal y permite procesarlos. Si observas a la derecha, hay un botón de radio que dice "Make Function" y está activado por defecto. Haz clic en el botón de conexión en la parte inferior de la ventana. Godot crea el método dentro del nodo ``GUI``. El editor de scripts se abre con el cursor dentro de una nueva función ``_on_Player_health_changed``.
fr: En bas de la fenêtre, vous trouverez le chemin d'accès au nœud que vous avez sélectionné. Nous nous intéressons à la deuxième ligne appelée "Méthode dans le nœud". C'est la méthode sur le noeud ``GUI`` qui est appelé lorsque le signal est émis. Cette méthode reçoit les valeurs envoyées avec le signal et vous permet de les traiter. Si vous regardez à droite, il y a un bouton radio "Créer une fonction" qui est activé par défaut. Cliquez sur le bouton Connecter au bas de la fenêtre. Godot crée la méthode à l'intérieur du nœud ``GUI``. L'éditeur de script s'ouvre avec le curseur à l'intérieur d'une nouvelle fonction ``_on_player_health_changed``.
ja: ウィンドウの下部に、選択したノードへのパスが表示されます。"Method in Node"と呼ばれる 2 行目に注目して下さい。これは、シグナルが出力されるときに呼び出される ``GUI`` ノード上のメソッドです。このメソッドは、シグナルと共に送信された値を受け取り、それらを処理できるようにします。右側を見ると、デフォルトで「関数を作成」ラジオボタンがオンになっています。ウィンドウの下部にある接続ボタンをクリックします。Godot は ``GUI`` ノード内にメソッドを作成します。スクリプトエディタが開き、新しい ``_on_Player_health_changed`` 関数内にカーソルが置かれます。
ko: 창의 아래에 당신이 선택한 노드의 경로를 찾으실 수 있습니다. 우리는 "Method in Node"라 부르는 두 번째 줄에 관심을 둘 겁니다. 이것은 ``GUI`` 노드에서 시그널이 방출될 때 호출되는 메서드 입니다. 이 메서드는 시그널과 함께 전송된 값을 받아 처리합니다. 오른쪽을 보시면, "함수 만들기" 버튼이 기본적으로 켜진 채로 있습니다. 창 아래의 연결 버튼을 누릅니다. Godot는 ``GUI`` 노드 안에 메서드를 만듭니다. 스크립트 편집기를 열면 새로운 ``_on_Player_health_changed`` 함수가 안에 있습니다.
pt_br: Na parte inferior da janela, você encontrará o caminho para o nó selecionado. Estamos interessados na segunda linha chamada "Método no Nó". Este é o método no nó `` GUI`` que é chamado quando o sinal é emitido. Este método recebe os valores enviados com o sinal e permite processá-los. Se você olhar para a direita, há um botão de opção "Make Function" que está ativado por padrão. Clique no botão de conexão na parte inferior da janela. Godot cria o método dentro do nó `` GUI``. O editor de script é aberto com o cursor dentro de uma nova função `` _on_player_health_changed``.
ru: В нижней части окна вы найдете путь к выбранному узлу. Мы заинтересованы во втором поле под названием "Method in Node". Это метод на узле ``GUI``, который вызывается при излучении сигнала. Этот метод получает значения, отправленные с сигналом и позволяет обработать их. Если вы посмотрите правее, там есть переключатель "сделать функцию", который включен по умолчанию. Нажмите на кнопку подключения в нижней части окна. Godot создает метод внутри узла ``GUI``. Откроется редактор скриптов с курсором внутри новой функции ``_on_Player_health_changed``.
zh_cn: 在窗口的底部，您将找到您选择的节点的路径。我们对第二行`Node中的方法`感兴趣。这是`GUI`节点上在发出信号时调用的方法。此方法接收随信号发送的值，并允许您处理它们。如果您向右看，默认情况下有一个`Make Function`单选按钮。单击窗口底部的connect按钮。Godot在`GUI`节点中创建方法。脚本编辑器在一个新的`_on_Player_health_changed`函数中打开光标。
zh_tw: 視窗的底部可以看到所選擇的節點的路徑。我們這裡可以注意到第二行為「節點中的方法」，這裡顯示的就是訊號送出時會在 ``GUI`` 節點中呼叫的方法，會接收訊號送出的值並讓你進行處理。右邊有一個預設勾選的「建立函式」單選框。點擊視窗底部的連接按鈕，Godot 會在 ``GUI`` 節點內建立方法，並打開腳本編輯器，將遊標移動到新建立的 ``_on_Player_health_changed`` 函式內。

source: When you connect nodes from the editor, Godot generates a method name with the following pattern: ``_on_EmitterName_signal_name``. If you wrote the method already, the "Make Function" option will keep it. You may replace the name with anything you'd like.
cs: Při připojování uzlů z editoru generuje Godot název metody s následujícím vzorem: ``_on_EmitterName_signal_name``. Pokud jste metodu již napsali, volba "Make Function" ji zachová. Název můžete nahradit čímkoli, co si přejete.
de: Wenn eine Node im Editor verbunden wird, generiert Godot eine Methode nach dem folgenden Musster: ``_on_EmitterName_signal_name``. Falls die Methode bereits existiert, bleibt die "Erstelle Funktion". Der Name kann nach belieben verändert werden.
es: Cuando conectas nodos desde el editor, Godot genera un nombre de método con el siguiente patrón: ``_on_EmitterName_signal_name``. Si ya se ha escrito el método, la opción "Make Function" lo mantendrá. Puedes reemplazar el nombre con lo que quieras.
fr: Lorsque vous connectez des nœuds à partir de l'éditeur, Godot génère un nom de méthode avec le modèle suivant : ``_on_EmitterName_signal_name``. Si vous avez déjà écrit la méthode, l'option "Créer une fonction" la conservera. Vous pouvez remplacer le nom par ce que vous voulez.
ja: エディタからノードを接続すると、Godotは ``_on_EmitterName_signal_name (_on_(発信元名)_(シグナル名))`` のパターンでメソッド名を生成します。すでにそのメソッドが書かれている場合は、「関数を作成」オプションが有効であっても内容は保持されます。この名前は任意の名前に置き換えることができます。
ko: 편집기에서 노드를 연결할 때, Godot는 메서드 이름을 다음과 같은 방식으로 만듭니다: ``_on_방출하는노드이름_시그널_이름``. 이미 메서드를 적었다면, "함수 만들기" 설정은 유지될 것입니다. 당신이 원하는 어떤 이름으로도 바꿀 수 있습니다.
pt_br: Quando você conecta nós no editor, Godot gera um nome de método com o seguinte padrão: `` _on_EmitterName_signal_name``. Se você já escreveu o método, a opção "Make Function" irá mantê-lo. Você pode substituir o nome com o que quiser.
ru: При подключении узлов из редактора Godot создает имя метода по шаблону: ``_on_EmitterName_signal_name``. Если вы уже написали этот метод, опция "Сделать функцию" будет сохранять его. Вы можете заменить имя на другое.
zh_cn: 当您从编辑器中连接节点时，Godot会生成一个方法名，其模式是:`_on_EmitterName_signal_name`。如果您已经编写了该方法，`Make Function`选项将保留它。您可以用任何您想要的东西来代替这个名字。
zh_tw: 從編輯器上連接訊號時，Godot 會以 ``_on_發送者名稱_訊號名稱`` 這樣的格式來建立方法。若已經寫好這個函式的話，則「建立函式」仍然會保留已經寫好的函式。你可以任意替換掉預設的名字。

source: Godot writes the callback method for you and takes you to it
cs: Godot pro vás napíše metodu obsluhy signálu(callback) a přenese vás k ní
de: Godot erstellt die Callback Methode für Sie und führt Sie dorthin
es: Godot escribe el método de devolución de llamada para ti y te lleva a él
fr: Godot écrit la méthode de rappel pour vous et vous y emmène
ja: Godotはコールバック メソッドを作成し、あなたに見せます
ko: Godot는 콜백 메서드를 적어 사용자에게 전달합니다
pt_br: Godot escreve o método de callback para você e leva você até ele
ru: Godot напишет метод обратного вызова для вас и доставит вас к нему
zh_cn: Godot为您编写回调方法并将您带到它
zh_tw: Godot 會幫你建立好回呼方法並把打開

source: Inside the parentheses after the function name, add a ``player_health`` argument. When the player emits the ``health_changed`` signal, it will send its current ``health`` alongside it. Your code should look like:
cs: Do závorek za název funkce přidejte argument ``player_health``. Když hráč vyšle signál ``health_changed``, pošle spolu s ním i své aktuální ``health``. Váš kód by měl vypadat takto:
de: Fügen Sie innerhalb der Klammern nach dem Funktionsnamen ein ``Player_Health`` Argument hinzu. Wenn der Spieler das Signal ``health_changed`` aussendet, sendet er seine aktuelle ``health`` mit. Ihr Code sollte so aussehen:
fr: Entre les parenthèses après le nom de notre méthode, ajouter un argument ``player_health``. Quand le signal ``health_changed`` sera émis, il enverra l'information de point de vie actuel ``health`` avec. Votre code devrait ressembler à :
ja: 関数名の後の括弧内に ``player_health`` 引数を追加してください。プレイヤーが ``health_changed`` シグナルを発信すると、現在の ``health`` も一緒に送信します。コードは次のようになります。
ko: 함수 이름 다음의 괄호 안에, ``player_health`` 인수를 추가하세요. 플레이어가 ``health_changed`` 시그널을 방출할 때, 현재 ``health``\ 와 함께 보내질 것입니다. 코드는 다음과 같아야 합니다:
ru: В скобках после имени функции добавьте аргумент ``player_health``. Когда игрок излучает сигнал ``health_changed``, он посылает его текущее ``health`` вместе с ним. Код должен выглядеть так:
zh_tw: 在函式名稱的括號後新增一個 ``player_health`` 引數。當 Player 送出了 ``health_changed`` 訊號，會將 Player 目前的 ``health`` 也一起送出。現在，你的程式碼應該長這樣：

source: The engine does not convert PascalCase to snake_case, for C# examples we'll be using PascalCase for method names & camelCase for method parameters, which follows the official `C# naming conventions. <https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/capitalization-conventions>`_
cs: Engine nepřevádí PascalCase na snake_case, v příkladech v jazyce C# budeme používat PascalCase pro názvy metod a camelCase pro parametry metod, což odpovídá oficiální konvenci `C# pro pojmenování. <https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/capitalization-conventions>`_
de: Die Engine konvertiert PascalCase nicht in snake_case, für C#-Beispiele werden wir PascalCase für Methodennamen und camelCase für Methodenparameter verwenden, was den offiziellen `C#-Namenskonventionen folgt. <https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/capitalization-conventions>``_
fr: Le moteur ne convertit pas PascalCase en snake_case, pour les exemples C# nous utiliserons PascalCase pour les noms de méthode et camelCase pour les paramètres de méthode, ce qui suit `les conventions de nommage officielles C#. <https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/capitalization-conventions>`_
ja: エンジンは PascalCase を snake_case に変換しません。C#の例では、メソッド名に PascalCase を、メソッドパラメータに camelCase を使用しています。これは公式の\ `C#命名規則 <https://docs.microsoft.com/ja-jp/dotnet/standard/design-guidelines/capitalization-conventions>`_\ に従うものです。
ko: 엔진은 파스칼 표기법(PascalCase)을 스네이크 표기법(snake_case)으로 변환하지 않기 때문에, C# 예제에서 메서드 이름에는 파스칼 표기법, 메서드 매개 변수에는 카멜 표기법(camelCase)을 사용할 것입니다, 공식 `C# 명명 규칙. <https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/capitalization-conventions>`_에 따르는 것입니다
ru: Обработчик не преобразует PascalCase в snake_case, для примеров C# мы будем использовать PascalCase для имен методов и camelCase для параметров метода, которые следуют за официальными `C# naming conventions. <https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/capitalization-conventions>`_
zh_cn: 引擎不会将PascalCase转换成snake_case，对于C#示例，我们将使用PascalCase来表示方法名，而camelCase用于方法参数，这些参数遵循 `官方的C#命名约定。 <https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/capitalization-conventions>`_
zh_tw: Godot 不會將 PascalCase 大駝峰法轉換成 snake_case 底線分隔。C# 的例子內的方法名稱我們會使用 PascaCase，方法參數則使用 camelCase，遵守 `C# 命名慣例 <https://docs.microsoft.com/zh-tw/dotnet/standard/design-guidelines/capitalization-conventions>`_

source: In Player.gd, when the Player emits the health\_changed signal, it also sends its health value
cs: Když Player v souboru Player.gd vyšle signál health\_changed, odešle také hodnotu svého zdraví
de: Wenn der Spieler in Player.gd das Signal "health\_changed signal" ausgibt, sendet er auch seinen Gesundheitswert
es: En Player.gd, cuando el Player emite la señal health\_changed, también envía su valor de salud
fr: Dans le script Player.gd, quand le joueur émets le signal health\_changed, il envoies aussi la valeur health
ja: Player.gdでは、Playerがhealth\_changedシグナルを発信すると、その体力値も送信します
ko: Player.gd에서, Player가 health\_changed 시그널을 방출할 때, 체력 값도 보냅니다
pt_br: No Player.gd, quando o Player emite o sinal health \ _changed, ele também envia seu valor de integridade
ru: В Player.gd, когда Player посылает сигнал health\_changed, он также посылает значение своего здоровья
zh_cn: 在Player.gd。当游戏角色发出health\_changed信号时，它也会发送其health值
zh_tw: Player.gd 中，當 Player 送出 health\_changed 訊號時也會一併送出 health 值

source: Inside ``_on_Player_health_changed``, let's call a second function called ``update_health`` and pass it the ``player_health`` variable.
cs: Uvnitř funkce ``_on_Player_health_changed`` zavoláme druhou funkci s názvem ``update_health`` a předáme jí proměnnou ``player_health``.
de: Innerhalb von ``_on_Player_health_changed``, rufen wir eine zweite Funktion namens ``update_health`` auf und übergeben ihr die ``Player_health`` Variable.
fr: Dans la méthode ``_on_Player_health_changed``, appelons une seconde fonction ``update_health`` avec la variable ``player_health`` comme argument.
ja: ``_on_Player_health_changed`` 内で、 ``update_health`` と呼ばれる2番目の関数を呼び出して、 ``player_health`` 変数を渡します。
ko: ``_on_Player_health_changed`` 안에서, ``update_health`` 라는 두 번째 함수를 호출하고 거기에 ``player_health`` 변수를 전달하게 해봅시다.
ru: Внутри ``_on_Player_health_changed`` давайте вызовем вторую функцию под названием ``update_health`` и передадим ей переменную ``player_health``.
zh_cn: 在`_on_Player_health_changed`中，我们调用第二个函数`update_health`，并将`player_health`变量传递给它。
zh_tw: 讓我們在 ``_on_Player_health_changed`` 中呼叫第二個函式 ``update_health`` ，並代入 ``player_health`` 變數。

source: We could directly update the health value on `LifeBar` and `Number`. There are two reasons to use this method instead:
cs: Mohli bychom přímo aktualizovat hodnotu zdraví na `LifeBar` a `Number`. Existují dva důvody, proč místo toho použít tuto metodu:
de: Wir könnten den Gesundheitswert auf `LifeBar` und `Number` direkt aktualisieren. Es gibt zwei Gründe, diese Methode stattdessen zu verwenden:
es: Podríamos actualizar directamente el valor de salud en `LifeBar` y `Number`. Hay dos razones para usar este método en su lugar:
fr: On pourrait directement mettre à jour la valeur de vie dans `LifeBar` et `Number`. Il y a deux raisons pour utiliser cette fonction à la place :
ja: `LifeBar`と`Number`の体力値を直接更新できます。 代わりにこの方法を使用する理由は2つあります:
ko: 우리는 체력 값을 `LifeBar` 와 `Number` 에 직접 업데이트할 수 있습니다. 메서드를 대신 사용하는 이유는 두 가지 입니다:
pt_br: Poderíamos atualizar diretamente o valor de saúde em `LifeBar` e` Number`. Existem duas razões para usar este método:
ru: Мы можем напрямую изменить значение здоровья на `LifeBar` и `Number`. Есть две причины использовать этот метод:
zh_cn: 我们可以直接在`LifeBar`和`Number`上更新健康值。使用这种方法有两个原因:
zh_tw: 我們大可以直接在 ``LifeBar`` 與 ``Number`` 上更新生命值，但我們在這裡使用這種方法有兩個原因：

source: The name makes it clear for our future selves and teammates that when the player took damage, we update the health count on the GUI
cs: Tento název dává našim budoucím kolegům a spolupracovníkům jasně najevo, že když hráč utrpí poškození, aktualizujeme počet zdraví v grafickém uživatelském rozhraní
de: Der Name macht deutlich, dass wir, wenn der Spieler Schaden genommen hat, die Gesundheitszählung auf der Benutzeroberfläche ( GUI ) aktualisieren
es: El nombre deja claro para nuestro futuro yo y compañeros de equipo que cuando el jugador sufrió un daño, actualizamos el conteo de salud con la GUI
fr: Le nom est explicite pour nous et nos camarades sur le fait que lorsque le joueur prends un coup, nous mettons à jour le compteur de vie dans l'interface
ja: この名前は、プレイヤーがダメージを受けたときに GUI の体力(health)カウントを更新することを、将来の自分自身やチームメイトのために明確にします
ko: 플레이어가 피해를 입을 때, 이름은 체력 카운터를 업데이트 해야 하는 미래의 나와 팀원에게 그것을 명확하게 해줍니다
pt_br: O nome deixa claro para os nossos futuros eus e companheiros de equipe que, quando o jogador levou dano, nós atualizamos a contagem de saúde na GUI
ru: Название дает понять, для нашего будущего себя и напарников, что когда игрок получил урон, мы обновляем счетчик здоровья на GUI
zh_cn: 这个名字清楚地告诉我们未来的自己和队友，当游戏角色受到伤害时，我们会更新GUI的生命值
zh_tw: 函式的名稱可以讓未來的你與你的隊友們瞭解當玩家收到傷害時會更新 GUI 上的生命值

source: We will reuse this method a bit later
cs: Tuto metodu použijeme o něco později
de: Wir werden diese Methode etwas später wiederverwenden
es: Reutilizaremos este método un poco más tarde
fr: On réutilisera cette fonction plus tard
ja: この方法は少し後で再利用します
ko: 이 메서드를 나중에 다시 사용할 것입니다
pt_br: Nós vamos reutilizar este método um pouco mais tarde
ru: Мы будем использовать этот метод чуть позже
zh_cn: 稍后我们会重复使用这个方法
zh_tw: 稍後會重複使用這個方法

source: Create a new ``update_health`` method below ``_on_Player_health_changed``. It takes a new\_value as its only argument:
cs: Vytvořte novou metodu ``update_health`` pod ``_on_Player_health_changed``. Jako jediný argument přijímá hodnotu new\_value:
de: Erstellen eine neue ``update_health`` Methode unter ``_on_Player_health_changed```. Sie nimmt einen neuen\_Wert als einziges Argument:
es: Crea un nuevo método ``update_health`` debajo de ``_on_Player_health_changed``. Solo necesita new\_value como único argumento:
fr: Créer une nouvelle fonction ``update_health`` après ``_on_Player_health_changed``. Elle prends ``new\_value`` comme seul argument :
ja: ``_on_Player_health_changed`` の下に新しい ``update_health`` メソッドを作成します。唯一の引数としてnew\_valueを取ります:
ko: 새로운 ``update_health`` 메서드를 ``_on_Player_health_changed`` 아래에 만듭니다. new\_value를 유일한 인수로 갖습니다:
pt_br: Crie um novo método `` update_health`` abaixo de `` _on_Player_health_changed``. Leva um novo valor como seu único argumento:
ru: Создать новый метод ``update_health`` ниже ``_on_Player_health_changed``. В качестве единственного аргумента требуется new\_value:
zh_cn: 在`_on_Player_health_changed`下面创建一个新的`update_health`方法。它的唯一参数是一个新的\_value:
zh_tw: 在 ``_on_Player_health_changed`` 下方新增一個新的 ``update_health``方法，只接受一個 new_value 引數：

source: This method needs to:
cs: Tato metoda musí:
de: Diese Methode soll es sein:
es: Este método necesita hacer:
fr: Cette fonction a besoin de :
ja: このメソッドは以下を行う必要があります:
ko: 이 메서드에는 필요합니다:
pt_br: Este método precisa:
ru: Этот метод должен:
zh_cn: 此方法需要:
zh_tw: 這個方法需要用來：

source: set the ``Number`` node's ``text`` to ``new_value`` converted to a string
cs: nastavit ``text`` uzlu ``Number`` na ``new_value`` převedený na řetězec
de: Setzen Sie``Number`` node's ``text`` auf``new_value`` , der in eine Zeichenkette umgewandelt wird
es: establece ``text`` del nodo ``Number`` en ``new_value`` convertido en un string
fr: d'assigner ``new_value`` à la propriété ``text`` du nœud ``Number``. Il ne faut pas oublier de convertir cette valeur en chaîne de caractères
ja: ``Number`` ノードの ``text`` を文字列に変換された ``new_value`` に設定します
ko: ``Number`` 노드의 ``text`` 를 문자열로 변환된 ``new_value`` 로 설정하는 것
pt_br: setar o `` text`` do nó `` Number`` para `` new_value`` convertido para uma string
ru: задать свойству ``text`` узла ``Number`` значение ``new_value``, приведенное к строковому типу
zh_cn: 将`Number`节点的`text`设置为`new_value`转换为字符串
zh_tw: 將 ``Numebr`` 節點的 ``text`` 設為轉換為字串的 ``new_value``

source: set the ``TextureProgress``'s ``value`` to ``new_value``
cs: nastavit ``hodnotu`` ``TextureProgress`` na ``new_value``
de: setzen Sie den ``TextureProgress````value``auf ``new_value``
es: establece el ``value`` de ``TextureProgress`` en ``new_value``
fr: d'assigner ``new_value`` à la propriété ``value`` du nœud ``TextureProgress``
ja: ``TextureProgress`` の ``value`` を ``new_value`` に設定します
ko: ``TextureProgress`` 의 ``value`` 를 ``new_value`` 로 설정하는 것
pt_br: setar `` value`` do `` TextureProgress`` para `` new_value``
ru: задать свойству ``value`` узла ``TextureProgress`` значение ``new_value``
zh_cn: 将`TextureProgress`的`value`设置为`new_value`
zh_tw: 將 ``TextureProgress`` 的 ``value`` 設為 ``new_value``

source: ``str`` is a built-in function that converts about any value to text. ``Number``'s ``text`` property requires a string, so we can't assign it to ``new_value`` directly
cs: ``str`` je vestavěná funkce, která převede libovolnou hodnotu na text. Vlastnost ``text`` u ``Number`` vyžaduje řetězec, takže ji nemůžeme přiřadit přímo ``new_value``
de: ``str`` ist eine eingebaute Funktion, die etwa jeden Wert in Text umwandelt. Die ``Nummer`` ``Text``-Eigenschaft erfordert eine Zeichenkette, so dass wir sie nicht direkt ``new_value`` zuweisen können
fr: ``str`` est une fonction intégrée qui convertit une valeur en texte. La propriété ``text`` de ``Number`` n 'accepte que les chaînes de caractères, on ne peut pas assigner ``new_value`` directement
ja: ``str`` は、ほぼすべての値をテキストに変換する組み込み関数です。 ``Number`` の ``text`` プロパティには文字列が必要なので、それを ``new_value`` に直接割り当てることはできません
ko: ``str``\ 은 내장 함수로 어느 값을 문자로 변환합니다. ``Number``\ 의 ``text`` 속성은 문자열을 요구하기 때문에 ``new_value``\ 를 직접 지정할 수 없습니다
ru: ``str`` – это встроенная функция, которая преобразует значение в текст. Свойство ``text`` узла ``Number`` требует строку, поэтому мы не можем назначить его в ``new_value`` напрямую
zh_cn: ``str`` 是一个内置函数，可以将任何值转换为文本。 ``Number`` 的 ``text`` 属性需要一个字符串，所以我们不能直接将它分配给 ``new_value``
zh_tw: ``str`` 是內建的函式，用來將任何數值轉換為字串。 ``Number`` 的 ``text`` 屬性必須為一個字串，所以我們沒辦法直接將 ``new_value`` 指派給他

source: Also call ``update_health`` at the end of the ``_ready`` function to initialize the ``Number`` node's ``text`` with the right value at the start of the game. Press F5 to test the game: the life bar updates with every attack!
es: Llama también a ``update_health`` al final de la función ``_ready`` para inicializar el texto del nodo ``Number`` con el valor correcto al principio del juego. Pulsa F5 para probar el juego: ¡la barra de vida se actualiza con cada ataque!
fr: Il faut appeler notre nouvelle fonction ``update_health`` à la fin de la fonction ``_ready`` pour initialiser la propriété ``text`` dans le nœud ``Number`` avec la bonne valeur au démarrage du jeu. Lancez le jeu avec F5 : la barre de vie se met à jour à chaque attaque !
pt_br: Também chame `` update_health`` no final da função `` _ready`` para inicializar o `` text`` do nó `` Number`` com o valor correto no início do jogo. Pressione F5 para testar o jogo: a barra de vida é atualizada a cada ataque!
zh_cn: 还可以在 ``_ready`` 函数末尾调用 ``update_health`` 函数，以在游戏开始时用正确的值初始化 ``Number`` 节点的 ``text`` 。按F5测试游戏:生命条更新与每次攻击!

source: Both the Number node and the TextureProgress update when the Player takes a hit
cs: Uzel Number i TextureProgress se aktualizují, když hráč dostane zásah
de: Sowohl der Nummer-Node als auch der TextureProgress werden aktualisiert, wenn der Spieler einen Treffer erhält
es: Tanto el nodo Number como el TextureProgress se actualizan cuando el jugador recibe un golpe
fr: À chaque attaque, le nœud Number et le nœud TextureProgress (la barre de vie) se mettent à jour
ja: Playerがヒットすると、NumberノードとTextureProgressの両方が更新されます
ko: Player가 피해를 입을 때 Number 노드와 TextureProgress가 둘 다 업데이트합니다
pt_br: O nó Number e o TextureProgress são atualizados quando o Player recebe um hit
ru: Оба узла Number и TextureProgress обновляются когда игрок принимает удар
zh_cn: 当游戏角色受到攻击时，数字节点和TextureProgress都会进行更新
zh_tw: Number 與 TextureProgress 節點現在在 Player 被攻擊時都會更新了
