Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_code_a_life_bar.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, zh_cn, zh_tw

source: Why don't we directly get the ``Player`` node in the ``_process`` function and look at the health value? Accessing nodes this way creates tight coupling between them. If you did it sparingly it may work. As your game grows bigger, you may have many more connections. If you get nodes this way it gets complex quickly. Not only that: you need to listen to the state change constantly in the ``_process`` function. This check happens 60 times a second and you'll likely break the game because of the order in which the code runs.
cs: Proč nezískáme přímo uzel ``Player`` ve funkci ``_process`` a nepodíváme se na hodnotu zdraví? Přístup k uzlům tímto způsobem mezi nimi vytváří těsnou vazbu. Pokud byste to udělali střídmě, mohlo by to fungovat. Jak se vaše hra rozrůstá, můžete mít mnohem více spojení. Pokud budete uzly spojovat tímto způsobem, rychle se vše zkomplikuje. A nejen to: ve funkci ``_process`` musíte neustále naslouchat změně stavu. Tato kontrola probíhá 60krát za sekundu a pravděpodobně rozbijete hru kvůli pořadí, v jakém kód běží.
de: Warum holen wir nicht direkt den ``Player`` Node in der ``_process`` Funktion und betrachten den Health-Wert? Wenn wir auf diese Weise auf Nodes zugreifen, entsteht eine enge Kopplung zwischen ihnen. Wenn Sie es sparsam machen, kann es funktionieren. Wenn das Spiel größer wird, haben Sie möglicherweise viel mehr Verbindungen. Wenn Sie auf diese Weise Nodes erhalten, wird es schnell komplex. Nicht nur das: Sie müssen in der Funktion ``_process``` ständig auf die Zustandsänderung achten. Diese Überprüfung findet 60 Mal pro Sekunde statt und kann das Spiel verlangsamen, wenn es in einem großen Spiel mit zu vielen Verbindungen passiert.
es: ¿Por qué no buscamos directamente el nodo ``Player`` en la función ``_process`` y miramos el valor de la salud? Accediendo a los nodos de esta manera se crea un estrecho acoplamiento entre ellos. Si lo hicieras con moderación, podría funcionar. A medida que el juego crece, es posible que tengas muchas más conexiones. Si obtienes nodos de esta manera, se complica rápidamente. No sólo eso: necesitas escuchar el cambio de estado constantemente en la función ``_process``. Esta comprobación se realiza 60 veces por segundo y es probable que rompas el juego debido al orden en el que se ejecuta el código.
fr: Pourquoi n'obtenons-nous pas directement le nœud ``Player`` dans la fonction ``_process`` et regardons la valeur santé ? L'accès aux nœuds de cette façon crée un couplage étroit entre eux. Si vous l'avez fait avec parcimonie, cela peut fonctionner. Au fur et à mesure que votre jeu grossit, vous pouvez avoir beaucoup plus de connexions. Si vous obtenez des nœuds de cette façon, cela devient très complexe rapidement. Non seulement cela : vous vérifiez le changement d'état en permanence dans la fonction ``_processus``. Cette vérification se produit 60 fois par seconde et vous casserez probablement le jeu à cause de l'ordre dans lequel le code s'exécute.
ja: ``_process`` 関数内で ``Player`` ノードを直接取得し、体力値を確認するのはどうでしょう？ この方法でノードにアクセスすると、ノード間に緊密な結合ができてしまいます。これは控えめにやれば、うまくいくかもしれません。しかし、ゲームが大きくなるにつれて、より多くの接続をすることになるはずです。この方法でノードを取得して行くと、すぐに複雑になってしまいます。問題はそれだけではありません: ``_process`` 関数内で、常に他のノードの状態変化を確認する必要があります。このチェックは(60FPSのゲームなら)1秒間に60回行われ、コードには実行順序があるので恐らくゲームが中断されることになるでしょう。
ko: 왜 ``_process`` 함수에서 ``Player`` 노드를 바로 가져오지 않고 체력 값을 보죠? 그 방법으로 노드를 접근하는 것은 그들을 단단히 연결합니다. 그걸 원한다면 작동은 할 것입니다. 게임이 커질 수록, 많은 연결을 갖게 될 것입니다. 그 방법으로 노드를 가져오는 것은 복잡해질 것입니다. 그 뿐만이 아니라: 당신은 ``_process`` 함수에서 끊임없는 상태 변화를 들어야 합니다. 이 확인은 1초 당 60회이고 코드의 작동 순서 때문에 게임이 꺼질 수도 있습니다.
pt_br: Por que nós não pegamos diretamente o nó ``Player`` na função ``_process`` e olhamos o valor de saúde? Acessar nós dessa maneira cria um acoplamento firme entre eles. Se você faz isso com moderação, pode funcionar. Conforme seu jogo cresce, você pode ter muito mais conexões. Se você pegar nós dessa maneira, as coisas ficam complexas rapidamente. Não só isso: você precisa ouvir a mudança de estado constantemente na função ``_process``. Essa verificação acontece 60 vezes por segundo e você provavelmente quebrará o jogo por causa da ordem na qual o código é executado.
ru: Почему бы нам напрямую не получить узел ``Player`` в функции ``_process`` и посмотреть на значение health? Такой доступ к узлам создает между ними тесную связь. Если вы сделали это экономно, это может сработать. По мере того, как ваша игра становится больше, у вас может быть гораздо больше связей. Если вы получаете узлы таким образом, он быстро усложняется. Мало того: вам нужно постоянно слушать изменения состояния в функции ``_process``. Эта проверка происходит 60 раз в секунду, и вы, вероятно, сломаете игру из-за порядка, в котором выполняется код.
zh_cn: 我们为什么不直接在`_process`函数中获取`Player`节点并查看健康值呢?以这种方式访问节点会在节点之间产生紧密耦合。如果您少做一点，它可能会起作用。当您的游戏越来越大，您可能会有更多的连接。如果您用这种方法得到节点，它会很快变得复杂。不仅如此:您需要在`_process`函数中不断地监听状态变化。这种检查每秒进行60次，您可能会因为代码运行的顺序而中断游戏。
zh_tw: 那我們為什麼不直接在 ``_process`` 函式內取得 ``Player`` 節點然後再讀生命值呢？因為這樣直接存取節點會增加程式的耦合度。如果只是偶爾這樣寫的話或許沒什麼問題。但一旦遊戲變得更大，則代表需要建立更多的連接。若以這種方式取得節點則馬上就會讓遊戲變得很複雜。不僅如此，還必須在 ``_process`` 函式內定期追蹤狀態變化，而這個追蹤每秒都會執行 60 次，這樣很可能馬上就會因為程式執行的順序而讓遊戲壞掉。

source: On a given frame you may look at another node's property *before* it was updated: you get a value from the last frame. This leads to obscure bugs that are hard to fix. On the other hand, a signal is emitted right after a change happened. It **guarantees** you're getting a fresh piece of information. And you will update the state of your connected node *right after* the change happened.
cs: V daném snímku se můžete podívat na vlastnost jiného uzlu *před* jeho aktualizací: získáte hodnotu z posledního snímku. To vede k nepřehledným chybám, které se těžko opravují. Na druhou stranu signál je vysílán ihned poté, co ke změně došlo. To **zaručuje**, že získáváte čerstvou informaci. A vy budete aktualizovat stav připojeného uzlu *pravě* poté, co ke změně došlo.
de: Auf einem bestimmten Frame können Sie sich die Eigenschaft eines anderen Nodes ansehen, *vor dessen Aktualisierung*: Sie erhalten einen Wert aus dem letzten Frame. Dies führt zu obskuren Bugs, die schwer zu beheben sind. Mit Signalen kann man das verhindern: Ein Signal wird garantiert direkt nach der Änderung mit dem neuen Wert aufgerufen und verhindert damit diese Fehler.
es: En un determinado frame se puede ver la propiedad de otro nodo *antes* de que se actualizara: se obtiene un valor del último frame. Esto conduce a errores que son difíciles de arreglar. Por otro lado, se emite una señal justo después de que ha ocurrido un cambio. Esto **garantiza** que estás recibiendo un nuevo fragmento de información. Se actualizará el estado del nodo conectado *justo después* de que se haya producido el cambio.
fr: À une trame donnée, vous regardez potentiellement la propriété d'un autre nœud *avant* qu'il ait été mis à jour : vous obtenez une valeur de la dernière trame. Cela conduit à des bogues obscurs qui sont difficiles à corriger. D'autre part, un signal est émis juste après qu'un changement s'est produit. Cela vous **garantit** que vous obtenez des informations fraîches. Et vous mettrez à jour l'état de votre nœud connecté *directement après* que le changement se produise.
ja: 特定のフレームで、更新「前」に別のノードのプロパティを参照すると、その直前のフレームから値が取得されます。これは、修正が難しい不明瞭なバグにつながります。一方、シグナルは変化が起こった直後に発せられます。新しい情報を **確実** に入手できるのです。また、変更が行われた「直後」に、接続されたノードの状態を更新します。
ko: 특정 프레임에서 다른 노드의 속성을 업데이트 되기 *전인* 것을 볼 수 있습니다: 마지막 프레임에서 준 값을 가져옵니다. 이로 인해 수정하기 어려운 애매한 버그가 발생합니다. 반면에, 시그널은 변화가 일어난 후에 바로 방출합니다. 당신이 깔끔한 정보를 얻는다는 것을 **보증합니다** 그리고 연결한 노드의 상태가 변화가 일어난 *바로 직후* 에 업데이트 될 것입니다.
pt_br: Em um determinado quadro, você pode olhar para a propriedade de outro nó *antes* de ele ser atualizado: você obtém um valor do último quadro. Isso leva a erros obscuros que são difíceis de corrigir. Por outro lado, um sinal é emitido logo após a ocorrência de uma mudança. Isso **garante** que você está recebendo uma informação recente. E você irá atualizar o estado do seu nó conectado *logo após* a mudança acontecer.
ru: На заданном кадре вы можете увидеть свойство другого узла *до* того, как он был обновлен: вы получаете значение из последнего кадра. Это приводит к неясным ошибкам, которые трудно исправить. С другой стороны, сигнал излучается сразу после того, как произошло изменение. Это **гарантирует** вы получаете свежие данные. И вы обновите состояние вашего подключенного узла *сразу после* изменений.
zh_cn: 在给定的框架中，您可以在更新 *前* 查看另一个节点的属性:从最后一个框架中获取值。这会导致难以修复的模糊bug。另一方面，一个信号在发生变化后立即发出。它 **保证** 您得到了一个新的信息。您将在更改 *发生后* 立即更新连接节点的状态。
zh_tw: 對於特定的一幀上存取另一個節點 **更新前** 的屬性，則取得的值便是該節點上一個幀的狀態。這樣會讓 Bug 變得難以理解而且難修正。而且，訊號是在更新後才送出的，所以便能 **保證** 取得的資訊總是最新的，而且更新連接的節點的狀態時也是在改變發生後 **馬上** 進行的。

source: The Observer pattern, that signals derive from, still adds a bit of coupling between node branches. But it's generally lighter and more secure than accessing nodes directly to communicate between two separate classes. It can be okay for a parent node to get values from its children. But you'll want to favor signals if you're working with two separate branches. Read Game Programming Patterns for more information on the `Observer pattern <http://gameprogrammingpatterns.com/observer.html>`_. The `full book <http://gameprogrammingpatterns.com/contents.html>`_ is available online for free.
es: El patrón Observador, del que derivan las señales, todavía añade un poco de acoplamiento entre las ramas de los nodos. Pero generalmente es más ligero y seguro que acceder a los nodos directamente para comunicarse entre dos clases separadas. Puede estar bien que un nodo padre obtenga valores de sus hijos. Pero querrás favorecer las señales si estás trabajando con dos ramas separadas. Lee Patrones de Programación de Juegos para obtener más información sobre el patrón `Observador <http://gameprogrammingpatterns.com/observer.html>`_. El `libro completo <http://gameprogrammingpatterns.com/contents.html>`_ está disponible en línea de forma gratuita.
fr: Le patron Observateur, dont dérivent les signaux, ajoute quand même un peu de couplage entre les branches de nœuds. Mais il est généralement plus léger et plus sûr que l'accès direct aux nœuds pour communiquer entre deux classes distinctes. Il peut être acceptable pour un nœud parent d'obtenir les valeurs de ses enfants. Mais vous voudrez favoriser les signaux si vous travaillez avec deux branches distinctes. Lisez Game Programming Patterns pour plus d'informations sur `Observer pattern <http://gameprogrammingpatterns.com/observer.html>`_. Le `livre complet <http://gameprogrammingpatterns.com/contents.html>`_ est disponible en ligne gratuitement.
pt_br: O padrão Observador, de onde os sinais derivam, ainda adiciona um pouco de acoplamento entre os ramos do nó. Mas geralmente é mais leve e mais seguro do que acessar nós diretamente para se comunicar entre duas classes separadas. Pode ser bom para um nó pai obter valores de seus filhos. Mas você vai querer favorecer sinais se estiver trabalhando com dois ramos separados. Leia os Padrões de Programação de Jogos para mais informações sobre o 'Observer pattern <http://gameprogrammingpatterns.com/observer.html>' . O `livro completo <http://gameprogrammingpatterns.com/contents.html>` _ está disponível online gratuitamente.
zh_cn: 从信号派生而来的观察者模式仍然在节点分支之间添加了一些耦合。但是它通常比直接访问节点来在两个单独的类之间通信更轻、更安全。父节点可以从其子节点获取值。但是，如果您使用的是两个独立的分支，那么您会希望使用信号。在`Observer pattern <http://gameprogrammingpatterns.com/observer.html>`_ 阅读游戏编程模式以获得更多信息。`这本书 <http://gameprogrammingpatterns.com/contents.html>`_ 的全文可在网上免费获得。

source: With this in mind, let's connect the ``GUI`` to the ``Player``. Click on the ``Player`` node in the scene dock to select it. Head down to the Inspector and click on the Node tab. This is the place to connect nodes to listen to the one you selected.
cs: S tímto vědomím připojíme ``GUI`` k ``Player``. Klikněte na uzel ``Player`` v doku scény a vyberte jej. Přejděte do Inspectoru a klikněte na kartu Uzel. Zde se nachází místo pro připojení uzlů naslouchajících tomu, který jste vybrali.
de: In diesem Sinne verbinden wir das ``GUI`` mit dem ``Player``. Klicke auf den Node ``Player`` im Szene-Fenster, um ihn auszuwählen. Gehen Sie zum Inspektor und klicken Sie auf das Fenster "Node". Dies ist der Ort, an dem man Nodes verbinden kann, um den von Ihnen ausgewählten Node anzuhören.
fr: Dans cette optique, connectons le nœud ``GUI`` à ``Player``. Cliquez sur le nœud ``Player`` dans le dock de scène pour le sélectionner. Dirigez-vous vers l'inspecteur et cliquez sur l'onglet Nœud. C'est l'endroit où connecter les nœuds, pour écouter celui que vous avez sélectionné.
ja: これを念頭に置いて、 ``GUI`` を ``Player`` に接続しましょう。まずシーンドックの ``Player`` ノードをクリックして選択します。インスペクタに移動し、「ノード」タブをクリックします。ここは、選択したノードからのシグナルを受信待機させるために、ノードを接続する場所です。
ko: 이것을 염두해두고 ``GUI`` 를 ``Player``\ 에 연결합시다. 씬 독에서 ``Player`` 노드를 클릭하여 선택합니다. 인스펙터(Inspecter)에서 노드(Node) 탭을 클릭합니다. 여기가 당신이 선택한 시그널을 받기 위해 노드를 연결하는 곳입니다.
ru: С учетом этого давайте подключим ``GUI`` к ``Player``. Щелкните на узле ``Player`` в панели сцен, чтобы выбрать его. Направляйтесь а инспектор и нажмите на вкладку Узел. Здесь подключаются узлы для прослушивания.
zh_cn: 考虑到这一点，让我们将`GUI`连接到`Playe`。点击场景面板中的`Player`节点来选择它。转到属性面板，单击Node选项卡。这是连接节点侦听所选节点的地方。
zh_tw: 瞭解到這點後，我們來將 ``GUI`` 連接到 ``Player`` 上。在場景 Dock 中點擊 ``Player`` 來選擇，然後到屬性面板點擊節點分頁。這裡就是用來連接節點以及監聽所選節點的地方。

source: The first section lists custom signals defined in ``Player.gd``:
cs: První část obsahuje seznam vlastních signálů definovaných v souboru ``Player.gd``:
de: Der erste Abschnitt listet benutzerdefinierteSignale in ``Player.gd`` auf:
es: La primera sección enlista las señales personalizadas definidas en ``Player.gd``:
fr: La première section énumère les signaux personnalisés définis dans ``Player.gd`` :
ja: 最初のセクションでは、 ``Player.gd`` で定義されているカスタムシグナルを一覧表示します:
ko: 첫 번째 섹션은 ``Player.gd`` 에 정의된 맞춤 시그널 목록입니다:
pt_br: A primeira seção lista os sinais personalizados definidos em `` Player.gd``:
ru: В первом разделе перечислены пользовательские сигналы, определенные в ``Player.gd``:
zh_cn: 第一部分列出了在`Player.gd`中定义的自定义信号:
zh_tw: 第一個部分列出了 ``Player.gd`` 內定義的自定訊號：

source: ``died`` is emitted when the character died. We will use it in a moment to hide the UI.
cs: ``died`` je emitován, když postava zemřela. Za chvíli ji použijeme ke skrytí uživatelského rozhraní.
de: ``died`` wird angezeigt wenn der Charakter stirbt. Wir werden dies in einem Moment verwenden um die UI zu verbergen.
es: ``died`` se emite cuando el personaje muere. Lo usaremos en un momento para ocultar la UI.
fr: ``died`` est émis quand le personnage vient de mourir. Nous l'utiliserons dans un moment pour cacher l'interface utilisateur.
ja: キャラクターが死んだときには ``died`` が出力されます。 このシグナルは後で、UIを非表示にするために使用します。
ko: ``died`` 는 캐릭터가 죽었을 때 방출합니다. 이것은 UI를 감추는 순간에 사용할 것입니다.
pt_br: ``died`` ("morreu") é emitido quando o personagem morre. Vamos usá-lo em um momento para esconder a interface do usuário.
ru: ``died`` излучает сигнал, когда персонаж умер. Мы будем использовать его для скрытия интерфейса.
zh_cn: `died`在角色死亡时发出。我们稍后将使用它来隐藏UI。
zh_tw: ``died`` 會在角色死亡時送出。我們稍後會用這個訊號來隱藏 UI。

source: ``health_changed`` is emitted when the character got hit.
cs: ``health_changed`` je emitován, když postava dostane zásah.
de: ``health_changed`` wird angezeigt wenn der Charakter getroffen wird.
es: ``health_changed`` se emite cuando el personaje es golpeado.
fr: ``health_changed`` est émis lorsque le personnage a été touché.
ja: ``health_changed`` は、キャラクタがヒットを受けたときに放出されます。
ko: ``health_changed`` 는 캐릭터가 피해를 입었을 때 방출됩니다.
pt_br: `` health_changed`` é emitido quando o personagem é atingido.
ru: ``health_changed`` излучает, когда персонаж получил урон.
zh_cn: `health_changed`在角色被击中时发出。
zh_tw: ``health_changed`` 會在角色受到攻擊時送出。

source: We're connecting to the health\_changed signal
cs: Připojujeme se k signálu health\_changed
de: Wir verbinden das health_changed Signal
es: Nos estamos conectando a la señal health\_changed
fr: On se connecte au signal health\_changed
ja: これから「health\_changed」シグナルに接続します
ko: 우리는 health\_changed 시그널을 연결합니다
pt_br: Estamos nos conectando ao sinal health\_changed
ru: Мы соединимся с сигналом health\_changed
zh_cn: 我们连接到health\_changed信号
zh_tw: 我們現在要連接的是 health\_changed 訊號

source: Select ``health_changed`` and click on the Connect button in the bottom right corner to open the Connect Signal window. On the left side you can pick the node that will listen to this signal. Select the ``GUI`` node. The right side of the screen lets you pack optional values with the signal. We already took care of it in ``Player.gd``. In general I recommend not to add too many arguments using this window as they're less convenient than doing it from the code.
cs: Vyberte položku ``health_changed`` a kliknutím na tlačítko Connect v pravém dolním rohu otevřete okno Connect Signal. Na levé straně můžete vybrat uzel, který bude tento signál poslouchat. Vyberte uzel ``GUI``. V pravé části obrazovky můžete k signálu přibalit volitelné hodnoty. O to jsme se již postarali v souboru ``Player.gd``. Obecně doporučuji nepřidávat příliš mnoho argumentů pomocí tohoto okna, protože to je méně pohodlné než přidávání v kódu.
de: Wählen Sie ``health_changed`` aus und klicken auf "Connect" unten rechts im Fenster um das "Signal Verbinden"-Fenster zu öffnen. Links können Sie den Node auswählen, der auf das Signal reagieren soll. Wählen Sie hier den ``GUI``-Node aus. Rechts können Sie zusätzliche Werte auswählen, die mit dem Signal gesendet werden sollen. Wir haben uns allerdings bereits in ``Player.gd`` darum gekümmert. Ich empfehle Ihnen, vor allem bei mehreren Argumenten, die Argumente lieber im Code als in diesem Fenster zu definieren, da es im Code einfacher ist.
es: Selecciona ``health_changed`` y haz clic en el botón Conectar situado en la esquina inferior derecha para abrir la ventana Contectando señal. En el lado izquierdo puedes elegir el nodo que escuchará esta señal. Selecciona el nodo ``GUI``. El lado derecho de la pantalla permite agrupar valores opcionales con la señal. Ya nos encargamos de ello en ``Player.gd`. En general se recomienda no añadir demasiados argumentos usando esta ventana ya que son menos convenientes que hacerlo desde el código.
fr: Sélectionnez ``health_changed`` et cliquez sur le bouton Connecter dans le coin inférieur droit pour ouvrir la fenêtre Connecter un signal. Sur le côté gauche, vous pouvez choisir le nœud qui écoutera ce signal. Sélectionnez le nœud ``GUI``. Le côté droit de l'écran vous permet d'ajouter des valeurs optionnelles avec le signal. Nous nous en sommes déjà occupés dans ``player.GD``. En général, je recommande de ne pas ajouter trop d'arguments en utilisant cette fenêtre car ils sont moins pratiques que ceux ajouter à partir du code.
ja: ``health_changed`` を選択し、右下隅の「接続」ボタンをクリックして、「シグナルの接続」ウィンドウを開きます。左側で、この信号を受信待機するノードを選択できます。 ``GUI`` ノードを選択します。画面の右側にて、オプションの値を信号に加えることができます。これについては、すでに ``Player.gd`` 内で済ませてあります。コード内にて行うよりも不便なので、このウィンドウを使うなら、通常は引数を追加しすぎないようにすることをお勧めします。
ko: ``health_changed`` 를 선택하고 오른쪽 아래 연결하기 버튼을 누르고 시그널 연결 창을 엽니다. 왼쪽에서 이 시그널을 듣는 노드를 선택할 수 있습니다. ``GUI`` 노드를 선택합니다. 화면 오른쪽은 시그널과 함께 선택적인 값을 보낼 수 있습니다. 우리는 이것을 이미 ``Player.gd`` 에서 다루었습니다. 일반적으로 저는 코딩보다 덜 편리하므로 이 창으로 너무 많은 인수를 추가하지 않기를 권장합니다.
pt_br: Selecione ``health_changed`` e clique no botão Conectar no canto inferior direito para abrir a janela Conectar Sinal. No lado esquerdo, você pode escolher o nó que escutará este sinal. Selecione o nó ``GUI``. O lado direito da tela permite empacotar valores opcionais com o sinal. Nós já cuidamos disso em ``Player.gd``. Em geral, eu recomendo não adicionar muitos argumentos usando esta janela, já que eles são menos convenientes do que fazer a partir do código.
ru: Выберите ``health_changed`` и кликните на кнопку "Присоединить" в правом нижнем углу, чтобы открыть окно Соединения Сигнала. На левой стороне вы можете выбрать узел, который будет слушать этот сигнал. Выберите узел ``GUI``. Правая сторона экрана позволит вам добавить дополнительные значения к сигналу. Мы уже позаботились об этом в ``Player.gd``. В целом, я рекомендую не добавлять слишком много аргументов, используя это окно, так как делать это в нем менее удобно, чем в коде.
zh_cn: 选择`health_changed`，然后单击右下角的Connect按钮，打开Connect信号窗口。在左侧，您可以选择监听此信号的节点。选择`GUI`节点。屏幕的右侧允许您将可选值与信号打包。我们已经在`Player.gd`中处理过了。一般来说，我建议不要使用这个窗口添加太多的参数，因为它们比从代码中添加更不方便。
zh_tw: 先選擇 ``health_changed`` 然後點擊右下角的連接按鈕便會打開連接訊號視窗。視窗的左側可以選擇要監聽訊號的節點，這裡選 ``GUI`` 節點。視窗的右邊則可以選擇訊號送出時要一併送出的可選值，但這個我們已經在 ``Player.gd`` 內處理了。通常來說我不建議在這個視窗內增加太多的引數，因為從程式碼內來做會比較方便。

source: The Connect Signal window with the GUI node selected
cs: Okno Připojit signál s vybraným uzlem GUI
de: Das "Connect Signal"-Fenster mit der ausgewählten GUI Node
es: La ventana Conectando Señal con el nodo GUI seleccionado
fr: La fenêtre Connecter un signal avec le nœud GUI sélectionné
ja: GUIノードが選択された「シグナル接続」ウィンドウ
ko: GUI 노드가 선택된 시그널 연결 창
pt_br: A janela Conectar Sinal com o nó GUI selecionado
ru: Окно подключения сигнала с выбранным узлом GUI
zh_cn: 选择GUI节点的连接信号窗口
zh_tw: 選擇了 GUI 節點的連接訊號視窗

source: You can optionally connect nodes from the code. However doing it from the editor has two advantages:
cs: Uzly můžete volitelně připojit i z kódu. Provádění z editoru má však dvě výhody:
de: Man kann Signale auch im Code verbinden. Im Editor hat man aber 2 Vorteile:
es: Opcionalmente se pueden conectar nodos desde el código. Pero hacerlo desde el editor tiene dos ventajas:
fr: Vous pouvez éventuellement connecter des nœuds à partir du code. Mais le faire à partir de l'éditeur a deux avantages :
ja: 必要に応じて、コード内でノードを接続できます。ただし、エディタから実行することには次の利点2つがあります:
ko: 선택적으로 코드로부터 노드를 연결할 수 있습니다. 하지만 편집기로 하면 두 가지 이점이 있습니다:
pt_br: Opcionalmente você pode conectar nós do código. Mas fazê-lo do editor tem duas vantagens:
ru: При необходимости можно подключить узлы из кода. Однако подключение из редактора имеет два преимущества:
zh_cn: 您可以选择从代码中连接节点。然而，编辑这样做有两个好处:
zh_tw: 另外也可以使用程式碼來連接訊號，但通過編輯器來連接有兩個好處：

source: Godot can write new callback functions for you in the connected script
cs: Godot za vás může v připojeném skriptu napsat nové funkce pro obsloužení signálu
de: Godot kann automatisch Funktionen in dem Script erstellen, mit dem es verbunden ist
es: Godot puede escribir nuevas funciones de devolución de llamada para ti en el script conectado
fr: Godot peut écrire de nouvelles fonctions de rappel pour vous dans le script connecté
ja: Godotはあなたに代わって、接続されたスクリプト内に新しいコールバック関数を書けます
ko: Godot는 연결된 스크립트에서 새 콜백 함수를 쓸 수 있습니다
pt_br: Godot pode escrever novas funções de retorno de chamada para você no script conectado
ru: Godot может написать новые функции обратного вызова для вас в подключенном скрипте
zh_cn: Godot可以在连接的脚本中为您编写新的回调函数
zh_tw: Godot 在連接的腳本上幫你寫一個新的回呼函式

source: An emitter icon appears next to the node that emits the signal in the Scene dock
cs: Vedle uzlu, který vysílá signál, se v doku scény zobrazí ikona emitoru
de: Ein "Emitter"-Icon erscheint neben der Node im Szenen-Fenster
es: Aparece un icono en forma de emisor junto al nodo que emite la señal en el panel de Escenas
fr: Une icône d'émetteur apparaît à côté du nœud qui émet le signal dans le dock de scène
ja: シーンドック内で、信号を発信するノードの横に発信元アイコンが表示されます
ko: 씬 독에서 시그널을 방출하는 노드 옆에 방출 아이콘이 나타납니다
pt_br: Um ícone de emissor aparece próximo ao nó que emite o sinal no painel Cena
ru: Рядом с узлом, который излучает сигнал в панели сцен, появился значок эмиттера
zh_cn: 一个发射器图标出现在场景基座中发出信号的节点旁边
zh_tw: 發送訊號的圖示會在場景 Dock 中顯示在送出訊號的節點旁邊
