Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_game_user_interface.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Let's create a new inherited scene, and once again select the ``Bar.tscn`` scene and open it. Double-click on the ``Bar`` root node and rename it to ``EnergyBar``. Save the new scene as ``EnergyBar.tscn``. We need to replace the HP texture with EP one, and to change the textures on the gauge.
cs: Vytvoříme novou zděděnou scénu a opět jako základ vybereme scénu ``Bar.tscn`` a otevřeme ji. Poklepejte na kořenový uzel ``Bar`` a přejmenujte jej na ``EnergyBar``. Novou scénu uložte jako ``EnergyBar.tscn``. Potřebujeme nahradit texturu HP texturou EP a změnit textury na měřidle.
de: Erstellen wir nun eine neue vererbte Szene, und noch einmal selektieren wir die "Bar.tscn" Szene und öffnen es. Mit einem Doppelklick auf "Bar" ändern wir den Namen zu "EnergyBar". Nun speichern wir die Szene als "EnergyBar.tscn". Jetzt müssen wir die HP Textur ändern mit dem EP, und wir ändern es zu der Textur auf der Anzeige.
es: Vamos a crear una nueva escena heredada, y una vez más selecciona la escena ``Bar.tscn`` y ábrela. Haz doble clic en el nodo raíz ``Bar`` y renómbralo a ``EnergyBar``. Guarda la nueva escena como ``EnergyBar.tscn``. Necesitamos reemplazar la textura HP por EP one, y cambiar las texturas en el medidor.
fr: Créons une nouvelle scène héritée, sélectionnons à nouveau la scène ``Bar.tscn`` et ouvrons-la. Double-cliquez sur le nœud racine ``Bar`` et renommez-le en ``EnergyBar``. Sauvegardez la nouvelle scène sous le nom ``EnergyBar.tscn``. Nous devons remplacer la texture HP par une texture EP, et changer les textures sur la jauge.
ja: 新しい継承シーンを作成して、もう一度 ``Bar.tscn`` シーンを選択して開きます。 ``Bar`` ルートノードをダブルクリックして ``EnergyBar`` に名前を変更してください。 新しいシーンを ``EnergyBar.tscn`` という名前で保存します。次に必要なのは、HPのテクスチャをEPに置き換えることと、ゲージのテクスチャを変更することです。
ko: 새 상속 씬을 만듭시다. 그리고 다시 한번, ``Bar.tscn`` 씬을 선택하고 여세요. ``Bar`` 루트 노드를 더블클릭하고, 이름을 ``EnergyBar``\ 로 바꾸세요. 새 씬을 ``EnergyBar.tscn``\ 으로 저장하세요. HP 텍스처를 EP로 교체해야 하고, 게이지의 텍스처를 바꿔야 합니다.
pt_br: Vamos criar uma nova cena herdada e, mais uma vez, selecionar a cena ``Bar.tscn`` e abri-la. Clique duas vezes no nó raiz ``Bar`` e renomeie-o para ``EnergyBar``. Salve a nova cena como ``EnergyBar.tscn``. Precisamos substituir a textura HP por uma EP e mudar as texturas no medidor.
ru: Давайте создадим новую унаследованную сцену и еще раз выбираем сцену ``Bar.tscn`` и откроем ее. Дважды щелкните на корневой узел ``Bar`` и переименуйте его в ``EnergyBar``. Сохраните новую сцену как ``EnergyBar.tscn``. Мы должны заменить текстуру HP на EP, и изменить текстуры на шкале.
uk: Давайте створимо нову успадковану сцену та ще раз виберемо сцену ``Bar.tscn`` і відкриємо її. Двічі клацніть на кореневому вузлі ``Bar`` та перейменуйте його на ``EnergyBar``. Збережіть нову сцену як ``EnergyBar.tscn``. Нам потрібно замінити текстуру HP на EP та змінити текстури на показнику.
zh_cn: 让我们创建一个新的继承场景, 然后再次选择 ``Bar.tscn`` 场景并将其打开. 双击 ``Bar`` 根节点, 并将其重命名为 ``EnergyBar``. 保存新场景为 ``EnergyBar.tscn``. 我们需要用 ``EP`` 的纹理替换 ``HP`` 纹理, 并更改量规上的纹理.
zh_tw: 先建立繼承場景。打開 ``Bar.tscn`` ，然後在根節點 ``Bar`` 上點兩下並重新命名為 ``EnergyBar`` ，保存新場景為 ``EnergyBar.tscn`` 。然後我們要把 HP 紋理貼圖改成 EP 的貼圖，並更改計量槽的貼圖。

source: Head to the FileSystem dock on the left, select the ``Title`` node in the Scene tree and drag and drop the ``label_EP.png`` file onto the texture slot. Select the ``Number`` node and change the ``Text`` property to a different value like ``14``.
cs: Přejděte do doku FileSystem vlevo, ve stromu scén vyberte uzel ``Title`` a přetáhněte soubor ``label_EP.png`` do slotu pro texturu. Vyberte uzel ``Number`` a změňte vlastnost ``Text`` na jinou hodnotu, například ``14``.
de: Gehen Sie zum Filesystem dock.
es: Dirígete al panel del Sistema de Archivos a la izquierda, selecciona el nodo ``Title`` en el árbol de Escenas y arrastra y suelta el archivo ``label_EP.png`` en la ranura de texturas. Selecciona el nodo ``Number`` y cambia la propiedad ``Text`` a un valor diferente como ``14``.
fr: Dirigez-vous vers le dock Système de fichiers sur la gauche, sélectionnez le nœud ``Title`` dans l'arbre de scène et glissez-déposez le fichier ``label_EP.png`` sur l'emplacement de texture. Sélectionnez le nœud ``Number`` et changez la propriété ``Text`` à une valeur différente, comme ``14``.
ja: 左側のファイルシステム ドックに進み、シーンツリーの ``Title`` ノードを選択して、 ``label_EP.png`` ファイルをテクスチャ スロットにドラッグ＆ドロップします。 ``Number`` ノードを選択し、 ``Text`` プロパティを ``14`` のような別の値に変更します。
ko: 왼쪽의 파일 시스템(FileSystem) 독으로 가세요. 씬 트리에서 ``Title`` 노드를 선택하고 텍스처 슬롯으로 ``laber_EP.png`` 파일을 드래그 앤 드롭하세요. ``Number`` 노드를 선택하고 ``Text`` 속성을 ``14``\ 로, 혹은 그 외 기존과 다른 값으로 바꾸세요.
pt_br: Dirija-se à aba FileSystem à esquerda, selecione o nó ``Title`` na árvore Scene e arraste e solte o arquivo ``label_EP.png`` no slot de texturas. Selecione o nó ``Number`` e mude a propriedade ``Text`` para um valor diferente como ``14``.
ru: Направляйтесь к панели файловой системы слева, выберите узел ``Title`` в дереве сцены и перетащите файл ``label_EP.png`` на слот текстуры(texture). Выберите узел ``Number`` и измените его свойство ``Text`` на другое значение, например ``14``.
uk: Перейдіть до панелі Файлова система, виберіть вузол ``Title`` у дереві сцени та перетягніть файл ``label_EP.png`` в гніздо текстури. Виберіть вузол ``Number`` і змініть властивість ``Text`` на інше значення, наприклад ``14``.
zh_cn: 转到左侧的 ``FileSystem`` 停靠面板, 在场景树中选择 ``Title`` 节点, 然后将 ``label_EP.png`` 文件拖放到纹理插槽中. 选择 ``Number`` 节点, 然后将 ``Text`` 属性更改为另一个值, 例如 ``14``.
zh_tw: 在場景樹中選擇 ``Title`` 節點，並到左邊的檔案系統 Dock 中將 ``label_EP.png`` 拖曳到紋理貼圖槽內。選擇 ``Number`` 節點並將 ``Text`` 屬性設為不同的值，如 ``14`` 。

source: You'll notice the EP texture is smaller than the HP one. We should update the ``Number``'s font size to better fit it. A font is a resource. All the nodes in the entire project that use this resource will be affected by any property we change. You can try to change the size to a huge value like ``40`` and switch back to the ``LifeBar`` or the ``Bar`` scenes. You will see the text increased in size.
cs: Všimněte si, že textura EP je menší než textura HP. Měli bychom aktualizovat velikost písma ``Number``, aby lépe odpovídalo. Písmo je zdroj. Všechny uzly v celém projektu, které tento zdroj používají, budou ovlivněny jakoukoli změnou vlastností tohoto zdroje. Můžete zkusit změnit jeho velikost na obrovskou hodnotu, například ``40``, a přepnout zpět na scény ``LifeBar`` nebo ``Bar``. Uvidíte, že se velikost textu všude zvětšila.
de: Sie werden feststellen, dass die EP-Textur wesentlich kleiner aussieht als die HP-Textur. Die Größe der Schrift vom ``Nummer``-Knoten sollte angepasst werden. Eine Schrift ist eine Ressource und alle Knoten im gesamten Projekt, die diese Ressource verwenden, werden durch Änderungen der Eigenschaften beeinflusst. Sie können diesen Effekt sehen, in dem Sie die Größe auf einen riesigen Wert wie ``40`` ändern und zurück zur ``Lebensleiste`` oder zur ``Leisten``-Szene wechseln.
es: Notarás que la textura EP es más pequeña que la de HP. Deberíamos actualizar el tamaño de la fuente de ``Number`` para que se ajuste mejor a éste. Una fuente es un recurso. Todos los nodos de todo el proyecto que utilicen este recurso se verán afectados por cualquier propiedad que cambiemos. Puedes intentar cambiar el tamaño a un valor enorme como ``40`` y volver a las escenas ``LifeBar`` o ``Bar``. Verás que el texto aumenta de tamaño.
fr: Vous remarquerez que la texture EP est plus petite que la texture HP. Nous devrions mettre à jour la taille de police de ``Number`` pour mieux l'adapter. Une police est une ressource. Tous les nœuds de l'ensemble du projet qui utilisent cette ressource seront affectés par toute propriété que nous modifions. Vous pouvez essayer de changer la taille à une valeur énorme comme ``40`` et revenir aux scènes ``LifeBar`` ou ``Bar``. Vous verrez que la taille du texte a augmenté.
ja: EPテクスチャがHPテクスチャよりも小さいことがわかります。 ``Number`` のフォントサイズを適切なサイズに更新する必要があります。フォントはリソースです。このリソースを使用する、プロジェクト内にあるすべてのノードは、あらゆるプロパティ変更による影響を受けます。フォントサイズを ``40`` などの大きな値に変更してから、 ``LifeBar`` または ``Bar`` のシーンに戻ってみてください。テキストのサイズが大きくなっています。
ko: EP 텍스처가 HP보다 더 작은 것을 눈치챘을 것입니다. 텍스처에 맞도록 ``Number``\ 의 폰트 크기를 업데이트해야 합니다. 폰트는 리소스입니다. 전체 프로젝트에 있는 노드 중 이 리소스를 사용하고 있는 노드는 이 리소스의 속성을 바꾼 것에 영향을 받게 될 것입니다. 한번 Size를 ``40``\ 과 같은 큰 값으로 바꾸고 ``LifeBar``\ 나 ``Bar`` 씬으로 돌아가보세요. 문자 크기가 커진 것을 볼 수 있습니다.
pt_br: Você notará que a textura do EP é menor que a da HP. Devemos atualizar o tamanho da fonte do ``Number`` para melhor ajustá-lo. Uma fonte é um recurso. Todos os nós em todo o projeto que usam esse recurso serão afetados por qualquer propriedade que mudarmos. Você pode tentar mudar o tamanho para um valor enorme como ``40`` e voltar para as cenas ``LifeBar`` ou ``Bar``. Você verá o texto aumentar de tamanho.
ru: Вы заметите, что текстура EP меньше, чем HP. Мы должны обновить размер шрифта у ``Number'ов``, чтобы он был более подходящим. Шрифт — это ресурс. Все узлы во всем проекте, в которых используется этот ресурс, будут затронуты любым изменяемым свойством. Вы можете изменить размер на огромное значение, к примеру ``40`` и переключитесь обратно в сцену ``LifeBar`` или ``Bar``. Вы увидите, что текст увеличился в размерах.
uk: Ви помітите, що текстура EP менша, ніж у HP. Ми повинні оновити розмір шрифту ``Number``, щоб він краще підходив. Шрифт - це ресурс. На всі вузли у всьому проєкті, які використовують цей ресурс, впливатиме будь-яка властивість, яку ми змінимо. Ви можете спробувати змінити розмір на величезне значення , наприклад ``40`` і повернувшись назад на ``LifeBar``, або в сцену ``Bar``. Ви побачите, що текст збільшився в розмірі.
zh_cn: 你会注意到 ``EP`` 纹理比 ``HP`` 纹理小. 我们应该更新 ``Number`` 的字体大小以更好地适应它. 字体是一种资源. 使用此资源的整个项目中的所有节点都将受到我们更改的任何属性的影响. 你可以尝试将大小更改为较大的值, 例如 ``40``, 然后切换回 ``LifeBar`` 或 ``Bar`` 场景. 你将看到文本的大小增加了.
zh_tw: 你會注意到 EP 的貼圖比 HP 的貼圖還來得小。這裡我們應該要一併更新 ``Number`` 的字體大小來配合貼圖。字體屬於資源，一旦我們修改了資源的屬性，整個專案中所有用到了相同資源的節點都會被影響。你可以試試看把字體大小改為一個大點的數字如 ``40`` ，然後切換回去 ``LifeBar`` 或是 ``Bar`` 場景，就會發現文字大小跟著變大了。

source: If we change the font resource, all the nodes that use it are affected
cs: Pokud změníme zdroj písma, ovlivní to všechny uzly, které ho používají
de: Wenn wir den Ort ändern, von der die Schriftart stammt, hat dies Auswirkungen auf alle Nodes, die sie verwenden
es: Si cambiamos el recurso fuente, todos los nodos que lo usan se ven afectados
fr: Si nous changeons la ressource de police, tous les nœuds qui l'utilisent seront affectés
ja: フォントリソースを変更すると、それを使用するすべてのノードが影響を受けます
ko: 폰트 리소스를 바꾸게 되면, 이 리소스를 사용하는 모든 노드가 영향을 받습니다
pt_br: Se alterarmos o recurso de fonte, todos os nós que a usam serão afetados
ru: Если мы изменим ресурс шрифта, все используемые им узлы будут затронуты
uk: Зміни в ресурсі шрифту вплинуть на всі вузли, які ним користуються
zh_cn: 如果我们更改字体资源, 则使用该字体资源的所有节点都会受到影响
zh_tw: 如果修改了字體資源，所有使用到該字體的節點都會被影響

source: To change the font size on this node only, we must create a copy of the font resource. Select the ``Number`` node again and click on the wrench and screwdriver icon on the top right of the inspector. In the drop-down menu, select the ``Make Sub-Resources Unique`` option. Godot will find all the resources this node uses and create unique copies for us.
cs: Chceme-li změnit velikost písma pouze v tomto uzlu, musíme vytvořit lokální kopii písma pro tento uzel. Vyberte opět uzel ``Number`` a klikněte na ikonu klíče a šroubováku v pravém horním rohu Inspektora. V rozevírací nabídce vyberte možnost ``Make Sub-Resources Unique``. Godot vyhledá všechny zdroje, které tento uzel používá, a vytvoří pro nás jejich lokální kopie.
de: Um die Schriftgröße nur für diesen Knoten zu ändern, muss eine Kopie der Schriftressource angelegt werden. Wählen Sie dazu den ``Nummer``-Knoten aus und klicken Sie auf das Schraubenschlüssel-Icon in der oberen, rechten Ecke des Inspektors. Im Aufklappmenü den Punkt ``Unter-Ressource einzigartig machen`` auswählen. Godot findet nun alle Ressourcen, die von diesem Knoten verwendet werden und erstellt einzigartige Kopien.
es: Para cambiar el tamaño de la fuente en este nodo solamente, debemos crear una copia del recurso de fuente. Selecciona nuevamente el nodo ``Number`` y haz clic en el icono con forma de llave inglesa y destornillador en la parte superior derecha del inspector. En el menú desplegable, selecciona la opción ``Creación de Subrecursos Únicos``. Godot encontrará todos los recursos que este nodo utiliza y creará copias únicas para nosotros.
fr: Pour changer la taille de police sur ce nœud uniquement, nous devons créer une copie de la ressource de police. Sélectionnez à nouveau le nœud ``Number`` et cliquez sur l'icône de la clé à molette et du tournevis en haut à droite de l'inspecteur. Dans le menu déroulant, sélectionnez l'option ``Rendre les sous-ressources uniques``. Godot trouvera toutes les ressources que ce nœud utilise et créera des copies uniques pour nous.
ja: このノードのフォントサイズだけを変更するには、フォントリソースのコピーを作成する必要があります。 ``Number`` ノードを再度選択し、インスペクタの右上にあるレンチとドライバのアイコンをクリックします。ドロップダウンメニューから ``サブリソースをユニーク化する`` を選択します。このノードが使用するすべてのリソースを検索し、固有のコピーを作成します。
ko: 이 노드에서만 폰트 크기를 바꾸도록 하려면, 폰트 리소스의 사본을 만들어야 합니다. ``Number`` 노드를 다시 선택하고, 인스펙터(Inspector)의 오른쪽 상단에 있는 렌치와 스크루드라이버 아이콘을 클릭하세요. 드롭다운 메뉴에서 ``하위 리소스를 유일하게 만들기(Make Sub-Resources Unique)``\ 를 선택하세요. Godot는 이 노드에서 사용하는 모든 리소스를 찾아서 유일한 사본을 만들어 줄 것입니다.
pt_br: Para alterar o tamanho da fonte apenas neste nó, devemos criar uma cópia do recurso de fonte. Selecione o nó ``Number`` novamente e clique no ícone de chave inglesa e chave de fenda no canto superior direito do inspetor. No menu suspenso, selecione a opção ``Tornar Únicos os Sub-recursos``. O Godot encontrará todos os recursos que este nó usa e criará cópias exclusivas para nós.
ru: Чтобы изменить размер шрифта только на этом узле, необходимо создать копию ресурса шрифта. Снова выберите узел ``Number`` и нажмите на значок гаечного ключа и отвертки в правом верхнем углу инспектора. В раскрывающемся меню выберите опцию ``Сделать вложенные ресурсы уникальным``. Godot найдет все ресурсы, которые использует этот узел, и создаст для нас уникальные копии.
uk: Щоб змінити розмір шрифту лише на цьому вузлі, ми повинні створити копію ресурсу шрифту. Виберіть вузол ``Number`` і натисніть на значок гайкового ключа та викрутки у верхньому правому куті інспектора. У спадному меню виберіть параметр ``Зробити суб-ресурси унікальними``. Godot знайде всі ресурси, якими користується цей вузол, і створить для нас унікальні копії.
zh_cn: 要仅在此节点上更改字体大小, 我们必须创建字体资源的副本. 再次选择 ``Number`` 节点, 并点击属性检查器面板右上角的扳手和螺丝刀图标. 在下拉菜单中, 选择 ``使子资源唯一(Make Sub-Resources Unique)`` 选项.Godot将找到该节点使用的所有资源, 并为我们创建唯一的副本.
zh_tw: 如果我們想讓字體大小的修改只作用在這個節點，則必須要把字體資源複製出來。選擇 ``Number`` 節點並點擊屬性面板右上角的扳手與螺絲起子圖示，並在下拉選單中選擇 ``獨立化子資源`` 。Godot 會找出所有這個節點使用的資源，並建立獨立的拷貝。

source: Use this option to create unique copies of the resources for one node
cs: Tato možnost slouží k vytvoření lokálních kopií prostředků pro jeden uzel
de: Benutze diese Option um einzelne Kopien von den Resourcen einer Node zu erstellen
es: Utiliza esta opción para crear copias únicas de los recursos para un nodo
fr: Utilisez cette option pour créer des copies uniques des ressources pour un nœud
ja: このオプションを使用すると、1つのノードのためにリソースをコピーしてその固有版を作成します
ko: 이 설정을 사용해서 한 노드를 위한 유일한 리소스 사본을 만들었습니다
pt_br: Use esta opção para criar cópias exclusivas dos recursos para um nó
ru: Используйте этот параметр для создания уникальных копий ресурсов для одного узла
uk: Використовуйте цей параметр для створення унікальних копій ресурсів для одного вузла
zh_cn: 使用此选项为一个节点创建资源的唯一副本
zh_tw: 使用這個選項來為單一節點建立獨立的資源拷貝

source: When you duplicate a node from the Scene tree, with :kbd:`Ctrl + D` (:kbd:`Cmd + D` on macOS), it shares its resources with the original node. You need to use ``Make Sub-Resources Unique`` before you can tweak the resources without affecting the source node.
cs: Pokud duplikujete uzel ze stromu scén pomocí :kbd:`Ctrl + D` (:kbd:`Cmd + D` v systému MacOS), sdílí své prostředky s původním uzlem. Než budete moci přizpůsobit zdroje, aniž byste ovlivnili uzel zdrojový , musíte použít ``Make Sub-Resources Unique``.
es: Cuando duplicas un nodo del árbol de Escenas, con :kbd:`Ctrl + D` (:kbd:`Cmd + D` en macOS), comparte sus recursos con el nodo original. Necesitas utilizar ``Creación de Subrecursos Únicos`` antes de que puedas modificar los recursos sin afectar al nodo original.
fr: Lorsque vous dupliquez un nœud de l'arbre de scène, avec :kbd:`Ctrl + D` (:kbd:`Cmd + D` on macOS), il partage ses ressources avec le nœud d'origine. Vous devez utiliser ``Make Sub-Resources Unique`` avant de pouvoir ajuster les ressources sans affecter le nœud source.
ja: :kbd:`Ctrl + D` (macOSでは :kbd:`Cmd + D`), を使用してシーンツリーにあるノードを複製するときは、新しいノードはリソースを元のノードと共有します。元ノードに影響を与えずにリソースを微調整するには、\ ``サブリソースをユニーク化する`` を使用しなければなりません。
ko: 씬 트리에서 한 노드를 :kbd:`Ctrl + D` (macOS는 :kbd:`Cmd + D` ) 로 복제하면, 원래 노드의 리소스를 공유합니다. 리소스를 수정하기 전에 ``하위 리소스를 유일하게 만들기(Make Sub-Resources Unique)``\ 를 사용해야 원본 노드에게 영향을 주지 않습니다.
uk: Коли ви дублюєте вузол з дерева сцена, з допомогою :kbd:`Ctrl + D` (:kbd:`Cmd + D` на macOS), оригінальний вузол ділиться своїми ресурсами з дублікатом. Вам потрібно скористатися параметром ``Зробити суб-ресурси унікальними``, перш ніж ви зможете налаштувати ресурси дублікату, не впливаючи на оригінальний вузол.
zh_cn: 当您从场景树中复制节点时, 如果使用 :kbd:`Ctrl+D` ( :kbd:`Cmd+D` on macOS), 它将与原始节点共享资源. 您需要先使用 ``使子资源唯一(Make Sub-Resources Unique)``, 然后才能调整复制节点的资源而不影响源节点.
zh_tw: 當我們使用 :kbd:`Ctrl + D` （或 macOS :kbd:`Cmd + D` ）來在場景樹中拷貝節點，所有的資源都會與原本的節點共用。在修改資源前必須要使用 ``獨立化子資源`` 才能不影響到原本的節點。

source: Scroll down to the ``Custom Font`` section and open ``Font``. Lower the ``Size`` to a smaller value like ``20`` or ``22``. You may also need to adjust the ``Bottom`` spacing value to align the text's baseline with the EP label on the left.
cs: Přejděte dolů do sekce ``Custom Font`` a otevřete ``Font``. Snižte hodnotu ``Size`` na menší hodnotu, například ``20`` nebo ``22``. Možná budete muset také upravit hodnotu ``Bottom``, aby se základní linie textu zarovnala se štítkem EP na levé straně.
de: Scollen Sie zum Bereich ``Custom Font`` und öffnen Sie ``Font``. Ändern Sie ``Size`` auf einen kleineren Wert wie zum Beispiel ``20`` oder ``22``. Eventuell muss auch der ``Bottom``-Abstand geändert werden, um die Basislinie des Texts auf das EP-Label links anzugleichen.
es: Desplázate hacia abajo hasta la sección ``Custom Font`` y abre ``Font``. Reduce el ``Size`` a un valor más pequeño como ``20`` o ``22``. También puede ser necesario ajustar el valor de espaciado ``Bottom`` para alinear la línea de base del texto con la etiqueta EP de la izquierda.
fr: Faites défiler vers le bas jusqu'à la section ``Custom Font`` et ouvrez ``Font``. Baissez ``Size`` à une valeur plus petite comme ``20`` ou ``22``. Vous devrez peut-être aussi ajuster la valeur de l'espacement ``Bottom`` pour aligner la ligne de base du texte avec l'étiquette EP à gauche.
ja: ``Custom Font`` セクションまでスクロールして ``Font`` を開きます。 ``Size`` を ``20`` または ``22`` のような小さい値に下げます。テキストのベースラインを左側のEPラベルに合わせるために、 ``Bottom`` の間隔値を調整する必要があるかもしれません。
ko: ``Custom Font`` 섹션으로 내려가서``Font``\ 를 여세요. ``Size``\ 를 ``20``\ 이나 ``22``\ 처럼 더 작은 값으로 낮추세요. 그리고 ``Bottom`` 영역 값을 조정해서 문자의 기준선이 왼쪽의 EP 라벨과 나란하도록 해야합니다.
pt_br: Role para baixo até a seção ``Custom Font`` e abra ``Font``. Abaixe o ``Size`` para um valor menor como ``20`` ou ``22``. Você também pode precisar ajustar o valor de espaçamento ``Bottom`` para alinhar a linha de base do texto com o rótulo EP à esquerda.
uk: Прокрутіть униз до розділу``Custom Font`` та відкрийте ``Font``. Зменшіть значення ``Size`` до меншого значення, наприклад ``20``, або ``22``. Можливо, вам також знадобиться відрегулювати значення інтервалу ``Bottom`` для вирівнювання базової лінії тексту з міткою EP зліва.
zh_cn: 向下滚动到 ``自定义字体(Custom Font)`` 部分, 然后打开 ``字体(Font)``. 将 ``大小(Size)`` 降低到较小的值, 例如 ``20`` 或 ``22``. 你可能还需要调整 ``底部(Bottom)`` 间距值, 以将文本的基线与左侧的 ``EP`` 标签对齐.
zh_tw: 向下滾動到 ``Custom Font`` 段落並打開 ``Font`` 。將 ``Size`` 調為小一點的數字如 ``20`` 或是 ``22`` 。可能也需要調整 ``Bottom`` 的間隔值來將文字的基線對齊左側的 EP 標籤。

source: The EP Count widget, with a smaller font than its HP counterpart
cs: Widget EP Count s menším písmem než jeho protějšek HP
de: Das Element, welches die Erfahrung zählt, jedoch mit einer kleineren Schriftart als ihr Gesundheitsgegenstück
es: El widget EP Count, con una fuente más pequeña que la de HP
fr: Le widget EP Count, avec une police plus petite que son homologue HP
ja: HPのものよりも小さなフォントを持つEP Countウィジェット
ko: EP Count 위젯은 HP보다 더 작은 폰트로 되어 있습니다
pt_br: O widget Count do EP, com uma fonte menor que a do HP
ru: Счетчик EP, с меньшим шрифтом, чем его аналог HP
uk: Віджет EP Count з меншим шрифтом, ніж його аналог HP
zh_cn: ``EP Count`` 小部件, 其字体比 ``HP`` 同类小
zh_tw: EP 計數器元件，使用比 HP 還要小的字體

source: Now, select the ``TextureProgress`` node. Drag the ``energy_bar_bg.png`` file onto the ``Under`` slot and do the same for ``energy_bar_fill.png`` and drop it onto the ``Progress`` texture slot.
cs: Nyní vyberte uzel ``TextureProgress``. Přetáhněte soubor ``energy_bar_bg.png`` do slotu ``Under`` a totéž proveďte se souborem ``energy_bar_fill.png`` a přeneste jej do slotu textury ``Progress``.
de: Nun, wähle die ``TextureProgess`` node. Ziehe die ``energy_bar_bg.png`` Datei in den ``Under`` Teil und mache das selbe für ``energy_bar_fill.png`` und ziehe es in den ``Progress`` Texturteil.
es: Ahora, selecciona el nodo ``TextureProgress``. Arrastra el archivo ``energy_bar_bg.png`` a la ranura ``Under``, haz lo mismo con ``energy_bar_fill.png`` y suéltalo en la ranura de texturas ``Progress``.
fr: Maintenant, sélectionnez le nœud ``TextureProgress``. Faites glisser le fichier ``energy_bar_bg.png`` sur l'emplacement ``Under``, de même pour ``energy_bar_fill.png`` : déposez-le sur l'emplacement de texture ``Progress``.
ja: ここで、 ``TextureProgress`` ノードを選択します。 ``energy_bar_bg.png`` ファイルを ``Under`` スロットにドラッグして、同様に ``energy_bar_fill.png`` も ``Progress`` テクスチャスロットにドロップします。
ko: 이제 ``TextureProgress`` 노드를 선택하세요. ``Under 슬롯에 ``energy_bar_bg.png`` 파일을 드래그하고, ``Progress`` 텍스처 슬롯에도 마찬가지로 ``energy_bar_fill.png``\ 를 드래그하세요.
pt_br: Agora, selecione o nó ``TextureProgress``. Arraste o arquivo ``energy_bar_bg.png`` para o slot ``Under`` e faça o mesmo para ``energy_bar_fill.png`` e solte-o no slot de textura ``Progress``.
ru: Теперь выберите узел ``TextureProgress``. Перетащите файл ``energy_bar_bg.png`` в слот ``Under`` и сделайте то же самое для ``energy_bar_fill.png`` и поместите его на слот текстуры ``Progress``.
uk: Тепер виберіть вузол ``TextureProgress``. Перетягніть ``energy_bar_bg.png`` файл у гніздо ``Under`` і зробіть те саме для ``energy_bar_fill.png`` та перетягніть його на гніздо текстури ``Progress``.
zh_cn: 现在, 选择 ``TextureProgress`` 节点. 拖动 ``energy_bar_bg.png`` 文件到 ``Under`` 槽, 并对 ``energy_bar_fill.png`` 执行相同的操作. 然后把它放到 ``Progress`` 纹理槽中.
zh_tw: 接著，選擇 ``TextureProgress`` 節點，然後把檔案 ``energy_bar_bg.png`` 拖曳到 ``Under`` 槽，同樣地，把 ``energy_bar_fill.png`` 拖曳到 ``Progress`` 貼圖槽中。
