Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_game_user_interface.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: An expanding container eats all the space it can from its parent, pushing everything else along the way
cs: Rozšiřující se kontejner pohltí veškerý prostor, který mu jeho rodič nabízí a vše ostatní odtlačí
de: Ein wachsender Container füllt den ganzen Platz aus, den er von seinem Elternknoten bekommen kann, wobei er alles andere dabei verdrängt
es: Un container que se expande ocupa todo el espacio que puede de su padre, empujando todo lo demás a lo largo del camino
fr: Un conteneur extensible prend tout l'espace qu'il peut de son parent, en poussant tout le reste du même coup
ja: 膨張するコンテナは親からできる限りのスペースを食いつぶし、他のすべてを押しのけていく
ko: 펼쳐진 컨테이너가 부모가 정한 영역 전체를 먹어 버리면서, 나머지를 저 멀리로 밀어냅니다
pt_br: Um contêiner em expansão consome todo o espaço possível de seu pai, empurrando todo o resto ao longo do caminho
ru: Расширяясь контейнер забирает все пространство, которое он может взять от своего родителя, толкая все остальные объекты
uk: Расширившийся контейнер, з'їдає у свого предка увесь простір, який зможе, посуваючи все інше в сторону
zh_cn: 一个扩展的容器会占用其父容器的所有空间, 推动沿途的其他一切东西
zh_tw: 延展的容器吃掉了母節點內所有可用的空間，並推動所有其他的東西

source: Turn the bar and counter into reusable UI components
cs: Přeměňte lištu a počítadlo na opakovaně použitelné komponenty uživatelského rozhraní
de: Verwandel die Leiste und den Zähler in wiederverwendbare Komponenten für die grafische Oberfläche
es: Convierte la barra y el contador en componentes de UI reutilizables
fr: Transformer la barre et le compteur en composants d'interface graphique réutilisables
ja: バーとカウンタを再利用可能なUIコンポーネントに変える
ko: Bar와 Counter를 다시 사용할 수 있는 UI 구성 요소로 바꾸기
pt_br: Transforme a barra e o contador em componentes de interface do usuário reutilizáveis
uk: Перетворення шкали та лічильника на багаторазові елементи інтерфейсу
zh_cn: 将条形图和计数器变成可复用的UI组件
zh_tw: 將計量槽與計數器變成可重複使用的 UI 元件

source: We have one bar and one counter widget. But we need two of each. We may need to change the bars' design or their functionality later on. It'd be great if we could have a single scene to store a UI element's template, and child scenes to work on variations. Godot lets us do this with Inherited Scenes.
cs: Zatím máme widget pro jeden pruh a jeden čítač. My ale potřebujeme od každého dva. Asi taky budeme chtít později měnit design nebo funkčnost pruhů. Bylo by skvělé, kdybychom mohli mít jednu scénu pro uložení šablony widgetu a podřízené scény pro práci na jeho variantách. Godot nám to vše umožňuje pomocí tzv. Zděděných scén.
de: Wir haben eine Leiste und einen Zähler. Aber wir brauchen jeweils zwei Stück. Später müssen die Gestaltung und Funktion gegebenenfalls noch geändert werden. Es wäre schön, wenn wir eine einzige Szene erstellen könnten, die als Vorlage eines UI-Elements dient, wir davon Szenen ableiten könnten, die abgeändert werden können. Godot lässt uns genau das mittels Vererbter Szenen (Inherited Scenes) tun.
es: Tenemos un widget de barra y otro de contador. Pero necesitamos dos de cada uno. Puede ser que más adelante tengamos que cambiar el diseño de las barras o su funcionalidad. Sería genial si pudiéramos tener una sola escena para almacenar la plantilla de un elemento de la UI, y escenas hijas para trabajar en las variaciones. Godot nos permite hacer esto con Escenas Heredadas.
fr: Nous avons une barre et un widget compteur. Cependant, nous en avons besoin de deux exemplaires chacun. Nous aurons peut-être à changer l'apparence de la barre ou la fonctionnalité éventuellement. Ça serait bien si nous avions une seule scène qui permet de conserver un modèle d'élément d'IU, et des scènes enfants pour travailler sur des variations. Godot nous permet de faire cela avec les scènes héritées.
ja: バーが1つとカウンターウィジェットが1つあります。しかし、それぞれ2つずつ必要です。後でバーのデザインや機能の変更が必要になるかもしれません。1つのシーンをUI要素のテンプレート用にして、そこから作業用に複数の子シーンを派生できれば便利です。Godotはこれを、シーン継承で可能にしています。
ko: Bar 위젯 하나와 Counter 위젯 하나를 갖고 있습니다. 하지만 각각 두 개가 필요합니다. 나중에는 Bars의 디자인이나 기능을 바꾸게 될 것입니다. 하나의 씬마다 한 UI 요소의 템플릿을 갖도록 만들고, 그것으로 자손 씬을 다양하게 만들 수 있다면 멋질 것입니다. Godot에서는 이를 상속된 씬으로 제공합니다.
pt_br: Temos uma barra e um widget contador. Mas precisamos de dois de cada um. Talvez seja necessário alterar o design das barras ou sua funcionalidade posteriormente. Seria ótimo se pudéssemos ter uma única cena para armazenar o modelo de um elemento de interface do usuário e cenas filhas para trabalhar com variações. O Godot nos permite fazer isso com Cenas Herdadas.
ru: У нас есть одна шкала и один счетчик. Но нам нужно по два. Нам придется изменить конструкцию шкал или их функциональность. Было бы замечательно, если бы мы могли иметь одну сцену для хранения UI шаблона, и дочерние сцены для работы над вариациями нашего интерфейса. Godot позволяет нам делать это с помощью наследования сцен.
uk: У нас одна шкала і один лічильник. Але нам їх треба по дві штуки кожного. Пізніше нам може знадобитися змінити дизайн шкал, або їх функціональність. Було б чудово, якби ми могли мати одну сцену для зберігання шаблону елемента інтерфейсу та дочірні сцени для роботи над варіантами. Godot дозволяє нам це робити із спадковими сценами.
zh_cn: 我们有一个条形图和一个计数器小部件. 但是我们每种都需要两个. 稍后我们可能需要更改条形图的设计或功能. 如果我们可以有一个场景来存储UI元素的模板, 并让子场景来处理变体, 那就太好了.Godot让我们通过继承的场景做到这一点.
zh_tw: 現在我們只有計量槽跟計數器各一個，但我們需要的是各兩個。我們之後可能會需要修改計量槽的設計或是功能。如果可以將 UI 元素的樣板儲存成單一場景，並使用子場景來製作其他樣式的話會比較好。在 Godot 內可以通過繼承場景來做到。

source: Let's save both the ``Counter`` and the ``Bar`` branches as separate scenes that we'll reduce to create the ``LifeBar``, the ``EnergyBar``, the ``BombCounter``, and the ``EmeraldCounter``. Select the ``Bar`` HBoxContainer. Right click on it and click on ``Save Branch as Scene``. Save the scene as ``Bar.tscn``. You should see the node branch turn it to a single ``Bar`` node.
cs: Uložme větve ``Counter`` a ``Bar`` jako samostatné scény, které zmenšíme, abychom vytvořili ``LifeBar``, ``EnergyBar``, ``BombCounter`` a ``EmeraldCounter``. Vyberte ``Bar`` HBoxContainer. Klikněte na něj pravým tlačítkem a vyberte ``Uložit větev jako scénu``. Uložte scénu jako ``Bar.tscn``. Měli byste vidět jak se celá větev uzlu změní v jeden jediný uzel ``Bar``.
de: Speichern wir also die beiden Zweige ``Counter`` sowie ``Bar`` als getrennte Szenen ab, die wir reduzieren um daraus die ``LifeBar``, die ``EnergyBar``, den ``BombCounter`` und den ``EmeraldCounter`` zu erzeugen. Wähle den HBoxContainer ``Bar``. Mache darauf einen Rechtsklick und klicke auf ``Speichere Verzweigung als Szene``. Speichere die Szene als ``Bar.tscn``. Der ganze Zweig sollte sich daraufhin in einen einzigen Knoten namens ``Bar`` verwandeln.
es: Guardemos las ramas ``Counter`` y ``Bar`` como escenas separadas que reduciremos para crear el ``LifeBar``, el ``EnergyBar``, el ``BombCounter``, y el ``EmeraldCounter``. Selecciona el HBoxContainer ``Bar``. Haz clic con el botón derecho del ratón y haz clic en ``Guardar Rama como Escena``. Guarda la escena como ``Bar.tscn``. Deberías ver que la rama del nodo lo convierte en un único nodo ``Bar``.
fr: Sauvegardons le ``Counter`` et la ``Bar`` en scènes séparées que nous allons réduire pour créer la ``LifeBar``, l' ``EnergyBar``, le ``BombCounter``, et l' ``EmeraldCounter``. Sélectionner le HBoxContainer ``Bar``. Faites un clic droit dessus et cliquer sur ``Save Branch as Scene``. Sauvegarder la scène en tant que ``Bar.tscn``. Vous devriez voir la branche de nœud se transformer en un seul nœud ``Bar``.
ja: ``LifeBar`` 、 ``EnergyBar`` 、 ``BombCounter`` および ``EmeraldCounter`` に分類するためにまず、 ``Counter`` と ``Bar`` ブランチの両方を別々のシーンとして保存します。 ``Bar`` (HBoxContainer)を選択し、それを右クリックして ``ブランチをシーンとして保存`` をクリックします。シーン名を ``Bar.tscn`` として保存してください。するとノードブランチが単一の ``Bar`` ノードに変わるはずです。
ko: ``Counter``\ 와 ``Bar`` 가지 각각을 개별 씬으로 저장합시다. 저장해두면 나중에 ``LifeBar``, ``EnergyBar``, ``BombCounter``, ``EmeraldCounter``\ 를 만들 시간을 줄일 수 있습니다. ``Bar`` HBoxContainer를 선택하세요. 우클릭하여 ``가지를 씬으로 저장(Save Branch as Scene)``\ 을 클릭하세요. 씬을 ``Bar.tscn``\ 으로 저장하세요. 노드 가지가 하나의 ``Bar`` 노드로 바뀐 것을 볼 수 있습니다.
uk: Давайте збережемо ``Counter`` і ``Bar``, як окремі сцени , які ми будемо використовувати для створення ``LifeBar``, ``EnergyBar``, ``BombCounter`` і ``EmeraldCounter``. Виберіть HBoxContainer ``Bar``. Клацніть правою кнопкою миші та натисніть на ``Зберегти гілку як Сцену``. Збережіть сцену під назвою ``Bar.tscn``. Ви повинні побачити, як вся гілка перетворюється в один вузол.
zh_cn: 让我们将 ``Counter`` 和 ``Bar`` 分支保存为单独的场景, 将它们简化为创建 ``LifeBar``, ``EnergyBar``, ``BombCounter``, 和 ``EmeraldCounter``. 选择 ``Bar`` ``HBoxContainer``. 右键点击它, 然后点击 ``将分支另存为场景(Save Branch as Scene)``. 将场景保存为 ``Bar.tscn``. 您应该看到节点分支将其变为单个 ``Bar`` 节点.
zh_tw: 我們現在將 ``Counter`` 與 ``Bar`` 分支都分別保存成獨立的場景，之後用他們來製作 ``LifeBar`` 、 ``EnergyBar`` 、 ``BombCounter`` 、以及 ``EmeraldCounter`` 。選擇 ``Bar`` HBoxContainer 後右鍵點擊並選擇 ``保存分支為場景`` 。保存場景為 ``Bar.tscn`` 。接著節點分支應該會變成單一一個 ``Bar`` 節點。

source: A scene is a tree of nodes. The topmost node is the tree's **root**, and the children at the bottom of the hierarchy are **leaves**. Any node other than the root along with one or more children is a **branch**. We can encapsulate node branches into separate scenes, or load and merge them from other scenes into the active one. Right click on any node in the Scene dock and select ``Save Branch as Scene`` or ``Merge from Scene``.
cs: Scéna je strom uzlů. Nejvyšší uzel stromu je **kořen** a podřízené uzly v dolní části hierarchie jsou **listy**. Jakýkoli uzel jiný než kořen spolu se všemi svými podřízenými představuje **větev**. Větve uzlů můžeme zapouzdřit do samostatných scén nebo je načíst a sloučit z jiných scén do scény aktivní. Klikněte pravým tlačítkem myši na libovolný uzel v doku scény a vyberte možnost ``Uložit větev jako scénu`` nebo ``Sloučit ze scény``.
de: Eine Szene ist ein Baum aus Knoten. Der oberste Knoten ist die **Wurzel** des Baums und die Kinder am Ende der Hierarchie sind **Blätter**. Jeder Knoten (außer der Wurzel) ergibt zusammen mit einem oder mehreren Kindern einen **Zweig**. Wie können Zweige in eigene Szenen auslagern oder sie laden und in andere aktive Szenen einfügen. Mache einen Rechtsklick auf einen beliebigen Knoten im Szenenfenster und wähle ``Speichere Verzweigung als Szene`` oder ``Aus Szene zusammenführen``.
es: Una escena es un árbol de nodos. El nodo superior es la **raíz** del árbol, y los hijos en la parte inferior de la jerarquía son **hojas**. Cualquier otro nodo que no sea la raíz y además posea un hijo, es una **rama**. Podemos encapsular ramas de nodos en escenas separadas, o cargarlas y fusionarlas de otras escenas en la activa. Haz clic con el botón derecho del ratón en cualquier nodo del panel de Escenas y selecciona ``Guardar Rama como Escena`` o ``Fusionar desde Escena``.
fr: Une scène est une arborescence de nœuds. Le nœud le plus haut est la **racine** de l'arbre, et les enfants au bas de la hiérarchie sont des **feuilles**. Tout nœud autre que la racine avec un enfant ou plus est une **branche**. Nous pouvons encapsuler les branches de nœuds dans des scènes séparées, ou les charger et les fusionner à partir d'autres scènes dans la scène active. Cliquez avec le bouton droit de la souris sur n'importe quel nœud du dock Scène et sélectionnez ``Save Branch as Scene`` ou ``Merge from Scene``.
ja: シーンとは、ノードのツリーです。(樹木にたとえるなら)最上位のノードはツリーの **ルート=根** であり、階層内において最下部の子は **葉** になります。ルート以外のノードと1つ以上の子は、 **ブランチ=枝** です。ノード ブランチは、別のシーンとしてカプセル化したり、他のシーンからアクティブなシーンに読み込んでマージすることができます。シーン ドックにある任意のノードを右クリックし、 ``ブランチをシーンとして保存`` または ``シーンからマージ`` を選択します。
ko: 한 씬은 하나의 노드 트리입니다. 최상위의 노드는 트리의 **루트(Root)**\ 이고, 계층 구조의 아래에 해당하는 자손은 **잎**\ 입니다. 하나 이상의 자손을 갖는 노드의 루트는 **분기(Branch)**\ 입니다. 노드 분기를 개별 씬으로 캡슐화할 수 있습니다. 아니면 다른 씬에서 활성 씬으로 불러와서 병합할 수 있습니다. 씬(Scene) 독에서 아무 노드나 우클릭하고 ``분기를 씬으로 저장하기(Save Branch as Scene)``\ 나 ``씬에서 병합하기(Merge from Scene)``\ 를 선택하세요.
uk: Сцена - це дерево вузлів. Верхній вузол - **корінь** дерева , а нащадки внизу ієрархії - це **листя**. Будь-який вузол, крім кореня, разом із одним, або кількома нащадками - це **гілка**. Ми можемо інкапсулювати гілки вузлів в окремі сцени, або завантажити та об'єднати їх з інших сцен в активну. Клацніть правою кнопкою миші на будь-якому вузлі на панелі Сцена та виберіть ``Зберегти гілку як Сцену``або ``Merge from Scene`` (З'єднати зі сценою).
zh_cn: 场景是节点树. 最顶部的节点是树的 **根** , 层次结构底部的子级是 **叶** . 除根节点以外的任何节点以及一个或多个子节点都是 **分支** . 我们可以将节点分支封装到单独的场景中, 或者将它们从其他场景加载并合并到活动场景中. 右键点击场景停靠面板中的任何节点, 然后选择 ``将分支另存为场景(Save Branch as Scene)`` 或 ``从场景合并(Merge from Scene)``.
zh_tw: 場景就是樹狀的節點。最上層的節點就是樹的 **根** ，而在階層架構最末端的節點就是 **葉子** 。除了根節點以外，有子節點的節點就是 **分支** 。我們可以將節點分支封裝為獨立的場景，或是從其他場景載入為可用的分支。在場景樹中右鍵點擊任意一個節點後選擇 ``保存場景為分支`` 或 ``自場景合併`` 。

source: Then, select the ``Counter`` node and do the same. Right click, ``Save Branch as Scene``, and save it as ``Counter.tscn``. A new edit scene icon appears to the right of the nodes in the scene tree. Click on the one next to ``Bar`` to open the corresponding scene. Resize the ``Bar`` node so that its bounding box fits its content. The way we named and placed the Control nodes, we're ready to inherit this template and create the life bar. It's the same for the ``Counter``.
cs: Poté vyberte uzel ``Counter`` a proveďte totéž. Klikněte pravým tlačítkem na ``Uložit větev jako scénu`` a uložte ji jako ``Counter.tscn``. Napravo od uzlů ve stromu scény se zobrazí nová ikona úpravy scény. Kliknutím na jednu vedle položky ``Bar`` otevřete příslušnou scénu. Změňte velikost uzlu ``Bar`` tak, aby jeho ohraničovací rámeček těsně obepínal jeho obsah. Způsob, jakým jsme pojmenovali a umístili kontrolní uzly, nám umožňuje zdědit tuto šablonu a vytvořit pruh života. Totéž platí pro ``Counter``.
de: Dann, markiere das ``Counter`` Node und mache dasselbe. Rechtsklick, ``Speichere Zweig als Szene``, und speichere es als ``Counter.tscn``. Eine new bearbeitbares Szenenicon erscheint auf der Rechten Seite der Nodes auf dem Szenenzweig. Klicke auf das nächste von ``Bar``, um die korrespondierende Szene zu öffnen. Verändere die Größe des ``Bar`` Nodes, sodass ihre bounding box zum Inhalt passt. Für den Weg wie wir Controls benennen und platzieren sind wir jetzt fertig, um das Template zu vererben und erstellen eine Lebensbar. Es ist dasselbe für ``Counter``.
es: Luego, selecciona el nodo `` Counter`` y realiza lo mismo. Haz clic derecho, `` Guardar rama como escena``, y guárdalo como `` Counter.tscn``. Aparecerá un nuevo ícono de escena de edición a la derecha de los nodos en el árbol de escenas. Ahora haz clic en el que está junto a `` Bar`` para abrir la escena correspondiente. Cambia el tamaño del nodo ``Bar`` para que su cuadro delimitador se ajuste a su contenido. Por la forma en que nombramos y colocamos los nodos Control, estamos listos para heredar esta plantilla y crear la barra de vida. Es lo mismo para el ``Counter``.
fr: Ensuite, sélectionnez le nœud ``Counter`` et faites de même. Clic droit, ``Save Branch as Scene``, et l'enregistrer en tant que ``Counter.tscn``. Une nouvelle icône d'édition de scène apparaît à droite des nœuds dans l'arborescence des scènes. Cliquez sur celui à côté de ``Bar`` pour ouvrir la scène correspondante. Redimensionner le nœud ``Bar`` pour que sa boîte de délimitation s'adapte à son contenu. Comme nous avons nommé et placé les nœuds Control, nous sommes prêts à hériter de ce modèle et à créer la barre de vie. C'est la même chose pour ``Counter``.
ja: 次に、 ``Counter`` ノードを選択して同じ操作を行います。 ``ブランチをシーンとして保存`` を右クリックし、 ``Counter.tscn`` として保存します。シーンツリーの ``Bar`` ノードの右側に、新しくシーン編集アイコンが表示されるので、それをクリックして対応するシーンを開きます。境界ボックスがコンテンツに合うように ``Bar`` ノードのサイズを変更します。コントロールノードに名前を付けて配置した方法で、こうしてControlノードに名前を付けて配置したので、このテンプレートを継承してライフバーを作成する準備ができました。 ``Counter`` も同様にしてください。
ko: 그런 다음 ``Counter`` 노드를 선택하고 같은 작업을 반복하세요. 우클릭, ``분기를 씬으로 저장하기(Save Branch as Scene)``, 그리고 ``Counter.tscn``\ 으로 저장하세요. 씬 트리에서 노드의 오른쪽에 새로운 편집 씬 아이콘이 나타납니다. ``Bar`` 옆에 있는 것을 클릭해서 해당 씬을 여세요. ``Bar``\ 의 경계 사각형이 내용물에 맞도록 노드의 크기를 조정하세요. Control 노드의 이름을 짓고 배치하는 방법으로, 이 템플릿을 상속하여 체력 막대를 만들 준비가 되었습니다. ``Counter``\ 도 마찬가지입니다.
uk: Потім виберіть вузол ``Counter`` і зробіть те саме. Збережіть гілку як сцену під назвою ``Counter.tscn``. Праворуч від вузлів новостворених сцен у дереві сцени з’являється нова іконка сцени. Клацніть на одну з них поруч з ``Bar``, щоб відкрити відповідну сцену. Змініть розмір вузла ``Bar`` так, щоб його обмежувальне поле відповідало його вмісту. Тепер, коли ми назвали і розмістили вузли управління, ми готові успадкувати цей шаблон і створити шкалу здоров'я. Те ж саме треба зробити для ``Counter``.
zh_cn: 然后, 选择 ``Counter`` 节点并执行相同的操作. 右键单击 ``将分支另存为场景(Save Branch as Scene)``, 并将其保存为 ``Counter.tscn``. 新的编辑场景图标将显示在场景树中节点的右侧. 点击 ``Bar`` 旁边的一个以打开相应的场景. 调整 ``Bar`` 节点的大小, 使其边界框适合其内容. 我们以命名和放置 ``Control`` 节点的方式, 已经准备好继承此模板并创建生命条. 同理操作 ``Counter``.
zh_tw: 接下來，選擇 ``Counter`` 節點並做同樣的操作。右鍵點擊，選擇 ``保存分支為場景`` 並保存為 ``Counter.tscn`` 。場景樹上節點的右邊會出現新的編輯場景圖示。點擊 ``Bar`` 右邊的編輯場景圖示來打開對應的場景。調整 ``Bar`` 將誒點的大小來讓 Bar 的定界框的大小符合內容。我們命名與放置 Control 節點的方式已經讓我們準備好繼承這個模板來做出血槽了。 ``Counter`` 也一樣。

source: With no extra changes, our Bar is ready to use
cs: Bez dalších změn je náš pruh(uzel Bar) připraven k použití
de: Ohne weitere Änderungen kann unsere Leiste jetzt verwendet werden
es: Sin cambios adicionales, nuestra barra está lista para usar
fr: Sans aucun autre changement, votre barre est prête à être utilisé
ja: 追加の変更なしで、私たちのバーは使用する準備ができました
ko: 추가 변경 사항 없이 Bar를 사용할 수 있음
pt_br: Sem alterações extras, nossa Barra está pronta para uso
ru: Без каких-либо лишних изменений, наша шкала готова к использованию
uk: Без додаткових змін наша шкала готова до використання
zh_cn: 无需额外更改, 我们的条形图即可使用
zh_tw: 甭需額外修改，Bar 已隨時可用

source: Use scene inheritance to create the remaining elements
cs: Použijte dědičnost scén k vytvoření zbývajících prvků
de: Verwenden von Szenenvererbung, um die verbleibenden Elemente zu erstellen
es: Utiliza la herencia de escena para crear los elementos restantes
fr: Utilisez l'héritage de scène pour créer les éléments restants
ja: シーンの継承を使用して残りの要素を作成する
ko: 씬 상속을 사용해서 나머지 요소를 만들기
uk: Використання успадкування сцен для створення решти елементів
zh_cn: 使用场景继承创建其余元素
zh_tw: 使用場景繼承功能來製作剩下的元素

source: We need two bars that work the same way: they should feature a label on the left, with some value, and a horizontal gauge on the right. The only difference is that one has the HP label and is green, while the other is called EP and is yellow. Godot gives us a powerful tool to create a common base to reuse for all bars in the game: **inherited scenes**.
cs: Potřebujeme dva pruhy, které fungují podobně: oba dva mají popisek nalevo s nějakou hodnotou a horizontální měřák na pravé straně. Jediný rozdíl představuje popisek a barva, první má popisek HP a je zelený zatímco druhý se jmenuje EP a je žlutý. Godot nám dává do ruky mocný nástroj pro vytvoření společného základu pro oba ve hře potřebné pruhy: **děděné scény**.
de: Wir brauchen zwei Leisten, die genauso funktionieren: Sie sollten links eine Beschriftung mit einem Wert beinhalten und rechts eine horizontale Anzeige. Der einzige Unterschied ist, dass eine mit HP beschriftet und grün ist und die andere EP heißt und gelb ist. Godot bietet uns ein mächtiges Werkzeug, mit dem wir eine allgemeine Leistenvorlage erstellen können, die für alle Leisten im Spiel genutzt werden kann: **Szenenvererbung** (scene inheritance).
es: Necesitamos dos barras que funcionen de la misma manera: deben tener una etiqueta a la izquierda, con algún valor, y un indicador horizontal a la derecha. La única diferencia es que uno tiene la etiqueta HP y es verde, mientras que el otro se llama EP y es amarillo. Godot nos da una poderosa herramienta para crear una base común para reutilizar en todos los bares del juego: **escenas heredadas**.
fr: Nous avons besoin de deux barres qui fonctionnent de la même manière : Elles devraient comporter un label à gauche, avec une certaine valeur, et une jauge horizontale à droite. La seule différence est que l'un a le label HP et est vert, tandis que l'autre s'appelle EP et est jaune. Godot nous donne un outil puissant pour créer une base commune à réutiliser pour toutes les barres du jeu : des **scènes héritées**.
ja: 同じように機能するバーが2本必要です。どちらも、左側にラベルと数字、右側に水平ゲージがなければなりません。違いは、ひとつはHPラベルを付けて緑色であり、もうひとつはEPと呼ばれて黄色であるものです。Godotには、このゲームで使うすべてのバーの共通基盤を作れる、\ **継承されたシーン**\ という強力な道具があります。
ko: 똑같이 작동하는 두 막대가 필요합니다: 왼쪽에는 일정 값이 있는 라벨 기능을 맡고, 오른쪽에는 가로로 된 게이지가 있죠. 유일한 차이점은 한 쪽은 HP 라벨이면서 초록 색상인 반면, 다른 쪽은 EP라고 적혀 있고 노랑색인 것입니다. Godot는 일반적인 베이스를 만들어 게임 내 모든 막대에 재사용할 수 있도록 강력한 도구를 제공합니다: **상속된 씬**.
pt_br: Precisamos de duas barras que funcionem da mesma maneira: elas devem ter uma etiqueta à esquerda, com algum valor, e uma barra horizontal à direita. A única diferença é que um tem o rótulo HP e é verde, enquanto o outro tem o rótulo HP e é amarelo. O Godot nos oferece uma ferramenta poderosa para criar uma base comum para reutilizar todas as barras do jogo: **cenas herdadas **.
ru: Нам нужны две шкалы, которые работают одинаково: они должны иметь Label слева, с некоторым значением и горизонтальным счетчиком справа. Единственная разница заключается в том, что один имеет HP Label и он зеленый, а другой называется EP и он желтый. Godot дает нам мощный инструмент для создания шаблонов для повторного их использования для всех шкал в игре: **Наследование Сцен**.
uk: Нам потрібні дві шкали, які працюють однаково: вони повинні містити мітку, з деяким значенням, зліва, і горизонтальний показник справа. Єдина відмінність полягає в тому, що один має мітку HP і зелений, а другий називається EP і жовтий. Godot дає нам потужний інструмент для створення шаблонів, які можна повторно використовувати для створення всіх шкал у грі: **спадкові сцени**.
zh_cn: 我们需要两个条的工作方式相同: 它们的左侧应有标签, 并带有一些值, 右侧应有水平量规. 唯一的区别是一个带有 ``HP`` 标签, 并且是绿色的, 而另一个叫做 ``EP``, 并且是黄色的.Godot为我们提供了一个强大的工具, 可以为游戏中的所有条形图创建通用基础: **继承的场景** .
zh_tw: 我們需要兩個相同功能的計量槽：左邊要有帶數值的標籤，右邊有水平的計量槽。唯一不同的地方是其中一個是綠色的，而且有 HP 標籤，而另一個是黃色的，且標籤為 EP。Godot 中有能夠給所有計量槽建立可重複使用的共通基礎的工具： **場景繼承功能** 。

source: Inherited scenes help us keep the GUI scene clean. In the end, we will only have containers and one node for each UI component.
cs: Děděné scény nam pomáhají udržovat GUI scénu čistou. Nakonec budeme mít pouze kontejnery a jeden uzel pro každou komponentu UI.
de: Vererbte Szenen helfen uns, die GUI-Szene ordentlich zu halten. Am Ende haben wir nur Container und einen Knoten für jede UI-Komponente.
es: Las escenas heredadas nos ayudan a mantener limpia la escena de la GUI. Al final, solo tendremos contenedores y un nodo para cada componente de UI.
fr: Les scènes héritées nous aident à garder la scène de l'interface graphique(GUI) propre. En fin de compte, nous n'aurons que des conteneurs et un nœud pour chaque composant de l'interface utilisateur(UI).
ja: 継承されたシーンは、GUIシーンをきれいに保つのに役立ちます。最終的に各UIコンポーネントは、いくつかのコンテナと1つのノードだけ持つことになります。
ko: 상속된 씬은 GUI 씬을 깔끔하게 유지하도록 도와줍니다. 끝날 무렵에는, 컨테이너와 각 UI 구성 요소 별 노드 하나만을 갖게될 것입니다.
pt_br: Cenas herdadas nos ajudam a manter a cena da GUI limpa. No final, teremos apenas contêineres e um nó para cada componente da interface do usuário.
ru: Унаследованные сцены помогают нам делать сцену GUI чище. В конце концов, мы будем иметь только контейнеры и один узел для каждого компонента UI.
uk: Спадкові сцени допомагають нам підтримувати чистоту сцени GUI. Зрештою, у нас будуть лише контейнери та один вузол для кожного компонента інтерфейсу.
zh_cn: 继承的场景可帮助我们保持GUI场景的整洁. 最后, 每个UI组件只有一个容器和一个节点.
zh_tw: 通過使用繼承的場景來讓 GUI 場景保持乾淨。到最後我們只會需要幾個 Container 與各 UI 元件的各一個的節點。
