Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_game_user_interface.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: On an inherited scene, you can change any property of every node in the inspector, aside from its name. If you modify and save the parent scene, all the inherited scenes update to reflect the changes. If you change a value in the inherited scene, it will always override the parent's property. It's useful for UIs, as they often require variations of the same elements. In general, in UI design, buttons, panels etc. share a common base style and interactions. We don't want to copy it over to all variations manually.
cs: Ve zděděné scéně můžete změnit jakoukoliv vlastnost libovolného uzlu pomocí Inspektoru s vyjímkou jejího jména. Jestliže změníte a uložíte rodičovskou scénu, změny se projeví na všechn scénách, které z ní dědí. Na druhou stranu, když změníte hodnotu ve zděděné scéně, vždycky přepíšete hodnotu zděděnou po rodiči. Toto je pro prvnky UI užitečné, protože často používají variace vycházející z jednoho základního prvku. Obecně v designu UI platí, že tlačítka, panely atd. sdílejí společný základní styl a interakce. Rozhodně ho nechceme kopírovat ručně jednu vlastnost po druhé do všech potřebných prvků.
de: In einer geerbten Szene können wir neben dem Namen jede Eigenschaft jedes Nodes im Inspektor ändern. Wenn wir die übergeordnete Szene ändern und speichern, werden alle geerbten Szenen mit den Änderungen aktualisiert. Wenn wir einen Wert in der geerbten Szene ändern, wird die Eigenschaft des übergeordneten Objekts immer überschrieben. Dies ist nützlich für Benutzeroberflächen, da diese häufig Variationen derselben Elemente erfordern. Im Allgemeinen haben Schaltflächen, Bedienfelder usw. im UI-Design einen gemeinsamen Basisstil und Interaktionen. Wir möchten es nicht auf alle Variationen manuell kopieren.
es: En una escena heredada, puedes cambiar cualquier propiedad de cada nodo en el inspector, además de su nombre. Si modificas y guardas la escena principal, todas las escenas heredadas se actualizarán para reflejar los cambios. Si cambias un valor en la escena heredada, siempre anulará la propiedad de la escena base. Es útil para UI ya que a menudo requieren variaciones de los mismos elementos. En general, en el diseño de la interfaz de usuario, botones, paneles, etc. comparten un estilo de base común e interacciones. No queremos copiarlo a todas las variaciones de forma manual.
fr: Sur une scène héritée, vous pouvez changer n'importe quelle propriété de chaque nœud de l'inspecteur, à part son nom. Si vous modifiez et enregistrez la scène mère, toutes les scènes héritées sont mises à jour pour refléter les changements. Si vous changez une valeur dans la scène héritée, elle remplacera toujours la propriété du parent. C'est utile pour les interfaces utilisateur(UI) car elles nécessitent souvent des variations des mêmes éléments. En général, dans la conception de l'interface utilisateur(UI), les boutons, les panneaux, etc. partagent un style de base et des interactions communes. Nous ne voulons pas le copier manuellement dans toutes les variations.
ja: 継承シーン内ではすべてのノードで、名前以外にもあらゆるプロパティをインスペクタで変更できます。親シーンを変更して保存すると、すべての継承シーンが更新され、変更が反映されます。継承シーンでプロパティの値を変更すると、親から継承した値は常に上書きされます(ユニーク化する)。UIは同じ要素で複数のバリエーションを必要とすることが多いため、これは役に立ちます。一般的にUIデザインでは、ボタンやパネルなどは共通した基本スタイルと操作性を持ちます。手動ですべてのバリエーションにコピーしていくのは大変なことです。
ko: 상송된 씬이라면, 인스펙터(Inspector)에서 이름을 제외한 모든 속성을 바꿀 수 있습니다. 부모 씬을 수정하고 저장했다면, 모든 상속된 씬은 업데이트되면서 변경 사항이 반영됩니다. 상속된 씬에서 어떤 값을 바꿨다면, 그것을 부모의 속성을 다시 정의한 것이 됩니다. 이 점이 UI에서는 유용합니다. 종종 UI는 같은 요소에서 다양함이 요구되기 때문이죠. 일반적으로 UI 디자인, 버튼, 패널 등은 일반적인 베이스 스타일과 상호 작용을 공유합니다. 이 모든 다양성을 수동으로 복사하고 싶진 않죠.
uk: У спадковій сцені ви можете змінити будь-яку властивість кожного вузла в інспекторі, окрім його імені. Якщо ви змінюєте та зберігаєте батьківську сцену, всі успадковані сцени оновлюються. Якщо ви зміните значення в успадкованій сцені, воно завжди перекриває властивість предків. Це корисно для інтерфейсів користувача, оскільки вони часто вимагають варіацій одних і тих же елементів. Загалом, в дизайні інтерфейсу, кнопки, панелі тощо поділяють загальний базовий стиль та взаємодії. Ми не хочемо копіювати його усі варіанти вручну.
zh_cn: 在继承的场景上, 除了名称之外, 还可以更改属性检查器中每个节点的任何属性. 如果修改并保存父场景, 则所有继承的场景都会更新以反映所做的更改. 如果您在继承的场景中更改值, 它将始终覆盖父级的属性. 这对于UI很有用, 因为它们经常需要相同元素的变体. 通常, 在UI设计中, 按钮, 面板等具有相同的基本样式和交互. 我们不想手动将其复制到所有变体中.
zh_tw: 在繼承的場景中，除了名稱以外，所有節點的每一個屬性都可以在屬性面板中修改。如果修改並保存了母場景，則所有繼承的場景都會一併更新並反映出更改。若在繼承的場景中修改了任何數值，則會將母場景的值複寫掉。對於 UI 來說很有用，因為相同的元素常常都需要許多不同的版本。通常來說，在 UI 設計裡，按鈕、面板等的元件都有一組共用的基礎樣式與互動。我們通常不會手動複製出每一種不同的版本。

source: A reload icon will appear next to the properties you override. Click it to reset the value to the parent scene's default.
cs: Vedle vlastností, které přepíšete, se zobrazí ikona opětovného načtení. Klepnutím na ni obnovíte výchozí hodnotu nadřazené scény.
de: Neben den Eigenschaften wird ein erneut-laden Icon erscheinen.
es: Aparecerá un icono de recarga junto a las propiedades que sobrescriba. Haz clic en él para restablecer el valor al valor predeterminado de la escena principal.
fr: Une icône de rechargement apparaîtra à côté des propriétés que vous remplacez. Cliquez dessus pour réinitialiser la valeur à la valeur par défaut de la scène parente.
ja: 上書きしたプロパティの横にはリロードアイコンが表示されます。クリックすると、値が親シーンのデフォルトにリセットされます。
ko: 다시 정의한 속성 옆에 다시 불러오기 아이콘이 나타날 것입니다. 클릭해서 부모 씬의 기본 값으로 값을 초기화하세요.
pt_br: Um ícone de recarregamento aparecerá ao lado das propriedades que você substituir. Clique nele para redefinir o valor para o padrão da cena pai.
ru: Рядом со свойствами, которые вы переопределяете, появится значок перезагрузки. Щелкните его, чтобы сбросить значение на по-умолчанию родительской сцены.
uk: Поруч із властивостями, які ви перекриєте, з'явиться значок перезавантаження. Клацніть його, щоб відновити значення до стандартної сцени предка.
zh_cn: 重新加载图标将出现在你重写的属性旁边. 点击它可将值重置为父场景的默认值.
zh_tw: 複寫的屬性旁邊會出現一個重新載入圖示。點擊就可以將數值重設成母場景的預設值。

source: Think of scene inheritance like the node tree, or the ``extends`` keyword in GDScript. An inherited scene does everything like its parent, but you can override properties, resources and add extra nodes and scripts to extend its functionality.
cs: Přemýšlejte o dědičnosti scén, jako o stromu uzlů nebo si ji představte jako klíčové slovo ``extends`` v GDScriptu. Zděděná scéna dělá všechno jako její rodičovská, ale navíc můžete rozšířit její vlastnosti čí prostředky přidaním dalších podřízených uzlů a skriptů.
de: Man kann sich die Szenenvererbung wie einen Nodebaum vorstellen, oder das ''extends'' Schlüsselwort von GDScript. Eine vererbte Szene macht alles genauso wie ihr Elternszene, allerdings kann man Eigenschaften und Ressourcen überschreiben und weitere Nodes und Skripte hinzufügen um ihre Funktionalität zu erweitern.
es: Piensa en la herencia de escenas como el árbol de nodos, o la palabra clave ``extends'' en GDScript. Una escena heredada lo hace todo como su padre, pero puede anular propiedades, recursos y añadir nodos y scripts adicionales para ampliar su funcionalidad.
fr: Pensez à l'héritage de scène comme l'arbre des nœuds, ou le mot clé ``extends`` dans GDScript. Une scène héritée fait tout comme son parent, mais vous pouvez réécrire les propriétés, les ressources et ajouter des nœuds et des scripts supplémentaires pour étendre ses fonctionnalités.
ja: シーンの継承は、ノードツリーや、あるいはGDScriptの ``extends`` キーワードのようなものと考えてください。継承されたシーンは親とまったく同じように実行されますが、しかしプロパティやリソースを上書きしたり、ノードやスクリプトを追加したりして機能を拡張できます。
ko: 씬 상속의 개념은 노드 트리, 혹은 GDScript에서의 ``extends`` 키워드와 비슷합니다. 상속된 씬은 부모가 하는 모든 것을 합니다. 하지만 속성, 리소스를 다시 정의할 수 있고, 기능을 확장하기 위해 노드나 스크립트를 추가할 수 있습니다.
pt_br: Pense na herança de cena como a árvore de nós ou como a palavra-chave ``extends`` no GDScript. Uma cena herdada faz tudo como seu pai, mas você pode substituir propriedades, recursos e adicionar nós e scripts extras para estender sua funcionalidade.
ru: Подумайте о наследовании сцены, как о древе узлов, или ключевом слове в GDScript``extends``. Унаследованная сцена делает все, как и ее родительский элемент, но можно переопределить свойства, ресурсы и добавить дополнительные узлы и скрипты для расширения функциональности.
uk: Подумайте про успадкування сцени, як про дерево вузлів, або ключове слово ``extends`` в GDScript. Спадкова сцена виконує все, як і її предок, але ви можете змінити властивості, ресурси та додати додаткові вузли та скрипти, щоб розширити її функціональність.
zh_cn: 将场景继承想像成节点树, 或者在GDScript中使用 ``extends`` 关键字. 继承的场景会像其父级一样执行所有操作, 但是你可以覆盖属性, 资源并添加额外的节点和脚本来扩展其功能.
zh_tw: 可以將場景的繼承想像成場景樹或是 GDScript 中的 ``extends`` 關鍵字。執行繼承的場景就跟執行母場景一模一樣，但可以複寫屬性、複寫資源、並且可以新增額外的節點與腳本來擴充功能。

source: Inherit the Bar Scene to build the LifeBar
cs: Vytvoření Ukazatele života děděním ze scény Bar
de: Erbe von der Leistenszene um einen Lebensbalken zu erstellen
es: Hereda la escena Bar para construir el LifeBar
fr: Hériter de la scène Bar pour construire la barre de vie
ja: Barシーンを継承してライフバーを構築する
ko: LifeBar를 만들기 위해 Bar 씬을 상속하기
pt_br: Herdar a Cena da Barra para construir a LifeBar
ru: Наследование Bar для создания шкалы здоровья
uk: Успадкування сцени Bar для створення LifeBar (Шкали здоров'я)
zh_cn: 继承 ``Bar`` 场景来构建生命条
zh_tw: 繼承 Bar 場景來製作血條 (LifeBar)

source: Go to ``Scene -> New Inherited Scene`` to create a new type of ``Bar``. Select the Bar scene and open it. You should see a new [unsaved] tab, that's like your ``Bar``, but with all nodes except the root in grey. Press :kbd:`Ctrl + S` (:kbd:`Cmd + S` on macOS) to save the new inherited scene and name it ``LifeBar``.
cs: Přejděte na ``Scéna -> Nová odvozená scéna`` a vytvořte nový typ ``Bar``. Vyberte scénu Bar a otevřete ji. Měli byste vidět nový [neuložený] panel, který je jako váš ``Bar``, ale se všemi uzly kromě kořene v šedé barvě. Stisknutím :kbd:`Ctrl + S` (:kbd:`Cmd + S` v systému MacOS) uložte novou zděděnou scénu a pojmenujte ji ``LifeBar``.
es: Ve a ``Escena -> Nueva escena heredada`` para crear un nuevo tipo de ``Bar``. Selecciona la escena Bar y ábrela. Deberías ver una nueva pestaña[no guardada], que es como tu ``Bar``, pero con todos los nodos excepto la raíz en gris. Presiona :kbd:`Ctrl + S` (:kbd:`Cmd + S` en macOS) para guardar la nueva escena heredada y llámala ``LifeBar``.
fr: Allez dans ``Scene -> New Inherited Scene`` pour créer un nouveau type de ``Bar``. Sélectionnez la scène Bar et ouvrez-la. Vous devriez voir un nouvel onglet [unsaved], c'est comme votre ``Bar``, mais avec tous les nœuds excepté le nœud racine qui est gris. Appuyez sur :kbd:`Ctrl + S` (:kbd:`Cmd + S` on macOS) pour sauvegarder la nouvelle scène héritée et nommez-la ``LifeBar``.
ja: ``シーン → 新しい継承シーン`` に移動して、新しいタイプの ``Bar`` を作成します。\ ``Bar`` シーンを選択して開きます。新しい［未保存］タブが表示されるはずです。これは ``Bar`` と似ていますが、ルート以外のすべてのノードがグレーで表示されています。\ :kbd:`Ctrl + S` (macOSでは :kbd:`Cmd + S`) を押して、継承された新しいシーンを保存し、\ ``LifeBar`` という名前を付けます。
ko: ``씬(Scene) -> 새 상속 씬(New Inherited Scene)``\ 으로 가서 ``Bar``\ 의 새 유형을 만드세요. Bar 씬을 선택하고 여세요. 새로운 [저장되지 않음(unsaved)] 탭을 볼 수 있습니다. 이 탭에는 ``Bar``\ 와 비슷하지만, 루트를 제외한 모든 노드가 회색으로 되어 있습니다. :kbd:`Ctrl + S` (macOS는 :kbd:`Cmd + S`) 를 눌러 새 상속 씬을 저장하고 이름을 ``LifeBar``로 지으세요.
uk: Перейдіть до ``Сцена -> Нова успадкована сцена`` до створення нового типу ``Bar``. Виберіть сцену Bar і відкрийте її. Ви повинні побачити нову вкладку [не збережену], таку ж як ваша сцена ``Bar``, але з усіма вузлами, крім кореня сірого кольору. Натисніть :kbd:`Ctrl + S`(:kbd:`Cmd + S` на macOS), щоб зберегти нову успадковану сцену та назвіть її ``LifeBar``.
zh_cn: 点击编辑器左上角选项会弹出一个场景文件选择器 ``场景 -> 新建继承的场景(Scene -> New Inherited Scene)`` 以创建新的 ``Bar`` 类型. 选择 ``Bar`` 场景并将其打开. 您应该看到一个新的 [未保存] 标签, 就像您的 ``Bar`` , 但除了根节点以外的其余子节点均为灰色. 按 :kbd:`Ctrl+S` ( :kbd:`Cmd+S` on macOS) 保存新的继承场景并将其命名为 ``LifeBar``.
zh_tw: 打開 ``場景 -> 新增繼承場景`` 來建立一個新版本的 ``Bar`` 。選擇 Bar 場景來打開。接著會出現一個新的 [未保存] 場景，長得跟 ``Bar`` 很像，但除了根節點以外所有的節點都是灰色的。按鍵盤 :kbd:`Ctrl + S` （macOS 上 :kbd:`Cmd + S` ）來保存新的繼承場景並命名為 ``LifeBar`` 。

source: You can't rename grey nodes. This tells you they have a parent scene
cs: Šedé uzly nelze přejmenovat. To vám říká, že pocházejí z rodičovské scény
de: Man kann keine ausgegrauten Nodes umbenennen. Dadurch wird kommuniziert, dass sie von einer Elternszene erben
es: No se puede cambiar el nombre de los nodos grises. Esto te dice que tienen una escena padre
fr: Vous ne pouvez pas renommer les nœuds grisés. Cela signifie qu'ils ont une scène parente
ja: グレーアウトしているノードの名前は変更できません。これは、親シーンがあることを示しています
ko: 회색 노드를 이름을 바꿀 수 없습니다. 이것은 부모 씬을 갖고 있음을 뜻합니다
pt_br: Você não pode renomear nós acinzentados. Isso quer dizer que eles têm uma cena pai
ru: Нельзя переименовать серые узлы. Это говорит вам, что у них есть родительская сцена
uk: Ви не можете перейменувати сірі вузли. Це говорить вам, що у них є батьківська сцена
zh_cn: 你不能重命名灰色节点. 这表示它们有一个父级场景
zh_tw: 灰色的節點無法重新命名。代表這些節點有母場景

source: First, rename the root or top level node to ``LifeBar``. We always want the root to describe exactly what this UI component is. The name differentiates this bar from the ``EnergyBar`` we'll create next. The other nodes inside the scene should describe the component's structure with broad terms, so it works with all inherited scenes. Like our ``TextureProgress`` and ``Number`` nodes.
cs: Nejprve přejmenujte kořenový uzel nebo uzel nejvyšší úrovně na ``LifeBar``. Vždy chceme, aby kořen přesně popisoval, co je tato komponenta uživatelského rozhraní zač. Název odlišuje tento panel od panelu ``EnergyBar``, který vytvoříme příště. Ostatní uzly uvnitř scény by měly popisovat strukturu komponenty pomocí obecných pojmů tak, aby to fungovalo se všemi zděděnými scénami. Stejně jako naše uzly ``TextureProgress`` a ``Number``.
de: Zuerst benennen Sie die Wurzel-oder Top-Level-Node in ``LifeBar `` um. Wir wollen immer, dass die Wurzel genau beschreibt, was diese UI-Komponente ist. Der Name unterscheidet diese Bar von der ``EnergyBar``, die wir als nächstes erstellen werden. Die anderen Knoten innerhalb der Szene sollten die Struktur des Bauteils mit breiten Begriffen beschreiben, so dass es mit allen geerbten Szenen funktioniert. Wie unsere ``TextureProgress`` und ``Zahl``-Nodes.
es: En primer lugar, cambie el nombre del nodo raíz o nivel superior a ``LifeBar``. Siempre queremos que la raíz describa exactamente qué es este componente de la interfaz de usuario. El nombre diferencia esta barra de ``EnergyBar`` que crearemos a continuación. Los otros nodos dentro de la escena deben describir la estructura del componente con términos amplios, por lo que funciona con todas las escenas heredadas. Como nuestros nodos ``TextureProgress`` y ``Number``.
fr: Renommez d'abord le nœud racine ou le nœud de niveau supérieur en ``LifeBar``. Nous voulons toujours que la racine décrive exactement ce qu'est ce composant de l'interface utilisateur. Le nom différencie cette barre de l'``EnergyBar`` que nous allons créer. Les autres nœuds à l'intérieur de la scène doivent décrire la structure du composant en termes généraux, de sorte qu'il fonctionne avec toutes les scènes héritées. Comme nos nœuds ``TextureProgress`` et ``Number``.
ja: まず、ルートまたは最上位ノードの名前を ``LifeBar`` に変更します。ルート名は常に、UIコンポーネントについて正確に説明するようなものにしましょう。この名前によって、次に作成する ``EnergyBar`` と区別されます。シーン内のノードについては、すべての継承シーンでも機能するよう、コンポーネント構造を大まかに説明するものにします。\ ``TextureProgress`` ノードや ``Number`` ノードもそうなっています。
ko: 먼저 루트나 상위 계층의 노드의 이름을 ``LifeBar``\ 로 바꾸세요. 항상 루트는 UI 구성 요소가 정확히 어떤 것인지를 설명해야 합니다. 이 이름이 막대와 나중에 만들 ``EnergyBar``\ 를 구별하게 만듭니다. 씬에 있는 다른 노드는 구성 요소의 구조를 넓은 범위에서 설명해야 합니다. 따라서 모든 상속된 씬에서도 설명이 돼야 하죠. 마치 ``TextureProgress``\ 나 ``Number``\ 노드처럼 말입니다.
pt_br: Primeiro, renomeie a raiz ou o nó de nível superior para ``LifeBar``. Nós sempre queremos que a raiz descreva exatamente o que é esse componente da interface do usuário. O nome diferencia esta barra do ``EnergyBar`` que criaremos em seguida. Os outros nós dentro da cena devem descrever a estrutura do componente com termos gerais, para que funcione com todas as cenas herdadas. Como nossos nós ``TextureProgress`` e ``Number``.
uk: Спочатку перейменуйте корінь, або вузол верхнього рівня, на ``LifeBar``. Ми завжди хочемо, щоб назва кореня описувала зміст компоненту інтерфейсу. Назва відрізнятиме цю шкалу від ``EnergyBar``, яку ми створимо далі. Інші вузли всередині сцени повинні описувати структуру компонента широкими термінами, тому що вони працюють з усіма успадкованими сценами. Наприклад наші вузли ``TextureProgress`` і ``Number``.
zh_cn: 首先, 将根节点或顶级节点重命名为 ``LifeBar``. 我们始终希望根目录准确描述此UI组件是什么. 该名称与接下来要创建的 ``EnergyBar`` 区别开来. 场景内的其他节点应使用广义术语来描述组件的结构, 因此它适用于所有继承的场景. 就像我们的 ``TextureProgress`` 和 ``Number`` 节点一样.
zh_tw: 首先，將根節點或最上層的節點重新命名為 ``LifeBar`` 。根節點應該要能說明清楚這個 UI 元件的用途。通過名稱來區分出這個節點與稍後要做的 ``EnergyBar`` 。場景中的其他節點也應該要通過易懂且放到繼承的場景內也適用的名稱來說明元件的架構。如 ``TextureProgress`` 與 ``Number`` 節點就是個例子。

source: If you've ever done web design, it's the same spirit as working with CSS: you create a base class, and add variations with modifier classes. From a base button class, you'll have button-green and button-red variations for the user to accept and refuse prompts. The new class contains the name of the parent element and an extra keyword to explain how it modifies it. When we create an inherited scene and change the name of the top level node, we're doing the same thing.
cs: Pokud jste někdy dělali webový design, je toto podobné práci s CSS: vytvoříte základní třídu a přidáváte její varianty pomocí tříd modifikátorů. Ze základní třídy tlačítka získáte varianty tlačítko-zelené a tlačítko-červené, které uživateli umožní přijímat a odmítat výzvy. Nová třída obsahuje název nadřazeného prvku a další klíčové slovo, které vysvětluje, v čem rodičovský prvek modifikuje. Když vytvoříme zděděnou scénu a změníme název uzlu nejvyšší úrovně, děláme vlastně totéž.
de: Es ist das gleiche wenn Sie mit CSS arbeiten: sie erstellen eine Basis Klasse, und fügen eine Variation mit modifizierten Klassen hinzu. Bei der Knopf Klasse haben Sie grüne und rote Knöpfe, mit dieser kann der Benutzer Befehle akzeptieren und ablehnen. Die neue Klasse enthält den Namen des parental Elementes und ein extra Schlüsselwort, um zu erklären wie es zu modifizieren ist. Wenn wir eine vererbte Szene erstellen und wir den Namen des oberen Knoten ändern, machen wir das gleiche.
es: Si alguna vez has hecho diseño web, es el mismo espíritu que trabajar con CSS: creas una clase base y agregas variaciones con las clases de modificador. Desde una clase de botón base, tendrá variaciones de botón verde y botón rojo para que el usuario acepte y rechace las solicitudes. La nueva clase contiene el nombre del elemento padre y una palabra clave adicional para explicar cómo lo modifica. Cuando creamos una escena heredada y cambiamos el nombre del nodo de nivel superior, estamos haciendo lo mismo.
fr: Si vous avez déjà fait du design web, c'est le même esprit que de travailler avec CSS : vous créez une classe de base, et ajoutez des variations avec des classes de modificateurs. À partir d'une classe de bouton de base, vous aurez des variations de boutons vert et rouge pour que l'utilisateur accepte et refuse les propositions. La nouvelle classe contient le nom de l'élément parent et un mot-clé supplémentaire pour expliquer comment il le modifie. Lorsque nous créons une scène héritée et changeons le nom du nœud de niveau supérieur, nous faisons la même chose.
ja: Webデザインをしたことがある人なら、CSSを使って作業するのと同じ精神です: 基底クラスを作成してから、それを変更したクラスによってバリエーションを追加します。基本ボタン クラスから派生させて、確認ダイアログ用のButtonGreenとButtonRedを作ります。そしてその新しいクラスには、親の要素と、変更内容を含んだ名前をつけます。継承シーンを作る際には、同じように最上位ノードの名前を変えましょう。
ko: 이제까지 웹 디자인을 해본 적이 있다면, 이 작업은 CSS를 가지고 작업하는 것과 상동할 것입니다: 기초 클래스를 만들고, 수정자 클래스로 변화를 추가하는 것이죠. 기초 버튼 클래스부터, 사용자가 프롬프트를 수락하고 거절하도록 만드는 초록 버튼과 빨강 버튼이라는 변화를 주듯이 말입니다. 새 클래스에는 부모 요소의 이름과 어떻게 수정하는 지에 관한 추가 키워드가 있습니다. 상속된 씬을 만들고, 최상위의 노드의 이름을 바꿀 때, 같은 작업을 하고 있는 셈이죠.
pt_br: Se você já fez web design, é o mesmo espírito que trabalhar com CSS: você cria uma classe base e adiciona variações com classes modificadoras. A partir de uma classe de botão base, você terá variações de botão verde e botão vermelho para o usuário aceitar e recusar prompts. A nova classe contém o nome do elemento pai e uma palavra-chave extra para explicar como ela é modificada. Quando criamos uma cena herdada e mudamos o nome do nó de nível superior, estamos fazendo a mesma coisa.
uk: Якщо ви коли-не-будь займалися веб-дизайном, то це схоже на роботу з CSS: ви створюєте базовий клас і додаєте варіанти з класами модифікаторів. У класі базових кнопок ви матимете зелену та червону кнопки, щоб користувач міг приймати та відмовляти підказки. Новий клас містить ім'я батьківського елемента та додаткове ключове слово, щоб пояснити, як саме він модифікує його. Коли ми створюємо успадковану сцену та змінюємо назву вузла верхнього рівня, ми робимо те саме.
zh_cn: 如果你曾经做过网页设计, 则它与使用CSS的精神相同: 创建基类, 并使用修饰符类添加变体. 在基本的按钮类中, 你将具有绿色的按钮和红色的按钮供用户接受和拒绝提示. 新类包含父元素的名称和一个额外的关键字, 以说明其修改方式. 创建继承的场景并更改顶级节点的名称时, 我们正在做相同的事情.
zh_tw: 如果你有做過網頁設計，這裡的做法就與 CSS 相同：先建立一個基礎的 Class，然後通過 Modifier Class 來製作出不同的種類。從基礎的按鈕 button class，再加上 button-green 與 button-red 等種類來讓使用者在提示框中選擇接受或拒絕。新的 class 名稱包含了母元素的名稱，再加上一個額外的單詞來描述不同的地方。我們在這裡繼承場景後修改了最上層節點的名稱時也是在做同樣的事。

source: Design the EnergyBar
cs: Vytvoření Ukazatele energie
de: Entwerfe die Energieleiste
es: Diseño de la barra de energía
fr: Créer la barre d'énergie
ja: エネルギーバーの設計
ko: EnergyBar 설계하기
pt_br: Projete o EnergyBar
ru: Дизайн шкалы Энергии
uk: Розробка EnergyBar (Шкали енергії)
zh_cn: 设计 ``EnergyBar``
zh_tw: 設計精力槽 (EnergyBar)

source: We already setup the ``LifeBar``'s design with the main ``Bar`` scene. Now we need the ``EnergyBar``.
cs: Design ``LifeBar`` jsme již nastavili pomocí hlavní scény ``Bar``. Nyní potřebujeme ``EnergyBar``.
de: Wir haben schon den Entwurf für die Lebensleiste mit der Leistenszene eingerichtet. Nun brauchen wir die Energieleiste.
es: Ya configuramos el diseño de `` LifeBar`` con la escena principal `` Bar``. Ahora necesitamos el `` EnergyBar``.
fr: Nous avons déjà mis en place le design de la ``LifeBar`` avec la scène principale ``Bar``. Nous avons maintenant besoin d'``EnergyBar``.
ja: ``LifeBar`` のデザインは、\ ``Bar`` シーンをメインにして完了しました。今度は ``EnergyBar`` が必要です。
ko: 이미 메인 ``Bar`` 씬으로 ``LifeBar``\ 의 설계를 마쳤습니다. 이제 필요한 것은 ``EnergyBar``\ 입니다.
pt_br: Nós já configuramos o design do ``LifeBar`` com a cena principal ``Bar``. Agora precisamos do ``EnergyBar``.
ru: Мы уже создали дизайн ``LifeBar'a`` с главной сценой``Bar``. Теперь нам нужно сделать ``EnergyBar``.
uk: Ми вже створили ``LifeBar`` з основної сцени ``Bar``. Тепер нам потрібна ``EnergyBar``.
zh_cn: 我们已经使用主 ``Bar`` 场景设置了 ``LifeBar`` 的设计. 现在我们需要 ``EnergyBar``.
zh_tw: 我們已經使用 ``Bar`` 場景來搞定了 ``LifeBar`` 的設計。現在我們要做 ``EnergyBar`` 。
