Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_game_user_interface.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Time to add all the UI elements to the main GUI scene. Open the ``GUI.tscn`` scene again, and delete the ``Bar`` and ``Counter`` nodes. In the FileSystem dock, find the ``LifeBar.tscn`` and drag and drop it onto the ``Bars`` container in the scene tree. Do the same for the ``EnergyBar``. You should see them align vertically.
cs: Je čas přidat všechny prvky uživatelského rozhraní do hlavní scény grafického uživatelského rozhraní. Znovu otevřete scénu ``GUI.tscn`` a odstraňte uzly ``Bar`` a ``Counter``. V doku FileSystem najděte ``LifeBar.tscn`` a přetáhněte do kontejneru ``Bars`` ve stromu scény. Totéž proveďte pro ``EnergyBar``. Měli byste je vidět zarovnané vertikálně.
de: Es ist Zeit das wir alle Elemente zu der Haupt grafischen Benutzeroberfläche hinzufügen. Öffnen Sie ``GUI.tscn`` nochmal, nun löschen Sie ``Bar`` und ``Counter``. Im Dateissystem Panel, suchen Sie ``LifeBar.tscn`` ziehen Sie es auf den``Bars`` Container und legen Sie es dort ab. Das gleiche wird mit der ``EnegeryBar`` gemacht. Sie sollten es aber Vertikal ausrichten.
es: Es hora de añadir todos los elementos de la UI a la escena principal GUI. Abre de nuevo la escena ``GUI.tscn`` y borra los nodos ``Bar`` y ``Counter``. En el panel de Sistema de Archivos, busca el archivo ``LifeBar.tscn`` y arrástralo y suéltalo en el contenedor ``Bars`` en el árbol de escenas. Haz lo mismo con la ``EnergyBar``. Deberías verlos alineados verticalmente.
fr: Il est temps d'ajouter tous les éléments de l'interface utilisateur à la scène principale de l'interface graphique. Ouvrez à nouveau la scène ``GUI.tscn`` et supprimez les nœuds ``Bar`` et ``Counter``. Dans le dock FileSystem, trouvez ``LifeBar.tscn`` et glisser la sur le conteneur ``Bars`` dans l'arbre de scène. Faites de même pour ``EnergyBar``. Vous devriez les voir s'aligner verticalement.
ja: すべてのUI要素をメインGUIシーンに追加します。 ``GUI.tscn`` シーンを再度開き、 ``Bar`` ノードと ``Counter`` ノードを削除します。ファイルシステムドックで ``LifeBar.tscn`` を見つけて、シーンツリー内の ``Bars`` コンテナにドラッグアンドドロップします。 ``EnergyBar`` についても同じ操作を行います。縦に並んでいるのが見えるはずです。
ko: 메인 GUI 씬에 모든 UI 요소를 추가할 시간입니다. 다시 ``GUI.tscn`` 씬을 열고, ``Bar``\ 와 ``Counter`` 노드를 삭제하세요. 파일 시스템(FileSystem) 독에서 ``LifeBar.tscn``\ 을 찾고, 씬 트리에서 ``Bars`` 컨테이너에 드래그 앤 드롭하세요. ``EnergyBar``\ 에도 마찬가지로 하세요. 수직으로 나란히 있는 것을 볼 수 있습니다.
pt_br: Hora de adicionar todos os elementos da interface do usuário à cena principal da GUI. Abra a cena ``GUI.tscn`` novamente, e apague os nós ``Bar`` e ``Counter``. Na aba FileSystem, encontre o ``LifeBar.tscn`` e arraste-o e solte-o no contêiner ``Bars`` na árvore da cena. Faça o mesmo para o ``EnergyBar``. Você deve vê-los alinhar verticalmente.
ru: Пришло время добавить все элементы интерфейса, на предназначенную для них сцену. Откройте сцену ``GUI.tscn`` и удалите узлы ``Bar`` и ``Counter`. В доке FileSystem (Файловая Система) найдите ``LifeBar.tscn`` и перетащите на контейнер ``Bars``, который должен находиться в дереве сцены. Сделайте тоже самое и для элемента ``EnergyBar``. Вы должны разместить их вертикально.
uk: Час додати всі елементи інтерфейсу до основної сцени GUI. Знову відкрийте сцену ``GUI.tscn`` і видаліть вузли ``Bar`` та ``Counter``. На панелі Файлова система знайдіть ``LifeBar.tscn`` і перетягніть його на контейнер ``Bars`` у дереві сцен. Зробіть те ж саме з ``EnergyBar.tscn``. Вони повинні вирівнятися по вертикалі.
zh_cn: 是时候将所有UI元素添加到主GUI场景中了. 再次打开 ``GUI.tscn`` 场景, 并删除 ``Bar`` 和 ``Counter`` 节点. 在 ``FileSystem`` 停靠面板中, 找到 ``LifeBar.tscn`` 并将其拖放到场景树中的 ``Bars`` 容器上. 对 ``EnergyBar`` 执行相同的操作. 你应该看到它们垂直对齐.
zh_tw: 該來把所有 UI 元素都加到主要的 GUI 場景了。打開 ``GUI.tscn`` 然後刪除 ``Bar`` 跟 ``Counter`` 節點。在檔案系統 Dock 中找到 ``LifeBar.tscn`` 並拖曳到場景樹中的 ``Bar`` 容器。 ``EnergyBar`` 也一樣拖曳過來。接著這兩個場景應該會垂直對齊。

source: The LifeBar and the EnergyBar align automatically
cs: Panel LifeBar a EnergyBar se automaticky zarovnají
de: Der Lebensbalken und der Energiebalken richten sich automatisch aus
es: LifeBar y EnergyBar se alinean automáticamente
fr: La barre de vie et la barre d'énergie sont automatiquement alignées
ja: LifeBarとEnergyBarは自動配置されます
ko: LifeBar와 EnergyBar가 자동으로 정렬됩니다
pt_br: A LifeBar e a EnergyBar se alinham automaticamente
ru: LifeBar и EnergyBar выравниваются автоматически
uk: LifeBar та EnergyBar автоматично вирівнюються
zh_cn: ``LifeBar`` 和 ``EnergyBar`` 自动对齐
zh_tw: LifeBar 與 EnergyBar 自動對齊

source: Now, drag and drop the ``BombCounter.tscn`` and ``EmeraldCounter.tscn`` scenes onto the ``Counters`` node. They'll resize automatically.
cs: Nyní přetáhněte scény ``BombCounter.tscn`` a ``EmeraldCounter.tscn`` do uzlu ``Counters``. Jejich velikost se také změní automaticky.
de: Nun, ziehe und lege die ``BombCounter.tscn`` und ``EmeraldCounter.tscn`` Szene auf die ``Counters`` node ab. Diese werden sich ebenfalls automatisch in ihrer Größe ausrichten.
es: Ahora, arrastra y suelta las escenas ``BombCounter.tscn`` y ``EmeraldCounter.tscn`` en el nodo ``Counters``. Cambiarán de tamaño automáticamente.
fr: Maintenant, faites glissez et déposez les scènes ``BombCounter.tscn`` et ``EmeraldCounter.tscn`` sur le nœud ``Counters``. Ils se redimensionneront automatiquement.
ja: 次に、 ``BombCounter.tscn`` と ``EmeraldCounter.tscn`` シーンを ``Counters`` ノードにドラッグ&ドロップします。サイズは自動的に変更されます。
ko: 이제 ``BombCounter.tscn``\ 와 ``EmeraldCounter.tscn`` 씬을 ``Counters`` 노드에 드래그 앤 드롭하세요. 자동으로 크기가 조절될 것입니다.
uk: Тепер перетягніть сцени ``BombCounter.tscn`` і ``EmeraldCounter.tscn`` на вузол ``Counters``. Вони автоматично змінять розмір.
zh_cn: 现在, 将 ``BombCounter.tscn`` 和 ``EmeraldCounter.tscn`` 场景拖放到 ``Counters`` 节点上. 它们会自动调整大小.
zh_tw: 現在將 ``BombCounter.tscn`` 與 ``EmeraldCounter.tscn`` 場景拖曳至 ``Counters`` 節點。這兩個場景的大小會自動縮放。

source: The nodes resize to take all the available vertical space
cs: Uzly mění svoji velikost tak, aby zabíraly veškerý dostupný vertikální prostor
de: Die Nodes ändern ihre Größe, um all den vertikalen verfügbaren Platz einzunehmen
es: Los nodos se redimensionan para ocupar todo el espacio vertical disponible
fr: Les nœuds se redimensionnent pour prendre tout l'espace vertical disponible
ja: ノードのサイズが変更され、使用可能なすべての垂直スペースが使用されます
ko: 노드는 가능한 모든 수직 공간을 차지하도록 크기를 조절합니다
pt_br: Os nós são redimensionados para ocupar todo o espaço vertical disponível
uk: Вузли змінюють розмір, щоб зайняти весь наявний вертикальний простір
zh_cn: 调整节点大小以占用所有可用的垂直空间
zh_tw: 節點會自動縮放並佔用水平方向上所有可用的空間

source: To let the ``EmeraldCounter`` and ``BombCounter`` use the size we defined in ``Counter.tscn``, we need to change the ``Size Flags`` on the ``Counters`` container. Select the ``Counters`` node and unfold the ``Size Flags`` section in the Inspector. Uncheck the ``Fill`` tag for the ``Vertical`` property, and check ``Shrink Center`` so the container centers inside the ``HBoxContainer``.
cs: Aby počítadla ``EmeraldCounter`` a ``BombCounter`` používala velikost definovanou v souboru ``Counter.tscn``, musíme změnit příznaky ``Size Flags`` v kontejneru ``Counters``. Vyberte uzel ``Counters`` a rozbalte sekci ``Size Flags`` v Inspectoru. Zrušte zaškrtnutí značky ``Fill`` u vlastnosti ``Vertical`` a zaškrtněte ``Shrink Center``, aby se kontejner vycentroval uvnitř kontejneru ``HBoxContainer``.
de: Damit ``EmeraldCounter`` und ``BombCounter`` die in ``Counter.tscn`` definierte Größe nutzen, müssen wir ``Counter.tscn`` im ``Counters`` Behälter ändern. Wähle ``Counters`` aus und öffne die ``Size Flags`` Sektion im Inspektor. Deaktiviere den ``Fill`` Tag für die ``Vertical`` Eigenschaften und wähle ``Shrink Center`` an, damit sich der Behälter im ``HBoxContainer`` zentriert.
es: Para permitir que el ``EmeraldCounter`` y ``BombCounter`` usen el tamaño que definimos en ``Counter.tscn``, necesitamos cambiar los ``Size Flags`` en el container ``Counters``. Selecciona el nodo ``Counters`` y despliega la sección ```Size Flags`` en el Inspector. Desmarca la etiqueta ``Fill`` para la propiedad ``Vertical``, y comprueba ``Shrink Center`` para que el contenedor se centre dentro del ``HBoxContainer``.
fr: Pour que ``EmeraldCounter`` et ``BombCounter`` utilisent la taille que nous avons définie dans ``Counter.tscn``, nous devons changer ``Size Flags`` du conteneur ``Counters``. Sélectionnez le nœud ``Counters`` et déroulez la section ``Size Flags`` dans l'Inspecteur. Décochez la case ``Fill`` pour la propriété ``Vertical`` et cochez ``Shrink Center`` pour que le conteneur soit centré à l'intérieur de ``HBoxContainer``.
ja: ``EmeraldCounter`` と ``BombCounter`` が ``Counter.tscn`` で定義したサイズを使用できるようにするには、 ``Counters`` コンテナの ``Size Flags`` を変更する必要があります。 ``Counters`` ノードを選択し、インスペクタの ``Size Flags`` セクションを展開します。 ``Vertical`` プロパティの ``Fill`` タグのチェックを外し、 ``Shrink Center`` をチェックして、コンテナが ``HBoxContainer`` の内側にくるようにします。
ko: ``EmeraldCounter``\ 와 ``BombCounter``\ 가 ``Counter.tscn``\ 에서 정의한 크기를 사용하도록 하려면, ``Counters`` 컨테이너의 ``Size Flags``\ 를 바꿔야 합니다. ``Counters`` 노드를 선택하고 인스펙터(Inspector)에서 ``Size Flags`` 섹션을 펼치세요. ``Vertical`` 속성에 있는 ``Fill`` 태그의 체크 상태를 풀고, ``Shrink Center``\ 를 체크하면 컨테이너는 ``HBoxContainer`` 안에서 중앙에 위치합니다.
uk: Щоб дозволити ``EmeraldCounter`` та ``BombCounter`` використовувати розмір, визначений нами в ``Counter.tscn``, нам потрібно змінити ``Size Flags`` у контейнері ``Counters``. Виберіть вузол ``Counters`` і розгорніть розділ ``Size Flags`` в Інспекторі. Зніміть прапорець ``Fill`` для властивості ``Vertical`` та встановіть ``Shrink Center``, щоб контейнер знаходиться в центрі .
zh_cn: 为了让 ``EmeraldCounter`` 和 ``BombCounter`` 使用我们在 ``Counter.tscn`` 中定义的大小, 我们需要在 ``Counters`` 容器上更改 ``Size Flags``. 选择 ``Counters`` 节点, 然后在属性检查器中展开 ``Size Flags`` 部分. 取消选中 ``垂直(Vertical)`` 属性的 ``填充(Fill)`` 标记, 然后选中 ``收缩中心(Shrink Center)``, 以便容器在 ``HBoxContainer`` 内部居中.
zh_tw: 要讓 ``EmeraldCounter`` 與 ``BombCounter`` 使用我們在 ``Counter.tscn`` 裡設定的大小，我們需要修改 ``Counters`` 容器上的 ``Size Flags`` 。先選擇 ``Counters`` 節點然後展開屬性面板中的 ``Size Flags`` 段落，取消選擇 ``Vertical`` 屬性中的 ``Fill`` 標籤，並勾選 ``Shrink Center`` ，這樣容器在 ``HBoxCounter`` 中就會置中。

source: Now both counters have a decent size
cs: Nyní mají obě počítadla řádnou velikost
de: Nun haben beide Zähler eine angemessene Größe
es: Ahora ambos contadores tienen un tamaño decente
fr: Maintenant, les compteurs ont une bonne taille
ja: 両方のカウンタが適切なサイズになりました
ko: 이제 카운터 모두 적당한 크기를 가졌습니다
pt_br: Agora ambos os contadores têm um tamanho decente
ru: Теперь оба счетчика имеют правильный размер
uk: Тепер обидва лічильники мають правильний розмір
zh_cn: 现在, 这两个计数器都有一个像样的大小
zh_tw: 兩個計數器的大小現在沒問題了

source: Change the ``Min Size`` property of the ``Counters`` container to control the height of the counters' background.
cs: Změňte vlastnost ``Min Size`` kontejneru ``Counters`` a určete tak výšku pozadí čítačů.
de: Ändere die ``Min Size`` Eigenschaft des ``Counter``-Containers, um die Höhe des Hintergrunds des Counters zu arrangieren.
es: Cambia la propiedad ``Min Size`` del container ``Counters`` para controlar la altura del fondo del contador.
fr: Changer la propriété ``Min Size`` du conteneur ``Counters`` pour contrôler la hauteur du fond des compteurs.
ja: ``Counters`` コンテナの ``Min Size`` プロパティを変更して、カウンタの背景の高さを制御します。
ko: ``Counters`` 컨테이너의 ``Min Size`` 속성을 바꿔서 Counters의 배경의 높이를 조정하세요.
pt_br: Altere a propriedade ``Min Size`` do contêiner ``Counters`` para controlar a altura do plano de fundo dos contadores.
ru: Измените свойство ``Min Size`` у контейнера ``Counters`` для управления высоты фона у счетчиков.
uk: Змініть властивість ``Min Size`` контейнера ``Counters``, щоб контролювати висоту фону лічильників.
zh_cn: 更改 ``Counters`` 容器的 ``Min Size`` 属性, 以控制计数器背景的高度.
zh_tw: 更改 ``Counters`` 容器的 ``Min Size`` 屬性來控制計數器背景的高度。

source: We have one small issue left with the EP label on the EnergyBar: the 2 bars should align vertically. Click the icon next to the ``EnergyBar`` node to open its scene. Select the ``Count`` node and scroll down to the ``Custom Constants`` section. Add a ``Margin Left`` of ``20``. In the ``Rect`` section set the node's ``Min Size`` back to 100, the same value as on the LifeBar. The ``Count`` should now have some margin on the left. If you save and go back to the GUI scene, it will be aligned vertically with the ``LifeBar``.
cs: Zbývá nám ještě jeden malý problém se štítkem EP na panelu EnergyBar: 2 sloupce by měly být zarovnány vertikálně. Kliknutím na ikonu vedle uzlu ``EnergyBar`` otevřete jeho scénu. Vyberte uzel ``Count`` a přejděte dolů do sekce ``Custom Constants``. Přidejte hodnotu ``Margin Left`` ve výši ``20``. V sekci ``Rect`` nastavte uzlu ``Min Size`` zpět na 100, tedy stejnou hodnotu jako u LifeBaru. Nyní by měl mít ``Count`` nalevo okraj. Pokud jej uložíte a vrátíte se do scény grafického uživatelského rozhraní, bude zarovnán vertikálně s ``LifeBar``.
de: Wir haben noch ein kleines Problem mit dem EP-Etikett auf dem Energiebalken (EnergyBar): Die 2 Balken sollten vertikal ausgerichtet sein. Klicken Sie auf das Symbol neben dem Knoten "EnergyBar", um die Szene zu öffnen. Wählen Sie den Knoten `` Count`` und scrollen Sie zum Abschnitt `` Custom Constants``. Fügen Sie ein `` Margin Left`` von `` 20`` hinzu. Setzen Sie im Abschnitt `` Rect`` das `` Min Size`` des Knotens auf 100 zurück, den gleichen Wert wie in dem Balken für Lebenspunkte (LifeBar). Das `` Count`` sollte nun links einen Rand haben. Wenn Sie speichern und zur GUI-Szene zurückkehren, wird diese vertikal an der `` LifeBar`` ausgerichtet.
es: Nos queda un pequeño problema con la etiqueta EP en la EnergyBar: las dos barras deben alinearse verticalmente. Haz clic en el icono junto al nodo ``EnergyBar`` para abrir la escena. Selecciona el nodo ``Count`` y desplázate hacia abajo hasta la sección ``Custom Constant``. Añade un ``Margin Left`` de ``20``. En la sección ``Rect`` vuelve a poner el ``Min Size`` del nodo en 100, el mismo valor que en LifeBar. El ``Count``" debería tener un margen a la izquierda. Si guardas y vuelves a la escena GUI, se alineará verticalmente con la ``LifeBar``.
fr: Nous avons un petit problème avec le label EP sur la barre d'énergie : Les 2 barres doivent être alignées verticalement. Cliquez sur l'icône à côté du nœud ``EnergyBar`` pour ouvrir sa scène. Sélectionnez le nœud ``Count`` et faites défiler vers le bas jusqu'à la section ``Custom Constants``. Mettre ``Margin Left`` à ``20``. Dans la section ``Rect``, réglez ``Min Size`` à 100, la même valeur que sur la barre de vie. ``Count`` devrait maintenant avoir une marge à gauche. Si vous sauvegardez et retournez à la scène de l'interface graphique, elle sera alignée verticalement avec ``LifeBar``.
ja: EnergyBarのEPラベルにはまだ小さな問題が1つ残っています。2本のバーは垂直に整列させる必要があります。 ``EnergyBar`` ノードの横にあるアイコンをクリックして、そのシーンを開きます。 ``Count`` ノードを選択し、``Custom Constants`` セクションまで下にスクロールして、 ``Margin Left`` に ``20`` を追加します。 ``Rect`` セクションでは、ノードの ``Min Size`` を100に戻します。これは、LifeBarと同じ値です。 ``Count`` の左側にいくらかの余白ができているはずです。保存してGUIシーンに戻ると、 ``LifeBar`` と垂直に整列しています。
ko: EnergyBar의 EP 라벨에 한 가지 문제가 남았습니다: 두 막대는 수직으로 나란히 있어야 합니다. ``EnergyBar`` 노드 옆의 아이콘을 클릭해서 노드의 씬을 여세요. ``Count`` 노드를 선택하고 ``Custom Constants`` 섹션으로 가세요. ``Margin Left``\ 를 ``20``\ 으로 추가하세요. ``Rect`` 섹션에서 노드의 ``Min Size``\ 를 다시 100으로 돌려놓으세요. 이 값은 LifeBar에 설정된 값과 같습니다. ``Count``\ 는 왼쪽에 이제 여백이 생길 것입니다. 저장하고 다시 GUI 씬으로 돌아간다면, ``LifeBar``\ 와 수직으로 나란히 있을 것입니다.
uk: У нас залишилася одна невелика проблема з міткою EP на EnergyBar: 2 шкали повинні розташовуватися вертикально. Клацніть піктограму сцени поруч із вузлом ``EnergyBar``, щоб відкрити його сцену. Виберіть ``Count`` вузол і прокрутіть вниз до розділу ``Custom Constants``. Там змініть ``Margin Left`` на ``20``. У розділі ``Rect`` встановіть ``Min Size`` вузла назад на 100, те саме значення, що і в LifeBar. Тепер ``Count`` має деякий відступ зліва. Якщо ви збережете сцену та повернетесь до сцени GUI, він буде вирівняний вертикально з ``LifeBar``.
zh_cn: 我们在 ``EnergyBar`` 上留下一个带有 ``EP`` 标签的小问题:2个条应垂直对齐. 点击 ``EnergyBar`` 节点旁边的图标以打开其场景. 选择 ``Count`` 节点, 然后向下滚动到 ``Custom Constants`` 部分. 添加一个 ``20`` 的 ``Margin Left``. 在 ``Rect`` 部分, 将节点的 ``Min Size`` 设置为100, 与 ``LifeBar`` 相同. ``Count`` 现在应该在左边有一些边距. 如果您保存并返回GUI场景, 它将与 ``LifeBar`` 垂直对齐.
zh_tw: EnergyBar 中的 EP 標籤還有個小問題：兩個計量槽應該要垂直對齊。點擊 ``EnergyBar`` 節點旁邊的圖示來打開場景。選擇 ``Count`` 節點然後往下滾動找到 ``Custom Constants`` 段落。新增 ``Margin Left`` ，值為 ``20`` 。在 ``Rect`` 段落中將節點的 ``Min Size`` 改回去與 LifeBar 相同的 100。 ``Count`` 節點的左邊現在應該有點邊距了。保存並回到 GUI 場景，EnergyBar 現在應該與 ``LifeBar`` 垂直對齊了。

source: The 2 bars align perfectly
cs: 2 pruhy jsou dokonale zarovnané
de: Die beiden Leisten sind nun perfekt ausgerichtet
es: Las 2 barras se alinean perfectamente
fr: Les 2 barres sont parfaitement alignées
ja: 2本のバーがぴったり揃います
ko: 완벽하게 정렬된 두 막대
pt_br: As duas barras alinham-se perfeitamente
ru: 2 шкалы идеально выравниваются
uk: 2 шкали ідеально вирівнюються
zh_cn: 2个条形图完美对齐
zh_tw: 兩個計量槽好好地對齊了

source: We could have set up the ``EnergyBar`` this way a few moments ago. But this shows you that you can go back to any scene anytime, tweak it, and see the changes propagate through the project!
cs: Před chvílí jsme mohli tímto způsobem nastavit ``EnergyBar``. Toto vám však ukazuje, že se můžete kdykoli vrátit k libovolné scéně, upravit ji a vidět, jak se změny šíří celým projektem!
de: Wir konnten die ``EnergieLeiste`` mit diesem Weg ein paar Minuten zuvor aufsetzen. Aber das zeigt, dass Sie jederzeit zurück zu seiner Szene gehen können, es verstellen, und die Änderungen durch das Projekt propagieren können!
es: Podríamos haber configurado la ``EnergyBar`` de esta manera hace unos momentos. ¡Pero esto demuestra que puedes volver a cualquier escena en cualquier momento, modificarla y ver los cambios propagarse a través del proyecto!
fr: Nous aurions pu implémenter ``EnergyBar`` de cette façon plus tôt. Mais cela vous montre que vous pouvez retourner à n'importe quelle scène à tout moment, l'ajuster et voir les changements se répercuter tout le long du projet !
ja: 先ほどは、この方法で ``EnergyBar`` を設定することもできました。しかし、いつでも任意のシーンに戻って、微調整し、変更をプロジェクト全体に反映できることを示すために、このようにしました！
ko: 방금 전, 이 방법으로 ``EnergyBar``\ 를 설정할 수 있었습니다. 하지만 이는 언제든지 돌아가서 값을 조정하고, 그 변경 사항이 프로젝트를 통해 전파되는 것을 볼 수 있다는 것을 보여줍니다!
uk: Ми могли так налаштувати ``EnergyBar`` раніше. Але тепер ви знаєте, що можете будь-коли повернутися до будь-якої сцени, налаштувати її та побачити, як зміни вплинуть на увесь проєкт!
zh_cn: 我们原本可以这样设置 ``EnergyBar``. 但是, 这表明您可以随时返回任何场景进行调整, 并查看更改在项目中的传播！
zh_tw: 我們也可以在剛才就設定好 ``EnergyBar`` 。但這裡只是要告訴你隨時都可以回去任何場景並進行調整，並在整個專案中看看所做的更改！

source: Place the GUI onto the game's mockup
cs: Umístění grafického uživatelského rozhraní do modelu hry
de: Platziere die Oberfläche auf den Spielentwurf
es: Coloca el GUI en la maqueta del juego
fr: Placez l'interface graphique sur la maquette du jeu
ja: GUIをゲームのモックアップに配置する
ko: 게임 모형에 GUI를 배치하기
pt_br: Coloque a GUI no protótipo do jogo
ru: Размещение интерфейса на макете игры
uk: Розміщення графічного інтерфейсу на макеті гри
zh_cn: 把GUI放到游戏的模型上
zh_tw: 將 GUI 放到遊戲打樣上

source: To wrap up the tutorial we're going to insert the GUI onto the game's mockup scene.
cs: Na závěr tohoto tutoriálu vložíme grafické uživatelské rozhraní do scény modelu hry.
de: Um das Tutorial einzuwickeln, tun wir auf jeden Fall die GUI in die Modellszene des Spiels einfügen.
es: Para finalizar el tutorial vamos a insertar el GUI en la escena de la maqueta del juego.
fr: Pour conclure le tutoriel, nous allons insérer l'interface graphique sur la scène de la maquette du jeu.
ja: チュートリアルを締めくくるために、ゲームのモックアップシーンにGUIを挿入します。
ko: 튜토리얼을 마무리하기 위해, 게임 모형 씬에 GUI를 삽입할 것입니다.
pt_br: Para finalizar o tutorial, vamos inserir a GUI na cena do protótipo do jogo.
ru: Чтобы завершить обучение мы вставим GUI на сцене макета игры.
uk: На завершення уроку, ми вставимо графічний інтерфейс в макет гри.
zh_cn: 为了结束本教程, 我们将GUI插入到游戏的模型场景中.
zh_tw: 在教學的最後我們要將 GUI 放進遊戲的打樣場景中。

source: Head to the FileSystem dock and open ``LevelMockup.tscn``.
cs: Přejděte do doku FileSystem a otevřete soubor ``LevelMockup.tscn``.
de: Springe zum Dateisystembereich und öffne ``LevelMockup.tscn``.
es: Dirígete al panel de Sistema de Archivos y abre ``LevelMockup.tscn``.
fr: Dirigez-vous vers le dock FileSystem et ouvrez ``LevelMockup.tscn``.
ja: ファイルシステムドックに進み、 ``LevelMockup.tscn`` を開きます。
ko: 파일 시스템(FileSystem) 독으로 가서 ``LevelMockup.tscn``\ 을 여세요.
pt_br: Vá para a aba FileSystem e abra ``LevelMockup.tscn``.
ru: Отправляйтесь в панель файловой системы и откройте ``LevelMockup.tscn``.
uk: Перейдіть на панель Файлова система та відкрийте ``LevelMockup.tscn``.
zh_cn: 前往文件系统停靠面板, 打开 ``LevelMockup.tscn``.
zh_tw: 到檔案系統 Dock 中打開 ``LevelMockup.tscn`` 。
