Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_game_user_interface.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Design the GUI
cs: Návrh grafického uživatelského rozhraní
de: Gestaltung der Oberfläche
es: Diseñando la GUI
fr: Créer l'Interface Graphique de l'Utilisateur (GUI)
ja: GUIの設計
ko: GUI 설계하기
pt_br: Projetar a GUI
ru: Разработка графического интерфейса
zh_cn: 设计GUI
zh_tw: 設計 GUI

source: Now that you've nailed the basics, we're going to see how to build a game Graphical User Interface (GUI) with reusable UI components: a life bar, an energy bar, and bomb and emerald counters. By the end of this tutorial, you'll have a game GUI, ready to control with GDscript or VisualScript:
cs: Nyní, když jste si upevnili základy, ukážeme si, jak postavit herní Grafické uživatelské rozhraní (GUI) s univerzálně použitelnými komponentami uživatelského rozhraní: ukazatele zdraví, energie a počítadla bomb a smaragdů. Na konci tohoto tutoriálu budete mít herní GUI, připravené k ovládání pomocí GDscriptu nebo VisualScriptu:
de: Jetzt, da du die Grundlagen drauf hast, sehen wir uns an, wie wir die grafische Benutzeroberfläche (engl. Graphical User Interface, kurz GUI) aus wiederverwendbaren Bausteinen erzeugen können: einer Lebensleiste, einer Energieleiste, einer Bombe und einem Smaragdzähler. Am Ende dieser Anleitung wirst du eine fertige GUI haben, die mit GDScript oder Visualscript gesteuert werden kann:
es: Ahora que has aprendido lo básico, vamos a ver cómo construir una Interfaz de Usuario de Juego (GUI) con componentes de UI reutilizables: una barra de vida, una barra de energía y contadores de bombas y esmeraldas. Al final de este tutorial tendrás una interfaz gráfica del juego lista para controlar con GDscript o VisualScript:
fr: Maintenant que vous avez acquis les bases, nous allons voir comment construire une interface graphique utilisateur (ou GUI) avec des composants d'interface réutilisables : une jauge de vie, une jauge d'énergie et des compteurs de bombes et d'émeraudes. A la fin de ce tutoriel, vous aurez une interface graphique utilisateur prête à utiliser avec GDscript ou Visualscript :
ja: これで基本を確認できたので、再利用可能なUIコンポーネント(ライフバー、エネルギーバー、爆弾とエメラルドカウンターなど)を使用してゲームのグラフィカルユーザーインターフェイス(GUI)を構築する方法を見ていきます。このチュートリアルの終わりまでには、GDscriptまたはVisualScriptで制御する準備ができたゲームGUIが完成します。
ko: 이제 기초를 갖춘 모양이니, 어떻게 게임 그래픽 유저 인터페이스 (GUI)를 만드는 지, 다시 사용할 수 있는 UI 구성 요소와 함께 알아봅시다: 체력 막대, 에너지 막대, 그리고 폭탄과 에메랄드 카운터. 이 튜토리얼을 마치면, 바로 GDScript나 VisualScript로 제어할 수 있는 게임 GUI를 갖게될 것입니다:
ru: Теперь, когда вы освоили основы, мы рассмотрим, как построить пользовательский интерфейс игры (GUI) с многократно используемыми компонентами: шкала здоровья, энергии, и счетчики бомб и кристаллов. К концу этого урока у вас будет GUI, готовый к управлению с помощью GDscript или VisualScript:
zh_cn: 现在, 您已经掌握了基础知识, 我们将了解如何构建具有可复用的UI组件的游戏图形用户界面(GUI): 生命条, 能量条, 以及炸弹和翡翠计数器. 在本教程结束时, 您将拥有一个游戏GUI, 可以使用GDscript或VisualScript进行控制:
zh_tw: 你現在已經有基礎了，我們接著來看看如何利用可重複使用的 UI 模型（血槽、精力槽、炸彈與寶石計數器）來製作遊戲的 GUI（Graphical User Interface，圖形使用者介面，「圖形界面」）。讀完這個教學之後，你就會有一個能使用 GDScript 或視覺腳本 (VisualScript) 來控制的遊戲圖形界面：

source: The final result
cs: Konečný výsledek
de: Das Endergebnis
es: El resultado final
fr: Le résultat final
ja: 最終結果
ko: 최종 결과물
pt_br: O resultado final
ru: Окончательный результат
uk: Кінцевий результат
zh_cn: 最终效果
zh_tw: 最終結果

source: You'll also learn to:
cs: Také se naučíte:
de: Du wirst folgendes lernen:
es: También aprenderás a hacerlo:
fr: Vous allez aussi apprendre à :
ja: また、次の方法についても学習します:
ko: 이번에 배울 내용입니다:
pt_br: Você também aprenderá a:
ru: Вы также научитесь:
uk: Ви також навчитеся:
zh_cn: 你还将学习:
zh_tw: 另外，你也會學到：

source: Create flexible UI components
cs: Vytvořte flexibilní komponenty uživatelského rozhraní
de: Wie man flexible UI-Komponenten erstellt
es: Crear componentes de UI flexibles
fr: Créer des composants d'interface utilisateur flexibles
ja: 柔軟なUIコンポーネントの作成
ko: 유연한 UI 구성 요소 만들기
pt_br: Crie componentes de interface do usuário flexíveis
ru: Создание гибких компонентов UI
uk: Створювати гнучкі компоненти інтерфейсу
zh_cn: 创建灵活的UI组件
zh_tw: 製作彈性的 UI 元件

source: Use scene inheritance
cs: Používat dědění scén
de: Wie man Szenenvererbung benutzt
es: Usa la herencia de escenas
fr: Utiliser l'héritage de scène
ja: シーンの継承を使用する
ko: 씬 상속 사용하기
pt_br: Usar a herança de cena
ru: Использовать наследование сцен
zh_cn: 使用场景继承
zh_tw: 使用場景的繼承功能

source: Build a complex UI
cs: Vytvořit komplexní UI
de: Wie man eine komplexe UI baut
es: Construye una UI compleja
fr: Construire une interface complexe
ja: 複雑なUIを構築する
ko: 복잡한 UI 만들기
pt_br: Construir uma interface com o usuário complexa
ru: Построение сложного UI
zh_cn: 构建一个复杂的UI
zh_tw: 建立一個複雜的 UI

source: Download the project files: :download:`ui_gui_design.zip <files/ui_gui_design.zip>` and extract the archive. Import the `start/` project in Godot to follow this tutorial. The `end/` folder contains the final result.
cs: Stáhněte si soubory projektu: :download:`ui_gui_design.zip <files/ui_gui_design.zip>` a rozbalte archiv. Importujte projekt `start/` do Godota a postupujte podle tohoto návodu. Složka `end/` obsahuje konečný výsledek.
de: Lade die Projektdateien herunter: :download:`ui_gui_design.zip <files/ui_gui_design.zip>` und entpacke das Archiv. Importiere das `start/``-Projekt in Godot, um dieser Anleitung zu folgen. Der Ordner `end/` enthält das fertige Ergebnis.
es: Descarga los archivos del proyecto: :download:`ui_gui_design.zip <files/ui_gui_design.zip>` y extrae los archivos. Importa el proyecto `start/` en Godot para seguir este tutorial. La carpeta `end/` contiene el resultado final.
fr: Télécharger les fichiers du projet : :download:`ui_gui_design.zip <files/ui_gui_design.zip>` et extraire l'archive. Importer le projet `start/` dans Godot pour suivre ce tutoriel. Le dossier `end/` contient le résultat final.
ja: プロジェクトファイル\ :download:`ui_gui_design.zip <files/ui_gui_design.zip>`\ をダウンロードし、アーカイブを解凍します。このチュートリアルに沿っていくには、Godotに `start/` プロジェクトをインポートしてください。 `end/` フォルダには最終結果が含まれています。
ko: 프로젝트 파일을 다운로드하세요: :download:`ui_gui_design.zip <files/ui_gui_design.zip>` 그리고 압축을 푸세요. 이 튜토리얼을 따라오려면 Godot로 `start/` 프로젝트를 불러오세요. `end/` 폴더에는 완성본이 들어 있습니다.
pt_br: Baixe os arquivos do projeto: :download:`ui_gui_design.zip <files/ui_gui_design.zip>` e extraia o arquivo. Importe o projeto `start/` no Godot para seguir este tutorial. A pasta `end/` contém o resultado final.
ru: Скачайте файлы проекта: :download:`ui_gui_design.zip <files/ui_gui_design.zip>` и извлеките архив. Импортируйте проект `start/` в Godot, чтобы следовать этому руководству. Папка `end/`содержит конечный результат.
zh_cn: 下载项目文件: :download:`ui_gui_design.zip <files/ui_gui_design.zip>` 并解压缩存档. 在Godot中导入 `start/` 项目以遵循本教程.`end/` 文件夹包含最终结果.
zh_tw: 下載專案檔： :download:`ui_gui_design.zip <files/ui_gui_design.zip>` 並解壓縮。將 `start/` 專案匯入至 Godot 以繼續這篇教學。 `end/` 資料夾包含了最後成果。

source: You can watch this tutorial as a `video on YouTube <https://www.youtube.com/watch?v=y1E_y9AIqow>`_.
cs: Tento výukový program můžete sledovat jako `video na YouTube <https://www.youtube.com/watch?v=y1E_y9AIqow>`_.
es: Puedes ver este tutorial (en inglés) en formato `video en YouTube <https://www.youtube.com/watch?v=y1E_y9AIqow>`_.
fr: Vous pouvez regarder le `tutoriel vidéo sur Youtube <https://www.youtube.com/watch?v=y1E_y9AIqow>`_.
ja: このチュートリアルは、\ `YouTubeのビデオ <https://www.youtube.com/watch?v=y1E_y9AIqow>`_\ として見ることができます (英語)。
ko: 이 튜토리얼은 `Youtube 영상<https://www.youtube.com/watch?v=y1E_y9AIqow>`_ 으로 볼 수도 있습니다.
zh_cn: 你可以观看这个教程 `在Youtube 上的视频 <https://www.youtube.com/watch?v=y1E_y9AIqow>`_ (英语且需要VPN).
zh_tw: 你也可以在 `在 YouTube 上觀看（英語） <https://www.youtube.com/watch?v=y1E_y9AIqow>`_ 本教學的影片版本。

source: Breaking down the UI
cs: Rozborka uživatelského rozhraní
de: Aufbau der UI
es: Desglose de la UI
fr: Décomposer l'interface utilisateur
ja: UIの分析
ko: UI 파헤치기
pt_br: Desmembrando a interface do usuário
ru: Разбивка UI
zh_cn: 分解UI
zh_tw: 拆解 UI

source: Let's break down the final UI and plan the containers we'll use. As in the :doc:`ui_main_menu`, it starts with a ``MarginContainer``. Then, we can see up to three columns:
cs: Pojďme si rozebrat finální UI a naplánovat jaké kontejnery použijeme. Stejně jako v :doc:`ui_main_menu`, základem je ``MarginContainer`` . Pak můžeme vidět až tři sloupce:
de: Schauen wir uns die fertige UI an und planen wir, welche Container wir benutzen werden. Wie beim :doc:`ui_main_menu` beginnt es auch hier mit einem ``MarginContainer``. Dann sehen wir bis zu drei Spalten:
es: Desglosemos la UI final y planifiquemos los containers que utilizaremos. Al igual que en el :doc:`ui_main_menu`, comienza con un ``MarginContainer``. Entonces, podremos ver hasta tres columnas:
fr: Décomposons l'interface utilisateur finale et prévoyons les conteneurs que nous utiliserons. Comme dans :doc:`ui_main_menu`, elle commence par un ``MarginContainer``. Ensuite, nous pouvons voir jusqu'à trois colonnes :
ja: 最終UIを分析し、どのコンテナを使用するか計画します。\ :doc:`ui_main_menu` \ と同様に ``MarginContainer`` から始まります。すると、3つの列に分けられます:
ko: 최종 UI를 분석하고 사용할 컨테이너를 계획해 보겠습니다. : doc : ʻui_main_menu`에서와 같이``MarginContainer``로 시작합니다. 그러면 세 개의 열로 나누어 볼 수 있습니다:
pt_br: Vamos desmembrar a interface do usuário final e planejar os contêineres que usaremos. Como em :doc:`ui_main_menu`, ele começa com um ``MarginContainer``. Então, podemos ver até três colunas:
ru: Давайте разберём окончательный UI спланируем, какие контейнеры мы будем использовать. Как и в: :doc:`ui_main_menu`, начнём с ``MarginContainer``. Затем мы видим три столбца:
zh_cn: 让我们分解最终的UI并计划将要使用的容器. 和 :doc:`ui_main_menu` 一样, 它以 ``MarginContainer`` 开头. 然后, 我们最多可以看到三列:
zh_tw: 我們先來把最終的 UI 分解一下，並計劃接下來要用到的 Container。就像 :doc:`ui_main_menu` 中一樣，我們要先從 ``MarginContainer`` 開始，然後剩下的東西看起來最多能分成三列：

source: The life and energy counters on the left
cs: Počitadla života a energie vlevo
de: Links die Zähler für Leben und Energie
es: Los contadores de vida y energía a la izquierda
fr: Les compteurs de vie et d'énergie à gauche
ja: 左側にはライフとエネルギーのカウンター
ko: 왼쪽의 체력과 에너지값을 의미하는 숫자
pt_br: Os contadores de vida e energia à esquerda
ru: Слева счетчики здоровья и энергии
uk: Зліва лічильники здоров'я та енергії
zh_cn: 左边是生命和能量的计数器
zh_tw: 左側有血槽與精力槽的數字

source: The life and energy bars
cs: Lišty pro energie a život
de: Die Lebens- und Energieleisten
es: Las barras de vida y energía
fr: Les barres de vie et d’énergie
ja: ライフとエネルギーのバー
ko: 체력과 에너지 잔량을 표시하는 막대
pt_br: As barras de vida e energia
ru: Шкалы здоровья и энергии
uk: Шкали здоров'я та енергії
zh_cn: 生命和能量条
zh_tw: 血槽與精力槽

source: The bomb and emerald counters on the right
cs: Počítadla bomb a smaragdů napravo
de: Rechts die Bomben- und Smaragdzähler
es: Los contadores de bombas y esmeraldas a la derecha
fr: Les compteurs de bombes et d'émeraudes sur la droite
ja: 右側の爆弾とエメラルドのカウンター
ko: 오른쪽의 폭탄과 에메랄드의 값을 나타내는 숫자
ru: Справа счётчики бомб и кристаллов
uk: Лічильники бомб та смарагдів справа
zh_cn: 右侧是炸弹和翡翠的计数器
zh_tw: 右側有炸彈與寶石的計數器

source: But the bar's label and the gauge are two parts of the same UI element. If we think of them this way, we're left with two columns:
cs: Štítek lišty a měřidlo jsou však dvě části stejného prvku uživatelského rozhraní. Takže máme vlastně sloupce dva:
de: Aber die Leist und ihre Beschriftung sind zwei Teile des gleichen UI-Elements. Wenn wir sie auf diese Weise betrachten, haben wir zwei Spalten:
es: Pero la etiqueta de la barra y el medidor son dos partes del mismo elemento de la UI. Si pensamos en ellos de esta manera, nos quedamos con dos columnas:
fr: Mais le label de la barre et la jauge sont deux parties d'un même élément d'interface utilisateur. Si nous pensons à eux de cette façon, il nous reste deux colonnes :
ja: しかし、バーのラベルとゲージは同じUI要素の2つの部分です。このように考えると、2つの列が残ります:
ko: 하지만 막대의 라벨과 게이지는 동일한 UI 요소의 두 부분입니다. 이런 식으로 생각하면 두 개의 열만 남습니다:
pt_br: Mas o rótulo da barra e o medidor são duas partes do mesmo elemento da interface do usuário. Se pensarmos neles desta maneira, ficamos com duas colunas:
ru: Но счётчики и шкалы являются частями одного и того же элемента UI. Таким образом, у нас остались две колонки:
uk: Але лічильники і шкали зліва є частинами одного і того ж елемента інтерфейсу. В результаті у нас залишається два стовпці:
zh_cn: 但是条的标签和标尺是同一个UI元素的两个部分. 如果我们这样想的话, 就剩下两列了:
zh_tw: 但是，血槽與精力槽的數字標籤跟條狀槽應該是屬於同一個 UI 元素中的兩個部分。這樣說來的話，就只能算是兩列：

source: The life and energy bars on the left
cs: Lišty životy a energie nalevo
de: Links die Lebens- und Energieleisten
es: Las barras de vida y energía a la izquierda
fr: Les barres de vie et d'énergie à gauche
ja: 左側にライフとエネルギーバー
ko: 왼쪽의 체력과 에너지 막대
pt_br: As barras de vida e energia à esquerda
ru: Слева шкалы здоровья и энергии
uk: Шкали здоров'я та енергії зліва
zh_cn: 左边是生命和能量条
zh_tw: 左側有血槽與精力槽

source: This makes it easier to nest containers: we have some margins around the border of the screen using a ``MarginContainer``, followed by an ``HBoxContainer`` to manage our two columns. The two bars stack on top of one another inside a ``VBoxContainer``. And we'll need a last ``HBoxContainer`` in the right column to place the bomb and emerald counters side-by-side.
cs: To usnadňuje vnořování kontejnerů: na okraje kolem obrazovky použijeme ``MarginContainer``, následovaný ``HBoxContainer`` pro správu našich dvou sloupců. V levém sloupci poskádáme oba dva pruhy uvnitř ``VBoxContainer``. A budeme potřebovat poslední ``HBoxContainer`` v pravém sloupci, abychom umístili počítadla bomb a smaragdů vedle sebe.
de: Das erleichtert die Verschachtelung der Container: Wir haben einen Abstand um den Bildschirmrand dank des ``MarginContainer``, gefolgt von einem ``HBoxContainer``, der die beiden Spalten übernimmt. Die beiden Leisten werden in einem ``VBoxContainer übereinander gestapelt. Und wir brauchen zuletzt noch einen ``HBoxContainer`` in der rechten Spalte, wo sich die Zähler für Bomben und Smaragde nebeneinander befinden.
es: Esto hace que sea más fácil anidar los containers: tenemos algunos márgenes alrededor del borde de la pantalla usando un ``MarginContainer``, seguido de un ``HBoxContainer`` para manejar nuestras dos columnas. Las dos barras se apilan una encima de la otra dentro de un ``VBoxContainer``. Y necesitaremos un último ``HBoxContainer`` en la columna derecha para colocar la bomba y los contadores de esmeraldas uno al lado del otro.
fr: Cela facilite l'imbrication des conteneurs : nous avons des marges autour de la bordure de l'écran en utilisant un ``MarginContainer``, suivi d'un ``HBoxContainer`` pour gérer nos deux colonnes. Les deux barres s'empilent l'une sur l'autre à l'intérieur d'un ``VBoxContainer``. Et nous aurons besoin d'un dernier ``HBoxContainer`` dans la colonne de droite pour placer les compteurs de bombes et de d'émeraudes côte à côte.
ja: これにより、コンテナのネストが容易になります。画面の縁からの余白を入れるために ``MarginContainer`` を使い、そこに ``HBoxContainer`` で2つの列を調整します。(左側の) 2つのバーは ``VBoxContainer`` 内で上下に重ねます。そして、仕上げに爆弾とエメラルドのカウンターを並べて配置するため、右側のカラムに ``HBoxContainer`` が必要です。
ko: 이렇게 하면 컨테이너를 더 쉽게 중첩할 수 있습니다: ``MarginContainer``를 사용하여 화면 테두리 주위에 약간의 여백을 두고 두 열을 관리하기 위해``HBoxContainer``를 사용합니다. 두 개의 막대는``VBoxContainer `` 내부에 쌓습니다. 그리고 마지막으로 폭탄과 에메랄드 카운터를 나란히 배치하려면 오른쪽 열에 ``HBoxContainer ``가 필요합니다.
ru: Это облегчает вложение контейнеров: у нас есть некоторые поля вокруг границы экрана с помощью ``MarginContainer``, а затем ``HBoxContainer`` для управления нашими двумя колонками. Две шкалы ложатся друг на друга внутри ``VBoxContainer``. И нам понадобится последний ``HBoxContainer`` в правой колонке, чтобы поместить счетчики бомб и кристаллов бок о бок.
zh_cn: 这使嵌套容器变得更加容易: 我们使用 ``MarginContainer``, 在屏幕边框周围留有一些边距, 然后使用 ``HBoxContainer`` 来管理两列. 这两个条在 ``VBoxContainer`` 中叠加在一起. 我们在右列中需要最后一个 ``HBoxContainer``, 来并排放置炸弹和翡翠计数器.
zh_tw: 為了讓嵌套 Container 可以更簡單，我們先使用 ``MarginContainer`` 來在畫面周圍加點留白，接著使用 ``HBoxContainer`` 來分出兩列。兩個計量槽則使用 ``VBoxContainer`` 來將其中一個堆疊在另一個上面。最後我們在右列中使用 ``HBoxContainer`` 來將炸彈與寶石的計數器分別擺放。

source: We get a clean UI layout with only 4 containers
cs: Dostáváme čisté rozložení UI a to pouze se 4 kontejnery
de: Wir erhalten ein sauberes UI-Layout mit nur vier Containern
es: Conseguimos un diseño de UI limpio con sólo 4 contenedores
fr: Nous obtenons une disposition propre de l'interface utilisateur avec seulement 4 conteneurs
ja: たった4つのコンテナできれいなUIレイアウトが得られました
ko: 4 개의 컨테이너로 말끔한 UI 레이아웃을 얻었습니다
pt_br: Ficamos com um layout de interface limpo com apenas 4 contêineres
ru: Мы получаем чистую компоновку UI только с 4 контейнерами
uk: У нас виходить чистий макет інтерфейсу лише з 4 контейнерами
zh_cn: 我们只用4个容器就能得到干净的UI布局
zh_tw: 只用了四個 Container 就能做出清楚的 UI

source: We will need extra containers inside the individual UI components, but this gives us the main GUI scene's structure. With this plan in place, we can jump into Godot and create our GUI.
cs: Budeme ještě potřebovat další kontejnery uvnitř jednotlivých UI komponent, ale tady máme strukturu hlavní scény celého GUI. Díky tomu můžeme přeskočit do Godota a začít vytvářet naše GUI.
de: Wir brauchen zusätzliche Container in den einzelnen UI-Komponenten, aber so haben wir die grobe Struktur der GUI-Szene. Mit diesem Plan im Kopf können wir uns Godot zur Brust nehmen und unsere GUI zusammenbauen.
es: Necesitaremos containers adicionales dentro de los componentes individuales de la UI, pero esto nos da la estructura de la escena principal de la GUI. Con este plan en marcha, podemos saltar a Godot y crear nuestro GUI.
fr: Nous aurons besoin de conteneurs supplémentaires à l'intérieur des composants individuels de l'interface utilisateur, mais cela nous donne la structure de la scène principale de l'interface graphique. Avec ce plan en place, nous pouvons plonger dans Godot et créer notre interface graphique.
ja: 個々のUIコンポーネント内に追加のコンテナが必要になりますが、これによってメインのGUIシーンの構造がわかります。この計画が整ったら、いよいよGodotでGUIを作成できます。
ko: 각 UI 구성 요소에는 추가적인 컨테이너가 필요할 것입니다. 하지만 이것으로 메인 GUI 씬의 구조를 만들었습니다. 이 계획에 따라, Godot로 들어가 GUI를 만들 수 있습니다.
pt_br: Vamos precisar de contêineres extras dentro dos componentes individuais da UI, mas isso nos dá a estrutura da cena principal da GUI. Com este plano, podemos entrar no Godot e criar nossa GUI.
ru: Нам понадобятся дополнительные контейнеры внутри некоторых компонентов UI, но это дает нам структуру основной сцены GUI. С этим планом мы можем перейти в Godot и создать наш GUI.
uk: Нам будуть потрібні додаткові контейнери всередині окремих компонентів інтерфейсу, але наразі ми маємо основну структуру графічного інтерфейсу. Маючи такий план, ми можемо перейти в Godot і створити наш графічний інтерфейс.
zh_cn: 我们将需要在各个UI组件内添加额外的容器, 但这为我们提供了主GUI场景的结构. 有了这个计划, 我们可以进入Godot并创建我们的GUI.
zh_tw: 接著我們還需要在各個 UI 元件中加上其他的 Container，但整體的 GUI 場景結構就是這樣了。計劃好了以後我們就可以到 Godot 裡製作界面了。

source: Create the base GUI
cs: Vytvoření základu pro GUI
de: Erstellen der grundlegenden GUI
es: Crea el GUI base
fr: Créer les bases de l'interface utilisateur
ja: 基本GUIの作成
ko: 기초 GUI 만들기
pt_br: Crie a GUI base
ru: Создание базового GUI
uk: Створення базового GUI (графічного інтерфейсу)
zh_cn: 创建基本GUI
zh_tw: 建立基礎的 GUI

source: There are two possible approaches to the GUI: we can design elements in separate scenes and put them together, or prototype everything in a single scene and break it down later. I recommend working with a single scene as you can play with your UI's placement and proportions faster this way. Once it looks good, you can save entire sections of the node tree as reusable sub-scenes. We'll do that in a moment.
cs: Existují dva možné přístupy k GUI: můžeme navrhnout prvky v samostatných scénách a pak je dát dohromady, nebo prototypovat vše v jedné scéně a rozdělit ji později. Doporučuji pracovat s jednou scénou, protože takto se rychleji dostanete k hrátkám s umístěním a proporcemi vašeho uživatelského rozhraní. Jakmile to začne vypadat dobře, můžete jednoduše uložit celé sekce ze stromu uzlů jako opakovaně použitelné dílčí scény.
de: Es gibt zwei mögliche Herangehensweisen an die GUI: Wir können Elemente in getrennten Szenen entwerfen und zusammenführen oder alles in einer einzigen Szene entwerfen und diese stückweise aufbauen. Ich empfehle mit einer einzigen Szene zu arbeiten, weil man so schneller mit den Abständen und Größenverhältnissen der UI spielen kann. Wenn es dann gut aussieht, kann man ganze Abschnitte des Node-Baums als wiederverwendbare Unterszenen speichern. Das werden wir gleich tun.
es: Hay dos enfoques posibles para la GUI: podemos diseñar elementos en escenas separadas y ponerlos juntos, o hacer un prototipo de todo en una sola escena y descomponerlo más tarde. Se recomienda trabajar con una sola escena, ya que de esta manera se puede jugar con la ubicación y las proporciones de la UI más rápido. Una vez que se vea bien, puedes guardar secciones enteras del árbol de nodos como subescenas reutilizables. Haremos esto en un momento.
fr: Il y a deux approches possibles pour l'interface graphique : nous pouvons concevoir des éléments dans des scènes séparées et les assembler, ou bien faire un prototype du tout dans une seule scène et décomposer plus tard. Je vous recommande de travailler avec une seule scène car vous pouvez jouer avec l'emplacement et les proportions de votre interface utilisateur plus rapidement de cette façon. Une fois que ça a l'air bon, vous pouvez sauvegarder des sections entières de l'arborescence des nœuds en tant que sous-scènes réutilisables. Nous le ferons dans un instant.
ja: GUI の設計には、別々のシーンで要素を設計して組み合わせるか、単一のシーンですべてをプロトタイプ化して後で分解するか、という 2 つの方法があります。UI の配置と大きさ変更をより速く実行できるため、単一のシーンで作業する方をおすすめします。デザインの見栄えが良くなったら、ノード ツリーのセクション全体を再利用可能なサブシーンとして保存できます。詳しくは、このすぐ後に説明します。
ko: GUI에는 할 수 있는 두 가지 접근법이 있습니다: 별개의 씬에서 요소를 설계한 후 그 요소들을 함께 넣을 수 있습니다. 혹은 하나의 씬에서 모든 것을 기초 작업한 후 나중에 세부적으로 접근합니다. 저는 하나의 씬에서 작업하는 것을 추천합니다. UI의 배치 및 크기 조정을 더 빨리 할 수 있기 때문이죠. 일단 보기 좋게 만든 후, 노드 트리의 전체 섹션을 다시 사용할 수 있는 하위 씬으로 저장할 수 있습니다. 잠시 후 그렇게 할 것입니다.
pt_br: Existem duas abordagens possíveis para a GUI: podemos projetar elementos em cenas separadas e colocá-los juntos, ou prototipar tudo em uma única cena e dividi-la depois. Eu recomendo trabalhar com uma única cena, já que você pode brincar com a colocação da sua interface do usuário e proporções mais rapidamente dessa maneira. Quando estiver bom, você pode salvar seções inteiras da árvore de nós como sub-cenas reutilizáveis. Nós faremos isso em um momento.
ru: Есть два способа создания GUI: можно проектировать каждый элемент в отдельной сцене, или же сделать прототипы всех элементов в одной сцене и разбить это на сцены позже. Я рекомендую работать с одной сценой, ведь это позволит вам экспериментировать с пропорциями и я расположением элементов UI. Как только вы добьётесь желанного результата, можно будет сохранить целые разделы дерева узлов как отдельные сцены, которые можно будет переиспользовать. Мы сделаем это немного позже.
uk: Існує два можливі підходи до створення графічного інтерфейсу: ми можемо спроєктувати елементи в окремих сценах і, потім, скласти їх разом, або зразу створити усе в одній сцені, а розбити на окремі пізніше. Я рекомендую працювати з однією сценою, оскільки ви можете поекспериментувати і швидше визначитися з розміщенням та пропорціями інтерфейсу. Отримавши вигляд інтерфейсу який вас влаштовує, ви можете зберегти цілі секції дерева вузлів, як окремі сцени для багаторазового використання. Ми зробимо це пізніше.
zh_cn: GUI有两种可能的方法: 我们可以在单独的场景中设计元素并将它们放在一起, 或者在一个场景中对所有内容进行原型制作, 然后将其分解. 建议使用单个场景, 因为这样可以更快地处理UI的位置和比例. 一旦看起来不错, 就可以将节点树的整个部分保存为可重用子场景. 我们稍后就做.
zh_tw: 要製作 GUI 有兩種方法：先在分開的幾個場景中分別設計各個元素，最後再拼湊在一起；或是，先在單一個場景內設計所有東西的原始模型，之後再把他們拆分開來。這裡我推薦先在單一場景內製作，因為這樣一來就可以很輕鬆地測試各種 UI 的擺法以及大小的比例。看得順眼之後就可以將場景中其中一段場景樹保存為可以重複使用的子場景，這點稍後會說明。
