Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_game_user_interface.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: For now, let's start with a few containers.
cs: Prozatím začněme několika kontejnery.
de: Aber fangen wir erst mit einigen Containern an.
es: Por ahora, empecemos con algunos containers.
fr: Pour l'instant, commençons avec quelques conteneurs.
ja: では、いくつかのコンテナから始めましょう。
ko: 일단 적은 수의 컨테이너로 시작합시다.
pt_br: Por enquanto, vamos começar com alguns contêineres.
ru: Сейчас давайте начнем с нескольких контейнеров.
uk: Поки почнемо з кількох контейнерів.
zh_cn: 现在, 让我们从几个容器开始.
zh_tw: 現在，我們先從幾個容器開始。

source: Create a new scene and add a ``MarginContainer``. Select the node and name it ``GUI``.
cs: Vytvořte novou scénu a přidejte ``MarginContainer``. Vyberte uzel a pojmenujte ho ``GUI``.
de: Erstelle eine neue Szene und füge einen ``MarginContainer`` hinzu. Wähle den Node aus und nenne ihn ``GUI``.
es: Crea una nueva escena y añade un ``MarginContainer``. Selecciona el nodo y llámalo ``GUI``.
fr: Créez une nouvelle scène et ajoutez un ``MarginContainer``. Sélectionnez le nœud et nommez-le ``GUI``.
ja: 新しいシーンを作成し、 ``MarginContainer`` を追加します。そのノードを選択し、 ``GUI`` という名前を付けます。
ko: 새 씬을 만들고 ``MarginContainer``\ 를 추가하세요. 노드를 선택하고 ``GUI`` \ 라고 이름 지으세요.
ru: Создайте новую сцену и добавьте ``MarginContainer``. Выберите узел и назовите его ``GUI``.
uk: Створіть нову сцену та додайте ``MarginContainer``. Виберіть вузол і назвіть його ``GUI``.
zh_cn: 创建一个新场景并添加一个 ``MarginContainer``. 选择节点并将其命名为 ``GUI``.
zh_tw: 先建立一個新場景並新增 ``MarginContainer`` ，接著將其命名為 ``GUI`` 。

source: We want our interface to anchor to the top of the screen. Select the ``GUI`` node and click the Layout button at the top of the viewport. Select the ``Top Wide`` option. The ``GUI`` node will anchor to the top edge of its parent, the viewport by default. It will resize automatically on the vertical axis to make space for its child UI components.
cs: Chceme, aby se naše rozhraní ukotvilo k horní části obrazovky. Vyberte uzel ``GUI`` a klikněte na tlačítko Rozložení v horní části výřezu. Vyberte volbu ``Top Wide``. Uzel ``GUI`` se ukotví k hornímu okraji svojí nadřízené jednotky, ve výchozím nastavení je to výřez. Automaticky pak mění velikost na svislé ose, tak aby vytvořil prostor pro své podřízené komponenty uživatelského rozhraní.
de: Wir wollen, dass die Oberfläche am oberen Bildschirmrand verankert ist. Wähle den ``GUI``-Node aus und klicke auf die Schaltfläche Layout oben im Fenster. Wähle die Option ``Top Wide``. Der Node ``GUI`` wird am oberen Rand seines übergeordneten Elements verankert, standardmäßig dem Ansichtsfenster. Die vertikale Skalierung erfolgt automatisch so, dass für die untergeordneten UI-Komponenten genug Platz vorhanden ist.
es: Queremos que nuestra interfaz se ancle a la parte superior de la pantalla. Seleccione el nodo `` GUI`` y haga clic en el botón Layout en la parte superior de la vista. Seleccione la opción `` Top Wide``. El nodo `` GUI`` se anclará al borde superior de su padre, la vista por defecto. Se redimensionará automáticamente en el eje vertical para hacer espacio para sus componentes UI hijos.
fr: Nous voulons que notre interface s'ancre en haut de l'écran. Sélectionnez le nœud ``GUI`` et cliquez sur le bouton Mise en page en haut de la fenêtre. Sélectionnez l'option ``Top Wide``. Le nœud ``GUI`` s'ancre au bord supérieur de son parent, la fenêtre d'affichage par défaut. Il sera automatiquement redimensionné sur l'axe vertical pour faire de la place pour ses composants UI enfants.
ja: インターフェイスを画面の上部に固定する必要があります。\ ``GUI`` ノードを選択し、ビューポートの上部にある「レイアウト」ボタンをクリックして ``上伸長`` オプションを選択します。\ ``GUI`` ノードは、その親(デフォルトではビューポート)の上端に固定されます。子UIコンポーネント用のスペースを作るために、サイズは垂直軸上で自動的に変更されます。
ko: 인터페이스가 화면에 위에 고정되어 있어야 합니다. ``GUI`` 노드를 선택하고, 뷰포트 상단에 있는 레이아웃(Layout) 버튼을 클릭하세요. ``위쪽 넓게(Top Wide)`` 를 선택해 설정합니다. ``GUI`` 노드는 부모(기본값은 뷰포트)의 위쪽 모서리에 고정될 것입니다. 세로축은 자동으로 크기가 조절되어서 자손 UI 구성 요소가 들어갈 자리가 마련될 것입니다.
ru: Мы хотим, чтобы наш интерфейс был привязан к верхней части экрана. Выберите узел ``GUI`` и нажмите кнопку «Макет» в верхней части окна. Выберите опцию ``Top Wide``. Узел ``GUI`` будет привязан к верхнему краю родительского элемента, по умолчанию — к видовому экрану. Он будет автоматически изменять размер по вертикальной оси, чтобы дать пространство для его дочерних компонентов.
uk: Ми хочемо, щоб наш інтерфейс прив'язався до верхньої частини екрана. Виберіть вузол ``GUI`` і натисніть кнопку Макет у верхній частині вікна перегляду. Виберіть варіант ``Згори за шириною``. Вузол ``GUI`` прикріпиться до верхнього краю його предка, за замовчуванням до верхньої частини вікна. Він змінить розмір автоматично по вертикальній осі, щоб звільнити місце для своїх нащадків.
zh_cn: 我们希望我们的界面锚定到屏幕的顶部. 选择 ``GUI`` 节点并单击视图顶部的布局按钮. 选择 ``Top Wide(顶部宽)`` 选项. 默认情况下, ``GUI`` 节点将锚定到其父级的视图顶部. 它将在垂直轴上自动调整大小, 为其子UI组件腾出空间.
zh_tw: 我們要將界面固定在畫面的上方。選擇 ``GUI`` 節點並點擊檢視區上方的畫面配置按鈕。選擇 ``上延長`` 選項。 ``GUI`` 節點會自動固定在母節點（此處為檢視區）的上方。放入子節點後會自動調整縱軸的大小來為子 UI 元素騰出空間。

source: Save the scene as ``GUI.tscn``. We will put the entire GUI in it.
cs: Uložte scénu jako ``GUI.tscn``. Vložíme do ní celé GUI.
de: Speichere die Szene als ``GUI.tscn`` ab. Die gesamte GUI wird dort hineinkommen.
es: Guarda la escena como ``GUI.tscn``. Pondremos toda la interfaz gráfica (GUI) en ella.
fr: Enregistrez la scène sous le nom ``GUI.tscn``. Nous allons y mettre toute l'interface utilisateur graphique.
ja: シーンを ``GUI.tscn`` として保存します。 GUI全体をその中に配置します。
ko: ``GUI.tscn``\ 으로 씬을 저장하세요. 이 씬에 GUI 전체를 넣을 것입니다.
pt_br: Salve a cena como ``GUI.tscn``. Nós vamos colocar a GUI inteira dentro dela.
ru: Сохраните сцену как ``GUI.tscn``. Мы оставим весь GUI в нём.
uk: Збережіть сцену як ``GUI.tscn ``. Ми розмістимо в ній увесь графічний інтерфейс.
zh_cn: 将场景另存为 ``GUI.tscn``. 我们将整个GUI放入其中.
zh_tw: 將場景保存為 ``GUI.tscn`` 。我們會將所有 GUI 都放在裡面。

source: With the ``MarginContainer`` selected, head to the inspector and scroll down to the custom constants section. Unfold it and click the field next to each of the ``Margin`` properties. Set them all to ``20`` pixels. Next, add an ``HBoxContainer`` node. This one will contain our two bars on the left and separate them from the two counters on the right.
cs: S vybranou ``MarginContainer``, přejděte do Inspektora dolů do sekce custom constant. Rozbalte je a klikněte na pole vedle každé z vlastností ``Margin``. Nastavte je na ``20`` pixelů. Dále přidejte uzel ``HBoxContainer``. Bude obsahovat naše dva ukazatele vlevo a oddělí je od dvou čítačů napravo.
de: Wenn der ``MarginContainer`` ausgewählt ist, gehe zum Abschnitt "Custom Constants" im Inspektor. Klappe ihn aus und klicke jeweils auf das Feld neben der Eigenschaft ``Margin``. Setze alle Werte auf ``20`` Pixel. Füge als nächstes einen ``HBoxContainer``-Node hinzu. Dieser wird unsere beiden Leisten auf der linken Seite beinhalten und sie von den beiden Zählern auf der rechten Seite trennen.
es: Con el ``MarginContainer`` seleccionado, ve al inspector y baja a la sección de custom constants. Despliégala y haz clic en el campo junto a cada una de las propiedades ``Margin``. Ponlos a todos a ``20`` píxeles. A continuación, añade un nodo ``HBoxContainer``. Éste contendrá nuestras dos barras a la izquierda y las separará de los dos contadores a la derecha.
fr: Avec le ``MarginContainer`` sélectionné, dirigez-vous vers l'inspecteur et faites défiler vers le bas jusqu'à la section des constantes personnalisées. Dépliez-le et cliquez sur le champ à côté de chacune des propriétés ``Margin``. Réglez-les tous sur ``20`` pixels. Ensuite, ajoutez un nœud ``HBoxContainer``. Celui-ci contiendra nos deux barres à gauche et les séparera des deux compteurs à droite.
ja: ``MarginContainer`` を選択した状態で、インスペクタに移動し、カスタム定数(Custom Constants)のセクションまで下にスクロールします。これを展開し、各 ``Margin`` プロパティの横のフィールドをクリックします。すべてを ``20`` ピクセルに設定します。次に、 ``HBoxContainer`` ノードを追加します。これは、左側に2本のバーがあり、右側の2つのカウンターと分けてあります。
ko: ``MarginContainer``\ 를 선택한 채로, 인스펙터(Inspector)로 가서 Custon Constants 섹션으로 내려가세요. 접힌 상태를 펼쳐주고, 각 ``Margin`` 속성의 옆에 있는 영역을 클릭하세요. 모두 ``20`` 픽셀로 설정하세요. 다음으로, ``HBoxContainer`` 노드를 추가하세요. 이 컨테이너에는 왼쪽에 있으면서 두 개의 막대가 들어갈 것입니다. 그러면서 오른쪽에 있는 두 개의 카운터와 분리할 것입니다.
pt_br: Com o ``MarginContainer`` selecionado, vá para o inspetor e desça até a seção de constantes personalizadas. Abra-o e clique no campo ao lado de cada uma das propriedades ``Margin``. Defina todos eles para pixels ``20``. Em seguida, adicione um nó ``HBoxContainer``. Este conterá nossas duas barras à esquerda e as separará dos dois contadores à direita.
ru: Выбрав ``MarginContainer``, направляйтесь к инспектору и прокрутите вниз до раздела пользовательских констант(custom constants). Разверните его и щелкните на поле рядом с каждым из свойств ``Margin``. Установите их все на ``20`` пикселей. Затем добавьте узел ``HBoxContainer``. Он будет содержать наши две шкалы слева и отделять их от двух счетчиков справа.
uk: З вибраним ``MarginContainer`` перейдіть до інспектора та прокрутіть униз до розділу *Custom Constants*. Розгорніть його та встановіть кожну із властивостей ``Margin`` на ``20`` пікселів. Далі додайте вузол ``HBoxContainer``. Він буде містити дві шкали зліва та, окремо, два лічильника справа.
zh_cn: 选择 ``MarginContainer`` 后, 前往属性检查器并向下滚动到自定义常量部分. 展开它, 然后点击每个 ``Margin`` 属性旁边的字段. 将它们全部设置为 ``20`` 像素. 接下来, 添加一个 ``HBoxContainer`` 节点. 接下来, 添加一个 `HBoxContainer` 节点. 这一个将在左侧包含我们的两个条, 并将它们与右侧的两个计数器分开.
zh_tw: 選擇 ``MarginContainer`` 後，到屬性面板並滾動到 Custom Constants（自定常數）段落，將其展開後點擊每個 ``Margin`` 屬性右邊的欄位並設為 ``20`` px。接著，新增一個 ``HBoxContainer`` 節點，這個節點會用來把左側的兩個計量槽與右邊的兩個計數器分開來。

source: We want to stack the bars vertically inside the ``HBoxContainer``. Add a ``VBoxContainer`` as a child of ``HBoxContainer`` and name it ``Bars``. Select the parent ``HBoxContainer`` again and this time, add another ``HBoxContainer`` as a child of it. Call it ``Counters``. With these four containers, we have the base for our GUI scene.
cs: Chceme naskládat pruhy svisle dovnitř ``HBoxContainer``. Přidejte ``VBoxContainer`` jako dítě ``HBoxContainer`` a pojmenujte ho ``Bars``. Znovu vyberte rodičovský ``HBoxContainer`` a tentokrát přidejte jako jeho dítě další ``HBoxContainer``. Říkejme mu ``Counters``. S těmito čtyřmi kontejnery máme základ pro naši grafickou scénu.
de: Wir wollen die Leisten senkrecht im ``HBoxContainer`` stapeln. Füge einen ``VBoxContainer`` als Kind von ``HBoxContainer`` hinzu und nenne ihn ``Bars``. Wähle den übergeordneten ``HBoxContainer`` wieder aus und füge diesmal noch einen ``HBoxContainer`` als Kind hinzu. Nenne ihn ``Counters``. Diese vier Behälter stellen die Grundlage unserer GUI-Szene dar.
es: Queremos colocar las barras verticalmente dentro del ``HBoxContainer``. Para hacer esto, agregaremos un ``VBoxContainer``. Nómbralo ``Bars``. Selecciona el padre ``HBoxContainer`` nuevamente y agrega otro ```HBoxContainer`` como hijo. Este contendrá los contadores, así que llámalo ``Counters``. Con estos cuatro Containers, tenemos la base para nuestra escena GUI.
fr: Nous voulons empiler les barres verticalement à l'intérieur du ``HBoxContainer``. Pour ce faire, ajoutez un ``VBoxContainer`` comme enfant du ``HBoxContainer`` et donnez-lui le nom de ``Bars``. Sélectionnez à nouveau le parent ``HBoxContainer`` et cette fois, ajoutez comme enfant un autre ``HBoxContainer``. Celui-ci contiendra les compteurs, alors appelez-le ``Counters``. Avec ces quatre conteneurs, nous avons la base de notre scène GUI.
ja: まずは ``HBoxContainer`` 内にバーを垂直に積み重ねたいと思います。 ``HBoxContainer`` の子として ``VBoxContainer`` を追加し、それに ``Bars`` という名前を付けます。次に、親になった ``HBoxContainer`` を再度選択し、その子として別の ``HBoxContainer`` を追加します。それを ``Counters`` と呼びます。これらの4つのコンテナにより、GUIシーンのベースができました。
ko: ``HBoxContainer`` 안에 막대를 수직으로 쌓아야 합니다. ``VBoxContainer``\ 를 ``HBoxContainer``\ 의 자손으로 추가하세요. 그리고 이름은 ``Bars``\ 라고 지으세요. 부모 ``HBoxContainer``\ 를 다시 선택하고, 이번에는 다른 ``HBoxContainer``\ 를 자손으로 추가하세요. 이것의 이름은 ``Counters``\ 라고 지으세요. 네 개의 컨테이너로, GUI 씬의 기초를 만들었습니다.
uk: Ми хочемо укласти шкали вертикально всередину ``HBoxContainer``. Додайте до ``HBoxContainer`` в нащадки``VBoxContainer`` і назвіть його ``Bars`` (Шкали). Виберіть ``HBoxContainer`` ще раз, і додайте в нащадки ще один ``HBoxContainer``. Назвіть його ``Counters``. З цими чотирма контейнерами ми маємо базу для нашої сцени GUI.
zh_cn: 我们想将条形图垂直堆叠在 ``HBoxContainer`` 中. 添加一个 ``VBoxContainer`` 作为 ``HBoxContainer`` 的子项, 并将其命名为 ``Bars``. 再次选择父级 ``HBoxContainer``, 这次添加另一个 ``HBoxContainer`` 作为其子级. 称之为 ``Counters``. 有了这四个容器, 我们就为我们的GUI场景奠定了基础.
zh_tw: 我們要在 ``HBoxContainer`` 內垂直堆疊兩個計量槽。將 ``VBoxContainer`` 新增為 ``HBoxContainer`` 的節點，並命名為 ``Bars`` 。再選擇一次母節點的 ``HBoxContainer`` ，這次再新增一另一個 ``HBoxContainer`` 子節點，並命名為 ``Couters`` 。有了這四個容器，我們就有基本的 GUI 場景了。

source: You should have 4 containers that look like this
cs: Měli byste získat 4 kontejnery, které vypadají takto
de: Du solltest 4 Container haben, die so aussehen
es: Deberías tener 4 contenedores que se vean así
fr: Vous devriez avoir 4 conteneurs ressemblant à ceci
ja: このようにコンテナが4つあるはずです。
ko: 4 개의 컨테이너가 이렇게 있어야 합니다
pt_br: Você deve ter 4 contêineres parecidos com este
ru: У нас должны быть 4 контейнера, которые выглядят так
uk: У вас повинно бути 4 контейнери, які виглядають так
zh_cn: 你应该有4个看起来像这样的容器
zh_tw: 現在應該有看起來像這樣的四個容器

source: We can work this way because we first broke down our UI design and took a few moments to think about the containers we'd use. When you follow a tutorial like this, it may seem weird. But once you're working on real games, you'll see it's an efficient workflow.
cs: Takto můžeme pracovat, protože jsme nejprve náš návrh uživatelského rozhraní rozebrali a vyhradili jsme si krátkou chvilku na popřemýšlení o kontéjnerech, které bychom měli použít. Když budete postupovat v souladu s tímto turoriálem, může se to zdát na první pohled divné. Ale při práci na skutečných hrách, poznáte, že je to velice efektivní postup.
de: Wir können so vorgehen, weil wir uns vorher kurz Zeit genommen haben, um den Aufbau der UI zu umreißen und die passenden Container auszusuchen. Wenn du einer Anleitung wie dieser hier folgst, mag dir das unverständlich vorkommen. Aber wenn du erstmal an echten Spielen arbeitest, wirst du erkennen, dass es eine effiziente Arbeitsweise ist.
es: Podemos trabajar de esta manera porque en primer lugar descompusimos nuestro diseño de UI y nos tomamos unos minutos para pensar en los contenedores que usaríamos. Cuando sigues un tutorial como este, puede parecer extraño. Pero una vez que estés trabajando en juegos reales, verás que es un flujo de trabajo eficiente.
fr: Nous pouvons travailler de cette façon car nous avons d'abord décomposé la conception de notre interface utilisateur puis nous avons pris quelques instants pour réfléchir aux conteneurs que nous allons utiliser. Quand vous suivez un tutoriel comme celui-ci, cela peut sembler bizarre, mais lorsque vous travaillerez sur de vrais jeux, vous verrez qu'il s'agit d'une méthode de travail efficace.
ja: 最初にUIデザインを分解し、使うコンテナについて少し考えたので、このように作ることができます。チュートリアルでは奇妙に思えるかもしれません。しかし実際のゲームで作業してみると、効率的なワークフローであることがわかります。
ko: 이 방법이 가능한 이유는, 먼저 UI 설계를 파헤치고 사용할 컨테이너에 대해 생각할 시간을 가졌기 때문입니다. 이 튜토리얼을 따라갈 때, 이상하다고 느꼈을 지도 모릅니다. 하지만 실제 게임을 작업해본다면, 이것이 효율적인 워크플로라는 것을 보게될 것입니다.
pt_br: Podemos trabalhar dessa maneira porque primeiro desmembramos o design da interface do usuário e levamos alguns momentos para pensar nos recipientes que usaríamos. Quando você segue um tutorial como esse, pode parecer estranho. Mas quando você estiver trabalhando em jogos reais, verá que é um fluxo de trabalho eficiente.
uk: Ми можемо працювати таким чином, тому що ми спочатку розбили наш дизайн інтерфейсу і потратили кілька хвилин, щоб подумати над тим, які контейнери будемо використовувати. Такий підхід може видатися дивним. Але як тільки ви почнете працювати над реальними іграми, ви переконаєтеся, що це ефективний робочий процес.
zh_cn: 之所以可以这样做, 是因为我们首先分解了UI设计, 并花了一些时间来考虑要使用的容器. 当你学习这样的教程时, 可能会觉得很奇怪. 但是一旦你在真正的游戏中工作, 你就会发现它是一种高效的工作流程.
zh_tw: 會這樣做是因為我們先把 UI 設計拆解開來，並花了一點時間來設計如何使用 Container。跟著這個教學做的時候可能會感覺有點奇怪。但之後你在實際的遊戲上做過之後就會慢慢瞭解這個工作流程有多有效率了。

source: Create the bars' base
cs: Vytvoření základu pro uzel Bars
de: Erstellen der Grundlage der Leiste
es: Crear la base de las barras
fr: Créez la base des barres
ja: バーのベースを作成する
ko: Bars의 기초 만들기
pt_br: Crie as barras de base
ru: Создание базы для шкал прогресса
uk: Створення бази для шкал
zh_cn: 创建条形基础
zh_tw: 建立基礎計量槽

source: Each bar is split into two sub-elements that align horizontally: the label with the health count on the left, and the gauge on the right. Once again, the ``HBoxContainer`` is the perfect tool for the job. Select the ``Bars`` node and add a new ``HBoxContainer`` inside of it. Name it ``Bar``.
cs: Každý sloupec je rozďelen na dva dílčí prvky, které jsou zarovnané vodorovně: štítek se stavem zdraví vlevo a měřidlo vpravo. ``HBoxContainer`` je opět dokonalým nástrojem pro tuto práci. Vyberte uzel ``Bars`` a přidejte do něj nový ``HBoxContainer``. Pojmenujte jej ``Bar`` .
de: Jede Leiste besteht aus zwei Unterelementen, die waagerecht ausgerichtet sind: die Beschriftung mit dem Gesundheitszähler links und die Anzeige rechts. Abermals ist hier der ``HBoxContainer`` bestens geeignet. Wähle den Node ``Bars`` aus und füge darin einen neuen ``HBoxContainer`` ein. Nenne ihn ``Bar``.
es: Cada barra se divide en dos subelementos que se alinean horizontalmente: la etiqueta con el contador de salud a la izquierda y el medidor a la derecha. Una vez más, el ``HBoxContainer`` es la herramienta perfecta para el trabajo. Selecciona el nodo ``Bars`` y añade un nuevo ``HBoxContainer`` dentro de él. Nómbralo ``Bar``.
fr: Chaque barre est divisée en deux sous-éléments qui s'alignent horizontalement : Le label avec le compteur de vie à gauche et la jauge à droite. Une fois de plus, le ``HBoxContainer`` est l'outil parfait pour le travail. Sélectionnez le nœud ``Bars`` et ajoutez un nouveau ``HBoxContainer`` à l'intérieur. Donnez-lui le nom de ``Bar``.
ja: 各バーは、水平方向に整列する2つのサブ要素に分割されます。左側が体力・カウントのラベル、右側がゲージです。繰り返しになりますが、 ``HBoxContainer`` はこの作業に最適なツールです。 ``Bars`` ノードを選択し、その中に新しい ``HBoxContainer`` を追加します。 ``Bar`` という名前を付けます。
ko: 각 막대는 나란히 놓인 두 개의 하위 요소로 나뉩니다: 체력을 세는 라벨이 왼쪽, 그리고 게이지가 오른쪽에 있습니다. 다시 말하지만, ``HBoxContainer``\ 는 이 일에 최적한 도구입니다. ``Bars`` 노드를 선택하고, 새 ``HBoxContainer``\ 를 안에 추가하세요. 이름은 ``Bar``\ 라고 지으세요.
pt_br: Cada barra é dividida em dois subelementos que se alinham horizontalmente: o rótulo com a contagem de integridade à esquerda e o indicador à direita. Mais uma vez, o ``HBoxContainer`` é a ferramenta perfeita para o trabalho. Selecione o nó ``Bars`` e adicione um novo ``HBoxContainer`` dentro dele. Nomeie-o ``Bar``.
ru: Каждая шкала делится на два подэлемента, которые выравниваются по горизонтали: ярлык с количеством здоровья слева и датчик справа. Еще раз, ``HBoxContainer`` является идеальным инструментом для работы. Выберите узел ``Bars`` и добавьте новый ``HBoxContainer`` внутри него. Назовите его ``Bar``.
uk: Кожна шкала розділена на два піделементи, які вирівнюються по горизонталі: мітка з кількістю здоров’я зліва та сама шкала справа. Знову ``HBoxContainer`` ідеальний інструмент для роботи. Виберіть вузол ``Bars`` і додайте йому ``HBoxContainer`` всередину. Назвіть його ``Bar``.
zh_cn: 每个条形图拆分为两个水平对齐的子元素: 带有健康计数的标签在左侧, 量规在右侧. 再次, ``HBoxContainer`` 是完成这项工作的理想工具. 选择 ``Bars`` 节点, 并在其中添加一个新的 ``HBoxContainer``. 将其命名为 ``Bar``.
zh_tw: 每個計量槽都可以再拆分成水平的兩個子元素：左邊有寫著血量的 Label，右邊有計量槽。這裡再強調一次，這種做法很適合用 ``HBoxContainer`` 。先選擇 ``Bars`` 節點，並在其中新增一個 ``HBoxContainer`` ，命名為 ``Bar`` 。
