Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_game_user_interface.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: As they have a container as their direct parent, we cannot move them freely: the ``Count`` node will always reset their anchors, their size and position. Try to move and resize the nodes in the viewport. Then, select any of the three textures and press :kbd:`Ctrl + Up` or :kbd:`Ctrl + Down` to reorder them in the Scene dock. They'll snap back to their previous size and position.
cs: Protože mají jako svého přímého rodiče kontejner, nemůžeme je volně přesouvat: uzel ``Count`` vždy resetuje jejich kotvy, velikost a polohu. Zkuste přesunout a změnit velikost uzlů ve výřezu. Poté vyberte libovolně nějakou ze tří textur a stiskněte :kbd:`Ctrl + Up` nebo :kbd:`Ctrl + Down`, chcete-li je změnit v doku scény. Vrátí se zpět do své předchozí velikosti a polohy.
es: Como tienen un container como su padre directo, no podemos moverlos libremente: el nodo ``Count`` siempre reajustará sus anclas, su tamaño y posición. Intenta mover y cambiar el tamaño de los nodos en la ventana de visualización. A continuación, selecciona cualquiera de las tres texturas y pulsa :kbd:`Ctrl + Arriba` or :kbd:`Ctrl + Abajo` para reordenarlas en el panel de Escena. Volverán a su tamaño y posición anteriores.
fr: Comme ils ont un conteneur comme parent direct, nous ne pouvons pas les déplacer librement : le nœud ``Count`` réinitialise toujours leurs ancres, leur taille et leur position. Essayez de déplacer et de redimensionner les nœuds dans la fenêtre d'affichage. Ensuite, sélectionnez l'une des trois textures et appuyez sur :kbd:`Ctrl + Up` ou :kbd:`Ctrl + Down` pour les réorganiser dans le dock Scène. Ils retrouveront leur taille et leur position antérieures.
ja: これらは直接の親としてコンテナを持つため、自由に移動することはできません。\ ``Count`` ノードは常にアンカー、サイズ、位置をリセットします。ビューポート内のノードを移動およびサイズ変更してみてください。次に、3つのテクスチャのいずれかを選択し、\ :kbd:`Ctrl + Up` または :kbd:`Ctrl + Down` を押して、シーンドックでそれらの順序を変更します。元のサイズと位置に戻ります。
ko: 컨테이너를 직접 부모로 가지고 있으므로 자유롭게 이동할 수 없습니다. ``Count`` 노드는 항상 자손 노드의 앵커(Anchor), 크기, 위치를 초기화할 것입니다. 이 노드들을 뷰포트에서 움직이거나 크기를 조절해보세요. 그런 다음 이 세 개의 텍스처 중 하나를 선택하고, 씬(Scene) 독에서 :kbd:`Ctrl + Up` or :kbd:`Ctrl + Down`를 눌러서 노드의 순서를 다시 정렬해보세요. 노드들은 이전의 크기와 위치로 돌아갈 것입니다.
uk: Оскільки у них є контейнер в якості прямого предка, ми не можемо вільно їх переміщувати: вузол ``Count``буде скидати їх прив'язки, розмір і положення. Спробуйте перемістити та змінити розміри вузлів у вікні перегляду. Потім виберіть будь-яку з трьох текстур і натисніть ``Ctrl + Up``, або ``Ctrl+Down``, щоб спробувати впорядкувати їх в Сцені. Вони повернуться до попереднього розміру та положення.
zh_cn: 因为它们有一个container节点(容器类节点)作为其直接的父节点, 所以我们无法自由移动它们:``Count`` 节点将始终重置其锚, 其大小和位置. 尝试移动视图中的节点并调整其大小. 然后, 选择三个纹理中的任何一个, 然后按 :kbd:`Ctrl Up` 或 :kbd:`Ctrl Down` 在场景停靠面板中对其重新排序. 他们将恢复到之前的大小和位置.
zh_tw: 由於這幾個元素都直接接在容器的底下作為 **直接子節點**，所以我們沒辦法自由地移動這些節點： ``Count`` 節點會自動重設子節點的錨點、大小、與位置。如果試著在檢視區裡移動或縮放子節點後，在場景 Dock 內選中任意一個紋理貼圖並按鍵盤 :kbd:`Ctrl + Up` 或 :kbd:`Ctrl + Down` 來重新排列，則這幾個節點都會自動回到原來的位置與大小。

source: Parent containers control the size, the scale, the margins, and the anchors of their direct children. To modify the nodes, you must nest them inside a regular Control or another UI element. We'll use the ``Background`` as a parent for the ``Title`` and ``Number``. Select both the ``Title`` and ``Number``, and drag and drop them onto ``Background``.
cs: Nadřazené kontejnery řídí velikost, měřítko, okraje a kotvy svých přímých podřízených. Chcete-li uzly upravit, musíte je vnořit do běžného ovládacího prvku nebo jiného prvku uživatelského rozhraní. ``Backround`` použijeme jako nadřazený prvek pro ``Title`` a ``Number``. Vyberte ``Title`` i ``Number`` a přetáhněte je na ``Backround``.
de: Elterncontainer geben die Größe, Verhältnisse, Ränder und Anker ihrer unmittelbaren Kinder vor. Um die Knoten zu bearbeiten musst du sie in einem gewöhnlichen Control- oder einem anderen UI-Element verschachteln. Wir werden den ``Background`` als Elter für den ``Titel`` und ``Number``. Wähle ``Title`` und ``Number`` beide aus und ziehe sie auf ``Background``.
es: Los containers padres controlan el tamaño, la escala, los márgenes y las anclas de sus hijos directos. Para modificar los nodos, debes anidarlos dentro de un Control normal u otro elemento de la UI. Usaremos el ``Background`` como padre para el ``Title`` y ``Number``. Selecciona tanto el ``Title`` como el ``Number``, arrástralos y suéltalos en ``Background``.
fr: Les conteneurs parents contrôlent la taille, l'échelle, les marges et les ancres de leurs enfants directs. Pour modifier les nœuds, vous devez les imbriquer à l'intérieur d'un Control standard ou d'un autre élément de l'interface utilisateur. Nous utiliserons ``Background`` comme parent pour ``Title`` et ``Number``. Sélectionnez ``Title`` et ``Number``, puis faites-les glisser-et déposez les sur ``Background``.
ja: 親コンテナは、直接の子のサイズ、スケール、マージン、アンカーを制御します。ノードを変更するには、通常のControlまたは別のUI要素内にノードをネストする必要があります。 ``Title`` とナンバーの親として ``Background`` を使用します。 ``Title`` と ``Number`` の両方を選択し、 ``Background`` にドラッグ&ドロップします。
ko: 부모 컨테이너는 바로 아래 자손의 크기, 스케일, 여백, 그리고 앵커를 제어합니다. 노드를 수정하려면, 일반적인 Control이나 다른 UI 요소안에 노드를 중첩해야 합니다. ``Background``\ 를 ``Title``\ 과 ``Number``\ 의 부모로 사용할 것입니다. ``Title``\ 과 ``Number``\ 를 둘 다 선택하세요. 그리고 ``Background``\ 로 드래그 앤 드롭하세요.
pt_br: Contêineres pai controlam o tamanho, a escala, as margens e as âncoras de seus filhos diretos. Para modificar os nós, você deve aninhá-los dentro de um controle regular ou outro elemento da interface do usuário. Vamos usar o ``Background`` como pai para o ``Title`` e ``Number``. Selecione o ``Title`` e ``Number``, arraste-os e solte-os no ``Background``.
ru: Родительские контейнеры управляют размером, масштабом, отступами и якорями их дочерних элементов. Чтобы изменить узлы, необходимо вложить их в обычный элемент управления Control или другой элемент UI. Мы будем использовать ``Background`` в качестве родителя для ``Title`` и``Number``. Выберите ``Title`` and ``Number``, и перетащите их на ``Background``.
uk: Предки-контейнери контролюють розмір, масштаб, поля та прив'язки їхніх прямих нащадків. Щоб змінити вузли, потрібно вкласти їх у звичайний елемент управління Control, або інший елемент інтерфейсу. Ми будемо використовувати ``Background`` в якості предка для ``Title`` та ``Number``. Виберіть ``Title`` і ``Number``, і перетягніть їх на ``Background``.
zh_cn: 父容器控制其直接子代的大小, 比例, 边距和锚点. 若要修改节点, 必须将它们嵌套在常规 ``Control`` 或另一个UI元素中. 我们将使用 ``Background`` 作为 ``Title`` 和 ``Number`` 的父元素. 选择 ``Title`` 和 ``Number``, 然后拖放到 ``Background`` 上.
zh_tw: 母容器會控制其直接子節點的大小、比例、外邊距、與錨定。要修改節點則必須在容器裡面嵌套一個一般的 Control 節點或其他 UI 元素。這裡我們會使用 ``Background`` 作為 ``Title`` 與 ``Number`` 的母節點。將選擇 ``Title`` 與 ``Number`` ，並將這兩個節點都拖曳至 ``Background`` 中。

source: By using the Background node as the two textures' parent, we take control away from the Count MarginContainer
cs: Použitím uzlu Backround jako rodiče těchto dvou textur převezmeme jejich kontrolu od uzlu Count typu MarginContainer
de: Indem wir den Background-Node als Elter der beiden Texturen benutzen, entziehen wir dem Count-MarginContainer die Kontrolle
es: Usando el nodo Background como padre de las dos texturas, le quitamos el control al Count MarginContainer
fr: En utilisant le nœud Background comme parent des deux textures, nous prenons le contrôle du Count MarginContainer
ja: Backgroundノードを2つのテクスチャの親として使用することで、Count (MarginContainer)による制御を取り除きます
ko: Background 노드를 두 텍스처의 부모로 사용했기 때문에, Count MarginContainer로 부터 자유로워졌습니다
pt_br: Usando o nó Background como o pai das duas texturas, retiramos o controle do Count MarginContainer
ru: Используя узел Background в качестве родителя для двух текстур, мы берем под контроль Count который является MarginContainer'ом
uk: Використовуючи вузол Background в якості предка, ми відбираємо контроль від Count, який є контейнером MarginContainer
zh_cn: 通过将 ``Background`` 节点用作两个纹理的父级, 我们将控制权从 ``Count``, 即 ``MarginContainer`` 节点移开
zh_tw: 使用 Background 節點作為兩個紋理貼圖的母節點便能脫離 Count 節點的 MarginContainer 的控制

source: Select the ``Title`` and in the Inspector, change its ``Stretch Mode`` property to ``Keep Centered``. Next find the ``Rect`` category in the Inspector and change the ``Size`` property to (50, 40) so it only takes the left half of the background. Next, select the ``Number`` node. In the viewport, click the ``Layout`` menu and click ``Full Rect``. The node will resize to fit the ``Background``. Head to the Inspector and change its ``Align`` property to ``Right``, and the ``Valign`` property to ``Center``. The text should snap to the center of the ``Background``'s right edge. Resize the node horizontally, so it takes the right half of the ``Background`` and there's a bit of padding with the right edge.
cs: Vyberte ``Title`` a v Inspektoru změňte jeho vlastnost ``Stretch mode`` na ``Keep Centered``. Dále najděte v Inspektoru kategorii ``Rect`` a změňte vlastnost ``Size`` na (50, 40), aby tedy zabíral jen levou polovinu pozadí. Dále vyberte uzel ``Number``. Ve výřezu (viewport) klikněte na nabídku ``Rozložení`` a změňte na ``Full Rect``. Velikost uzlu se změní tak, aby vyplnila ``Backround``. Vraťte se do Inspektora a změňte vlastnosti ``Align`` na ``Right`` a vlastnost ``Valign`` na ``Center``. Text by se měl přichytit ke středu pravého okraje ``Backround``. Změňte velikost uzlu vodorovně, tak aby zabral pravou polovinu ``Backround`` a zbývalo trochu místa k pravému okraji.
de: Wählen Sie den ``Title`` und änderen Sie seine Eigenschaft ``Stretch Mode`` im Inspektor zu ``Keep Centered``. Finden Sie danach die Kategorie ``Rect`` im Inspektor und änderen Sie die Eigenschaft ``Size`` zu (50, 40), damit er nur die linke Hälfte des Hintergrunds einnimmt. Wählen Sie als nächstes den Node ``Number`` aus. Klicken Sie im Hauptfenster das ``Layout``-Menü an und klicken auf ``Full Rect``. Die Größe des Nodes ändert sich und passt seine Größe dem ``Background`` an. Gehen Sie zum Inspector und ändere seine Eigenschaft ``Align`` zu ``Right`` und ``VAlign`` zu ``Center``. Der Text sollte in der Mitte des rechten Randes von ``Background`` einrasten. Änderen Sie nun die Breite des Nodes, damit er die rechte Hälfte des ``Background`` einnimmt und am rechten Rand noch etwas Raum bleibt.
es: Selecciona ``Title`` y, en el Inspector, cambia la propiedad ``Stretch Mode`` por ``Keep Centered``. A continuación, busca la categoría ``Rect`` en el Inspector y cambia la propiedad ``Size`` a (50, 40) para que sólo ocupe la mitad izquierda del fondo. A continuación, selecciona el nodo ``Number``. En la ventana de visualización (viewport), haz clic en el menú ``Disposición`` y, seguidamente, en ``Full Rect``. El nodo cambiará su tamaño para que se ajuste al ``Background``. Dirígete al Inspector y cambia su propiedad ```Align`` por ``Right``, y la propiedad ```Valign`` por ``Center``. El texto debe encajar en el centro del borde derecho del ``Background``. Redimensiona el nodo horizontalmente para que tome la mitad derecha del ``Background`` y haya un poco de relleno en el lado derecho.
fr: Sélectionnez le ``Title`` et dans l'inspecteur, changez sa propriété ``Stretch Mode`` pour ``Keep Centered``. Trouvez ensuite la catégorie ``Rect`` dans l'inspecteur et changez la propriété ``Size`` en (50, 40) pour qu'il ne prenne que la moitié gauche de l'arrière-plan. Ensuite, sélectionnez le nœud ``Number``. Dans la barre d'outils de la fenêtre d'affichage, cliquez sur le menu ``Layout`` et cliquez sur ``Full Rect``. Le nœud sera redimensionné pour s'adapter au ``Background``. Rendez-vous dans l'inspecteur et changez sa propriété ``Align`` en ``Right`` et la propriété ``VAlign`` en ``Center``. Le texte doit s'accrocher au centre du bord droit de ``Background``. Redimensionner le nœud horizontalement pour qu'il prenne la moitié droite de ``Background`` et qu'il y ait un peu de place avec le bord droit.
ja: ``Title`` を選択し、インスペクタで ``Stretch Mode`` プロパティを ``Keep Centered`` に変更します。次に、インスペクタで ``Rect`` カテゴリを見つけ、 ``Size`` プロパティを(50,40)に変更して、背景の左半分のみを取るようにします。次に、 ``Number`` ノードを選択します。ビューポートで、 ``レイアウト`` メニューをクリックし、 ``Rect全面`` をクリックします。ノードは ``Background`` に合うようにサイズ変更されます。インスペクタに移動し、その ``Align`` プロパティを ``Right`` に変更し、 ``Valign`` プロパティを ``Center`` に変更します。テキストは ``Background``の右端の中央にスナップするはずです。ノードを水平方向にサイズ変更して、 ``Background``の右半分を取り、右端に少しパディングを追加します。
ko: 인스펙터(Inspecter)에서 ``Title``\ 을 선택하고, ``Stretch Mode`` 속성을 ``Keep Centered``\ 로 바꾸세요. 다음으로, 인스펙터(Inspecter)에서 ``Rect`` 카테고리로 가서 ``Size`` 속성을 (50, 40)으로 바꾸세요. Background의 왼쪽 절반만 차지하게 될 것입니다. 다음은 ``Number`` 노드를 선택하세요. 뷰포트에서 ``레이아웃(Layout)`` 메뉴를 클릭하고 ``사각형 전체(Full Rect)``\ 을 클릭하세요. 노드는 ``Background``\ 에 맞게 크기가 조절됩니다. 인스펙터(Inspecter)로 가서 ``Align`` 속성을 ``Right``\ 로 바꾸세요. 그리고 ``Valign`` 속성은 ``Center`` 로 바꾸세요. 글자는 ``Background``\ 의 오른쪽 모서리의 중심에 고정될 것입니다. 노드 크기를 수평으로 조절하세요. 그러면 이제 ``Background``\ 의 오른쪽 절반을 차지하면서, 오른쪽 모서리에는 약간의 여백을 갖게 됩니다.
uk: Виберіть ``Title`` і в інспекторі змініть його властивість ``Stretch Mode`` на ``Keep Centered``. Далі знайдіть розділ ``Rect`` в Інспекторі та змініть властивість ``Size`` на (50, 40), щоб позначка займала лише ліву половину фону. Далі виберіть вузол ``Number``. У вікні перегляду виберіть меню ``Макет`` та клацніть ``Увесь прямокутник``. Вузол відповідно розтягнеться на увесь ``Background``. Поверніться до Інспектора і змініть його властивість ``Align`` на ``Right``, а властивість ``Valign`` на ``Center``. Текст повинен прилягати до центру правого краю ``Background``. Змініть розмір вузла по горизонталі, щоб він зайняв праву половину ``Background``, але з правого краю залишився невеликий відступ.
zh_cn: 选择 ``Title``, 然后在属性检查器中, 将其 ``拉伸模式(Stretch Mode)`` 属性更改为 ``保持居中(Keep Centered)``. 接下来, 在属性检查器中找到 ``Rect`` 类别, 并将 ``Size`` 属性更改为 (50, 40), 使其仅占据背景的左半部分. 接下来, 选择 ``Number`` 节点. 在视图中, 点击 ``Layout`` 菜单并点击 ``Full Rect``. 节点将调整大小以适合 ``Background``. 前往属性检查器并将其 ``Align`` 属性更改为 ``Right``, 将 ``Valign`` 属性更改为 ``Center``. 文本应对齐到 ``Background`` 右边缘的中心. 水平调整节点的大小, 因此它占据了 ``Background`` 的右半部分, 并且右边缘有一些填充.
zh_tw: 在屬性面板中選擇 ``Title`` 並將 ``Stretch Mode`` 屬性改為 ``Keep Centered`` 。接著在屬性面板中找到 ``Rect`` 分類並將 ``Size`` 屬性改為 (50, 40) ，這樣一來便只會佔用背景的一半大小。接著，選擇 ``Number`` 節點，並在檢視區中點擊 ``畫面配置`` 選單並點擊 ``全矩形`` 。節點會自動縮放並佔滿整個 ``Background`` 。再來看屬性面板，將 ``Align`` 屬性改為 ``Right`` ，並將 ``Valign`` 屬性改為 ``Center`` 。現在文字應該會吸附在 ``Background`` 的右邊中間。調整節點的水平大小為 ``Background`` 的一半，並在右邊留一點空白。

source: Here's how the nodes' bounding boxes should look in the viewport. Keep it rough, you don't need to place them too precisely for now.
cs: Ohraničovací rámečky uzlů by měly vypadat ve výřezu takto. Přibližně. V tuto chvíli nejde o přesnost umístění.
de: So sollten die Bounding Boxes der Nodes im Ansichtsfenster aussehen. Vorerst reicht eine grobe Platzierung aus.
es: Así es como deberían verse los cuadros de delimitación de los nodos en la ventana de visualización. Mantenlo en bruto, no hace falta que lo coloques con demasiada precisión por ahora.
fr: Voici à quoi devraient ressembler les boîtes de délimitation des nœuds dans la fenêtre d'affichage. Gardez-les bruts, vous n'avez pas besoin de les placer trop précisément pour l'instant.
ja: ビューポートでノードのバウンディングボックスがどのように表示されるかを次に示します。今の段階では正確に配置する必要はありません。
ko: 노드의 경계 사각형이 뷰포트에서 이렇게 보여야 합니다. 지금은 정확하게 놓지 않아도 됩니다. 적당하게 하세요.
pt_br: Veja como as caixas delimitadoras dos nós devem aparecer na viewport. Mantenha-o grosseiro, você não precisa colocá-los com muita precisão por agora.
ru: Вот как грани узлов должны выглядеть на видовом экране. Они расставлены грубо, но вам и не нужно размещать их слишком точно сейчас.
uk: Ось як повинні виглядати межі вузлів у вікні перегляду. Наразі не потрібно розміщувати їх дуже точно.
zh_cn: 这是节点的边界框在视图中的外观. 保持粗糙, 你现在不需要将它们放置得过于精确.
zh_tw: 節點的定界框在檢視區中看起來的樣子。先大致上差不多就好，現在還先不用放得很精確。

source: Replace the Label's font
cs: Náhrada fontu popisku
de: Ersetzen des Fonts fürs Label
es: Reemplaza las fuentes de los Label
fr: Remplacer la police du label
ja: ラベルのフォントを置き換える
ko: Label의 폰트 교체하기
pt_br: Substitua a fonte do Rótulo
ru: Замена шрифта у Label
uk: Зміна шрифта в Label
zh_cn: 替换 ``Label`` 的字体
zh_tw: 更改 Label 的字體

source: The label's font is too small. We need to replace it. Select the ``Number`` node and in the Inspector, scroll down to the ``Control`` class, and find the ``Custom Font`` category. Click the field next to the ``Font`` property and click on ``New Dynamic Font``. Click on the field again and select Edit.
cs: Font štítku je příliš malé. Musíme ho vyměnit. Vyberte uzel ``Number`` a v Inspektoru přejděte dolů do třídy ``Control`` a najděte kategorii ``Custom Font``. Klikněte na pole vedle vlastnosti ``Font`` a klikněte na ``New Dynamic Font``. Znovu klikněte na to pole a vyberte Upravit.
de: Der Font des Labels ist zu klein. Wir müssen ihn ersetzen. Wähle den Node ``Number`` und gehe im Inspektor runter zur ``Control``-Klasse und finde die Kategorie ``Custom Font``. Klicke auf das Feld neben der Eigenschaft ``Font`` und klicke auf ``New Dynamic Font``. Klicke nochmals auf das Feld und wähle Edit aus.
es: La fuente de la etiqueta es demasiado pequeña. Tenemos que reemplazarla. Selecciona el nodo ``Number`` y en el Inspector, ve hacia abajo a la clase ``Control``, y encuentra la categoría ``Custom Font``. Haz clic en el campo junto a la propiedad ``Font`` y haz clic en ``New Dynamic Font``. Vuelve a hacer clic en el campo y selecciona Editar.
fr: La police du label est trop petite. Nous devons la remplacer. Sélectionner le nœud ``Number`` et, dans l'inspecteur, déroulez jusqu'à la classe ``Control``, et trouver la catégorie ``Custom Font``. Cliquer sur le champ à côté de la propriété ``Font`` et cliquez sur ``New Dynamic Font``. Cliquez sur le champ de nouveau et sélectionnez Modifier.
ja: ラベルのフォントが小さすぎます。変更する必要があります。 ``Number`` ノードを選択し、インスペクタで ``Control`` クラスまでスクロールして、 ``Custom Font`` カテゴリを見つけます。 ``Font`` プロパティの横にあるフィールドをクリックして、 ``New Dynamic Font`` をクリックします。フィールドをもう一度クリックして編集を選択します。
ko: Label의 폰트는 너무 작습니다. 이것을 교체해야 합니다. ``Number`` 노드를 선택하세요. 그리고 인스펙터(Inspector)에서, ``Control`` 클래스로 내려간 뒤, ``Custom Font`` 카테고리를 찾으세요. ``Font`` 속성 옆의 영역을 클릭한 다음, ``새 Dynamic Font(New Dynamic Font)``\ 를 클릭하세요. 영역을 다시 클릭한 다음 편집하기(Edit)를 선택하세요.
pt_br: A fonte do rótulo é muito pequena. Precisamos substituí-la. Selecione o nó ``Number`` e no Inspetor, desça até a classe ``Control`` e encontre a categoria ``Custom Font``. Clique no campo ao lado da propriedade ``Font`` e clique em ``New Dynamic Font``. Clique no campo novamente e selecione Editar.
ru: Шрифт у метки(label) слишком мал. Нам нужно его изменить. Выберите узел ``Number`` в инспекторе, и прокрутите вниз до класса ``Control`` и найдите категорию ``Custom Font``. Щелкните на поле рядом со свойством ``Font`` и выберите ``New Dynamic Font``. Нажмите на поле еще раз и выберите Редактировать.
uk: Шрифт мітки занадто малий. Нам потрібно його змінити. Виберіть вузол ``Number`` в Інспекторі, прокрутіть до ``Control`` та знайдіть розділ ``Custom Font``. Клацніть поле поруч із властивістю ``Font`` та натисніть на ``New Dynamic Font``. Клацніть на полі ще раз та виберіть Редагувати.
zh_cn: 标签字体太小. 我们需要更换它. 选择 ``Number`` 节点, 然后在属性检查器中, 向下滚动到 ``Control`` 类, 然后找到 ``Custom Font`` 类别. 点击 ``Font`` 属性旁边的字段, 然后点击 ``新建动态字体``. 再次点击该字段, 然后选择编辑.
zh_tw: Label 的字體太小了，我們需要改一下。選擇 ``Number`` 節點並在屬性面板中往下捲動找到 ``Control`` 類別，並找到 ``Custom Font`` （自定字體）分類。點擊 ``Font`` 屬性右邊的欄位並點擊 ``新增 Dynamic Font`` 。接著再點擊一次欄位並選擇編輯。

source: You will enter the ``Dynamic Font`` resource. Unfold the ``Font`` category and click the field next to ``Font Data``. Click the ``Load`` button. In the file browser, navigate down to the assets/font folder and double click ``Comfortaa-Bold.ttf`` to open it. You should see the font update in the viewport. Unfold the settings category to change the font size. Set the ``Size`` property to a higher value, like ``24`` or ``28``.
cs: Vstupíte do zdroje ``Dynamic Font``. Rozbalte kategorii ``Font`` a klikněte na pole vedle položky ``Font Data``. Klikněte na tlačítko ``Load``. V prohlížeči souborů přejděte dolů do složky assetů / fontů a dvojitým kliknutím na ``Comfortaa-Bold.ttf`` ji otevřete. Ve výřezu by se měla zobrazit aktualizace písma. Rozbalením kategorie nastavení změníte velikost písma. Nastavte vlastnost ``Size`` na vyšší hodnotu, například na ``24`` nebo ``28``.
de: Du musst die Ressource ``Dynamic Font`` eingeben. Klappe die Kategorie ``Font`` aus und klicke auf das Feld neben ``Font Data``. Klicke auf die Fläche ``Load``. Gehe im Dateibrowser herunter zum Ordner assets/font und klicke zweimal auf ``Comfortaa-Bold.ttf``, um es zu öffnen. Du solltest im Ansichtsfenster sehen, dass der Font aufgefrischt wird. Klappe das Einstellungsmenü auf, um die Schriftgröße zu ändern. Setze die Eigenschaft ``Size`` auf einen höheren Wert wie ``24`` oder ``28``.
es: Entrarás en el recurso ``Dynamic Font``. Despliega la categoría ``Font`` y haz clic en el campo junto a ``Font Data``. Haz clic en el botón ``Load``. En el navegador de archivos, desplázate hasta la carpeta de activos/fuentes y haz doble clic en ``Comfortaa-Bold.ttf`` para abrirlo. Deberías ver la actualización de la fuente en la ventana de visualización. Despliega la categoría settings para cambiar el tamaño de la fuente. Establece la propiedad ``Size`` a un valor más alto, como ``24`` o ``28``.
fr: Vous allez entrer dans la ressource ``Dynamic Font``. Déplier la catégorie ``Font`` et cliquer sur le champ à côté de ``Font Data``. Cliquer sur le bouton ``Load``. Dans l'explorateur de fichiers, naviguer dans le dossier asset/font et double-cliquer sur ``Comfortaa-Bold.ttf`` pour l'ouvrir. Vous devriez voir la police se mettre à jour dans la fenêtre d'affichage. Déplier la catégorie des paramètres pour changer la taille de la police. Changer la propriété ``Size`` pour une valeur plus grande, comme ``24`` ou ``28``.
ja: ``Dynamic Font`` リソースを入力します。 ``Font`` カテゴリを展開し、 ``Font Data`` の横のフィールドをクリックします。 ``Load`` ボタンをクリックしてください。ファイルブラウザで、 `assets/font` フォルダに移動し、 ``Comfortaa-Bold.ttf`` をダブルクリックして開きます。ビューポートにフォントの更新が表示されます。フォントサイズを変更するには、設定カテゴリを開きます。 ``Size`` プロパティを ``24`` または ``28`` のように高い値に設定します。
ko: ``DynamicFont`` 리소스에 들어가야 합니다. ``Font`` 카테고리를 펼치고, ``Font Data`` 옆의 영역을 클릭하세요. ``불러오기(Load)`` 버튼을 클릭하세요. 파일 브라우저에서 assets/font 폴더로 간 다음, ``Comfortaa-Bold.ttf``\ 를 더블클릭해서 여세요. 뷰포트에서 폰트가 업데이트된 것을 볼 수 있습니다. Settings 카테고리를 펼치고 Font Size를 바꾸세요. ``Size`` 속성을 더 높은 숫자, ``24``\ 난 ``28``\ 로 설정하세요.
pt_br: Você entrará no recurso ``Dynamic Font``. Abra a categoria ``Font`` e clique no campo próximo a ``Font Data``. Clique no botão ``Load``. No navegador de arquivos, navegue até a pasta assets/font e dê um duplo clique em ``Comfortaa-Bold.ttf`` para abri-lo. Você deve ver a atualização da fonte na viewport. Abra a categoria de configurações para alterar o tamanho da fonte. Configure a propriedade ``Size`` para um valor mais alto, como ``24`` ou ``28``.
uk: Ви попадете в ресурс ``Dynamic Font``. Розгорніть розділ ``Font`` та натисніть поле поруч із ``Font Data``. Натисніть кнопку ``Завантажити``. У браузері файлів перейдіть до папки Assets/Font та двічі клацніть на ``Comfortaa-Bold.ttf``, щоб відкрити його. Ви повинні побачити оновлення шрифту у вікні перегляду. Розгорніть розділ налаштувань ``Settings``, щоб змінити розмір шрифту. Встановіть властивість ``Size`` на більш високе значення, наприклад ``24``, або ``28``.
zh_cn: 你将输入 ``动态字体(Dynamic Font)`` 资源. 展开 ``字体(Font)`` 类别, 然后点击 ``字体数据(Font Data)`` 旁边的字段. 点击 ``加载(Load)`` 按钮. 在文件浏览器中, 向下浏览到 ``assets/font`` 文件夹, 然后双击 ``Comfortaa-Bold.ttf`` 将其打开. 你应该在视图中看到字体更新. 展开设置类别以更改字体大小. 将 ``Size`` 属性设置为较高的值, 例如 ``24`` 或 ``28``.
zh_tw: 現在可以選擇 ``Dynamic Font`` 資源。先展開 ``Font`` （字體）分類，並點擊 ``Font Data`` （字體資料）旁邊的欄位。點擊 ``載入`` 按鈕。在檔案瀏覽器中打開 assets/font 資料夾並在 ``Comfortaa-Bold.ttf`` 上點兩下來打開。現在我們應該可以在檢視區上看到字體更新了。展開設定分類並修改字體大小，將 ``Size`` （大小）屬性設得比原來大一點，如 ``24`` 或 ``28`` 。
