Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_game_user_interface.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: You can resize the node vertically so that its bounding rectangle fits the gauge. Do the same with the ``Count`` node until its size aligns with that of the bar. Because the minimal size of ``TextureProgress`` is set based on its textures, you won't be able to downsize the ``Count`` node below that. That is also the size the ``Bar`` container will have. You may downscale this one as well.
cs: Velikost uzlu můžete vertikálně změnit tak, aby jeho ohraničující obdélník odpovídal měřidlu. Totéž proveďte s uzlem ``Count``, dokud se jeho velikost nevyrovná velikostí sloupce. Protože minimální velikost uzlu ``TextureProgress`` je nastavena na základě jeho textur, nebudete moci zmenšit velikost uzlu ``Count`` pod tuto hodnotu. To je také velikost, kterou bude mít kontejner ``Bar``. I ten můžete zmenšit.
de: Du kannst die Node vertikal in ihrer Größe ändern, sodass das Bounds-Rechteck ihre gauge passt. Tue das selbe mit der ``Count`` node bis ihre Größe mit der anderen Bar übereinstimmt. Weil die minimale Größe von ``TextureProgress`` basierend auf ihren Texturen gesetzt wird, wirst du nicht in der Lage sein, die ``Count`` node unter diese Größe zu verkleinern. Das ist auch die Größe, die der ``Bar`` Container haben wird. Du könntest diesen auch verkleinern.
es: Se puede redimensionar el nodo verticalmente para que su rectángulo delimitador encaje en el medidor. Haz lo mismo con el nodo ``Count`` hasta que su tamaño se alinee con el de la barra. Debido a que el tamaño mínimo de ``TextureProgress`` se establece en base a sus texturas, no podrás reducir el tamaño del nodo ``Count`` debajo de eso. Ese es también el tamaño que tendrá el contenedor ``Bar``. También puedes reducir la escala de éste.
fr: Vous pouvez redimensionner le nœud verticalement pour que son rectangle de délimitation s'adapte à la jauge. Faites en de même avec le nœud ``Count`` jusqu'à ce que sa taille s'aligne avec celle de la barre. Comme la taille minimale de ``TextureProgress`` est définie en fonction de ses textures, vous ne pourrez pas réduire la taille du nœud ``Count`` en dessous de celle des textures utilisées. C'est aussi la taille du conteneur ``Bar``. Vous pouvez également diminuer sa taille.
ja: 境界の長方形がゲージに合うように、ノードのサイズを垂直方向に変更できます。 ``Count`` ノードについても、サイズがバーのサイズに合うまで同じ操作を繰り返します。 ``TextureProgress`` の最小サイズはそのテクスチャに基づいて設定されるため、それより下に ``Count`` ノードは縮小できません。これは ``Bar`` コンテナのサイズにもなります。こちらも縮小して構いません。
ko: 노드의 경계 사각형이 게이지에 맞도록 노드를 수직으로 크기를 조절할 수 있습니다. 크기가 막대와 나란해질 때까지 ``Count`` 노드에도 똑같이 적용하세요. ``TextureProgress``\ 의 최소 크기가 텍스처로 설정되어 있기 때문에, ``Count`` 노드를 그보다 더 작게 줄일 수는 없습니다. ``Bar`` 컨테이너에도 마찬가지입니다. ``TextureProgress``\ 도 같이 크기를 줄여야 할 것입니다.
pt_br: Você pode redimensionar o nó verticalmente para que seu retângulo delimitador se ajuste ao medidor. Faça o mesmo com o nó ``Count`` até que seu tamanho se alinhe com o da barra. Como o tamanho mínimo de ``TextureProgress`` é definido com base em suas texturas, você não será capaz de diminuir o tamanho do nó ``Count`` abaixo dele. Esse também é o tamanho que o contêiner ``Bar`` terá. Você pode diminuí-lo também.
uk: Ви можете змінити розмір вузла по вертикалі, щоб його обмежувальний прямокутник відповідав показнику. Зробіть те ж саме з вузлом ``Count``, щоб його розмір вирівнявся з розміром шкали. Оскільки мінімальний розмір ``TextureProgress`` встановлений на основі його текстур, ви не зможете зменшити розмір вузла ``Count`` менше нього. Такий же розмір буде мати контейнер ``Bar``. Ви також можете зменшити його масштаб.
zh_cn: 你可以垂直调整节点的大小, 以使其边界矩形适合量规. 对 ``Count`` 节点执行相同的操作, 直到其大小与条的大小对齐为止. 因为 ``TextureProgress`` 的最小大小是根据其纹理设置的, 所以你将无法缩小 ``Count`` 节点低于该值大小. 这也是 ``Bar`` 容器将具有的大小. 你也可以缩小此尺寸.
zh_tw: 這裡可以調整一下節點的垂直大小，讓定界框的大小符合計量槽。也同時調整 ``Count`` 節點的大小來對齊計量槽。由於 ``TextureProgress`` 的最小大小是依紋理貼圖設定的，所以 ``Count`` 節點的大小沒辦法縮得比 TextureProgress 還要小。而 ``Bar`` Container 的大小也是這樣來的，也可以一起縮小他。

source: Last but not least, the ``Background`` container has a minimum size that makes it a bit large. Select it and in the ``Rect`` section, change the ``Min Size`` property down to ``80`` pixels. It should resize automatically and the ``Title`` and ``Number`` nodes should reposition as well.
cs: V neposlední řadě má kontejner ``Pozadí`` minimální velikost, která jej činí poněkud velkým. Vyberte jej a v části ``Rect`` změňte vlastnost ``Min Size`` na ``80`` pixelů. Jeho velikost by se měla automaticky změnit a uzly ``Title`` a ``Number`` by se měly upravit zrovna tak.
de: Zu guter Letzt, der ``Background`` Container hat die minimale Größe so, dass er ein bisschen zu groß ist. Wähle ihn aus und in der ``Rect`` Auswahl, ändere die ``Min Size`` Eigenschaft runter auf ``80`` Pixel. Das sollte automatisch die Größe verändern und die ``Title`` und ``Number`` Nodes sollten auch ihre Position entsprechend verändern.
es: Por último, pero no menos importante, el container ``Background`` tiene un tamaño mínimo que lo hace un poco grande. Selecciónalo y en la sección ```Rect``, cambia la propiedad ``Min Size`` a ``80`` píxeles. Debería redimensionarse automáticamente y los nodos ```Title`` y ```Number`` deberían reposicionarse también.
fr: Enfin, le conteneur ``Background`` a une taille minimale qui le rend un peu trop large. Sélectionnez-le et dans la section ``Rect``, changez la propriété ``Min Size`` pour ``80`` pixels. Il devrait se redimensionner automatiquement et les nœuds ``Title`` et ``Number`` devraient suivre.
ja: 最後に、 ``Background`` コンテナの最小サイズが少し大きめになっています。選択してから、 ``Rect`` セクションで ``Min Size`` プロパティを ``80`` ピクセルに変更します。自動的にサイズが変更され、 ``Title`` ノードと ``Number`` ノードも再配置されます。
ko: 마지막으로 ``Background`` 컨테이너가 최소 크기를 가져서 원래보다 조금 더 커졌습니다. 컨테이너를 선택하고, ``Rect`` 섹션에서 ``Min Size`` 속성을 ``80`` 픽셀로 바꾸세요. 자동으로 크기가 조절되면서 ``Title``\ 과 ``Number`` 노드의 위치도 다시 조정될 것입니다.
pt_br: Por último, mas não menos importante, o contêiner ``Background`` tem um tamanho mínimo que o torna um pouco grande. Selecione-o e na seção ``Rect``, altere a propriedade ``Min Size`` para os pixels ``80``. Ele deve ser redimensionado automaticamente e os nós ``Title`` e ``Number`` devem ser reposicionados também.
ru: Последнее, но самое важное. Контейнер ``Background`` имеет свойство, задающее минимальный размер. Текущее значение делает элемент немного великоватым. Выберите этот элемент и в разделе ``Rect измените свойство ``Min Size`` на 80 пикселей. Размер элемента, а также позиции ``Title`` и ``Number`` должны измениться автоматически.
uk: І останнє, але не менш важливе, контейнер ``Background`` має мінімальний розмір, що робить його трохи більшим. Виберіть його та в розділі ``Rect`` змініть властивість ``Min Size`` до ``80`` пікселів. Він повинен змінити розмір автоматично разом із вузлами ``Title`` та ``Number``.
zh_cn: 最后但并非最不重要的一点是, ``背景(Background)`` 容器的最小尺寸使其变得有点大. 选择它, 然后在 ``矩形(Rect)`` 部分中, 将 ``最小大小(Min Size)`` 属性更改为 ``80`` 像素. 它应该自动调整大小, 并且 ``Title`` 和 ``Number`` 节点也应重新定位.
zh_tw: 最後， ``Background`` 的最小尺寸還是有點大，所以我們先選擇 Background，然後在 ``Rect`` 段落中把 ``Min Size`` 改為 ``80`` px 。現在 Background 的大小應該會自動縮放了，而且 ``Title`` 跟 ``Number`` 的位置應該也自動調整好了。

source: The Count looks better now it's a bit smaller
cs: Počet vypadá lépe, když je teď o něco menší
de: Der Zähler sieht nun besser aus, da er etwas kleiner ist als zuvor
es: El contador se ve mejor ahora que es un poco más pequeño
fr: Le nœud Count est plus sympa maintenant qu'il est un peu plus petit
ja: Countは少し小さくなり、見た目が良くなりました
ko: Count는 더 작아져서 보기 좋아졌습니다
pt_br: O Count parece melhor agora, é um pouco menor
ru: Теперь счётчик выглядит лучше потому-что стал меньше
uk: Count виглядає тепер краще тому, що став трохи менший
zh_cn: ``Count`` 看起来好多了, 现在小了一点
zh_tw: Count 變得小一點了，看起來好多了

source: The Count node's size affects the position of the TextureProgress. As we'll align our bars vertically in a moment, we're better off using the Counter's left margin to resize our EP label. This way both the EnergyBar's Count and the LifeBar's Count nodes are one hundred pixels wide, so both gauges will align perfectly.
cs: Velikost uzlu Count ovlivňuje pozici TextureProgress. Protože za okamžik zarovnáme oba naše pruhy na výšku, bude lepší změnit velikost štítku EP pomocí levého okraje Counter. Tímto způsobem jsou uzly Count v ukazateli života i energie široké sto pixelů, takže obě měřidla budou dokonale zarovnána.
de: Die Größe des Zählerknotens beeinflusst die Positionierung von TextureProgress. Da wir unsere Leisten gleich senkrecht ausrichten werden, ist es ratsam den linken Abstand des Zählers zum Anpasssen unserer EP-Anzeige zu verwenden. So ist dafür gesorgt, dass die Knoten des EnergieLeiste-Zählers sowie des LebensLeiste-Zählers einhundert Pixel breit sind und damit perfekt bündig sind.
es: El tamaño del nodo Count afecta la posición del TextureProgress. Como vamos a alinear nuestras barras verticalmente en un momento, es mejor usar el margen izquierdo de Counter para redimensionar nuestra etiqueta EP. De esta manera, tanto el contador de la EnergyBar como los nodos de contador de la LifeBar tienen un ancho de cien píxeles, por lo que ambos medidores se alinearán perfectamente.
fr: La taille du nœud Count affecte la position de TextureProgress. Comme nous alignerons nos barres verticalement dans un instant, nous ferons mieux d'utiliser la marge gauche du Counter pour redimensionner notre label EP. De cette manière, les nœuds EnergyBar's Count et LifeBar's Count ont une largeur de 100 pixels, de sorte que les deux jauges s'alignent parfaitement.
ja: Countノードのサイズは、TextureProgressの位置に影響します。これからバーを縦に並べるので、Counterの左マージンを使用してEPラベルのサイズを変更した方がよいでしょう。これにより、EnergyBarのCountノードとLifeBarのCountノードの両方が100ピクセル幅になり、両方のゲージが完全に位置合わせされます。
ko: Count 노드의 크기는 TextureProgress의 위치에 영향을 받습니다. Bar를 수직으로 나열하기 때문에, EP 라벨의 크기를 조절하기 위해 Counter의 왼쪽 여백을 사용하는 것이 좋습니다. EnergyBar의 Count와 LifeBar의 Count 노드 둘다 100 픽셀 너비이기 때문에, 이 방법으로 두 게이지가 완벽하게 나란히 있을 수 있는 것입니다.
pt_br: O tamanho do nó Count afeta a posição do TextureProgress. Como alinharemos nossas barras verticalmente em em seguida, é melhor usarmos a margem esquerda do Count para redimensionar o rótulo do EP. Dessa forma, os nós Count do EnergyBar e Count do LifeBar têm cem pixels de largura, portanto, os dois medidores se alinharão perfeitamente.
uk: Розмір вузла Count впливає на положення TextureProgress. Поки ми не вирівняли наші смуги вертикально, нам краще використовувати лівий край Counter для зміни розміру нашої мітки EP. Таким чином, і Count від EnergyBar, і Count від LifeBar шириною сто пікселів, тому обидва показники будуть ідеально вирівнюватися.
zh_cn: Count节点的大小会影响TextureProgress的位置. 因为我们一会儿要垂直对齐我们的条形图, 所以我们最好使用计数器的左边缘来调整我们的EP标签的大小. 这样EnergyBar的Count和LifeBar的Count节点都是100像素宽, 所以两个仪表都会完美对齐.
zh_tw: Count 節點的大小會影響 TextureProgress 的位置。稍後我們會垂直對齊計量槽，所以最好使用 Counter 的左外邊距來調整 EP 標籤的大小。這樣一來才會讓 EnergyBar 跟 LifeBar 的 Count 節點都保持 100px 寬，互相對齊。

source: Prepare the bomb and emerald counters
cs: Příprava počítadla bomb a smaragdů
de: Bereite die Zähler für die Bomben und die Smaragde vor
es: Prepara los contadores de bombas y esmeraldas
fr: Préparer les compteurs de bombes et d'émeraudes
ja: 爆弾とエメラルドのカウンターを準備する
ko: 폭탄과 에메랄드 카운터 준비하기
uk: Підготовка лічильників бомб та смарагдів
zh_cn: 准备炸弹和翡翠计数器
zh_tw: 準備炸彈與寶石計數器

source: Let us now take care of the counters. Go to ``Scene -> New Inherited Scene`` and select the ``Counter.tscn`` as a base. Rename the root node as ``BombCounter`` too. Save the new scene as ``BombCounter.tscn``. That's all for this scene.
cs: Nyní se postaráme o počítadla. Přejděte na ``Scéna -> Nová odvozená scéna`` a jako základ vyberte ``Counter.tscn``. Přejmenujte také kořenový uzel na ``BombCounter``. Novou scénu uložte jako ``BombCounter.tscn``. To je pro tuto scénu vše.
de: Lass und nun die Zähler beachten. Gehe zu ``Szene -> Neue vererbte Szene`` und wähle ``Counter.tscn`` aus als eine Basis. Benenne die root node auch als ``BombCounter``. Speichere die Szene als ``BombCounter.tscn``. Das ist alles für diese Szene.
es: Ahora ocupémonos de los contadores. Ve a ``Escena -> Nueva Escena Heredada`` y selecciona el ``Counter.tscn`` como base. También renombra el nodo raíz como ``BombCounter``. Guarda la nueva escena como ``BombCounter.tscn``. Eso es todo por esta escena.
fr: Occupons-nous maintenant des compteurs. Allez dans ``Scène -> Nouvelle scène héritée`` et sélectionnez ``Counter.tscn`` comme base. Renommez le nœud racine en ``BombCounter``. Sauvegardez la nouvelle scène sous le nom de ``BombCounter.tscn``. C'est tout pour cette scène.
ja: カウンターを片付けましょう。 ``シーン → 新しい継承したシーン`` にて、ベースとして ``Counter.tscn`` を選択します。ルートノードの名前も ``BombCounter`` に変更します。新しいシーンを ``BombCounter.tscn`` として保存します。このシーンは、これですべてです。
ko: 카운터를 다루어봅시다. ``씬(Scene) -> 새 상속 씬(New Inherited Scene)``\ 으로 가서, ``Counter.tscn``\ 을 기본 씬으로 선택하세요. 루트 노드의 이름도 ``BombCounter``\ 로 바꾸세요. 새 씬을 ``BombCounter.tscn``\ 으로 저장하세요. 이것이 이 씬의 전부입니다.
pt_br: Vamos agora cuidar dos contadores. Vá para ``Scene -> New Inherited Scene`` e selecione o ``Counter.tscn`` como base. Renomeie o nó raiz como ``BombCounter`` também. Salve a nova cena como ``BombCounter.tscn``. Isso é tudo para esta cena.
ru: Давайте теперь позаботимся о счетчиках. Перейдите к ``Сцена -> Новая Унаследованная Сцена`` и выберите ``Counter.tscn`` в качестве базового. Также переименуйте корневой узел на ``BombCounter``. Сохраните новую сцену как ``BombCounter.tscn``. На этом работа с этой сценой завершена.
uk: Давайте тепер подбаємо про лічильники. Перейдіть до ``Сцена -> Нова успадкована сцена`` та виберіть ``Counter.tscn``, як основу. Перейменуйте кореневий вузол на ``BombCounter``. Збережіть нову сцену як ``BombCounter.tscn``. Це все для цієї сцени.
zh_cn: 现在让我们来处理计数器. 进入 ``场景 -> 新继承的场景(Scene -> New Inherited Scene)``, 选择 ``Counter.tscn`` 作为基础. 也将根节点重命名为 ``BombCounter``. 将新场景保存为 ``BombCounter.tscn``. 这就是这个场景的全部内容.
zh_tw: 來關心一下計數器。打開 ``場景 -> 新增繼承場景`` 並選擇基礎場景 ``Counter.tscn`` 。將根節點重新命名為 ``BombCounter`` ，並保存場景為 ``BombCounter.tscn`` 。這個場景就這樣了。

source: The bomb counter is the same as the original Counter scene
cs: Počítadlo bomb je stejné jako v původní scéně Counter
de: Der Bomben Zähler ist äquivalent zu der originalen Zähler Szene
es: El contador de bombas es el mismo que la escena original Counter
fr: Le compteur de bombes est le même que celui de la scène originale
ja: 爆弾カウンターは元のCounterシーンと同じです
ko: 폭탄 카운터는 원래 Counter 씬과 같습니다
pt_br: O contador da bomba é o mesmo que a cena do Counter original
uk: Лічильник бомб такий же, як і в оригінальній сцені Counter
zh_cn: 炸弹计数器与原始计数器场景相同
zh_tw: 炸彈的計數器就根原本的計數器場景一模一樣

source: Go to ``Scene -> New Inherited Scene`` again and select ``Counter.tscn`` once more. Rename the root node ``EmeraldCounter`` and save the scene as ``EmeraldCounter.tscn``. For this one, we mainly need to replace the bomb icon with the emerald icon. In the FileSystem tab, drag the ``emeralds_icon.png`` onto the ``Icon`` node's ``Texture`` slot. ``Icon`` already anchors to the right edge of the ``Background`` node so we can change its position and it will scale and reposition with the ``EmeraldCounter`` container. Shift the emerald icon a bit to the right and down. Use the Arrow Keys on the keyboard to nudge its position. Save, and we're done with all the UI elements.
cs: Přejděte znovu na ``Scéna -> Nová odvozená scéna`` a znovu vyberte ``Counter.tscn``. Přejmenujte kořenový uzel ``EmeraldCounter`` a scénu uložte jako ``EmeraldCounter.tscn``. U tohoto je potřeba hlavně nahradit ikonu bomby ikonou smaragdu. Na kartě FileSystem přetáhněte ``emeralds_icon.png`` do slotu ``Texture`` uzlu ``Icon``. Uzel ``Icon`` je již ukotven k pravému okraji uzlu ``Background``, takže můžeme měnit jeho polohu a jeho měřítko a pozice se bude měnit společně s kontejnerem ``EmeraldCounter``. Posuňte ikonu smaragdu trochu doprava a dolů. Pomocí kláves se šipkami na klávesnici posuňte její pozici. Uložte a jsme hotovi se všemi prvky uživatelského rozhraní.
es: Vuelve a ``Escena -> Nueva escena heredada`` y selecciona ``Counter.tscn`` una vez más. Cambia el nombre del nodo raíz ``EmeraldCounter`` y guarda la escena como ``EmeraldCounter.tscn``. Para este, principalmente necesitamos reemplazar el icono de la bomba con el icono de la esmeralda. En la pestaña del Sistema de Archivos, arrastra el ``emeralds_icon.png`` hacia la ranura ``Texture`` del nodo ``Icon``. El ``Icon`` ya está anclado en el borde derecho del nodo ``Background`` para que podamos cambiar su posición y se escalará y se reubicará con el contenedor ``EmeraldCounter``. Desplaza el icono de la esmeralda un poco hacia la derecha y hacia abajo. Utiliza las teclas de flecha del teclado para ajustar su posición. Guárdalo, y habremos terminado con todos los elementos de la UI.
fr: Allez à nouveau dans ``Scène -> Nouvelle scène héritée`` et sélectionnez ``Counter.tscn`` une fois de plus. Renommez le nœud racine ``EmeraldCounter`` et enregistrez la scène sous ``EmeraldCounter.tscn``. Pour celui-ci, nous avons principalement besoin de remplacer l'icône de la bombe par l'icône de l'émeraude. Dans l'onglet Système de fichiers, faites glisser le fichier ``emeralds_icon.png`` sur l'emplacement ``Texture`` du nœud ``Icon`` . ``Icon`` est déjà ancrée sur le bord droit du nœud ``Background`` afin que nous puissions changer sa position et qu'il se mette à l'échelle et se repositionne avec le conteneur ``EmeraldCounter``. Déplacez un peu l'icône de l'émeraude vers la droite et vers le bas. Utilisez les touches flèches du clavier pour rectifier sa position. Sauvegardez, et nous en avons fini avec tous les éléments de l'interface utilisateur.
ja: もう一度 ``シーン → 新しい継承したシーン`` に移動し、\ ``Counter.tscn`` を再度選択します。ルートノードの名前を ``EmeraldCounter`` に変更し、シーンを ``EmeraldCounter.tscn`` として保存します。このシーンについては、主に爆弾アイコンをエメラルドアイコンに置き換える必要があります。［ファイルシステム］タブで、\ ``emeralds_icon.png`` を ``Icon`` ノードの ``Texture`` スロットにドラッグします。\ ``Icon`` はすでに ``Background`` ノードの右端に固定されているため、その位置を変更でき、\ ``EmeraldCounter`` コンテナーによってスケーリングおよび再配置できます。エメラルドアイコンを少しだけ右下に移動します。位置の微調整にはキーボードの矢印キーを使用して下さい。保存すれば、すべてのUI要素の完成です。
uk: Перейдіть знову до ``Сцена -> Нова успадкована сцена`` і виберіть ``Counter.tscn`` ще раз. Перейменуйте кореневий вузол на ``EmeraldCounter`` і збережіть сцену як ``EmeraldCounter.tscn``. Тут нам потрібно замінити значок бомби на значок смарагду. З панелі Файлова система перетягніть ``emeralds_icon.png`` на гніздо ``Texture`` вузла ``Icon``. ``Icon`` вже прив'язаний до правого краю вузла ``Background``, ми можемо змінити його положення, і він змінить масштаб та переміститься разом з контейнером ``EmeraldCounter``. Зсуньте значок смарагду трохи праворуч і вниз за допомогою кнопок зі стрілками на клавіатурі. Збережіть сцену. І на цьому ми закінчили з усіма елементами інтерфейсу.
zh_cn: 再次转到 ``场景 -> 新继承的场景(Scene -> New Inherited Scene)`` , 然后再次选择 ``Counter.tscn`` . 重命名根节点为 ``EmeraldCounter`` , 并将场景保存为 ``EmeraldCounter.tscn`` . 对于这个新继承的场景, 我们主要将炸弹图标替换为翡翠图标. 在 ``FileSystem(文件系统)`` 选项卡中, 将 ``emeralds icon.png`` 拖到 ``Icon`` 节点 的 ``Texture`` 属性插槽中. ``Icon`` 已经锚定在 ``Background`` 节点的右边缘, 因此我们可以更改其位置, 并使用 ``EmeraldCounter`` 容器对其进行缩放和重新定位. 向右和向下稍微移动翡翠图标. 使用键盘上的箭头键微调其位置. 保存, 我们已经完成了所有UI元素.
zh_tw: 再打開一次 ``場景 -> 新增繼承場景`` 然後一樣選 ``Counter.tscn`` 。將根節點重新命名為 ``EmeraldCounter`` 然後保存場景為 ``EmeraldCounter.tscn`` 。這個場景我們的主要目標是要把炸彈圖示換成寶石圖示。到檔案系統分頁中把 ``emeralds_icon.png`` 拖移到 ``Icon`` 節點的 ``Texture`` 槽中。 ``Icon`` 已經錨定在 ``Background`` 節點的右側了，所以當我們調整位置的時候會自動縮放並在 ``EmeraldCounter`` 容器中重新定位。將寶石圖示稍微往左下移動一點。可以使用鍵盤上的方向鍵來微調位置。存檔，現在我們已經完成所有 UI 元素了。

source: The emerald counter should look something like this
cs: Počítadlo smaragdů by mělo vypadat nějak takto
de: Der Smaragdzähler sollte so aussehen
es: El contador de esmeraldas debería verse así
fr: Le compteur d'émeraudes devrait ressembler à ceci
ja: エメラルドのカウンターはこのようになります
ko: 에메랄드 카운터는 이와 같이 보여야 합니다
uk: Лічильник смарагдів повинен виглядати приблизно так
zh_cn: 翡翠计数器看起来应该像这样
zh_tw: 寶石計數器看起來應該長這樣

source: Add the UI components to the final GUI
cs: Přidání komponent uživatelského rozhraní do finální verze GUI
de: Füge nun die UI-Komponente der finalen Oberfläche hinzu
es: Añade los componentes de la UI a la GUI final
fr: Ajouter les composants de l'interface utilisateur à l'interface graphique finale
ja: 最終的なGUIにUIコンポーネントを追加する
ko: 최종 GUI에 UI 구성 요소들을 추가하기
pt_br: Adicione os componentes da interface do usuário à GUI final
uk: Додавання компонентів інтерфейсу до кінцевого GUI (графічного інтерфейсу)
zh_cn: 将UI组件添加到最终的GUI
zh_tw: 將 UI 元件加到最終 GUI
