Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_game_user_interface.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: With the ``Icon`` node selected, in the inspector, scroll to the top to see the ``Texture`` slot. Head to the FileSystem dock on the left and select the ``bombs_icon.png``. Drag and drop it onto the ``Texture`` slot. In the Scene Tab select both the ``Icon`` and the ``Number`` nodes. Click the Layout menu in the toolbar at the top of the viewport and select ``Full Rect``. Both nodes will update to fit the size of the ``Background``.
cs: S vybraným uzlem ``Icon`` se v inspektoru posuňte nahoru, abyste viděli slot ``Texture``. Přejděte do doku FileSystem vlevo a vyberte soubor ``bombs_icon.png``. Přetáhněte jej do slotu ``Texture``. Na kartě Scéna vyberte uzly ``Icon`` a ``Number``. Klikněte na nabídku Rozvržení na panelu nástrojů v horní části výřezu a vyberte možnost ``Full Rect``. Oba uzly se aktualizují, aby odpovídaly velikosti ``Backround``.
de: Wähle die ``Icon`` Node aus und scrolle nach oben um den ``Texture`` Slot zu sehen. Nun gehe zum File System Bereich auf der linken Seite und ziehe das ``bombs_icon.png`` in den ``Texture`` Slot. In dem Szenenbaum wähle die ``Icon`` und ``Number`` Nodes aus. Clicke auf das Layout-Menu in der Symbolliste oben im Ansichtsfenster und wähle ``Full Rect`` aus. Beide Nodes passen sich nun der Größe von ``Background`` an.
es: Con el nodo ``Icon`` seleccionado, en el inspector, desplázate a la parte superior para ver la ranura ``Texture``. Dirígete al panel del Sistema de Archivos a la izquierda y selecciona el ``bombs_icon.png``. Arrástralo y suéltalo en la ranura ``Texture``. En la pestaña Escena selecciona los nodos ``Icon`` y ``Number``. Haz clic en el menú de Disposición en la barra de herramientas en la parte superior de la ventana y selecciona ``Full Rect``. Ambos nodos se actualizarán para ajustarse al tamaño del ``Background``.
fr: Avec le nœud ``Icon`` sélectionné, dans l'inspecteur, faites défiler vers le haut pour voir l'emplacement ``Texture``. Dirigez-vous vers le dock FileSystem à gauche et sélectionnez ``bombs_icon.png``. Faites-le glisser et déposez-le sur l'emplacement ``Texture``. Dans l'onglet Scène, sélectionnez à la fois le nœud ``Icon`` et le nœud ``Number``. Cliquez sur le menu Layout dans la barre d'outils en haut de la fenêtre d'affichage et sélectionnez ``Full Rect``. Les deux nœuds seront mis à jour pour s'adapter à la taille de ``Background``.
ja: ``Icon`` ノードを選択した状態で、インスペクタで一番上までスクロールして ``Texture`` スロットを表示します。左側のファイルシステム ドックに移動し、 ``bombs_icon.png`` を選択します。これを ``Texture`` スロットにドラッグ&ドロップします。シーンタブで、 ``Icon`` ノードと ``Number`` ノードの両方を選択します。ビューポート上部のツールバーにあるレイアウトメニューをクリックし、 ``Rect全面`` を選択します。両方のノードが ``Background`` のサイズに合わせて更新されます。
ko: ``Icon`` 노드를 선택하고, 인스펙터(Inspector)에서 ``Texture`` 슬롯이 보일 때까지 위로 올라가세요. 왼쪽의 파일 시스템(FileSystem) 독으로 가서 ``bombs_icon.png``\ 를 선택하세요. ``Texture`` 슬롯에 드래그 앤 드롭하세요. 씬(Scene) 탭에서 ``Icon``\ 과 ``Number`` 노드 모두 선택하세요. 뷰포트 상단에 있는 툴바의 레이아웃(Layout) 메뉴로 가서 ``사각형 전체(Full Rect)``\ 를 선택하세요. 두 노드 모두 ``Background``\ 의 크기에 맞게 업데이트될 것입니다.
pt_br: Com o nó ``Icon`` selecionado, no inspetor, role até o topo para ver o slot ``Texture``. Dirija-se à doca FileSystem à esquerda e selecione o ``bombs_icon.png``. Arraste e solte no slot ``Texture``. Na aba Scene, selecione os nós ``Icon`` e ``Number``. Clique no menu Layout na barra de ferramentas na parte superior da viewport e selecione ``Full Rect``. Ambos os nós serão atualizados para se ajustarem ao tamanho do ``Background``.
uk: Вибравши вузол ``Icon``, у інспекторі прокрутіть доверху, щоб побачити ``Texture``. З панелі Файлова система виберіть ``bombs_icon.png``. Перетягніть його в гніздо ``Texture``. На вкладці Сцена виберіть вузли ``Icon`` і ``Number``. Клацніть меню Макет на панелі інструментів у верхній частині вікна перегляду та виберіть ``Увесь прямокутник``. Обидва вузли оновляться відносно розміру ``Background``.
zh_cn: 选中 ``Icon`` 节点后, 在属性检查器中, 滚动到顶部以查看 ``Texture`` 插槽. 转到左侧的 ``FileSystem`` 停靠面板, 然后选择 ``bombs_icon.png``. 将其拖放到 ``Texture`` 插槽中. 在场景选项卡中, 选择 ``Icon`` 和 ``Number`` 节点. 点击视图顶部工具栏中的 ``Layout`` 菜单, 然后选择 ``全角(Full Rect)``. 两个节点都将更新以适合 ``背景(Background)`` 的大小.
zh_tw: 選擇了 ``Icon`` 節點後，到屬性面板中滾動到最上面並找到 ``Texture`` 槽。接著到左邊的檔案系統 Dock 裡選擇 ``bombs_icon.png`` 並將其拖曳至 ``Texture`` 槽內。在場景分頁中選擇 ``Icon`` 與 ``Number`` 節點，並在檢視區上方工具列的畫面配置選單中選擇 ``全矩形`` 。現在，這兩個節點的大小應該會變得符合 ``Background`` 的大小了。

source: The nodes anchor to the entire Background, but their position is off
cs: Uzly se ukotví k celému ``Backround``, ale jejich poloha je vypnutá
de: Die Noden sind mit dem gesamten Hintergrund verankert, aber ihre Position stimmt so noch nicht
es: Los nodos se anclan en la totalidad del fondo, pero su posición está desactivada
fr: Les nœuds s'ancrent à l'arrière-plan en entier, mais leur position est désactivée
ja: ノードはBackground全体に固定されていますが、位置がずれています
ko: 노드는 전체 Background에 고정됐지만, 위치가 어긋납니다
pt_br: Os nós ancoram em todo o plano de fundo, mas sua posição está desativada
uk: Вузли прив'язуються до всього Background, але їх положення вимкнено
zh_cn: 节点锚定到整个背景, 但是它们的位置不正确
zh_tw: 雖然節點錨定到整個背景了，但位置還不正確

source: Let's change the ``Number``'s align properties to move it to the left and center of the ``Background``. Select the ``Number`` node, change its ``Align`` property to left and the ``Valign`` property to center. Then resize its left edge a bit to add some padding between the left edge of the ``Background`` and the text.
cs: Pojďme změnit vlastnosti zarovnání ``Number`` tak, aby se přesunul doleva a do středu ``Backround``. Vyberte uzel ``Number``, změňte jeho vlastnost ``Align`` doleva a vlastnost ``Valign`` na střed. Poté trochu změňte velikost jeho levého okraje a přidejte místo mezi levý okraj ``Backround`` a text.
fr: Changeons les propriétés d'alignement de ``Number`` pour le déplacer vers la gauche et le centre du ``Background``. Sélectionnez le nœud ``Number``, changez sa propriété ``Align`` pour gauche et la propriété ``VAlign`` pour centre. Puis redimensionner un peu son bord gauche pour ajouter un peu de place entre le bord gauche de ``Background`` et le texte.
ja: ``Number`` の ``Align`` プロパティを変更して、\ ``Background`` の左側と中央に移動します。\ ``Number`` ノードを選択し、その ``Align`` プロパティを left に、\ ``Valign`` プロパティを center に変更します。 次に、その左端を少しサイズ変更して、\ ``Background`` の左端とテキストの間に少し余白を追加します。
zh_cn: 让我们更改 ``Number`` 的 ``align`` 属性, 将其移至 ``Background`` 的左侧和中央. 选择 ``Number`` 节点, 将其 ``Align`` 属性更改为左侧, 并将 ``Valign`` 属性更改为居中. 然后稍微调整其左边缘的大小, 以在 ``Background`` 的左边缘和文本之间添加一些填充.
zh_tw: 接著我們要修改 ``Number`` 的對齊屬性來把它移動到 ``Background`` 的左邊中間。選擇 ``Number`` 節點，並修改 ``Align`` 屬性為 Left (左)， ``Valign`` 屬性為 Center (中)。接著增加左側邊緣的大小點來給 ``Background`` 與文字中間加一點留白。

source: The Number node aligned to the left and center
cs: Uzel Number zarovnaný doleva a na střed
fr: Le nœud Number aligné à gauche et au centre
ja: 左中央に揃えられたNumberノード
zh_cn: ``Number`` 节点左对齐并居中
zh_tw: Number 節點現在對齊在左邊中間了

source: To overlap the Icon and the background, we need a few tweaks. First, our background is a bit too tall. It's because it's inside a margin container that is controlled by the top-most GUI node. Select the GUI node at the top of the scene tree and downsize it vertically so that it's as thin as possible. You'll see the gauge prevents you from making it too small. A container cannot be smaller than the minimal size of its children. The container's margins also weigh in.
cs: K překrytí Ikony a pozadí potřebujeme několik vylepšení. Za prvé, naše pozadí je příliš vysoké. Je to proto, že je uvnitř margin kontejneru, který je řízen nejvyšším uzlem GUI. Vyberte uzel GUI v horní části stromu scény a zmenšete jej vertikálně, aby byl co nejtenčí. Uvidíte, že měřidlo vám nedovolí, aby byl příliš malý. Kontejner nemůže být menší než minimální velikost jeho podřízených položek. Rovněž se berou v úvahu okraje kontejneru.
de: Damit sich das Icon und der Hintergrund überlappen, müssen wir ein paar Änderungen vornehmen. Erstens ist unser Hintergrund etwas zu groß. Das liegt daran, dass dieser in einem Margin-Container liegt, welcher von der obersten GUI Node kontrolliert wird. Wähle die GUI Node oben im Szenenbaum aus und reduziere seine vertikale Größe, damit es so dünn wie möglich wird. Du wirst sehen, dass die Anzeige dich davon abhält, es zu klein zu machen. Ein Container kann nämlich nicht kleiner sein, als die minimale Größe seiner Kinder. Die Spannweite des Containers spielt ebenfalls eine Rolle.
es: Para superponer el ``Icon`` y el ``Backrgound``, necesitamos algunos ajustes. Primero, nuestro fondo es un poco altos. Esto se debe a que está dentro de un ``MarginContainer`` que está controlado por el nodo GUI más importante. Selecciona el nodo GUI en la parte superior del árbol de escenas y reduce su tamaño verticalmente para que sea lo más delgado posible. Verás que el medidor evita que sea demasiado pequeño. Un container no puede ser más pequeño que el tamaño mínimo de sus hijos. Los márgenes del container también influyen.
fr: Pour superposer l'icône et l'arrière-plan, nous avons besoin de quelques ajustements. Tout d'abord, notre arrière-plan est un peu trop grand. C'est parce qu'il se trouve à l'intérieur d'un conteneur de marge(MarginContainer) qui est contrôlé par le nœud le plus haut de l'interface graphique(GUI). Sélectionnez le nœud de l'interface graphique(GUI) en haut de l'arbre de scène et réduisez-le verticalement pour qu'il soit le plus fin possible. Vous verrez que la jauge vous empêche de la rendre trop petite. Un conteneur ne peut pas être plus petit que la taille minimale de ses enfants. Les marges du conteneur comptent également.
ja: アイコンとBackgroundを重ねるには、いくつかの微調整が必要です。まず、私たちのBackgroundは少し高すぎます。これは、最上位のGUIノードによって制御されるマージン・コンテナ内にあるためです。シーンツリーの一番上にあるGUIノードを選択し、できるだけ細くなるように垂直方向に縮小します。 表示されるゲージを確認して小さくなりすぎないようにします。コンテナは、その最小サイズよりも小さくすることはできません。 コンテナの余白も考慮に入れます。
ko: Icon과 Background를 겹치려면, 몇 가지 조정이 필요합니다. 먼저 Background가 예상보다 약간 큽니다. 최상위의 GUI 노드에서 제어되는 MarginContainer에 속해있기 때문입니다. 씬 트리의 맨 위에 있는GUI 노드를 선택하고 최대한 가늘게 세로로 크기를 줄여보세요. Gauge는 너무 작아지지 않는 것을 볼 수 있습니다. 컨테이너는 자손을 자손의 최소 크기보다 더 작게 만들 수 없습니다. 컨테이너의 여백도 마찬가지입니다.
pt_br: Para sobrepor o ícone e o fundo, precisamos de alguns ajustes. Primeiro, nosso background está um pouco alto demais. É porque está dentro de um contêiner de margem que é controlado pelo nó da interface superior. Selecione o nó GUI na parte superior da árvore de cena e diminua o tamanho verticalmente para que fique o mais fino possível. Você verá que o medidor impede que você o torne muito pequeno. Um contêiner não pode ser menor que o tamanho mínimo de seus filhos. As margens do contêiner também pesam.
ru: Чтобы перекрывать иконку и фон, нам нужно кое-что подправить. Во-первых, наш фон несколько высокий. Это потому, что он находится внутри MarginСontainer'a, который контролируется самым верхним узлом GUI. Выберите узел GUI в верхней части дерева сцены и уменьшите его по вертикали так, чтобы он был как можно тоньше. Вы увидите, что датчик мешает вам сделать его слишком маленьким. Родительский контейнер не может быть меньше минимального размера его дочерних. Поля контейнера также учитываются.
uk: Щоб перекрити піктограму та фон, нам потрібно кілька налаштувань. По-перше, наш фон трохи надто високий. Це тому, що він знаходиться у контейнері поля (MarginСontainer), який контролюється самим верхнім вузлом GUI. Виберіть вузол GUI у верхній частині дерева сцени та зменшіть його по вертикалі, щоб він був максимально тонким. Ви побачите, що показник не дозволяє вам зробити його занадто маленьким. Контейнер не може бути меншим, ніж мінімальний розмір його нащадків. Поля контейнера також беруться до уваги.
zh_cn: 要使 ``Icon`` 和背景叠加, 我们需要进行一些调整. 首先, 我们的背景有点高. 这是因为它位于由最顶层GUI节点控制的边距容器内. 选择场景树顶部的GUI节点, 并垂直缩小其尺寸, 以使其尽可能薄. 你会看到仪表防止你把它做得太小. 容器不能小于其子容器的最小大小. 容器的边距也很重要.
zh_tw: 要讓圖示與背景重疊，我們需要做點小調整。首先，現在的背景太高了，這是因為背景現在是放在由最上層 GUI 節點所控制的 Margin Container 內。先選擇場景樹中最上次的 GUI 節點，並儘量縮小縱向的大小。這時候你會發現縮小到某個大小後，計量槽會阻止你繼續縮小。Container 節點沒辦法縮小到比最小的子節點還要小，且還必須考慮外邊距。

source: Select the Icon, click the Layout menu, and select ``Full Rect`` to re-center it. We need it to anchor to the ``Background``'s right edge. Open the Layout menu again and select ``Center Right``. Move the icon up so it is centered vertically with the ``Background``.
cs: Vyberte uzel ``Icon``, klikněte na nabídku Rozvržení a výběrem možnosti ``Full Rect`` ho znovu vycentrujte. Potřebujeme, aby zakotvil k pravému okraji pozadí. Znovu otevřete nabídku Rozvržení a vyberte možnost ``Center Right``. Přesuňte ``Icon`` nahoru tak, aby byla vycentrována svisle s pozadím.
de: Wähle das Icon aus, klicke das Layout Menü an und wähle ``Full Rect`` aus um es wieder zu zentrieren. Wir müssen es mit dem rechten Rand vom ``Background`` verankern. Öffne erneut das Layout Menü und wähle ``Center Right`` aus. Bewege das icon nach oben, sodass es vertikal zentriert zum ``Background`` ist.
es: Selecciona el icono, haz clic en el menú Disposición, y selecciona ``Full Rect`` para volver a centrarlo. Lo necesitaremos para anclar al borde derecho del ``Background``. Abre de nuevo el menú Disposición y selecciona ``Center Right``. Mueve el icono hacia arriba para que quede centrado verticalmente con el ``Background``.
fr: Sélectionnez l'icône, cliquez sur le menu Layout et sélectionnez ``Full Rect`` pour le recentrer. Nous avons besoin de l'ancrer sur le bord droit de ``Background``. Ouvrez à nouveau le menu Layout et sélectionnez ``Center Right``. Déplacez l'icône vers le haut de façon à ce qu'elle soit centrée verticalement avec ``Background``.
ja: アイコンを選択し、レイアウトメニューをクリックして、 ``Rect全面`` を選択して中央に戻します。 ``Background`` の右端に固定するために必要です。 もう一度レイアウトメニューを開き、 ``中央右`` を選択します。アイコンを ``Background`` と垂直になるように上に動かします。
ko: Icon을 선택하고 레이아웃(Layout) 메뉴를 클릭하세요. 그리고 ``사각형 전체(Full Rect)``\ 를 선택해서 다시 가운데에 있도록 하세요. 다시 레이아웃(Layout) 메뉴를 열고 ``오른쪽 중앙(Center Right)``\ 을 선택하세요. Icon을 위로 움직여서 ``Background``\ 와 수직으로 가운데에 있도록 하세요.
pt_br: Selecione o ícone, clique no menu Layout e selecione ``Full Rect`` para voltar a centralizá-lo. Precisamos que ele ancore a borda direita do ``Background``. Abra o menu Layout novamente e selecione ``Center Right``. Mova o ícone para cima de modo que ele esteja centralizado verticalmente com o ``Background``.
uk: Виберіть ``Icon``, натисніть меню Макет та виберіть ``Full Rect``, щоб центрувати його повторно. Нам потрібно, щоб він прикріпився до правого краю ``Background``. Відкрийте меню Макет ще раз та виберіть ``За центром праворуч``. Перемістіть піктограму вгору, щоб вона була розташована по центрі вертикалі разом з ``Background``.
zh_cn: 选择图标, 点击布局菜单, 然后选择 ``全矩形(Full Rect)`` 以重新居中. 我们需要它锚定到 ``Background`` 的右边缘. 再次打开 ``Layout`` 菜单并选择 ``右居中(Center Right)``. 向上移动图标, 使其垂直居中于 ``Background``.
zh_tw: 選擇 Icon 節點，並點擊畫面配置選單，選擇 ``全矩形`` 來重新置中 Icon 節點。我們要把 Icon 錨定到 ``Background`` 的右邊。再打開畫面配置選單一次，然後選擇 ``中右`` 。將圖示向上移動來讓圖示在 ``Background`` 上垂直置中。

source: The bomb icon anchors to the Background's right edge. Resize the Counter container to see the Icon node stick to its right side
cs: Ikona bomby je ukotvena k pravému okraji Backround. Změňte velikost kontejneru Counter, aby se uzel Icon příchytil k jeho pravé straně
de: Das Bomben-Icon ist am rechten Rand des Background verankert. Passe die Größe des Counter-Containers an, sodass sich der Icon-Node an seine rechte Seite anschmiegt
es: El icono de la bomba se ancla en el borde derecho del ``Background``. Redimensiona el container ``Counter`` para ver el nodo Icon pegarse a su lado derecho
fr: L'icône de la bombe s'ancre sur le bord droit de l'arrière-plan. Redimensionner le conteneur Counter pour voir le nœud Icon coller sur le côté droit
ja: 爆弾アイコンがBackgroundの右端に固定されます。Iconノードを右側に表示させるには、Counterコンテナのサイズを変更してください
ko: 폭탄 아이콘은 Background의 오른쪽 모서리에 앵커하세요. Counter 컨테이너의 크기를 조절하여 Icon 노드가 오른쪽 모서리에 고정되도록 하세요
pt_br: O ícone da bomba ancora na borda direita do Background. Redimensione o contêiner Counter para ver o nó Ícone ficar no lado direito
ru: Иконка бомбы крепится к правому краю фона. Измените размер контейнера Counter, чтобы увидеть как узел Icon прилипает к его правой стороне
uk: Піктограма бомби прив'язується до правого краю фону. Змініть розмір контейнера Counter, щоб побачити, як вузол Icon притримується правої сторони
zh_cn: 炸弹图标锚定在 ``背景(Background)`` 的右边缘. 调整 ``计数器(Counter)`` 容器的大小, 以查看粘在其右侧的 ``图标(Icon)`` 节点
zh_tw: 炸彈圖示現在錨定到 Background 的右側了。調整 Counter Container 的大小就可以注意到現在圖示固定靠在右側了

source: Because we duplicated the ``Counter`` from the bar's ``Count``, the ``Number`` node's font is off. Select the ``Number`` node again, head to the ``Font`` property, and click it to access the ``DynamicFont`` resource. In the ``Extra Spacing`` section, change the ``Bottom`` value to ``0`` to reset the font's baseline. Our counter now works as expected.
cs: Protože jsme duplikovali ``Counter`` z ``Count`` pruhu, písmo uzlu ``Number`` je vypnuté. Vyberte znovu uzel ``Number``, přejděte k vlastnosti ``Font`` a kliknutím na něj otevřete zdroj ``DynamicFont``. V části ``Extra Spacing`` změňte hodnotu ``Bottom`` na ``0``, abyste resetovali základní linku písma. Náš čítač nyní funguje podle očekávání.
de: Da wir den ``Counter`` vom ``Count`` der Leiste dupliziert haben, stimmt die Schrift der ``Number`` Node nicht. Wähle wieder die ``Number`` Node aus, gehe zur ``Font`` Eigenschaft und klicke sie an um Zugriff auf die ``DynamicFont`` Ressource zu erhalten. Setze im ``Extra Spacing`` Abschnitt den ``Bottom`` Wert auf ``0``um die Grundlinie der Schrift zurückzusetzen. Unser Zähler funktioniert nun wie erwartet.
es: Debido a que duplicamos el ``Counter`` de la barra ``Count``, la fuente del nodo ``Number`` está desactivada. Selecciona nuevamente el nodo ``Number``, ve a la propiedad ``Font`` y haz clic en ésta para acceder al recurso ``DynamicFont``. En la sección ``Extra Spacing``, cambia el valor ``Bottom`` por ``0`` para restablecer la línea base de la fuente. Nuestro contador ahora funcionará como se esperaba.
fr: Parce que nous avons dupliqué le ``Counter`` de la barre ``Count``, la police du nœud ``Number`` est désactivée. Sélectionnez à nouveau le nœud ``Number``, dirigez-vous vers la propriété ``Font`` et cliquez dessus pour accéder à la ressource ``DynamicFont``. Dans la section ``Extra Spacing``, changez la valeur ``Bottom`` à ``0`` pour réinitialiser la ligne de base de la police. Notre compteur fonctionne maintenant comme prévu.
ja: Barの ``Count`` から ``Counter`` を複製したため、 ``Number`` ノードのフォントはオフになっています。 ``Number`` ノードを再度選択し、 ``Font`` プロパティに移動してクリックし、 ``DynamicFont`` リソースにアクセスします。 ``Extra Spacing`` セクションで、 ``Bottom`` 値を ``0`` に変更してフォントのベースラインをリセットします。カウンターは正常に作動します。
ko: Bar의 ``Count``\ 에서 ``Counter``\ 를 복제했기 때문에, ``Number`` 노드의 폰트는 꺼져 있습니다. ``Number`` 노드를 다시 선택하고 ``Font`` 속성으로 가세요. 그리고 속성을 클릭해서 ``DynamicFont`` 리소스에 접근하세요. ``Extra Spacing`` 섹션에서 ``Bottom`` 값을 ``0``\ 으로 바꿔서 폰트의 기준선을 초기화하세요. Counter는 이제 생각한대로 작동합니다.
pt_br: Como duplicamos o ``Counter`` do ``Count`` da barra, a fonte do nó ``Number`` está desativada. Selecione o nó ``Number`` novamente, vá para a propriedade ``Font`` e clique nele para acessar o recurso ``DynamicFont``. Na seção ``Extra Spacing``, altere o valor ``Bottom`` para ``0`` para redefinir a linha de base da fonte. Nosso contador agora funciona como esperado.
ru: Поскольку мы продублировали ``Counter`` как ``Count``, шрифт узла ``Number`` сломался. Снова выберите узел ``Number``, перейдите к свойству ``Font`` и щелкните по нему, чтобы получить доступ к ``DynamicFont``. В разделе ``Extra Spacing`` измените значение ``Bottom`` на ``0``, чтобы сбросить шрифт. Теперь наш счетчик работает, как должен.
uk: Оскільки ми дублювали ``Counter`` з ``Count`` шрифт вузла ``Number`` зламався. Виберіть вузол ``Number`` ще раз, перейдіть до властивості ``Font`` і клацніть по ресурсу ``DynamicFont``. У розділі ``Extra Spacing`` змініть значення ``Bottom`` на ``0``, щоб скинути базову лінію шрифту. Зараз наш лічильник працює як очікувалося.
zh_cn: 因为我们从条形图的 ``Count`` 中复制了 ``Counter``, 所以 ``Number`` 节点的字体关闭了. 再次选择 ``Number`` 节点, 转到 ``Font`` 属性, 然后点击它访问 ``DynamicFont`` 资源. 在 ``Extra Spacing`` 部分, 将 ``Bottom`` 值改为 ``0`` 以重置字体的基线. 我们的计数器现在运作正常.
zh_tw: 因為我們的 ``Counter`` 是從計量槽的 ``Count`` 複製過來的，所以現在 ``Number`` 節點的字體跑掉了。選擇 ``Number`` 節點，然後找到 ``Font`` 屬性並點擊來設定 ``DynamicFont`` 資源。將 ``Extra Spacing`` 段落下的 ``Bottom`` 值改為 ``0`` 來重設字體的基線。現在計數器應該正常運作了。

source: Let's make the ``Counters`` anchor to the right edge of the viewport. To do so, we need to set the ``Bars`` container take all the available horizontal space it can. Select the ``Bars`` node and scroll down to the ``Size Flags`` category. In the ``Horizontal`` category, check the ``Expand`` value. The ``Bars`` node should resize and push the counter to the right side of the screen.
cs: Připoutejme nyní ``Counters`` k pravému okraji výřezu. Abychom to mohli udělat, musíme nastavit kontejner ``Bars`` tak, aby zabral veškerý dostupný vodorovný prostor. Vyberte uzel ``Bars`` a přejděte dolů do kategorie ``Size Flags``. V kategorii ``Horizontal`` zaškrtněte hodnotu ``Expand``. Uzel ``Bars`` by měl změnit velikost a zatlačit počítadlo na pravou stranu obrazovky.
de: Sorgen wir dafür, dass die ``Counters`` am rechten oberen Rand des Sichtfelds verankert werden. Dafür müssen wir den Container ``Bars`` so einstellen, dass der den ganzen horizontalen Platz einnimmt, der ihm zur Verfügung steht. Wähle den ``Bars``-Knoten aus und gehe hinunter zum Bereich ``Size Flags``. Im Bereich ``Horizontal``, setze einen Haken bei ``Expand``. Der Node ``Bars`` sollte seine Größe ändern und den Zähler an den rechten Bildschirmrand verschieben.
es: Ahora hagamos que los ``Counters`` se anclen en el borde derecho de la ventana. Para ello pondremos el Container ``Bars`` para que se expanda y ocupe todo el espacio horizontal. Selecciona el nodo ``Bars`` y desplázate hacia abajo hasta la categoría ``Size Flags``. En la categoría ``Horizontal``, marca el campo ``Expand``. El nodo ``Bars`` debe redimensionar y empujar el contador hacia la parte derecha de la pantalla.
fr: Pendant que nous y sommes, faisons en sorte que les ``Counters`` soient positionnés sur le bord droit de la fenêtre du viewport. Pour ce faire, nous allons régler le conteneur ``Bars`` pour qu'il s'étende et prenne tout l'espace horizontal. Sélectionnez le nœud ``Bars`` et faites défiler vers le bas jusqu'à la catégorie ``Size Flags``. Dans la catégorie ``Horizontal``, cochez la valeur ``Expand``. Le nœud ``Bars`` devrait se redimensionner et pousser le compteur à la droite de l'écran.
ja: ビューポートの右端に ``Counters`` アンカーを配置してみましょう。これを行うには、 ``Bars`` コンテナがすべての利用可能な水平スペースを確保するように設定する必要があります。 ``Bars`` ノードを選択し、 ``Size Flags`` カテゴリまで下にスクロールします。 ``Horizontal`` カテゴリで、 ``Expand`` の値を確認します。 ``Bars`` ノードのサイズを変更し、カウンターを画面の右側に押し付ける必要があります。
ko: ``Counters`` 앵커가 뷰포트의 오른쪽 모서리에 있도록 만듭시다. 그러러면 먼저 ``Bars`` 컨테이너가 가능한 전체 수평 공간을 차지하도록 설정해야 합니다. ``Bars`` 노드를 선택하고 ``Size Flags`` 카테고리로 내려가세요. ``Horizontal`` 카테고리에서 ``Expand`` 값을 체크하세요. ``Bars`` 노드는 크기가 조절되면서 Counter를 화면의 오른쪽 모서리로 밀어낼 것입니다.
uk: Давайте прив'яжемо ``Counters`` до правого краю вікна перегляду. Для цього нам потрібно налаштувати контейнер ``Bars`` так, щоб він зайняв весь наявний горизонтальний простір, який зможе. Виберіть вузол ``Bars`` і прокрутіть вниз до розділу ``Size Flags``. У підрозділі ``Horizontal`` позначте ``Expand``. Вузол ``Bars`` повинен змінити розмір і потиснути лічильник до правої сторони екрану.
zh_cn: 让我们将 ``Counters`` 锚定到视图的右边缘. 为此, 我们需要将 ``Bars`` 容器设置为占用所有可用的水平空间. 选择 ``Bars`` 节点, 然后向下滚动到 ``Size Flags`` 类别. 在 ``Horizontal`` 类别中, 检查 ``Expand`` 值. ``Bars`` 节点应调整大小并将计数器推到屏幕右侧.
zh_tw: 接著來把 ``Counters`` 錨定到檢視區的右邊。這裡我們需要讓 ``Bars`` 容器可以吃掉所有水平方向上可用的空間。選擇 ``Bars`` 節點，並向下滾動找到 ``Size Flags`` 分類，將 ``Horizontal`` 分類底下的 ``Expand`` 值打勾。現在 ``Bars`` 節點的大小應該變成會把計數器推到畫面右邊了。
