Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_game_user_interface.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: The label itself requires at least three nodes: a ``NinePatchRect`` for the background, on top of which we'll add a texture on the left, either ``HP`` or ``EP``, and a ``Label`` on the right for the value. We can nest ``Control`` nodes however we want. We could use the ``NinePatchRect`` as a parent for the two other elements, as it encompasses them. In general, you want to use containers instead, as their role is to help organize UI components. We'll need a ``MarginContainer`` later anyway to add some space between the life count and the gauge. Select the ``Bar`` and add a ``MarginContainer``. Name it ``Count``. Inside of it, add three nodes:
cs: Samotný štítek vyžaduje alespoň tři uzly: ``NinePatchRect`` pro pozadí, na který přidáme nalevo texturu, buď ``HP`` nebo ``EP`` , a ``Label`` vpravo pro hodnotu. Uzly ``Control`` můžeme vnořovat, jak chceme. Mohli bychom použít ``NinePatchRect`` jako prvek nadřazený pro dva další prvky, protože je obsahuje. Obecně však chcete místo toho použít kontejnery, protože jejich rolí je pomoci uspořádat komponenty uživatelského rozhraní. Později budeme potřebovat ``MarginContainer`` , abychom přidali nějaký ten prostor mezi počtem životů a měřidlem. Vyberte ``Bar`` a přidejte ``MarginContainer`` . Pojmenujte ho ``Count`` . Do něho přidejte tři uzly:
de: Die Beschriftung selbst bedarf mindestens dreier Nodes: ein ``NinePatchRect`` für den Hintergrund, über den wir links eine Textur legen werden, entweder ``HP`` oder ``EP``, und ein ``Label`` rechts für den Wert. ``Control``-Nodes können wir verschachteln wie wir wollen. Wir könnten den ``NinePatchRect als Elternknoten für die beiden anderen Elemente wählen, da er sie umfasst. Allgemein sollten Container benutzt werden, da sie dafür da sind, die Organisation der UI-Elemente zu unterstützen. Wir brauchen sowieso später einen ``MarginContainer``, um etwas Platz zwischen dem Lebenszähler und der Anzeige einzufügen. Wähle die ``Bar`` aus und füge einen ``MarginContainer`` hinzu. Nenne ihn ``Count``. Füge darin drei Knoten ein:
es: La etiqueta en sí requiere al menos tres nodos: un ``NinePatchRect`` para el fondo, sobre el cual añadiremos una textura a la izquierda, ya sea ``HP`` o ``EP``, y un ``Label``` a la derecha para el valor. Podemos anidar nodos ``Control`` como queramos. Podríamos usar el ``NinePatchRect`` como padre para los otros dos elementos, ya que los abarca. En general, es preferible utilizar containers, ya que su función es ayudar a organizar los componentes de la UI. Necesitaremos un ``MarginContainer`` más tarde para añadir algo de espacio entre el contador de vida y el medidor. Selecciona el nodo ``Bar` y añade un ``MarginContainer``. Nómbralo ``Count``. Dentro de éste, agrega tres nodos:
fr: Le label nécessite au moins trois nœuds : Un ``NinePatchRect`` pour le fond, sur lequel nous ajouterons une texture à gauche, soit ``HP`` ou ``EP``, et un ``Label`` à droite pour la valeur. Nous pouvons emboîter les nœuds ``Control`` comme nous le souhaitons. Nous pouvons utiliser le ``NinePatchRect`` comme parent pour les deux autres éléments car il les englobe. En général, il est préférable d'utiliser des conteneurs à la place, car leur rôle est d'aider à organiser les composants de l'interface utilisateur. Nous aurons besoin d'un ``MarginContainer`` plus tard de toute façon pour ajouter de l'espace entre la durée de vie et la jauge. Sélectionnez ``Bar``, ajoutez un ``MarginContainer`` et donnez-lui le nom de ``Count``. A l'intérieur, ajoutez trois nœuds :
ja: ラベル自体には少なくとも3つのノードが必要です。 ``NinePatchRect`` は背景用で、その上に ``HP`` または ``EP`` のテクスチャを追加し、値用に ``Label`` を右側に追加します。 ``Control`` ノードであれば好きなようにネストできます。この ``NinePatchRect`` は他の2つの要素を囲んでいるので、親として使用することもできます。しかし通常は、代わりにコンテナを使用します。UIコンポーネントの編成を助けることが、コンテナの役割だからです。ライフカウントとゲージの間にスペースを入れるため、いずれにせよ後で ``MarginContainer`` が必要になります。 ``Bar`` を選択し、 ``MarginContainer`` を追加してください。それに ``Count`` という名前を付けます。その中に、次の3つのノードを追加してください:
ko: 라벨에는 적어도 세 개의 노드가 더 필요합니다: 배경에 쓸 ``NinePatchRect``, 그 배경에서 왼쪽에 ``HP`` 또는 ``EP``\ 라고 적힌 텍스처, 그리고 오른쪽에 값을 표시하기 위한 ``Label``. ``Control`` 노드는 원하는 만큼 중첩할 수 있습니다. 그리고 ``NinePatchRect``\ 를 다른 두 요소의 부모로 사용할 수 있습니다. 기본적으로, 컨테이너를 UI 구성 요소를 조직하도록 도움이 되는 역할로 사용할 수 있습니다. 나중에 체력 카운터와 게이지 사이에 영역을 추가하기 위해서, ``MarginContainer``\ 가 필요할 것입니다. ``Bar``\ 를 선택하고 ``MarginContainer``\ 를 추가하세요. 이름은 ``Count``\ 라고 지으세요. 이 컨테이너 안에 세 개의 노드를 추가하세요:
pt_br: O rótulo em si requer pelo menos três nós: um ``NinePatchRect`` para o fundo, em cima do qual vamos adicionar uma textura à esquerda, ``HP`` ou ``EP``, e ``Label`` à direita para o valor. Nós podemos aninhar os nós ``Control`` como quisermos. Nós poderíamos usar o ``NinePatchRect`` como pai para os outros dois elementos, já que os engloba. Em geral, você deseja usar contêineres, pois sua função é ajudar a organizar os componentes da interface do usuário. Vamos precisar de um ``MarginContainer`` mais tarde para adicionar algum espaço entre a contagem de vida e o medidor. Selecione a ``Bar`` e adicione um ``MarginContainer``. Nomeie-o como ``contagem``. Dentro dele, adicione três nós:
ru: Сама метка требует по крайней мере трех узлов: a ``NinePatchRect`` для фона, над которым мы добавим текстуру слева, для ``HP`` или ``EP``, и еще ``Label`` справа для значения. Мы могли бы вложить ``Control`` узлы, как нам угодно. И даже использовать ``NinePatchRect`` в качестве родителя для двух других элементов, так как они включают в себя их. Но все же, вместо этого нужно использовать контейнеры, поскольку их роль состоит в том, чтобы помочь упорядочить компоненты UI. Нам понадобится ``MarginContainer`` позже в любом случае, чтобы добавить некоторое пространство между количеством жизни и датчика. Выберите ``Bar`` и добавьте ``MarginContainer``. Назовите его ``Count``. Внутри него, добавить три узла:
uk: Для самої мітки потрібно щонайменше три вузли: ``NinePatchRect`` для фону, поверх якого ми додамо текстуру зліва, ``HP``, або ``EP``, і ``Label`` праворуч для значення. Ми можемо вкласти вузли``Control`` як захочемо. Ми могли б використовувати ``NinePatchRect`` в якості предка для двох інших елементів. Але краще використовувати контейнери замість цього, оскільки їх роль полягає в організації компонентів інтерфейсу. Врешті, пізніше, нам все-таки знадобиться ``MarginContainer``, щоб додати простір між кількістю життя та показником. Виберіть ``Bar`` і додайте ``MarginContainer``. Назвіть його ``Count``. Всередину нього додайте три вузли:
zh_cn: 标签本身至少需要三个节点: 一个作为背景的 ``NinePatchRect``, 在其顶部, 我们将在左侧添加一个纹理, 即 ``HP`` 或 ``EP``, 并在右侧用来显示值的一个 ``Label``. 我们可以根据需要嵌套 ``Control`` 节点. 我们可以将 ``NinePatchRect`` 用作其他两个元素的父元素, 因为它包含了它俩. 通常, 你想使用容器代替, 因为它们的作用是帮助组织UI组件. 无论如何, 我们以后都需要一个 ``MarginContainer`` 来在生命计数和量规之间增加一些空间. 选择 ``Bar`` 并添加一个 ``MarginContainer``. 将其命名为 ``Count``. 在其中添加三个节点:
zh_tw: 左側的 Label 本身會需要至少三個子節點：一個用來顯示背景的 ``NinePatchRect`` ，以及疊在上面的 ``HP`` 或 ``EP`` 貼圖紋理，這個稍後會被放在左側，接著是右邊的數值。我們可以按照各種方式來嵌套 ``Control`` 節點。我們也可以使用 ``NinePatch`` 節點來容納其他兩個子節點來作為母節點，但通常來說我們會使用 Container，因為 Container 的功能就是用來組織 UI 元件。不管怎樣我們稍後還是會用到 ``MarginContainer`` 來在血量與血槽間加上間隙。讓我們選擇 ``Bar`` 並新增一個 ``MarginContainer`` ，命名為 ``Count`` 。在其中新增三個子節點：

source: A ``NinePatchRect`` named ``Background``
cs: ``NinePatchRect`` s názvem ``Background``
de: Ein ``NinePatchRect`` namens ``Background``
es: Un ``NinePatchRect`` llamado ``Background``
fr: Un ``NinePatchRect`` nommé ``Background``
ja: ``Background`` という名前の ``NinePatchRect``
ko: ``NinePatchRect``, 이름은 ``Background``
pt_br: Um ``NinePatchRect`` chamado ``Background``
ru: ``NinePatchRect`` с именем ``Background``
uk: ``NinePatchRect`` з іменем ``Background``
zh_cn: 一个名为 ``Background`` 的 ``NinePatchRect``
zh_tw: 命名為 ``Background`` 的 ``NinePatchRect``

source: A ``TextureRect`` named ``Title``
cs: ``TextureRect`` s názvem ``Title``
de: Ein ``TextureRect`` namens ``Title``
es: Un ``TextureRect`` llamado ``Title``
fr: Un ``TextureRect`` nommé ``Title``
ja: ``Title`` という名前の ``TextureRect``
ko: ``TextureRect``, 이름은 ``Title``
pt_br: Um ``TextureRect`` chamado ``Title``
ru: ``TextureRect`` с именем ``Title``
uk: ``TextureRect`` з іменем ``Title``
zh_cn: 一个名为 ``Title`` 的 ``TextureRect``
zh_tw: 命名為 ``Title`` 的 ``TextureRect``

source: And a ``Label`` named ``Number``
cs: A ``Label`` s názvem ``Number``
de: Und ein ``Label`` namens ``Number``
es: Y un ``Label`` llamado ``Number``
fr: Et un ``Label`` nommé ``Number``
ja: ``Number`` という名前の ``Label``
ko: ``Label``, 이름은 ``Number``
pt_br: E um ``Label`` chamado ``Number``
ru: И ``Label`` с именем ``Number``
uk: І ``Label`` з іменем ``Number``
zh_cn: 和一个名为 ``Number`` 的 ``Label``
zh_tw: 命名為 ``Number`` 的 ``Label``

source: To add the nodes as siblings, always select the ``Count`` node first.
cs: Pro přidání těchto uzlů na stejnou úroveň (jsou to "sourozenci"), vždy nejprve vyberte uzel ``Count``.
de: Wähle vorher den Node ``Count`` aus, damit sie als Kinder hinzugefügt werden.
es: Para añadir los nodos como hermanos, selecciona siempre el nodo ```Count`` primero.
fr: Pour ajouter les nœuds en tant que frères, sélectionnez toujours le nœud ``Count`` en premier.
ja: ノードを兄弟として追加するには、必ず最初に ``Count`` ノードを選択します。
ko: 노드를 동기로 추가하려면, 항상 먼저 ``Count`` 노드를 선택하세요.
pt_br: Para adicionar os nós como irmãos, sempre selecione primeiro o nó ``Count``.
ru: Чтобы добавлять узлы на один и тот же уровень, всегда сначала выбирайте узел ``Count``.
uk: Щоб додані вузли були побратимами, перед додаванням завжди вибирайте вузол ``Count``.
zh_cn: 要将节点添加为兄弟节点, 请始终先选择 ``Count`` 节点.
zh_tw: 為了把節點都弄成同級節點，記得要在新增前點選 ``Count`` 節點。

source: Your scene tree should look like this. We're ready to throw in some textures
cs: Váš strom scén by měl vypadat takto. Teď jsme připravení vložit nějaké textury
de: Dein Szenenbaum sollte so aussehen. Wir können nun einige Texturen ins Spiel bringen
es: Tu árbol de escenas debería verse así. Ahora estamos listos para añadir algunas texturas
fr: Votre arbre de scène devrait ressembler à ceci. Nous sommes prêts à ajouter des textures
ja: シーンツリーは次のようになります。いくつかのテクスチャを追加する準備ができました
ko: 씬 트리는 다음과 같아야 합니다. 이제 텍스처를 줄 준비가 되었습니다
pt_br: Sua árvore de cenas deve ficar assim. Estamos prontos para jogar algumas texturas
ru: Ваше дерево сцены должно выглядеть так. Мы готовы добавить несколько текстур
uk: Ваше дерево сцени повинно виглядати так. Ми готові додати деякі текстури
zh_cn: 你的场景树应如图所示. 我们准备加入一些纹理
zh_tw: 場景樹現在應該看起來像這樣。接著已經準備好要新增紋理貼圖了

source: Our scene is still empty. It's time to throw in some textures. To load the textures, head to the FileSystem dock to the left of the viewport. Browse down to the res://assets/GUI folder.
cs: Naše scéna je stále prázdná. Je na čase vložit do ní nějaké textury. Pro načtení textur zamiřte do panelu Souborového Systému vlevo od viewportu. Přejděte dolů do složky res://assets/GUI.
de: Unsere Szene ist noch leer. Es wird Zeit, Texturen ins Spiel zu bringen. Um Texturen zu laden, gehe zum Dateibrowser links vom Hauptfenster. Navigiere dann bis zum Ordner res://assets/GUI folder.
es: Nuestra escena sigue vacía. Es hora de añadir algunas texturas. Para cargar las texturas, dirígete al panel del Sistema de Archivos a la izquierda de la ventana de visualización. Busca la carpeta res://assets/GUI.
fr: Notre scène est encore vide. Il est temps d'ajouter des textures. Pour charger les textures, dirigez-vous vers le dock FileSystem à gauche de la fenêtre. Naviguez jusqu'au dossier res://assets/GUI.
ja: シーンはまだ空です。テクスチャをいくつか投入します。テクスチャをロードするには、ビューポートの左側にあるファイルシステムドックに移動します。「res://assets/GUI」フォルダに移動します。
ko: 씬은 아직 텅텅 비어 있습니다. 텍스처를 줄 시간입니다. 텍스처를 불러오려면, 뷰포트 왼쪽에 있는 파일 시스템(FileSystem) 독으로 가세요. res://assets/GUI 폴더로 들어가세요.
pt_br: Nossa cena ainda está vazia. É hora de jogar algumas texturas. Para carregar as texturas, vá para a aba FileSystem à esquerda da viewport. Navegue até a pasta res://assets/GUI.
ru: Наша сцена по-прежнему пуста. Самое время, чтобы поместить в неё какие-нибудь текстуры. Для загрузки текстур, направляйтесь в файловую систему слева от окна. Перейдите вниз к папке res://assets/GUI.
uk: Наша сцена все ще порожня. Настав час закинути деякі текстури. Щоб завантажити текстури, перейдіть до панелі Файлова система зліва від області перегляду. Перейдіть до теки res://assets/GUI folder.
zh_cn: 我们的场景仍然是空的. 是时候加入一些纹理了. 要加载纹理, 请转到视图左侧的文件系统停靠面板. 向下浏览到 ``res://assets/GUI`` 文件夹.
zh_tw: 現在場景還是空的，是時候來點紋理貼圖了。要載入紋理貼圖，請看到檢視區左邊的檔案系統 Dock，並移動到 res://assets/GUI 資料夾。

source: You should see a list of textures that we'll use to skin our interface.
cs: Měli byste vidět seznam textur, které použijeme na stylizování našeho rozhraní.
de: Du solltest eine Liste an Texturen sehen, die wir über unsere Oberfläche legen werden.
es: Deberías ver una lista de texturas que usaremos para personalizar nuestra interfaz.
fr: Vous devriez voir une liste de textures que vous allez pouvoir utiliser pour votre interface.
ja: インターフェースのスキンに使用するテクスチャのリストが表示されます。
ko: 인터페이스를 장식할 텍스처 목록은 다음과 같아야 합니다.
pt_br: Você deve ver uma lista de texturas que usaremos para aplicar a nossa interface.
ru: Вы должны увидеть список текстур, которые мы будем использовать для нашего интерфейса.
uk: Ви повинні побачити список текстур, які ми будемо використовувати для розробки нашого інтерфейсу.
zh_cn: 你应该会看到我们将用来为界面蒙皮的纹理列表.
zh_tw: 這裡有我們要拿來給界面用的紋理貼圖。

source: Select the ``Background`` in the Scene dock. In the Inspector, you should see a ``Texture`` property. In the FileSystem tab, click and drag ``label_HP_bg.png`` onto the ``Texture`` slot. It stays squashed. The parent MarginContainer will force its size down to 0 until we force elements inside the container to have a minimum size. Select the ``Background`` node. In the Inspector, scroll down to the Rect section. Set ``Min Size`` to (100, 40). You should see the ``Background`` resize along with its parent containers.
cs: V doku scény vyberte ``Background``. V Inspektoru byste měli vidět vlastnost ``Texture``. Na kartě FileSystem klikněte a přetáhněte ``label_HP_bg.png`` do slotu ``Texture``. Zůstává zmáčknutá. Nadřazený MarginContainer vynucuje její velikost až na 0, dokud nezadáme pro prvky uvnitř tohoto kontejneru minimální velikost. Vyberte uzel ``Backround``. V Inspektoru přejděte dolů do sekce Rect. Nastavte ``Min Size`` na (100, 40). Měli byste vidět jak se velikost ``Backround`` a jeho nadřazených kontejnerů změnila.
de: Wähle den ``Background`` im Szenenfenster. Im Inspektor solltest du die Eigenschaft ``Texture`` sehen. Ziehe ``label_HP_bg.png`` aus dem Dateibrowser in das ``Textur``-Feld. Es bleibt gequätscht. Der übergeordnete MarginContainer zwingt seine Größe auf 0 herunter bis wir für die untergeordneten Elemente eine minimale Größe erzwingen. Wähle den Node ``Background`` aus. Gehe im Inspektor hinunter zum Bereich Rect. Setze ``MinSize`` auf (100, 40). Du solltest sehen, wie der ``Background`` seine Größe zusammen mit seinen übergeordneten Containern ändert.
es: Selecciona el ``Background`` en el panel de Escena. En el Inspector, debes ver una propiedad "Texture". En la pestaña del Sistema de Archivo, haz clic y arrastra ``label_HP_bg.png`` a la ranura ``Texture``. Se queda aplastado. El MarginContainer padre forzará su tamaño a 0 hasta que obliguemos a los elementos dentro del container a tener un tamaño mínimo. Selecciona el nodo ``Background``. En el Inspector, desplázate hacia abajo hasta la sección Rect. Establece ``Min Size`` en (100, 40). Deberías ver el cambio de tamaño de ``Background`` junto con sus containers principales.
fr: Sélectionnez ``Background`` dans le dock Scène. Dans l'inspecteur, vous devriez voir une propriété ``Texture``. Dans l'onglet Système de fichiers, cliquez et faites glisser ``label_HP_bg.png`` sur l'emplacement ``Texture``. Il reste écrasé. Le conteneur MarginContainer parent forcera sa taille à 0 jusqu'à ce que nous forcions les éléments à l'intérieur du conteneur à avoir une taille minimale. Sélectionnez le nœud ``Background``. Dans l'inspecteur, faites défiler vers le bas jusqu'à la section Rect. Réglez ``Min Size`` à (100, 40). Vous devriez voir le ``Background`` redimensionné avec ses conteneurs parents.
ja: シーンDockで背景を選択します。インスペクタに ``Texture`` プロパティが表示されます。タブで、 ``label_HP_bg.png`` をクリックし、テクスチャスロットにドラッグします。つぶれたままです。親の ``MarginContainer`` は、コンテナ内の要素が最小サイズになるまで、サイズを0にします。 ``Background`` ノードを選択します。インスペクタで、矩形セクションまでスクロールします。 ``Min Size`` を(100、40)に設定します。親コンテナとともに ``Background`` のサイズが変更されます。
ko: 씬(Scene) 독에서 ``Background``\ 를 선택하세요. 인스펙터(Inspector)에서 ``Texture`` 속성을 볼 수 있습니다. 파일 시스템(FileSystem) 탭으로 가서, ``label_HP_bg.png``\ 를 ``Texture`` 슬롯으로 드래그하세요. 찌그러진 채로 들어갑니다. 컨테이너 안의 요소에게 최소 크기를 주지 않으면, 부모 MarginContainer가 텍스처 크기를 0 으로 만듭니다. ``Background`` 노드를 선택하세요. 인스펙터(Inspector) Rect 섹션으로 내려가세요. ``Min Size``\ 를 (100, 40)으로 설정하세요. ``Background``\ 가 부모 컨테이너에 따라 크기가 조절된 것을 볼 수 있습니다.
pt_br: Selecione o ``Background`` na seção Scene. No Inspetor, você deve ver uma propriedade ``Texture``. Na aba FileSystem, clique e arraste ``label_HP_bg.png`` para o slot de ``Texture``. Ele fica espremido. O MarginContainer pai forçará seu tamanho a 0 até forçarmos que os elementos dentro do contêiner tenham um tamanho mínimo. Selecione o nó ``Background``. No inspetor, role para baixo até a seção Rect. Defina o ``Min Size`` para (100, 40). Você deve ver o redimensionamento do ``Background`` junto com seus contêineres pai.
ru: Выберите ``Background`` в панели сцены. В инспекторе вы найдите свойство ``Texture``. Из вкладки Файловая система перетащите ``label_HP_bg.png`` на параметр ``Texture``. Картинка будет сжата. Родительский MarginContainer будет уменьшать его размер до нуля, пока мы принудительно не изменим элементы внутри контейнера, чтобы получить минимальный размер. Выберите узел ``Background``. В инспекторе прокрутите вниз до раздела Rect. Установите ``Min Size`` на (100, 40). Вы должны увидеть изменение размера ``Background`` вместе с его родительскими контейнерами.
uk: Виберіть ``Background`` в Сцені. В Інспекторі ви повинні побачити властивість ``Texture``. З панелі Файлова система перетягніть ``label_HP_bg.png`` в ``Texture``. Картинка залишиться стиснута. Предок MarginContainer стискає розміри до 0, поки ми не задамо елементам всередині контейнера мінімальний розмір, який треба утримувати. Виберіть вузол ``Background``. У Інспекторі прокрутіть униз до розділу Rect. Встановіть ``Min Size`` на (100, 40). Ви повинні побачити, як міняється розмір ``Background`` разом з його батьківськими контейнерами.
zh_cn: 在场景停靠面板中选择 ``Background``. 在属性检查器中, 你应该看到一个 ``Texture`` 属性. 在 ``FileSystem`` 选项卡中, 点击并将 ``label_HP_bg.png`` 拖到 ``Texture`` 插槽中. 它保持压扁. 父 ``MarginContainer`` 将强制其大小降为0, 直到我们强制容器中的元素具有最小大小. 选择 ``Background`` 节点. 在属性检查器面板中, 向下滚动到 ``Rect`` 部分. 设置 ``Min Size`` 为(100,40). 你应该会看到 ``Background`` 和它的父容器一起重调大小.
zh_tw: 在場景 Dock 中選擇 ``Background`` 。找到屬性面板中的 ``Texture`` 屬性，並在檔案系統分頁中點擊並拖移 ``label_HP_bg.png`` 到 ``Texture`` 槽裡。Background 節點現在看起來還扁扁的，因為在元素有大小之前，母節點的 MarginContainer 都先強制把節點的大小設為 0。讓我們選擇 ``Background`` 節點，並在屬性面板中向下滾動到 Rect 段落，將 ``Min Size`` （最小大小）設為 (100, 40) 。接著就可以看到 ``Background`` 的節點跟著母節點一起被放大了。

source: Next, select the ``Title`` and drag and drop ``label_HP.png`` into its ``Texture`` slot. Select the ``Number`` node, click the field next to the ``Text`` property and type ``10``. This way, we can see both nodes in the viewport. They should stack up in the top-left corner of their parent ``MarginContainer``.
cs: Dále vyberte ``Title`` a přetáhněte ``label_HP.png`` do jeho slotu ``Texture`` . Vyberte uzel ``Number`` klikněte na pole vedle vlastnosti ``Text`` a zadejte ``10``. Tímto způsobem můžeme vidět oba uzly ve výřezu. Měly by se nahromadit v levém horním rohu svého nadřazeného ``MarginContainer``.
de: Wähle dann den ``Title`` aus und ziehe ``label_HP.png`` in sein ``Texture``Feld. Wähle den ``Number``-Node, klicke auf das Feld neben der Eigenschaft ``Text`` und gebe ``10`` ein. Auf diese Weise können wir beide Nodes im Fenster sehen. Sie sollten sich links oben in der Ecke ihres übergeordneten ``MarginContainer`` anordnen.
es: A continuación, selecciona el ``Title`` y arrastra y suelta ``label_HP.png`` en la ranura ``Texture``. Selecciona el nodo ``Number``, haz clic en el campo junto a la propiedad ``Text`` y escribe ``10``. De esta forma, podemos ver ambos nodos en la ventana de visualización. Deberían colocarse en la esquina superior izquierda de su ``MarginContainer`` padre.
fr: Ensuite, sélectionnez le ``Title`` et glissez-déposez ``label_HP.png`` dans l'emplacement ``Texture``. Sélectionnez le nœud ``Number``, cliquez sur le champ à côté de la propriété ``Text`` et tapez ``10``. De cette façon, nous pouvons voir les deux nœuds dans le viewport. Ils devraient s'empiler dans le coin supérieur gauche de leur parent ``MarginContainer``.
ja: 次に、 ``Title`` を選択し、 ``label_HP.png`` を ``Texture`` スロットにドラッグ&ドロップします。 ``Number`` ノードを選択し、 ``Text`` プロパティの横のフィールドをクリックして ``10`` と入力します。これで、ビューポートに両方のノードが表示されます。これらのコンテナは、親の ``MarginContainer`` の左上隅に積み重ねられます。
ko: 다음으로 ``Title``\ 을 선택하고, ``label_HP.png``\ 를 ``Texture`` 슬롯으로 드래그 앤 드롭하세요. ``Number`` 노드를 선택하고, ``Text`` 속성 옆의 영역을 클릭한 뒤 ``10``\ 을 입력하세요. 이제 두 노드 모두 뷰포트에서 볼 수 있습니다. 두 노드는 부모 ``MarginContainer``\ 의 왼쪽 위 모서리에 포개져 있어야 합니다.
pt_br: Em seguida, selecione o ``Title`` e arraste e solte ``label_HP.png`` em seu slot ``Texture``. Selecione o nó ``Number``, clique no campo ao lado da propriedade ``Text`` e digite ``10``. Dessa forma, podemos ver os dois nós na viewport. Eles devem se empilhar no canto superior esquerdo de seu pai ``MarginContainer``.
uk: Далі виберіть ``Title`` і перетягніть ``label_HP.png`` в його властивість ``Texture``. Виберіть вузол ``Number``, натисніть поле поруч із властивістю ``Text`` та введіть ``10``. Таким чином, ми можемо побачити обидва вузли у вікні перегляду. Вони повинні складатись у верхньому лівому куті свого предка ``MarginContainer``.
zh_cn: 接下来, 选择 ``Title`` 并将 ``label_HP.png`` 拖放到其 ``Texture`` 插槽中. 选择 ``Number`` 节点, 点击 ``Text`` 属性旁边的字段, 然后键入 ``10``. 这样, 我们可以在视图中看到两个节点. 他们应该堆叠在其父级 ``MarginContainer`` 的左上角.
zh_tw: 接著，選擇 ``Title`` 節點並拖曳 ``label_HP.png`` 節點至 ``Texture`` 槽內。選擇 ``Number`` 節點後點擊 ``Text`` 屬性旁邊的欄位並輸入 ``10`` 。如此一來，兩個檢視區都可以可以在檢視區中看到了。著兩個節點應該會從母節點的 ``MarginContainer`` 的左上角開始堆疊。

source: If you select both nodes, you should see something like this
cs: Pokud vybere oba uzly, měli byste vidět něco jako je toto
de: Wenn du beide Nodes auswählst, solltest du so etwas in der Art sehen
es: Si seleccionas ambos nodos, deberías ver algo como esto
fr: Si vous sélectionnez les deux nœuds, vous devriez voir quelque chose comme ceci
ja: 両方のノードを選択すると、次のように表示されます
ko: 두 노드를 선택하면 이렇게 보여야 합니다
pt_br: Se você selecionar ambos os nós, você deve ver algo como isto
ru: Если вы выберите оба узла, вы должны увидеть что-то такое
uk: Якщо вибрати обидва вузли, ви повинні побачити щось подібне
zh_cn: 如果你选择两个节点, 你应该会看到这样的结果
zh_tw: 若選擇了兩個節點，則應該可以看到類似這樣的東西
