Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_game_user_interface.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: We now need the text's baseline, the number's lower edge, to align with the HP texture on the left. To do so, still in the ``DynamicFont`` resource, you can tweak the ``Bottom`` property under the ``Extra Spacing`` category. It adds some bottom padding to the text. Click the ``Number`` node in the Scene tab to go back to the node's properties and change the ``Valign`` to ``Bottom``. To adjust the text's baseline, click on the font field under the ``Custom Font`` category again and tweak the ``Bottom`` property until the text aligns with the ``Title`` node. I used a value of ``2`` pixels.
cs: Nyní potřebujeme zarovnat základní linii textu pro spodní hranu uzlu ``Number`` s texturou HP vlevo. Chcete-li tak učinit, stále ve zdroji ``DynamicFont`` můžete vyladit vlastnost ``Bottom`` v kategorii ``Extra Spacing``. Zarovnává spodní část textu. Kliknutím na uzel ``Number`` na kartě Scéna se vraťte zpět k vlastnostem uzlu a změňte možnost ``Valign`` na ``Bottom``. Chcete-li upravit základnu textu, klikněte znovu na pole písma v kategorii ``Custom Font`` a upravte vlastnost ``Bottom``, dokud se text nevyrovná s uzlem ``Title``. Použil jsem hodnotu ``2`` pixely.
de: Nun muss die Grundlinie der Zahl, ihre untere Kante, bündig mit der HP-Textur links abschließen. Dafür kannst du in der Ressource ``DynamicFont`` bleiben und die Eigenschaft ``Bottom`` unter der Kategorie ``Extra Spacing`` abändern. Das fügt etwas Platz unter dem Text hinzu. Klicke auf den Node ``Number`` im Szenenfenster, um zurück zu den Knoteneigenschaften zu kommen, und ändere ``VAlign`` zu ``Bottom``. Um die Grundlinie des Texts anzupassen, klicke wieder auf das Fontfeld unter der Kategorie ``Custom Font`` ändere die Eigenschaft ``Bottom`` bis der Text mit dem ``Title``-Node abschließt. Ich habe einen Wert von ``2`` Pixeln eingestellt.
es: Ahora necesitamos la línea base del texto, es decir, el borde inferior del número para alinearlo con la textura HP de la izquierda. Para ello, aún en el recurso ``DynamicFont``, puedes modificar la propiedad ``Bottom`` en la categoría ``Extra Spacing``. Añade un poco de relleno inferior al texto. Haz clic en el nodo ``Number`` del panel Escena para volver a las propiedades del nodo y cambia ``VAlign`` por ``Bottom``. Para ajustar la línea base del texto, haz clic de nuevo en el campo font situado en la categoría ``Custom Font`` y modifica la propiedad ``Bottom`` hasta que el texto se alinee con el nodo ``Title``. Utiliza un valor de ``2`` píxeles.
fr: Nous avons maintenant besoin que la ligne du texte et que le bas du nombre s’alignent avec la texture HP sur la gauche. Pour ce faire, toujours dans la ressource ``Dynamic Font``, vous pouvez ajuster la propriété ``Bottom`` sous la catégorie ``Extra Spacing``. Cela ajoute de l'espace sous le texte. Cliquer sur le nœud ``Number`` dans l'onglet Scène pour retourner aux propriétés du nœud et changer le ``VAlign`` pour ``Bottom``. Pour ajuster la ligne du texte, cliquer sur le champ de police sous la catégorie ``Custom Font`` de nouveau et ajuster la propriété ``Bottom`` jusqu'à ce que le texte s'aligne avec le nœud ``Title``. J'ai utilisé une valeur de ``2`` pixels.
ja: ここで、テキストのベースライン、つまり数字の下端を、左側のHPテクスチャに揃える必要があります。これを行うには、 ``DynamicFont`` リソースの ``Extra Spacing`` カテゴリで ``Bottom`` プロパティを調整します。テキストに下のパディングを追加します。シーンタブの ``Number`` ノードをクリックしてノードのプロパティに戻り、 ``Valign`` を ``Bottom`` に変更します。テキストのベースラインを調整するには、もう一度 ``Custom Font`` カテゴリの下のフォントフィールドをクリックし、テキストが ``Title`` ノードに揃うまで ``Bottom`` プロパティを微調整します。今回は ``2`` ピクセルの値を使用しました。
ko: 이제 문자의 기준선이 필요합니다. 왼쪽의 HP 텍스처와 나란히 있는 Number의 아래 모서리 말이죠. 그러러면, 역시나 ``DynamicFont`` 리소스로 가서, ``Extra Spacing`` 카테고리 밑의 ``Bottom`` 속성을 조절하면 됩니다. 이 속성은 문자의 아래에 여백을 추가해줍니다. 씬 탭에서 ``Number`` 노드를 클릭하고 노드의 속성으로 돌아가세요. 그리고 ``Valign``\ 을 ``Bottom``\ 으로 바꾸세요. 문자의 기준선을 조절하려면, ``Custom Font`` 카테고리 밑의 Font 영역을 다시 클릭하세요. 그리고 문자가 ``Title`` 노드와 나란히 있을 때까지 ``Bottom`` 속성을 조절하세요. 저는 ``2`` 픽셀의 값을 사용했습니다.
uk: Тепер нам потрібно вирівняти нижній край числа з нижнім краєм текстури HP зліва. Для цього, все ще в ресурсі ``DynamicFont``, ви можете налаштувати властивість ``Bottom`` в розділі ``Extra Spacing``. Тут можна відрегулювати відступ від тексту до нижнього краю. Клацніть вузол ``Number`` на вкладці Сцена, щоб повернутися до властивостей вузла та змінити ``Valign`` на ``Bottom``. Щоб відкоригувати нижню лінію тексту, ще раз натисніть на поле шрифту в розділі ``Custom Font`` і підлаштуйте властивість ``Bottom``, так щоб текст вирівнявся з вузлом ``Title``. Я використав значення ``2``.
zh_cn: 现在, 我们需要文本的基线, 即数字的下边缘, 以与左侧的 ``HP`` 纹理对齐. 为此, 仍在 ``DynamicFont`` 资源中, 您可以在 ``Extra Spacing`` 类别下调整 ``Bottom`` 属性. 它为文本添加了一些底部填充. 点击场景选项卡中的 ``Number`` 节点, 返回到节点属性, 然后将 ``Valign`` 更改为 ``Bottom``. 要调整文本的基线, 请再次单击 ``自定义字体(Custom Font)`` 类别下的 ``字体`` 字段, 并调整 ``底部(Bottom)`` 属性, 直到文本与 ``标题(Title)`` 节点对齐. 这里使用了 ``2`` 像素的值.
zh_tw: 我們現在需要調整文字的基線（也就是數字底部的邊緣）來對齊左邊的 HP 紋理貼圖。為此，再回到 ``DynamicFont`` 資源內，調整 ``Extra Spacing`` （額外留白）分類下的 ``Bottom`` 屬性，在文字的底部加點留白。在場景分頁中點擊 ``Number`` 節點並回到節點的屬性中，修改 ``Valign`` 為 ``Bottom``。要調整文字的基線，再回到 ``Custom Font`` 分類底下，點擊字體欄位並修改 ``Bottom`` 屬性，調整至文字與 ``Title`` 節點對齊即可。我這邊使用的值是 ``2`` px。

source: With a Bottom value of 2 pixels, the Number aligns with the Title
cs: S hodnotou Bottom 2 pixely se číslo zarovná s nadpisem
de: Bei einem unteren Wert von 2 Pixeln ist die Zahl bündig mit dem Titel
es: Con un valor Bottom de 2 píxeles, el Number se alinea con el Title
fr: Avec une valeur pour Bas de 2 pixels, le Nombre s'aligne avec le Titre
ja: 下の値を2ピクセルに設定すると、 NumberはTitleに揃えて配置されます
ko: Bottom 에 2픽셀 값으로, Number는 Title과 일직선이 되었습니다
pt_br: Com um valor inferior de 2 pixels, o número alinha com o título
ru: При значении Bottom, равным 2 пикселям, Number выравнивается по Title
uk: При значенні Bottom в 2 пікселя Number вирівнюється з Title
zh_cn: 底部值为2像素, 数字与标题对齐
zh_tw: 將 Bottom 值設為 2px，Number 就跟 Title 對齊了

source: With this, we finished the hardest part of the GUI. Congratulations! Let's move on to the simpler nodes.
cs: Tím jsme dokončili nejtěžší část grafického uživatelského rozhraní. Gratulujeme! Pojďme na jednodušší uzly.
de: Damit haben wir den schwierigsten Teil der GUI abgeschlossen. Glückwunsch! Gehen wir weiter zu den einfacheren Nodes.
es: Con esto, terminamos la parte más difícil de la GUI. ¡Felicidades! Pasemos a los nodos más simples.
fr: Avec cela, nous avons terminé la partie la plus difficile de l'interface utilisateur graphique. Félicitations ! Allons-y maintenant avec des nœuds plus simples.
ja: これで、GUIの最も難しい部分が完成しました。おめでとう！それではもっと単純なノードに移りましょう。
ko: 이걸로, 우리는 GUI의 가장 어려운 부분을 마쳤습니다. 축하합니다! 더 단순한 노드로 넘어갑시다.
pt_br: Com isso, terminamos a parte mais difícil da GUI. Parabéns! Vamos seguir para os nós mais simples.
ru: С этим, мы закончили самую сложную часть. Поздравляю! Давайте перейдем к более простым узлам.
uk: Цим ми закінчили найважчу частину GUI. Вітаю! Перейдемо до більш простих вузлів.
zh_cn: 至此, 我们完成了GUI中最难的部分. 恭喜您！让我们继续讨论更简单的节点.
zh_tw: 這樣一來，我們就完成了 GUI 中最難的部分了。恭喜！接著來看看簡單的節點。

source: Add the progress bar
cs: Přidání ukazatele průběhu
de: Hinzufügen der Fortschrittsleiste
es: Añade la barra de progreso
fr: Ajouter une barre de progression
ja: プログレスバーを追加する
ko: 경과 막대 추가하기
pt_br: Adicione a barra de progressão
ru: Добавление шкалы прогресса
uk: Додавання шкали прогресса
zh_cn: 添加进度条
zh_tw: 新增計量槽

source: We need one last element to complete our life bar: the gauge itself. Godot ships with a ``TextureProgress`` node that has everything we need.
cs: Potřebujeme ještě jeden poslední prvek k dokončení našeho ukazatele života: samotné měřidlo.Pro tyto účely nabízí Godot uzel ``TextureProgress``.
de: Wir brauchen ein letztes Element, um unsere Lebensleiste zu vervollständigen: die Anzeige selbst. Godot bietet einen Node namens ``TextureProgress``, der alles hat was wir brauchen.
es: Necesitamos un último elemento para completar nuestra barra de vida: el medidor en sí mismo. Godot se entrega con un nodo ``TextureProgress`` que tiene todo lo que necesitamos.
fr: Nous avons besoin d'un dernier élément pour compléter notre barre de vie : la jauge elle-même. Godot est fourni avec un nœud ``TextureProgress`` qui comprend tout ce dont nous avons besoin.
ja: ライフ・バーを完成させるには、ゲージそのものという最後の要素が必要です。Godotには、必要なものがすべて含まれた ``TextureProgress`` ノードが付属しています。
ko: 체력 막대를 완성하기까지 하나의 요소가 남았습니다: 게이지 그 자체죠. Godot에는 지금 우리에게 필요한 ``TextureProgress`` 노드라는 것을 갖고 있습니다.
pt_br: Precisamos de um último elemento para completar nossa barra de vida: o próprio medidor. O Godot vem com um nó ``TextureProgress`` que tem tudo que precisamos.
ru: Нам нужен один последний элемент, чтобы закончить нашу шкалу жизни: собственно сам датчик. Узел ``TextureProgress`` имеет все, что нам нужно.
uk: Нам потрібен останній елемент, щоб завершити нашу шкалу здоров'я: сам показник. Godot поставляється з вузлом ``TextureProgress``, у якому є все, що нам потрібно.
zh_cn: 我们需要最后一个元素来完成我们的生命条: 量规本身.Godot附带了一个 ``TextureProgress`` 节点, 该节点具有我们所需的一切.
zh_tw: 要做好血條我們還需要最後一個元素：血槽本身。Godot 附帶的 ``TextureProgress`` 節點正是我們需要的東西。

source: Select the Bar node and add a ``TextureProgress`` inside of it. Name it ``Gauge``. In the inspector unfold the ``Textures`` section. Head to the FileSystem dock and drag and drop the ``lifebar_bg.png`` texture onto the ``Under`` slot. Do the same with the ``lifebar_fill.png`` image and drop it onto the ``Progress`` slot. Under the ``Range`` class in the inspector, change the ``Value`` property to ``50`` to see the gauge fill up.
cs: Vyberte uzel Bar a přidejte do něj ``TextureProgress``. Pojmenujte jej ``Gauge``. V inspektoru rozbalte sekci ``Textures``. Přejděte do doku FileSystem a přetáhněte texturu ``lifebar_bg.png`` do slotu ``Under``. Totéž proveďte s obrázkem ``lifebar_fill.png`` a umístěte jej do slotu ``Progress``. Pod třídou ``Range`` v inspektoru změňte vlastnost ``Value`` na ``50``, aby jste viděli naplnění měřidla.
de: Wähle die Leisten Node aus und füge ihr ein ``TextureProgress`` hinzu. Nenne es ``Gauge``. In dem Inspector öffne nun die ``Textures`` Abschnitt. Gehe nun weiter zum FileSystem-Dock und ziehe die ``Lifebar_bg.png``Textur auf dem ``Under`` slot. Mache das gleiche mit dem ``lifebar_fill.png`` Bild und ziehe es auf den ``Progress`` slot. Nun ändere in der ``Range`` class im Inspektor die ``Value`` Eigenschaft zu ``50`` um zu sehen, wie sich die Leiste füllt.
es: Selecciona el nodo Bar y añade un ```TextureProgress`` dentro de él. Nómbralo ``Gauge``. En el inspector despliega la sección ``Textures``. Dirígete al panel del Sistema de Archivos y arrastra y suelta la textura ``lifebar_bg.png`` en la ranura ``Under``. Haz lo mismo con la imagen ``lifebar_fill.png`` y suéltala en la ranura ``Progress``. En la clase ``Range`` del inspector, cambia la propiedad ``Value`` por ``50`` para ver que el indicador se llene.
fr: Sélectionnez le nœud Bar et ajoutez-y un ``TextureProgress`` à l'intérieur. Nommez-le ``Gauge``, dans l'inspecteur, déployez la section ``Textures``. Dirigez-vous vers le dock FileSystem et glissez-déposez la texture ``lifebar_bg.png`` dans l'emplacement ``Under``. Faites de même avec l'image ``lifebar_fill.png`` et déposez-le sur l'emplacement ``Progress``. Sous la classe ``Range`` dans l'inspecteur, changez la propriété ``Value`` à ``50`` pour voir la jauge se remplir.
ja: Barノードを選択し、その中に ``TextureProgress`` を追加します。 ``Gauge`` と名前を付けます。インスペクタで、 ``Textures`` セクションを展開します。ファイルシステムドックに移動し、 ``lifebar_bg.png`` テクスチャを ``Under`` スロットにドラッグ&ドロップします。 ``lifebar_fill.png`` イメージについても同じ操作を行い、 ``Progress`` スロットにドロップします。インスペクタの ``Range`` クラスで ``Value`` プロパティを ``50`` に変更してゲージがいっぱいになったことを確認します。
ko: Bar 노드를 선택하고, 안에 ``TextureProgress``\ 를 추가하세요. 이름은 ``Gauge``\ 라고 지으세요. 인스펙터(Inspector)에서 ``Textures`` 섹션을 펼치세요. 파일 시스템(FileSystem) 독으로 가서 ``lifebar_bg.png`` 텍스처를 ``Under`` 슬롯으로 드래그 앤 드롭하세요. 마찬가지로 ``lifebar_fill.png`` 이미지는 ``Progress`` 슬롯에 드롭하세요. 인스펙터(Inspector)의 ``Range`` 클래스 아래에서, ``Value`` 속성을 ``50``\ 으로 바꾸고 게이지가 차오른 모습을 확인하세요.
pt_br: Selecione o nó Bar e adicione um ``TextureProgress`` dentro dele. Nomeie-o ``Gauge``. No inspetor, abra a seção ``texturas``. Dirija-se à aba FileSystem e arraste e solte a textura ``lifebar_bg.png`` no slot ``Under``. Faça o mesmo com a imagem ``lifebar_fill.png`` e solte-a no slot ``Progress``. Sob a classe ``Range`` no inspetor, mude a propriedade ``Value`` para ``50`` para ver o medidor se encher.
ru: Выберите узел Bar и добавьте в него ``TextureProgress``. Назовите его ``Gauge``. В инспекторе разверните раздел ``Textures``. Направляйтесь в файловую систему и перетащите текстуру ``lifebar_bg.png`` в гнездо ``Under``. Сделайте то же самое с ``lifebar_fill.png`` и поместите его на слот ``Progress``. Под классом ``Range`` в инспекторе измените свойство ``Value`` на ``50``, чтобы увидеть, что датчик заполняется.
uk: Виберіть вузол Bar і додайте до нього ``TextureProgress``. Назвіть його ``Gauge``. У інспекторі розгорніть розділ ``Textures``. Перейдіть до Файлової системи і перетягніть текстуру ``lifebar_bg.png`` на ``Under``. Зробіть те ж саме з зображенням ``lifebar_fill.png`` і перетягніть його на ``Progress``. Під класом ``Range`` у інспекторі змініть властивість ``Value`` на ``50`` щоб побачити, як показник заповнюється.
zh_cn: 选择 ``Bar`` 节点, 并在其中添加 ``TextureProgress``. 命名为 ``Gauge``. 在属性检查器中展开 ``纹理(Textures)`` 部分. 转到 ``FileSystem`` 停靠面板, 然后将 ``lifebar_bg.png`` 纹理拖放到 ``Under`` 插槽中. 对 ``lifebar_fill.png`` 图像执行相同的操作, 然后将其拖放到 ``Progress`` 插槽中. 在属性检查器面板的 ``Range`` 类下, 将 ``Value`` 属性更改为 ``50``, 以查看量规是否被填满.
zh_tw: 選擇 Bar 節點，並在其中新增一個 ``TextureProgress`` ，將其命名為 ``Gauge`` （計量）。在屬性面板中展開 ``Texture`` 段落，接著到檔案系統 Dock 中將 ``lifebar_bg.png`` 紋理貼圖拖曳到 ``Under`` 槽中。同樣地將 ``lifebar_fill.png`` 圖片拖曳至 ``Progress`` 槽。在屬性面板的 ``Range`` 類別中，將 ``Value`` 屬性的值更改為 ``50`` 來填充計量槽。

source: With only five ``Control`` nodes, our first bar is ready to use.
cs: S pouhými pěti uzly ``Control`` je náš první pruh připraven k použití.
de: Mit nur fünf ``Control`` Nodes ist unsere erste Leiste bereit.
es: Con tan sólo cinco nodos ``Control``, nuestra primera barra está lista para ser utilizada.
fr: Avec seulement cinq nœuds ``Control``, notre première barre est prête à être utilisée.
ja: 5つの ``Control`` ノードだけで、最初のバーを使用する準備が整いました。
ko: 단지 다섯 개의 ``Control`` 노드만으로, 첫 번째 막대를 사용할 수 있게 되었습니다.
pt_br: Com apenas cinco nós ``Control``, nossa primeira barra está pronta para uso.
ru: С только пятью узлами ' ' Control ' ', наша первая шкала готова к использованию.
uk: Маючи лише п'ять вузлів ``Control``, наша перша шкала готова до використання.
zh_cn: 只有五个 ``Control`` 节点, 我们的第一个条可以使用了.
zh_tw: 只用了五個 ``Control`` 節點，我們就準備好了第一個計量槽了。

source: That's it, our life bar is ready. This last part was quick, wasn't it? That's thanks to our robust container setup.
cs: To je ono, náš pruh pro zobrazení života je připraven.Ta poslední část byla rychlá, že?To vše díky naší robustní sestavě kontejneru.
de: Das war es, unsere Lebensleiste ist bereit. Das ging schnell, oder? Und nur dank unserem robustem Container Setup.
es: Eso es, nuestra barra de vida está lista. Esta última parte fue rápida, ¿no? Esto es gracias a nuestra robusta configuración de container.
fr: Nous y voilà, notre barre de vie est prête. Cette dernière partie fut rapide, n'est-ce pas ? C'est grâce à la robustesse de nos conteneurs.
ja: これで、ライフバーの準備は整いました。 この最後の部分は速かったですよね。 これは、厳密にコンテナ設定をしたおかげです。
ko: 됐습니다. 체력 막대는 준비됬습니다. 마지막 부분은 빨리 끝났네요. 그렇지 않나요? 강력한 컨테이너 설정 덕분입니다.
pt_br: É isso, nossa barra de vida está pronta. Esta última parte foi rápida, não foi? Isso graças à nossa configuração robusta de contêineres.
ru: Вот и все, наша шкала здоровья готова. Последняя часть была быстрой, не так ли? Это благодаря нашей хорошей установке контейнера.
uk: Наша шкала здоров'я готова. Ця остання частина була швидкою, чи не так? Це завдяки нашій надійній установці контейнерів.
zh_cn: 就是这样, 我们的生命条已准备就绪. 最后一部分很快, 不是吗？这要归功于我们强大的容器设置.
zh_tw: 就這樣，我們已經準備好血槽了。最後一個部分一下就完成了對吧！這都要歸功於我們精心設計的 Container。

source: Design the bomb and emerald counters
cs: Návrh počítadel pro bomby a smaragdy
de: Das Design des Bomben- und Smaragdzählers
es: Diseña los contadores de bombas y esmeraldas
fr: Créer les compteurs de bombes et d'émeraudes
ja: 爆弾とエメラルドのカウンターをデザインする
ko: 폭탄과 에메랄드 카운터 설계하기
uk: Розробка лічильників бомб та смарагдів
zh_cn: 设计炸弹和翡翠计数器
zh_tw: 設計炸彈與寶石計數器

source: The bomb and emerald counters are like the bar's ``Count`` node. So we'll duplicate it and use it as a template.
cs: Počítadla bomb a smaragdů se podobají uzlu ``Count`` (podřízený uzlu ``Bar`` ) . Duplikujeme jej tedy a použijeme dále jako šablonu.
de: Der Bomben- und der Smaragdzähler sind wie die ``Count`` Node. Also werden wir diese duplizieren und sie als Vorlage nutzen.
es: Los contadores de bombas y esmeraldas son como el nodo ``Count`` de la barra. Así que lo duplicaremos y lo usaremos como plantilla.
fr: Les compteurs de bombes et d'émeraudes sont comme le nœud ``Count`` de la barre. Nous allons donc le dupliquer et l'utiliser comme modèle.
ja: 爆弾とエメラルドのカウンターは、バーの ``Count`` ノードのようなものです。なので、これを複製してテンプレートとして使用します。
ko: 폭탄과 에메랄드 카운터는 Bar의 ``Count`` 노드와 비슷합니다. 따라서 Count 노드를 복제해서 템플릿으로 사용할 것입니다.
uk: Лічильники бомб та смарагдів схожі на вузол шкали ``Count``. Тож ми продублюємо його і використаємо як шаблон.
zh_cn: 炸弹和翡翠计数器就像条形图的 ``Count`` 节点一样. 因此, 我们将其复制并用作模板.
zh_tw: 炸彈與寶石的計數器就類似計量槽的 ``Count`` 節點，所以我們就直接複製過來當作樣板使用。

source: Under the ``Bar`` node, select ``Count`` and press :kbd:`Ctrl + D` to duplicate it. Drag and drop the new node under the ``Counters`` ``HBoxContainer`` at the bottom of the scene tree. You should see it resize automatically. Don't worry about this for now, we'll fix the size soon.
cs: Pod uzlem ``Bar`` vyberte ``Count`` a stiskněte :kbd:`Ctrl + D`, abyste jej duplikovali. Přetáhněte nový uzel pod ``Conters`` ``HBoxContainer`` ve spodní části stromu scény. Měli by jste vidět, jak automaticky změní velikost. Zatím si s tím nedělejte starosti, velikost brzy opravíme.
es: En el nodo ``Bar``, selecciona ``Count`` y pulsa :kbd:`Ctrl + D` para duplicarlo. Arrastra y suelta el nuevo nodo dentro de``Counters`` ``HBoxContainer`` en la parte inferior del árbol de la escenas. Deberías poder ver cómo se redimensiona automáticamente. No te preocupes por esto por ahora, arreglaremos el tamaño pronto.
fr: Sous le nœud ``Bar``, sélectionnez ``Count`` et appuyez sur :kbd:`Ctrl + D` pour le dupliquer. Faites glisser et déposez le nouveau nœud sous le ``HBoxContainer`` ``Counters`` au bas de l'arbre de scène. Vous devriez le voir se redimensionner automatiquement. Ne vous inquiétez pas pour l'instant, nous allons corriger la taille bientôt.
ja: ``Bar`` ノードの ``Count`` を選択し、\ :kbd:`Ctrl + D` を押して複製します。シーンツリーの一番下にある ``Counters`` \ ``HBoxContainer`` の下に、新しいノードをドラッグ&ドロップします。自動的にサイズが変更されます。今のところこれについて心配しないでください。サイズはすぐに修正します。
ko: ``Bar`` 노드 아래에 있는 ``Count``\ 를 선택한 다음, :kbd:`Ctrl + D`를 눌러서 복제하세요. 씬 트리의 가장 아래에 있는 ``HBoxContainer``, 즉 ``Counters``\ 의 자손으로 복제한 노드를 드래그 앤 드롭하세요. 노드가 자동으로 크기가 조절되는 것을 볼 수 있습니다. 지금은 크게 걱정하지 마세요. 나중에 크기를 고칠 것입니다.
uk: У вузлі ``Bar`` виберіть ``Count`` і натисніть :kbd:`Ctrl + D`, щоб його дублювати. Перетягніть новий вузол у ``Counters`` ``HBoxContainer`` в нижню частину дерева сцени. Ви можете побачити, як його розмір автоматично зміниться. Не хвилюйтеся з цього приводу зараз, ми скоро виправимо розмір.
zh_cn: 在 ``Bar`` 节点下, 选择 ``Count`` , 然后按 :kbd:`Ctrl+D` 复制它. 将新节点拖放到场景树中名为 ``Counters`` 的 ``HBoxContainer`` 节点下. 您应该看到它会自动调整大小, 暂时不用担心, 我们会尽快修复它.
zh_tw: 選擇 ``Bar`` 節點底下的 ``Count`` 節點，並按鍵盤 :kbd:`Ctrl + D` 來複製。拖曳新的節點到節點樹底下的 ``Counters`` ``HBoxCountainer`` 下。接著你會發現複製過來的節點被自動縮放了，但先不用擔心，我們等等會修。

source: Rename the ``Count2`` node to ``Counter``. Unlike the bars, we want the number to be on the left, and an icon to sit on the right. The setup is the same: we need a background (a ``NinePatchRect``), the title, and the number nodes. The ``Title`` node is a ``TextureRect``, so it's what we need to display the icon. In the scene tree, select the ``Title`` node, and rename it to ``Icon``.
cs: Přejmenujte uzel ``Count2`` na ``Counter``. Na rozdíl od pruhů chceme, aby číslo bylo nalevo a ikona seděla napravo. Nastavení je stejné: potřebujeme uzly pro pozadí (``NinePatchRect``), název a číslo. Uzel ``Title`` je ``TextureRect``, takže přesně to co k zobrazení ikony potřebujeme. Ve stromu scén vyberte uzel ``Title`` a přejmenujte jej na ``Icon``.
de: Bennene die ``Count2`` Node zu ``Counter`` um. Nicht so wie bei den Leisten, wollen wir die Number auf der linken Seite und ein Icon das auf rechten Seite sein soll. Das Setup ist das gleiche: Wir brauchen einen Hintergrund (ein ``NinePatchRect``), den Titel und die Number Nodes. Die ``Title`` Node ist ein ``TextureRect``, es ist also das, was wir brauchen damit es das Icon anzeigt. Wähle in dem Szenenbaum ``Title`` aus und bennene es zu ``Icon`` um.
es: Cambia el nombre del nodo ``Count2`` por ``Counter``. A diferencia de las barras, queremos que el número esté a la izquierda, y que un icono se sitúe a la derecha. La configuración es la misma: necesitaremos un fondo (un ``NinePatchRect``), el título y los nodos para números. El nodo ``Title`` es un ``TextureRect``, así que es lo que necesitamos para mostrar el icono. En el árbol de la escena, selecciona el nodo ``Title``, y renómbralo a ``Icon``.
fr: Renommer le nœud ``Count2`` pour ``Counter``. Contrairement aux barres, nous voulons que le nombre soit sur la gauche, et une icône à la droite. La mise en place est la même : nous avons besoin d'un arrière-plan, un ``NinePatchFrame``, un titre, et les nœuds des nombres. Le nœud ``Title`` est un ``TextureRect``, alors c'est ce dont nous avons besoin pour afficher l'icône. Dans l'arbre des scènes, sélectionner le nœud ``Title``, et renommez-le pour ``Icon``.
ja: ``Count2`` ノードの名前を ``Counter`` に変更します。バーとは異なり、番号を左側に、アイコンを右側に配置します。設定には同様の、背景(``NinePatchRect``)、タイトル、および数字ノードが必要です。 ``Title`` ノードは ``TextureRect`` なので、アイコンを表示する必要があります。シーンツリーで、 ``Title`` ノードを選択し、名前を ``Icon`` に変更します。
ko: ``Count2`` 노드의 이름을 ``Counter``\ 로 바꾸세요. Bars와 달리, 왼쪽에 숫자가 있고 오른쪽에 아이콘이 있어야 합니다. 설정은 전과 같습니다: Background가 필요하고 (``NinePatchRect``), Title, Number 노드가 필요합니다. ``Title`` 노드는 아이콘을 표시해야 하므로 ``TextureRect``\ 가 됩니다. 씬 트리에서 ``Title`` 노드를 선택하세요. 그리고 이름을 ``Icon``\ 으로 바꾸세요.
uk: Перейменуйте вузол ``Count2`` у ``Counter``. На відміну від шкал, ми хочемо, щоб число було зліва, а значок - справа. Налаштування однакове: нам потрібні вузли фону (``NinePatchRect``), заголовка та числа. Вузол ``Title`` є ``TextureRect``, так що це те , що нам потрібно , щоб відобразити значок. У дереві сцен виберіть вузол ``Title`` та перейменуйте його на ``Icon``.
zh_cn: 将 ``Count2`` 节点重命名为 ``Counter`` . 与条形图不同, 我们希望数字在左边, 图标在右边. 设置是相同的: 我们需要一个背景( ``NinePatchRect`` ), 标题, 和数字节点. ``Title`` 节点是一个 ``TextureRect``, 这就是我们需要用来显示图标. 在场景树中, 选择 ``Title`` 节点, 并将其重命名为 ``Icon``.
zh_tw: 將 ``Count2`` 節點重命名為 ``Counter`` 。與計量槽不同的是，我們希望數字靠左顯示，然後將圖示顯示在左邊。用一樣的設定方法：給一個背景（ ``NinePatchRect`` ）、一個標題、以及一個顯示數字的節點。 ``Title`` 是一個 ``TextureRect`` 節點，是用來顯示圖示的。在場景樹中選擇 ``Title`` 節點並將其重命名為 ``Icon`` 。

source: Here's how your node tree should look so far
cs: Takhle nějak by měl vypadat váš současný strom uzlů
de: So sollten deine Nodes bis jetzt aufgebaut sein
es: Así es como debería verse tu árbol de nodos por ahora
fr: Voici à quoi devrait ressembler votre arbre de nœuds jusqu'à présent
ja: 今のノードツリーはこのようになっているはずです
ko: 이것이 현재까지 작업한 노드 트리의 모습입니다
pt_br: Veja como sua árvore de nó deve parecer até agora
ru: Вот так древо узлов должно выглядеть на данный момент
uk: Ось як має виглядати ваше дерево вузлів на даний момент
zh_cn: 到目前为止, 这是你的节点树的外观
zh_tw: 到目前為止你的場景樹看起來應該長這樣
