Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_game_user_interface.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Drag-and-drop the ``GUI.tscn`` scene right below the ``bg`` node and above the ``Characters``. The GUI will scale to fit the entire viewport. Head to the Layout menu and select the ``Center Top`` option so it anchors to the top edge of the game window. Then resize the GUI to make it as small as possible vertically. Now you can see how the interface looks in the context of the game.
cs: Přetáhněte scénu ``GUI.tscn`` přímo pod uzel ``bg`` a nad uzel ``Characters``. Grafické uživatelské rozhraní se zmenší tak, aby se vešlo na celou plochu pohledu. Přejděte do nabídky Rozložení a vyberte možnost ``Center Top``, aby se ukotvila k hornímu okraji herního okna. Poté změňte velikost grafického uživatelského rozhraní tak, aby bylo vertikálně co nejmenší. Nyní se můžete podívat, jak rozhraní vypadá v kontextu hry.
de: Ziehen Sie die Szene ``GUI.tscn`` direkt unter den Knoten ``bg`` und über die ``Characters``. Die GUI wird so skaliert, dass sie in das gesamte Ansichtsfenster passt. Gehen Sie zum Layout-Menü und wählen Sie die Option ``Center Top``, damit es am oberen Rand des Spielfensters verankert wird. Ändern Sie dann die Größe der Benutzeroberfläche, um sie vertikal so klein wie möglich zu gestalten. Jetzt können Sie sehen, wie die Benutzeroberfläche im Kontext des Spiels aussieht.
es: Arrastra y suelta la escena ``GUI.tscn`` justo debajo del nodo ``bg`` y encima de ``Characters``. La GUI se escalará para adaptarse a toda la vista. Ve al menú Disposición y selecciona la opción ``Center Top`` para que se anclen en el borde superior de la ventana del juego. Luego cambia el tamaño de la GUI para hacerla lo más pequeña posible verticalmente. Ahora puedes ver cómo se ve la interfaz en el contexto del juego.
fr: Glissez-déposez la scène ``GUI.tscn`` juste en dessous du nœud ``bg`` et au-dessus de ``Characters``. L'interface graphique sera mise à l'échelle pour s'adapter à l'ensemble de la fenêtre d'affichage. Allez dans le menu Layout et sélectionnez l'option ``Center Top`` pour qu'elle s'ancre au bord supérieur de la fenêtre de jeu. Ensuite, redimensionnez l'interface graphique pour la rendre aussi petite que possible verticalement. Maintenant vous pouvez voir à quoi ressemble l'interface dans le contexte du jeu.
ja: ``GUI.tscn`` シーンを ``bg`` ノードのすぐ下、 ``Characters`` の上にドラッグ＆ドロップします。GUIはビューポート全体に合うように拡大縮小されます。レイアウトメニューに進み、 ``中央上`` オプションを選択して、ゲームウィンドウの上端に固定します。 次にGUIを、垂直方向にできるだけ小さくなるようサイズ変更します。これで、ゲーム中にインターフェイスがどのように見えるかを確認できます。
ko: ``bg`` 노드 아래와 ``Characters`` 노드 위에 ``GUI.tscn`` 씬을 드래그 앤 드롭하세요. GUI는 전체 뷰포트에 맞게 크기가 조절될 것입니다. 레이아웃(Layout) 메뉴로 가서 ``위쪽 중앙(Center Top)`` 설정을 선택하세요. GUI는 게임 창의 위쪽 모서리에 앵커될 것입니다. 그런 다음 GUI를 수직으로 가능한 작게 크기를 조절하세요. 이제 게임의 맥락에서 인터페이스가 어떻게 보이는 지 알 수 있습니다.
pt_br: Arraste e solte a cena ``GUI.tscn`` logo abaixo do nó ``bg`` e acima dos ``Characters``. A GUI será dimensionada para se ajustar à viewport inteira. Dirija-se ao menu Layout e selecione a opção ``Center Top`` para ancorar na borda superior da janela do jogo. Em seguida, redimensione a GUI para torná-la o menor possível na vertical. Agora você pode ver como a interface se parece no contexto do jogo.
ru: Перетащите сцену ``GUI.tscn`` прямо под узел ``bg`` и выше ``Characters``. GUI будет масштабироваться по размеру видового экрана. Направляйтесь в меню "Макет" и выберите опцию ``Center Top``, чтобы она привязалась к верхнему краю окна. Теперь измените размер GUI, чтобы сделать его как можно более маленьким по вертикали. Теперь вы можете увидеть, как интерфейс выглядит в самой игре.
uk: Перетягніть сцену ``GUI.tscn`` прямо під вузол ``bg``, але вище ``Characters``. Графічний інтерфейс буде масштабуватись, щоб відповідати всій області перегляду. Перейдіть до меню Макет і виберіть варіант ``За центром згори``, щоб він прив'язався до верхнього краю вікна гри. Потім змініть розмір GUI, щоб зробити його якомога меншим по вертикалі. Тепер ви можете побачити, як виглядає інтерфейс у контексті гри.
zh_cn: 将 ``GUI.tscn`` 场景拖放到 ``bg`` 节点下方和 ``Character`` 上方.GUI将缩放以适合整个视图. 前往 ``Layout`` 菜单并选择 ``Center Top`` 选项, 使其锚定到游戏窗口的顶部边缘. 然后调整GUI的大小, 使其在垂直方向上尽可能小. 现在, 你可以看到界面在游戏中的外观.
zh_tw: 將 ``GUI.tscn`` 場景拖曳到節點樹中，放在 ``bg`` 場景底下， ``Characters`` 場景上面。GUI 會縮放並貼合整個檢視區。打開畫面配置選單並選擇 ``中上`` 來將節點錨定到遊戲視窗的上邊緣。接著縮放 GUI 來儘可能縮小縱軸的尺寸。現在你可以看到界面在遊戲裡長得樣子了。

source: Congratulations for getting to the end of this long tutorial. You can find the final project here: :download:`ui_gui_design.zip <files/ui_gui_design.zip>`.
cs: Gratulujeme, že jste se dostali až na konec tohoto dlouhého návodu. Závěrečný projekt najdete zde: :download:`ui_gui_design.zip <files/ui_gui_design.zip>`.
de: Glückwunsch dafür, dass Sie zum Ende dieses langen Tutorials gekommen sind. Du kannst das finale Projekt hier finden: :download:`ui_gui_design.zip <files/ui_gui_design.zip>`.
es: Enhorabuena por llegar al final de este largo tutorial. Puedes encontrar el proyecto final aquí :download:`ui_gui_design.zip <files/ui_gui_design.zip>`.
fr: Félicitation, vous avez atteint la fin de ce long tutoriel. Vous pouvez retrouver le projet final ici : :download:`ui_gui_design.zip <files/ui_gui_design.zip>`.
ja: おめでとうございます。この長いチュートリアルも終わりに近づきました。こちらが最終プロジェクトです。\ :download:`ui_gui_design.zip <files/ui_gui_design.zip>`\ .
ko: 이 긴 튜토리얼을 마친 것을 축하합니다. 여기서 최종 프로젝트를 찾아가세요: :download:`ui_gui_design.zip <files/ui_gui_design.zip>`.
uk: Вітаємо з завершенням цього довгого уроку. Ви можете знайти готовий проєкт тут:`ui_gui_design.zip <files/ui_gui_design.zip>`.
zh_cn: 祝贺您完成了这篇冗长的教程. 最终项目您可以在 :download:`ui_gui_design.zip <files/ui_gui_design.zip>` 找到.
zh_tw: 恭喜你完整成了這篇長長的教學。專案的最終結果可以在這裡找到： :download:`ui_gui_design.zip <files/ui_gui_design.zip>` 。

source: **A final note about Responsive Design**. If you resize the GUI, you'll see the nodes move, but the textures and text won't scale. The GUI also has a minimum size, based on the textures inside of it. In games, we don't need the interface to be as flexible as that of a website. You almost never want to support both landscape and portrait screen orientations. It's one or the other. In landscape orientation, the most common ratios range from 4:3 to 16:9. They are close to one another. That's why it's enough for the GUI elements to only move horizontally when we change the window size.
cs: **Závěrečná poznámka o responzivním designu**. Pokud změníte velikost grafického uživatelského rozhraní, uzly se posunou, ale textury a text nezmění svoji velikost. Grafické uživatelské rozhraní má také minimální velikost, která vychází z velikosti použitých textur. Ve hrách nepotřebujeme, aby rozhraní bylo tak flexibilní jako rozhraní webových stránek. Téměř nikdy nechcete podporovat orientaci obrazovky na šířku i na výšku. Je to buď jedno, nebo druhé. Při orientaci na šířku se nejčastěji používají poměry od 4:3 do 16:9. Jsou si navzájem dost podobné. Proto stačí, aby se prvky grafického uživatelského rozhraní při změně velikosti okna pohybovaly pouze horizontálně.
es: **Una nota final sobre el Diseño Responsivo**. Si cambias el tamaño de la GUI, verás que los nodos se mueven, pero las texturas y el texto no tienen escala. El GUI también tiene un tamaño mínimo, basado en las texturas dentro de él. En los juegos, no necesitamos que la interfaz sea tan flexible como la de un sitio web. Por lo general, casi nunca es necesario admitir orientaciones de pantalla apaisadas y verticales. Es una cosa o la otra. En orientación horizontal, las relaciones más comunes van de 4:3 a 16:9. Están cerca el uno del otro. Por eso es suficiente que los elementos GUI sólo se muevan horizontalmente cuando cambiamos el tamaño de la ventana.
fr: **Une note finale sur le Responsive Design**. Si vous redimensionnez l'interface graphique, vous verrez les nœuds se déplacer, mais les textures et le texte ne se mettent pas à l'échelle. L'interface graphique a également une taille minimale, basée sur les textures qu'elle contient. Dans les jeux, nous n'avons pas besoin d'une interface aussi flexible que celle d'un site web. Vous ne voudriez presque jamais utiliser à la fois les modes paysage et portrait. C'est l'un ou l'autre. En mode paysage, les rapports les plus courants vont de 4:3 à 16:9. Ils sont proches l'un de l'autre. C'est pourquoi il suffit que les éléments de l'interface graphique ne se déplacent horizontalement que lorsque nous changeons la taille de la fenêtre.
ja: **レスポンシブデザインに関する最後の注意事項**\ 。GUI のサイズを変更すると、ノードが移動しますが、テクスチャとテキストはスケーリングしません。そしてGUIは、内部のテクスチャに基づく最小サイズも持ちます。ゲームでは、Webサイトほど柔軟なインターフェイスは必要ありません。横向きと縦向きの両方をサポートすることは、ほとんどないはずです。どちらか一方になるでしょう。横向きでは、最も一般的な比率の範囲は 4:3～16:9 です。これらは互いに近いため、GUI要素はウィンドウサイズを変更する際に水平方向に移動するだけで十分です。
ko: **반응형 디자인의 마지막 주석**. GUI의 크기를 조정하면 노드가 움직이는 것을 볼 수 있지만, 텍스처와 문자는 크기가 조절되지 않습니다. 또한 GUI는 들어있는 텍스처에 따라 최소 크기가 있습니다. 게임이 웹페이지처럼 유연한 인터페이스를 가질 필요는 없습니다. 보통 가로 화면과 세로 화면 모두를 지원하고 싶지는 않을 것입니다. 둘 중 하나만 지원하겠죠. 가로 화면이라면 가장 일반적인 비율은 4:3에서 16:9 사이입니다. 이들은 서로 비슷합니다. 이것이 창 크기를 바꿀 때 GUI 요소가 수평으로만 이동하는 것이 충분한 이유입니다.
uk: **Заключна примітка про чутливий дизайн**. Якщо змінити розмір графічного інтерфейсу, ви побачите, що вузли рухаються, але текстури та текст не будуть масштабуватися. GUI також має мінімальний розмір, виходячи з текстур всередині нього. В іграх нам не потрібно, щоб інтерфейс був настільки гнучким, як веб-сайт. Ви майже ніколи не будете підтримувати орієнтацію екрану як ландшафтну, так і портретну. Це те й інше. У ландшафтній орієнтації найпоширеніші співвідношення коливаються від 4: 3 до 16: 9. Вони близькі один одному. Ось чому для елементів графічного інтерфейсу досить переміщатися горизонтально лише тоді, коли ми змінюємо розмір вікна.
zh_cn: **关于响应式设计的最后说明** . 如果调整GUI的大小, 您将看到节点移动, 但是纹理和文本将无法缩放.GUI的最小尺寸取决于其内部的纹理大小. 在游戏中, 我们不需要界面像网站一样灵活. 您几乎永远都不想同时支持横向和纵向屏幕方向. 要么横向, 要么纵向. 在横向模式中, 最常见的比例范围是 4:3到16:9. 它们很接近. 这就是为什么当我们更改窗口大小时,GUI元素仅水平移动就足够了.
zh_tw: **關於回應式設計的最後一點提醒** 。縮放 GUI 時會發現節點跟著移動，但貼圖與文字不會縮放。同時 GUI 也會依據裡面的貼圖而有最小尺寸。在遊戲中，界面不需要像網頁一樣彈性。製作遊戲的時候幾乎不會同時支援縱向與橫向兩種螢幕方向，只會支援一種。橫向畫面時最常見的長寬比介於 4:3 至 16:9 之間，每種長寬比都很接近。所以我們在更改視窗大小的時候只需要水平移動 GUI 元素就好了。

source: Let's change the ``Number``'s align properties to move it to the left and center of the ``Background``. Select the ``Number`` node, change its ``Align`` property to left and the ``Valign`` property to centre. Then resize its left edge a bit to add some padding between the left edge of the ``Background`` and the text.
es: Cambiemos las propiedades de alineación del nodo ``Number`` para moverlo a la izquierda y al centro del ``Background``. Selecciona el nodo ``Number``, cambia su propiedad ``Align`` a left y la propiedad ``Valign`` a centre. Luego redimensiona un poco su borde izquierdo para añadir un poco de relleno entre el borde izquierdo del ``Background`` y el texto.

source: The Number node aligned to the left and centre
de: Die links zentriert ausgerichtete Number Node
es: El nodo Number alineado a la izquierda y al centro
pt_br: O nó Number alinhado à esquerda e ao centro
ru: Узел Number выравнивается по центру слева

source: You can watch this tutorial as a `video on Youtube <https://www.youtube.com/watch?v=y1E_y9AIqow>`_.
pt_br: Você pode assistir a este tutorial em um `vídeo no Youtube <https://www.youtube.com/watch?v=y1E_y9AIqow>`_.
ru: Вы можете посмотреть это руководство как `видео на Youtube <https://www.youtube.com/watch?v=y1E_y9AIqow>`_.

source: As they have a container as their direct parent, we cannot move them freely: the ``Count`` node will always reset their anchors, their size and position. Try to move and resize the nodes in the viewport. Then, select any of the three textures and press Ctrl Up or Ctrl Down to reorder them in the Scene dock. They'll snap back to their previous size and position.
pt_br: Como eles têm um contêiner como seu pai direto, nós não podemos movê-los livremente: o nó ``Count`` irá sempre resetar suas âncoras, seu tamanho e posição. Tente mover e redimensionar os nós na viewport. Em seguida, selecione uma das três texturas e pressione Ctrl Up ou Ctrl Down para reordená-las no dock de cena. Eles vão voltar ao seu tamanho e posição anteriores.

source: We now need the text's baseline, the number's lower edge, to align with the HP texture on the left. To do so, still in the ``DynamicFont`` resource, you can tweak the ``Bottom`` property under the ``Extra Spacing`` category. It adds some bottom padding to the text. Click the ``Number`` node in the Scene tab to go back to the node's properties and change the ``VAlign`` to ``Bottom``. To adjust the text's baseline, click on the font field under the ``Custom Font`` category again and tweak the ``Bottom`` property until the text aligns with the ``Title`` node. I used a value of ``2`` pixels.
pt_br: Agora precisamos da linha de base do texto, a borda inferior do número, para alinhar com a textura da HP à esquerda. Para fazer isso, ainda no recurso ``DynamicFont``, você pode ajustar a propriedade ``Bottom`` sob a categoria ``Extra Spacing``. Adicione um preenchimento inferior ao texto. Clique no nó ``Number`` na aba Scene para retornar às propriedades do nó e mudar o ``VAlign`` para ``Bottom``. Para ajustar a linha de base do texto, clique no campo da fonte sob a categoria ``Custom Font`` novamente e ajuste a propriedade ``Bottom`` até que o texto se alinhe com o nó ``Title``. Eu usei um valor de ``2`` pixels.

source: Under the ``Bar`` node, select ``Count`` and press Ctrl D to duplicate it. Drag and drop the new node under the ``Counters`` ``HBoxContainer`` at the bottom of the scene tree. You should see it resize automatically. Don't worry about this for now, we'll fix the size soon.
pt_br: Sob o nó ``Bar``, selecione ``Count`` e pressione Ctrl D para duplicá-lo. Arraste e solte o novo nó sob o ``Counters`` ``HBoxContainer`` na parte inferior da árvore de cena. Você deve vê-lo redimensionar automaticamente. Não se preocupe com isso por enquanto, vamos corrigir o tamanho em breve.
ru: В узле ``Bar`` выберите ``Count`` и нажмите ``Ctrl+D``, чтобы дублировать его. Перетащите новый узел под ``Counters`` в нижнюю часть дерева сцены. Вы должны увидеть как он изменит размер автоматически. Не беспокойтесь об этом сейчас, мы исправим его в ближайшее время.

source: Let's change the ``Number``'s align properties to move it to the left and center of the ``Background``. Select the ``Number`` node, change its ``Align`` property to left and the ``VAlign`` property to centre. Then resize its left edge a little bit to add some padding between the left edge of the ``Background`` and the text.
pt_br: Vamos alterar as propriedades de alinhamento do ``Number`` para movê-lo para a esquerda e para o centro do ``Background``. Selecione o nó ``Number``, altere sua propriedade ``Align`` para a esquerda e a propriedade ``VAlign`` para o centro. Em seguida, redimensione um pouco a borda esquerda para adicionar um preenchimento entre a borda esquerda do ``Background`` e o texto.

source: Go to ``Scene -> New Inherited Scene`` to create a new type of ``Bar``. Select the Bar scene and open it. You should see a new [unsaved] tab, that's like your ``Bar``, but with all nodes except the root in grey. Press ``Meta+S`` to save the new inherited scene and name it ``LifeBar``.
pt_br: Vá para ``Scene -> New Inherited Scene`` para criar um novo tipo de ``Bar``. Selecione a cena Bar e abra-a. Você deve ver uma nova aba [não-salva], que é como a sua ``Bar``, mas com todos os nós exceto a raiz em cinza. Pressione ``Meta + S`` para salvar a nova cena herdada e nomeie-a como ``LifeBar``.
ru: Перейдите к ``Сцена -> Новая Унаследованная сцена`, чтобы создать новый тип ``Bar``. Выберите сцену Bar и откройте ее. Вы должны увидеть новую [несохраненную] вкладку, которая, такая же как ваш ``Bar``, но со всеми узлами, кроме корневой сцены в сером цвете. Нажмите ``Ctrl+S`` для сохранения Новой Унаследованной сцены и назовите ее ``LifeBar``.

source: When you duplicate a node from the Scene tree, with ``Meta+D``, it shares its resources with the original node. You need to use ``Make Sub-Resources Unique`` before you can tweak the resources without affecting the source node.
pt_br: Quando você duplica um nó da árvore Scene, com ``Meta+D``, ele compartilha seus recursos com o nó original. Você precisa usar o ``Make Sub-Resources Unique`` antes de poder ajustar os recursos sem afetar o nó de origem.
ru: При дублировании узла из дерева сцены с помощью ``Ctrl+D``, он делит свои ресурсы с исходным узлом. Вы должны использовать ``Сделать вложенные ресурсы уникальными`` перед тем, как вы сможете настроить ресурсы, не влияя на исходный узел.

source: **A final note about Responsive Design**. If you resize the GUI, you'll see the nodes move, but the textures and text won't scale. The GUI also has a minimum size, based on the textures inside of it. In games, we don’t need the interface to be as flexible as that of a website. You almost never want to support both landscape and portrait screen orientations. It’s one or the other. In landscape orientation, the most common ratios range from 4:3 to 16:9. They are close to one another. That's why it’s enough for the GUI elements to only move horizontally when we change the window size.
pt_br: **Uma nota final sobre o Design Responsivo**. Se você redimensionar a GUI, verá os nós se moverem, mas as texturas e o texto não serão dimensionadas. A GUI também tem um tamanho mínimo, baseado nas texturas dentro dela. Nos jogos, não precisamos que a interface seja tão flexível quanto a de um website. Você quase nunca precisa suportar ambas as orientações de paisagem e retrato. É uma ou outra. Na orientação de paisagem, as proporções mais comuns variam de 4:3 a 16:9. Elas estão próximas uma da outra. É por isso que é suficiente que os elementos da GUI apenas se movam horizontalmente quando alteramos o tamanho da janela.
