Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_introduction_to_the_ui_system.po
Languages: cs, de, es, fr, it, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: There are two workflows to build responsive UIs
cs: K dispozici jsou dva pracovní postupy pro vytváření responzivních uživatelskéch rozhraní
de: Es gibt zwei Arbeitsroutinen um zugängliche Benutzeroberflächen zu entwerfen
es: Existen dos flujos de trabajo para crear UIs responsivas
fr: Il existe deux méthodes de travail pour créer des interfaces utilisateur réactives
it: Esistono due flussi di lavoro per la creazione di UI reattive
ja: 応答性の高いUIを構築するための2つのワークフローがあります
ko: 반응형 UI를 만들기 위한 두 가지 워크플로우가 있습니다
pt_br: Existem dois fluxos de trabalho para criar interfaces de usuário responsivas
ru: Есть два способа создания отзывчивых интерфейсов
uk: Існує два способи створення інтерфейсів
zh_cn: 有两个工作流程可以构建响应式UI
zh_tw: 製作回應式 UI 的兩個工作流程

source: There are two workflows to build scalable and flexible interfaces in Godot:
cs: Existují dva postupy jak vybudovat škálovatelné a flexibilní rozhraní v Godotu:
de: Es gibt zwei Arbeitsroutinen um skalierbare und flexible Benutzeroberflächen mit Godot zu erstellen:
es: Hay dos flujos de trabajo para construir interfaces escalables y flexibles en Godot:
fr: Il existe deux méthodes de travail pour construire des interfaces évolutives et flexibles dans Godot :
it: Esistono due flussi di lavoro per la creazione di interfacce flessibili e scalabili in Godot:
ja: Godotには、スケーラブルで柔軟なインターフェイスを構築するための 2 つのワークフローがあります:
ko: Godot에서 확장성 있고 유연한 인터페이스를 만들기 위한 두 가지 워크플로우가 있습니다:
pt_br: Existem dois fluxos de trabalho para criar interfaces escalonáveis e flexíveis no Godot:
ru: Есть два способа создания масштабируемых и гибких интерфейсов в Godot:
uk: В Godot є два способи створення масштабованих і гнучких інтерфейсів:
zh_cn: 在Godot中, 有两个工作流程可构建可伸缩和灵活的界面:
zh_tw: 在 Godot 中有兩個工作流程可用來建立可擴充與彈性的界面：

source: **Place UI elements precisely with anchors:** Use the **Layout** menu to place and resize a UI element relative to its parent.
de: **Platziere UI Elemente präzise mit Ankern:** Benutzen Sie das **Layout Menü** um ein Element relativ zu seinem Elternelement zu platzieren und zu skalieren.
ja: **アンカーを使用してUI要素を正確に配置する:** **レイアウト**\ メニューを使用すれば、UI要素をその親に対して相対的に配置とサイズ変更できます。
uk: **Розміщення елементів за допомогою прив'язок:** Використовуйте меню **Макет**, щоб розмістити та змінити розмір елемента інтерфейсу відносно предка.
zh_cn: **用锚点精确地放置UI元素:** 使用 **Layout** 菜单来放置和调整UI元素相对于其父元素的大小.

source: **Arrange control nodes automatically with containers:** Use container nodes to automatically scale and place UI elements.
de: **Control Nodes automatisch mit Containern anordnen:** Benutzen Sie Container Nodes um UI-Elemente automatisch zu skalieren und zu platzieren.
es: **Arreglar nodos de control automaticamente con contenedores:** Usa nodos Container para escalar y posicionar elements UI.
ja: **コンテナを使ってコントロールノードを自動的に配置する:** コンテナノードを使えば、UI要素を自動的に拡大縮小して配置できます。
uk: **Автоматичне впорядкування вузлів контролю з допомогою контейнерів:** Використовуйте вузли контейнерів для автоматичного масштабування та розміщення елементів інтерфейсу.
zh_cn: **Arrange control nodes automatically with containers:** 使用容器节点自动缩放和放置UI元素.

source: The two approaches are not always compatible. Because a container controls its children, you cannot use the layout menu on them. Each container has a specific effect, so you may need to nest several of them to get a working interface. With the layout approach you work from the bottom up, on the children. As you don't insert extra containers in the scene it can make for cleaner hierarchies, but it's harder to arrange items in a row, column, grid, etc.
cs: Oba přístupy nejsou vždy kompatibilní. Protože kontejner řídí svoje podřízené (děti), nemůžete na ně použít nabídku Rozložení. Každý kontejner má specifický efekt, takže možná budete muset několik kontejnerů vnořit, abyste získali funkční rozhraní. S přístupem Rozložení pracujete zdola nahoru, na dětech. Protože do scény nevkládáte další kontejnery, může to znamenat jednodužší hierarchii, ale je obtížnější uspořádat položky do řady, sloupce, mřížky atd.
de: Die beiden Ansätze sind nicht immer miteinander kompatibel. Weil ein Container seine Children kontrolliert, können Sie das Layout-menü nicht für sie verwenden. Jeder Container hat einen spezifischen Effekt, Sie müssen also eventuell mehrere von ihnen verschachteln um eine funktionierende Benutzeroberfläche zu erhalten. Mit dem Layout Ansatz arbeiten Sie sich von den Children aus nach oben. Da Sie keine extra Container zur Szene hinzufügen müssen kann dies zu einer saubereren Hierarchie führen, es ist allerdings schwieriger Dinge in Reihen, Spalten oder Gittern anzuordnen.
es: Los dos enfoques no son siempre compatibles. Dado que un Container controla a sus hijos, no se puede utilizar el menú de disposición en ellos. Cada Container tiene un efecto específico, por lo que puede ser necesario anidar varios de ellos para obtener una interfaz de trabajo. Con el enfoque de disposición se trabaja de abajo hacia arriba, en los hijos. Como no inserta Containers adicionales en la escena, puede hacer que las jerarquías sean más limpias, pero es más difícil organizar los elementos en una fila, columna, cuadrícula, etc.
fr: Les deux approches ne sont pas toujours compatibles. Puisqu'un conteneur contrôle ses enfants, vous ne pouvez pas utiliser le menu de mise en page sur eux. Chaque conteneur ayant un effet spécifique, vous aurez peut-être besoin d'en emboîter plusieurs pour obtenir une interface fonctionnelle. Avec l'approche de mise en page, vous travaillez sur l'enfant à partir du bas vers le haut. Étant donné que vous n'insérez pas de conteneurs supplémentaires dans la scène, vous obtiendrez des hiérarchies plus nettes, mais il sera plus difficile de disposer les éléments en rangée, en colonne, grille, etc.
ja: ２つのアプローチはいつも相性が良いわけではありません。コンテナは子ノードを操作し、それらのレイアウトメニューを使えないからです。それぞれのコンテナは特定の効果を持ち、操作画面にたどり着くまでにいくつかのノードをたどらなければならないかもしれません。レイアウトアプローチでは子ノードの下の画面から行うことができます。シーンに追加のコンテナを挿入しないなら、見通しのよい階層を構成できるでしょう。しかし、縦、横、グリッド等にアイテムを配置することは難しくなるでしょう。
ko: 두 가지 방법(컨테이너와 레이아웃)이 항상 호환되는 것은 아닙니다. 컨테이너는 자식을 제어하기 때문에, 레이아웃 메뉴를 그것들에게 사용할 수 없습니다. 각 컨테이너는 특정한 효과를 갖고 있으므로 당신은 제대로 동작하는 인터페이스를 얻기 위해 그들을 중첩해서 사용할지도 모릅니다. 레이아웃 접근으로는 자식들을 계층상 아래에서 위로 작업합니다. 씬에 추가적인 컨테이너를 사용하지 않으므로 더 깨끗한 계층 구조를 만들 수 있지만, 항목을 행이나 열, 격자 등으로 배열하기는 더 어렵습니다.
ru: Эти два подхода не всегда совместимы. Поскольку контейнер управляет своими потомками, вы не можете использовать меню макета на них. Каждый контейнер имеет определенный эффект, так что вам может потребоваться вложить несколько из них, чтобы получить работающий интерфейс. С подходом макета вы работаете снизу вверх, над потомками. Поскольку вы не вставляете дополнительных контейнеров в сцену, это может сделать более чистой иерархию, но так сложнее расположить элементы в ряд, колонку, сетку и прочее.
uk: Ці два способи не завжди сумісні. Оскільки контейнер контролює своїх нащадків, ви не можете використовувати на них меню компонування. Кожен контейнер має специфічний ефект, тому вам може знадобитися вкласти декілька з них, щоб отримати робочий інтерфейс. В меню компонування ви працюєте знизу вгору, над дітьми. Оскільки ви не вставляєте зайвих контейнерів у сцену, меню компонування дозволяє створити більш чисті ієрархії, але в ньому складніше розташовувати елементи в рядку, стовпці, сітці тощо.
zh_cn: 这两种方法并不总是兼容的. 由于容器控制着其子项, 因此您无法在其上使用布局菜单. 每个容器都有特定的作用, 因此您可能需要嵌套几个容器才能获得工作界面. 使用布局方法时, 您将从下至上处理子级. 由于没有在场景中插入额外的容器, 所以层次结构会更加清晰, 但是很难在行, 列, 栅格等中排列项.
zh_tw: 這兩種方法並非完全相容。由於 Container 會控制其子節點，所以無法在 Container 節點上使用畫面配置選單。各種 Container 都有特定的效果，所以製作界面時就會需要嵌套多層 Container。若使用畫面配置選單的話，就能由下至上地 (Bottom Up) 從子節點開始製作界面，因為不需要額外在場景中插入 Container，所以架構也會比較清楚。但這種方式也比較難能以行、列、或以網格系統等方式來排列 UI。

source: As you create UIs for your games and tools, you'll develop a sense for what fits best in each situation.
cs: Při vytváření uživatelského rozhraní pro své hry a nástroje si postupně vytvoříte smysl pro to, co by se v každé situaci nejlépe hodílo.
de: Während Sie Benutzeroberflächen für Ihre Spiele und Tools erschaffen werden Sie einen Sinn dafür entwickeln, was in welcher Situation am besten passt.
es: A medida que crees UIs para tus juegos y herramientas, desarrollarás un sentido de lo que mejor se adapta a cada situación.
fr: En créant des interfaces utilisateur pour vos jeux et outils, vous développerez une l'intuition pour ce qui est le plus approprié dans chaque situation.
it: Man mano che crei le interfacce utente per i tuoi giochi e strumenti, svilupperai un senso di ciò che meglio si adatta a ogni situazione.
ja: ゲームやツールのUIを作っていけば、それぞれの状況で何がいちばん適しているのか分かるようになっていきます。
ko: 게임과 도구를 위해 UI를 만들 때, 당신은 각 상황에서 무엇이 가장 적당한지에 대한 감각을 기르게 될 것입니다.
pt_br: À medida que você cria interfaces de usuário para seus jogos e ferramentas, você desenvolverá uma noção do que se encaixa melhor em cada situação.
ru: По мере создания интерфейсов для ваших игр и инструментов, вы развиваете ощущение того, что лучше подходит в конкретной ситуации.
uk: Створюючи інтерфейси для своїх ігор та інструментів, ви з часом зрозумієте для якої ситуації який спосіб підходить краще.
zh_cn: 在为游戏和工具创建UI时, 您将对每种情况下最合适的内容有所了解.
zh_tw: 在為遊戲與工具建立 UI 後你就能漸漸掌握各種狀況下要用什麼方式最適合。

source: Place UI elements precisely with anchors
cs: Přesné umísťování prvků uživatelského rozhraní pomocí kotev
de: Platziere UI Elemente präzise mit Ankern
es: Posicionamiento preciso de elementos UI con anclajes
fr: Placer précisément les éléments de l'interface utilisateur à l'aide d'ancrages
it: Piazzare perfettamente gli elementi dell'interfaccia utente attraverso l'uso degli ancoraggi
ja: アンカー(Anchor)を使用してUI要素を正確に配置する
ko: 앵커를 사용하여 UI 요소를 정밀하게 배치하세요
pt_br: Coloque os elementos da interface do usuário precisamente com âncoras
ru: Размещайте элементы интерфейса в точности с якорями
uk: Розміщення елементів інтерфейсу з допомогою прив'язок
zh_cn: 用锚精确地放置UI元素
zh_tw: 使用錨點精確地擺放 UI 元素

source: Control nodes have a position and size, but they also have anchors and margins. Anchors define the origin, or the reference point, for the Left, Top, Right and Bottom edges of the node. Change any of the 4 anchors to change the reference point of the margins.
cs: Řídicí uzly mají polohu a velikost, ale mají také kotvy a okraje. Kotvy definují počátek nebo referenční bod pro levý, horní, pravý a dolní okraj uzlu. Změňte některou ze čtyř kotev, abyste změnili referenční bod okrajů.
de: Control Nodes haben eine Position und Größe, aber sie haben außerdem Anker und Seitenränder. Anker definieren den Ursprung oder den Referenzpunkt für die linke, obere, rechte und untere Kante der Node. Ändere einen dieser 4 Anker um den Referenzpunkt des Seitenrandes zu ändern.
es: Los nodos de control tienen una posición y tamaño, pero también tienen anclas y márgenes. Los anclajes definen el origen, o el punto de referencia, para los bordes izquierdo, superior, derecho e inferior del nodo. Cambia cualquiera de los 4 anclajes para cambiar el punto de referencia de los márgenes.
fr: Les nœuds de contrôles ont une position et une taille, mais ils ont également des ancrages et des marges. Les ancrages définissent l'origine, ou le point de référence, pour les cotés Gauche, Haut, Droit et Bas du nœud. Modifier n'importe lequel valeur des 4 ancrages pour modifier le point de référence des marges.
it: I nodi Control hanno una posizione e una dimensione, ma hanno anche ancore e margini. Le ancore definiscono l'origine o il punto di riferimento per i bordi sinistro, superiore, destro e inferiore del nodo. Cambia una delle 4 ancore per cambiare il punto di riferimento dei margini.
ja: コントロールノードには位置とサイズがありますが、アンカー(Anchor)と余白(Margin)もあります。アンカーは、ノードの左端、上端、右端、下端の原点または参照点を定義します。余白の基準点を変更するには、4つのアンカーのいずれかを変更します。
ko: 컨트롤 노드는 position과 size를 갖고 있고, anchors와 margins도 있습니다. Anchors는 노드의 Left, Top, Right, Bottom 모서리를 위해 원점이나 기준점을 정의합니다. 4개의 앵커 중 아무거나 바꿔서 margins의 기준점을 변경하세요.
pt_br: Nós de controle têm uma posição e tamanho, mas eles também têm âncoras e margens. As âncoras definem a origem ou o ponto de referência para as arestas esquerda, superior, direita e inferior do nó. Altere qualquer uma das quatro âncoras para alterar o ponto de referência das margens.
ru: У управляющих узлов есть позиция и размер, но они также имеют якоря и отступы. Якоря определяют начало координат (ориентир) для левого, верхнего, правого и нижнего краёв узла. Изменив любой из 4 якорей, можно сдвинуть ориентир для отступов.
uk: Контрольні вузли мають позицію та розмір, але вони також мають прив'язки та поля. Прив'язки визначають початок, або опорну точку, для лівого, верхнього, правого та нижнього країв вузла. Змініть будь-яку з 4 прив'язок, щоб змінити опорну точку поля.
zh_cn: ``Control`` 节点有位置和大小, 但它们也有锚和边距. 锚定义节点的左, 上, 右和下边缘的原点或参考点. 更改4个锚中的任何一个, 将更改边距的参考点.
zh_tw: Control 節點有位置與大小，同時也有錨點與外邊距。錨點定義相對於節點左邊 (Left)、上面 (Top)、右邊 (Right)、與下面 (Bottom) 的原點（或稱為參考點）。更改這四個錨點即可更改外邊距的參考點。

source: The anchor property
cs: Vlastnost Kotva
de: Die Anker Eigenschaft
es: La propiedad del anclaje
fr: La propriété d'ancrage
it: Proprietà dell'ancora
ja: アンカーのプロパティ
ko: 앵커 속성
pt_br: A propriedade Anchor
ru: Свойство якоря
uk: Властивість прив'язки
zh_cn: 锚属性
zh_tw: 錨點屬性

source: How to change the anchor
cs: Jak změnit kotvu
de: Wie man den Anker ändert
es: Cómo cambiar el anclaje
fr: Comment modifier l'ancrage
it: Come cambiare l'ancora
ja: アンカーを変更する方法
ko: 앵커를 바꾸는 방법
pt_br: Como alterar a âncora
ru: Как изменять якорь
uk: Як змінити прив'язку
zh_cn: 如何更换锚
zh_tw: 如何更改錨點

source: Like any properties, you can edit the 4 anchor points in the Inspector, but this is not the most convenient way. When you select a control node, the layout menu appears above the viewport, in the toolbar. It gives you a list of icons to set all 4 anchors with a single click, instead of using the inspector's 4 properties. The layout menu will only show up when you select a control node.
cs: Stejně jako všechny vlastnosti můžete v Inspektoru upravit 4 kotevní body, ale jde to i pohodlněji. Když vyberete řídicí uzel, na panelu nástrojů se nad výřezem zobrazí nabídka Rozložení. Poskytuje vám seznam ikon pro nastavení všech 4 kotev jediným kliknutím namísto použití 4 vlastností Inspektoru. Nabídka Rozložení se zobrazí, pouze pokud vyberete řídicí uzel.
de: Wie jede Eigenschaft, lassen sich die 4 Anker Punkte im Inspektor editieren, dies ist allerdings nicht die bequemste Möglichkeit. Wenn Sie eine Control Node auswählen, erscheint das Layout Menü über der Hauptansicht in der Werkzeugleiste. Es enthält eine Liste von Symbolen um alle 4 Anker mit einem einzigen Klick zu setzen, anstatt die 4 Eigenschaften im Inspektor zu verwenden. Das Layout Menü erscheint nur wenn Sie eine Control Node auswählen.
es: Como cualquier otra propiedad, puedes editar los 4 puntos de anclaje en el Inspector, pero esta no es la forma más conveniente. Cuando seleccionas un nodo de control, el menú de configuración aparece encima de la ventana de visualización, en la barra de herramientas. Te ofrece una lista de iconos para establecer los 4 anclajes con un solo clic, en lugar de utilizar las 4 propiedades del inspector. El menú de diseño sólo aparecerá cuando selecciones un nodo de control.
fr: Comme toutes les propriétés, vous pouvez modifier les 4 points d'ancrage dans l'Inspecteur, mais il ne s'agit pas de la façon la plus conviviale. Lorsque vous sélectionnez un nœud de contrôle, le menu de mise en page s'affiche au-dessus de la vue, dans la barre d'outils. Il vous donne une liste d'icônes pour paramétrer les 4 ancrages en un seul clic, au lieu d'utiliser les 4 propriétés dans l'Inspecteur. Le menu de mise en page s'affichera seulement lorsque vous sélectionnez un nœud de contrôle.
it: Come qualsiasi altra proprietà, puoi modificare i 4 punti di ancoraggio nell'Inspector, ma questo non è il modo più conveniente. Quando si seleziona un nodo di controllo, il menu di configurazione appare sopra la finestra del display sulla barra degli strumenti. Offre un elenco di icone per impostare le 4 ancore con un solo clic, invece di utilizzare le 4 proprietà dell'ispettore. Il menu di progettazione verrà visualizzato solo quando si seleziona un nodo di controllo.
ja: 他のプロパティと同じく、４個あるアンカーポイントをインスペクタで編集することもできますが、最適な方法ではありません。コントロールノードを選択すると、ビューポートの上にあるツールバーに『レイアウト』メニューが現れます。インスペクタに４個あるプロパティの代わりに、このアイコン付きのリストから選べば、一発ですべてのアンカーを設定できます。『レイアウト』メニューは、コントロールノードを選択したときにのみ出てきます。
ru: Как и любые свойства, вы можете редактировать 4 якорные точки в Инспекторе, но это не самый удобный путь. Когда вы выделяете управляющий узел, над окном просмотра в панели инструментов появляется меню макета. Оно дает вам список иконок для установки всех 4 якорей одним кликом вместо использования 4 свойств Инспектора. Меню макета будет видно лишь тогда, когда вы выбрали управляющий узел.
uk: Як і будь-які властивості, ви можете редагувати 4 точки прив'язки в Інспекторі, але це не самий зручний спосіб. Коли ви вибираєте вузол контролю, над вікном перегляду, на панелі інструментів, з’являється меню макета (компонування). Воно дає вам список піктограм для встановлення всіх 4 якорів одним клацанням, замість того, щоб використовувати 4 властивості інспектора. Меню макета буде видно лише тоді, коли ви вибрали вузол контролю.
zh_cn: 与任何属性一样, 您可以在属性检查器面板中编辑4个锚点, 但这不是最方便的方法. 选择控制节点后, 布局菜单将出现在视图上方的工具栏中. 它为您提供了一个图标列表, 在此通过单击就可以设置所有4个锚点, 而不必在属性检查器面板去设置4个属性. 仅当选择控制节点时, 才会显示布局菜单.
zh_tw: 與其他屬性一樣，可以在屬性面板中編輯四個錨點。但這種方法不是最方便的。當選擇一個 Control 節點後，檢視區上方的工具列會出現畫面配置選單。通過畫面配置選單中的各個圖示，就只需要點擊一下便可設定四個錨點值，而不需自己在屬性面板中調整。畫面配置選單只會在選擇 Control 節點後出現。

source: The layout menu in the viewport
cs: Nabídka Rozložení ve výřezu
de: Das layout Menü im Ansichtsfenster
es: El menú de disposición en la ventana de visualización
fr: Le menu de mise en page dans la vue
ja: ビューポートのレイアウトメニュー
ko: 뷰포트 내의 레이아웃 메뉴
pt_br: O menu de layout na viewport
ru: Меню макета в окне просмотра
uk: Меню макета у вікні перегляду
zh_cn: 视图中的布局菜单
zh_tw: 檢視區中的畫面配置選單

source: Anchors are relative to the parent container
cs: Kotvy jsou relativní k nadřazenému (rodičovskému) kontejneru
de: Anker sind relativ zum parent Container
es: Los anclajes son relativos al container principal
fr: Les ancrages sont relatifs à leur conteneur parent
it: Le ancore sono relative al contenitore principale
ja: アンカーは親コンテナに対して相対的です
ko: 앵커는 부모 컨테이너를 기준로 합니다
pt_br: Âncoras são relativas ao contêiner pai
ru: Якоря относительны к родительскому контейнеру
uk: Прив'язки відносно батьківського контейнера
zh_cn: 相对于父容器的锚
zh_tw: 節點相對於其母容器

source: Each anchor is a value between 0 and 1. For the left and top anchors, a value of 0 means that without any margin, the node's edges will align with the left and top edges of its parent. For the right and bottom edges, a value of 1 means they'll align with the parent container's right and bottom edges. On the other hand, margins represent a distance to the anchor position in pixels, while anchors are relative to the parent container's size.
cs: Každá kotva představuje hodnotu mezi 0 a 1. U levé a horní kotvy hodnota 0 znamená, že hrany uzlu budou bez okraje zarovnány s levým a horním okrajem nadřazeného kontejneru. U pravého a dolního okraje hodnota 1 znamená, že budou zarovnány s pravým a dolním okrajem nadřazeného kontejneru. A naopak okraje představují vzdálenost k pozici kotvy v obrazových bodech, zatímco kotvy jsou relativní vzhledem k rozměrům nadřazeného kontejneru.
de: Jeder Anker ist ein Wert zwischen 0 und 1. Für den linken und oberen Anker bedeutet ein Wert von 0, dass die Kanten der Node ohne Abstand an der oberen und linken Kante ihres parent platziert wird. Für die rechte und untere Kante bedeutet ein Wert von 1, dass diese Kanten an die rechte und untere Kante des parent Containers angepasst werden. Andererseits repräsentieren margins die Abstände zur Anker Position in Pixeln, während Anker relativ zur Größe des parent Containers sind.
es: Cada ancla es un valor entre 0 y 1. Para las anclas izquierda y superior, un valor de 0 significará que no hay ningún margen, los bordes del nodo se alinearán con los bordes izquierdo y superior de su padre. Para los bordes derecho e inferior, un valor de 1 significa que se alinearán con los bordes derecho e inferior del container padre. Por otro lado, los márgenes representan una distancia a la posición del ancla en píxeles, mientras que los anclajes son relativos al tamaño del container padre.
fr: Chaque ancrage est une valeur qui se situe entre 0 et 1. Pour les ancrages du haut et de gauche, une valeur de 0 signifie que, sans aucune marge, les bords du nœud s'aligneront avec les bords de gauche et de haut de son parent. Pour les bords droit et bas, une valeur de 1 signifie qu'ils s'aligneront avec les bords de droite et du bas de son conteneur parent. Dans une autre ordre d'idée, les marges représentent une distance jusqu'au position d'un ancrage en pixels, tandis que les ancrages sont relatifs à la taille de leur conteneur parent.
it: Ogni ancora ha un valore compreso tra 0 e 1. Per le ancore di sinistra e superiore, un valore di 0 significa che non vi è margine, i bordi del nodo si allineeranno con i bordi sinistro e superiore del suo genitore. Per i bordi destro e inferiore, un valore di 1 indica che si allineeranno con i bordi destro e inferiore del contenitore principale. D'altra parte, i margini rappresentano una distanza dalla posizione dell'ancoraggio in pixel, mentre gli ancoraggi sono relativi alla dimensione del contenitore padre.
ja: 各アンカーは0から1の間の値です。左アンカーと上端アンカーの場合、値0は余白(Margin)なしで、ノードの端が親の左端と上端に位置合わせすることを意味します。右端と下端の場合で、値が1なら、親コンテナーの右端と下端に位置合わせされます。一方、余白はアンカーからの距離(ピクセル単位)を表し、アンカーは親コンテナーのサイズに対して相対的です。
ko: 각 앵커는 0부터 1사이의 값을 갖습니다. 왼쪽과 위 앵커가 0의 값을 갖는 것은 마진이 없다는 것을 의미하고, 노드의 가장자리는 부모 노드의 왼쪽 위에 정렬됩니다. 오른쪽과 아래 가장자리가 1의 값을 갖는 것은 부모 컨테이너의 오른쪽과 아래 가장자리에 정렬된다는 것을 의미합니다. 한편, 마진은 앵커의 위치에서 거리를 픽셀 단위로 나타냅니다, 반면에 앵커는 부모 컨테이너의 크기와 관련이 있습니다.
pt_br: Cada âncora é um valor entre 0 e 1. Para as âncoras esquerda e superior, um valor de 0 significa que sem qualquer margem, as arestas do nó serão alinhadas às arestas esquerda e superior de seu pai. Para as bordas direita e inferior, um valor de 1 significa que eles se alinharão às bordas direita e inferior do contêiner pai. Por outro lado, as margens representam uma distância para a posição da âncora em pixels, enquanto as âncoras são relativas ao tamanho do contêiner pai.
ru: Каждый якорь — это значение между 0 и 1. Для левого и верхнего якорей, что значится как 0, без каких-либо отступов края узла будут выровнены по левому и верхнему краям его родителя. Для правого и нижнего краёв, что значится как 1, они будут выровнены по правому и нижнему краям родительского контейнера. С другой стороны, отступы представляют собой расстояние до позиции якоря в пикселях, в то время как якоря относительны размеру родительского контейнера.
uk: Кожна прив'язка - це значення від 0 до 1. Для лівої та верхньої прив'язки значення 0 означає, що краї вузла будуть вирівнюватись по лівому та верхньому краю його предка без будь-якого поля. Для правого та нижнього країв значення 1 означає, що вони будуть вирівнюватись з правим і нижнім краєм предка. З іншого боку, поля представляють відстань до положення прив'язки в пікселях, тоді як прив'язки відносно розміру батьківського контейнера.
zh_cn: 每个锚都是0到1之间的值. 对于左侧和顶部锚点, 值0表示没有任何边距, 节点的边缘将与其父节点的左侧和顶部边缘对齐. 对于右边缘和底边缘, 值为1表示它们将与父容器的右边缘和底边缘对齐. 另一方面, 边距表示到锚点位置的距离(以像素为单位), 而锚点是相对于父容器的大小.
zh_tw: 每個錨點的值都介於 0 與 1。左邊 (Left) 與上面 (Top) 的錨點中，值為 0 則代表沒有任何外邊距。節點的邊距會保持與母節點中的左側與上面的邊緣對齊。而右邊 (Right) 與下面 (Bottom) 的錨點，值為 1 則代表會與母容器的右邊與下面的邊緣對齊。換句話說，外邊距代表了至錨點的距離，單位為像素。而錨點則是相對於母容器的大小。
