Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_introduction_to_the_ui_system.po
Languages: cs, de, es, fr, it, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Design interfaces with the Control nodes
cs: Design rozhraní pomocí uzlů typu Control
de: Benutzeroberflächen gestalten mit Kontroll-Nodes
es: Diseño de interfaces con nodos Control
fr: Conception d'interfaces avec les nœuds Control
it: Disegnare interfacce con i nodi Control
ja: コントロールノードを使用したインターフェイスの設計
ko: 컨트롤(Control) 노드로 인터페이스를 설계하기
pt_br: Design de interfaces com os nós de Controle
ru: Дизайн интерфейса с помощью узлов контроля
uk: Дизайн інтерфейсу за допомогою вузлів Control
zh_cn: 使用 ``Control`` 节点设计界面
zh_tw: 利用 Control 節點設計界面

source: Computer displays, mobile phones, and TV screens come in all shapes and sizes. To ship a game, you'll need to support different screen ratios and resolutions. It can be hard to build responsive interfaces that adapt to all platforms. Thankfully, Godot comes with robust tools to design and manage a responsive User Interface.
cs: Počítačové displeje, mobilní telefony a televizní obrazovky se objevují ve všech tvarech a velikostech. Chcete-li distribuovat hru, musíte podporovat různé poměry obrazovky i rozlišení. Může být obtížné vytvořit responzivní rozhraní, která se přizpůsobí všem platformám. Naštěstí Godot přichází s robustními nástroji pro návrh a správu responzivního uživatelského rozhraní.
de: Monitore, Displays und Fernseher existieren in allen Formen und Größen. Um ein Spiel zu veröffentlichen, muss es verschiedene Bildschirmseitenverhältnisse und -auflösungen unterstützen. Es kann schwierig sein adaptive Benutzeroberflächen zu erstellen, welche sich an alle Plattformen anpassen. Glücklicherweise kommt Godot mit robusten Werkzeugen, um adaptive Benutzeroberflächen zu gestalten und zu verwalten.
es: Las pantallas de computadora, teléfonos móviles y TV vienen en todas las formas y tamaños. Para crear un juego, tendrás que admitir diferentes proporciones y resoluciones de pantalla. Puede ser difícil crear interfaces responsivas que se adapten a todas las plataformas. Afortunadamente, Godot viene con herramientas robustas para diseñar y administrar una Interfaz de Usuario responsiva.
fr: Les écrans d'ordinateur, de téléphones portables et de télévision sont de différentes formes et tailles. Pour publier un jeu, vous devrez prendre en charge différents ratios et résolutions d'écran. Il peut être difficile de construire des interfaces réactives qui s'adaptent à toutes les plates-formes. Heureusement, Godot est fourni avec des outils robustes pour concevoir et gérer une interface utilisateur réactive.
it: Schermi di computer, cellulari, e televisori sono di tutte le forme e dimensioni. Per pubblicare un gioco, avrai bisogno di supportare diverse proporzioni e risoluzioni di schermi. Può essere complicato costruire interfacce reattive che si adattano a tutte le piattaforme. Per fortuna, Godot è munito di strumenti robusti per progettare e gestire un'Interfaccia Utente reattiva.
ja: パソコンのディスプレイ、携帯電話、TV画面などは、あらゆる形と大きさをしています。ゲームを公開する前に、異なるアスペクト比と解像度に対応させなければなりません。すべてのプラットフォームに対応するレスポンシブなインターフェースは、作るのが大変な場合もあります。うれしいことに、Godotにはレスポンシブなインターフェースをデザインして管理するための、強力なツール群が用意されています。
ru: Дисплеи компьютеров, мобильных телефонов и экраны телевизоров бывают разных форм и размеров. Чтобы выпустить игру, вам необходимо сделать поддержку разных соотношений сторон и разрешений экрана. Бывает нелегко создать отзывчивый интерфейс, который адаптируется ко всем платформам. К счастью, Godot предоставляет мощный инструментарий для проектирования и управления чуткого пользовательского интерфейса.
uk: Комп'ютерні дисплеї, мобільні телефони та телевізійні екрани бувають різних форм та розмірів. Щоб випустити гру, вам потрібно буде підтримувати різні співвідношення екрана та роздільну здатність. Побудувати чуйні інтерфейси, які адаптуються до всіх платформ, буває складно. На щастя, Godot поставляється із надійними інструментами для розробки та керування чуйним інтерфейсом користувача.
zh_cn: 电脑显示器, 手机, 和电视屏幕有各种形状和尺寸. 要发布一款游戏, 要发布游戏, 您需要支持不同的屏幕比例和分辨率. 构建适应所有平台的响应式接口可能很困难. 值得庆幸的是,Godot附带了功能强大的工具, 可以设计和管理响应式用户界面.
zh_tw: 電腦螢幕、手機、電視螢幕等有著不同的形狀與尺寸。要發佈遊戲就需要能支援各種不同的螢幕長寬比與解析度。要製作能適用於所有平台的回應式 (Responsive) 界面有可能很困難。幸好，Godot 提供了強大的工具能夠設計與管理回應式使用者介面。

source: Godot's editor is made with the engine's UI framework
cs: Godotův editor je vytvořen knihovnou uživatelského rozhraní enginu
de: Der Godot Editor wurde mittels Godots UI-Framework erstellt.
es: El editor de Godot está hecho con el framework UI del motor
fr: L'éditeur de Godot est réalisé avec le framework UI du moteur
it: L'editor di Godot è creato con il framework UI del motore stesso
ja: Godotのエディタは、エンジンのUIフレームワークで作られています
ko: Godot 에디터는 엔진의 UI 프레임 워크로 제작되었습니다
pt_br: O editor do Godot é feito com o framework de interface do usuário da engine
ru: Редактор Godot создан на основе каркаса пользовательского интерфейса движка
uk: Інтерфейс Godot розроблений за допомогою своєї ж технології створення інтерфейсів
zh_cn: Godot的编辑器由引擎的UI框架制成
zh_tw: Godot 的編輯器是使用引擎的 UI 框架製作的

source: This guide will get you started with UI design. You will learn:
cs: Tato příručka vás provede návrhem uživatelského rozhraní. Dozvíte se:
de: Dieses Anleitung wird Ihnen den Einstieg in das Design der Benutzeroberfläche erleichtern. Sie werden folgendes lernen:
es: Esta guía te ayudará a comenzar con el diseño de la UI. Aprenderás:
fr: Ce guide vous permettra de commencer la conception d'interfaces utilisateurs. Vous apprendrez :
it: Questa guida ti insegnerà le basi della progettazione UI. Imparerai:
ja: このガイドでは、UI設計を開始します。次の内容を学習します:
ko: 이 강좌는 UI 디자인으로 시작할 것입니다. 당신은 이러한 것들을 배울 겁니다:
pt_br: Este guia irá ajudá-lo com o design da interface do usuário. Você vai aprender:
ru: Это руководство поможет вам начать разработку пользовательского интефейса. Вы узнаете:
uk: Цей посібник допоможе розпочати роботу з проєктним інтерфейсом користувача. Ви вивчите:
zh_cn: 本指南将帮助您开始进行UI设计. 你将学习:
zh_tw: 這篇教學將帶你瞭解 UI 設計。你將學會：

source: The five most useful control nodes to build your games' interface
cs: Pět nejužitečnějších řídících uzlů (typu Control) pro vytvoření rozhraní vašich her
de: Die fünf nützlichsten Control-Nodes, um die Benutzeroberfläche Ihres Spieles zu erstellen
es: Los cinco nodos de control más útiles para construir la interfaz de tus juegos
fr: Les cinq nœuds "Control" les plus utiles pour construire l'interface de vos jeux
it: I cinque nodi di controllo più utili per costruire l'interfaccia dei tuoi giochi
ja: あなたのゲームのインターフェースを作るのに、特に使える５つのコントロール・ノード
ru: Пять наиболее полезных узлов управления для сборки ваших игровых интерфейсов
uk: П'ять найкорисніших вузлів управління для створення інтерфейсу ваших ігор
zh_cn: 建立游戏界面的五个最有用的控制节点
zh_tw: 製作遊戲界面最實用的五個 Control 節點

source: How to work with the anchor of UI elements
cs: Jak pracovat s kotvou prvků uživatelského rozhraní
de: Wie man Anchor (Bezugspunkte) in Benutzeroberflächen-Elementen verwendet
es: Cómo trabajar con el anclaje de los elementos de la UI
fr: Comment travailler avec l'ancrage des éléments de l'interface utilisateur
it: Come lavorare con l'ancora degli elementi UI
ja: UI要素のアンカーを使用する方法
ko: UI 요소들의 앵커 작업 방법
pt_br: Como trabalhar com a âncora de elementos da interface do usuário
ru: Как работать с якорями элементов пользовательского интерфейса
uk: Як працювати з якорем елементів інтерфейсу
zh_cn: 如何使用UI元素的锚点
zh_tw: 如何使用 UI 元素的錨點

source: How to efficiently place and arrange your user interface using containers
cs: Jak efektivně umístit a uspořádat své uživatelské rozhraní pomocí kontejnerů
de: So platzieren und ordnen Sie Ihre Benutzeroberfläche effizienter mithilfe von Containern
es: Cómo colocar y organizar eficientemente tu interfaz de usuario usando contenedores
fr: Comment placer et organiser efficacement votre interface utilisateur à l'aide de conteneurs
it: Come piazzare e ordinare efficientemente la tua interfaccia utente usando i contenitori
ja: コンテナを使用してユーザーインターフェイスを効率的に配置および配置する方法
ko: 컨테이너를 사용해서 사용자 인터페이스를 효율적으로 배치하고 배열하는 방법
pt_br: Como colocar e organizar eficientemente sua interface de usuário usando contêineres
ru: Как эффективно разместить и упорядочить ваш пользовательский интерфейс с помощью контейнеров
uk: Як дієво розмістити та упорядкувати свій інтерфейс користувача за допомогою контейнерів
zh_cn: 如何使用容器有效地放置和排列用户界面
zh_tw: 如何使用 Container 有效率地排列與擺放界面

source: The five most common containers (you can learn more about containers in the :ref:`GUI Containers <doc_gui_containers>` documentation page).
cs: Pět nejběžnějších kontejnerů (další informace o kontejnerech se dozvíte na stránce :ref:`GUI Containers <doc_gui_containers>` document page).
de: Die fünf häufigsten Container (mehr dazu in der Dokumentation unter :ref:`GUI Containers <doc_gui_containers>`).
es: Los cinco contenedores más comunes (más adelante aprenderás más sobre contenedores en la página :ref:`GUI Containers <doc_gui_containers>` de la documentación).
fr: Les cinq conteneurs les plus courants (vous pouvez en savoir plus sur les conteneurs dans la page de documentation :ref:`GUI Containers <doc_gui_containers>`).
it: I cinque contenitori più comuni (puoi scoprire di più sui contenitori nella pagina della documentazione :ref:`GUI Containers <doc_gui_containers>`).
ja: とりわけよく使う５つのコンテナ (この後、コンテナについてもっと知りたければ\ :ref:`GUI Containers <doc_gui_containers>` \ を参照してください)。
ru: Пять наиболее распространенных контейнеров (узнать о контейнерах больше вы сможете на странице документации :ref:`GUI Containers <doc_gui_containers>`).
uk: П'ять найпоширеніших контейнерів (ви можете дізнатися більше про контейнери на сторінці документації :ref:`GUI Containers <doc_gui_containers>`).
zh_cn: 五个最常用的容器(您可以在 :ref:`GUI 容器 <doc_gui_containers>` 文档页面中, 了解有关容器的更多信息).
zh_tw: 五個最常見的 Container （有關 Container 的更多內容可以參考 :ref:`GUI Containers <doc_gui_containers>` 說明文件頁面）。

source: To learn how to control the interface and connect it to other scripts, read :ref:`Build your first game UI in Godot <doc_ui_game_user_interface>`.
cs: Chcete-li se naučit, jak ovládat rozhraní a připojit jej k jiným skriptům, přečtěte si :ref:`Vytvořte své první uživatelské rozhraní hry v Godot <doc_ui_game_user_interface>`.
de: Um zu lernen, wie man Benutzeroberflächen anlegt und diese mit Code verknüpft, lies :ref:`Build your first game UI in Godot <doc_ui_game_user_interface>`.
es: Para aprender a controlar la interfaz y conectarla a otros scripts, lee :ref:`Construye tu primera UI de juego en Godot <doc_ui_game_user_interface>`.
fr: Pour apprendre à contrôler l'interface et à la connecter à d'autres scripts, lisez :ref:`Construisez votre première interface utilisateur de jeu dans Godot <doc_ui_game_user_interface_user_interface>`.
it: Per imparare come controllare l'interfaccia e connetterla agli altri script, leggi :ref:`Costruisci la tua prima Interfaccia Utente in Godot <doc_ui_game_user_interface>`.
ja: インターフェイスを制御し、他のスクリプトに接続する方法については、\ :ref:`最初のゲームUIをGodotで構築する <doc_ui_game_user_interface>`\ を参照してください。
ko: 인터페이스를 컨트롤하고 다른 스크립트에 연결하는 방법을 배우려면, `Build your first game UI in Godot <doc_ui_game_user_interface>` 를 읽어주세요.
pt_br: Para aprender como controlar a interface e conectá-la a outros scripts, leia: ref:`Crie sua primeira interface de jogo em Godot <doc_ui_game_user_interface>`.
ru: Чтобы изучить, как управлять интерфейсом и подключать его к другим скриптам, прочтите :ref:`Создание пользовательского интерфейса своей первой игры в Godot <doc_ui_game_user_interface>`.
uk: Щоб дізнатися, як керувати інтерфейсом та підключати його до інших скриптів, читайте :ref:`Build your first game UI in Godot <doc_ui_game_user_interface>`.
zh_cn: 要了解如何控制界面并将其连接到其他脚本, 请阅读: :ref:`在Godot中构建您的第一个游戏UI <doc_ui_game_user_interface>`.
zh_tw: 要學習如何控制界面與將界面與其他腳本連接，請參考 :ref:`在 Godot 中製作第一個遊戲 UI <doc_ui_game_user_interface>` 。

source: To design your UI, you'll use the Control nodes. These are the nodes with green icons in the editor. There are dozens of them, for creating anything from life bars to complex applications. Godot's editor itself is built using Control nodes.
cs: K návrhu uživatelského rozhraní použijete uzly typu Control. Jedná se o uzly se zelenými ikonami v editoru. Jsou jich desítky, pro vytváření všeho od ukazatelů života po komplexní prvky. Sám Godotův editor je vytvořen pomocí řídících uzlů.
de: Um Ihre Oberfläche zu erstellen verwenden Sie Control-Nodes. Diese Nodes werden mit grünen Icons im Editor dargestellt. Es gibt Dutzende von ihnen, um alles Mögliche darzustellen wie Lebensleisten und komplexe Anwendungen. Godots Editor selbst ist mit diesen Control-Nodes gebaut.
es: Para diseñar tu UI, usarás los nodos Control. Esos son los nodos con íconos verdes en el editor. Hay docenas de ellos, para crear cualquier cosa, desde barras de vida hasta aplicaciones complejas. El mismo editor de Godot está armado usando nodos Control.
fr: Pour concevoir votre interface utilisateur, vous utiliserez les nœuds "Control". Ce sont les nœuds avec des icônes vertes dans l'éditeur. Il y en a des douzaines, pour créer des barres de vie ou des applications complexes. L'éditeur de Godot lui-même est construit à l'aide de nœuds Control.
it: Per progettare la tua Interfaccia Utente, userai i nodi Control. Questi nodi hanno icone verdi nell'editor. Ce ne sono a dozzine, per creare qualsiasi cosa, dalle barre della vita ad applicazioni complesse. Lo stesso editor di Godot é costruito usando nodi Control.
ja: UIを設計するためにコントロール・ノードを使います。エディタ内に緑のアイコンのノードがあります。ライフバーから複雑なアプリケーションまでなんでも作れるようにたくさんあります。Godotエディタそのものもコントロール・ノードを用いて作られています。
ru: Для создания своего интерфейса вы будете использовать узлы Control. В редакторе это узлы с зелеными иконками. Их десятки, для создания чего угодно: от полосок здоровья до более сложных приложений. Сам редактор Godot построен с использованием узлов Control.
uk: Щоб створити інтерфейс користувача, ви будете використовувати вузли Control (вузли управління). Це вузли із зеленими значками у редакторі. Їх десятки, для створення чого завгодно - від смужок здоров'я до складних програм. Сам редактор Godot побудований за допомогою вузлів Control.
zh_cn: 要设计UI, 您将使用 ``Control`` 节点. 这些就是编辑器中带有绿色图标的节点. 它们有数十种, 可用于创建从生命条到复杂应用程序的所有内容.Godot的编辑器本身是使用 ``Control`` 节点构建的.
zh_tw: 要設計 UI，需要使用 Control 節點。Control 節點就是在編輯器中有綠色圖示的節點。Godot 中有數十種的 Control 節點，可以用來製作出血槽甚至是複雜的應用程式等任何的東西。Godot 編輯器本身也是使用 Control 節點製作的。

source: Control nodes have unique properties that allow them to work well with one another. Other visual nodes, like Node2D and Sprite don't have these capabilities. So to make your life easier use Control nodes wherever possible when building your UIs.
cs: Řídicí uzly mají jedinečné vlastnosti, které jim umožňují navzájem dobře spolupracovat. Ostatní vizuální uzly, jako například Node2D či Sprite, tyto schopnosti nemají. Pro snažší život při vytváření uživatelských rozhraní používejte řídicí uzly, kdykoli je to možné.
de: Control-Nodes haben einzigartige Eigenschaften, die es erlauben gut miteinander zu arbeiten. Andere visuelle Nodes wie Node2D und Sprite haben diese Fähigkeiten nicht. Um Ihr Leben einfach zu machen sollten Sie so oft wie möglich Control-Nodes verwenden, um Ihre Oberfläche zu erstellen.
es: Los nodos Control tienen propiedades únicas que les permiten trabajar bien uno con otro. Otros nodos visuales, como Node2D y Sprite, no tienen esas capacidades. Así que para hacer tu vida más fácil, utiliza nodos Control cuando sea posible para construir las interfaces de usuario.
fr: Les nœuds Control ont des propriétés uniques qui leur permettent de bien fonctionner les uns avec les autres. D'autres nœuds visuels, comme Node2D et Sprite n'ont pas ces capacités. Donc, pour vous faciliter la vie, utilisez les nœuds Control autant que possible lors de la création de vos interfaces utilisateur.
it: I nodi di controllo hanno proprietá uniche che consentono loro di funzionare bene insieme. Altri nodi visuali, come Node2D e Sprite non hanno queste capacitá. Per questo per renderti la vita piú facile usa i nodi Control ovunque sia possibile per costruire le tue UI.
ja: コントロールノードは、コントロールノード同士で上手く機能するために一意のプロパティを持ちます。Node2Dやスプライトといった他のヴィジュアルノードはそのような特徴を持ちません。UI作成を楽するためには可能な限りコントロールノードを用いたほうが良いでしょう。
ru: Узлы Control имеют уникальные свойства, позволяющие им хорошо взаимодействовать друг с другом. Другие визуальные узлы, такие как Node2D и Sprite, не имеют таких возможностей. Поэтому, чтобы облегчить себе жизнь при создании своих пользовательских интерфейсов, используйте узлы Control везде, где это возможно.
uk: Control вузли мають унікальні властивості, що дозволяють їм добре працювати один з одним. Інші візуальні вузли, такі як Node2D і Sprite, не мають цих можливостей. Таким чином, щоб не ускладнювати собі життя, під час створення ваших інтерфейсів, використовуйте вузли Control, всюди де це тільки можливо.
zh_cn: ``Control`` 节点具有独特的属性, 使它们能很好地相互协作. 其他可视节点(如 ``Node2D`` 和 ``Sprite``)没有这些功能. 因此, 为了使您的生活更轻松, 请在构建UI时尽可能使用 ``Control`` 节点.
zh_tw: Control 節點有獨特的屬性能夠，能夠讓一個 Control 節點與另一個 Control 節點互相配合。其他如 Node2D 與 Sprite 的視覺節點就沒有這樣的功能。所以想輕鬆一點的話就請在製作 UI 時儘量使用 Control 節點吧。

source: All control nodes share the same main properties:
cs: Všechny řídicí uzly sdílejí stejné hlavní vlastnosti:
de: Alle Control-Nodes teilen die selben Haupteigenschaften:
es: Todos los nodos de control comparten las mismas propiedades principales:
fr: Tous les nœuds Control partagent les mêmes propriétés principales :
it: Tutti i nodi di controllo condividono le stesse proprietà principali:
ja: すべてのコントロールノードは、同じメインプロパティを共有します:
ko: 모든 컨트롤 노드는 동일한 메인 속성을 공유합니다:
pt_br: Todos os nós de controle compartilham as mesmas propriedades principais:
ru: Все узлы контроля имеют одни и те же основные свойства:
uk: Усі вузли управління мають однакові основні властивості:
zh_cn: 所有 ``Control`` 节点具有相同的主要属性:
zh_tw: 所有的 Control 節點都具有這幾個相同的主屬性：

source: Anchor
cs: Kotva
de: Anchor (Bezugspunkte)
es: Anclaje
fr: Anchor (Ancrage)
it: Ancora
ja: アンカー
ko: 앵커(Anchor)
pt_br: Âncora (anchor)
ru: Якорь (Anchor)
uk: Прив'язка
zh_cn: 锚
zh_tw: Anchor：錨點

source: Bounding rectangle
cs: Bounding rectangle (Ohraničující obdélník)
de: Bounding rectangle (Begrenzungsrahmen)
es: Rectangulo delimitador
fr: Bounding rectangle (Rectangle de délimitation)
it: Rettangolo di delimitazione
ja: 境界矩形
ko: 경계 사각형(Bounding rectangle)
pt_br: Retângulo delimitador (Bounding rectangle)
ru: Ограничительный прямоугольник (Rect)
uk: Обмежувальний прямокутник (Rect)
zh_cn: 边界矩形
zh_tw: Bouding Rectangle：邊界矩形

source: Focus and focus neighbor
cs: Fokus a fokus souseda
de: Focus and focus neighbor (Fokus und Fokus Nachbar)
es: Foco y vecinos (focus neighbour)
fr: Focus and focus neighbor (Focus et focus voisin)
it: Focus e focus adiacente
ja: フォーカスと、フォーカスの周辺
ko: 포커스(Focus)와 포커스 이웃(Focus neighbor)
ru: Фокус и фокус соседей (Focus)
uk: Фокус і фокус сусідів (Focus)
zh_cn: 焦点和焦点邻居
zh_tw: Focus 與 Focus Neighbor：焦點與相鄰焦點

source: Size flags
cs: Size flags (Příznaky velikosti)
de: Size flags (Größeneinstellungen)
fr: Size flags (Marqueurs de dimension)
it: Flag di dimensione
ja: サイズフラグ
ko: 사이즈 플래그(Size flags)
pt_br: Sinalizadores de tamanho (Size flags)
ru: Флаги размера (Size Flags)
uk: Прапорці розміру (Size Flags)
zh_cn: 大小标志
zh_tw: Size Flags：大小標誌

source: Margin
cs: Margin (Okraj)
de: Margin (Außenabstand)
fr: Marge
it: Margine
ja: マージン
ko: 마진(Margin)
pt_br: Margem (Margin)
ru: Отступ (Margin)
uk: Поле
zh_cn: 边距
zh_tw: Margin：外邊距

source: The optional UI theme
cs: Volitelné téma uživatelského rozhraní (UI)
de: Das optionale Benutzeroberflächen-Thema
fr: Le thème optionnel de l'interface utilisateur
it: Il tema di UI opzionale
ja: オプションのUIテーマ
ko: 선택적인 UI 테마
pt_br: O tema opcional da interface do usuário (The optional UI theme)
ru: Настраиваемая тема пользовательского интерфейса (Theme)
uk: Налаштовувана тема призначеного для користувача інтерфейсу (Theme)
zh_cn: 可选的UI主题
zh_tw: 可選的 UI 主題

source: Once you understand the basics of the Control node, it will take you less time to learn all the nodes that derive from it.
cs: Jakmile pochopíte základy řídicího uzlu, rychleji pochopíte a ovládnete uzly na němn založené.
de: Wenn Sie die Grundlagen des Control-Nodes verstanden haben, wird es Sie weniger Zeit kosten all die Nodes zu erlernen die davon abstammen.
es: Una vez que hayas entendido los conceptos básicos del nodo Control, te llevará menos tiempo aprender todos los nodos que se derivan de él.
fr: Une fois que vous aurez compris les bases du nœud Control, il vous faudra moins de temps pour apprendre tous les nœuds qui en dérivent.
it: Una volta che capisci le basi del nodo Control, ci metterai meno tempo ad imparare tutti i nodi che derivano da esso.
ja: コントロールノードの基本を理解すると、そこから派生するすべてのノードを学習する時間が少なくなります。
ko: 일단 당신이 컨트롤 노드의 기초를 이해했다면, 노드에서 파생되는 모든 다른 노드들을 이해하는 데 오래 걸리지 않을 겁니다.
pt_br: Depois de entender os conceitos básicos do nó de Controle, você levará menos tempo para aprender todos os nós que derivam dele.
ru: Когда вы поймете основы узла Control, вам потребуется меньше времени для изучения всех производных от него узлов.
uk: Як тільки ви засвоїте основи вузла Control, вам знадобиться менше часу, для вивчення решти вузлів, які виходять за рамки них.
zh_cn: 一旦了解了 ``Control`` 节点的基础知识, 您将花费更少的时间来学习从其派生的所有节点.
zh_tw: 瞭解了 Control 節點的基礎後，以後學習其他從 Control 節點衍生而來的其他節點就能更快速。

source: The 5 most common UI elements
cs: 5 nejčastějších prvků uživatelského rozhraní
de: Die 5 häufigsten UI Elemente
es: Los 5 elementos más comunes de la UI
fr: Les 5 éléments les plus courants de l'interface utilisateur
it: I 5 elementi UI piú comuni
ja: 最も一般的な5つのUI要素
ko: 가장 일반적인 5개의 UI 요소들
pt_br: Os 5 elementos de interface do usuário mais comuns
ru: Пять наиболее распространенных элементов пользовательского интерфейса
uk: 5 найпоширеніших елементів інтерфейсу
zh_cn: 5个最常见的UI元素
zh_tw: 五個最常見的 UI 元素

source: Godot ships with dozens of Control nodes. A lot of them are here to help you build editor plugins and applications.
cs: Godot se dodává s desítkami řídících uzlů. Mnoho z nich je tady proto, aby vám pomohly vytvořit doplňky pro editor či přímo vlastní aplikace.
de: Godot wird mit dutzenden Control-Nodes geliefert. Viele von ihnen sind da, um Ihnen zu helfen Editor Plugins und Anwendungen zu erstellen.
es: Godot viene con docenas de nodos de control. Muchos de ellos están para ayudarte a construir plugins para el editor y plugins para tus aplicaciones.
fr: Godot propose des douzaines de nœuds Control. Beaucoup d'entre eux sont là pour vous aider à réaliser des plugins pour l'éditeur et des applications.
it: Godot viene fornito con dozzine di nodi di controllo. Molti di loro sono qui per aiutarti a costruire plugin dell'editor e applicazioni.
ja: Godotには多数のコントロールノードが付属しています。 それらの多くは、エディタプラグインやアプリケーションを構築するのを助けるために用意されています。
ko: Godot는 수십 개의 컨트롤 노드를 갖고 있습니다. 이들이 당신이 에디터 플러그인과 애플리케이션을 만드는 것을 도와줍니다.
pt_br: Godot vem com dezenas de nós de controle. Muitos deles estão aqui para ajudá-lo a criar plug-ins e aplicativos de editor.
ru: Godot поставляется с десятками узлов Control. Многие из них нужны для помощи в создании плагинов и приложений редактора.
uk: Godot поставляється з десятками вузлів Control. Багато з них тут для того, щоб допомогти вам створити плагіни та програми редактора.
zh_cn: Godot附带了数十个 ``Control`` 节点. 这里有很多插件可以帮助您构建编辑器插件和应用程序.
zh_tw: Godot 附帶了數十種 Control 節點。而其中許多節點都是用來讓你可以製作編輯器外掛與應用程式的。
