Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_introduction_to_the_ui_system.po
Languages: cs, de, es, fr, it, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: For most games, you'll only need five types of UI elements, and a few Containers. These five Control nodes are:
cs: Pro většinu her budete potřebovat pouze pět typů prvků uživatelského rozhraní a několik kontejnerů. Těchto pět řídících uzlů je:
de: Für die meisten Spiele benötigen Sie nur fünf Arten von UI Elementen und ein paar Container. Diese fünf Control-Nodes sind:
es: Para la mayoría de los juegos, solo necesitaras cinco tipos de elementos de interfaz, y algunos contenedores. Estos elementos son:
fr: Pour la plupart des jeux, vous n'aurez besoin que de cinq types d'éléments d'interface utilisateur, et de quelques Containers. Ces cinq nœuds Control sont :
it: Per la maggior parte dei giochi, avrai bisogno solo di cinque tipi di elementi UI, e alcuni Container. Questi cinque nodi Control sono:
ja: ほとんどのゲームでは、必要なUI要素は5種類で、コンテナは多くありません。5つのコントロールノードは次のとおりです:
ko: 대부분의 게임에, 당신은 오로지 다섯 가지 UI 요소와, 몇 개의 컨테이너들만 필요합니다. 컨트롤 노드들은 이렇습니다:
pt_br: Para a maioria dos jogos, você só precisará de cinco tipos de elementos de interface do usuário e alguns contêineres. Esses cinco nós de controle são:
ru: Для большинства игр вам понадобится всего пять типов элементов пользовательского интерфейса и несколько контейнеров. Вот пять узлов Control:
uk: Для більшості ігор вам знадобиться лише п'ять типів інтерфейсу користувача. Ось ці п'ять вузлів Control:
zh_cn: 对于大多数游戏, 您只需要五种类型的UI元素和一些容器. 这五个 ``Control`` 节点是:
zh_tw: 對於大多數的遊戲來說，只會需要五種 UI 元素以及少數幾個 Container。這五個 Control 節點為：

source: Label: for displaying text
cs: Label: pro zobrazení textu
de: Label: um Text darzustellen
es: Etiqueta (Label): Para mostrar texto
fr: Label : pour afficher du texte
it: Etichetta: per mostrare del testo
ja: Label: テキストを表示する
ko: Label: 문자를 보여주기 위해 사용합니다
pt_br: Label: para exibir texto
ru: Label: для отображения текста
uk: Label (Мітка): для відображення тексту
zh_cn: ``Label``: 用于显示文本
zh_tw: Label：標籤，用來顯示文字

source: TextureRect: used mostly for backgrounds, or everything that should be a static image
cs: TextureRect: používá se většinou na pozadí nebo na všechno, co by mělo být statickým obrázkem
de: TextureRect: hauptsächlich für Hintergründe oder statische Bilder
es: TextureRect: Usado principalmente para fondos, o todo lo que debería ser una imagen estática
fr: TextureRect : utilisé principalement pour les arrière-plans, ou tout ce qui doit être une image statique
it: TextureRect: usato per lo piú per gli sfondi, o qualsiasi cosa che dovrebbe essere un immagine statica
ja: TextureRect: 背景、または静止画像であるべきものすべてに主に使用
ko: TextureRect: 보통은 배경으로 사용되고, 그 외 모든 정적 이미지에 사용합니다
pt_br: TextureRect: usado principalmente para fundos, ou tudo o que deveria ser uma imagem estática
ru: TextureRect: используется в основном для заднего плана или всего, что должно быть статическим изображением
uk: TextureRect (Квадрат текстури): використовується в основному для фонів, або всього, що має статичне зображення
zh_cn: ``TextureRect``: 主要用于背景, 或应为静态图像的所有内容
zh_tw: TextureRect：紋理貼圖矩形，通常用來作背景，或是其他顯示靜態圖片的地方

source: TextureProgress: for lifebars, loading bars, horizontal, vertical or radial
cs: TextureProgress: pro ukazatele života, ukazatele průběhu, svislé, vodorovné nebo kruhové
de: TextureProgress: für Lebensanzeigen, Ladebalken, horizontal, vertikal oder radial
es: TextureProgress: para barras de vida, barras de cargas. Pueden ser horizontales, verticales o radiales
fr: TextureProgress : pour les barres de vie, les barres de chargement, horizontales, verticales ou radiales
it: TextureProgress: per barre della vita, barre di caricamento, orizzontali, verticali o radiali
ja: TextureProgress: ライフバー、ロードバー、水平、垂直または放射状のものに
ko: TextureProgress: 체력 막대, 로딩 막대, 가로 형태, 세로 형태, 혹은 방사 형태에 사용합니다
pt_br: TextureProgress: para barras de vida, barras de carregamento, horizontais, verticais ou radiais
ru: TextureProgress: для полос здоровья, загрузки, горизонтальных, вертикальных или радиальных
uk: TextureProgress: для смужок життя, завантаження, горизонтальних, вертикальних, або радіальних
zh_cn: ``TextureProgress``: 适用于生命条, 进度条, 水平杆, 垂直杆或径向杆
zh_tw: TextureProgress：紋理貼圖進度條，用於血槽、載入進度條，可以是任何水平、垂直、或放射性的

source: NinePatchRect: for scalable panels
cs: NinePatchRect: pro škálovatelné panely
de: NinePatchRect: für skalierbare Paneele
es: NinePatchRect: para paneles escalables
fr: NinePatchRect : pour des panneaux redimensionnables
it: NinePatchRect: per pannelli scalabili
ja: NinePatchRect: スケーラブルなパネル用
ko: NinePatchRect: 확장 가능한 패널에 사용합니다
pt_br: NinePatchRect: para painéis escalonáveis
ru: NinePatchRect: для масштабируемых панелей
uk: NinePatchRect: для масштабованих панелей
zh_cn: ``NinePatchRect``: 可缩放面板
zh_tw: NinePatchRect：9-Patch 矩形，用於可縮放的面板

source: TextureButton: to create buttons
cs: TextureButton: pro vytvoření tlačítek
de: TextureButton: um Schaltflächen zu erstellen
es: TextureButton: para crear botones con texturas
fr: TextureButton : pour créer des boutons
it: TextureButton: per creare pulsanti
ja: TextureButton: ボタンを作成するため
ko: TextureButton: 버튼을 만들기 위해 사용합니다
pt_br: TextureButton: para criar botões
ru: TextureButton: для создания кнопок
uk: TextureButton: для створення кнопок
zh_cn: ``TextureButton``: 用于创建按钮
zh_tw: TextureButton：紋理貼圖按鈕，用於製作按鈕

source: The 5 most common Control nodes for UI design
cs: 5 nejběžnějších řídících uzlů pro návrh uživatelského rozhraní
de: Die 5 häufigsten Control-Nodes für UI Design
es: Los 5 nodos de control mas comunes para el diseño de interfaces de usuario
fr: Les 5 nœuds Control les plus courants pour la conception de l'interface utilisateur
it: I 5 nodi Control piú comuni per disegnare una Interfaccia Utente
ja: UI設計の最も一般的な5つのコントロールノード
ko: UI 디자인을 위한 5개의 가장 일반적인 컨트롤 노드들
pt_br: Os 5 nós de controle mais comuns para o design da interface do usuário
ru: Пять наиболее распространенных узлов контроля для дизайна пользовательского интерфейса
uk: 5 найпоширеніших вузлів управління для дизайну інтерфейсу
zh_cn: 用于UI设计的5个最常见的 ``Control`` 节点
zh_tw: 用於 UI 設計的五個最常見的 Control 節點

source: TextureRect
de: TextureRect (Textur-Rechteck)

source: **TextureRect** displays a texture or image inside a UI. It seems similar to the Sprite node, but it offers multiple scaling modes. Set the Stretch Mode property to change its behavior:
cs: **TextureRect** zobrazuje texturu nebo obrázek uvnitř uživatelského rozhraní. Zdá se podobný uzlu Sprite, ale nabízí několik režimů škálování. Pro jejich změnu nastavte vlastnost Stretch Mode:
de: **TextureRect** zeigt eine Textur oder ein Bild innerhalb einer Benutzeroberfläche an. Es scheint dem Sprite-Node ähnlich zu sein, bietet jedoch mehrere Skalierungsmodi. Lege die Stretch-Mode-Eigenschaft fest, um sein Verhalten zu ändern:
es: **TextureRect** muestra una textura o imagen dentro de una UI. Parece similar al nodo Sprite pero ofrece múltiples modos de escalado. Cambia la propiedad Stretch Mode para alterar su comportamiento:
fr: **TextureRect** affiche une texture ou une image à l'intérieur d'une interface utilisateur. Il ressemble au nœud Sprite mais il offre plusieurs modes de mise à l'échelle. Définissez la propriété Stretch Mode pour changer son comportement :
it: **TextureRect** mostra una texture o un'immagine dentro l'Interfaccia Utente. Sembra simile al nodo Sprite, ma offre molteplici modalitá di ridimensionamento. Imposta la proprietà Stretch Mode (Modalità di Stiramento) per cambiare il suo comportamento:
ja: **TextureRect** はテクスチャや画像をUI内に表示します。Spriteノードと同じように見えますが、しかし複数のスケーリング・モードが用意されています。Stretch Modeプロパティで以下のように動作を変更できます:
ko: **TextureRect** 은 UI 내에 텍스쳐나 이미지를 보여줍니다. 이것은 Sprite 노드와 비슷하지만 다중 크기 조절 모드를 제공합니다. Sprite 노드의 동작을 변경하려면 Stretch Mode 속성을 설정하세요:
ru: **TextureRect** отображает текстуру или изображение внутри пользовательского интерфейса. Он похож на узел Sprite, но предлагает несколько режимов масштабирования. Настройте свойство Stretch Mode, чтобы изменить его поведение:
uk: **TextureRect** відображає текстуру, або зображення, всередині інтерфейсу користувача. Він схожий на вузол Sprite (Спрайт), але пропонує кілька режимів масштабування. Режим масштабування можна змінити у властивості Stretch Mode (Режим розтягування):
zh_cn: **TextureRect** 在UI内显示纹理或图像. 它与Sprite节点类似, 但提供了多种缩放模式, 设置拉伸模式属性可改变其行为:
zh_tw: **TextureRect** 可以在 UI 中顯示紋理貼圖或圖片。看起來很像 Sprite 節點，但 TextureRect 提供了多種縮放模式。修改 Stretch Mode（拉伸模式）屬性即可更改行為：

source: ``Scale On Expand (compat)`` scales the texture to fit the node's bounding rectangle, only if ``expand`` property is ``true``; otherwise, it behaves like ``Keep`` mode. Default mode for backwards compatibility.
cs: ``Scale On Expand (compat)`` změní měřítko textury tak, aby se vešla do ohraničovacího obdélníku uzlu, pouze pokud je vlastnost ``expand`` ``true``; v opačném případě se chová jako režim ``Keep``. Výchozí režim pro zpětnou kompatibilitu.
de: ``Scale on Expand (compat)`` skaliert die Textur um sich an den Begrenzungsrahmen des Nodes anzupassen, allerdings nur wenn die ``expand`` Eigenschaft ``true`` ist; ansonsten verhält es sich wie der ``Keep`` Modus. Dem Standardmodus für Abwärtskompatibilität.
es: ``Scale On Expand (compat)`` escala la textura para que se ajuste al rectángulo delimitador del nodo, sólo si la propiedad ``expand`` es ``true``; de lo contrario, se comporta como el modo ``Keep``. Modo predeterminado para compatibilidad con versiones anteriores.
fr: ``Scale On Expand (compat)`` met à l'échelle la texture afin de s'ajuster au rectangle englobant le nœud, seulement si la propriété ``expand`` est égale à ``true`` ; sinon, le comportement est le même que le mode ``Keep`` qui est le mode par défaut pour des raisons de rétro-compatibilité.
it: ``Scale On Expand (compat)`` scala la texture per adattarsi al rettangolo di delimitazione del nodo solo se la proprietà ``expand`` è ``true``; altrimenti, si comporta come la modalità ``Keep``. Modalità predefinita per la compatibilità all'indietro.
ja: ``Scale On Expand (compat)`` は、\ ``Expand``プロパティがオンのときにのみテクスチャを長方形の境界まで拡縮します。それ以外では ``Keep`` モードと同じ動作をします。後方互換のため、これがデフォルトのモードになっています。
ru: ``Scale On Expand (Compat)`` масштабирует текстуру в соответствии с ограничивающим прямоугольником узла, только если свойство ``expand`` имеет значение ``true``; в противном случае оно ведет себя, как в режиме ``Keep``. Режим по умолчанию для обратной совместимости.
uk: ``Scale On Expand (compat)`` масштабує текстуру, щоб відповідати обмежувальному прямокутнику вузла, лише якщо властивість ``expand`` є ``true``; в іншому випадку він поводиться як в режимі ``Keep``. Режим за замовчуванням для зворотної сумісності.
zh_cn: ``扩展缩放(兼容)(Scale On Expand (compat))`` 仅当 ``expand`` 属性为 ``true`` 时, 缩放纹理以适合节点的边界矩形； 否则, 其行为类似于 ``保持(Keep)`` 模式. 默认模式用于向后兼容.
zh_tw: ``Scale On Expand (compat)`` ：延展時縮放（相容），僅當 ``expand`` 屬性設為 ``true`` 時將紋理貼圖縮放至符合節點的邊界矩形。其餘情況則與 ``Keep`` 模式行為相同。為向下相容性，該模式為預設。

source: ``Scale`` scales the texture to fit the node's bounding rectangle.
cs: ``Scale`` upraví texturu tak, aby odpovídala ohraničujícímu obdélníku uzlu.
de: ``Scale`` skaliert die Textur, um sich dem Begrenzungsrahmen des Nodes anzupassen.
es: ``Scale`` escala la textura para que se ajuste al rectángulo delimitador del nodo.
fr: ``Scale`` met à l'échelle la texture afin de s'ajuster au rectangle englobant le nœud.
it: ```Scale``` scala la texture per adattarsi al rettangolo di delimitazione del nodo.
ja: ``Scale`` は、テクスチャを長方形の境界に合わせて拡縮します。
ru: ``Scale`` масштабирует текстуру в соответствии с ограничивающим прямоугольником узла.
uk: ``Scale`` масштабує текстуру, щоб відповідати обмежувальному прямокутнику вузла.
zh_cn: ``缩放(Scale)`` 缩放纹理以适应节点的边界矩形.
zh_tw: ``Scale`` ：縮放，將紋理貼圖縮放至節點的邊界矩形。

source: ``Tile`` makes the texture repeat, but it won't scale.
cs: ``Tile`` způsobí opakování textury, ale nezmění měřítko.
de: ``Tile`` wiederholt die Textur, sie wird allerdings nicht skaliert.
es: ``Tile`` hace que la textura se repita, pero no escalará.
fr: ``Tile`` permet à la texture de se répéter, mais ne se mettra pas à l'échelle.
it: ``Tile`` ripete la texture, ma non la scala.
ja: ``Tile`` は、拡縮させる代わりに、テクスチャを繰り返して並べます。
ru: ``Tile`` повторяет текстуру, но не масштабирует.
uk: ``Tile`` повторює текстуру, але не масштабує.
zh_cn: ``平铺(Tile)`` 使纹理重复出现, 但不会缩放.
zh_tw: ``Tile`` ：平鋪，重複紋理貼圖，但不進行縮放。

source: ``Keep`` and ``Keep Centered`` force the texture to remain at its original size, in the top left corner or the center of the frame respectively.
cs: ``Keep`` a ``Keep centrered`` ponechá texturu v původní velikosti, v levém horním rohu, respektive středu rámu.
de: ``Keep`` und ``Keep Centered`` zwingt die Textur ihre ursprüngliche Größe beizubehalten und platziert sie in der linken oberen Ecke bzw. in der Mitte des Rahmens.
es: ``Keep`` y ``Keep Centered`` fuerzan a mantener la textura en su tamaño original, en la esquina superior izquierda o en el centro del marco respectivamente.
fr: ``Keep`` et ``Keep Centered`` force la texture à garder sa taille d'origine, dans le coin supérieur gauche ou au centre du cadre respectivement.
it: ``Keep`` e ``Keep Centered`` forza la texture a mantenere la sua dimensione originale, rispettivamente nell'angolo in alto a sinistra e nel centro del frame.
ja: ``Keep`` と ``Keep Centered`` は、強制的にテクスチャを本来のサイズのままにし、前者はフレームの左上に、後者は中央に表示します。
ru: ``Keep`` и ``Keep Centered`` заставляют текстуру оставаться в исходном размере в левом верхнем углу или в центре кадра соответственно.
uk: ``Keep`` і ``Keep Centered`` змушує текстуру залишатися у своєму початковому розмірі в лівому верхньому кутку, або по центру кадра.
zh_cn: ``保持(Keep)`` 和 ``保持居中(Keep Centered)`` 强制纹理保持其原始大小, 分别位于框架的左上角或中心.
zh_tw: ``Keep`` 與 ``Keep Centered`` ：保持與保持居中，強制紋理貼圖保持原始大小，分別置於框架的左上角或中間。

source: ``Keep Aspect`` and ``Keep Aspect Centered`` scales the texture but force it to remain its original aspect ratio, in the top left corner or the center of the frame respectively.
cs: ``Keep Aspect`` a ``Keep Aspect Centered`` upraví měřítko textury, ale vynutí, aby zůstal zachován původní poměr stran, v levém horním rohu, respektive středu rámu.
de: ``Keep Aspect`` und ``Keep Aspect Centered`` skaliert die Textur, aber erzwingen das originale Seitenverhältnis und platziert sie in der linken oberen Ecke bzw. in der Mitte des Rahmens.
es: ``Keep Aspect`` y ``Keep Aspect Centered`` escalan la textura pero la fuerzan a mantener su relación de aspecto original, en la esquina superior izquierda o en el centro del marco, respectivamente.
fr: ``Keep Aspect`` et ``Keep Aspect Centered`` met à l'échelle la texture mais la force à garder le rapport hauteur/largeur d'origine, dans le coin supérieur gauche ou au centre du cadre respectivement.
it: ``Keep Aspect`` e ``Keep Aspect Centered`` scala la texture ma la forza a mantenere il rapporto di aspetto originale, rispettivamente nell'angolo in alto a sinistra e nel centro del frame.
ja: ``Keep Aspect`` と ``Keep Aspect Centered`` は、テクスチャを拡縮しますが、しかし元のアスペクト比は保ったままにします。前者はフレームの左上、後者は中央に表示されます。
ru: ``Keep Aspect`` и ``Keep Aspect Centered`` масштабируют текстуру, но заставляют ее сохранять исходное соотношение сторон в левом верхнем углу или в центре кадра соответственно.
uk: ``Keep Aspect`` і ``Keep Aspect Centered`` масштабує текстуру, але змушує її залишати початкове співвідношення сторін у верхньому лівому куті, або в центрі кадру.
zh_cn: ``保持纵横比(Keep Aspect)`` 和 ``保持纵横比居中(Keep Aspect Centered)`` 可缩放纹理, 但会强制其保持其原始纵横比, 分别位于框架的左上角或中心.
zh_tw: ``Keep Aspect`` 與 ``Keep Aspect Centered`` ：保持長寬比與居中保持長寬比，將紋理貼圖縮放但強制其維持原始的長寬比，分別置於框架的左上角或中間。

source: ``Keep Aspect Covered`` works just like ``Keep Aspect Centered`` but the shorter side fits the bounding rectangle and the other one clips to the node's limits.
cs: ``Keep Aspect Covered`` funguje stejně jako ``Keep Aspect Centered`` ', ale kratší strana odpovídá ohraničujícímu obdélníku a delší je připnuta k ohraničení uzlu.
de: ``Keep Aspect Covered`` funktioniert genau wie ``Keep Aspect Centered`` allerdings wird die kürzere Seite in den Begrenzungsrahmen eingepasst und die längere an der Node-Begrenzung abgeschnitten.
es: ``Keep Aspect Covered`` funciona igual que ``Keep Aspect Centered`` pero el lado más corto se ajusta al rectángulo delimitador y el otro a los límites del nodo.
fr: ``Keep Aspect Covered`` fonctionne comme ``Keep Aspect Centered`` mais le côté le plus court s'étend jusqu'au rectangle de délimitation et le côté le plus long est coupé aux limites du nœud.
it: ``Keep Aspect Covered`` funziona proprio come ``Keep Aspect Centered``, ma il lato più corto si adatta al rettangolo di delimitazione e l'altro si aggancia ai limiti del nodo.
ja: ``Keep Aspect Covered`` は ``Keep Aspect Centered`` と同じように動作しますが、しかし余白の部分を境界線に合わせる一方、はみ出た部分は除いて表示します。
ru: ``Keep Aspect Covered`` работает так же, как ``Keep Aspect Centered``, но более короткая сторона совпадает с ограничивающим прямоугольником, а другая отсекается границами узла.
uk: ``Keep Aspect Covered`` працює так само як ``Keep Aspect Centered``але коротша сторона поєднується з обмежувальним прямокутником, а інша відсікається межами вузла.
zh_cn: ``保持纵横比覆盖(Keep Aspect Covered)`` 的工作方式与 ``保持纵横比居中`` 的一样, 但较短的一侧适合边界矩形, 而另一侧则裁剪到节点的极限.
zh_tw: ``Keep Aspect Covered`` ：保持長寬比覆蓋，行為與 ``Keep Aspect Centered`` 相同，但短邊會配合邊界矩形，另一邊則會超出節點邊界並剪裁掉。

source: As with Sprite nodes, you can modulate the TextureRect's color. Click the ``Modulate`` property and use the color picker.
cs: Stejně jako u Sprite uzlů můžete modulovat barvu TextureRect. Klikněte na vlastnost ``Modulate`` a použijte výběr barvy.
de: Wie mit Sprite Nodes können Sie die Farbe des TextureRect modulieren. Klicken Sie auf die ``Modulate`` Eigenschaft und verwende die Farbpipette.
es: Al igual que con los nodos Sprite, puedes modular el color de la TextureRect. Haz clic en la propiedad ``Modulate`` y utiliza el selector de colores.
fr: Comme pour les nœuds Sprite, vous pouvez moduler la couleur du nœud TextureRect. Cliquez sur la propriété ``Modulate`` et utilisez le sélecteur de couleur.
ja: Spriteノードと同じく、TextureRectの色は調節できます。\ ``Modulate`` プロパティをクリックして、カラーピッカーを使用してください。
ko: Sprite 노드와 마찬가지로, 당신은 TextureRect의 색상을 바꿀 수 있습니다. ``Modulate`` 속성을 눌러 색상 선택기를 사용하세요.
ru: Как и в случае с узлами Sprite, вы можете модулировать цвет TextureRect. Щелкните свойство ``Modulate`` и используйте средство выбора цвета.
uk: Як і у вузлах Sprite, ви можете модулювати колір TextureRect. Клацніть на властивість ``Modulate`` та скористайтесь інструментом вибору кольору.
zh_cn: 与 ``Sprite`` 节点一样, 您可以调制 ``TextureRect`` 的颜色. 点击 ``Modulate(调制)`` 属性并使用颜色选择器.
zh_tw: 與 Sprite 節點一樣，TextureRect 的顏色也可以調整。點擊 ``Modulate`` （調變）屬性後使用色彩選擇器。

source: TextureRect modulated with a red color
cs: TextureRect modulovaný červenou barvou
de: TextureRect moduliert mit einer roten Farbe
es: TextureRect modulado con un color rojo
fr: TextureRect modulé par la couleur rouge
it: TextureRect modulato con un colore rosso
ja: 赤で変調されたTextureRect
ko: 빨강 색으로 바뀐 TextureRect
pt_br: TextureRect modulado com uma cor vermelha
ru: TextureRect модулирован красным цветом
uk: TextureRect модульований червоним кольором
zh_cn: 用红色调制的 ``TextureRect``
zh_tw: 使用紅色調變的 TextureRect

source: TextureButton
de: TextureButton (Textur-Knopf)
zh_cn: 纹理按钮(TextureButton)

source: **TextureButton** is like TextureRect, except it has 6 texture slots: one for each of the button's states. Most of the time, you'll use the Normal, Pressed, and Hover textures. Focused is useful if your interface listens to the keyboard's input. The sixth image slot, the Click Mask, lets you define the clickable area using a 1-bit, pure black and white image.
cs: **TextureButton** je jako TextureRect, kromě toho, že má 5 slotů na texturu: jeden pro každý ze stavů tlačítka. Většinou budete používat textury Normal, Pressed a Hover. Focused je užitečné, pokud vaše rozhraní poslouchá vstup z klávesnice. Šestý slot obrázku, Click Mask, umožňuje definovat oblast, na kterou lze kliknout, pomocí jednobitového čistě černobílého obrazu.
de: **TextureButton** ist wie TextureRect, außer dass er 5 Textur Slots hat: einen für jeden Button Status. Meistens werden Sie die Texturen Normal, Pressed und Hover verwenden. Focused ist hilfreich wenn Ihre Benutzeroberfläche Tasteneingaben erwartet. Der sechste Textur Slot, die Click Mask, lässt Sie mithilfe eines 1-bit Schwarz-Weiß Bildes die anklickbare Fläche definieren.
es: **TextureButton** es como TextureRect, excepto que tiene 6 ranuras de textura: una para cada uno de los estados del botón. La mayor parte del tiempo, usted usará las texturas Normal, Pressed y Hover. Focused es útil si tu interfaz escucha la entrada del teclado. La sexta ranura de imagen, la Máscara de Clic, te permite definir el área en la que se puede hacer clic utilizando una imagen totalmente en blanco y negro de 1 bit.
ja: **TextureButton** はTextureRectに似ていますが、ボタンの状態ごとにテクスチャスロットが6つある点が異なります。ほとんどの場合、Normal、Pressed、Hoverの各テクスチャを使用します。 Focusedは、インターフェイスがキーボードの入力を待つときに役立ちます。 6番目の画像スロットであるクリックマスクでは、1ビットの純粋な白黒画像を使用してクリック可能な領域を定義できます。
ru: **TextureButton** похож на TextureRect, за исключением того, что он имеет 6 слотов для текстур: по одному для каждого состояния кнопки. В большинстве случаев вы будете использовать текстуры Normal (нормальное состояние), Pressed (нажатое) и Hover (при наведении). Focused (сфокусированное) полезно, если ваш интерфейс принимает ввод с клавиатуры. Шестой слот изображения, Click Mask (маска клика), позволяет определить доступную для клика область, используя 1-битное изображение, состоящее только из черного и белого цветов.
uk: **TextureButton** схожий на TextureRect, за винятком того, що він має для текстур 5 гнізд : по одному для кожного стану кнопки. Більшу частину часу ви будете використовувати гнізда Normal (нормальний), Pressed (натиснутий), і Hover (наведений курсор). Focused корисно, якщо ваш інтерфейс прослуховує введення клавіатури. Шостий слот зображення, Click Mask (маска клацання), дозволяє визначити область для натискання, використовуючи 2-бітне, чисте чорно-біле зображення.
zh_cn: **纹理按钮** (TextureButton)类似于纹理矩形(TextureRect), 只不过它有6个纹理槽: 每个纹理槽对应一个按钮的状态. 大多数时候, 会使用Normal(普通), Pressed(按下)和Hover(悬停)纹理.Focused(聚焦)适用于监听键盘输入的界面.Click Mask(点击遮罩)允许你使用1位的纯黑白图片定义可点击区域.
zh_tw: **TextureButton** 類似 TextureRect，不同的地方是 TextureButton 有六個紋理貼圖欄位，每個按鈕的狀態都有一個貼圖。大多數情況下，會使用到 Normal (正常)、Pressed (按下) 與 Hover (懸停) 的貼圖。Focused (聚焦) 適用於會監聽鍵盤事件的界面。第六個圖片欄位為 Click Mask (點擊遮色片)，可使用 1-Bit 的純黑白圖片來定義可點擊的區域。
