Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_introduction_to_the_ui_system.po
Languages: cs, de, es, fr, it, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: In the Base Button section, you'll find a few checkboxes that change how the button behaves. When ``Toggle Mode`` is on, the button will toggle between active and normal states when you press it. ``Disabled`` makes it disabled by default, in which case it will use the ``Disabled`` texture. TextureButton shares a few properties with the texture frame: it has a ``modulate`` property, to change its color, and ``Resize`` and ``Stretch`` modes to change its scale behavior.
cs: V části Base Button najdete několik zaškrtávacích políček, která mění chování tlačítka. Když je zapnut ``Toggle Mode``, stiskuní tlačítka způsobuje přechod mezi aktivním a normálním stavem. ``Disabled`` implicitně deaktivuje, v takovém případě použije texturu ``Disabled``. TextureButton sdílí několik vlastností s rámečkem textury: má vlastnost ``Modulate`` pro změnu barvy a režimy ``Resize`` a ``Stretch`` pro změnu škálování.
de: In der Button Sektion finden Sie einige Check-boxen die das Verhalten der Buttons verändern. Wenn der ``Toggle Mode`` aktiv ist, wechselt der Button zwischen den Modi active und normal. ``Disabled`` deaktiviert den Button standardmäßig und zeigt die ``Disabled`` Textur an. TextureButton teilt einige Eigenschaften mit dem TextureFrame: er hat eine ``modulate`` Eigenschaft, um seine Farbe zu ändern, sowie ``Resize`` und ``Stretch`` Modi um sein skalierungs Verhalten zu ändern.
es: En la sección del Botón Base, encontrará algunas casillas de verificación que cambian el comportamiento del botón. Cuando `` Toggle Mode`` está activado, el botón alternará entre los estados activo y normal cuando lo presione. `` Disabled`` lo desactiva por defecto, en cuyo caso usará la textura `` Disabled``. TextureButton comparte algunas propiedades con el marco de textura: tiene una propiedad `` modulate``, para cambiar su color, y `` Resize`` y `` Stretch`` para cambiar su comportamiento de escala.
fr: Dans la section Bouton de base, vous trouverez quelques cases à cocher qui modifient le comportement du bouton. Lorsque l'option ``Toggle Mode`` est activée, le bouton bascule entre l'état actif et l'état normal lorsque vous appuyez dessus. ``Disabled`` le désactive par défaut, auquel cas il utilisera la texture ``Disabled``. TextureButton partage quelques propriétés avec le cadre de texture : il a une propriété ``modulate``, pour changer sa couleur, et les modes ``Resize`` et ``Stretch`` pour changer son comportement d'échelle.
ja: Base Buttonセクションには、ボタンの動作を変更するチェックボックスがいくつかあります。 ``Toggle Mode`` がオンの場合、ボタンを押すとアクティブ状態と通常状態が切り替わります。 ``Disabled`` を選択すると、デフォルトで無効になります。この場合、 ``Disabled`` テクスチャが使用されます。TextureButtonには、テクスチャフレームと共通するプロパティがいくつかあります。 ``modulate`` プロパティを使用してカラーを変更したり、 ``Resize`` および ``Stretch`` モードを使用してスケール動作を変更したりできます。
ko: Base Button 섹션에서, 당신은 버튼이 행동하는 법을 바꾸는 몇 가지 체크 상자를 볼 수 있을 겁니다. ``Toggle Mode`` 가 켜지면, 버튼은 당신이 눌렀을 때 활성화와 기본 상태를 껏다 켯다 할 것입니다. ``Disabled`` 는 버튼을 기본 상태로 만들고, 이 경우에 ``Disabled`` 텍스쳐를 사용합니다. TextureButton은 앞의 노드와 몇 가지 속성들을 공유합니다: ``modulate`` 속성을 갖고 있어서, 색상을 바꿀 수 있고, ``Resize`` 와 ``Stretch`` 모드로 크기의 변화를 바꿀 수 있습니다.
pt_br: Na seção Base Button, você encontrará algumas caixas de seleção que mudam como o botão se comporta. Quando o ``Toggle Mode`` está ativado, o botão alternará entre os estados ativo e normal quando você pressioná-lo. O ``Disabled`` faz com que seja desabilitado por padrão, caso em que usará a textura ``Disabled``. O TextureButton compartilha algumas propriedades com o quadro de textura: ele tem uma propriedade ``modulate``, para alterar sua cor, e os modos ``Resize`` e ``Stretch`` para alterar seu comportamento de escala.
ru: В разделе Base Button вы найдете несколько флажков, которые изменяют поведение кнопки. Когда ``Toggle Mode`` включен, кнопка при нажатии будет переключаться между активным и нормальным состояниями. ``Disabled`` делает ее отключенной по умолчанию — в этом случае она будет использовать текстуру ``Disabled``. TextureButton имеет несколько общих свойств с рамкой текстуры: у него есть свойство ``Modulate`` для изменения цвета и режимы ``Resize`` и ``Stretch`` для изменения его поведения масштабирования.
uk: У розділі Base Button (Основи кнопки) ви знайдете кілька прапорців, які змінюють поведінку кнопки. Коли ``Toggle Mode`` увімкнено, кнопка буде переключатися між активним та нормальним станами при натисканні. ``Disabled`` робить його відключеним за замовчуванням, і в цьому випадку він буде використовувати текстуру ``Disabled``. TextureButton ділиться кількома властивостями з кадром текстури: вона має властивість ``modulate`` для зміни кольору, а також режими ``Resize`` і ``Stretch`` для зміни поведінки масштабування.
zh_cn: 在 ``基本按钮(Base Button)`` 部分中, 您会发现一些复选框可以更改按钮的行为. 当 ``切换模式(Toggle Mode)`` 开启时, 当您按下该按钮时, 它将在活动状态和正常状态之间切换.``禁用(Disabled)`` 会让它默认被禁用, 在这种情况下, 它会使用 ``禁用(Disabled)`` 纹理.``纹理按钮(TextureButton)`` 与纹理框架共享一些属性: 它具有 ``Modulate(调制)`` 属性以更改其颜色, 并具有 ``调整大小(Resize)`` 和 ``拉伸(Stretch)`` 模式以更改其缩放行为.
zh_tw: 在 Base Button 的部分有幾個勾選框可以改變按鈕的行為。當開啟 ``Toggle Mode`` （切換模式）時，點擊按鈕時會在啟用 (Active) 與正常 (Normal) 狀態間切換。 ``Disabled`` （禁用）會讓按鈕在預設時禁用，這時候會使用 ``Disabled`` 紋理貼圖。TextureButton 也有一些與紋理框架相同的屬性： ``Modulate`` （調變）屬性可更改色彩， ``Resize`` （調整大小）與 ``Stretch`` （伸縮）模式可以更改其縮放的行為。

source: TextureButton and its 5 texture slots
cs: TextureButton a jeho 5 slotů pro textury
de: TextureButton und seine 5 Textur Slots
es: TextureButton y sus 5 ranuras de textura
fr: Un TextureButton et ses 5 emplacements à texture
it: TextureButton e i suoi 5 slot di consistenza
ja: TextureButtonとその5つのテクスチャスロット
ko: TextureButton과 5개의 텍스쳐 슬롯
pt_br: TextureButton e seus 5 slots de textura
ru: TextureButton и его 5 слотов текстуры
uk: TextureButton і його 5 гнізд текстури
zh_cn: ``TextureButton`` 及其5个纹理插槽
zh_tw: TextureButton 與其五個紋理貼圖欄位

source: TextureProgress
de: TextureProgress (Texturfortschritt)

source: **TextureProgress** layers up to 3 sprites to create a progress bar. The Under and Over textures sandwich the Progress one, which displays the bar's value.
cs: **TextureProgress** vrství až 3 textury pro vytvoření ukazatele průběhu. Textury Under and Over zapouzdřují texturu Progress, která zobrazuje hodnotu pruběhu.
de: **TextureProgress** stapelt bis zu 3 Sprite Ebenen um einen Fortschrittsbalken zu erstellen. Die Under und Over Texturen nehmen die Progress Textur in ihre Mitte, wo der Wert des Balkens angezeigt wird.
es: **TextureProgress** permite crear una barra de progreso con hasta 3 sprites. Las texturas Under, Over se intercalan con Progress, que muestra el contenido de la barra.
fr: **TextureProgress** empile jusqu'à 3 sprites pour créer une barre de progression. Les textures Under et Over prennent en sandwich la texture Progress, qui affiche la valeur de la barre.
it: ** TextureProgress ** consente di creare una barra di avanzamento con un massimo di 3 sprite. Le trame Under, Over sono intervallate da Progress, che mostra il contenuto della barra.
ja: **TextureProgress**\ は、最大3つのスプライトをレイヤ化してプログレスバーを作成します。UnderテクスチャとOverテクスチャはProgressテクスチャを挟んでおり、バーの値を表示します。
ko: **TextureProgress** 는 진행 막대를 만들기 위해 3개의 스프라이트로 층을 쌓습니다. Under와 Over 텍스쳐 사이에 막대의 값을 보여줄 Progress를 끼워 넣습니다.
pt_br: Camadas **TextureProgress** usam até 3 sprites para criar uma barra de progresso. As texturas Under e Over se encaixam entre a de Progress, que exibe o valor da barra.
ru: **TextureProgress** накладывает до 3 слоев спрайтов для создания шкалы прогресса. Текстуры Under (нижняя) и Over (верхняя) сэндвичем прокладывают между собой текстуру Progress (прогресса), которая отображает значение шкалы.
uk: **TextureProgress** накладається шарами до 3 спрайтів для створення панелі прогресу. Текстури Under і Over утворюють бутерброд всередині якого текстура Progress, яка відображає значення смужки.
zh_cn: **TextureProgress** 最多可以将3个精灵分层来创建一个进度条.Under和Over纹理将Progress纹理夹在中间, 显示进度条的数值.
zh_tw: **TextureProgress** 可使用最多三個圖層的 Sprite 來建立進度條。 Under 與 Over 紋理貼圖中間夾著顯示進度條數值的 Progress 貼圖。

source: The ``Mode`` property controls the direction in which the bar grows: horizontally, vertically, or radially. If you set it to radial, the ``Initial Angle`` and ``Fill Degrees`` properties let you limit the range of the gauge.
cs: Vlastnost ``Mode`` řídí směr, ve kterém pruh roste: horizontally (vodorovně), vertically (svisle) nebo radially (radiálně). Pokud ji nastavíte na radiální, vlastnosti ``Initial Angle`` a ``Fill Degrees`` vám umožní omezit rozsah měřidla.
de: Die ``Mode`` Eigenschaft kontrolliert in welche Richtung der Balken wächst: Horizontal, Vertikal oder Radial. Setzen Sie sie auf Radial, lassen Sie die ``Initial Angle`` und ``Fill Degrees`` Eigenschaften die Reichweite der Spur begrenzen.
es: La propiedad ``Mode`` controla la dirección en la que la barra crece: horizontal, vertical o radial. Si lo ajustas a radial, las propiedades ``Initial Angle`` y ``Fill Degrees`` te permiten limitar el rango del medidor.
fr: La propriété ``Mode`` contrôle la direction dans laquelle la barre se développe : horizontalement, verticalement ou radialement. Si vous la réglez sur radial, les propriétés ``Initial Angle`` et ``Fill Degrees`` vous permettent de limiter la plage de valeurs de la jauge.
it: La proprietà `` Mode '' controlla la direzione in cui cresce la barra: orizzontale, verticale o radiale. Se lo si imposta su radiale, le proprietà `` Initial Angle'' e `` Fill Degrees '' consentono di limitare l'intervallo del misuratore.
ja: ``Mode`` プロパティは、バーが伸びる方向 (水平、垂直、または放射状) を制御します。radialに設定すると、 ``Initial Angle`` と ``Fill Degrees`` プロパティでゲージの範囲を制限できます。
ko: ``Mode`` 속성은 어느 방향으로 막대가 자라게 할지 제어합니다: 수평, 수직 아니면 방사형으로 말입니다. 방사형으로 설정하면, ``Initial Angle`` 과 ``Fill Degrees`` 속성으로 당신은 게이지의 범위를 제한할 수 있습니다.
pt_br: A propriedade ``Mode`` controla a direção na qual a barra cresce: horizontalmente, verticalmente ou radialmente. Se você defini-lo como radial, as propriedades ``Initial Angle`` e ``Fill Degrees`` permitem limitar o intervalo do medidor.
ru: Свойство ``Mode`` контролирует направление, в котором растет шкала прогресса: горизонтально, вертикально или радиально. Если вы установите его на радиальное, то свойства ``Initial Angle`` и ``Fill Degrees`` позволят вам ограничить диапазон датчика.
uk: ``Mode`` керує напрямком, в якому росте шкала: по горизонталі, по вертикалі, або в радіальному напрямку. Якщо встановити його на радіальне, властивості ``Initial Angle`` та ``Fill Degrees`` дозволяють обмежити діапазон заповнення.
zh_cn: ``模式(Mode)`` 属性控制进度条的增长方向: 水平, 垂直或径向. 如果将其设置为径向, 则可以使用 ``初始角度(Initial Angle)`` 和 ``填充度(Fill Degrees)`` 属性来限制量规的范围.
zh_tw: ``Mode`` 屬性可以控制進度條的方向：水平、垂直、或放射狀。若設為放射狀，則可使用 ``Initial Angle`` （初始角度）與 ``Fill Degress`` （填充角度）來限制放射的範圍。

source: To animate the bar, you'll want to look at the Range section. Set the ``Min`` and ``Max`` properties to define the range of the gauge. For instance, to represent a character's life, you'll want to set ``Min`` to ``0,`` and ``Max`` to the character's maximum life. Change the ``Value`` property to update the bar. If you leave the ``Min`` and ``Max`` values to the default of ``0`` and ``100,`` and set the ``Value`` property to ``40``, 40% of the ``Progress`` texture will show up, and 60% of it will stay hidden.
cs: Chcete-li lištu animovat, budete se chtít podívat na sekci Range. Nastavte vlastnosti ``Min`` a ``Max`` pro definování rozsahu měřidla. Například pro zobrazení života postavy přepište ``Min`` na ``0,`` a ``Max`` na maximální život postavy. Změňte vlastnost ``Value`` a aktualizujte panel. Pokud ponecháte hodnoty ``Min`` a ``Max`` na výchozích hodnotách ``0`` a ``100,`` a nastavíte vlastnost ``Value`` na ``40``, 40% textury ``Progress`` se objeví a 60% z toho zůstane skryté.
de: Um den Balken zu animieren, werfen Sie einen Blick auf die "Range" Sektion. Setzen Sie die ``Min`` und ``Max`` Eigenschaften um die Länge der Skala zu definieren. Um Beispielsweise einen Lebensbalken darzustellen, sollen Sie ``Min`` auf ``0,`` und ``Max`` auf die maximalen Leben des Charakters setzen. Ändern Sie die ``Value`` Eigenschaft um den Balken zu aktualisieren. Wenn Sie ``Min`` und ``Max`` auf ihren Werten ``1`` und ``100`` lassen und ``Value`` auf den Wert ``40`` stellen, werden 40% der ``Progress`` Textur angezeigt und 60% bleiben verborgen.
es: Para animar la barra, deberías ver la sección Range. Ajusta las propiedades ``Min`` y ``Max`` para establecer el rango del medidor. Por ejemplo, para representar la vida de un personaje, debes poner ``Min`` a ``0`` y ``Max`` a la máxima vida del personaje. Cambia la propiedad ``Value`` para actualizar la barra. Si dejas los valores ``Min`` y ``Max`` en los valores por defecto de ``0`` y ``100`` y estableces la propiedad ``Value`` en ``40``, se mostrará el 40 % de la textura ``Progress`` y el 60 % permanecerá oculto.
fr: Pour animer la barre, allez voir du coté de la section Range. Réglez les propriétés ``Min`` et ``Max`` pour définir la plage de valeurs de la jauge. Par exemple, pour représenter la vie d'un personnage, vous régleriez ``Min`` sur ``0,`` et ``Max`` sur la vie maximale du personnage. Changez la propriété ``Value`` pour mettre à jour la barre. Si vous laissez les valeurs ``Min`` et ``Max`` à la valeur par défaut de ``1`` et ``100,`` et mettez la propriété ``Value`` à ``40``, 40% de la texture ``Progress`` apparaîtra, et 60% restera caché.
it: Per animare la barra, dovresti vedere la sezione Intervallo. Regola le proprietà `` Min '' e `` Max`` per impostare l'intervallo del misuratore. Ad esempio, per rappresentare la vita di un personaggio, devi impostare `` Min`` su `` 0 '' e `` Max`` sulla vita massima del personaggio. Cambia la proprietà `` Value`` per aggiornare la barra. Se si lasciano i valori `` Min`` e `` Max`` nei valori predefiniti di `` 0`` e `` 100 '' e si imposta la proprietà `` Value`` su `` 40``, il Verrà visualizzato il 40% della trama `` Progress`` e il 60% rimarrà nascosto.
ja: バーをアニメーションさせるには、Rangeセクションを見る必要があるでしょう。 ゲージの範囲を定めるために、\ ``Min`` と ``Max`` プロパティを設定してください。例えば、キャラクターのライフを表するためには、\ ``Min`` を ``0,`` に、そして ``Max`` をキャラクターの最大のライフに設定する必要があるでしょう。 バーを更新するためには、\ ``Value`` プロパティ変更してください。もし ``Min`` と ``Max`` を それぞれデフォルトの ``0`` と ``100,`` に、そして ``Value`` プロパティを ``40`` にしたならば、 40%の ``Progress`` テクスチャが現れ、残りの60%は隠れたままになります。
ru: Чтобы анимировать шкалу, вам стоит взглянуть на раздел Range. Настройте свойства ``Min`` и ``Max`` для определения диапазона датчика. Например, чтобы изобразить жизнь персонажа, вам стоит установить ``Min`` на ``0``, а ``Max`` на максимальное количество жизни персонажа. Изменяйте свойство ``Value`` для обновления шкалы. Если вы оставите значения ``Min`` и ``Max`` по умолчанию на ``0`` и ``100`` и установите свойство ``Value`` на ``40``, то покажется 40% текстуры ``Progress``, а 60% останутся скрытыми.
uk: Щоб анімувати шкалу, вам потрібно заглянути в розділ Range (Діапазон). Встановіть ``Min`` і ``Max`` властивості, щоб визначити діапазон шкали. Наприклад, щоб представити життя персонажа, вам варто встановити ``Min`` в ``0``, і ``Max`` на максимальне життя персонажа. Змініть властивість ``Value`` для оновлення шкали. Якщо залишити ``Min`` і ``Max`` значення за замовчуванням ``0`` і ``100``, та встановіть властивість ``Value`` на ``40``, то 40% від текстури ``Progress`` буде відображатися, а 60% буде залишатися прихованою.
zh_cn: 要动画化进度条, 您需要查看 ``Range`` 部分. 设置 ``Min`` 和 ``Max`` 属性来定义量规的范围. 例如, 要表示角色的生命, 您需要将 ``Min`` 设置为 ``0``, 将 ``Max`` 设置为角色的最大生命. 更改 ``Value`` 属性以更新进度条. 如果将 ``Min`` 和 ``Max`` 的值设置为 ``0`` 和 ``100`` 的默认值, 并将 ``Value`` 属性设置为 ``40``,``Progress`` 纹理的40%会显示,60%会隐藏.
zh_tw: 若要在進度條中使用動畫，可使用 Range 下的屬性。 ``Min`` 與 ``Max`` 屬性可用來定義進度條的範圍。舉例來說，角色的血槽可以設定 ``Min`` 為 0，而 ``Max`` 則根據角色的最大生命來設定。更改 ``Value`` 屬性即可更新進度條。若將 ``Min`` 與 ``Max`` 設為預設的 ``0`` 與 ``100`` ，則將 ``Value`` 屬性設為 ``40`` ，則將顯示 40% 的 ``Progress`` 紋理貼圖，剩下 60% 保持不顯示。

source: TextureProgress bar, two thirds filled
cs: Pruh TextureProgress, vyplněné dvě třetiny
de: TextureProgress Balken, zwei drittel gefüllt
es: Barra TextureProgress, dos tercios rellenados
fr: Barre TextureProgress, remplie aux deux tiers
it: Barra TextureProgress, riempita per due terzi
ja: TextureProgressバー、3分の2が塗りつぶされました
ko: 3분의 2가 채워진 TextureProgress 막대
pt_br: Barra TextureProgress, dois terços preenchidos
ru: Шкала TextureProgress, заполнено на две трети
uk: TextureProgress шкала, заповнена на дві третіх
zh_cn: ``TextureProgress`` 条, 三分之二填充
zh_tw: TextureProgress 進度條，填滿三分之二

source: **Label** prints text to the screen. You'll find all its properties in the Label section, in the Inspector. Write the text in the ``Text`` property, and check Autowrap if you want it to respect the textbox's size. If Autowrap is off, you won't be able to scale the node. You can align the text horizontally and vertically with Align and Valign, respectively.
cs: **Label** vytiskne text na obrazovku. Všechny jeho vlastnosti najdete v sekci Label v Inspektoru. Napište text do vlastnosti ``Text`` a zaškrtněte Autowrap, pokud chcete respektovat velikost textového pole. Pokud je Autowrap vypnutý, nebudete moci změnit měřítko uzlu. Text můžete zarovnat vodorovně a svisle s Align a Valign.
de: **Label** gibt Text an den Monitor aus. Sie finden all seine Eigenschaften in der Label Sektion, im Inspektor. Schreiben Sie den Text in die ``Text`` Eigenschaft und aktivieren Autowrap wenn Sie möchten das die Größe der Textbox vom Text bestimmt wird. Wenn Autowrap nicht aktiv ist, können Sie diesen Node nicht skalieren. Sie können den Text horizontal und vertikal mit Hilfe von Align, respektive Valign einrücken.
es: **Label** imprime texto en la pantalla. Encontrarás todas sus propiedades en la sección Label, en el Inspector. Escribe el texto en la propiedad ``Text`` y selecciona Autowrap si quieres que respete el tamaño del cuadro de texto. Si Autowrap está desactivado, no podrás escalar el nodo. Puedes alinear el texto horizontal y verticalmente con Align y Valign respectivamente.
fr: Un **Label** affiche du texte à l'écran. Vous trouverez toutes ses propriétés dans la section Label, dans l'Inspecteur. Ecrivez le texte dans la propriété ``Text``, et cochez Autowrap si vous voulez qu'il respecte la taille de la zone de texte. Si la fonction Autowrap est désactivée, vous ne pourrez pas mettre à l'échelle le nœud. Vous pouvez aligner le texte horizontalement et verticalement avec Align et Valign respectivement.
it: ** Label ** stampa il testo sullo schermo. Troverai tutte le sue proprietà nella sezione Etichetta, nell'Inspector. Digita il testo nella proprietà `` Text '' e seleziona Autowrap se desideri che rispetti le dimensioni della casella di testo. Se Autowrap è disabilitato, non sarà possibile ridimensionare il nodo. È possibile allineare il testo in orizzontale e in verticale rispettivamente con Allinea e Allinea.
ja: **Label** はスクリーンにテキストを表示します。インスペクタのLabelセクションで全てのプロパティを確認できるでしょう。\ ``Text`` プロパティでテキストを書き、もしテキストボックスの大きさを重視しないならAutowrapにチェックを入れてください。もし Autowrapがオフのとき、ノードを拡大することはできないでしょう。AlignとValignを用いることでそれぞれ横方向と縦方向に整列させることができます。
ko: **Label** 은 문자를 화면에 출력합니다. 당신은 이것의 모든 속성을 인스펙터의 Label 섹션에서 찾으실 수 있습니다. ``Text`` 속성에서 문자를 쓰고, 텍스트 상자의 크기에 맞추어 자동줄바꿈을 하여 글자가 표시되기를 원한다면 Autowrap을 체크하세요. Autowrap이 체크가 풀려있으면, 노드의 크기를 조절할 수 없습니다. 당신은 Align과 Valign을 사용해서 문자를 가로와 세로로 정렬할 수 있습니다.
ru: **Label** выводит текст на экран. Все его свойства вы найдете в разделе Label, в Инспекторе. Напишите текст в свойстве ``Text`` и проверьте значение свойства Autowrap, если вы хотите, чтобы он соответствовал размеру текстового поля. Если Autowrap выключен, вы не сможете изменять масштаб узла. Вы можете выровнять текст горизонтально и вертикально при помощи свойств Align и Valing соответственно.
uk: **Label** друкує текст на екрані. Ви знайдете всі його властивості в розділі Label (Мітка), в Інспекторі. Введіть текст у властивість ``Text`` та встановіть прапорець Autowrap, якщо ви хочете, щоб вона відповідала розміру текстового поля. Якщо Autowrap вимкнено, ви не зможете масштабувати вузол. Ви можете вирівняти текст по горизонталі та по вертикалі у властивостях Align та Valign.
zh_cn: **标签** 打印文本到屏幕. 您可以在检查器的标签部分中找到其所有属性. 将文本写入 ``Text`` 属性中, 然后检查自动换行是否要遵守文本框的大小, 如果禁用自动包裹, 则将无法缩放节点. 您可以分别使用Align和Valign将文本水平和垂直对齐.
zh_tw: **Label** 將文字顯示在畫面上。所有的屬性都列屬性面板中的 Label 段落下。文字可寫在 ``Text`` 屬性裡，而若要依據文字框的大小來調整，則可勾選 Autowrap（自動斷行）。若關閉 Autowrap，則將無法縮放節點。可以使用 Align（對齊）與 Valign（垂直對齊）屬性來調整文字在垂直與水平方向的對齊方法。

source: Picture of a Label
cs: Obrázek uzlu typu Label
de: Bild eines Labels
es: Imagen de un Label
fr: Image d'un Label
ja: ラベルの画像
ko: Label의 사진
pt_br: Imagem de um Label
ru: Изображение Label
uk: Зображення Label (мітки)
zh_cn: ``Label`` 图片
zh_tw: Label 的圖片

source: NinePatchRect
de: NinePatchRect (Rechteck)
zh_cn: 九宫格纹理(NinePatchRect)

source: **NinePatchRect** takes a texture split in 3 rows and 3 columns. The center and the sides tile when you scale the texture, but it never scales the corners. It is useful to build panels, dialog boxes and scalable backgrounds for your UI.
cs: **NinePatchRect** provede rozdělení textury do 3 řádků a 3 sloupců. Při změně měřítka textury se změní střed a dlaždice po stranách ale nikdy se nezmění rohy. Je užitečný pro vytváření panelů, dialogových oken a škálovatelného pozadí pro vaše uživatelské rozhraní.
de: **NinePatchRect** teilt eine Textur in 3 Reihen und Spalten. Die Mitte und die Seiten werden gekachelt wenn Sie die Textur skalieren, es skaliert jedoch niemals die Ecken. Hilfreich um Paneele, Dialogboxen und skalierbare Hintergründe für Ihre Benutzeroberfläche zu entwerfen.
es: **NinePatchRect** toma una textura dividida en 3 filas y 3 columnas. Alinea los centros y los lados de la textura pero mantiene el tamaño original de las esquinas. Es útil para construir paneles, cuadros de diálogo y fondos escalables para su UI.
fr: **NinePatchRect** prend une texture divisée en 3 lignes et 3 colonnes. La tuile du centre et celles des côtés se dupliquent lorsque vous mettez à l'échelle la texture, celles des coins ne sont jamais dupliquées. Il est utile pour créer des panneaux, des boîtes de dialogue et des arrière-plans flexible pour votre interface utilisateur.
ja: **NinePatchRect** は3行と3列に分割されたテクスチャを受け取ります。 中央と横のタイルは拡大されますが、隅のタイルは拡大されません。パネルやダイアログボックスや拡大可能なUI用の背景を作るさいに便利です。
ko: **NinePatchRect** 텍스쳐를 3행과 3열로 분할합니다. 중앙과 가장자리는 텍스쳐의 크기에 맞추어지지만, 모서리 부분은 크기가 바뀌지 않습니다. 이것은 패널이나 대화 상자, UI에서 크기 조절이 가능한 배경을 만들 때 유용합니다.
ru: **NinePatchRect** разделяет текстуру на 3 строки и 3 столбца. Центральная и боковые плитки масштабируют текустуру, а углы — никогда. Полезно создавать панели, диалоговые окна и масштабируемые фоны для вашего пользовательского интерфейса.
uk: **NinePatchRect** ділить плитку текстури на 3 рядки та 3 стовпці. Центр і боки плитки масштабуються, а кути ні. Це корисно для створення панелей, діалогових вікон та масштабованих фонів для вашого інтерфейсу.
zh_cn: **NinePatchRect** 将纹理分割成3行和3列. 缩放纹理时, 中心和侧面会平铺, 但不会缩放角落. 为UI构建面板, 对话框和可伸缩的背景非常有用.
zh_tw: **NinePatchRect`` 將紋理貼圖分隔成三行三列。中間與側面的貼圖會在縮放貼圖時平鋪，而角落的貼圖則不會被縮放。適合用來製作 UI 中的面板、對話框、與可伸縮的背景。

source: NinePatchRect scaled with the min\_size property
cs: Měřítko NinePatchRect se škálovalo vlastností min\ _size
de: NinePatchRect skaliert mit der min\_size Eigenschaft
es: NinePatchRect escalado con la propiedad min\_size
fr: NinePatchRect mis à l'échelle avec la propriété min\_size
it: NinePatchRect scalato con la proprietà min \ _size
ja: \ min\_sizeプロパティでスケーリングされたNinePatchRect
ko: min\_size 속성으로 조절된 NinePatchRect
pt_br: NinePatchRect dimensionado com a propriedade min\_size
ru: NinePatchRect отмасштабирован с использованием свойства min\ _size
uk: NinePatchRect масштабується за допомогою властивості min\_size
zh_cn: ``NinePatchRect`` 使用 ``min_size`` 属性缩放
zh_tw: 使用 min\_size 屬性縮放的 NinePatchRect
