Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_introduction_to_the_ui_system.po
Languages: cs, de, es, fr, it, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: You'll need some practice to understand the size tags, as their effect can change quite a bit depending on how you set up your interface.
cs: Budete potřebovat určitou praxi, abyste porozuměli značkám velikosti, protože jejich vliv se může nepatrně lišit v závislosti na tom, jak vytvoříte své rozhraní.
de: Sie werden etwas Übung brauchen um die Größen Einstellungen zu verstehen, da ihr Effekt ziemlich stark variieren kann, je nachdem wie Sie Ihre Benutzeroberfläche gestalten.
es: Necesitarás algo de práctica para entender los size tags, ya que su efecto puede cambiar bastante dependiendo de cómo configures tu interfaz.
fr: Vous aurez besoin d'un peu de pratique pour comprendre les balises de taille, car leur effet peut assez varier en fonction de la façon dont vous configurez votre interface.
ja: サイズタグの効果はインターフェイスの設定方法によって大きく異なるため、サイズタグを理解するにはある程度の練習が必要です。
ko: 당신이 사이즈 태그를 이해하려면 몇 번의 연습이 필요할 겁니다, 왜냐하면 당신이 인터페이스를 만드는 방식에 따라서 결과가 많이 달라지기 때문입니다.
pt_br: Você precisará de alguma prática para entender as tags de tamanho, já que o efeito delas pode mudar um pouco dependendo de como você configura sua interface.
ru: Вам потребуется некоторая практика, чтобы понять размерные теги, насколько сильно их эффект может меняться в зависимости от того, как вы настроили свой интерфейс.
uk: Вам знадобиться певна практика, щоб зрозуміти теги розмірів, оскільки їх ефект може змінитися досить сильно, залежно від налаштування інтерфейсу.
zh_cn: 您需要进行一些练习来理解大小标签, 因为它们的效果可能会根据您设置界面的方式而发生很大变化.
zh_tw: 要瞭解大小旗標需要一些練習，因為設定大小旗標的效果會根據設定界面方式的不同而有很大的不同。

source: Arrange control nodes automatically with containers
cs: Automatické uspořádání řídicích uzlů pomocí kontejnerů
de: Arrangiere Control Nodes automatisch mit Containern
es: Disposición automática de los nodos de control con contenedores
fr: Arrangez automatiquement les nœuds de contrôle avec les conteneurs
it: Disponi i nodi Control automaticamente con i container
ja: コンテナを使用してコントロールノードを自動配置する
ko: 컨테이너에 컨트롤 노드를 자동으로 배열하기
pt_br: Organize nós de controle automaticamente com contêineres
ru: Автоматическая организация управляющих узлов с контейнерами
uk: Автоматична організація вузлів контролю з контейнерами
zh_cn: 使用容器自动排列控制节点
zh_tw: 使用 Container 來自動排列 Control 節點

source: Containers automatically arrange all children Control nodes including other containers in rows, columns, and more. Use them to add padding around your interface or center nodes in their bounding rectangles. All built-in containers update in the editor, so you can see the effect instantly.
cs: Kontejnery automaticky uspořádají všechny podřízené řídicí uzly včetně dalších kontejnerů do řádků, sloupců či jinak. Použijte je k přidání výplně kolem rozhraní nebo středových uzlů v jejich ohraničujících obdélnících. Všechny vestavěné kontejnery se v editoru aktualizují, takže efekt můžete vidět okamžitě.
de: Container ordnen automatisch alle untergeordneten Control Nodes einschließlich anderer Container in Zeilen, Spalten und mehr an. Benutzen Sie sie um Polster um Ihre Oberfläche zu legen, oder zentrieren Nodes in ihrem Begrenzungsrechteck. Alle eingebauten Container aktualisieren im Editor, Sie können den Effekt also sofort sehen.
es: Los Containers organizan automáticamente todos los nodos de Control de los hijos, incluyendo otros contenedores en filas, columnas y más. Utilízalos para añadir relleno alrededor de tu interfaz o nodos centrales en sus rectángulos delimitadores. Todos los Containers incorporados se actualizan en el editor para que pueda ver el efecto instantáneamente.
fr: Les conteneurs rangent automatiquement tous les nœuds de contrôle enfants, y compris les autres conteneurs en rangées, colonnes et plus encore. Utilisez-les pour ajouter de l'espace autour de votre interface ou des nœuds centraux dans leurs rectangles de délimitation. Tous les conteneurs intégrés sont mis à jour dans l'éditeur pour que vous puissiez voir l'effet instantanément.
ja: コンテナは、子になったコントロールノード(他のコンテナも可)をすべて、自動的に縦や横などに並べます。インターフェースの周りにパディングを追加したり、ノードを四角形の中央に配置するのに使えます。組み込みのコンテナは、すべてエディタの中で更新されるので、すぐに反映された結果を見ることができます。
ko: 컨테이너는 자동으로 모든 자식 컨트롤 노드와 자식 컨테이너들을 열이나 행이나 그 밖의 형태로 배열합니다. 컨테이너를 사용해서 이것의 경계 사각형 내에서 인터페이스나 중심 노드 주위에 패딩을 추가합니다. 모든 내장 컨테이너는 에디터 내에서 업데이트 되므로 컨테이너가 작동되는 것을 바로 확인하실 수 있습니다.
ru: Контейнеры автоматически организовывают всех потомков управляющих узлов, заключая другие контейнеры в строки, столбцы и прочее. Используйте их, чтобы добавить отступы вокруг вашего интерфейса или центральных узлов в их ограничивающих прямоугольниках. Все встроенные контейнеры обновятся в редакторе так, что вы увидите эффект мгновенно.
uk: Контейнери автоматично упорядковують усі контрольні вузли-нащадки, включаючи інші контейнери в рядках, стовпцях тощо. Використовуйте їх, щоб додати відступи навколо вашого інтерфейсу, чи центральних вузлів у їх обмежувальних прямокутниках. Усі вбудовані контейнери оновлюються в редакторі, так що ви можете бачити ефект миттєво.
zh_cn: 容器会自动排列所有子控件节点, 包括行, 列等中的其他容器. 使用它们在边界矩形的界面或中心节点周围添加 ``填充(padding)``. 所有内置容器都会在编辑器中更新, 因此您可以立即看到效果.
zh_tw: Container 會自動以行列形式排列包含其他 Container 在內的所有子 Control 節點。使用 Container 節點來在界面周圍新增內邊距 (Padding) 或是用來將節點在定界框內置中。所有內建的 Container 都會在編輯器內更新，所以所有改動都會立即反映。

source: Containers have a few special properties to control how they arrange UI elements. To change them, navigate down to the Custom Constants section in the Inspector.
cs: Kontejnery mají několik speciálních vlastností, které řídí, jak uspořádavají podřízené prvky uživatelského rozhraní. Chcete-li je změnit, přejděte v Inspektoru dolů do části Custom constants.
de: Container haben einige spezielle Eigenschaften um zu kontrollieren wie Benutzeroberflächen Elemente arrangiert werden. Um sie zu ändern, navigiere nach unten zur Custom Constants Sektion im Inspektor.
es: Los Containers tienen algunas propiedades especiales para controlar la forma en que organizan los elementos de la interfaz de usuario. Para cambiarlas, ve a la sección Custom Constants en el Inspector.
fr: Les conteneurs ont quelques propriétés spéciales pour contrôler la façon dont ils organisent les éléments de l'interface utilisateur. Pour les modifier, naviguez jusqu'à la section personnalisée Constants dans l'inspecteur.
ja: コンテナには、UI要素の配置方法を制御するための特別なプロパティがいくつかあります。変更するには、インスペクタのカスタム定数セクションに移動します。
ko: 컨테이너는 UI 요소들을 배열하는 방법을 제어하기 위한 일부 특별한 속성을 지닙니다. 컨테이너를 변화하기 위해, 인스펙터의 Custom Constants 섹션으로 갑시다.
pt_br: Os contêineres têm algumas propriedades especiais para controlar como eles organizam os elementos da interface do usuário. Para alterá-los, navegue até a seção Constantes personalizadas no Inspetor.
ru: Контейнеры имеют несколько специальных свойств, чтобы контролировать упорядочивание элементов пользовательского интерфейса. Чтобы изменить их, перейдите в раздел «Пользовательские константы» (Custom Constants) в Инспекторе.
uk: У контейнерів є кілька спеціальних властивостей для управління тим, як вони розташовують елементи інтерфейсу. Щоб змінити їх, перейдіть до розділу Custom Constants (Власні константи) в інспекторі.
zh_cn: 容器具有一些特殊的属性来控制它们如何排列UI元素. 要更改它们, 请导航至属性检查器中的 ``自定义常量`` 部分.
zh_tw: Container 有一些用來控制如何排列 UI 元素的特殊屬性。要修改這些屬性，請看到屬性面板中的 Custom Contants（自定常數）段落。

source: The 5 most useful containers
cs: 5 nejužitečnějších kontejnerů
de: Die 5 nützlichsten Container
es: Los 5 contenedores más útiles
fr: Les 5 conteneurs les plus utiles
it: I 5 container più utili
ja: 最も有用な5つのコンテナ
ko: 다섯 가지 가장 유용한 컨테이너들
pt_br: Os 5 contêineres mais úteis
ru: 5 наиболее полезных контейнеров
uk: 5 найкорисніших контейнерів
zh_cn: 5个最有用的容器
zh_tw: 五個最實用的 Container

source: If you build tools, you might need all of the containers. But for most games, a handful will be enough:
cs: Pokud vytváříte nástroje, možná budete potřebovat všechny kontejnery. Ale pro většinu her postačí jenom hrstka:
de: Wenn Sie Werkzeuge bauen, benötigen Sie möglicherweise alle Container. Für die meisten Spiele aber sind eine handvoll ausreichend:
es: Si construyes herramientas, es posible que necesites todos los containers. Pero para la mayoría de los juegos, unos cuantos serán suficientes:
fr: Si vous créez des outils, vous pourriez avoir besoin de tous les conteneurs. Mais pour la plupart des jeux, une poignée suffira :
it: Se fai delle applicazioni o tool, potresti avere bisogno di tutti i container. Ma per la maggior parte dei giochi, pochi sono necessari:
ja: ツールを構築する場合は、すべてのコンテナが必要になる場合があります。しかし、ほとんどのゲームでは、一握りで十分です:
ko: 당신이 도구를 제작하는 것이라면, 모든 컨테이너가 필요할 수도 있겠지만, 대부분의 게임들은, 이정도만 있어도 충분합니다:
pt_br: Se você criar ferramentas, poderá precisar de todos os contêineres. Mas para a maioria dos jogos, um punhado será suficiente:
ru: Если вы создаёте инструменты, то вам могут понадобиться все контейнеры. Но для большинства игр достаточно нескольких:
uk: Якщо ви створюєте інструменти, вам можуть знадобитися всі контейнери. Але для більшості ігор буде достатньо декількох:
zh_cn: 如果您构建工具, 您可能需要所有的容器. 但是对于大多数游戏来说, 只需几个就足够了:
zh_tw: 在製作工具的時候可能會需要用到所有的 Container。但大多數遊戲只需要其中幾種就夠了：

source: MarginContainer, to add margins around parts of the UI
de: MarginContainer, um Seitenränder um Teile der Benutzeroberfläche zu legen
ja: MarginContainerは、UIの一部の周囲に余白を追加します
uk: MarginContainer, щоб додати поля навколо частини інтерфейсу користувача
zh_cn: MarginContainer边缘容器, 以在部分UI周围添加边缘

source: CenterContainer, to center its children in its bounding box
cs: CenterContainer, vycentruje svoje podřízené uzly uprostřed svého obrysu
de: CenterContainer, um sein children im Begrenzungsrechteck zu zentrieren
es: CenterContainer, para centrar a sus hijos en su caja delimitadora
fr: CenterContainer, pour centrer ses enfants dans sa boîte de délimitation
it: CenterContainer, per centrare i figli nel suo box delimitatore
ja: CenterContainerは、その子を境界ボックスに中央に配置します
ko: CenterContainer, 경계 사각형 안에 자식을 중앙에 둠
pt_br: CenterContainer, para centralizar seus filhos em sua caixa delimitadora
ru: CenterContainer, центрирует своих детей в ограниченных рамках
uk: CenterContainer, центрує своїх нащадків у своїй обмежувальній коробці
zh_cn: ``CenterContainer``, 将其子项放在其边界框中
zh_tw: CenterContainer，置中容器，用來將子元素放在定界框中間

source: VboxContainer and HboxContainer, to arrange UI elements in rows or columns
cs: VboxContainer a HboxContainer uspořádá prvky uživatelského rozhraní do řádků nebo sloupců
de: VboxContainer und HboxContainer, um Benutzeroberflächen Elemente in Reihen oder Spalten zu arrangieren
es: VboxContainer y HboxContainer, para organizar los elementos de la UI en filas o columnas
fr: VboxContainer et HboxContainer, pour organiser les éléments de l'interface utilisateur en lignes ou en colonnes
it: VBoxContainer e HBoxContainer, per disporre elementi UI in righe o colonne
ja: VboxContainerおよびHboxContainer、行または列にUI要素を配置します
ko: VboxContainer와 HboxContainer, UI 요소들을 행이나 열로 배열함
pt_br: VboxContainer e HboxContainer, para organizar elementos da interface do usuário em linhas ou colunas
ru: VboxContainer and HboxContainer, чтобы упорядочить элементы пользовательского интерфейса в строках или столбцах
uk: VboxContainer і HboxContainer розташовують елементи інтерфейсу в рядках або стовпцях
zh_cn: ``VboxContainer`` 和 ``HboxContainer``, 用于在行或列中排列UI元素
zh_tw: VboxContainer 與 HboxContainer，垂直框容器與水平框容器，用來以行或列排列 UI 元素

source: GridContainer, to arrange Controls nodes in a grid-like pattern
cs: GridContainer, uspořádá řídicí uzly do mřížky
de: GridContainer, um Kontroll-Nodes in einem gitterartigen Muster anzuordnen
es: GridContainer, para ordenar los nodos de Control en un patrón similar al de una rejilla
fr: GridContainer, pour disposer les nœuds Control dans un motif en forme de grille
it: GridContainer, per disporre nodi Control in una griglia
ja: GridContainer、グリッドのようなパターンでコントロールノードを配置します
ko: GridContainer, 컨트롤 노드를 바둑판 같은 무늬로 배열함
pt_br: GridContainer, para organizar nós de controles em um padrão semelhante a uma grade
ru: GridContainer, упорядочивает узлы Controls в виде сетки
uk: GridContainer організовує вузли Control у вигляді сітки
zh_cn: ``GridContainer``, 以栅格状模式排列 ``Controls`` 节点
zh_tw: GridContainer，柵欄容器，用來以類似柵欄系統的方式排列 Control 節點

source: CenterContainer centers all its children inside of its bounding rectangle. It's one you typically use for title screens, if you want the options to stay in the center of the viewport. As it centers everything, you'll often want a single container nested inside it. If you use textures and buttons instead, they'll stack up.
cs: CenterContainer vystředí všechny podřízené uzly v rámci svého ohraničujícího obdélníku. Je to ten kontejner, který obvykle používáte pro titulní obrazovky, když chcete, aby položky zůstaly uprostřed. Protože vystředí všechno, budete do něho často chtít vnořit další kontejner. Pokud místo něho použijete textury a tlačítka, budou se hromadit.
de: CenterContainer zentriert alle children innerhalb des Begrenzungsrechtecks. Üblicherweise wird er für Titelbildschirme verwendet, wenn Sie möchten dass die Optionen in der Mitte des Ansichtsfensters bleiben. Da es alles zentriert, möchten Sie oft einen einzigen Container darin verschachtelt. Wenn Sie stattdessen Texturen und Buttons benutzt, stapeln sich diese.
es: CenterContainer centra a todos sus hijos dentro de su rectángulo delimitador. Por lo general, se utiliza para las pantallas de título, si quieres que las opciones permanezcan en el centro de la ventana. Como lo centra todo, a menudo querrás un solo container anidado dentro de él. Si usas texturas y botones en su lugar, se acumularán.
fr: CenterContainer centre tous ses enfants à l'intérieur de son rectangle délimitant. C'est celui que vous utilisez généralement pour les écrans de titre, si vous voulez que les options restent au centre de la fenêtre d'affichage. Comme il centre tout, vous aurez souvent besoin d'un seul conteneur imbriqué à l'intérieur. Si vous utilisez des textures et des boutons à la place, ils s'empileront.
ja: CenterContainerは、すべての子をバウンディング矩形の内側にセンタリングします。これはタイトルスクリーンにおいて、オプションをビューポートの中央に表示しておきたい場合によく使用する方法です。これはすべてを中央に配置してしまうため、多くの場合、もうひとつのコンテナを中にネストして配置したくなるでしょう。そうせずにテクスチャやボタンを使用すると、重なってしまいます。
ko: CenterContainer는 경계 사각형의 안에 모든 자식들을 가운데로 놓습니다. 이것은 당신이 뷰포트의 중앙에 있을 타이틀 화면에 일반적으로 사용합니다. 모든 것을 중앙에 두기 때문에, 내부에 하나의 컨테이너가 중첩되어 있어야 합니다. 대신 텍스쳐나 버튼을 놓는다면, 그들은 쌓일 것입니다.
pt_br: CenterContainer centraliza todos os seus filhos dentro de seu retângulo delimitador. É um que você costuma usar para telas de título, se você quiser que as opções permaneçam no centro da viewport. Como ele centraliza tudo, você geralmente deseja um único contêiner aninhado dentro dele. Se você usar texturas e botões, eles serão empilhados.
ru: CenterContainer центрирует все свои дочерние элементы внутри ограничивающего прямоугольника. Его типично используют для титульных экранов, если необходимо что бы опции оставались ровно посередине окна отображения. Поскольку он центрует все что в нем находится, вам часто потребуется добавлять в него вложенный контейнер. Если же вы используете текстуры и кнопки, то они будут стыковаться один над другим.
uk: CenterContainer зосереджує всіх своїх нащадків всередині свого обмежувального прямокутника. Його ви зазвичай використовуєте для титульних екранів, якщо ви хочете, щоб варіанти (опції) залишалися в центрі вікна перегляду. Оскільки він центрує все, вам часто потрібно буде мати один контейнер, вкладений всередині нього. Якщо ви замість цього використовуєте текстури та кнопки, вони будуть складатися в купу.
zh_cn: ``CenterContainer`` 将其所有子项居中于其边界矩形内. 如果希望这些选项停留在视图的中心, 通常使用它作为标题屏幕. 当它使所有内容居中时, 您通常会希望在其中嵌套一个容器. 如果改用纹理和按钮对象, 它们会堆积在一起.
zh_tw: CenterContainer 會將所有子節點置中與其定界框內。標題畫面通常會使用到這個容器，或是要將選項放在檢視區的中間時使用。CenterContainer 會將所有東西都置中，所以通常會在裡面嵌套另一個容器。若改用紋理貼圖或按鈕，則會堆疊在一起。

source: CenterContainer in action. The life bar centers inside its parent container.
cs: CenterContainer v akci. Ukazatel života je vystředěn uvnitř nadřazeného kontejneru.
de: CenterContainer in Aktion. Der Lebensbalken ist im parent Container zentriert.
es: CenterContainer en acción. La barra de vida se centra dentro de su container padre.
fr: CenterContainer en action. La barre de vie se centre à l'intérieur de son conteneur parent.
it: CenterContainer in azione. La barra della vita si centra all'interno del container padre.
ja: CenterContainerの使用例。ライフバーは、親コンテナの中央に配置されます。
ko: 실행 중인 CenterContainer. 체력 막대가 부모 컨테이너의 중앙에 있다.
pt_br: CenterContainer em ação. A barra de vida é centralizada dentro de seu contêiner pai.
ru: CenterContainer в действии. Шкала здоровья находится внутри его родительского контейнера.
uk: CenterContainer в дії. Шкала здоров'я знаходиться в центрі його батьківського контейнера.
zh_cn: ``CenterContainer`` 的作用. 生命条位于它的父容器内部.
zh_tw: 實際使用 CenterContainer 的例子。血槽放置於母容器中。

source: The MarginContainer adds a margin on any side of the child nodes. Add a MarginContainer that encompasses the entire viewport to add a separation between the edge of the window and the UI. You can set a margin on the top, left, right, or bottom side of the container. No need to tick the checkbox: click the corresponding value box and type any number. It will activate automatically.
cs: MarginContainer přidává okraj na libovolnou stranu podřízených uzlů. Přidejte MarginContainer, který obklopuje celý výřez pro oddělení okraje okna od zbytku uživatelského rozhraní. Okraj můžete nastavit na horní, levou, pravou nebo spodní stranu kontejneru. Zaškrtávací políčko není třeba zaškrtávat: stačí kliknout na odpovídající pole a zadat libovolné číslo. Vše se aktivuje automaticky.
de: Der MarginContainer fügt Seitenabstände zu beliebigen Seiten der child Nodes hinzu. Verwenden Sie einen MarginContainer der die gesamte Ansicht umschließt, um einen Abstand zwischen den Kanten des Fensters und der Benutzeroberfläche zu erhalten. Sie können einen Seitenrand oben, links, rechts oder unter am Container einstellen. Sie müssen die Checkbox nicht aktivieren, klicken Sie auf das jeweilige Wertefeld und tippen irgendeine Zahl ein. Die Aktivierung erfolgt automatisch.
es: El MarginContainer añade un margen en cualquier lado de los nodos hijos. Añade un MarginContainer que abarque toda la ventana para añadir una separación entre el borde de la ventana y la UI. Puedes establecer un margen en la parte superior, izquierda, derecha o inferior del container. No es necesario marcar la casilla de verificación: haz clic en la casilla de valor correspondiente y escribe cualquier número. Se activará automáticamente.
fr: Le MarginContainer ajoute une marge de n'importe quel côté des nœuds enfants. Ajoutez un MarginContainer qui englobe l'ensemble de la fenêtre pour ajouter une séparation entre le bord de la fenêtre et l'interface utilisateur. Vous pouvez définir une marge en haut, à gauche, à droite, ou en bas du conteneur. Pas besoin de cocher la case : cliquez sur le champ de valeur correspondant et tapez n'importe quel nombre. Il s'activera automatiquement.
ja: MarginContainerは、子ノードの任意の側に余白を追加します。ウィンドウの端とUIを分離させるには、ビューポート全体を囲むMarginContainerを追加します。コンテナには上、左、右、下の側に余白を設定できます。チェックボックスをさわる必要はありません: 対応する値ボックスをクリックし、任意の数を入力するだけで、自動的に有効になります。
ko: MarginContainer는 자식 노드의 사방에 여백을 추가합니다. 모든 뷰포트를 둘러싸는 MarginContainer를 추가하고 창과 UI의 가장자리 사이에 간격을 두세요. 당신은 컨테이너의 top, left, right, 아니면 bottom 방향에 여백을 설정할 수 있습니다. 체크박스는 건들지 않아도 됩니다: 해당하는 값의 상자를 선택하고 아무 숫자나 치세요. 자동으로 작동합니다.
pt_br: O MarginContainer adiciona uma margem em qualquer lado dos nós filhos. Adicione um MarginContainer que englobe toda a viewport para adicionar uma separação entre a borda da janela e a interface do usuário. Você pode definir uma margem no lado superior, esquerdo, direito ou inferior do contêiner. Não é necessário marcar a caixa de seleção: clique na caixa de valor correspondente e digite qualquer número. Ele será ativado automaticamente.
ru: MarginContainer добавляет отступ на любой стороне дочерних узлов. Добавьте MarginContainer, который охватывает весь видимый экран, чтобы добавить разделение между краем окна и UI. Вы можете установить отступ в верхней, левой, правой или нижней части контейнера. Не нужно отмечать этот флажок: щелкните соответствующее поле со значением и введите любое число. Он активируется автоматически.
uk: MarginContainer додає поле з будь-якої сторони вузлів-нащадків. Додайте MarginContainer, який охоплює все вікно перегляду, щоб додати розділення між краєм вікна та інтерфейсом користувача. Ви можете встановити поле у верхній, лівій, правій, або нижній частині контейнера. Не потрібно встановлювати галочку: натисніть відповідне поле та введіть будь-яке число. Він активується автоматично.
zh_cn: ``MarginContainer`` 在子节点的任何一侧添加一个边距. 添加一个包含整个视图的 ``MarginContainer``, 以在窗口边缘和UI之间添加分隔. 您可以在容器的顶部, 左侧, 右侧, 或底部设置边距. 无需勾选该复选框: 点击相应的值框并输入任何数字. 它会自动激活.
zh_tw: MarginContainer 會在子節點的每個邊都加上外邊距。新增一個圍繞整個檢視區的 MarginContainer 即可為視窗邊緣與 UI 之間加上空白。可以在容器的上右下左各個邊緣都加上外邊距。不需要勾選勾選框：只需點擊相應的數值輸入框並輸入任何數字，之後會自動啟用。

source: The MarginContainer adds a 40px margin around the Game User Interface
cs: MarginContainer přidává kolem herního uživatelského rozhraní okraj 40 pixelů
de: Der MarginContainer fügt einen 40px Seitenrand um die Benutzeroberfläche hinzu
es: El MarginContainer añade un margen de 40px alrededor de la UI del juego
fr: Le MarginContainer ajoute une marge de 40px autour de l'interface utilisateur du jeu
it: Il MarginContainer aggiunge un margine di 40px attorno alla GUI
ja: MarginContainer で、ゲームUIの周囲に 40ピクセルの余白を追加しています
ko: 게임 사용자 인터페이스 주변에 MarginContainer가 40px의 여백을 추가합니다
pt_br: O MarginContainer adiciona uma margem de 40px ao redor da interface do usuário do jogo
ru: MarginContainer добавляет 40-пиксельный отступу вокруг игрового пользовательского интерфейса(GUI)
uk: MarginContainer додає 40-піксельний відступ навколо ігрового інтерфейсу користувача
zh_cn: ``MarginContainer`` 在游戏用户界面周围添加了40px的边距
zh_tw: MarginContainer 在遊戲 UI 的周圍加上了 40px 的外邊距
