Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_introduction_to_the_ui_system.po
Languages: cs, de, es, fr, it, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Margins are relative to the anchor position, which is relative to the anchors. In practice, you'll often let the container update margins for you
cs: Okraje jsou relativní k pevné linii která je určena kotvami. V praxi často ponecháte na kontejneru, aby aktualizoval okraje za vás
de: Seitenränder sind relativ zur Anker Position, welche relativ zu den Ankern ist. In der Praxis werden Sie die Seitenränder häufig von Containern aktualisieren lassen
es: Los márgenes son relativos a la posición del ancla, que es relativa a los anclajes. En la práctica, a menudo dejarás que el container actualice los márgenes por ti
fr: Les marges sont relatives à la position de l'ancrage, ce qui est relatif aux ancrages. En pratique, vous allez laisser souvent le conteneur mettre à jour les marges pour vous
ja: 余白(Margin size)はアンカー位置(Anchor pin)に対して相対的であり、そしてアンカー位置もまた相対的です。実際には、余白の更新はコンテナに任せることが多くなるでしょう。
ko: 마진은 앵커 위치에 상대적이고, 앵커 위치는 앵커와 상대적입니다. 실제의 경우, 당신은 종종 컨테이너가 마진을 업데이트하도록 할 것입니다
pt_br: As margens são relativas à posição da âncora, que é relativa às âncoras. Na prática, muitas vezes você deixará o contêiner atualizar as margens para você
ru: Отступы относительны к позиции якоря, которая относительна якорям. На практике, вы зачастую позволяете контейнеру обновлять отступы за вас
uk: Поля відносно положення прив'язок, положення яких відносне контейнеру. На практиці ви часто дозволяєте контейнеру оновлювати поля для вас
zh_cn: 边距相对于相对于锚的锚位置. 在实践中, 您通常会让容器为您更新边距
zh_tw: 外邊距相對於錨點位置，而錨點位置則相對於錨點。在實務上通常會使用容器來更新邊距

source: Margins change with the anchor
cs: Okraje se mění s kotvou
de: Seitenränder ändern sich mit dem Anker
es: Los márgenes cambian con el anclaje
fr: Les marges changent avec l'ancrage
it: I margini cambiano con l'ancora
ja: アンカーによって余白が変化する
ko: 마진은 앵커가 변하면 같이 변합니다
pt_br: As margens mudam com a âncora
ru: Отступы изменяются вместе с якорем
uk: Поля змінюються разом з прив'язкою
zh_cn: 边距随锚而变化
zh_tw: 外邊距會跟著錨點變化

source: Margins update automatically when you move or resize a control node. They represent the distance from the control node's edges to its anchor, which is relative to the parent control node or container. That's why your control nodes should always be inside a container, as we'll see in a moment. If there's no parent, the margins will be relative to the node's own bounding Rectangle, set in the Rect section, in the inspector.
cs: Okraje se aktualizují automaticky, když přesunete nebo změníte velikost řídicího uzlu. Představují vzdálenost od okrajů řídicího uzlu k jeho kotvě, která je relativní k nadřazenému řídícímu uzlu nebo kontejneru. Proto by vaše řídicí uzly měly být vždy uvnitř kontejneru, jak uvidíme za chvíli. Pokud neexistuje žádný rodič, budou okraje relativní k vlastnímu ohraničujícímu obdélníku uzlu, nastavenému v Inspektoru v sekci Rekt.
de: Seitenränder werden automatisch aktualisiert, wenn Sie eine Control Node bewegen oder die Größe ändern. Sie repräsentieren die Distanz von der Kante der Control Node zu ihrem Anker, welcher relativ zu dem parent Container oder zur Control Node ist. Deshalb sollten Ihre Control Nodes immer in einem Container sein, wie wir gleich sehen werden. Wenn es kein parent gibt, verhalten sich die Seitenränder relativ zum Begrenzungsrechteck der Node, siehe Rect Sektion im Inspektor.
es: Los márgenes se actualizan automáticamente al mover o cambiar el tamaño de un nodo de control. Representan la distancia entre los bordes del nodo de control y su ancla, que es relativa al nodo de control padre o container. Por eso tus nodos de control deben estar siempre dentro de un container, como veremos en un momento. Si no hay un padre, los márgenes serán relativos al Rectangle delimitador del propio nodo, establecido en la sección Rect, en el inspector.
fr: Les marges se mettent à jour automatiquement lorsque vous déplacez ou redimensionnez un nœud de contrôle. Elles représentent la distance des bords du nœud de contrôle à son ancrage, qui est relatif au nœud de contrôle parent ou au conteneur. C'est pourquoi vos nœuds de contrôle devraient toujours se trouver à l'intérieur d'un conteneur, comme nous le verrons dans un instant. S'il n'y a pas de parent, les marges seront relatives au rectangle de délimitation du nœud, défini dans la section Rect, dans l'inspecteur.
it: I margini vengono aggiornati automaticamente quando si sposta o ridimensiona un nodo di controllo. Rappresentano la distanza tra i bordi del nodo di controllo e il suo ancoraggio, che è relativa al nodo di controllo padre o contenitore. Quindi i tuoi nodi di controllo devono essere sempre all'interno di un contenitore, come vedremo tra poco. Se non vi è parent, i margini saranno relativi al rettangolo di delimitazione del nodo stesso, impostato nella sezione Rect, nella finestra di ispezione.
ja: コントロールノードを移動またはサイズ変更すると、余白が自動的に更新されます。これらは、親のコントロールノードあるいはコンテナの端からアンカーまでの距離を表します。すぐに分かりますが、これがコントロール ノードを常にコンテナ内に配置するべき理由なのです。もし親がない場合、余白は、インスペクタのRectセクションで設定した、ノード独自の境界矩形に対して相対的になります。
ko: 컨트롤 노드를 움직이고 크기를 조정할 때 마진은 자동으로 업데이트 됩니다. 마진은 컨트롤 노드의 모서리에서 앵커까지의 거리를 나타내고, 앵커는 부모 컨트롤 노드나 컨테이너의 위치에 대해 상대적입니다. 이것이 우리가 곧 알게 될, 컨트롤 노드가 항상 컨테이너에 있는 이유입니다. 부모가 없다면, 마진은 인스펙터 내에 Rect 섹션에 설정된, 자신의 경계 사각형에 상대적으로 될 것입니다.
pt_br: As margens são atualizadas automaticamente quando você move ou redimensiona um nó de controle. Elas representam a distância entre as bordas do nó de controle e sua âncora, que é relativa ao nó ou contêiner de controle pai. É por isso que os nós de controle devem estar sempre dentro de um contêiner, como veremos daqui a pouco. Se não houver pai, as margens serão relativas ao Retângulo delimitador do próprio nó, definido na seção Rect, no inspetor.
ru: Отступы обновляются автоматически, когда вы перемещаете или изменяете размер управляющего узла. Они представляют собой расстояние от краёв управляющего узла до его якоря, который относителен родительскому управляющему узлу или контейнеру. Вот почему ваши управляющие узлы всегда должны быть внутри контейнера, что мы и увидим через мгновение. Если родитель отсутствует, то отступы будут относительны собственному ограничивающему прямоугольнику узла, установленному в разделе "Rect" в Инспекторе.
uk: Поля оновлюються автоматично під час переміщення чи зміни розміру контрольного вузла. Вони представляють собою відстань від країв контрольного вузла до його прив'язки, що відповідає предку вузла контроля, або контейнеру. Ось чому ваші контрольні вузли завжди повинні знаходитися всередині контейнера, як ми побачимо за мить. Якщо немає предків, поля будуть відповідні власному обмежувальному прямокутнику, встановленому в розділі Rect, у інспекторі.
zh_cn: 当您移动或调整控制节点的大小时, 边距会自动更新. 它们表示从控制节点的边缘到其锚点的距离, 该锚点是相对于父控制节点或容器的. 这就是为什么您的控制节点应始终位于容器内的原因, 我们稍后会看到. 如果没有父对象, 则边距将相对于属性检查器的矩形部分中设置的, 即节点自己的边界矩形.
zh_tw: 外邊距會自動在移動或縮放 Control 節點時更新。外邊距表示從節點邊緣至錨點的距離，錨點則相對於母 Control 節點或母 Container 節點。這就是為什麼應該要把 Control 節點放在 Container 內的原因，我們稍後會討論到這點。若沒有母節點時，外邊距會相對於節點自己的定界 Rectangle。該值設定於屬性面板中的 Rect 段落下。

source: Margins on a CenterContainer set to the "Full Rect" anchor
cs: Okraje proCenterContainer nastaveny na kotvu „Full Rect“
de: Seitenränder eines CenterContainers auf "Full Rect" Anker gesetzt
es: Márgenes en un CenterContainer fijado al ancla "Full Rect"
fr: Marges sur un CenterContainer réglé sur l'ancre "Full Rect"
it: I margini in un CenterContainer impostato sull'ancoraggio "Full Rect"
ja: 「Rect全面」アンカーで設定した CenterContainer の余白
ko: CenterContainer에 있는 "Full Rect" 앵커로 설정된 마진
pt_br: Margens em um CenterContainer definidas para a âncora "Full Rect"
ru: Отступы для CenterContainer установлены на якорь "Полный прямоугольник"
uk: Поля на контейнері CenterContainer встановлені на прив'язці "Повний прямокутник"
zh_cn: ``CenterContainer`` 上的边距设置为 ``Full Rect(填充矩形)`` 锚点
zh_tw: 在 CenterContainer 設定「 Full Rect 」錨點的外邊距

source: Try to change the anchors or nest your Control nodes inside Containers: the margins will update. You'll rarely need to edit the margins manually. Always try to find a container to help you first; Godot comes with nodes to solve all the common cases for you. Need to add space between a lifebar and the border of the screen? Use the MarginContainer. Want to build a vertical menu? Use the VBoxContainer. More on these below.
cs: Zkuste změnit kotvy nebo vnořit řídicí uzly dovnitř kontejnerů: okraje se aktualizují. Zřídkakdy budete muset okraje upravovat ručně. Vždy se nejprve pokuste najít kontejner, který by vám by vám mohl pomoci; Godot přichází s uzly pro všechny běžné případy. Potřebujete přidat mezeru mezi ukazatel života a okraj obrazovky? Použijte MarginContainer. Chcete vytvořit vertikální menu? Použijte VBoxContainer. Více k těmto níže.
de: Versuchen Sie die Anker zu ändern, oder verschachteln Sie Ihre Control Nodes innerhalb von Containern: die Seitenränder werden aktualisiert. Nur selten müssen Sie die Seitenränder manuell editieren. Versuchen Sie immer zunächst einen Container zu finden der Ihnen hilft; Godot kommt mit Nodes für alle Normalfälle. Sie brauchen Platz zwischen dem Lebensbalken und dem Rand des Bildschirms? Verwenden Sie den MarginContainer. Sie möchten ein vertikales Menü bauen? Verwenden Sie den VBoxContainer. Mehr dazu unten.
es: Intenta cambiar las anclas o anidar los nodos de Control dentro de Containers: los márgenes se actualizarán. Rara vez necesitarás editar los márgenes manualmente. Siempre trata de encontrar un container que te ayude primero; Godot viene con nodos para resolver todos los casos más comunes ¿Necesitas añadir espacio entre una barra de vida y el borde de la pantalla? Utiliza el MarginContainer. ¿Desea crear un menú vertical? Usa el VBoxContainer. Más sobre estos a continuación.
fr: Essayez de changer les ancres ou d'imbriquer vos nœuds de contrôle à l'intérieur des conteneurs : les marges se mettront à jour. Vous aurez rarement besoin d'éditer les marges manuellement. Essayez toujours de trouver un conteneur pour vous aider en premier ; Godot est fourni avec des nœuds pour résoudre tous les cas courants pour vous. Besoin d'ajouter de l'espace entre une barre de vie et le bord de l'écran ? Utilisez le MarginContainer. Vous voulez construire un menu vertical ? Utilisez le VBoxContainer. Plus d'informations à ce sujet ci-dessous.
ja: アンカーを変更するか、コンテナ内にコントロールノードをネストしてみてください。余白が更新されます。この余白を手動で編集する必要はほとんどありません。常に最初にまず、使えそうなコンテナを探すようにしてください。Godotはあなたのために、あらゆる一般的な課題を解決できるノードを持っています。ライフバーと画面の境界の間にスペースを追加する必要がありますか？ MarginContainerを使用してください。 垂直メニューを作りたいですか？ VBoxContainerを使用しましょう。さらなる詳細は下記にあります。
ko: 한번 앵커 위치를 바꾸거나 컨트롤 노드를 컨테이너 안에 넣어보세요: 마진은 업데이트 될 것입니다. 당신은 거의 마진을 수동으로 편집하진 않을 것입니다. 항상 당신을 도와줄 컨테이너를 골라보세요; Godot는 모든 일반적인 경우를 해결하기 위한 노드를 제공합니다. 체력 막대와 화면 테두리 사이에 빈 공간이 필요한가요? MarginContainer를 사용하세요. 세로 메뉴를 만들고 싶나요? VBoxContainer를 사용하세요. 아래에서 더 자세히 설명하겠습니다.
pt_br: Tente alterar as âncoras ou aninhe seus nós de controle dentro de Contêineres: as margens serão atualizadas. Você raramente precisará editar as margens manualmente. Sempre tente encontrar um contêiner para ajudá-lo primeiro; O Godot vem com nós para resolver todos os casos comuns para você. Precisa adicionar espaço entre uma barra de vida e a borda da tela? Use o MarginContainer. Quer construir um menu vertical? Use o VBoxContainer. Mais sobre estes abaixo.
ru: Попробуйте поизменять якоря или вложить ваши узлы Control внутрь контейнеров — отступы обновятся. Вам нечасто потребуется редактировать отступы вручную. Сначала всегда пробуйте найти контейнер; Godot предоставляет узлы для решения всех распространенных случаев за вас. Нужно добавить пространство между шкалой здоровья и границей экрана? Используйте узел MarginContainer. Хотите сделать вертикальное меню? Используйте узел VBoxContainer. Подробнее об этом ниже.
uk: Спробуйте змінити прив'язки, або вкладати свої контрольні вузли всередину контейнерів: поля будуть оновлені. Вам рідко потрібно буде редагувати поля вручну. Завжди намагайтеся спочатку знайти підходящий контейнер; Godot поставляється з вузлами для вирішення всіх загальних для вас випадків. Потрібно додати простір між полоскою здоров'я та рамкою екрана? Використовуйте MarginContainer. Хочете скласти вертикальне меню? Використовуйте VBoxContainer. Детальніше про них нижче.
zh_cn: 尝试更改锚点或将 ``Control`` 节点嵌套在 ``Containers`` 中: 边距将更新. 您几乎不需要手动编辑边距. 始终尝试先找到一个可以帮助您的容器；Godot带有节点, 可以为您解决所有常见情况. 需要在生命条和屏幕边界之间添加空间？使用 ``VBoxContainer``. 更多关于这些的内容, 参见下文.
zh_tw: 試著更改錨點或將 Control 節點嵌套於 Container 內後會發現外邊距跟著更新。通常外邊距不需要手動修改。首先應該找找有沒有適合的 Container，Godot 有許多能解決所有常見情況的節點：需要在血槽與畫面邊緣間加點空白？可以用 MarginContainer。要製作垂直選單？可以使用 VBoxContainer。更多詳細資訊請參考下文。

source: Use size tags to change how UI elements fill the available space
cs: Pomocí značek velikosti změňte, jak prvky uživatelského rozhraní zaplňují dostupné místo
de: Verwende Größenmarkierungen um zu verändern, wie Benutzeroberflächen Elemente den verfügbaren Platz ausfüllen
es: Usar etiquetas size para cambiar la forma en que los elementos de la UI llenan el espacio disponible
fr: Utilisez les balises de taille pour modifier la façon dont les éléments de l'interface utilisateur remplissent l'espace disponible
it: Usa i tag size per cambiare il modo in cui gli elementi dell'interfaccia utente riempiono lo spazio disponibile
ja: サイズタグを使用して、UI要素が使用可能な領域を埋める方法を変更する
ko: UI 요소가 이용 가능한 영역을 채우는 방식을 바꾸기 위해서 사이즈 태그를 사용하세요
pt_br: Use tags de tamanho para alterar como os elementos da interface do usuário preenchem o espaço disponível
ru: Используйте размерные тэги, чтобы влиять на то, как элементы интерфейса будут заполнять доступное пространство
uk: Використовуйте теги розмірів, щоб впливати на заповнення елементами інтерфейсу доступного простору
zh_cn: 使用大小标签来更改UI元素如何填充可用空间
zh_tw: 使用大小標籤來改變 UI 元素填充空間的方式

source: Every control node has Size Flags. They tell containers how the UI elements should scale. If you add the "Fill" flag to the Horizontal or Vertical property, the node's bounding box will take all the space it can, but it'll respect its siblings and retain its size. If there are 3 TextureRect nodes in an HBoxContainer, with the "Fill" flags on both axes, they'll each take up to a third of the available space, but no more. The container will take over the node and resize it automatically.
cs: Každý řídicí uzel má příznaky velikosti. Říkají kontejnerům, jak by se měly k podřízeným prvkům ui chovat. Pokud přidáte příznak "Fill" do Horizontal nebo Vertical vlastnosti, ohraničovací rámeček uzlu zabere veškerý prostor, který může, ale bude respektovat své sourozence a zachová si svou velikost. Pokud jsou v HBoxContainer 3 uzly TextureRect s příznaky „Fill“ na obou osách, zabere každý z nich až třetinu dostupného prostoru, ale nic víc. Kontejner přebírá uzel a automaticky jeho mění velikost.
de: Jede Control Node hat Größeneinstellungen. Sie sagen Containern wie Benutzeroberflächen Elemente skaliert werden sollen. Wenn Sie die "Fill" Einstellung zur Horizontal oder Vertikal Eigenschaft hinzufügen, wird das Begrenzungsrechteck der Node soviel Platz einnehmen wie möglich, aber es wird weiterhin seine Geschwister respektieren und ihre Größe unverändert lassen. Wenn 3 TextureRect Nodes in einem HBoxContainer sind, und "Fill" für beide Achsen eingestellt ist, wird jedes TextureRect bis zu einem drittel des verfügbaren Platzes einnehmen, aber nicht mehr. Der Container übernimmt die Node und ändert ihre Größe automatisch.
es: Cada nodo de control tiene Size Flags. Indican a los container cómo deben escalarse los elementos de interfaz de usuario. Si añade el indicador "Fill" a la propiedad Horizontal o Vertical, el cuadro de delimitación del nodo ocupará todo el espacio que pueda, pero respetará a sus hermanos y conservará su tamaño. Si hay 3 nodos TextureRect en un HBoxContainer, con los indicadores "Fill" en ambos ejes, cada uno ocupará hasta un tercio del espacio disponible, pero no más. El container tomará el nodo y lo redimensionará automáticamente.
fr: Chaque nœud de contrôle a des drapeaux de taille. Ils indiquent aux conteneurs comment les éléments de l'interface utilisateur doivent être mis à l'échelle. Si vous ajoutez le drapeau "Fill" à la propriété Horizontal ou Vertical, la boîte de délimitation du nœud prendra tout l'espace qu'elle peut, mais elle respectera ses noeuds frères et conservera sa taille. S'il y a 3 nœuds TextureRect dans un HBoxContainer, avec les drapeaux "Fill" sur les deux axes, ils occuperont chacun jusqu'à un tiers de l'espace disponible, mais pas plus. Le conteneur va prendre le contrôle du nœud et le redimensionner automatiquement.
ja: 各コントロールノードにはサイズフラグ(Size Flags)があります。これらは、UI要素のスケーリング方法をコンテナに指示します。「Fill (埋める)」フラグを Horizontal(水平) または Vertical(垂直) のプロパティに追加すると、ノードのバウンディングボックスは可能な限りのスペースを使用しますが、兄弟を考慮してサイズを保持します。HBoxContainerに3つのTextureRectノードがあり、両方の軸に「Fill」フラグが設定されている場合、それぞれが使用可能なスペースの最大3分の1を使用しますが、それ以上は使用できません。コンテナがノードを引き継ぎ、自動的にサイズが変更されます。
ko: 모든 컨트롤 노드는 Size Flags를 가지고 있습니다. 이들은 컨테이너가 어떻게 UI 요소들이 크기가 조정될 지를 말합니다. 만약 "Fill" 플래그를 Horizontal이나 Vertical 속성에 추가한다면, 노드의 경계 사각형은 가능한 모든 공간을 차지할 것이지만, 형제 노드를 가리지 않는 한에서 크기를 조절할 겁니다. 만약 HBoxContainer에 3개의 TextureRect 노드가 있고, "Fill" 플래그가 두 방향 모두에 있다면, 그들은 각자의 가능한 공간의 3분의 1을 차지하고 그 외는 사용하지 않을 겁니다. 컨테이너는 노드를 제어하여 크기를 자동으로 조절합니다.
pt_br: Todo nó de controle possui sinalizadores de tamanho. Eles dizem aos contêineres como os elementos da interface do usuário devem ser dimensionados. Se você adicionar o sinalizador "Fill" à propriedade Horizontal ou Vertical, a caixa delimitadora do nó ocupará todo o espaço possível, mas respeitará seus irmãos e manterá seu tamanho. Se houver 3 nós TextureRect em um HBoxContainer, com os sinalizadores "Fill" nos dois eixos, cada um deles ocupará um terço do espaço disponível, mas não mais. O contêiner assumirá o nó e o redimensionará automaticamente.
ru: Каждый узел управления имеет флаги размера (Size Flags). Они сообщают контейнерам, как элементы пользовательского интерфейса должны масштабироваться. Если добавить флаг "Fill" (заполнить) на свойство Horizontal (горизонталь) или Vertical (вертикаль), ограничивающий прямоугольник узла займет всё возможное пространство, но он будет уважать своих братьев и сестёр и сохранит свои размеры. Если в HBoxContainer есть 3 узла TextureRect с флагами "Fill" на обеих осях, то каждый из них займет до трети свободного пространства, но не более. Контейнер возьмёт на себя узел и автоматически изменит его размер.
uk: Кожен вузол контролю має Size Flags. Вони розповідають контейнерам, як слід змінювати елементи інтерфейсу. Якщо ви додасте галочку "Fill" до властивості Horizontal, або Vertical, обмежувальне поле вузла займе весь простір, який зможе, але воно поважатиме його братів та сестер і збереже їх розмір. Якщо в HBoxContainer є 3 вузли TextureRect, з галочками "Fill" на обох осях, вони займають третину наявного простору, але не більше. Контейнер візьме на себе вузол і змінить його розмір автоматично.
zh_cn: 每个控制节点都有尺寸标志. 它们告诉容器UI元素应该如何缩放. 如果你在水平或垂直属性上添加了 "Fill " 标志, 节点的边界框将占用所有的空间, 但它会尊重它的兄弟姐妹并保留其尺寸. 如果在一个 HBoxContainer 中有 3 个 TextureRect 节点, 在两个轴上都有 "Fill" 标志, 它们将各自占用三分之一的可用空间, 但不会超过. 容器将接管该节点并自动调整其大小.
zh_tw: 所有的 Control 節點都有大小旗標 (Size Flag)。這些旗標用來控制 Container 如何縮放其中的 UI 元素。若在 Horizontal（水平）或 Vertical（垂直）屬性上新增「Fill」旗標，則節點的定界框會佔用所有可用的空間，但同時也會顧慮其他同級節點並保留同級節點的大小。若在兩個方向都設定了「Fill」旗標的 HBoxContainer 中有三個 TextureRect 節點，則這三個節點都只會佔用最多三分之一的可用空間。Container 會控制節點並自動縮放這些節點。

source: 3 UI elements in an HBoxContainer, they align horizontally
cs: 3 prvky uživatelského rozhraní v HBoxContainer zarovnané vodorovně
de: 3 Benutzeroberflächen Elemente in einem HBoxContainer, sie reihen sich horizontal auf
es: 3 elementos UI en un HBoxContainer, se alinean horizontalmente
fr: 3 éléments d'interface utilisateur dans un HBoxContainer, qui s'alignent horizontalement
it: 3 elementi UI in un HBoxContainer, si allineano orizzontalmente
ja: HBoxContainer内の3つのUI要素は、水平方向に整列します
ko: HBoxContainer에 있는 3개의 UI 요소들, 이들은 수평으로 정렬됩니다
pt_br: 3 elementos de interface do usuário em um HBoxContainer, eles se alinham horizontalmente
ru: 3 элемента интерфейса в HBoxContainer выровнены по горизонтали
uk: 3 елементи інтерфейсу в HBoxContainer вирівняні горизонтально
zh_cn: ``HBoxContainer`` 中的3个UI元素, 它们是水平对齐的
zh_tw: HBoxContainer 中的三個 UI 元素，水平對齊

source: The "Expand" flag lets the UI element take all the space it can, and push against its siblings. Its bounding rectangle will grow against the edges of its parent, or until it's blocked by another UI node.
cs: Příznak „Expand“ umožňuje prvku uživatelského rozhraní zabrat veškerý dostupný prostor a zatlačit proti svým sourozencům. Jeho ohraničující obdélník poroste proti okrajům jeho nadřazeného uzlu nebo dokud nebude zablokován jiným uzlem uživatelského rozhraní.
de: Die "Expand" Einstellung lässt ein Benutzeroberflächen Element soviel Platz einnehmen wie möglich, und dabei gegen seine Geschwister zu drücken. Das Begrenzungsrechteck wird gegen die Kanten des parent wachsen, oder bis es von anderen Benutzeroberflächen Nodes blockiert wird.
es: La opción "Expand" permite que el elemento UI ocupe todo el espacio que pueda y empuje a sus hermanos. Su rectángulo delimitador crecerá hasta los bordes de su padre, o hasta que sea bloqueado por otro nodo UI.
fr: Le drapeau "Expand" permet à l'élément de l'interface de prendre tout l'espace qu'il peut, et de pousser ses éléments frères. Son rectangle délimitant grandira jusqu'aux bords de son parent, ou jusqu'à ce qu'il soit bloqué par un autre nœud d'interface utilisateur.
it: La proprietà "Espandi" lascia che l'elemento UI prenda tutto lo spazio disponibile, e spinga contro i suoi fratelli. Il suo rettangolo delimitatore crescerà adiacente ai lati del suo nodo genitore, o fintanto che è bloccato da un altro nodo UI.
ja: 「Expand (拡張)」フラグを使用すると、UI要素は可能な限りのスペースを使用して、兄弟要素をプッシュできます。そのバウンディングボックスは、親のエッジに向かって、または別のUIノードによってブロックされるまで大きくなります。
ko: "Expand" 플래그는 UI 요소가 가능한 모든 공간을 차지하게 만들고, 형제 노드를 밀어냅니다. 경계 사각형은 부모의 모서리까지, 혹은 다른 UI 노드로 가로막힐 때까지 커집니다.
pt_br: O sinalizador "Expand" permite que o elemento da interface do usuário ocupe todo o espaço possível e empurre seus irmãos. Seu retângulo de delimitação crescerá nas bordas de seu pai ou até que seja bloqueado por outro nó de interface do usuário.
ru: Флаг "Expand" позволяет элементу интерфейса заполнить всё возможное пространство и растолкать своих братьев и сестёр. Его ограничивающий прямоугольник будет расти до краёв родительского элемента или пока он не будет заблокирован другим узлом интерфейса.
uk: Галочка "Expand" дозволяє елементу інтерфейсу зайняти весь простір, який він може, і потиснути своїх побратимів. Його обмежувальний прямокутник розшириться до країв його предка, або поки його розширення не заблокує інший вузол інтерфейсу.
zh_cn: ``Expand(展开)`` 标志允许UI元素获得它所能获得的所有空间, 并推动其兄弟元素. 它的边界矩形将沿其父对象的边缘增长, 或直到它被另一个UI节点阻止为止.
zh_tw: 「Expand」旗標會讓 UI 元素佔滿所有可用的空間，並擠壓同級元素。定界框會一直沿著母節點的邊緣增長，除非被另一個 UI 元素阻擋。

source: The same example as above, but the center node has the "Expand" size flag
cs: Stejný příklad jako výše, ale středový uzel má příznak velikosti "Expand"
de: Das gleiche Beispiel wie oben, diesmal hat die mittlere Node die "Expand" einstellung
es: El mismo ejemplo que el anterior, pero el nodo central tiene el size flag "Expand"
fr: Le même exemple que ci-dessus, mais le nœud central a le drapeau de taille "Expand"
it: Lo stesso esempio qui sopra, ma il nodo centra ha la proprietà di dimensione "Espandi"
ja: 上記と同じ例ですが、中央ノードには「Expand」サイズフラグがあります
ko: 위와 같은 샘플 예제에서, 가운데 노드는 "Expand" 사이즈 플래그가 설정되어 있습니다
pt_br: O mesmo exemplo acima, mas o nó central tem o sinalizador de tamanho "Expand"
ru: Такой же пример как и выше, но центральный узел имеет флаг "Expand"
uk: Той самий приклад, що і вище, але центральний вузол має галочку "Expand"
zh_cn: 与上面的示例相同, 但是中心节点有 ``Expand(展开)`` 大小标志
zh_tw: 與上方的範例相同，但中間的節點加上了「 Expand 」大小旗標
