Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_introduction_to_the_ui_system.po
Languages: cs, de, es, fr, it, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: ``Keep`` and ``Keep Centered`` force the texture to remain at its original size, in the top left corner or the center of the frame respectively
ko: ``Keep`` 과 ``Keep Centered`` 는 텍스쳐가 그 크기를 유지하게 합니다, 각각 경계의 좌측 상단과 중심에 위치시킵니다
pt_br: ``Keep`` e ``Keep Centered`` forçam a textura a permanecer no tamanho original, no canto superior esquerdo ou no centro do quadro, respectivamente

source: ``Keep Aspect`` and ``Keep Aspect Centered`` scales the texture but force it to remain its original aspect ratio, in the top left corner or the center of the frame respectively
ko: ``Keep Aspect`` 와 ``Keep Aspect Centered`` 는 텍스쳐의 크기를 조절하지만 그것의 크기 비율은 유지합니다, 각각 경계의 좌측 상단과 중심에 위치시킵니다
pt_br: ``Keep Aspect`` e ``Keep Aspect Centered`` dimensiona a textura, mas força-a a manter sua proporção original, no canto superior esquerdo ou no centro do quadro, respectivamente

source: ``Keep Aspect Covered`` works just like ``Keep Aspect Centered`` but the shorter side fits the bounding rectangle and the other one clips to the node’s limits
ko: ``Keep Aspect Covered`` 는 ``Keep Aspect Centered`` 와 비슷하지만 경계 직사각형의 짧은 변 쪽은 꽉 차는 반면, 긴 변 쪽은 노드의 경계까지만 보여주고 짤립니다
pt_br: ``Keep Aspect Covered`` funciona da mesma forma que ``Keep Aspect Centered``, mas o lado mais curto se ajusta ao retângulo delimitador e o outro fica preso aos limites do nó

source: **TextureButton** is like TextureRect, except it has 5 texture slots: one for each of the button's states. Most of the time, you'll use the Normal, Pressed, and Hover textures. Focused is useful if your interface listens to the keyboard's input. The sixth image slot, the Click Mask, lets you define the clickable area using a 2-bit, pure black and white image.
ko: **TextureButton** 은 TextureRect와 비슷하지만, 5개의 텍스쳐 슬롯을 갖고 있습니다: 이들은 각 버튼의 상태입니다. 대부분은, Normal, Pressed, 그리고 Hover 텍스쳐를 사용할 겁니다. Focused는 인터페이스가 키보드의 입력을 수신하는 경우에 유용합니다. 여섯 번째 이미지 슬롯인, Click Mask는, 순수한 흰색과 검은색 2-비트를 사용해 클릭할 수 있는 영역을 정의하게 만듭니다.
pt_br: **TextureButton** é como TextureRect, exceto que tem 5 slots de textura: um para cada um dos estados do botão. Na maioria das vezes, você usará as texturas Normal, Pressed e Hover. Focused é útil se sua interface monitora a entrada do teclado. O sexto slot de imagem, o Click Mask, permite definir a área clicável usando uma imagem em preto e branco puro de 2 bits.

source: To animate the bar, you'll want to look at the Range section. Set the ``Min`` and ``Max`` properties to define the range of the gauge. For instance, to represent a character's life, you'll want to set ``Min`` to ``0,`` and ``Max`` to the character's maximum life. Change the ``Value`` property to update the bar. If you leave the ``Min`` and ``Max`` values to the default of ``1`` and ``100,`` and set the ``Value`` property to ``40``, 40% of the ``Progress`` texture will show up, and 60% of it will stay hidden.
ko: 막대를 애니메이트 하기 위해, 당신은 Range 섹션을 확인해야 합니다. ``Min`` 과 ``Max`` 속성으로 게이지의 범위를 설정하세요. 예를 들어, 캐릭터의 체력을 나타내려면, 당신은 ``Min`` 을 ``0`` 으로, ``Max`` 를 캐릭터의 최대 체력으로 설정해야 할 겁니다. ``Value`` 속성을 바꿔서 막대를 업데이트 하세요. 만약 ``Min`` 과 ``Max`` 를 기본 값인 ``1`` 과 ``100`` 으로 두고, ``Value`` 속성을 ``40`` 으로 하면, ``Progress`` 텍스쳐의 40%가 보여지고 60%는 계속 안 보일 겁니다.
pt_br: Para animar a barra, você vai querer olhar para a seção Range. Defina as propriedades ``Min`` e ``Max`` para definir o intervalo do medidor. Por exemplo, para representar a vida de um personagem, você vai querer definir ``Min`` para ``0, `` e ``Max`` para a vida máxima do personagem. Altere a propriedade ``Value`` para atualizar a barra. Se você deixar os valores ``Min`` e ``Max`` para o padrão de ``1`` e ``100, `` e setar a propriedade ``Value`` para ``40``, 40% da textura ``Progress`` aparecerá, e 60% dela permanecerá oculta.

source: Like any properties, you can edit the 4 anchor points in the Inspector, but this is not the most convenient way. When you select a control node, the layout menu appears above the viewport, in the toolbar. It gives you a list of icons to set all 4 anchors with a single click, instead of using the inspector’s 4 properties. The layout menu will only show up when you select a control node.
ko: 모든 속성과 마찬가지로, 인스펙터에서 4개의 앵커 포인트를 편집할 수 있습니다만, 가장 편리한 방법은 아닙니다. 당신이 컨트롤 노드를 선택할 때, 레이아웃 메뉴가 뷰포트 위의 툴바에 나타납니다. 이것은 클릭 만으로 4개의 앵커들을 모두 설정할 수 있습니다, 인스펙터의 4개의 속성을 사용하는 대신 말이죠. 레이아웃 메뉴는 오직 컨트롤 노드를 선택할 때만 보여집니다.
pt_br: Como qualquer propriedade, você pode editar os 4 pontos de ancoragem no Inspetor, mas essa não é a maneira mais conveniente. Quando você seleciona um nó de controle, o menu de layout aparece acima da janela de exibição, na barra de ferramentas. Ele fornece uma lista de ícones para definir todas as 4 âncoras com um único clique, em vez de usar as 4 propriedades do inspetor. O menu de layout só será exibido quando você selecionar um nó de controle.
