Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_introduction_to_the_ui_system.po
Languages: cs, de, es, fr, it, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: There are two BoxContainers: VBoxContainer and HBoxContainer. You cannot add the BoxContainer node itself, as it is a helper class, but you can use vertical and horizontal box containers. They arrange nodes either in rows or columns. Use them to line up items in a shop, or to build complex grids with rows and columns of different sizes, as you can nest them to your heart's content.
cs: BoxContainer existuje ve dvou verzích: VBoxContainer a HBoxContainer. Nelze použít samotný uzel BoxContainer, protože se jedná o pomocnou třídu, ale můžete využít svislé a vodorovné kontejnery. Uspořádají podřízené uzly do řádků nebo sloupců. Používejte je k seřazení položek v obchodě nebo k vytváření komplexních mřížek s řádky a sloupci různých velikostí, protože je můžete vzájemně vnořovat co hrdo ráčí.
de: Es gibt zwei BoxContainer: VBoxContainer und HBoxContainer. Sie können die BoxContainer Node selbst nicht verwenden, denn sie fungiert nur als Hilfsklasse, aber Sie können vertikale und horizontale BoxContainer verwenden. Diese arrangieren Nodes entweder in Reihen oder Spalten. Verwende sie um Gegenstände in einem Laden auf zu reihen, oder baue komplexe Gitter mit Reihen und Spalten verschiedener Größen, da Sie sie zu Ihrem eigentlichem Inhalt hin verschachteln können.
es: Hay dos BoxContainers: VBoxContainer y HBoxContainer. No se puede añadir el nodo BoxContainer en sí, ya que es una clase helper, pero se pueden utilizar contenedores verticales y horizontales. Ordena los nodos en filas o columnas. Utilízalos para alinear artículos en una tienda o para construir cuadrículas complejas con filas y columnas de diferentes tamaños, ya que puedes anidarlas a tu gusto.
fr: Il y a deux BoxContainers : VBoxContainer et HBoxContainer. Vous ne pouvez pas ajouter le nœud BoxContainer lui-même, car il s'agit d'une classe d'aide, mais vous pouvez utiliser des conteneurs de boîtes verticaux et horizontaux. Ils organisent les nœuds en lignes ou en colonnes. Utilisez-les pour aligner des articles dans une boutique, ou pour construire des grilles complexes avec des lignes et des colonnes de différentes tailles, car vous pouvez les emboîter à votre guise.
ja: ボックスコンテナには、VBoxContainerとHBoxContainerの2つがあります。BoxContainerノード自体はヘルパー クラスなので追加できませんが、垂直および水平のボックスコンテナを使用できます。ノードは行または列に配置されます。ショップ内のアイテムを並べて作成したり、さまざまなサイズの行と列を持つ複雑なグリッドを構築したりするために使用します。
ko: 두 개의 박스컨테이너가 있습니다: VBoxContainer와 HBoxContainer이죠. BoxContainer 노드는 도움을 주는 클래스이므로 그대로 사용하지 못합니다, 하지만 수직이나 수평으로 된 박스컨테이너는 사용할 수 있습니다. 이들은 노드를 행이나 열로 배열합니다. 이들을 사용해서 상점의 아이템을 늘어놓거나, 행과 열을 다른 크기로 하여 복잡한 격자를 만들 수 있고, 이걸로 당신은 마음 속 내용을 만들어낼 수 있습니다.
pt_br: Existem dois BoxContainers: VBoxContainer e HBoxContainer. Você não pode adicionar o próprio nó BoxContainer, pois ele é uma classe auxiliar, mas você pode usar contêineres verticais e horizontais. Eles organizam nós em linhas ou colunas. Use-os para alinhar itens em uma loja ou para construir grades complexas com linhas e colunas de tamanhos diferentes, pois você pode aninhá-los da forma que desejar.
ru: Есть два BoxContainers: VBoxContainer и HBoxContainer. Вы не можете добавить сам узел BoxContainer, так как он является вспомогательным классом, но вы можете использовать вертикальные и горизонтальные контейнеры. Они упорядочивают узлы в строках или столбцах. Используйте их для выравнивания предметов в магазине или для создания сложных сеток с строками и столбцами разных размеров, так как вы можете вложить их в ваше ядро.
uk: Є два BoxContainers: VBoxContainer і HBoxContainer. Ви не можете додати сам вузол BoxContainer, оскільки це допоміжний клас, але ви можете використовувати вертикальні та горизонтальні контейнери. Вони розташовують вузли, або рядками, або стовпцями. Використовуйте їх для вирівнювання предметів у магазині, або для складання складних сіток із рядками та стовпцями різного розміру, оскільки ви можете вкладати їх як забажаєте.
zh_cn: 有两个 ``BoxContainer``:``VBoxContainer`` 和 ``HBoxContainer``. 您不能添加 ``BoxContainer`` 节点本身, 因为它是一个辅助类, 但是您可以使用垂直和水平框容器. 它们将节点排列成行或列. 使用它们可以在商店中排列商品, 或使用大小不同的行和列构建复杂的栅格, 因为您可以将它们嵌套在所需位置.
zh_tw: 有兩種 BoxContainer：VBoxContainer 與 HBoxContainer。由於 BoxContainer 屬於 Helper 類別，所以 BoxContainer 無法直接使用。可以使用垂直與水平的 Box Container。這兩個 Container 會以行或列的形式來排列子節點。可使用這兩種容器來排列商店裡的物品、或是依照你所想像的方式進行嵌套來建立有不同大小的行與列的複雜柵欄系統。

source: The HBoxContainer horizontally aligns UI elements
cs: HBoxContainer vodorovně zarovná prvky uživatelského rozhraní
de: Der HBoxContainer arrangiert Benutzeroberflächen Elemente horizontal
es: El HBoxContainer alinea horizontalmente los elementos de la UI
fr: Le HBoxContainer aligne horizontalement les éléments d'interface utilisateur
it: L'HBoxContainer allinea orizzontalmente gli elementi UI
ja: HBoxContainerはUI要素を水平方向に揃えます
ko: HBoxContainer가 UI 요소들을 수평으로 배열합니다
pt_br: O HBoxContainer alinha horizontalmente os elementos da interface do usuário
ru: HBoxContainer горизонтально выравнивает элементы пользовательского интерфейса
uk: HBoxContainer горизонтально вирівнює елементи інтерфейсу користувача
zh_cn: ``HBoxContainer`` 水平对齐UI元素
zh_tw: HBoxContainer 水平對齊 UI 元素

source: VBoxContainer automatically arranges its children into a column. It puts them one after the other. If you use the separation parameter, it will leave a gap between its children. HBoxContainer arranges UI elements in a row. It's similar to the VBoxContainer, with an extra ``add_spacer`` method to add a spacer control node before its first child or after its last child, from a script.
cs: VBoxContainer automaticky uspořádá svoje potomky do sloupce. Naštosuje je jednoho po druhém. Pokud použijete oddělovací parametr,zanechá mezi nimi určitý prostor. HBoxContainer uspořádá prvky uživatelského rozhraní do řady. Je to podobné jako u VBoxContainer, s extra ``add_spacer`` metodou pro přidání uzlu spacer před prvním nebo posledním potomkem pomocí skriptu.
de: VBoxContainer arrangieren ihre children automatisch in Spalten. Es platziert sie eines nach dem anderen. Wenn Sie den seperation Parameter benutzen, wird eine Lücke zwischen den children gelassen. HBoxContainer arrangieren Benutzeroberflächen Elemente in einer Reihe. Er ähnelt dem VBoxContainer, mit einer extra ``add_spacer`` Methode um eine Spacer Control Node vor seinem ersten oder nach seinem letzten children, aus einem Script heraus hinzu zu fügen.
es: VBoxContainer ordena automáticamente a sus hijos en una columna. Los pone uno tras otro. Si se utiliza el parámetro de separación, dejará un espacio entre sus hijos. HBoxContainer ordena los elementos de la UI en una fila. Es similar al VBoxContainer, con un método adicional ``add_spacer`` para añadir un nodo de control de espaciador antes de su primer hijo o después de su último hijo, desde un script.
fr: VBoxContainer organise automatiquement ses enfants dans une colonne. Il les place les un après les autres. Si vous utilisez le paramètre de séparation, il laissera un espace entre ses enfants. HBoxContainer organise les éléments d'interface utilisateur dans une rangée. Il est similaire au VBoxContainer, avec une méthode supplémentaire ``add_spacer`` pour ajouter un noeud de contrôle spacer avant son premier enfant ou après son dernier enfant, à partir d'un script.
ja: VBoxContainerは、子を自動的に縦一列に配置し、並べていきます。Separation (分離) パラメータを使用すると、子と子の間に隙間をつくります。HBoxContainerは、UI要素を横一列に並べます。これはVBoxContainerに似ていますが、最初の子ノードの前または最後の子ノードの後にspacerコントロールノードをスクリプトから追加するための ``add_spacer`` メソッドが追加されています。
ko: VBoxContainer는 자동으로 자식들을 세로로 배열합니다. 자식들을 차례로 하나 씩 놓습니다. 당신이 separation 한도를 설정하면, 자식들 사이에 틈이 생기게 됩니다. HBoxContainer는 자식들을 가로로 배열합니다. 이것은 VBoxContainer와 유사하게, 스크립트에서 맨 앞이나 맨 뒤에 간격을 띄우는 컨트롤 노드를 추가하는, ``add_spacer`` 메서드를 갖고 있습니다.
pt_br: VBoxContainer organiza automaticamente seus filhos em uma coluna. Isso os coloca um após o outro. Se você usar o parâmetro de separação, ele deixará um espaço entre seus filhos. HBoxContainer organiza elementos da interface do usuário em uma linha. É semelhante ao VBoxContainer, com um método extra ``add_spacer`` para adicionar um nó de controle espaçador antes de seu primeiro filho ou depois de seu último filho, a partir de um script.
ru: VBoxContainer автоматически выравнивает свои дочерние элементы в колонку. Один за другим. Для задания разделителя меж ними, используется параметр разделителя. HBoxContainer выравнивает элементы UI в строку. Он похож на VBoxContainer, но с дополнительным методом ``add_spacer``, позволяющим добавлять узел контроля отступа для первого или последнего элементов, прямо из скрипта.
uk: VBoxContainer автоматично впорядковує своїх нащадків у колонку. Він ставить їх один за одним. Якщо використовувати параметр розділення, він залишить проміжок між його нащадками. HBoxContainer розташовує елементи інтерфейсу підряд. Він схожий на VBoxContainer, з додатковим методом ``add_spacer``, який дозволяє додавати вузол управління відступом перед його першим нащадком, або після останнього нащадка, зі скрипту.
zh_cn: ``VBoxContainer`` 自动将其子级排列为一列. 它把它们一个接一个地放置. 如果使用分离参数, 它将在其子级之间留有空隙.``HBoxContainer`` 将UI元素排列成一行. 它类似于 ``VBoxContainer``, 具有一个额外的 ``add_spacer`` 方法, 可从脚本中在第一个子节点之前或最后一个子节点之后添加一个间隔控制节点.
zh_tw: VBoxContainer 自動會一個列中排列子節點的，將各個節點一個接一個排放。若使用 Speration（分隔）參數，則會在子節點間加上間隔。HBoxContainer 則會在一行間排列子節點，並且可使用額外的 ``add_spacer`` 方法來在腳本中為第一個子節點前或最後一個子節點後新增 Spacer Control 節點。

source: The GridContainer lets you arrange UI elements in a grid-like pattern. You can only control the number of columns it has, and it will set the number of rows by itself, based on its children's count. If you have nine children and three columns, you will have 9÷3 = 3 rows. Add three more children and you'll have four rows. In other words, it will create new rows as you add more textures and buttons. Like the box containers, it has two properties to set the vertical and horizontal separation between the rows and columns respectively.
cs: GridContainer umožňuje uspořádat prvky uživatelského rozhraní do mřížky. Můžete řídit pouze počet jeho sloupců a on sám si na základě počtu svých dětí nastaví počet řádků. Pokud má devět dětí a tři sloupce, bude mít 9 ÷ 3 = 3 řádky. Přidejte další tři děti a bude mít čtyři řádky. Jinými slovy, při přidávání dalších textur a tlačítek se vytvoří nové řádky. Stejně jako box kontejnery má dvě vlastnosti pro nastavení svislého a vodorovného oddělení řádků a sloupců.
de: Der GridContainer lässt lässt Sie die Benutzeroberflächen Elemente in einem Gitter ähnlichem Muster arrangieren. Sie können nur kontrollieren wie viele Spalten er hat und er wird die Anzahl der Reihen selbst festlegen, basierend auf der Anzahl seiner children. Wenn Sie neun children haben, und drei Spalten, werden Sie 9÷3 = 3 Reihen erhalten. Fügen Sie weitere drei children hinzu und Sie erhalten vier Reihen. Mit anderen Worten, er erschafft neue Reihen wenn Sie mehr Texturen und Buttons hinzu fügen. Wie auch der BoxContainer, hat er zwei Eigenschaften um den horizontalen und vertikalen Abstand der Reihen, respektive Spalten einzustellen.
es: El GridContainer permite organizar los elementos de la UI en un patrón similar al de una rejilla. Sólo se puede controlar el número de columnas que tiene, y se establecerá el número de filas por sí mismo, sobre la base de su cuenta de los hijos. Si tiene nueve hijos y tres columnas, tendrá 9÷3 = 3 filas. Añade tres hijos más y tendrás cuatro filas. En otras palabras, creará nuevas filas a medida que añada más texturas y botones. Al igual que los contenedores de caja, tiene dos propiedades para establecer la separación vertical y horizontal entre las filas y columnas respectivamente.
fr: Le GridContainer vous permet d'organiser les éléments de l'interface utilisateur selon un motif en forme de grille. Vous ne pouvez contrôler que le nombre de colonnes qu'il a, et il fixera le nombre de lignes par lui-même, en se basant sur le nombre de ses enfants. Si vous avez neuf enfants et trois colonnes, vous aurez 9÷3 = 3 lignes. Ajoutez trois enfants de plus et vous aurez quatre rangées. En d'autres termes, il créera de nouvelles lignes au fur et à mesure que vous ajouterez des textures et des boutons. Comme les conteneurs box, il a deux propriétés pour définir la séparation verticale et horizontale entre les lignes et les colonnes respectivement.
ja: GridContainerを使用すると、グリッドのようなパターンでUI要素を配置できます。列の数のみを制御でき、子の数に基づいて行数が決められます。9つの子と3つの列がある場合は、9÷ 3= 3行があります。さらに3つの子を追加すると、4行になります。つまり、テクスチャやボタンを追加すると、新しい行が作成されます。ボックスコンテナと同様に、行列の間で垂直と水平の分離を設定するためのプロパティが2つあります。
ko: GridContainer는 UI 요소들을 격자 같은 무늬로 배열합니다. 당신은 오직 세로 열의 숫자만 제어할 수 있는데, 가로 행의 수는 자식의 수에 따라 스스로 설정됩니다. 당신이 9개의 자식을 3열로 배열한다면, 9÷3 = 3행을 가지게 됩니다. 자식이 3개 더 늘어나면 4행을 가지게 됩니다. 이는 즉, 당신이 더 많은 텍스쳐와 버튼을 추가해 행을 늘릴 수 있습니다. 박스 컨테이너처럼, 이것도 각기 행과 열 사이에 수직과 수평 분리를 설정하는 두 개의 속성이 있습니다.
pt_br: O GridContainer permite organizar elementos da interface do usuário em um padrão semelhante a uma grade. Você só pode controlar o número de colunas que possui e definir o número de linhas sozinho, com base na contagem de seus filhos. Se você tem nove filhos e três colunas, você terá 9 ÷ 3 = 3 linhas. Adicione mais três filhos e você terá quatro linhas. Em outras palavras, ele criará novas linhas à medida que você adicionar mais texturas e botões. Como os contêineres de caixa, ele possui duas propriedades para definir a separação vertical e horizontal entre as linhas e colunas, respectivamente.
ru: GridContainer позволяет упорядочивать элементы пользовательского интерфейса в виде сетки. Вы можете контролировать только количество столбцов, он будет устанавливать количество строк сам по себе, на основе подсчета его дочерних элементов. Если у вас девять дочерних элементов и три столбца, у вас будет 9÷3 = 3 строки. Добавьте еще три дочерних элемена, и у вас будет четыре ряда. Другими словами, он будет создавать новые строки по мере добавления текстур и кнопок. Как и box container'ы, он имеет два свойства для установки вертикального и горизонтального разделения между строками и столбцами соответственно.
uk: GridContainer дозволяє розташовувати елементи інтерфейсу користувача за сіткою. Ви можете лише керувати кількістю стовпців, які він має, і він встановлюватиме кількість рядків самостійно, виходячи з кількості нащадків. Якщо у вас дев'ять нащадків і три стовпчики, у вас буде 9 ÷ 3 = 3 ряди. Додайте ще трьох нащадків, і у вас буде чотири ряди. Іншими словами, це створить нові рядки, коли ви додасте більше текстур і кнопок. Як і коробчасті контейнери, він має дві властивості, які встановлюють вертикальне та горизонтальне розділення між рядками та стовпцями відповідно.
zh_cn: ``GridContainer`` 允许您按网格模式排列UI元素. 您只能控制其具有的列数, 并且它将根据其子级计数自行设置行数. 如果您有9个子节点和3列, 您将有9÷3 = 3行. 再加3个子项, 就有4行了. 换句话说, 当您添加更多纹理和按钮时, 它将创建新行. 像盒子容器一样, 它具有两个属性, 分别设置行和列之间的垂直和水平间隔.
zh_tw: GridContainer 可以用類似柵欄系統的方式來排列 UI 元素。其中只有列數能控制，行數會自動依據子節點的數量來調整。若有九個子節點，列數設為三，則最後會有 9÷3 = 3 行。再新增三個子節點則會變成四行。換句話說，每當新增了更多紋理貼圖與按鈕後行數也會隨之增加。如同 Box 容器，GridContainer 有兩個屬性分別用來設縱向的行間隔與橫向的列間隔。

source: A GridContainer with 2 columns. It sizes each column automatically.
cs: GridContainer se 2 sloupci. Automaticky mění velikost každého sloupce.
de: Ein GridContainer mit 2 Spalten. Es legt die Größe jeder Spalte automatisch fest.
es: Un GridContainer con 2 columnas. Determina el tamaño de cada columna automáticamente.
fr: Un GridContainer avec 2 colonnes. Il dimensionne chaque colonne automatiquement.
it: Un GridContainer con 2 colonne. Dimensiona ogni colonna automaticamente.
ja: 2つの列を持つGridContainer。各列のサイズは自動的に設定されます。
ko: 2열로 된 GridContainer. 각 행은 자동으로 크기가 조절됩니다.
pt_br: Um GridContainer com 2 colunas. Ele dimensiona cada coluna automaticamente.
ru: GridContainer с 2 колонками. Он вычисляет их размер автоматически.
uk: GridContainer з 2 стовпцями. Він розміщує кожен стовпець автоматично.
zh_cn: 具有2列的 ``GridContainer``. 它会自动调整每列的大小.
zh_tw: 有兩個列的 GridContainer。各個列的大小為自動設定的。

source: Godot's UI system is complex, and has a lot more to offer. To learn how to design more advanced interfaces, head to the :ref:`GUI section <toc-learn-features-gui>` of the docs.
cs: Systém pro vytváření UI v Godotu je komplexní a nabízí toho daleko víc. Chcete-li se dozvědět, jak navrhnout složitější rozhraní, přejděte k části :ref:`GUI section <toc-learn-features-gui>` v dokumentech.
de: Godots Benutzeroberflächen System ist komplex, und hat noch einiges mehr zu bieten. Um zu lernen wie Sie fortgeschrittenere Oberflächen kreieren, wenden Sie sich :ref:`GUI section <toc-learn-features-gui>` in der Dokumentation zu.
es: El sistema de UI de Godot es complejo y tiene mucho más que ofrecer. Para aprender a diseñar interfaces más avanzada, consulta la sección :ref:`GUI section <toc-learn-features-gui>` de la documentación.
fr: Le système d'interface utilisateur de Godot est complexe et a beaucoup plus à offrir. Pour apprendre à concevoir une interface plus avancée, rendez-vous dans la section :ref:`GUI section <toc-learn-features-gui>` de la documentation.
it: Il sistema UI di Godot è complesso ed ha molto altro da offrire. Per imparare come progettare interfacce più avanzate visita la :ref:`GUI section <toc-learn-features-gui>` della documentazione.
ja: GodotのUIシステムは複雑で、さらに多くの機能があります。より高度なインターフェースをデザインする方法を学ぶには、ドキュメントの\ :ref:`GUIの節 <toc-learn-features-gui>`\ へと進んでください。
ko: Godot의 UI 시스템은 복잡하고, 그만큼 많은 것을 제공합니다. 더 좋은 인터페이스를 만드는 방법을 배우기 위해선, 문서의 :ref:`GUI 섹션 <toc-learn-features-gui>`\ 으로 가십시오.
ru: Система UI в Godot сложна и включает гораздо больше, чем описано здесь. Для получения подробной информации о том, как разрабатывать более продвинутые UI, обратитесь к разделу :ref:`GUI section <toc-learn-features-gui>` в документации.
uk: Система користувацького інтерфейсу Godot є складною і пропонує багато іншого. Щоб дізнатися, як проєктувати більш досконалі інтерфейси, перейдіть до :ref:`GUI section <toc-learn-features-gui>` у документах.
zh_cn: Godot的UI系统很复杂, 并且提供了更多功能. 要了解如何设计更高级的界面, 请转到文档的 :ref:`GUI 部分 <toc-learn-features-gui>`.

source: Label
it: Etichetta
ko: 라벨(Label)
pt_br: Rótulo
uk: Мітка
zh_cn: 标签
zh_tw: 標籤

source: **TextureButton** is like TextureRect, except it has 5 texture slots: one for each of the button's states. Most of the time, you'll use the Normal, Pressed, and Hover textures. Focused is useful if your interface listens to the keyboard's input. The sixth image slot, the Click Mask, lets you define the clickable area using a 1-bit, pure black and white image.
fr: **TextureButton** est comme TextureRect, sauf qu'il a cinq emplacements de texture : un pour chacun des états du bouton. La plupart du temps, vous utiliserez les textures Normal, Pressed et Hover. La texture Focused est utile si votre interface réagit à la saisie clavier. Le sixième emplacement d'image, Click Mask, vous permet de définir la zone cliquable à l'aide d'une image en noir et blanc de 1-bit.

source: You have many container nodes at your disposal that scale and place UI elements for you. They take control over their children.
fr: Vous avez de nombreux nœuds conteneurs à votre disposition qui mettent à l'échelle et placent des éléments de l'interface utilisateur pour vous. Ils prennent le contrôle de leurs enfants.
it: Sono disponibili molti nodi contenitore che scalano e posizionano gli elementi dell'interfaccia utente. Prendono il controllo dei loro figli.
ko: 원하는 만큼의 UI 요소들을 확장하고 배치할 수 있는 많은 컨테이너 노드들이 있습니다. 컨테이너는 그들의 자식인 UI 요소들을 제어합니다.
pt_br: Você tem muitos nós de contêiner à sua disposição que dimensionam e posicionam elementos de interface do usuário para você. Eles assumem o controle de seus filhos.
ru: У вас в распоряжении есть множество узлов контейнера, которые масштабируют и размещают элементы интерфейса. Они управляют своими потомками.

source: On the other side, you have the layout menu. It helps you to anchor, place and resize a UI element within its parent.
fr: De l'autre côté, vous avez le menu de mise en page. Il vous aide à ancrer, placer et redimensionner un élément d'interface utilisateur dans son parent.
it: Nell'altro lato c'è il menu di layout. Ti aiuta ad ancorare, rilasciare e ridimensionare un elemento dell'interfaccia utente all'interno del suo genitore.
ko: 반대로, 당신은 레이아웃 메뉴가 있습니다. 이것은 UI 요소들을 부모 내에서 부모위치를 기준로 위치를 고정하거나 배치하고 크기 조절하도록 돕습니다.
pt_br: Do outro lado, você tem o menu de layout. Ele ajuda você a ancorar, posicionar e redimensionar um elemento de interface do usuário dentro de seu pai.
ru: С другой стороны, у вас есть меню макета. Оно помогает вам закрепить, разместить и изменить размер элемента внутри его родителя.

source: MarginContainer, to add margins around part of the UI
fr: MarginContainer, pour ajouter des marges autour d'une partie de l'interface utilisateur
it: MarginContainer, per aggiungere dei margini attorno a porzioni della UI
ko: MarginContainer, UI의 가장자리에 여백을 추가함
pt_br: MarginContainer, para adicionar margens em torno da parte da interface do usuário
ru: MarginContainer, для добавления полей вокруг частей пользовательского интерфейса

source: Computer displays, mobile phones, and TV screen come in all shapes and sizes. To ship a game, you'll need to support different screen ratios and resolutions. It can be hard to build responsive interfaces that adapt to all platforms. Thankfully, Godot comes with robust tools to design and manage a responsive User Interface. To design your UI, you'll use the Control nodes. These are the nodes with green icons in the editor. There are dozens of them, to create anything from life bars to complex applications. Godot's entire editor and plugins use these nodes.
ko: 컴퓨터 디스플레이, 모바일 폰, 그리고 TV 화면은 모든 크기와 모양을 갖습니다. 게임을 출시하려면, 당신은 다양한 화면 비율과 해상도를 지원해야 합니다. 모든 플랫폼에 적용되는 반응형 인터페이스를 만드는 것은 어려울 수 있습니다. 감사하게도, Godot의 든든한 도구들로 반응형 인터페이스를 제작하고 관리할 수 있습니다. UI를 설계하기 위해선, 당신은 Control 노드들을 사용할 겁니다. 이들은 에디터 내 초록 아이콘을 갖고 있는 노드입니다. 이들은 많기 때문에 체력 막대부터 복잡한 애플리케이션까지 만들 수 있습니다. Godot의 모든 에디터와 플러그인은 이 노드들을 사용합니다.

source: The five most useful control nodes to build your games’ interface
ko: 게임 인터페이스를 제작하는 가장 유용한 다섯 가지 컨트롤 노드들
pt_br: Os cinco nós de controle mais úteis para criar a interface dos seus jogos

source: The five most common containers
ko: 가장 일반적인 다섯 가지 컨테이너
pt_br: Os cinco contêineres mais comuns

source: Only use Control nodes when you design your interfaces. They have unique properties that allow them to work with one another. Other nodes, like Node2D, Sprite, etc. will not work. You can still use some nodes that work with others, like the AnimationPlayer, Tween or the StreamPlayer. Control nodes are CanvasItems like Node2D, so you can apply shaders to them.
ko: 인터페이스를 설계할 때 오직 컨트롤 노드만 사용하세요. 그들은 서로 상호작용하는 독특한 속성을 지닙니다. Node2D, Sprite 등 과 같은 다른 노드들은 할 수 없습니다. 당신은 AnimationPlayer나 Tween, StreamPlayer같은 다른 노드들과 작동하는 일부 노드들을 사용할 수 있습니다. 컨트롤 노드는 Node2D와 같은 CanvasItems이므로, 그것들에 쉐이더를 적용할 수 있습니다.

source: ``Scale On Expand (compat)`` scales the texture to fit the node’s bounding rectangle, only if ``expand`` property is ``true``; otherwise, it behaves like ``Keep`` mode. Default mode for backwards compatibility.
ko: ``Scale On Expand (compat)`` 는 오직 ``expand`` 속성이 ``true`` 로 되어 있을 때 텍스쳐가 노드의 경계 사각형에 꽉 차도록 크기를 조절하고; 그렇지 않으면 이것은 ``Keep`` 모드와 다르지 않습니다. 호환성을 되돌리기 위한 기본 모드.
pt_br: ``Scale On Expand (compat)`` redimensiona a textura para se ajustar ao retângulo delimitador do nó, somente se a propriedade ``expand`` for ``true``; caso contrário, ele se comporta como o modo ``Keep``. Modo padrão para compatibilidade com versões anteriores.

source: ``Scale`` scales the texture to fit the node’s bounding rectangle
ko: ``Scale`` 은 텍스쳐가 노드의 경계 사각형에 꽉 차도록 크기를 조절합니다
pt_br: ``Scale`` redimensiona a textura para caber no retângulo delimitador do nó

source: ``Tile`` makes the texture repeat, but it won't scale
ko: ``Tile`` 은 텍스쳐가 바둑판으로 배열되도록 만들고, 크기를 조절하지 않습니다
pt_br: ``Tile`` faz a textura repetir, mas não vai escalar
