Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_main_menu.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: The order in which you nest matters. To see if your UI adapts nicely to different screen ratios, select the root node, press :kbd:`Q` to activate the Select Mode, select the container and click and drag on one of the container's corners to resize it. The UI components should flow inside of it.
cs: Na pořadí, ve kterém zanořujete, záleží. Chcete-li zjistit, zda se vaše uživatelská rozhraní pěkně přizpůsobí různým poměrům obrazovky, vyberte kořenový uzel, stisknutím :kbd:`Q` aktivujte režim výběru, vyberte kontejner a kliknutím a tažením jednoho z rohů kontejneru jej změňte. Komponenty uživatelského rozhraní by měly uvnitř měnit polohu.
de: Die Reihenfolge der Verschachtelung ist entscheidend. Um zu sehen, ob sich Ihre UI ordentlich an verschiedene Seitenverhältnisse anpasst, wählen Sie den Wurzel-Node, drücken die Taste :kbd:`Q`, um den Auswahlmodus zu aktivieren, wählen den Container aus und ziehen an einer seiner Ecken, um die Größe zu ändern. Die UI-Komponenten darin sollten sich dynamisch anpassen.
ja: ネストの順序が重要です。UIがさまざまな画面比率にうまく適応しているかどうかを確認するには、ルートノードを選択し、\ :kbd:`Q` を押して[選択モード]をアクティブにしてコンテナを選択し、コンテナのコーナーの1つをクリック&ドラッグしてサイズを変更します。UIコンポーネントはその内部を流れて移動する必要があります。
ko: 여러분이 중첩한 순서가 중요합니다. UI가 서로 다른 화면 비율에 잘 적응하는지 확인하려면 루트 노드를 선택하고 :kbd:`Q`\ 를 눌러 선택 모드를 활성화하고 컨테이너를 선택한 다음 컨테이너의 모서리 중 하나를 클릭해 크기를 조정하세요. UI 구성 요소는 UI 안에서 움직여야 합니다.
ru: Порядок, в котором вы располагаете узлы, имеет значение. Чтобы убедиться, что UI хорошо адаптируется к разным соотношениям экрана, выберите корневой узел, нажмите клавишу :kbd:`Q`, чтобы активировать "Режим Выделения". Выберите контейнер, нажмите и перетащите один из углов контейнера, чтобы изменить его размер. Компоненты UI должны "течь" внутри него.
uk: Порядок, в якому ви розміщуєте вузли, має значення. Щоб побачити, чи ваш інтерфейс користувача добре адаптується до різних співвідношень екрана, виберіть кореневий вузол, натисніть клавішу :kbd:`Q`, щоб активувати режим вибору, виберіть контейнер і натисніть та перетягніть один з кутів контейнера, щоб змінити його розмір. Компоненти інтерфейсу повинні текти всередині нього.
zh_tw: 嵌套的順序很重要。如果要看看你做出來的 UI 有沒有正確反映在不同的螢幕長寬比上，可以先選擇根節點，然後按鍵盤 :kbd:`Q` 來開啟選擇模式 (Select Mode)，接著選擇 Container 並拖曳 Container 的角落來縮放。UI 元素應該會在 Container 當中流暢移動。

source: You'll notice that although containers move sprites around, they don't scale them. This is normal. We want the UI system to handle different screen ratios, but we also need the entire game to adapt to different screen resolutions. To do this, Godot scales the entire window up and down.
cs: Všimněte si, že ačkoli kontejnery přemisťují sprity, nemění je. To je normální chování. Chceme totiž, aby systém UI zvládal různé poměry obrazovky, ale také potřebujeme, aby se celá hra přizpůsobila různým rozlišením obrazovky. Za tímto účelem Godot škáluje celé okno nahoru a dolů.
de: Ihnen wird auffallen, dass Sprites zwar von Containern verschoben, aber nicht in ihrer Größe geändert werden. Das ist normal. Wir wollen, dass das UI-System mit unterschiedliche Bildschirmgrößen umgehen kann, aber wir müssen auch das ganze Spiel an verschiedene Bildschirmauflösungen anpassen. Zu diesem Zweck vergrößert und verkleinert Godot das gesamte Fenster.
es: Notarás que aunque los containers mueven los sprites, no los escalan. Esto es normal. Queremos que el sistema de UI maneje diferentes proporciones de pantalla, pero también necesitamos que todo el juego se adapte a diferentes resoluciones de pantalla. Para hacer esto, Godot escala toda la ventana hacia arriba y hacia abajo.
fr: Vous noterez que bien que les conteneurs déplacent les sprites, ils ne les redimensionnent pas. C'est tout à fait normal. Nous voulons que le système d'interface puisse gérer différents ratios d'écrans mais nous avons aussi besoin d'adapter le jeu à des résolutions différentes. Pour cette raison, Godot redimensionne la fenêtre dans son intégralité.
ja: コンテナはスプライトを動かしていますが、スケーリングはしていません。これは正常です。UIシステムがさまざまな画面比率を処理できるようにしたいのですが、ゲーム全体をさまざまな画面解像度に適応させる必要もあります。これを行うために、Godotはウィンドウ全体を上下にスケーリングします。
ko: 컨테이너가 스프라이트를 움직이지만 스프라이트의 크기를 조정하지는 않습니다. 정상입니다. UI 시스템이 서로 다른 화면 비율을 처리하기를 원하지만, 전체 게임이 서로 다른 화면 해상도에 알맞게 처리되어야 합니다. 이를 위해 Godot는 전체 창의 크기를 위아래로 조정합니다.
pt_br: Você notará que, embora os contêineres movam as sprites, eles não as escalonam. Isto é normal. Queremos que o sistema de interface do usuário manipule diferentes proporções de tela, mas também precisamos que o jogo inteiro se adapte a diferentes resoluções de tela. Para fazer isso, Godot escala a janela inteira para cima e para baixo.
ru: Вы заметите, что, хотя контейнеры перемещают спрайты вокруг, они не масштабируют их. Это нормально. Мы хотим, чтобы система могла обрабатывать различные коэффициенты экрана, но нам также нужно чтобы вся игра адаптировалась к различным разрешениям экрана. Для этого Godot масштабирует все окно вверх и вниз.
uk: Ви помітите, що хоча контейнери переміщають спрайти, вони не масштабують їх. Це нормально. Ми хочемо, щоб система інтерфейсу користувалася різними співвідношеннями екранів, але для адаптації до різних роздільних можливостей екрана нам також потрібна вся гра. Для цього Godot масштабує все вікно вгору та вниз.
zh_cn: 您会注意到，尽管容器在周围移动精灵，但不会缩放它们。这是正常的。我们希望UI系统能够处理不同的屏幕比例，但是我们还需要整个游戏来适应不同的屏幕分辨率。为此，Godot将上下缩放整个窗口。
zh_tw: 你可能有發現，雖然 Container 會移動 Sprite，但是並不會對 Sprite 進行縮放。這很正常，因為我們除了要讓 UI 系統可以處理不同的螢幕比率，還需要讓整個遊戲都能配合不同的螢幕解析度。為此，Godot 會將整個視窗進行縮放。

source: You can change the scale mode in the project settings: click **Project > Project Settings** in the top menu. In the window's left column, look for the **Display** category. Click on the **Window** sub-category. On the right side of the window, you'll find a **Stretch** section. The three settings, **Mode**, **Aspect**, and **Shrink**, control the screen size. For more information, see :ref:`doc_multiple_resolutions`.
cs: Režim pro chování měřítka můžete změnit v nastavení projektu: v horní nabídce klikněte na **Projekt > Nastavení projektu**. V levém sloupci okna vyhledejte kategorii **Display**. Klikněte na podkategorii **Okno**. Na pravé straně okna najdete sekci **Stretch**. Tři nastavení, **Mode**, **Aspect**, a **Shrink**, řídí velikost obrazovky. Další informace naleznete v tématu :ref:`doc_multiple_resolutions`.
de: Sie können den Skalierungsmodus in den Projekteinstellungen ändern: klicken Sie auf **Projekt -> Projekteinstellungen**. Suchen Sie in der linken Fensterspalte nach der Kategorie **Display**. Klicke auf das Untermenü **Window**. Auf der rechten Fensterseite finden Sie einen Punkt namens **Stretch**. Die drei Einstellungen **Mode**,** Aspect** und **Shrink** steuern die Bildschirmgröße. Siehe :ref:`doc_multiple_resolutions` für weitere Informationen.
ja: プロジェクト設定でスケールモードを変更するには、上部メニューから\ **プロジェクト → プロジェクト設定** をクリックします。ウィンドウ左側のカラムにある、\ **Display**\ カテゴリを探します。\ **Window**\ サブカテゴリをクリックします。ウィンドウの右側に、\ **Stretch**\ セクションがあります。\ **Mode**\ 、\ **Aspect**\ 、\ **Shrink**\ の3つの設定は、画面サイズを制御します。詳細については、\ :ref:`doc_multiple_resolutions`\ を参照してください。
ko: 프로젝트 설정에서 크기 조절 모드를 변경할 수 있습니다. 위쪽 메뉴에서 **프로젝트(Project) > 프로젝트 설정(Project Settings)**\ 을 클릭하세요. 창의 왼쪽 열에서 **디스플레이** 카테고리를 찾으세요. **Windows** 하위 카테고리를 클릭하세요. 창 오른쪽에 **Stretch** 섹션이 있습니다. **Mode**, **Aspect**, **Shrink**\ 의 세 가지 설정은 화면 크기를 제어합니다. 자세한 내용은 :ref:`doc_multiple_resolutions`\ 를 읽어보세요.
ru: Вы можете изменить режим масштабирования в настройках проекта: выберите меню **Проект > Настройки проекта**. В левом столбце найдите категорию **Экран**. Нажмите на под категорию **Окна**. В правой части окна вы найдете раздел **Растяжение**. Три параметра, **Режим**,** Aspect** и **Shrink** управляют размером экрана. Для получения дополнительной информации см.: :ref:`doc_multiple_resolutions`.
uk: Ви можете змінити режим масштабування у параметрах проєкту: натисніть **Проєкт> Параметри проєкту** у верхньому меню. У лівій колонці вікна шукайте розділ **Display** ("Відображення"). Клацніть на підрозділ **Window**. У правій частині вікна ви знайдете розділ **Stretch** (Розтягування). Три налаштування **Mode** (Режим), **Aspect** (Аспект), і **Shrink** (Зменшення), керують розміром екрана. Для отримання додаткової інформації дивіться :ref:`doc_multiple_resolutions`.
zh_cn: 您可以在项目设置中更改缩放模式：点击项目菜单 -> 项目设置。在窗口的左列中，查找显示类别。点击窗口子类别。在窗口的右边，您会找到一个叫 **Stretch** 的部分。三个设置，模式、纵横比、和缩小，控制屏幕的大小。有关更多信息，请参见 :ref:`doc_multiple_resolutions`。
zh_tw: 你可以在專案設定中修改縮放模式：在頂部選單中點擊 **專案 > 專案設定** 。在視窗左邊找到 **Display（顯示）** 分類，點擊 **Window（視窗）** 子分類。再來可以在視窗的右邊找到 **Stretch（拉伸）** 段落。其中的三個設定： **Mode（模式）** 、 **Aspect（比率）** 、與 **Shrink（延展）** 可以控制螢幕的大小。詳細資訊請參考 :ref:`doc_multiple_resolutions` 。

source: A main menu
es: El menú principal
fr: Un menu principal
pt_br: Um menu inicial

source: A game UI with a health bar, energy bar, bomb and money counters
es: Una UI de juego con barra de salud, barra de energía, contadores de bombas y dinero
fr: Une interface utilisateur de jeu avec une barre de santé, une barre d'énergie, une bombe et des compteurs d'argent
pt_br: Um UI de jogo com uma barra de vida, barra de energia e contador de bombas e dinheiro

source: You will learn how to design game UIs efficiently, and how to use Godot's Control nodes. This page focuses on the visual part: everything you do from the editor. To learn how to code a life bar, read :doc:`ui_code_a_life_bar`
fr: Vous allez apprendre comment concevoir une interface utilisateur (UI) efficace et comment utiliser les nœuds de contrôle de Godot. Cette page se focalise sur la partie visuelle : tout ce qui est fait depuis l'éditeur. Pour apprendre à coder une barre de vie, lisez :doc:`ui_code_a_life_bar`

source: The GUI you're going to create
es: El GUI que vas a crear
fr: L'interface graphique que vous allez créer
pt_br: A GUI que você vai criar

source: The graphics might skew the players' perception of the experience and you'll miss out on valuable feedback
es: Los gráficos pueden distorsionar la percepción de los jugadores sobre la experiencia y te perderás un valioso feedback
fr: Les graphismes peuvent fausser la perception du joueur durant l’expérience et vous passeriez à côté de précieux retours
pt_br: Os gráficos podem distorcer a percepção dos jogadores sobre a experiência e você perderá um feedback valioso

source: If the User Experience doesn't work, you'll have to redo some sprites
es: Si la Experiencia de Usuario no funciona, tendrás que rehacer algunos sprites
fr: Si l'Expérience Utilisateur (UX) n'est pas bien, vous aurez à refaire des sprites
pt_br: Se a Experiência do Usuário não funcionar, você terá que refazer alguns sprites

source: Build it all in a single scene, and eventually save some branches as reusable scenes
es: Constrúyelo todo en una sola escena, y eventualmente guarda algunas ramas como escenas reutilizables
fr: Tout construire en une seule scène, et éventuellement sauvegarder certaines branches pour en faire des scènes réutilisables
pt_br: Construa tudo em uma única cena e, eventualmente, salve alguns ramos como cenas reutilizáveis

source: Build template scenes for reusable components and create specific components that inherit from your base scenes
es: Crea escenas de plantilla para componentes reutilizables y crea componentes específicos que heredan de tus escenas base
fr: Créer des scènes modèles pour les composants réutilisables et créer des composants spécifiques qui héritent de vos scènes de base
pt_br: Crie modelos de cenas para componentes reutilizáveis e crie componentes específicos que herdam de suas cenas base

source: We will use the first approach, because the first version of your UI may not work as well as you’d like. You’re likely to throw parts away and redesign components as you go. When you're sure everything works, it's easy to make some parts reusable, as you'll see below.
es: Usaremos el primer enfoque, porque la primera versión de tu UI puede no funcionar tan bien como quisieras. Es probable que se deshaga de algunas partes y se rediseñe los componentes a medida que se avanza. Cuando estés seguro de que todo funciona, es fácil hacer que algunas partes sean reutilizables, como podrás ver a continuación.
fr: Nous utiliserons la première approche, car la première version de votre interface utilisateur pourrait ne pas fonctionner aussi bien que vous le souhaitez. Vous risquez de jeter des parties de votre interface et de redessiner des composants au fur et à mesure. Lorsque vous êtes sûr que tout fonctionne, il est facile de rendre certaines parties réutilisables, comme vous le verrez ci-dessous.
pt_br: Usaremos a primeira abordagem, porque a primeira versão da sua interface do usuário pode não funcionar tão bem quanto você gostaria. É provável que você jogue partes fora e redesenhe os componentes à medida que avança. Quando você tem certeza de que tudo funciona, é fácil tornar algumas peças reutilizáveis, como você verá abaixo.

source: The files you'll find in Godot. The graphics look cleaner than on the rough design, but they're still placeholders
es: Los archivos que encontrarás en Godot. Los gráficos se ven más limpios que en el diseño preliminar, pero siguen siendo marcadores de posición
fr: Les fichiers que vous trouverez dans Godot. Les graphiques paraissent plus propre que sur le dessin, mais ce sont quand même des placeholders
pt_br: Os arquivos que você encontrará no Godot. Os gráficos parecem mais limpos do que no esboço de projeto, mas ainda são marcadores de espaço

source: Break down the UI into nested boxes, from the largest that contains everything, to the smallest ones, that encompass one widget, like a bar with its label, a panel or a button
es: Divide la interfaz de usuario en cajas anidadas, desde las más grandes que lo contienen todo, hasta las más pequeñas, que abarcan un widget, como una barra con su etiqueta, un panel o un botón
fr: Décomposez l'interface utilisateur en cases, de la plus grande qui contient tout, aux plus petites, qui englobent un widget, comme une barre avec son étiquette, un panneau ou un bouton
pt_br: Divida a interface do usuário em caixas aninhadas, desde a maior que contém tudo, até as menores, que abrangem um widget, como uma barra com seu rótulo, um painel ou um botão

source: If there's some padding around an area, use a ``MarginContainer``
es: Si hay algún relleno alrededor de un área, usa un ``MarginContainer``
fr: S'il y a un amoncellement autour d'une zone, utilisez un ``MarginContainer``
pt_br: Se houver algum preenchimento em torno de uma área, use um ``MarginContainer``

source: If the elements are arranged in rows or columns, use an ``HBoxContainer`` or ``VBoxContainer``
es: Si los elementos están dispuestos en filas o columnas, utiliza un ```HBoxContainer`` o ```VBoxContainer``
fr: Si les éléments sont disposés en lignes ou en colonnes, utilisez un ``HBoxContainer`` ou un ``VBoxContainer``
pt_br: Se os elementos estiverem dispostos em linhas ou colunas, use um ``HBoxContainer`` ou ``VBoxContainer``

source: Interface building blocks, broken down using the three rules of thumb
es: Elementos básicos de la interfaz, desglosados utilizando las tres reglas generales
fr: Les blocs de construction de l'interface, décomposés selon les trois règles de base
pt_br: Blocos de construção de interface, divididos usando as três regras básicas

source: Let's create the main menu. We'll build it in a single scene. To create an empty scene, click on the Scene menu -> New Scene.
es: Vamos a crear el menú principal. Lo construiremos en una sola escena. Para crear una escena vacía, haz clic en el menú Escena -> Nueva escena.
fr: Créons le menu principal. Nous le construirons en une seule scène. Pour créer une scène vide, cliquez sur le menu Scène -> Nouvelle scène.
pt_br: Vamos criar o menu principal. Nós vamos construir em uma única cena. Para criar uma cena vazia, clique no menu Cena -> Nova Cena.

source: We have to add a root node before we can save the scene. Your UI's root should be the outermost container or element. In this case it's a ``MarginContainer``. ``MarginContainer`` is a good starting point for most interfaces, as you often need padding around the UI. Press ``Meta+S`` to save the scene to the disk. Name it *MainMenu*.
es: Tenemos que añadir un nodo raíz antes de poder guardar la escena. La raíz de tu interfaz debe ser el container o elemento más cercano. En este caso es un ``MarginContainer``. ``MarginContainer`` es un buen punto de partida para la mayoría de las interfaces, ya que a menudo necesita relleno alrededor de la interfaz de usuario. Presiona ``Meta+S`` para guardar la escena en el disco. Nómbrala *MainMenu*.
fr: Nous devons ajouter un nœud racine avant de pouvoir sauvegarder la scène. La racine de votre interface utilisateur doit être le conteneur ou l'élément le plus à l'extérieur. Dans ce cas, il s'agit d'un ``MarginContainer``. Le ``MarginContainer`` est un bon point de départ pour la plupart des interfaces, car vous avez souvent besoin d'espace autour de l'interface utilisateur. Appuyez sur ``Meta+S`` pour enregistrer la scène sur le disque. Nommez-la *MainMenu*.
pt_br: Temos que adicionar um nó raiz antes que possamos salvar a cena. A raiz da sua interface do usuário deve ser o contêiner ou elemento externo. Neste caso, é um ``MarginContainer``. ``MarginContainer`` é um bom ponto de partida para a maioria das interfaces, já que muitas vezes você precisa preencher a interface do usuário. Pressione ``Meta+S`` para salvar a cena no disco. Nomeie-o *MainMenu*.

source: We want the container to fit the window. In the toolbar above the Viewport, open the ``Layout`` menu and select the last option, ``Full Rect``.
fr: Nous voulons que le conteneur s'adapte à la fenêtre. Dans le Viewport, ouvrez le menu ``Layout`` et sélectionnez la dernière option, ``Full Rect``.

source: The title, or logo
es: El título o logo
fr: Du titre, ou logo
pt_br: O título ou logotipo

source: The three text options, as individual nodes
es: Las tres opciones de texto, como nodos individuales
fr: De trois options de texte, en tant que nœuds individuels
pt_br: As três opções de texto, como nós individuais

source: The version note
es: Las notas de la versión
fr: D'une note de version
pt_br: A nota de versão

source: And the main menu’s illustration
es: Y la ilustración del menú principal
fr: Et d'une illustration pour le menu principal
pt_br: E a ilustração do menu principal

source: Click the ``Add Node`` button or press ``Meta+A`` on your keyboard. Start to type ``TextureRect`` to find the corresponding node and press enter. With the new node selected, press ``Meta+D`` five times to create five extra ``TextureRect`` instances.
es: Haz clic en el botón ``Añadir Nodo`` o pulsa ``Meta+A`` en tu teclado. Comienza a escribir ``TextureRect`` para encontrar el nodo correspondiente y presiona enter. Con el nuevo nodo seleccionado, presiona ``Meta+D`` cinco veces para crear cinco instancias adicionales de ``TextureRect``.
fr: Cliquez sur le bouton ``Add Node`` ou appuyez sur les touches ``Meta+A`` de votre clavier. Commencez par taper ``TextureRect`` pour trouver le nœud correspondant et appuyer sur entrer. Avec le nouveau nœud sélectionné, appuyez cinq fois sur les touches ``Meta+D`` pour créer cinq autres instances de ``TextureRect``.
pt_br: Clique no botão ``Add Node`` ou pressione ``Meta+A`` no seu teclado. Comece a digitar ``TextureRect`` para encontrar o nó correspondente e pressione enter. Com o novo nó selecionado, pressione ``Meta+D`` cinco vezes para criar cinco instâncias extras ``TextureRect``.

source: Click each of the nodes to select it. In the inspector, find the ``Texture`` property and click ``[empty]`` -> ``Load``. A file browser opens and lets you pick a sprite to load into the texture slot.
fr: Cliquez sur chacun des nœuds pour le sélectionner. Dans l'inspecteur, trouvez la propriété ``Texture`` et cliquez sur ``[empty]`` -> ``Load``. Un navigateur de fichiers s'ouvre et vous permet de choisir un sprite dans le slot de texture.

source: The file browser lets you find and load textures
es: El navegador de archivos te permite encontrar y cargar texturas
fr: Le navigateur de fichier vous permet de trouver et de charger les textures
pt_br: O navegador de arquivos permite encontrar e carregar texturas

source: The six nodes, with textures loaded
es: Los seis nodos, con texturas cargadas
fr: Les six nœuds, avec des textures chargées
pt_br: Os seis nós, com texturas carregadas

source: Our main menu has some margin around the edges of the screen. It is split in two parts: on the left, you have the logo and the menu options. On the right, you have the characters. We can use one of two containers to achieve this: ``HSplitContainer`` or ``HBoxContainer``. Split containers split the area into two: a left and a right side or a top and a bottom side. They also allow the user to resize the left and right areas using an interactive bar. On the other hand, ``HBoxContainer`` just splits itself into as many columns as it has children. Although you can deactivate the split container's resize behaviour, I recommend to favour box containers.
es: Nuestro menú principal tiene algún margen alrededor de los bordes de la pantalla. Está dividido en dos partes: a la izquierda, tiene el logotipo y las opciones del menú. A la derecha, tienes los personajes. Podemos utilizar uno de dos containers para conseguirlo: ``HSplitContainer`` o ``HBoxContainer``. Los split containers dividen el área en dos: un lado izquierdo y un lado derecho o un lado superior y un lado inferior. También permiten al usuario cambiar el tamaño de las áreas izquierda y derecha mediante una barra interactiva. Por otro lado, ``HBoxContainer`` simplemente se divide en tantas columnas como hijos tenga. Aunque se puede desactivar el comportamiento de redimensionamiento del split container, se recomienda utilizar los box containers.
fr: Notre menu principal a une certaine marge autour des bords de l'écran. Il est divisé en deux parties : A gauche, vous avez le logo et les options de menu. A droite, vous avez les personnages. Nous pouvons utiliser l'un des deux conteneurs pour y parvenir : ``HSplitContainer`` ou ``HBoxContainer``. Les conteneurs divisés divisent la zone en deux : un côté gauche et un côté droit ou un côté supérieur et un côté inférieur. Ils permettent également à l'utilisateur de redimensionner les zones gauche et droite à l'aide d'une barre interactive. D'un autre côté, "HBoxContainer" se divise en autant de colonnes qu'il y a d'enfants. Bien que vous puissiez désactiver le comportement de redimensionnement de la division du conteneur, je recommande de privilégier les conteneurs Box.
pt_br: Nosso menu principal tem alguma margem ao redor das bordas da tela. É dividido em duas partes: à esquerda, você tem o logotipo e as opções de menu. À direita, você tem os personagens. Podemos usar um dos dois contêineres para conseguir isso: ``HSplitContainer`` ou ``HBoxContainer``. Os contêineres divididos dividem a área em dois: um lado esquerdo e um lado direito ou um lado superior e um lado inferior. Eles também permitem que o usuário redimensione as áreas esquerda e direita usando uma barra interativa. Por outro lado, o ``HBoxContainer`` apenas se divide em tantas colunas quanto suas filhas. Embora você possa desativar o comportamento de redimensionamento do contêiner de divisão, recomendo favorecer os box contêineres.

source: You should have four nested containers, and the TextureRect nodes sitting aside from it
es: Deberías tener cuatro contenedores anidados, y los nodos TextureRect situados a un lado de éstos
fr: Vous devriez avoir quatre conteneurs imbriqués, et les nœuds TextureRect placés à côté de celui-ci
pt_br: Você deve ter quatro contêineres aninhados e os nós TextureRect separados deles
