Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_main_menu.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: We will use the first approach, because the first version of your UI may not work as well as you'd like. You're likely to throw parts away and redesign components as you go. When you're sure everything works, it's easy to make some parts reusable, as you'll see below.
cs: Použijeme první přístup, protože první verze vašeho uživatelského rozhraní nemusí fungovat od začátku tak, jak byste chtěli. Pravděpodobně při tvorbě někteé části zahodíte a jiné upravíte. Když jste si jistí, že všechno funguje, tak jak jste zamýšleli, je snadné použít některé části znovu, ukážeme si to níže.
de: Wir werden den ersten Ansatz verwenden, weil die erste Version Ihres UI möglicherweise nicht so gut klappen wird wie Sie es gerne hätten. Sie werden wahrscheinlich Teile wieder verwerfen und Komponenten mit der Zeit überarbeiten. Wenn Sie sich sicher sind dass alles funktioniert, können einige Teile ganz einfach wieder verwendbar gemacht werden, wie weiter unten gezeigt wird.
ja: ここでは最初の方法を使います。UIの最初のバージョンは期待どおりには動作しない場合があるためです。そうなると、パーツを廃棄してコンポーネントを１から作り直すことになるでしょう。次に示すように、うまく機能していることが確認してから、一部のパーツを再利用可能にすることは簡単です。
ko: UI의 첫 번째 버전이 원하는 대로 작동하지 않을 수 있으므로 우리는 첫 번째 방법을 사용할 것입니다. 여러분은 부품을 버리거나 재설계할 가능성이 높습니다. 모든 것이 제대로 작동한다고 확신하면 아래에서 볼 수 있듯이 일부 부품을 쉽게 재사용할 수 있습니다.
ru: Мы будем использовать первый подход, потому что первая версия вашего пользовательского интерфейса может работать не так хорошо, как хотелось бы. Вы, скорее всего, отбросите некоторые части и переработаете компоненты интерфейса. Когда вы уверены, что все работает, легко сделать некоторые части многоразовыми, как показано ниже.
uk: Ми будемо використовувати перший підхід, оскільки перша версія вашого інтерфейсу може працювати не так добре, як вам хотілося б. Ви, ймовірно, будете викидати певні деталі та переробляти окремі компоненти. Коли ви будете впевнені, що все працює, то зможете легко зробити необхідні частини багаторазовими, як побачите нижче.
zh_tw: 這裡我們會使用第一種方法，因為初版的 UI 通常會與你所與其的樣子有所落差，會有一些部分是你想扔掉並重新設計的。當確定所有東西都做好了以後，便能輕鬆整理出可重複使用的部分。這點我們稍後會看到。

source: The files you'll find in Godot. The graphics look cleaner than on the rough design, but they're still placeholders.
cs: Soubory, které najdete v Godotu. Grafika vypadá čistěji než v hrubém designu, ale stále jsou to zástupné symboly.
de: Die Dateien finden Sie in Godot. Die Grafik sieht sauberer als beim groben Entwurf aus, aber sie ist lediglich immer noch ein Platzhalter.
ja: Godotにあるファイル。このグラフィックはラフデザインよりもきれいに見えますが、まだその代替品にすぎません。
ko: Godot에서 찾을 수 있는 파일. 그래픽은 대략적인 디자인보다 더 깔끔해 보이지만, 여전히 플레이스홀더입니다.
ru: Файлы, которые вы увидите в Godot. Графика выглядит лучше, чем в грубом дизайне, но все еще является незавершенной.
uk: Файли, які ви знайдете в Godot. Графіка виглядає краще, ніж на чернетці, але все ще потребує вдосконалення.
zh_cn: 在Godot中可以看到下载的文件。(简单的)图形看起来非常整洁，这比粗糙的设计更有视觉上的优势（能更好地表达你的意图）。但它们仍然是作为一个占位符来使用的。
zh_tw: 在 Godot 中可以看到的檔案。這些圖片看起來比粗略的設計還要簡潔，但依然算是預留位置用的。

source: Design the main menu
cs: Navrhněte hlavní menu
de: Entwerfe das Hauptmenü
es: Diseñar el menú principal
fr: Construire le menu principal
ja: メインメニューのデザイン
ko: 메인 메뉴 디자인하기
pt_br: Projetar o menu principal
ru: Проектирование главного меню
uk: Проєктування головного меню
zh_cn: 设计主菜单
zh_tw: 設計主選單

source: Before we jump into the editor, we want to plan how we'll nest containers based on our mockup image.
cs: Než skočíme do editoru, naplánujeme si podle našeho nákresu, jak budeme zanořovat jednotlivé kontejnery.
de: Bevor wir in den Editor einsteigen, wollen wir planen, wie wir Container nach unserer Vorlage verschachteln werden.
es: Antes de entrar en el editor, queremos planear cómo anidaremos los containers basados en nuestra imagen de prototipo.
fr: Avant de passer à l'éditeur, nous voulons planifier comment nous imbriquerons les conteneurs basés sur notre maquette.
ja: エディタに入る前に、モックアップイメージに基づいてコンテナーをネストする方法を計画します。
ko: 에디터로 이동하기 전에 목업 이미지를 기반으로 컨테이너를 쌓아올리는 방법을 계획하고 싶습니다.
pt_br: Antes de entrarmos no editor, queremos planejar como aninharemos os contêineres com base em nossa imagem do protótipo.
ru: Прежде чем перейти к редактору, мы планируем расположение контейнеров на основе нашего макета.
uk: Перш ніж зайти в редактор, слід, на основі нашого макета, спланувати, як вкладати контейнери.
zh_cn: 在进入编辑器之前，我们要计划如何基于模型图像嵌套容器。
zh_tw: 在我們進入編輯器以前，必須先依據打樣圖來計劃如何嵌套容器。

source: Break down the UI mockup
cs: Rozbor návrhu uživatelského rozhraní
de: Aufgliederung des UI-Entwurfs
es: Desglosar el prototipo de UI
fr: Décomposez la maquette de l'interface utilisateur
ja: UIモックアップを分割
ko: UI 목업 파헤치기
pt_br: Divida o protótipo da interface do usuário
ru: Краш-тест UI макета
uk: Розбивання макета інтерфейсу
zh_cn: 分解UI模型
zh_tw: 進一步分解 UI 打樣圖

source: Here are my three rules of thumb to find the right containers:
cs: Zde jsou moje tři základní pravidla pro nalezení vhodných kontejnerů:
de: Hier sind meine drei Faustregeln, wie man die richtigen Container findet:
es: Aquí están mis tres reglas para encontrar los containers correctos:
fr: Voici mes trois règles de base pour trouver les bons conteneurs :
ja: 適切なコンテナを見つけるための3つの経験則を以下に示します:
ko: 올바른 컨테이너를 찾기 위한 저의 경험에 바탕을 둔 세 가지 법칙은 다음과 같습니다:
pt_br: Aqui estão minhas três regras básicas para encontrar os contêineres certos:
ru: Это мои три правила большого пальца, чтобы подобрать правильный контейнер:
uk: Ось три правила, завдяки яким я підбираю правильні контейнери:
zh_cn: 这是我找到合适容器的三个经验法则：
zh_tw: 可以通過下列三條經驗法則來選擇適合的容器：

source: Break down the UI into nested boxes, from the largest that contains everything, to the smallest ones, that encompass one widget, like a bar with its label, a panel or a button.
cs: Rozdělte uživatelské rozhraní do vnořených polí, od největšího, který obsahuje vše, po nejmenší, které zahrnuje jeden widget, jako je např. panel s popiskem, panel nebo tlačítko.
de: Unterteile die Benutzeroberfläche in verschachtelte Kästen, vom Größten, der alles umfasst, bis zum Kleinsten, der ein einzelnes Element beinhaltet, wie eine Leiste mit ihrer Beschriftung, ein Panel oder eine Schaltfläche.
ja: UIを、すべてを含む最大のボックスから、ラベルの付いたバー、パネル、ボタンなどの、1つのウィジェットを含む最小のボックスまで、ボックスに階層構造を持たせて分割します。
ko: 모든 것을 포함하는 가장 큰 상자부터 레이블이 있는 바, 패널 또는 버튼과 같이 하나의 위젯을 포함하는 가장 작은 상자에 이르기까지 UI를 중첩된 상자로 나눕니다.
ru: Разбейте пользовательский интерфейс на вложенные контейнеры, от большого, в котором содержится все, до маленького, содержащего один виджет, например с полоской состояния и ее названием, панелью или кнопкой.
uk: Розбийте інтерфейс на вкладені поля - від найбільшого, що містить усе, до найменших, що містять один віджет, як-от шкалу, панель, чи кнопку.
zh_cn: 将UI分解为嵌套的盒式结构。从包含所有内容的最大盒子，到包含一个像带有标签的进度条、面板或按钮这样的小部件的小盒子。所有一切都是盒子。
zh_tw: 將 UI 拆解成互相嵌套的框框。最大的框框包含所有東西，而最小框框的則放置一些如帶有標籤的進度條或有按鈕的面板之類的單一界面元素。

source: If there's some padding around an area, use a ``MarginContainer``.
cs: Pokud má oblast nějaký vnitřní okraj (padding), použijte ``MarginContainer``.
de: Wenn ein gewisser Abstand um eine Fläche eingehalten werden soll, verwende einen ``MarginContainer``.
ja: 領域の周囲に余白がある場合は、\ ``MarginContainer`` を使用します。
ko: 영역 주변에 여백을 만들려면, ``MarginContainer``\ 를 사용하세요.
ru: Если требуются некоторые отступы вокруг участка, используйте ``MarginContainer``.
uk: Якщо навколо області є якийсь простір, використовуйте ``MarginContainer``.
zh_cn: 如果一个区域周围有一些填充，使用 ``MarginContainer``。
zh_tw: 如果框框的周圍有內邊距，則使用 ``MarginContainer`` 。

source: If the elements are arranged in rows or columns, use an ``HBoxContainer`` or ``VBoxContainer``.
cs: Pokud jsou prvky uspořádány do řádků nebo sloupců, použijte ``HBoxContainer`` nebo ``VBoxContainer``.
de: Wenn die Elemente in Zeilen oder Spalten angeordnet sind, verwende einen ``HBoxContainer`` oder ``VBoxContainer``.
ja: 要素が行または列に配置されている場合は、 ``HBoxContainer`` または ``VBoxContainer`` を使用します。
ko: 요소를 행 또는 열로 배열한다면, ``HBoxContainer`` 또는 ``VBoxContainer``\ 를 사용하세요.
ru: Если элементы расположены в строках или столбцах, используйте ``HBoxContainer`` или ``VBoxContainer``.
uk: Якщо елементи розташовані в рядках, або стовпцях, використовуйте ``HBoxContainer``, або ``VBoxContainer``.
zh_cn: 如果元素是按行或列组织的，请使用 ``HBoxContainer`` 或 ``VBoxContainer``组件。
zh_tw: 如果元素是使用行或列來排列的，則使用 ``HBoxContainer`` 或 ``VBoxContainer`` 。

source: These rules are enough to get us started, and work well for simple interfaces.
cs: Tato pravidla nám pro začátek stačí a pro jednoduchá rozhraní fungují dobře.
de: Diese Regeln reichen für den Anfang aus und klappen bei einfachen Oberflächen recht gut.
es: Estas reglas son suficientes para empezar, y funcionan bien para interfaces sencillas.
fr: Ces règles sont suffisantes pour nous permettre de démarrer, et fonctionnent bien pour des interfaces simples.
ja: これらの規則は、私たちが始めるために十分なものであり、単純なインターフェースに対してはうまく機能します。
ko: 이러한 규칙은 우리가 시작하기에도 충분하고, 간단한 인터페이스에 대해서도 잘 작동합니다.
pt_br: Essas regras são suficientes para começar e funcionam bem para interfaces simples.
ru: Этих правил достаточно, чтобы начать, и хорошо работать с простыми интерфейсами.
uk: Цих правил достатньо, щоб почати і успішно працювати з простими інтерфейсами.
zh_cn: 这些规则足以使我们入门，并且对于简单的界面也能很好地工作。
zh_tw: 有了這些規則就足夠我們入門了，而且也適用於簡單的界面。

source: For the main menu, the largest box is the entire game window. There's padding between the edges of the window and the first components: this should be a ``MarginContainer``. Then, the screen is split into two columns, so we'll use an ``HBoxContainer``. In the left column, we'll manage the rows with a ``VBoxContainer``. And in the right column, we'll center the illustration with a ``CenterContainer``.
cs: V hlavní nabídce je největším oknem celé herní okno. Mezi okraji okna a prvními komponenty je výplň (padding - vnitřní okraj): to by měl zajistit ``MarginContainer``. Dále je obrazovka rozdělena do dvou sloupců, takže použijeme ``HBoxContainer``. V levém sloupci spravujeme řádky pomocí ``VBoxContainer``. A v pravém sloupci vycentrujeme obrázek pomocí ``CenterContainer``.
de: Beim Hauptmenü ist der größte Kasten das gesamte Spielefenster. Zwischen den Rändern des Fensters und den ersten Komponenten ist ein Abstand: das sollte ein ``MarginContainer`` sein. Dann wird der Bildschirm in zwei Spalten unterteilt, also verwenden wir einen ``HBoxContainer``. Die Reihen in der linken Spalte werden mit einem ``VBoxContainer`` angeordnet. Und in der rechten Spalte richten wir die Illustration mithilfe eines ``CenterContainer`` s mittig aus.
es: Para el menú principal, la caja más grande es toda la ventana del juego. Hay relleno entre los bordes de la ventana y los primeros componentes: debería ser un ``MarginContainer``. Luego, la pantalla se divide en dos columnas, por lo que usaremos un ``HBoxContainer``. En la columna de la izquierda, controlaremos las filas con un ``VBoxContainer``. Y en la columna de la derecha, centraremos la ilustración con un ``CenterContainer``.
fr: Pour le menu principal, la case la plus grande est la fenêtre du jeu dans sa totalité. Il y a un amoncellement entre les bords de la fenêtre et les premiers composants : cela devrait être un ``MarginContainer``. Ensuite, l'écran est divisé en deux colonnes, nous utiliserons donc un ``HBoxContainer``. Dans la colonne de gauche, nous allons gérer les lignes avec un ``VBoxContainer``. Et dans la colonne de droite, nous centrerons l'illustration avec un ``CenterContainer``.
ja: メインメニューでは、最大のボックスはゲームウィンドウ全体です。ウィンドウの端と最初のコンポーネントの間には余白があります。これは ``MarginContainer`` にする必要があります。次に、画面は2列に分割されているので、 ``HBoxContainer`` を使用します。左側の列では、 ``VBoxContainer`` を使用して行を管理します。 右側の列では、 ``CenterContainer`` を使用して図の中央に配置します。
ko: 주 메뉴의 경우 가장 큰 상자가 전체 게임 창입니다. 창의 가장자리와 첫 번째 구성 요소 사이에 여백이 있습니다. 이것은 ``MarginContainer``\ 여야 합니다. 그런 다음 화면이 두 개의 열로 분할되므로 ``HBoxContainer``\ 를 사용합니다. 왼쪽 열에서 ``VBoxContainer``\ 로 행을 관리합니다. 그리고 오른쪽 열에서는 그림을 ``CenterContainer``\ 로 중앙에 배치합니다.
pt_br: Para o menu principal, a maior caixa é a janela inteira do jogo. Há espaçamento entre as bordas da janela e os primeiros componentes: isso deve ser um ``MarginContainer``. Então, a tela é dividida em duas colunas, então usaremos um ``HBoxContainer``. Na coluna da esquerda, vamos gerenciar as linhas com um ``VBoxContainer``. E na coluna da direita, vamos centralizar a ilustração com um ``CenterContainer``.
ru: Главное меню, это крупнейшее окно всей игры. Есть отступы между краями окна и первого элемента: это должен быть ``MarginContainer``. Затем, экран разделяется на две колонки, так что мы будем использовать ``HBoxContainer``. В левой колонке мы будем управлять строками с помощью ``VBoxContainer``. И в правой колонке будет иллюстрация в центре ``CenterContainer``.
uk: В головному меню найбільшим полем є все вікно гри. Між краями вікна та першими компонентами є відступи: це має бути a ``MarginContainer``. Потім екран розбивається на два стовпці, тому ми будемо використовувати ``HBoxContainer``. У лівому стовпці ми будемо керувати рядками з допомогою ``VBoxContainer``. І в правому стовпці ми будемо центрувати ілюстрацію з допомогою ``CenterContainer``.
zh_cn: 对于主菜单，最大的框是整个游戏窗口。窗口的边缘和第一个组件之间有填充：这儿应该使用一个 ``MarginContainer``。然后，将屏幕分为两列，因此我们将使用一个 ``HBoxContainer``。在左栏中，我们将使用一个 ``VBoxContainer`` 来管理行。在右列中，我们将使用一个 ``CenterContainer`` 将插图居中。
zh_tw: 在主選單中，最大的框框就是整個遊戲視窗。在視窗的邊緣與第一個元素中間有留白，所以這裡要使用 ``MarginContainer`` 。接著，畫面分隔成兩列，所以我們要用 ``HBoxContainer`` 。左邊的那一列中我們使用 ``VBoxContainer`` 來處理多行排列。而右邊的那一列則使用 ``CenterContainer`` 來把插圖置中。

source: Interface building blocks, broken down using the three rules of thumb.
cs: Stavební bloky rozhraní, rozdělené podle tří základních pravidel.
de: Bausteine der Benutzeroberfläche, zusammengefasst mithilfe der drei Faustregeln.
ja: 3つの経験則に基づいて分類されたインタフェースの構成要素。
ko: 블록으로 만든 인터페이스. 경험에 근거한 규칙 세 가지를 사용해 나누었습니다.
ru: Блоки интерфейса, разбитые с помощью трёх вышепреведённых правил.
uk: Інтерфейсні блоки, розбиті за допомогою трьох правил.
zh_cn: 构建界面的块，使用上面说到的三个经验法则分解。
zh_tw: 界面的各個區塊。依據上面提到的三個原則來分解。

source: Containers adapt to the window's resolution and width-to-height ratio. Although we could place UI elements by hand, containers are faster, more precise, and **responsive**.
cs: Kontejnery se přizpůsobí rozlišení okna a poměru šířka k výšce. Ačkoli bychom mohli prvky UI umisťovat ručně, kontejnery jsou rychlejší, přesnější a **vnímavější (responzivní)**.
de: Container passen sich an die Auflösung und das Seitenverhältnis des Bildschirms an. Obwohl wir UI-Elemente händisch platzieren könnten, sind Container schneller, genauer und **reaktionsschneller**.
es: Los containers se adaptan a la resolución de la ventana y a la relación ancho/alto. Aunque podemos colocar los elementos de la interfaz de usuario a mano, los containers son más rápidos, más precisos y **responsivos**.
fr: Les conteneurs s'adaptent à la résolution de la fenêtre et au rapport hauteur/largeur. Bien que nous pouvons placer les éléments de l'interface utilisateur à la main, les conteneurs sont plus rapides, plus précis et plus **adaptibles**.
ja: コンテナはウィンドウの解像度と幅と高さの比率に適応します。UI要素を手動で配置することもできますが、コンテナの方が高速で、正確で、\ **応答性に優れています**\ 。
ko: 컨테이너는 창의 해상도 및 가로-세로 비율에 적응합니다. UI 요소를 수작업으로 배치할 수 있지만 컨테이너는 더 빠르고 정확하며 **반응형**\ 입니다.
pt_br: Os contêineres se adaptam à resolução da janela e à proporção largura / altura. Embora pudéssemos colocar os elementos da interface do usuário manualmente, os contêineres são mais rápidos, mais precisos e **responsivos**.
ru: Контейнеры адаптируются к разрешению окна и соотношению ширины к высоте. Хотя мы могли бы разместить элементы UI вручную, но использование контейнеров быстрее, точнее и **отзывчивее(responsive)**.
uk: Контейнери адаптуються до роздільної здатності вікна та співвідношення ширини до висоти. Хоча ми могли б помістити елементи інтерфейсу вручну, використання контейнерів швидше, точніше і **чутливіше**.
zh_cn: 容器适应窗户的分辨率和宽高比。虽然我们可以手动放置UI元素，但是容器更快、更精确、响应更快。
zh_tw: 容器會依據視窗的解析度與長寬比自動調整。雖然也可以手動來擺放 UI 元素，但使用 Container 更快、更精準，且使用 Container 是 **回應式** (Responsive) 的。

source: Prepare the Main Menu scene
cs: Příprava scény hlavního menu
de: Vorbereitung der Hauptmenü-Szene
es: Prepara la escena del Menú Principal
fr: Prépare la scène du Menu Principal
ja: メインメニューシーンの準備
ko: 메인 메뉴 씬 준비하기
pt_br: Prepare a cena do Menu Principal
ru: Подготовка сцены главного меню
uk: Підготовка сцени головного меню
zh_cn: 准备主菜单场景
zh_tw: 準備主選單場景

source: This tutorial is based on a window size of 1366×768. To change the project's base window size, open **Project > Project Settings** at the top of the editor then change **Display > Window > Size > Width** to ``1366`` and **Display > Window > Size > Height** to ``768``.
cs: Tento tutoriál je založen na velikosti okna 1366 × 768. Chcete-li změnit velikost základního okna projektu, otevřete **Projekt> Nastavení projektu** v horní části editoru a poté změňte **Displej> Okno> Velikost> Šířka** na ``1366`` a **Displej> Okno> Velikost > Výška** na ``768``.
de: Diese Anleitung basiert auf einer Fenstergröße von 1366x768. Um die Fenstergröße des Projekts zu ändern, öffnen Sie **Project > Project Settings** oben im Editor und ändern **Display > Window > Size > Width** zu ``1366`` und **Display > Window > Size > Height** zu ``768``.
ja: このチュートリアルでは、ウィンドウサイズを1366×768に設定しています。プロジェクトの基本ウィンドウサイズを変更するには、エディタの上部にある **プロジェクト → プロジェクト設定** を開き、 **Display → Window → Size → Width** を ``1366`` に、 **Display → Window → Size → Height** を ``768`` に変更してください。
ko: 이 튜토리얼은 1366×768의 창 크기를 기준으로 합니다. 프로젝트의 기본 창 크기를 변경하려면 에디터 위쪽에서 **프로젝트(Project) > 프로젝트 설정(Project Settings)**\ 을 연 다음 **Display > Window > Size > Width**\ 를 ``1366``\ 으로 변경하고 **Display > Window > Size > Height**\ 를 ``768``\ 으로 변경하세요.
uk: Цей урок базується на розмірі вікна 1366×768. Щоб змінити базовий розмір вікна проєкта, відкрийте **Проєкт > Налаштування проєкта** в верхній частині редактора і змініть **Display > Window > Size > Width** на ``1366`` і **Display > Window > Size > Height** на ``768``.
zh_tw: 本教學中的視窗大小為 1366×768。若要修改專案的基本視窗大小，請從編輯器上方開啟 **[專案] > [專案設定]** 並更改 **Display (顯示) > Window (視窗) > Size (大小) > Width (寬度)** 為 ``1366`` ，以及將 **Display (顯示) > Window (視窗) > Size (大小) > Height (高度)** 更改為 ``768`` 。

source: If you forget to change the window size, anchors and containers may not behave as expected.
cs: Pokud zapomenete změnit velikost okna, kotvy a kontejnery se nemusí chovat podle očekávání.
de: Falls Sie vergessen die Fenstergröße zu ändern, könnten sich Ankerpunkte und Container nicht wie gewünscht verhalten.
ja: このウィンドウサイズの変更を忘れると、アンカーやコンテナの動作が期待通りにならないかもしれません。
ko: 창 크기 변경을 까먹을 경우 앵커와 컨테이너가 예상대로 작동하지 않을 수 있습니다.
uk: Якщо ви забудете змінити розмір вікна, прив'язки, чи контейнери можуть повести себе не так, як очікувалося.
zh_tw: 若沒有修改視窗大小，則使用錨點與容器的結果可能會不如預期。

source: Let's create the main menu. We'll build it in a single scene. To create an empty scene, click on **Scene > New Scene**.
cs: Vytvořme hlavní nabídku. Postavíme ji v jedné scéně. Chcete-li vytvořit prázdnou scénu, klikněte na **Scéna > Nová scéna**.
de: Erstellen wir das Hauptmenü. Wir bauen es in einer einzigen Szene. Um eine leere Szene zu erstellen, klicken Sie auf das Menü **Szene -> Neue Szene**.
ja: メインメニューを作成してみましょう。単一のシーンで構築します。空のシーンを作成するには「シーンメニュー」 の「新規シーン」をクリックします。
ko: 메인 메뉴를 만들어 봅시다. 하나의 씬에 메뉴를 만들 것입니다. 비어있는 씬을 만들려면, **씬(Scene) > 새 씬(New Scene)**\ 을 클릭하세요.
ru: Создадим главное меню. Мы создадим его в одной сцене. Чтобы создать пустую сцену, нажмите на меню **Сцена -> Новая Сцена**.
uk: Створимо головне меню. Ми побудуємо його в одній сцені. Щоб створити порожню сцену, натисніть **Сцена> Нова сцена**.
zh_cn: 让我们创建主菜单。我们将在一个单一的场景中构建它。要创建一个空场景，请单击 ``场景`` 菜单 -> ``新建场景``。
zh_tw: 接著來製作主選單。我們先在單一場景內製作。點擊 **場景 > 新增場景** 來建立一個空白場景。

source: We have to add a root node before we can save the scene. Your UI's root should be the outermost container or element. In this case it's a ``MarginContainer``. ``MarginContainer`` is a good starting point for most interfaces, as you often need padding around the UI. Press :kbd:`Ctrl + S` (:kbd:`Cmd + S` on macOS) to save the scene to the disk. Name it *MainMenu*.
cs: Před uložením scény musíme přidat kořenový uzel. Kořen vašeho uživatelského rozhraní by měl být od středu nejvzdálenější kontejner nebo prvek. V tomto případě je to ``MarginContainer``. ``MarginContainer`` je dobrým výchozím bodem pro většinu rozhraní, protože často potřebujete čalounění kolem uživatelského rozhraní. Stisknutím :kbd:`Ctrl + S` (:kbd:`Cmd + S` v systému MacOS) uložte scénu na disk. Pojmenujte ji *MainMenu*.
de: Wir müssen einen Wurzel-Node hinzufügen, bevor wir die Szene speichern können. Die Wurzel Ihrer UI sollte der alleräußerste Container oder das Element sein. In diesem Fall ist es ein ``MarginContainer``. ``MarginContainer`` ist für die meisten Oberflächen ein guter Ausgangspunkt, da man oft einen Rand um sie herum braucht. Drücken Sie :kbd:`Strg + S` (:kbd:`Cmd + S` auf MacOS), um die Szene auf dem Datenträger zu speichern und benennen diese *MainMenu*.
ja: シーンを保存する前に、ルートノードを追加する必要があります。 UIのルートは、最も外側のコンテナまたは要素である必要があります。この場合、それは ``MarginContainer`` です。多くの場合、UIの周囲にはパディングが必要になるため、\ ``MarginContainer`` はほとんどのインタフェースの出発点として適しています。\ :kbd:`Ctrl + S` (macOSでは :kbd:`Cmd + S`) を押してシーンをディスクに保存します。それに\ *MainMenu* という名前を付けます。
ko: 씬을 저장하기 전에 루트 노드를 추가해야 합니다. UI의 루트는 가장 바깥쪽 컨테이너 또는 요소여야 합니다. 이 경우에는 ``MarginContainer``\ 입니다. ``MarginContainer``\ 는 UI 주위에 여백이 필요한 경우가 많으므로 대부분의 인터페이스에서 좋은 출발점입니다. :kbd:`Ctrl + S`(macOS의 경우:kbd:`Cmd + S`)를 눌러 씬을 디스크에 저장하세요. 이름은 *MainMenu*\ 로 지으세요.
ru: Мы должны добавить корневой узел, прежде чем мы сможем сохранить сцену. Корневой элемент UI должен быть самым внешним контейнером или элементом. В данном случае это ``MarginContainer``. ``MarginContainer`` является хорошей отправной точкой для большинства интерфейсов, так как часто требуется заполнение вокруг UI. Нажмите ``Meta+S``, чтобы сохранить сцену на диск. Назовите его *MainMenu*.
uk: Ми повинні додати кореневий вузол, перш ніж зможемо зберегти сцену. Кореневий вузол вашого інтерфейсу повинен бути самим зовнішнім контейнером, або елементом. В даному випадку це ``MarginContainer``. ``MarginContainer`` є хорошою відправною точкою для більшості інтерфейсів, оскільки вам часто потрібні відступи довкола інтерфейсу. Натисніть, ``Ctrl+S`` щоб зберегти сцену на диск. Назвіть її *MainMenu*.
zh_tw: 在保存場景前要先新增一個根節點。UI 的根節點應該是最外層的 Container 或元素。在這個例子中則是 ``MarginContainer`` 。對於大多數的界面來說都可以用 ``MarginContainer`` ，因為 UI 的周圍通常都需要留白。按 :kbd:`Ctrl + S` （或是 macOS 上 :kbd:`Cmd + S` ）來將場景保存至硬碟上。將其命名為 **主場景** 。
