Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_main_menu.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Design a title screen
cs: Navrhněte titulní obrazovku
de: Erstellung eines Titelbildschirms
es: Diseñar una pantalla de título
fr: Concevoir un écran titre
ja: タイトル画面のデザイン
ko: 타이틀 화면 만들기
pt_br: Faça o design de uma tela de menu
ru: Дизайн начального экрана
uk: Дизайн титульного екрана
zh_cn: 设计标题画面
zh_tw: 設計標題畫面

source: In the next two tutorials, you will build two responsive UI (user interface) scenes step-by-step using the engine's UI system:
cs: V dalších dvou kurzech vytvoříte krok za krokem dvě responzivní scény UI (uživatelského rozhraní) pomocí UI Godota:
de: In den nächsten zwei Anleitungen, werden Sie mithilfe des Benutzeroberflächen Systems der Engine, Schritt für Schritt eine zugängliche Benutzeroberfläche erstellen:
es: En los próximos dos tutoriales, crearás dos escenas UI (interfaz de usuario) paso a paso utilizando el sistema de UI del motor:
fr: Dans les deux prochains tutoriels, vous créerez deux scènes d'interface utilisateur, étape par étape, en utilisant le système d'interface utilisateur du moteur :
ja: 次のチュートリアル2つでは、エンジンのUIシステムを使用して、2つのレスポンシブUI(ユーザーインターフェイス)シーンを1ステップずつ構築していきます:
ko: 다음 두 튜토리얼에서 엔진의 UI 시스템을 사용해 두 개의 반응형 UI(사용자 인터페이스) 씬을 단계별로 빌드할 것입니다:
pt_br: Nos próximos dois tutoriais, você vai construir duas cenas de UI (interface de usuário, do inglês, user interface) responsivas passo-a-passo utilizando o sistema de UI da engine:
ru: В следующих двух уроках мы шаг за шагом разберем как создать адаптивный пользовательский интерфейс:
uk: У наступних двох уроках ви поетапно побудуєте дві чутливі сцени інтерфейсу, використовуючи систему інтерфейсу двигуна:
zh_cn: 在接下来的两个教程中，您将使用引擎的UI（用户界面）系统逐步构建两个响应式UI场景：
zh_tw: 在接下來的兩個教學中，我們將使用 Godot 的 UI 系統來一步一步製作兩個回應式 UI 界面：

source: A main menu.
cs: Hlavní menu.
de: Ein Hauptmenü.
ja: メインメニュー。
ko: 메인 메뉴.
ru: Главное меню.
uk: Головне меню.
zh_cn: 一个主菜单。
zh_tw: 主選單。

source: A game UI with a health bar, energy bar, bomb and money counters.
cs: Herní UI s ukazatelem zdraví, energie a počítadly bomb a peněz.
de: Die Benutzeroberfläche eines Spiels, mit Lebensbalken, Energiebalken, Bomben- und Geldzähler.
ja: 体力バー、エネルギーバー、爆弾およびお金のカウンターからなるゲームUI。
ko: 체력 바, 에너지 바, 폭탄과 돈 개수 카운터가 있는 게임 UI.
ru: Игровой UI со шкалой здоровья и энергии, счетчиками бомб и денег.
uk: Ігровий інтерфейс із шкалою здоров'я, енергії, лічильниками бомб та грошей.
zh_cn: 一个带有健康条、能量条、炸弹和金钱计数器的游戏UI。
zh_tw: 有血槽、精力槽、炸彈數與金錢量的遊戲 UI。

source: You will learn how to design game UIs efficiently, and how to use Godot's Control nodes. This page focuses on the visual part: everything you do from the editor. To learn how to code a life bar, read :doc:`ui_code_a_life_bar`.
cs: Naučíte se, jak efektivně navrhovat uživatelské rozhraní hry a jak používat řídicí uzly Godota. Tato stránka se zaměřuje na vizuální část: vše vytváříte v editoru. Chcete-li se naučit, jak vytvořit ukazatel života scriptem, přečtěte si: doc: `ui_code_a_life_bar`.
de: Sie werden lernen wie man die Benutzeroberfläche eines Spiels effizient gestaltet, und wie man Godots Control Nodes verwendet. Diese Seite fokussiert sich auf den sichtbaren Teil: alles was Sie vom Editor aus machen können. Um zu lernen wie man einen Lebensbalken programmiert, siehe :doc:`ui_code_a_life_bar`.
ja: ここでは効率的にゲームUIをデザインする方法と、Godotのコントロールノードの使い方を紹介します。このページでは視覚面に主眼を置き、すべてエディタ操作のみで完結します。ライフバーのコードの書き方を知るには、次を見て下さい\ :doc:`ui_code_a_life_bar`\ 。
ko: 게임 UI를 효율적으로 디자인하는 방법과 Godot의 Control 노드를 사용하는 방법을 배우게 됩니다. 이 페이지는 시각적인 부분, 즉 에디터에서 수행하는 모든 작업에 중점을 둡니다. 체력 바를 코딩하는 방법을 배우려면 :doc:`ui_code_a_life_bar`\ 를 읽어보세요.
ru: Вы научитесь разрабатывать UI эффективно, а так же использовать узлы типа "Control". Эта страница фокусируется на визуальной части: все что вы можете сделать с помощью редактора. Для того, чтобы научиться писать код для шкалы здоровья, читайте :doc:`ui_code_a_life_bar`.
uk: Ви дізнаєтесь, як ефективно конструювати ігрові інтерфейси та як використовувати вузли управління Godot. Ця сторінка зосереджена на візуальній частині всього, що ви робите з допомогою редактора. Щоб дізнатися, як кодувати шкалу життя, читайте :doc:`ui_code_a_life_bar`.
zh_cn: 您将学习如何有效地设计游戏UI，以及如何使用Godot的 ``Control`` 节点。该页面专注于视觉部分，仅在编辑器中完成所有操作。要学习如何编写血槽，请阅读 :doc:`ui_code_a_life_bar`。
zh_tw: 接著我們將學習如何有效率地設計遊戲 UI，以及如何使用 Godot 的 Control 節點。這一頁將著重於視覺部分：所有在編輯器上做的事。要瞭解如何以程式碼編寫血槽，請參考 :doc:`ui_code_a_life_bar` 。

source: The GUI you're going to create.
cs: GUI, které vytvoříte.
de: Die grafische Benutzeroberfläche die Sie erstellen werden.
ja: 作成するGUI。
ko: 앞으로 만들게 될 GUI.
ru: Графический интерфейс, который вы будете создавать.
uk: Графічний інтерфейс, який ви будете створювати.
zh_cn: 您将要创建的GUI。
zh_tw: 接著要做的 GUI。

source: Download the project files: :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` and extract the archive. Import the ``start/`` project in Godot to follow this tutorial. The ``end/`` folder contains the final result. You'll find all the sprites in the ``start/assets/main_menu`` folder.
cs: Stáhněte si soubory projektu: :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` a rozbalte archiv. Importujte ``start/`` projekt v Godotu a postupujte podle tohoto tutoriálu. Složka ``end/`` obsahuje konečný výsledek. Ve složce ``start/asset/main_menu`` najdete všechny sprite.
de: Laden Sie die Projekt Dateien herunter: :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` und extrahieren das Archiv. Importieren Sie das ``start/`` Projekt nach Godot um der Anleitung zu folgen. Der ``end\`` Ordner enthält das finale Ergebnis. Sie finden alle Sprites im ``start/assets/main_menu`` Ordner.
fr: Télécharger les fichiers du projet : :téléchargement:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>`et extrayez l'archive. Importez le projet ``start/`` dans Godot pour suivre ce tutoriel. Le dossier ``end/`` contient le résultat final. Vous trouverez tous les sprites dans le dossier ``start/assets/main_menu``.
ja: プロジェクト用ファイル\ :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>`\ をダウンロードして、解凍してください。チュートリアルのために、Godotで\ ``start/``\ プロジェクトをインポートしてください。\ ``end/``\ フォルダには最終結果が入っています。\ ``start/assets/main_menu``\ フォルダにはすべてのスプライトがあります。
ko: 프로젝트 파일을 다운로드하고 :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` 압축을 푸세요. 이 튜토리얼을 따라가려면 Godot에서 ``start/`` 프로젝트를 가져오세요. ``end/`` 폴더에는 최종 결과물이 들어 있습니다. 모든 스프라이트는 ``start/assets/main_menu`` 폴더에서 찾을 수 있습니다.
ru: Загрузите файлы проекта: :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` и распакуйте полученный архив. Импортируйте проект ``start/`` в Godot чтобы продолжить изучение этого руководства. Каталог ``end/`` содержит результат этого примера. Вы найдете все спрайты в каталоге ``start/assets/main_menu``.
uk: Завантажте файли проєкту: :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` і витягніть архів. Імпортуйте проєкт ``start/`` у Godot, щоб виконати цей урок. ``end/`` містить кінцевий результат. В теці ``start/assets/main_menu`` ви знайдете всі спрайти.
zh_cn: 下载项目文件： :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` 并解压缩存档。在Godot中导入 ``start/`` 项目以遵循本教程。``end/`` 文件夹包含最终结果。您将在 ``start/assets/main_menu`` 文件夹中找到所有精灵。
zh_tw: 先下載專案檔： :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` 並解壓縮。將 ``start/`` 專案匯入至 Godot 並繼續這個教學。 ``end`` 資料夾包含了最後的成果。所有的 Sprite 都放置於 ``start/assets/main_menu`` 資料夾中。

source: Read the :doc:`ui_introduction_to_the_ui_system` first to learn how Godot's UI system works.
cs: Nejprve si přečtěte :doc:`ui_introduction_to_the_ui_system`, abyste zjistili, jak funguje systém UI Godota.
de: Lesen Sie :doc:`ui_introduction_to_the_ui_system`, um zu erfahren, wie das UI-System von Godot funktioniert.
ja: GodotのUIシステムの仕組みを知るには、まず\ :doc:`ui_introduction_to_the_ui_system`\ を見て下さい。
ko: Godot의 UI 시스템이 어떻게 작동하는지 알아보려면 먼저 :doc:`ui_introduction_to_the_ui_system`\ 을 읽어보세요.
uk: Прочитайте спочатку :doc:`ui_introduction_to_the_ui_system`, щоб дізнатися, як працює система користувацького інтерфейсу Godot.
zh_tw: 請先閱讀 :doc:`ui_introduction_to_the_ui_system` 以瞭解 Godot 的 UI 系統如何運作。

source: How to design your game UI
cs: Jak navrhnout uživatelské rozhraní hry
de: Wie Sie die Benutzeroberfläche Ihres Spiels gestalten
es: Cómo diseñar tu UI del juego
fr: Comment concevoir l'interface utilisateur de votre jeu
ja: ゲームUIの設計方法
ko: 게임 UI를 디자인하는 방법
pt_br: Como criar sua interface com o usuário do jogo
ru: Как разработать UI для вашей игры
uk: Як розробляти свій ігровий інтерфейс
zh_cn: 如何设计您的游戏UI
zh_tw: 如何設計遊戲 UI

source: To design a good UI, you want to come up with a rough mockup first: a plain drawing version that focuses on the placement of your UI components, their size, and user interaction. Pen and paper is all you need. You shouldn't use fancy and final graphics at this stage. Then, you only need simple placeholder sprites and you're good to jump into Godot. You want to make sure the players can find their way around the interface using those placeholders.
cs: Chcete-li navrhnout dobré uživatelské rozhraní, musíte nejprve vytvořit hrubý návrh: jednoduchý nákres, která se zaměří na umístění komponent uživatelského rozhraní, jejich velikost a interakci s uživatelem. Stačí na to tužka a papír. V této fázi byste neměli používat vymazlenou či finální grafiku. Pak už potřebujete jen jednoduché schematické sprity a můžete na první dobrou skočit do Godota. Chcete se ujistit, že se hráči v tomto schematickém rozhraní neztratí.
de: Um eine gute Benutzeroberfläche zu gestalten, möchten Sie zunächst eine grobe Skizze haben: eine flache gemalte Version die sich auf die Positionierung Ihrer Komponente, ihre Größe, und die Benutzer Interaktion fokussiert. Stift und Papier ist alles was Sie brauchen. Sie sollten in dieser Phase keine spektakulären und finalen Graphiken verwenden. Dann benötigen Sie simple Platzhalter Sprites und können in Godot loslegen. Sie möchten sicherstellen das die Spieler sich mit den Platzhaltern in der Oberfläche zurecht finden.
es: Para diseñar una buena UI, primero debes crear una maqueta aproximada: una versión de dibujo plano que se centre en la ubicación de los componentes de la UI, su tamaño y la interacción con el usuario. Lápiz y papel es todo lo que necesitas. No deberías usar gráficos elegantes y finales en esta etapa. Entonces, sólo necesitarás sprites simples y estarás listo para saltar a Godot. Es importante asegurarse de que los jugadores puedan orientarse por la interfaz utilizando estos sprites.
fr: Pour concevoir une bonne interface utilisateur, vous devez d'abord créer une maquette grossière : une version simple en dessin. Cette version doit mettre l'accent sur le placement des composants de votre interface, leur taille et l'interaction avec l'utilisateur. À ce stage, vous avez uniquement besoin d'un stylo et du papier. Vous ne devez pas faire des graphiques fantaisistes et finaux maintenant. Ensuite, vous n'avez besoin que de simples placeholder pour vos images (sprites) et vous êtes bon pour plonger dans Godot. Vous devez vous assurer que les joueurs puissent se repérer dans l'interface en utilisant ces placeholders.
ja: 優れたUIを設計するには、まず大まかなモックアップを作成します。必要なのはペンと紙だけです。この段階では、凝った最終的なグラフィックスは使用しないでください。何を選択すればどこに進むか分かる程度の大まかな図で十分です。
ko: 좋은 UI를 디자인하려면 먼저 대략적인 목업(mockup), 즉 UI 구성 요소의 배치, 크기 및 사용자 상호 작용에 중점을 둔 그림을 만들어야 합니다. 펜과 종이만 있으면 됩니다. 이 단계에서는 화려하고 최종적인 그래픽을 사용해서는 안 됩니다. 간단한 플레이스홀더 스프라이트만 가지고 Godot에 뛰어드세요. 플레이어가 이러한 플레이스홀더를 사용해 인터페이스에서 길을 찾을 수 있도록 하고 싶습니다.
pt_br: Para projetar uma boa interface do usuário, primeiro você deve criar um modelo preliminar: uma versão de desenho simples que enfoca o posicionamento de seus componentes de UI, seu tamanho e interação com o usuário. Caneta e papel é tudo que você precisa. Você não deve usar gráficos extravagantes e finais neste estágio. Então, você só precisa de simples sprites para reservar espaços e você está pronto para o Godot. Você quer ter certeza de que os jogadores possam encontrar seu caminho pela interface usando esses espaços reservados.
ru: Для проектирования хорошего пользовательского интерфейса следует начать с наброска: начните с бумажной версии и сфокусируйтесь на размещении компонентов пользовательского интерфейса, их размерах и взаимодействии с игроком. Не тратьте время на создание финального варианта графики на этом этапе. Далее подготовьте спрайты-заглушки и разместите из в Godot. Вы должны убедиться в том, что разработанный интерфейс удобен и понятен даже в таком виде.
uk: Щоб створити хороший інтерфейс користувача, потрібно спершу придумати грубий макет: намалюйте просту версію, яка зосереджена на розміщенні компонентів вашого інтерфейсу, їх розмірах та взаємодії з користувачем. Ручка і папір - все, що вам потрібно. На цьому етапі не слід використовувати вигадливу та остаточну графіку. Далі вам потрібні лише прості спрайти-заповнювачі розміщені в Godot. Ви маєте переконатися, що ваш інтерфейс зручний.
zh_cn: 要设计一个好的UI，您首先要提出一个粗略的模型：一个纯绘制版本，重点放在UI组件的位置、它们的大小、和用户交互上。您只需要纸和笔。在此阶段，您不应该使用精美的图形和最终图形。然后，您只需要简单的占位符精灵，就可以进入Godot。您要确保玩家可以使用这些占位符在界面周围找到自己的路。
zh_tw: 在設計 UI 前，通常會先進行粗略地打樣。打樣的重點在於 UI 元件擺放的位置、元件的大小、以及與使用者互動的方式。只需要使用紙筆就好了，請避免在這個階段做出完整的視覺圖。只需要一些預留位置用的 Sprite 來給各個元件用就好了，接著便可以到 Godot 裡開始做。這個階段只需要確保使用者能知道這些預留位置的 Sprite 是用來做什麼的就好了。

source: The UI's rough plan or mockup
cs: Hrubý plán(model) uživatelského rozhraní
de: Das grobe Modell oder der Plan für die Benutzeroberfläche
es: El plan aproximado o maqueta de la UI
fr: Le plan basique de l'interface utilisateur ou la maquette
ja: UIの大まかな計画またはモックアップ
ko: UI의 대략적인 계획이나 모형
pt_br: O esboço de plano ou protótipo da interface do usuário
ru: Примерный план или макет UI
uk: Приблизний план або макет інтерфейсу
zh_cn: UI的粗略计划或模型
zh_tw: 粗略的 UI 計劃或打樣

source: Placeholder doesn't have to mean ugly, but you should keep the graphics simple and clean. Avoid special effects, animation, and detailed illustration before you have players playtest your UI. Otherwise:
cs: Schematický nemusí znamenat ošklivý, ale grafiku byste měli udržet jednoduchou a úplnou. Vyvarujte se speciálních efektů, animace a podrobných ilustrací, než hráči toto rozhraní vyzkouší. V opačném případě:
de: Platzhalter muss nicht hässlich bedeuten, aber Sie sollten die Grafik einfach und sauber halten. Vermeiden Sie Spezial-Effekte, Animationen und detaillierte Illustrationen bevor Spieler Ihre Benutzeroberfläche getestet haben. Ansonsten:
fr: Les placeholders ne sont pas obligatoirement moche, mais vous devez garder les graphiques simples et concis. Évitez tout effet spécial, animation, et illustration détaillée avant que les joueurs ne testent votre interface utilisateur. Sinon :
ja: 仮のUIであってもわざわざ醜くする必要はありませんが、少なくとも簡潔なグラフィックスにしてください。プレイヤーがUIをテストプレイする前は、特別なエフェクト、アニメーション、詳細なイラストは避けるべきです。でなければ:
ko: 플레이스홀더가 못생긴 것을 의미할 필요는 없지만 그래픽을 단순하고 깨끗하게 유지해야 합니다. 플레이어가 UI를 플레이 테스트하게 하기 전에 특수 효과, 애니메이션 및 구체적인 삽화는 피하세요. 그렇지 않으면:
ru: Заполнители не должны быть уродливыми, но вам следует стараться использовать простую графику для них. Избегайте специальных эффектов, анимаций и излишне детализированных иллюстраций до тех пор, пока ваш UI не используется игроками. В противном случае:
uk: Заповнювачі не повинні бути негарними, але ви повинні підтримувати графіку простою та чистою. Уникайте спеціальних ефектів, анімації та детальних ілюстрацій, перш ніж гравці почнуть використовувати ваш інтерфейс. Інакше:
zh_cn: 占位符不一定意味着难看，但是您应该保持图形简单和干净。在让玩家对UI进行游戏测试之前，请避免使用特殊效果、动画、和详细的插图。 否则：
zh_tw: 預留位置 (Placeholder) 不一定要很醜，但應該儘量讓視覺圖簡單並清楚。在玩家開始測試 UI 前應避免特殊效果、動畫、與太多的細節，否則：

source: The graphics might skew the players' perception of the experience and you'll miss out on valuable feedback.
cs: Grafika by mohla skreslit vnímání hráčů a vy příjdete o cennou zpětnou vazbu.
de: Die Grafik könnte die Wahrnehmung der Spieler verzerren und Sie verpassen wertvolles Feedback.
ja: グラフィックがプレイヤーのエクスペリエンスへの認識を歪め、貴重なフィードバックを見逃す可能性があります。
ko: 그래픽이 플레이어의 경험에 대한 인식을 왜곡해 소중한 피드백을 놓칠 수 있습니다.
ru: Слишком сильный упор на графику на этой стадии может исказить восприятие игроками вашего интерфейса и вы лишитесь ценных отзывов.
uk: Графіка може викривити у гравців сприйняття гри, і ви втратите позитивні відгуки.
zh_cn: 不好的图形可能会误导玩家对游戏的看法，您将会错过宝贵的反馈意见。
zh_tw: 視覺圖可能會讓玩家有錯誤的期待，並可能讓你錯過了寶貴的回饋。

source: If the User Experience doesn't work, you'll have to redo some sprites.
cs: Pokud uživatelská zkušenost nefunguje, budete muset některé sprity předělat.
de: Wenn die Benutzer-Erfahrung nicht gut ist, müssen Sie einige Sprites neu anfertigen.
ja: ユーザーエクスペリエンスが機能しない時に、いくつかのスプライトをやり直さないといけなくなる場合があります。
ko: 사용자 경험이 작동하지 않으면 일부 스프라이트를 다시 만들어야 합니다.
ru: Если пользовательский интерфейс не заработает должным образом, придется переделывать часть спрайтов.
uk: Якщо інтерфейс не працює належним чином, вам доведеться переробити деякі спрайти.
zh_cn: 如果用户体验不好，你还得重新设计一些角色。
zh_tw: 若使用者經驗 (UX) 不好時，則可能需要重新設計一些 Sprite。

source: Always try to make the interface work with simple text and boxes first. It's easy to replace the textures later. Professional UX designers often work with plain outlines and boxes in greyscale. When you take colors and fancy visuals away, it's a lot easier to size and place UI elements properly. It helps you refine the design foundation you'll build upon.
cs: Vždy se pokuste, aby rozhraní fungovalo nejprve s jednoduchým textem a rámečky. Je snadné vyměnit textury později. Profesionální návrháři UX často pracují s jednoduchými obrysy a boxy v odstínech šedé. Když odeberete barvy a načančané vizuální prvky, je mnohem snazší navrhout optimální velikost a správné rozmístění prvků uživatelského rozhraní. Pomáhá vám to vytvořit bytelné základy návrhu na kterých budete později stavět.
de: Versuchen Sie immer die Oberfläche mit einfachem Text und Boxen zum laufen zu bekommen. Es ist einfach die Texturen später zu ersetzen. Professionelle UX-Designer arbeiten häufig mit einfarbigen Umrissen und Boxen in Grau-stufe. Wenn Sie Farbe und spektakuläre visuelle Effekte weglassen, ist es viel einfach die Benutzeroberflächen Elemente richtig zu positionieren. Es hilft Ihnen die Gestaltungsbasis zu verbessern, auf der Sie aufbauen.
es: Siempre intenta que la interfaz funcione primero con texto y cajas simples. Es fácil reemplazar las texturas más tarde. Los diseñadores profesionales de UX a menudo trabajan con contornos planos y cajas en escala de grises. Cuando se eliminan los colores y los elementos visuales sofisticados, es mucho más fácil dimensionar y colocar correctamente los elementos de la interfaz de usuario. Te ayuda a refinar la base de diseño sobre la que construirás.
fr: Essayez toujours de faire une interface fonctionnel avec avant tout, de simples carrés et de textes. Il est facile de remplacer les textures plus tard. Les professionnels de conception d’expérience d'utilisateur travaillent souvent avec un plan et des carrés en nuance de gris. Lorsque vous prenez des couleurs et des visuels non fantaisiste, il vous sera plus facile de placer les éléments de l'interface utilisateur. Cela va vous aider à affiner le design principal que vous construirez plus tard.
ja: まず、シンプルなテキストとボックスを使用してインタフェースを動作させるようにしてください。テクスチャは後で簡単に置き換えることができます。プロのUXデザイナーは、グレースケールのアウトラインやボックスを使って作業することがよくあります。カラーや派手なビジュアルを排除すれば、UI要素のサイズや配置を適切に行うことがずっと簡単になります。これにより、設計基盤を洗練させることができます。
ko: 항상 먼저 간단한 텍스트와 상자로 인터페이스를 작동하도록 하세요. 나중에 텍스처를 쉽게 교체할 수 있습니다. 전문 UX 디자이너는 회색조의 일반 윤곽선과 상자로 작업하는 경우가 많습니다. 색상과 멋진 시각적 요소를 제거하면 UI 요소의 크기를 조정하고 적절하게 배치하는 것이 훨씬 쉽습니다. 구축할 디자인 기반을 개선하는 데 도움이 됩니다.
pt_br: Sempre tente fazer a interface funcionar com texto e caixas simples primeiro. É fácil substituir as texturas mais tarde. Os designers profissionais de experiência costumam trabalhar com contornos e caixas simples em escala de cinza. Quando você tira as cores e visuais extravagantes, é muito mais fácil dimensionar e posicionar corretamente os elementos da interface do usuário. Isto ajuda a refinar a base do design que você vai construir.
ru: Всегда старайтесь в начале сделать интерфейс рабочим с простым текстом и графикой. Вы всегда сможете изменить текстуры. Профессиональные UX-дизайнеры используют в работе простые контуры и серые тона. Отказавшись от красивой графики и ярких цветов на этом этапе вам будет гораздо проще подобрать размеры и разместить элементы интерфейса.
uk: Завжди намагайтеся спочатку змусити інтерфейс працювати з простим текстом і полями. Пізніше замінити текстури легко. Професійні дизайнери UX часто працюють із звичайними контурами та коробочками у відтінках сірого. Без кольорів та вишуканих візуальних зображень, набагато простіше розмістити та розмістити елементи інтерфейсу належним чином. Це допомагає вдосконалити фундамент проєкту, який ви будете розробляти.
zh_cn: 总是首先尝试让界面使用简单的文本和框。以后替换纹理很容易。专业的UX设计师通常使用灰色的简单轮廓和框。当您去掉颜色和精美的视觉效果时，正确地设置和放置UI元素要容易得多。它可以帮助您完善将要建立的设计基础。
zh_tw: 儘量先在界面上使用簡單的文字與框框，之後也很容易以紋理貼圖來替換掉。專業的 UX 設計師通常只會使用灰階的框線來繪製。一旦忽略顏色與視覺上的細節，便比較能專注於好好地擺放 UI 的位置與調整大小。這樣一來可以幫助你打好接下來要設計的基礎。

source: There are two ways to design your UI in Godot. You can:
cs: Existují dva způsoby, jak navrhnout vaše uživatelské rozhraní v Godotu. Můžete:
de: Es gibt zwei Wege Ihre Benutzeroberfläche in Godot zu gestalten. Sie können:
es: Hay dos maneras de diseñar tu UI en Godot. Tú puedes:
fr: Il y a 2 possibilités pour créer votre interface utilisateur dans Godot. Vous pouvez :
ja: GodotでUIをデザインするには2つの方法があります。次のことができます:
ko: Godot에는 UI를 디자인하는 두 가지 방법이 있습니다. 여러분은:
pt_br: Existem duas maneiras de projetar sua interface do usuário no Godot. Você pode:
ru: Существует два способа проектирования пользовательского интерфейса в Godot. Вы можете:
uk: Існує два способи проєктування вашого інтерфейсу в Godot. Ви можете:
zh_cn: 在Godot中有两种方法来设计UI。 您可以：
zh_tw: 在 Godot 中設計 UI 有兩種方法。你可以：

source: Build it all in a single scene, and eventually save some branches as reusable scenes.
cs: Vytvoříte vše v jedné scéně a nakonec uložíte některé části jako znovu použitelné scény.
de: Erstelle alles in einer einzigen Szene und speichere ggf. später einige Zweige als wiederverwendbare Szenen ab.
ja: すべてを1つのシーンに構築し、最終的にはいくつかのブランチを再利用可能なシーンとして保存する方法。
ko: 하나의 씬에서 모든 것을 구축하고 마지막으로 일부 분기를 재사용 가능한 씬으로 저장할 수 있습니다.
ru: Создать интерфейс в одной сцене и позже сохранить некоторые его части в отдельные сцены для многоразового использования.
uk: Створити все в одній сцені, а згодом зберегти деякі її гілки, як окремі сцени, для багаторазового використання.
zh_cn: 先将UI全部放在一个场景中，最后再提取出一些具有共性的组件保存为可重用场景。
zh_tw: 將所有東西都做在同一個場景內，最後再將其中一些東西分出來變成可以重複使用的場景。

source: Build template scenes for reusable components and create specific components that inherit from your base scenes.
cs: Vytvářejte šablony scén pro opakovaně použitelné komponenty UI a pro konkrétní součásti vytvořte specifické komponenty, které dědí ze základních scén.
de: Erstelle Szenenvorlagen für wiederverwendbare Komponenten und erstelle spezifische Komponenten, die von diesen Vorlagen abstammen.
ja: 再利用可能なコンポーネントのテンプレートシーンを作成し、ベースシーンから継承する特定のコンポーネントを作成する方法。
ko: 재사용 가능한 구성 요소에 대한 템플릿 씬을 만들고 이 씬을 상속받는 특정 구성 요소를 만들 수 있습니다.
ru: Собрать шаблонные сцены из базовых элементов и создавать определенные компоненты, используя как основу эти шаблоны.
uk: Побудувати шаблони сцен для багаторазових компонентів та створити конкретні компоненти на основі цих шаблонів.
zh_cn: 从可复用组件构建模板场景，并创建从基本场景继承的特定组件。
zh_tw: 為可以重複使用的元件建立樣板場景，並以基礎場景來繼承出特定用途的元件。
