Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_main_menu.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: In the node tree, select all the ``TextureRect`` nodes that should go on the left side: the logo, the menu options and the version note. Drag and drop them into the ``VBoxContainer``. The nodes should position automatically.
fr: Dans l'arborescence des nœuds, sélectionnez tous les nœuds ``TextureRect`` qui doivent aller sur le côté gauche : le logo, les options de menu et la note de version. Faites un glissé-déposé dans le ``VBoxContainer``. Les nœuds doivent se positionner automatiquement.

source: The characters on the right aren't centered
es: Los elementos de la derecha no están centrados
fr: Les caractères à droite ne sont pas centré
pt_br: Os caracteres da direita não estão centralizados

source: There's no space between the logo and the other UI elements
es: No hay espacio entre el logo y los otros elementos de la UI
fr: Il n'y a pas d'espace entre le logo et les autres élements de l'UI
pt_br: Não há espaço entre o logotipo e os outros elementos da interface do usuário

source: To center the characters on the right, first select the ``CenterContainer``. Then in the Inspector, scroll down to the ``Size Flags`` category and click on the field to the right of the ``Vertical`` property, and check ``Expand`` in addition to ``Fill``. Do the same for the ``Horizontal`` property. This makes the ``CenterContainer`` expand into all available space while respecting its neighbour ``VBoxContainer``. Finally, drag and drop the Characters node into the ``CenterContainer``. The Characters element will center automatically.
fr: Pour centrer les caractères à droite, sélectionnez d'abord le ``CenterContainer``. Ensuite, dans l'inspecteur, faites défiler vers le bas jusqu'à la catégorie ``Size Flags`` et cliquez sur le champ à droite de la propriété ``Vertical``, et cochez ``Expand`` en plus de ``Fill``. Faites de même pour la propriété ``Horizontal``. Cela permet au ``CenterContainer`` de s'étendre dans tout l'espace disponible tout en respectant son voisin ``VBoxContainer``. Enfin, glissez-déposez le nœud Characters dans le ``CenterContainer``. L'élément Characters se centre automatiquement.

source: The character node centers inside the right half of the screen as soon as you place it inside the CenterContainer
es: El nodo de character se centra dentro de la mitad derecha de la pantalla tan pronto como lo coloques dentro del CenterContainer
fr: Le nœud Character se centre dans la moitié droite de l'écran dès que vous le placez à l'intérieur du CenterContainer
pt_br: O nó de caractere centraliza-se dentro da metade direita da tela assim que você o coloca dentro do CenterContainer

source: To space out the menu options and the logo on the left, we'll use one final container and its size flags. Select the ``VBoxContainer`` and press ``Meta+A`` to add a new node inside it. Add a second ``VBoxContainer`` and name it "MenuOptions". Select all three menu options, ``Continue``, ``NewGame`` and ``Options``, and drag and drop them inside the new ``VBoxContainer``. The UI's layout should barely change, if at all.
es: Para espaciar las opciones del menú y el logotipo a la izquierda, usaremos un último container y sus size flags. Selecciona el ``VBoxContainer`` y pulsa ``Meta+A`` para añadir un nuevo nodo dentro de él. Añade un segundo ``VBoxContainer`` y llámalo "MenuOptions". Selecciona las tres opciones del menú, ``Continue``, ``NewGame`` y ``Options``, y arrástralas y suéltalas dentro del nuevo ``VBoxContainer``. El diseño de la UI apenas debería cambiar, si es que lo hace.
fr: Pour espacer les options du menu et le logo à gauche, nous utiliserons un conteneur final et ses "Size Flags". Sélectionnez le ``VBoxContainer`` et appuyez sur ``Meta+A`` pour ajouter un nouveau nœud dedans. Ajoutez un second ``VBoxContainer`` et nommez-le "MenuOptions". Sélectionnez les trois options de menu, ``Continue``, ``NewGame`` et ``Options``, et faites-les glisser puis déposez les à l'intérieur du nouveau ``VBoxContainer``. La disposition de l'interface utilisateur devrait à peine changer, voire pas du tout.
pt_br: Para espaçar as opções de menu e o logotipo à esquerda, usaremos um contêiner final e suas flags de tamanho. Selecione ``VBoxContainer`` e pressione ``Meta+A`` para adicionar um novo nó dentro dele. Adicione um segundo ``VBoxContainer`` e nomeie-o como "MenuOptions". Selecione todas as três opções de menu, ``Continue``, ``NewGame`` e ``Options``, e arraste e solte-as dentro do novo ``VBoxContainer``. A disposição da interface do usuário deve mudar pouco, isso se mudar.

source: Place the new container between the other two nodes to retain the UI's layout
es: Coloca el nuevo container entre los otros dos nodos para mantener la disposición de la UI
fr: Placez le nouveau conteneur entre les deux autres nœuds pour conserver la disposition de l'interface utilisateur
pt_br: Coloque o novo contêiner entre os outros dois nós para manter o layout da interface do usuário

source: Now we grouped the menu options together, we can tell their container to expand to take as much vertical space as possible. Select the ``MenuOptions`` node. In the Inspector, scroll down to the ``Size Flags`` category. Click on the field to the right of the ``Vertical`` property, and check ``Expand`` in addition to ``Fill``. The container expands to take all the available vertical space. But it respects its neighbors, the ``Logo`` and ``Version`` elements.
fr: Maintenant que nous avons regroupé les options de menu ensembles, nous pouvons étendre le conteneur pour qu'il prenne toute l'espace vertical disponible. Sélectionnez le nœud ``MenuOptions``. Dans l'inspecteur, naviguez jusqu'à la catégorie ``Size Flags``. Cliquez sur le champs à droite de la propriété ``Vertical`` et cochez ``Expand``. Le conteneur s'étend à présent pour prendre tout l'espace vertical disponible en respectant les élément ``Logo`` et ``Version``.

source: To center the nodes in the ``VBoxContainer``, scroll to the top of the Inspector and change the ``Alignment`` property to ``Center``.
es: Para centrar los nodos en el ``VBoxContainer``, ve a la parte superior del Inspector y cambia la propiedad ```Alignment`` por ``Center``.
fr: Pour centrer les nœuds dans le ``VBoxContainer``, changez la propriété ``Alignement`` pour ``Center`` en haut de l'inspecteur.
pt_br: Para centralizar os nós no ``VBoxContainer``, vá até o topo do Inspetor e altere a propriedade ``Alignment`` para ``Center``.

source: The menu options should center vertically in the UI's left column
es: Las opciones del menú deben centrarse verticalmente en la columna izquierda de la UI
fr: Les options du menu devraient être centrer verticalement dans la colonne de gauche de l'interface utilisateur
pt_br: As opções do menu devem centralizar verticalmente na coluna esquerda da interface do usuário

source: To wrap things up, let's add some separation between the menu options. Expand the ``Custom Constants`` category below ``Size Flags``, and click the field next to the ``Separation`` parameter. Set it to 30. Once you press enter, the ``Separation`` property becomes active and Godot adds 30 pixels between menu options.
es: Para terminar, agregaremos una separación entre las opciones del menú. Expande la categoría ``Custom Constants`` debajo de ``Size Flags`, y haz clic en el campo situado junto al parámetro ``Separation``. Ponlo a 30. Una vez que presiones enter, la propiedad ``Separation`` se activará y Godot añadirá 30 píxeles entre las opciones del menú.
fr: Pour conclure, ajoutons une séparation entre les options du menu. Développez la catégorie ``Custom Constants`` sous ``Size Flags``, et cliquez sur le champ à côté du paramètre ``Separation``. Réglez-le à 30. Après avoir pressé Entrée, la propriété ``Separation`` devient active et Godot ajoute 30 pixels entre les options du menu.
pt_br: Para envolver as coisas, vamos adicionar alguma separação entre as opções do menu. Expanda a categoria ``Custom Constants`` abaixo de ``Size Flags`` e clique no campo próximo ao parâmetro ``Separation``. Defina-o como 30. Depois de pressionar enter, a propriedade ``Separation`` fica ativa e o Godot adiciona 30 pixels entre as opções do menu.

source: The final interface
es: La interfaz final
fr: L'interface finale
pt_br: A interface final

source: The order in which you nest matters. To see if your UI adapts nicely to different screen ratios, select the root node, press the Q key to activate the Select Mode, select the container and click and drag on one of the container's corners to resize it. The UI components should flow inside of it.
es: El orden en el que se anida es importante. Para ver si tu UI se adapta bien a las diferentes relaciones de pantalla, selecciona el nodo raíz, pulsa la tecla Q para activar el Modo de Selección, selecciona el container y arrastra una de las esquinas del container para redimensionarlo. Los componentes de la UI deben fluir dentro del mismo.
fr: L'ordre dans lequel vous imbriquez les éléments est important. Pour vérifier que votre interface s'adapte correctement à différents ratios, sélectionner le nœud racine et appuyez sur Q pour activer le mode de sélection. Sélectionnez le conteneur et maintenez le clic gauche de la souris sur l'un des coins du conteneur pour le redimensionner. Les éléments devraient se déplacer correctement à l'intérieur.
pt_br: A ordem em que você aninha é importante. Para ver se sua interface do usuário se adapta bem a diferentes proporções de tela, selecione o nó raiz, pressione a tecla Q para ativar o modo de seleção, selecione o contêiner e clique e arraste em um dos cantos do contêiner para redimensioná-lo. Os componentes de interface do usuário devem fluir dentro dele.

source: You can change the scale mode in the project settings: click the Project menu -> Project Settings. In the window's left column, look for the Display category. Click on the Window sub-category. On the right side of the window, you'll find a Stretch section. The three settings, Mode, Aspect, and Shrink, control the screen size. For more information, see :ref:`doc_multiple_resolutions`.
es: En la configuración del proyecto puedes cambiar el modo de escala: haz clic en el menú Proyecto -> Ajustes del proyecto. En la columna izquierda de la ventana, busca la categoría Display. Haz clic en la subcategoría Window. En el lado derecho de la ventana, encontrarás la sección Stretch. Los tres ajustes, Mode, Aspect y Shrink, controlan el tamaño de la pantalla. Para más información, consulta :ref:`doc_multiple_resolutions`.
fr: Vous pouvez changer le mode d'échelle dans les paramètres du projet : cliquez sur le menu Projet -> Paramètres du projet. Dans la colonne de gauche de la fenêtre, recherchez la catégorie Afficher. Cliquez sur la sous-catégorie Fenêtre. Sur le côté droit de la fenêtre, vous trouverez une section Étirement. Les trois paramètres, Mode, Aspect et Rétrécissement, contrôlent la taille de l'écran. Pour plus d'informations, voir :ref:`doc_multiple_resolutions`.
pt_br: Você pode alterar o modo de escala nas configurações do projeto: clique no menu Projeto -> Configurações do Projeto. Na coluna da esquerda da janela, procure a categoria Display. Clique na subcategoria Window. No lado direito da janela, você encontrará a seção Stretch. As três configurações, Mode, Aspect e Shrink, controlam o tamanho da tela. Para mais informações, consulte: ref:`doc_multiple_resolutions`.

source: You will learn how to design game UI efficiently, and how to use Godot's Control nodes. This page focuses on the visual part: everything you do from the editor. To learn how to code a life bar, read :doc:`ui_code_a_life_bar`
es: Aprenderás a diseñar eficientemente la UI del juego y a usar los nodos de Control de Godot. Esta página se centra en la parte visual: todo lo que haces desde el editor. Para aprender a programar una barra de vida, lee :doc:`ui_code_a_life_bar`
pt_br: Você aprenderá a projetar a interface do usuário do jogo de maneira eficiente e a usar os nós de controle do Godot. Esta página se concentra na parte visual: tudo que você faz no editor. Para aprender como codificar uma barra de vida, leia :doc:`ui_code_a_life_bar`

source: Download the project files: :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` and extract the archive. Import the ``start/`` project in Godot to follow this tutorial. The ``end/`` folder contains the final result. You'll find all the sprites in the ``start/assets/main_menu``` folder.
es: Descarga los archivos del proyecto: :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` y extrae el archivo. Importa el proyecto ``start/`` en Godot para seguir este tutorial. La carpeta ``end/`` contiene el resultado final. Encontrarás todos los sprites en la carpeta ``start/assets/main_menu``.
pt_br: Faça o download dos arquivos do projeto: :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` e extraia o arquivo. Importe o projeto ``start/`` no Godot para seguir este tutorial. A pasta ``end/`` contém o resultado final. Você encontrará todos os sprites na pasta ``start/assets/main_menu``.

source: Placeholder doesn't have to mean ugly, but you should keep the graphics simple and clean. Avoid special effects, animation, and detailed illustration before you had players playtest your UI. Otherwise:
es: Los marcadores de posición no tienen por qué ser feos, pero debes mantener los gráficos simples y limpios. Evita los efectos especiales, la animación y las ilustraciones detalladas antes de que los jugadores prueben tu UI. De lo contrario:
pt_br: O espaço reservado não precisa ser feio, mas você deve manter os gráficos simples e limpos. Evite efeitos especiais, animações e ilustrações detalhadas antes de fazer com que os jogadores testem sua interface do usuário. De outra forma:

source: We want the container to fit the window. In the Viewport, open the ``Layout`` menu and select the last option, ``Full Rect``.
es: Queremos que el container quepa en la ventana. En la ventana de visualización, abre el menú ``Disposición`` y selecciona la última opción, ``Full Rect``.
pt_br: Queremos que o contêiner se encaixe na janela. No Viewport, abra o menu ``Layout`` e selecione a última opção, ``Full Rect``.

source: Click each of the nodes to select it. In the inspector, click the ``…`` Icon to the right of the Texture property, and click on ``Load``. A file browser opens and lets you pick a sprite to load into the texture slot.
es: Haz clic en cada uno de los nodos para seleccionarlo. En el inspector, haz clic en el icono ``...`` situado a la derecha de la propiedad Texture, y haz clic en ``Load``. Se abre un navegador de archivos que te permite elegir un sprite para cargarlo en la ranura de texturas.
pt_br: Clique em cada um dos nós para selecioná-lo. No inspetor, clique no ícone ``…`` à direita da propriedade Texture, e clique em ``Load``. Um navegador de arquivos é aberto e permite escolher uma sprite para carregar no slot de textura.

source: Repeat the operation for all ``TextureRect`` nodes. You should have the logo, the illustration, the three menu options and the version note, each as a separate node. Then, double click on each of the nodes in the Scene tab to rename them.
es: Repite la operación para todos los nodos ``TextureRect``. Debe tener el logotipo, la ilustración, las tres opciones de menú y la nota de versión, cada una como un nodo separado. A continuación, haz doble clic en cada uno de los nodos de la pestaña Escenas para cambiarles el nombre.
pt_br: Repita a operação para todos os nós ``TextureRect``. Você deve ter o logotipo, a ilustração, as três opções de menu e a nota de versão, cada uma como um nó separado. Em seguida, clique duas vezes em cada um dos nós na guia Cena para renomeá-los.

source: In the node tree, select all the ``TextureRect`` nodes that should go on the left side: the logo, the menu options and the version note. Drag and drop them into the ``VBoxContainer``. Then, drag the illustration node into the ``CenterContainer``. The nodes should position automatically.
es: En el árbol de nodos, selecciona todos los nodos ``TextureRect`` que deben ir en el lado izquierdo: el logo, las opciones del menú y la nota de la versión. Arrástralos y suéltalos en el ``VBoxContainer``. A continuación, arrastra el nodo de la ilustración hasta el ``CenterContainer``. Los nodos deben posicionarse automáticamente.
pt_br: Na árvore de nós, selecione todos os nós ``TextureRect`` que devem ir no lado esquerdo: a logo, as opções de menu e a nota de versão. Arraste e solte-os no ``VBoxContainer``. Em seguida, arraste o nó de ilustração para o ``CenterContainer``. Os nós devem se posicionar automaticamente.

source: To center the characters on the right, we'll use a ``CenterContainer``. Add a ``CenterContainer`` node as a child of the ``HBoxContainer``. Then in the Inspector, scroll down to the ``Size Flags`` category and click on the field to the right of the ``Vertical`` property, and check ``Expand``. Do the same for the ``Horizontal`` property. Finally drag and drop the Characters into the ``CenterContainer``. The Characters element will center automatically.
es: Para centrar los elementos a la derecha, usaremos un ``CenterContainer``. Añade un nodo ``CenterContainer`` como hijo del ``HBoxContainer``. A continuación, en el Inspector, baja hasta la categoría ``Size Flags`` y haz clic en el campo situado a la derecha de la propiedad ``Vertical`` y marca ``Expand``. Haz lo mismo con la propiedad "Horizontal". Finalmente arrastra y suelta los elementos en el ``CenterContainer``. El elemento se centrará automáticamente.
pt_br: Para centralizar os caracteres à direita, usaremos um ``CenterContainer``. Adicione um nó ``CenterContainer`` como filho do ``HBoxContainer``. Então no Inspetor, vá até a categoria ``Size Flags`` e clique no campo à direita da propriedade ``Vertical``, e marque ``Expand``. Faça o mesmo com a propriedade ``Horizontal``. Finalmente, arraste e solte os caracteres no ``CenterContainer``. O elemento Caracteres será centralizado automaticamente.

source: Now we grouped the menu options together, we can tell their container to expand to take as much vertical space as possible. Select the ``MenuOptions`` node. In the Inspector, scroll down to the ``Size Flags`` category. Click on the field to the right of the ``Vertical`` property, and check ``Expand``. The container expands to take all the available vertical space. But it respects its neighbors, the ``Logo`` and ``Version`` elements.
es: Ahora que hemos agrupado las opciones del menú, podemos decirle a su container que se expanda para que ocupe el mayor espacio vertical posible. Selecciona el nodo ``MenuOptions``. En el Inspector, ve hacia abajo a la categoría ``Size Flags``. Haz clic en el campo a la derecha de la propiedad ``Vertical`` y activa ``Expand``. El container se expande para ocupar todo el espacio vertical disponible. Pero respeta a sus prójimos, los elementos ```Logo`` y ``Version``.
pt_br: Agora agrupamos as opções de menu juntas, podemos dizer que o contêiner delas é expandido para ocupar o máximo de espaço vertical possível. Selecione o nó ``MenuOptions``. No Inspetor, role para baixo até a categoria ``Size Flags``. Clique no campo à direita da propriedade ``Vertical`` e marque ``Expand``. O contêiner se expande para ocupar todo o espaço vertical disponível. Mas respeita seus vizinhos, os elementos ``Logo`` e ``Version``.

source: Congratulations for getting there! You can download the `final menu <#>`__ to compare with your own. In the next tutorial, you'll create a Game User Interface with bars and item counters.
es: ¡Felicidades por llegar hasta aquí! Puedes descargar el `menú final <#>`__ para compararlo con el tuyo. En el siguiente tutorial, crearás una Interfaz de Usuario de Juego (GUI) con barras y contadores de elementos.
pt_br: Parabéns por chegar lá! Você pode baixar o `menu final <#>`__ para comparar com o seu próprio. No próximo tutorial, você criará uma interface do usuário do jogo com barras e contadores de itens.

source: Responsive User Interface is all about making sure our UIs scale well on all screen types. TV screens and computer displays have different sizes and ratios. In Godot, we use containers to control the position and the size of UI elements.
es: Una interfaz de usuario con capacidad responsiva consiste en asegurarse de que nuestras interfaces de usuario se escalen bien en todos los tipos de pantalla. Las pantallas de TV y las pantallas de computadoras tienen diferentes tamaños y proporciones. En Godot, utilizamos containers para controlar la posición y el tamaño de los elementos UI.
pt_br: A interface de usuário responsiva tem tudo a ver com a certeza de que nossas interfaces de usuário sejam bem dimensionadas em todos os tipos de tela. Telas de TV e monitores de computador têm diferentes tamanhos e proporções. No Godot, usamos contêineres para controlar a posição e o tamanho dos elementos da interface do usuário.

source: Our main menu has some margin around the edges of the screen. It is split in two parts: on the left, you have the logo and the menu options. On the right, you have the characters. We can use one of two containers to achieve this: ``HSplitContainer`` or ``HBoxContainer``. Split containers split the area into two: a left and a right side or a top and a bottom side. They also allow the user to resize the left and right areas using an interactive bar. On the other hand, ``HBoxContainer`` just splits itself into as many columns as it has children. Although you can deactivate the split container's resize behavior, it's recommended to favor box containers.
ko: 메인 메뉴의 화면 가장자리에는 약간의 마진이 있습니다. 메인 메뉴는 왼쪽의 로고와 메뉴 옵션, 오른쪽의 캐릭터 두 부분으로 나뉩니다. 이를 구현하기 위해 컨테이너 ``HSplitContainer`` 또는 ``HBoxContainer``\ 를 사용할 수 있습니다. 분할 컨테이너(``HSplitContainer``)는 영역을 왼쪽과 오른쪽 또는 위쪽과 아래쪽 두 부분으로 나눕니다. 분할 컨테이너는 사용자가 대화형 바를 사용해 왼쪽 및 오른쪽 영역의 크기를 조정할 수 있도록 합니다. 반면에 박스 컨테이너(``HBoxContainer``)는 자식 수 만큼의 열로 나눠집니다. 분할 컨테이너의 크기 조정 동작을 비활성화할 수 있지만 저는 박스 컨테이너를 추천합니다.
