Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_main_menu.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Select the ``MarginContainer`` again, and head to the inspector to define the margins' size. Scroll down the ``Control`` class, to the ``Custom Constants`` section. Unfold it. Set the margins as such:
cs: Znovu vyberte ``MarginContainer`` a zamiřte do Inspektorova, abyste stanovili velikost okrajů. Přejděte dolů do třídy ``Control`` do sekce ``Custom Constants``. Rozklikněte ji. Nastavte okraje takto:
de: Wählen Sie den ``MarginContainer`` wieder aus und gehen zum Inspektor, um die Größe des Randes einzustellen. Gehen Sie zum Bereich ``Custom Constants`` der ``Control``-Klasse. Klappen Sie das Menü auf und stellen die Ränder wie folgt ein:
es: Selecciona el ``MarginContainer`` nuevamente, y dirígete al inspector para definir el tamaño de los márgenes. Desplázate por la clase ``Control``, hasta la sección ``Custom Constants``. Despliégala y establece los márgenes como se indica a continuación:
fr: Sélectionnez à nouveau ``MarginContainer`` et dirigez-vous vers l'inspecteur pour définir la taille des marges. Faites défiler la classe ``Control`` vers le bas, jusqu'à la section ``Custom Constants``. Développez-la. Définissez les marges ainsi :
ja: もう一度 ``MarginContainer`` を選択し、インスペクタに進んで余白のサイズを定義します。 ``Control`` クラスを下にスクロールして ``Custom Constants`` セクションに移動します。余白を次のように設定します:
ko: 다시 ``MarginContainer``\ 를 선택하고 인스펙터(Inspector)로 이동해 마진(margin)의 크기를 정의합니다. ``Control`` 클래스를 아래로 스크롤해 ``Custom Constants`` 섹션으로 이동합니다. 섹션을 펼치세요. 마진을 다음과 같이 설정합니다:
pt_br: Selecione o ``MarginContainer`` novamente e vá até o inspetor para definir o tamanho das margens. Desça a classe ``Control``, até a seção ``Custom Constants``. Abra isso. Defina as margens como:
ru: Снова выберите ``MarginContainer`` и переходите в инспектор, чтобы определить размер полей. Прокрутите вниз класс ``Control``, в раздел ``Custom Constants``. Разверните её. Установите такие отступы:
uk: Виберіть ``MarginContainer`` ще раз і перейдіть до інспектора, щоб визначити розмір полів (відступів). Прокрутіть клас ``Control`` вниз до розділу ``Custom Constants``. Розгорніть його. Встановіть поля:
zh_cn: 再次选择 ``MarginContainer``，然后转向属性检查器面板来定义边距的大小。向下滚动 ``Control`` 类，到 ``Custom Constants（自定义常量）`` 部分。展开它。设置边距如下：
zh_tw: 再次選擇 ``MarginContainer`` ，並到屬性面板中設定外邊距 (Margin) 的大小。向下滾動 ``Control`` 類別至 ``Custom Constants`` （自定常數）段落。展開 Custom Constants 並設定外邊距如下：

source: Margin Right: *120*
fr: Marge de droite : *120*
ja: 右マージン: *120*
pt_br: Margem direita: *120*
uk: Margin Right (Поле справа): *120*
zh_cn: 右边距：*120*
zh_tw: Margin Right（右外邊距）：120

source: Margin Top: *80*
cs: Margin Topj: *80*
fr: Marge du haut : *80*
ja: 上マージン: *80*
pt_br: Topo da Margem: *80*
uk: Margin Top (Поле зверху): *80*
zh_cn: 顶部边距：*80*
zh_tw: Margin Top（上外邊距）：80

source: Margin Left: *120*
fr: Marge de gauche : *120*
ja: 左マージン: *120*
pt_br: Margem à esquerda: *120*
uk: Margin Left (Поле зліва): *120*
zh_cn: 左边距：*120*
zh_tw: Margin Left（左外邊距）：120

source: Margin Bottom: *80*
fr: Marge du bas : *80*
ja: 下マージン: *80*
pt_br: Margem Inferior: *80*
uk: Margin Bottom (Поле знизу): *80*
zh_cn: 底部边距：*80*
zh_tw: Margin Bottom（下外邊距）：80

source: We want the container to fit the window. In the toolbar above the Viewport, open the **Layout** menu and select the last option, **Full Rect**.
cs: Chceme, aby kontejner pokryl celé okno. Na panelu nástrojů nad výřezem otevřete nabídku **Rozvržení** a vyberte poslední možnost, **Full Rect**.
de: Wir wollen, dass der Container das ganze Fenster einnimmt. Öffnen Sie das Menü ``Layout`` im Ansichtsfenster und wählen die letzte Option aus, ``Full Rect``.
ja: コンテナをウィンドウに合わせます。 ビューポートの上のツールバー中の\ **レイアウト**\ メニューを開き、最後のオプション\ **Rect全面**\ を選択します。
ko: 컨테이너를 창의 크기에 맞추고 싶습니다. 뷰포트 위의 툴바에서, **레이아웃(Layout)** 메뉴를 열고, 마지막 설정인 **사각형 전체(Full Rect)**\ 를선택하세요.
ru: Мы хотим, чтобы контейнер соответствовал окну. На панели инструментов над окном просмотра откройте меню ``Layout`` и выберите последний вариант, ``Full Rect``.
uk: Ми хочемо, щоб контейнер помістився у вікно. На панелі інструментів над вікном перегляду відкрийте меню **Макет ** та виберіть останній варіант **Увесь прямокутник**.
zh_cn: 我们希望容器能充满窗口。在视图上方的工具栏中，打开 ``布局（Layout）`` 菜单，然后选择最后一个选项 ``Full Rect``。
zh_tw: 接著我們讓 Container 填滿視窗。在檢視區上方的工具列中點開 **畫面配置** 選單並選擇最後一個選項： **全矩形** 。

source: Add the UI sprites
cs: Přidání spritů uživatelského rozhraní
de: Hinzufügen der UI-Sprites
es: Añade los sprites de la UI
fr: Ajoutez les sprites de l'interface
ja: UIスプライトを追加する
ko: UI 스프라이트 추가하기
pt_br: Adicione as sprites da interface do usuário
ru: Добавление спрайтов
uk: Додавання спрайтів до інтерфейсу
zh_cn: 添加UI精灵
zh_tw: 新增 UI Sprite

source: Select the ``MarginContainer``, and create the UI elements as ``TextureRect`` nodes. We need:
cs: Vyberte ``MarginContainer`` a vytvořte prvky uživatelského rozhraní jako uzly ``TextureRect``. Potřebujeme:
de: Wählen Sie den ``MarginContainer`` aus und erzeugen die Oberflächenelemente als ``TextureRect``-Nodes. Wir brauchen:
es: Selecciona el ``MarginContainer``, y crea los elementos de UI como nodos ``TextureRect``. Necesitamos:
fr: Sélectionnez ``MarginContainer``, et créez les éléments de l'interface utilisateur en tant que nœuds ``TextureRect``. Nous avons besoin :
ja: ``MarginContainer`` を選択し、UI要素を ``TextureRect`` ノードとして作成します。必要なもの:
ko: ``MarginContainer``\ 를 선택하고 ``TextureRect`` 노드로 UI 요소를 만드세요. 우리는 다음 요소들이 필요합니다:
pt_br: Selecione o ``MarginContainer`` e crie os elementos da interface do usuário como nós ``TextureRect``. Nós precisamos:
ru: Выберите``MarginContainer`` и создайте узел ``TextureRect``. Нам нужно:
uk: Виберіть ``MarginContainer``, і створіть такі вузли інтерфейсу як ``TextureRect``. Нам потрібні:
zh_cn: 选择 ``MarginContainer``，并将UI元素创建为 ``TextureRect`` 节点。我们需要：
zh_tw: 選擇 ``MarginContainer`` ，並建立如 ``TextureRect`` 的 UI 元素節點。我們需要：

source: the title or logo,
cs: název nebo logo,
de: Den Titel oder das Logo,
ja: タイトルまたはロゴ、
ko: 타이틀이나 로고,
ru: Название или логотип,
uk: назва і логотип,
zh_cn: 标题或LOGO；
zh_tw: 標題或 LOGO，

source: the three text options as individual nodes,
cs: tři možnosti textu jako jednotlivé uzly,
de: die drei Textoptionen als einzelne Nodes,
ja: 3つのテキスト選択項目を個別のノードで、
ko: 개별 노드로 구성된 세 개의 텍스트 설정,
ru: Три варианта текста, как отдельные узлы,
uk: три варіанти тексту в якості окремих вузлів,
zh_cn: 三个文本选项，作为单独的节点；
zh_tw: 三個文字選項，每個都是單獨的節點，

source: the version note,
cs: poznámku k verzi,
de: Die Versionsangabe
ja: バージョン表示、
ko: 버전 노트,
ru: Информация о версии,
uk: інформація про версію,
zh_cn: 版本注释；
zh_tw: 版本註解，

source: and the main menu's illustration.
cs: a ilustraci hlavního menu.
de: Und die Darstellung des Hauptmenüs.
ja: そしてメインメニューのイラスト。
ko: 그리고 메인 메뉴의 일러스트.
ru: И иллюстрация главного меню.
uk: і ілюстрація головного меню.
zh_tw: 以及主選單的插圖。

source: Click the **Add Node** button or press :kbd:`Ctrl + A` (:kbd:`Cmd + A` on macOS) on your keyboard. Start to type ``TextureRect`` to find the corresponding node and press enter. With the new node selected, press :kbd:`Ctrl + D` (:kbd:`Cmd + D` on macOS) five times to create five extra ``TextureRect`` instances.
cs: Klikněte na tlačítko **Přidat uzel** nebo stiskněte :kbd:`Ctrl + A` (:kbd:`Cmd + A` na MacOS) na klávesnici. Začněte psát ``TextureRect`` a najděte odpovídající uzel a stiskněte enter. S vybraným novým uzlem stiskněte pětkrát :kbd:`Ctrl + D` (:kbd:`Cmd + D` v systému MacOS) a vytvořte pět dalších instancí ``TextureRect``.
de: Klicken Sie auf **Add Node** oder drücken :kbd:`Strg + A` (:kbd:`Cmd + A` auf MacOS) auf der Tastatur. Geben Sie ``TextureRect`` ein, um das entsprechende Node zu finden und drücken Enter. Mit der neuen Node ausgewählt, drücken fünf Mal :kbd:`Strg + D` (:kbd:`Cmd + D` auf MacOS), um fünf zusätzliche ``TextureRect`` Instanzen zu erzeugen.
ja: **ノードを追加** ボタンをクリックするか、キーボードの :kbd:`Ctrl + A` (macOSでは :kbd:`Cmd + A`) を押します。\ ``TextureRect`` と入力して対応するノードを検索し、Enterキーを押します。新しいノードを選択した状態で、\ :kbd:`Ctrl + D` (macOSでは :kbd:`Cmd + D`) を5回押して、追加の ``TextureRect`` インスタンスを5つ作成します。
ko: **노드 추가** 버튼을 클릭하거나 키보드에서 :kbd:`Ctrl + A`(macOS의 경우 :kbd:`Cmd + A`)를 누르세요. ``TextureRect``\ 를 입력해 해당 노드를 찾고 엔터키를 누르세요. 새 노드를 선택한 상태에서 :kbd:`Ctrl + D`(macOS의 경우 :kbd:`Cmd + D`)를 다섯 번 눌러 ``TextureRect`` 인스턴스 5개를 추가로 생성하세요.
uk: Натисніть кнопку **Додати вузол**, або натисніть ``Ctrl+A`` (:kbd:`Cmd + A` на macOS) на клавіатурі. Почніть вводити, ``TextureRect``, щоб знайти відповідний вузол, і натисніть клавішу Enter. Вибравши новий вузол, натисніть ``Ctrl+D`` (:kbd:`Cmd + D` на macOS) п'ять раз, щоб створити п'ять додаткових екземплярів ``TextureRect``.
zh_tw: 點擊 **新增節點** 按鈕或是使用鍵盤快捷鍵 :kbd:`Ctrl + A` （或是 macOS 上 :kbd:`Cmd + A` ）。輸入 ``TextureRect`` 來搜尋對應的節點並按 Enter 鍵。選擇新增的節點後，按 :kbd:`Ctrl + D` （或是 macOS 上 :kbd:`Cmd + D` ）五次來建立另外五個 ``TextureRect`` 實體。

source: Click each of the nodes to select it. In the inspector, find the **Texture** property and click **[empty] > Load**. A file browser opens and lets you pick a sprite to load into the texture slot.
cs: Klepnutím na jednotlivé uzly jej vyberte. V Inspektoru najděte vlastnost **Texture** a klikněte na **[prázdný]> Načíst**. Otevře se prohlížeč souborů a umožní vám vybrat sprite pro načtení textury.
de: Wählen Sie jedes der Nodes mit einem Klick darauf aus. Finden Sie die ``Texture`` Eigenschaft im Inspektor und klicken auf ``[leer]`` -> ``Lade``. Eine Dateiauswahl öffnet sich und lässt Sie ein Sprite auswählen, das in den Texture-Slot geladen wird.
ja: 各ノードをクリックして選択します。インスペクタで **Texture** プロパティを見つけ、\ **[空] > 読込み** をクリックします。ファイルブラウザが開き、テクスチャスロットにロードするためのスプライトを選択できます。
ko: 각 노드를 클릭해서 선택하세요. 인스펙터(inspector)에서 **Texture** 속성을 찾아, **[비었음]([empty]) -> 불러오기(Load)**\ 를 클릭합니다. 파일 브라우저가 열리면 텍스처 슬롯에 불러올 스프라이트를 선택할 수 있습니다.
ru: Щелкните на каждый из узлов, чтобы выбрать его. В инспекторе найдите свойство **Texture** и нажмите [пусто], далее "Загрузить". Откроется проводник, который позволяет выбрать спрайт для загрузки в слот текстуры.
uk: Клацніть кожен з вузлів, щоб вибрати його. У інспекторі знайдіть властивість **Texture** та натисніть **[порожньо]> Завантажити**. Відкриється браузер файлів і дозволить вибрати спрайт для встановлення текстури.
zh_cn: 点击每个节点以将其选中。在属性检查器中，找到 ``Texture`` 属性，然后点击``[empty]`` -> ``Load``。将打开一个文件浏览器，让您选择一个精灵以加载到纹理插槽中。
zh_tw: 分別點擊來選中各個節點。在屬性面板中找到 **Texture** （紋理貼圖），並點擊 **[空] > 載入** 。接著會顯示檔案瀏覽器，可以選擇要載入進紋理貼圖欄位用的 Sprite。

source: The file browser lets you find and load textures.
cs: Prohlížeč souborů umožňí najít a načíst textury.
de: Die Dateiauswahl lässt Sie Texturen finden und laden.
ja: ファイルブラウザを使用すると、テクスチャを検索してロードすることができます。
ko: 파일 브라우저에서 불러올 텍스처를 찾을 수 있습니다.
ru: Файловый проводник позволяет найти и загрузить текстуры.
uk: Браузер файлів дозволяє знаходити та завантажувати текстури.
zh_cn: 文件浏览器可以让你查找和加载贴图。
zh_tw: 可以在檔案瀏覽器內找到並載入紋理貼圖。

source: Repeat the operation for all ``TextureRect`` nodes. You should have the logo, the illustration, the three menu options and the version note, each as a separate node. Then, double click on each of the nodes in the Scene tab to rename them. Nothing has been placed in containers yet so this should look messy.
cs: Opakujte operaci pro všechny uzly ``TextureRect``. Měli byste mít logo, obrázek, tři možnosti nabídky a poznámku k verzi, vše jako samostatný uzel. Poté poklepejte na každý z uzlů na kartě Scéna a přejmenujte je. Do kontejnerů zatím nebylo nic umístěno, takže vše vypadá krapet chaoticky.
de: Wende die Operation auf alle ``TextureRect``-Nodes an. Das Logo, die Illustration, die drei Menüpunkte und die Versionsangabe sollten jeweils eigene Nodes sein. Benenne die Nodes dann im Szenenfenster durch einen Doppelklick um. Da noch nichts im Container platziert wurde, sieht er noch etwas unordentlich aus.
fr: Répétez l'opération pour tous les nœuds ``TextureRect``. Vous devriez avoir le logo, l'illustration, les trois options de menu et la note de version, chacun ayant son propre nœud. Ensuite, double-cliquez sur chacun des nœuds dans l'Inspecteur pour les renommer. Comme les noeuds ne sont pas placés dans un Container, ils vont se chevaucher.
ja: すべての ``TextureRect`` ノードに対して操作を繰り返します。ロゴ、イラスト、３つのメニューオプション、バージョンノートがそれぞれ別個のノードとして必要です。次に、[シーン]タブの各ノードをダブルクリックして、名前を変更します。コンテナにはまだ何も配置されていないため、このままでは乱雑に見えるはずです。
ko: 모든 ``TextureRect`` 노드에 대해 이 작업을 반복하세요. 로고, 일러스트레이션, 세 가지 메뉴, 옵션, 버전 노트가 각각 별도의 노드로 만들어져 있어야 합니다. 그런 다음 장면 탭에서 각 노드를 두 번 클릭해 이름을 바꾸세요. 아직 컨테이너에 아무것도 넣지 않았으므로 지저분해 보입니다.
ru: Повторите операцию для всех узлов ``TextureRect``. У вас должен быть логотип, иллюстрация, три опции для меню и информация о версии, каждая как отдельный узел. Затем дважды щелкните на каждом из узлов на вкладке Сцена, чтобы переименовать их. Пока что элементы не были помещены в контейнеры, поэтому это будет выглядеть странно.
uk: Повторіть операцію для всіх вузлів ``TextureRect``. У вас повинен бути логотип, ілюстрація, три варіанти меню та інформація про версію, кожен як окремий вузол. Потім двічі клацніть на кожному з вузлів на вкладці Сцена, щоб перейменувати їх. Елементи ще не були поміщені в контейнери, тому виглядають безладно.
zh_cn: 对所有 ``TextureRect`` 节点重复该操作。您应该拥有logo、插图、三个菜单选项和版本标注，它们分别作为一个单独的节点。然后，双击场景选项卡中的每个节点以重命名它们。尚未在容器中放置任何东西，因此看起来应该很杂乱。
zh_tw: 在每個 ``TextureRect`` 節點上重複這個步驟。現在我們應該有了 Logo、插圖、三個選單的選項、以及版本節點。這幾個項目應該都是各自獨立的節點。接著，在場景分頁中的各個節點上點兩下並重新命名。我們還沒把東西放在 Container 內，所以現在看起來應該亂亂的。

source: The six nodes with textures loaded.
cs: Šest uzlů s načtenými texturami.
de: Die sechs Nodes, mit geladenen Texturen.
ja: テクスチャがロードされた6つのノード。
ko: 텍스처를 불러온 6 개의 노드.
ru: Шесть узлов с загруженными текстурами.
uk: Шість вузлів із завантаженими текстурами.
zh_cn: 六个带贴图的节点已加载。
zh_tw: 六個有設定好紋理貼圖的節點。

source: If you want to support localization in your game, use ``Labels`` for menu options instead of ``TextureRect``.
cs: Pokud chcete ve vaší hře podporovat lokalizaci, použijte ``Labels`` pro možnosti nabídky namísto ``TextureRect``.
de: Wenn Ihr Spiel Übersetzungen unterstützen soll, dann benutzen Sie ``Labels`` anstelle von ``TextureRect``.
es: Si quieres apoyar la localización en tu juego, usa ``Labels`` para opciones de menú en lugar de ``TextureRect``.
fr: Si vous souhaitez prendre en charge la localisation dans votre jeu, utilisez ``Labels`` pour les options de menu au lieu de ``TextureRect```.
ja: ゲームを多言語化対応させたい場合は、\ ``TextureRect`` の代わりにメニューオプションに ``Labels`` を使用してください。
ko: 게임에 현지화를 지원하고 싶다면, 메뉴 설정에 ``TextureRect`` 대신에 ``Labels``\ 을 사용하세요.
pt_br: Se você quer apoiar a localização no seu jogo, use ``Labels`` para opções de menu ao invés de ``TextureRect``.
ru: Если вы хотите добавить возможность локализации вашей игры, используйте ``Labels`` для опций меню вместо ``TextureRect``.
uk: Якщо ви хочете підтримати локалізацію гри, використовуйте ``Labels`` для параметрів меню замість ``TextureRect``.
zh_cn: 如果要在游戏中支持本地化，请使用 ``Labels`` 代替菜单项 ``TextureRect``。
zh_tw: 如果想在遊戲中支援多語言，可以在選單項目上使用 ``Label`` 來代替 ``TextureRect`` 。

source: Add containers to place UI elements automatically
cs: Přidání kontejnerů pro automatickému umístění prvků uživatelského rozhraní
de: Füge Container ein, um UI-Elemente automatisch zu platzieren
es: Añade contenedores para colocar elementos de UI automáticamente
fr: Ajoutez des conteneurs pour placer automatiquement les éléments de l'interface utilisateur
ja: UI要素を自動配置するコンテナを追加する
ko: 컨테이너를 추가해 UI 요소들을 자동으로 배치하기
pt_br: Adicionar contêineres para colocar elementos da interface do usuário automaticamente
ru: Добавьте контейнеры для автоматического размещения элементов UI
uk: Додавання контейнерів для автоматичного розміщення елементів інтерфейсу
zh_cn: 添加容器以自动放置UI元素
zh_tw: 新增容器來自動擺放 UI 元素

source: Our main menu has some margin around the edges of the screen. It is split in two parts: on the left, you have the logo and the menu options. On the right, you have the characters. We can use one of two containers to achieve this: ``HSplitContainer`` or ``HBoxContainer``. Split containers split the area into two: a left and a right side or a top and a bottom side. They also allow the user to resize the left and right areas using an interactive bar. On the other hand, ``HBoxContainer`` just splits itself into as many columns as it has children. Although you can deactivate the split container's resize behavior, I recommend to favor box containers.
cs: Naše hlavní menu má určitý odstup od okrajů obrazovky (tzv. padding). Je rozděleno na dvě části: vlevo máme logo a možnosti menu. Na pravé straně, máme znaky. K dosažení tohoto cíle můžeme použít jeden ze dvou kontejnerů: ``HSplitContainer`` nebo ``HBoxContainer``. Split kontejnery rozdělují na dvě části: levou a pravou stranu nebo horní a dolní stranu. Umožňují také uživatelsky změnit velikost levé a pravé oblasti pomocí interaktivního panelu. Na druhou stranu, ``HBoxContainer`` se jenom rozdělí na tolik sloupců, kolik má podřízených uzlů. I když můžete deaktivovat uživatelskou změnu velikosti rozdělelovacího kontejneru, doporučuji upřednostňovat box kontejnery.
de: Unser Hauptmenü hat einen gewissen Abstand zum Bildschirmrand. Es unterteilt sich in zwei Bereiche: links das Logo und die Menüpunkte, rechts die Charaktere. Wir können einen der beiden Container benutzen, um das zu erreichen: ``HSplitContainer`` oder ``HBoxContainer``. Split Container teilen den Bereich entzwei: eine linke und eine rechte Seite oder eine obere und eine untere Seite. Sie erlauben es dem Benutzer auch, die Größen der linken und rechten Bereiche über eine interaktive Leiste einzustellen. Andererseits spaltet sich ein ``HBoxContainer``einfach in so viele Spalten wie er Kinder hat. Obwohl die Variable Größe des Split Containers abgeschaltet werden kann, empfehle ich den Gebrauch von Box Container.
ja: メインメニューは画面の端にマージンがあります。2つの部分に分かれていて、左側にはロゴとメニュー項目があります。右側にはキャラクターたちがいます。これを実現するには、 ``HSplitContainer`` または ``HBoxContainer`` という2つのコンテナのいずれかを使用します。分割(Split)コンテナは、領域を左右または上下に分割します。また、インタラクティブなバーを使用して、左右の領域のサイズを変更することもできます。一方、 ``HBoxContainer`` は、子の数と同数の列に分割します。分割コンテナでもサイズ変更動作を無効にできますが、Boxコンテナを優先することをお勧めします。
zh_tw: 主選單的周圍有留白，中間則分成兩個部分：左邊有 Logo 與選單項目，右邊有 Characters。我們可以使用 ``HSplitContainer`` 或 ``HBoxContainer`` 的其中一個。SplitContainer 會將區塊分隔成左右兩邊或上下兩邊。SplitContainer 也可以讓使用者使用可互動的伸縮條來調整左右區塊的大小。另外， ``HBoxContainer`` 則是有幾個子節點就分割成幾列。雖然 SplitContainer 的縮放功能可以關閉，但我還是建議使用 Box Container。

source: Select the ``MarginContainer`` and add an ``HBoxContainer``. Then, we need two containers as children of our ``HBoxContainer``: a ``VBoxContainer`` for the menu options on the left, and a ``CenterContainer`` for the illustration on the right.
cs: Vyberte ``MarginContainer`` a přidejte ``HBoxContainer``. Poté potřebujeme dva kontejnery jako podřízené položky našeho ``HBoxContainer`` pro možnosti nabídky vlevo a ``CenterContainer`` pro ilustraci vpravo.
de: Wählen Sie den ``MarginContainer`` aus und fügen einen ``HBoxContainer`` hinzu. Dann brauchen wir zwei untergeordnete Container als Kinder unseres ``HBoxContainer``: einen ``VBoxContainer`` für die Menüpunkte zur Linken und einen ``CenterContainer`` für die Illustration zur Rechten.
es: Selecciona el ``MarginContainer`` y añade un ``HBoxContainer``. Entonces, necesitaremos dos contenedores como hijos de nuestro ``HBoxContainer``: un ``VBoxContainer`` para las opciones de menú de la izquierda, y un ``CenterContainer`` para la ilustración de la derecha.
fr: Sélectionnez ``MarginContainer`` et ajoutez un ``HBoxContainer``. Ensuite, nous avons besoin de deux conteneurs comme enfants de notre ``HBoxContainer`` : un ``VBoxContainer`` pour les options de menu à gauche, et un ``CenterContainer`` pour l'illustration à droite.
ja: ``MarginContainer`` を選択してから、 ``HBoxContainer`` を追加します。次に、 ``HBoxContainer`` の子として2つのコンテナが必要です。左側にはメニュー項目用として ``VBoxContainer`` 、右側にはイラスト用として ``CenterContainer`` を使います。
ko: ``MarginContainer``\ 를 선택하고 ``HBoxContainer``\ 를 추가합니다. 그런 다음 ``HBoxContainer``\ 의 자식으로 왼쪽에는 메뉴 옵션을 넣을 ``VBoxContainer``\ 와 오른쪽에는 삽화를 넣을 ``CenterContainer``\ 두 개의 컨테이너가 필요합니다.
pt_br: Selecione o ``MarginContainer`` e adicione um ``HBoxContainer``. Então, precisamos de dois contêineres como filhos de nosso ``HBoxContainer``: um ``VBoxContainer`` para as opções de menu à esquerda, e um ``CenterContainer`` para a ilustração à direita.
ru: Выберите ``MarginContainer`` и добавьте ``HBoxContainer``. Затем, нам нужны два контейнера, как дети нашего ``HBoxContainer``: ``VBoxContainer`` для опций меню слева, и ``CenterContainer`` для картинки справа.
uk: Виберіть ``MarginContainer`` і додайте ``HBoxContainer``. Далі нам потрібні два контейнери, які будуть нащадками ``HBoxContainer``: ``VBoxContainer`` для параметрів меню зліва та ``CenterContainer`` для ілюстрації праворуч.
zh_cn: 选择 ``MarginContainer`` 并添加 ``HBoxContainer``。然后，我们需要两个容器作为 ``HBoxContainer`` 的子容器：一个 ``VBoxContainer`` 用于左边的菜单选项，一个 ``CenterContainer`` 用于右边的插图。
zh_tw: 選擇 ``MarginContainer`` 並新增一個 ``HboxContainer`` 。接著，我們需要為 ``HBoxContainer`` 新增兩個子容器：左側選單項目用的 ``VBoxContainer`` 以及右側插圖用的 ``CenterContainer`` 。

source: You should have four nested containers and the TextureRect nodes sitting aside from it.
cs: Měli byste mít čtyři vnořené kontejnery a vedle nich uzly TextureRect.
de: Sie sollten vier verschachtelte Container haben und den TextureRect-Node nebendran.
ja: 4つの入れ子になったコンテナと、それとは別に複数のTextureRectノードがあるはずです。
ko: 4 개의 중첩된 컨테이너가 있고, 그 옆에 TextureRect 노드가 있어야 합니다.
ru: У вас должно быть четыре вложенных контейнера и узлы TextureRect расположеные отдельно от них.
uk: У вас повинно бути чотири вкладених контейнери та вузли TextureRect, поруч.
zh_cn: 您应该有四个嵌套容器，并且下方有好几个 ``TextureRect`` 贴图节点。
zh_tw: 現在應該有四個嵌套的容器以及其中的各個 TextureRect。

source: In the node tree, select all the ``TextureRect`` nodes that should go on the left side: the logo, the menu options (Continue, NewGame, Options), and the version note. Drag and drop them into the ``VBoxContainer``. The nodes should position automatically.
cs: Ve stromu uzlů vyberte všechny uzly ``TextureRect``, které by měly být na levé straně: logo, možnosti nabídky (Pokračovat, NewGame, Možnosti) a poznámku k verzi. Přetáhněte je do ``VBoxContainer``. Uzly by měly být umístěny automaticky.
de: Wählen Sie im Node-Baum alle ``TextureRect``-Nodes, die auf die linke Seite gehören: das Logo, die Menüpunkte und die Versionsangabe. Ziehen Sie sie per Drag-and-Drop in den ``VBoxContainer``. Die Nodes sollten sich selbstständig positionieren.
ja: ノードツリーで、左側にあるすべての ``TextureRect`` ノードを選択します (ロゴ、メニュー項目、バージョン表記)。それから、それらを ``VBoxContainer`` にドラッグ＆ドロップします。これらのノードは自動配置されるはずです。
ko: 노드 트리에서 왼쪽에 있어야 하는 모든 ``TextureRect`` 노드들, 즉 로고, 메뉴 옵션(Continue, NewGame, Option), 버전 정보를 선택하세요. 노드들을 ``VBoxContainer``\ 로 끌어다 놓으세요. 노드는 자동으로 배치됩니다.
ru: В дереве узлов выберите все узлы ``TextureRect``, которые должны идти с левой стороны: логотип, параметры и информация о версии. Перетащите их в ``VBoxContainer``. Узлы должны позиционироваться автоматически.
uk: У дереві вузлів виберіть усі ``TextureRect`` вузли, які мають бути з лівого боку: логотип, параметри меню (Continue, NewGame, Options) та примітку до версії. Перетягніть їх у ``VBoxContainer``. Вузли повинні розташовуватися автоматично.
zh_cn: 在节点树中，选择应该在左侧出现的所有 ``TextureRect`` (贴图)节点：logo，菜单选项和版本标注。将它们拖放到 ``VBoxContainer`` 中。节点就会自动定位。
zh_tw: 在節點樹中選擇所有要放在左邊的 ``TextRect`` ：Logo、選單項目（繼續、新遊戲、選項），以及版本備註。將這幾個節點拖曳到 ``VBoxContainer`` 中。接著這些節點應該會自動排列好。

source: Containers automatically place and resize textures
cs: Kontejnery textury automaticky umisťují a zároveň mění jejich velikost
de: Container platzieren Texturen automatisch und passen deren Größe an
es: Los contenedores colocan y redimensionan las texturas automáticamente
fr: Les conteneurs placent et redimensionnent automatiquement les textures
ja: コンテナは自動的にテクスチャを配置してサイズを変更します
ko: 컨테이너가 자동으로 텍스처를 위치시키고 크기를 조정합니다
pt_br: Contêineres automaticamente posicionam e redimensionam texturas
ru: Контейнеры автоматически размещает и изменяет размер текстур
uk: Контейнери автоматично розміщують і змінюють розмір текстур
zh_cn: 容器自动放置和调整纹理大小
zh_tw: 容器自動排放與縮放紋理貼圖
