Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/ui_main_menu.po
Languages: cs, de, es, fr, ja, ko, pt_br, ru, uk, zh_cn, zh_tw

source: We're left with two problems to solve:
cs: Zbývá nám vyřešit dva problémy:
de: Wir müssen noch zwei Probleme lösen:
es: Nos quedan dos problemas por resolver:
fr: Nous avons encore deux problème à résoudre :
ja: 解決すべき問題はあと2つ残されています:
ko: 해결해야 할 두 가지 문제가 남아 있습니다:
pt_br: Ficamos com dois problemas para resolver:
ru: Нам осталось решить две проблемы:
uk: У нас залишаються дві проблеми:
zh_cn: 我们还有两个问题要解决：
zh_tw: 接著我們還有兩個問題要解決：

source: The characters on the right aren't centered.
cs: Znaky napravo nejsou vycentrovány.
de: Die Charaktere rechts sind nicht mittig ausgerichtet.
ja: 右側のキャラクターたちが中央に配置されていません。
ko: 오른쪽의 Characters가 중앙에 있지 않습니다.
ru: Картинка справа не центрирована.
uk: Ілюстрація праворуч не по центру.
zh_cn: 右边的字符没有居中。
zh_tw: 右邊的 Characters 沒有置中。

source: There's no space between the logo and the other UI elements.
cs: Mezi logem a ostatními prvky uživatelského rozhraní není žádný prostor.
de: Zwischen dem Logo und den anderen Oberflächenelementen ist kein Platz.
ja: ロゴと他のUI要素の間にスペースがありません。
ko: 로고와 다른 UI 요소들 사이에 공간이 없습니다.
ru: Между логотипом и другими элементами UI нет места.
uk: Між логотипом та іншими елементами інтерфейсу немає місця.
zh_cn: Logo和其他UI元素之间没有合适的间距。
zh_tw: Logo 與其他 UI 元素間沒有空格。

source: To center the characters on the right, first select the ``CenterContainer``. Then in the Inspector, scroll down to the **Size Flags** category and click on the field to the right of the **Vertical** property, and check **Expand** in addition to **Fill**. Do the same for the **Horizontal** property. This makes the ``CenterContainer`` expand into all available space while respecting its neighbour ``VBoxContainer``. Finally, drag and drop the Characters node into the ``CenterContainer``. The Characters element will center automatically.
cs: Chcete-li vystředět znaky vpravo, vyberte nejprve ``CenterContainer``. Pak v Inspectoru přejděte dolů do kategorie **Size Flags** a klikněte na pole vpravo od vlastnosti **Vertical** a zaškrtněte kromě **Fill** také **Expand** . Totéž pro **Horizontal** vlastnost. Díky tomu se ``CenterContainer`` rozšíří do celého dostupného prostoru a zároveň respektuje svého souseda ``VBoxContainer``. Nakonec přetáhněte uzel Znaky do ``CenterContainer``. Prvek Znaky se automaticky vystředí.
de: Um die Figuren rechts mittig auszurichten, verwenden wir einen ``CenterContainer``. Fügen Sie einen ``CenterContainer`` als Unter-Node des ``HBoxContainer`` hinzu. Scrollen Sie dann im Inspektor zur Kategorie ``Size Flags`` und klicken auf das Feld rechts von der Eigenschaft ``Vertical`` und kreuzen ``Expand`` sowie ``Fill`` an. Ebenso für die Eigenschaft ``Horizontal``. Ziehen Sie schließlich die Figuren in den ``CenterContainer``. Das Element wird automatisch zentriert.
ja: キャラクターたちを右に中央揃えするには、最初に ``CenterContainer`` を選択します。次に、インスペクタで **Size Flags** カテゴリまで下にスクロールし、 **Vertical** プロパティの右側のフィールドをクリックして、 **Fill** に加えて **Expand** をチェックします。 **Horizontal** プロパティについても同じことを行います。これにより、 ``CenterContainer`` は、隣接する ``VBoxContainer`` を尊重しながら、使用可能なすべてのスペースに拡張されます。最後に、Charactersノードを ``CenterContainer`` にドラッグ＆ドロップします。Characters要素は自動的に中央に配置されます。
ko: 캐릭터를 오른쪽 중앙에 오게 하려면 먼저 ``CenterContainer``\ 를 선택하세요. 그런 다음 인스펙터(Inspector)에서 **Size Flags** 카테고리로 스크롤해 **Vertical** 속성의 오른쪽에 있는 필드를 클릭하고 **Fill**\ 과 함께 **Expand**\ 를 선택하세요. **Horizontal** 속성에도 똑같이 해주세요. 이렇게 하면 ``CenterContainer``\ 가 이웃 ``VBoxContainer``\ 를 존중하면서 차지할 수 있는 모든 공간으로 확장됩니다. 마지막으로 Characters 노드를 ``CenterContainer``\ 로 끌어다 놓으세요. Characters 요소는 자동으로 중앙에 배치됩니다.
ru: Чтобы центрировать картинку справа, мы будем использовать ``CenterContainer``. Добавьте узел ``CenterContainer`` в качестве дочернего элемента ``HBoxContainer``. Затем в инспекторе, прокрутите вниз до ``Size Flags`` и нажмите на поле справа от свойства ``Vertical``, и выберите ``Expand``. Сделайте то же самое для свойства ``Horizontal``. Наконец перетащите картинку в ``CenterContainer``. Картинка будет центрирована автоматически.
uk: Для центрування ілюстрації праворуч спочатку виберіть значок ``CenterContainer``. Потім у Інспекторі прокрутіть униз до категорії **Size Flags**, натисніть на поле праворуч від властивості **Vertical** та поставте прапорець **Expand** на додаток до **Fill**. Зробіть те саме для властивості **Horizontal**. Це змушує ``CenterContainer`` розширюватися на весь доступний простір, поважаючи свого сусіда ``VBoxContainer``. Нарешті, перетягніть вузол ілюстрації у ``CenterContainer``. Елемент Characters буде централізовано автоматично.
zh_cn: 要使字符居右，请首先选择 ``CenterContainer``。然后在属性检查器中，向下滚动到 ``尺寸标记（Size Flags）`` 类别，然后点击 ``垂直（Vertical）`` 属性右侧的字段，并检查 ``扩展（Expand）`` 还有 ``填充（Fill）``。对 ``水平（Horizontal）`` 属性执行相同的操作。这使得 ``CenterContainer`` 扩展到所有可用空间，同时不妨碍其邻居 ``VBoxContainer``。最后，将 ``Characters`` 节点拖放到 ``CenterContainer`` 中。``Characters`` 元素将自动居中。
zh_tw: 接下來我們要把右邊的 Characters 置中。先選擇 ``CenterContainer`` ，然後在屬性面板中找到 **Size Flags** （大小旗標）分類，並點擊 **Vertical** （垂直）屬性右邊的欄位，並將 **Fill** （填充）與 **Expand** （延展）打勾。接著在 **Horizontal** （水平）上做相同的設定。這樣一來 ``CenterContainer`` 就會在不擠壓相鄰的 ``BoxContainer`` 節點的情況下同時填滿所有可用空間。最後，將 Characters 節點拖曳到 ``CenterContainer`` 裡，Characters 元素會自動置中。

source: The character node centers inside the right half of the screen as soon as you place it inside the CenterContainer.
cs: Uzel znaku se vystředí uvnitř pravé poloviny obrazovky, jakmile jej umístíte do CenterContaineru.
de: Der Charakter-Node richtet sich mittig in der rechten Bildschirmhälfte aus, sobald Sie ihn in dem CenterContainer platzieren.
ja: キャラクターノードは、CenterContainer内に配置するとすぐに画面の右半分の中央に配置されます。
ko: Character 노드는 CenterContainer 내부에 배치하는 즉시 화면의 오른쪽 중앙 중앙에 위치합니다.
ru: Картинка будет центрирована в правой половине экрана, как только вы поместите её внутрь CenterContainer.
uk: Вузол з картинкою центрований в правій половині екрана після розміщення всередині CenterContainer.
zh_cn: 将角色节点放置在 ``CenterContainer`` 中后，它将立即在屏幕的右半部分居中。
zh_tw: 在畫面右半邊的 Characters 節點會在放入 CenterContainer 後立刻置中。

source: To space out the menu options and the logo on the left, we'll use one final container and its size flags. Select the ``VBoxContainer`` and press :kbd:`Ctrl + A` (:kbd:`Cmd + A` on macOS) to add a new node inside it. Add a second ``VBoxContainer`` and name it *MenuOptions*. Select all three menu options, ``Continue``, ``NewGame`` and ``Options``, and drag and drop them inside the new ``VBoxContainer``. The UI's layout should barely change, if at all.
cs: Pro rozmístění nabídky možnosti a loga nalevo, použijeme dálší kontejner a příznaky jeho velikosti. Vyberte ``VBoxContainer`` a stisknutím klávesy :kbd:`Ctrl + A` (:kbd:`Cmd + A` v systému macOS) do něj přidejte nový uzel. Konkrétně druhý ``VBoxContainer`` a pojmenujte jej *MenuOptions*. Vyberte všechny tři možnosti nabídky, ``Pokračovat``, ``NewGame`` a ``Možnosti`` a přetáhněte je do nového ``VBoxContainer``. Rozložení uživatelského rozhraní by se téměř nemělo změnit.
de: Um die Menüpunkte und das Logo links auseinanderzuziehen, werden wir einen letzten Container mit seinen size flags verwenden. Wählen Sie den ``VBoxContainer`` und drücken :kbd:`Strg + A` (:kbd:`Cmd + A` auf MacOS), um ein neues Node darin einzufügen. Fügen Sie einen zweiten ``VBoxContainer`` hinzu und nennen ihn *MenuOptions*. Wählen Sie alle drei Menüpunkte ``Continue``, ``NewGame`` und ``Options`` und ziehen diese in den neuen ``VBoxContainer``. Das Layout der Benutzeroberfläche sollte sich, wenn überhaupt, kaum ändern.
ja: メニューオプションと左側のロゴの間隔を空けるために、1つの最終コンテナとそのサイズフラグを使用します。\ ``VBoxContainer`` を選択して :kbd:`Ctrl + A` (macOSでは :kbd:`Cmd + A`) を押し、その中に新しいノードを追加します。2番目の ``VBoxContainer`` を追加して、\ *MenuOptions* という名前を付けます。3つのメニューオプション ``Continue``\ 、\ ``NewGame`` \ 、\ ``Options`` をすべて選択し、新しい ``VBoxContainer`` 内にドラッグ&ドロップします。 UIのレイアウトは、もし変わるとしてもわずかです。
ko: 메뉴 옵션과 왼쪽의 로고 사이에 간격을 두기 위해 최종 컨테이너 하나와 크기 플래그를 사용할 것입니다. ``VBoxContainer``\ 를 선택하고 :kbd:`Ctrl + A`(macOS에서는 :kbd:`Cmd + A`)를 눌러 내부에 새 노드를 추가하세요. 두 번째 ``VBox컨테이너``\ 를 추가하고 이름을 *MenuOptions*\ 이라고 지으세요. 세 가지 메뉴 옵션인 ``Continue``, ``NewGame``, ``Options``\ 를 모두 선택하고 새 ``VBoxContainer``\ 에 끌어다 놓으세요. UI의 레이아웃은 전혀 변경되지 않습니다.
uk: Щоб додати простору між меню і логотипом, ми використаємо ще один контейнер ``VBoxContainer`` і його прапорці розмірів (Size Flags). Виберіть ``VBoxContainer`` і натисніть :kbd:`Ctrl+A` (:kbd:`Cmd + A` на macOS), щоб додати в нього новий вузол. Додайте другий ``VBoxContainer`` та назвіть його *MenuOptions*. Виберіть усі три параметри меню ``Continue``, ``NewGame`` і ``Options`` та перетягніть їх всередину нового ``VBoxContainer``. Макет інтерфейсу повинен ледь змінитися, якщо він взагалі зміниться.
zh_tw: 要為左邊的選單選項與 Logo 加上間隙，我們需要再使用一個容器，並設定大小旗標。選擇 ``VBoxContainer`` 並按鍵盤 :kbd:`Ctrl + A` （或是 macOS 上 :kbd:`Cmd + A` ）來在 VBoxContainer 內新增節點。接著再新增第二個 ``VBoxCOntainer`` 並命名為 **MenuOptions** （選單項目）。選擇所有選單項目： ``Continue`` 、 ``NewGame`` 、與 ``Options`` ，並將這幾個選項拖曳至剛才新建的 ``VBoxContainer`` 中。界面的畫面配置大致看起來應該還跟剛才差不多。

source: Place the new container between the other two nodes to retain the UI's layout.
cs: Umístěte nový kontejner mezi další dva uzly, abyste zachovali rozložení uživatelského rozhraní.
de: Platziere den neuen Container zwischen die anderen beiden Nodes, um das Layout der UI zu beizubehalten.
ja: UIのレイアウトを保持するには、他の2つのノードの間(LogoとVersionの間)に新しいコンテナーを配置します。
ko: UI의 레이아웃을 유지하려면 다른 두 노드 사이에 새 컨테이너를 배치하세요.
ru: Поместите новый контейнер между другими двумя узлами, чтобы сохранить макет пользовательского интерфейса.
uk: Помістіть новий контейнер між іншими двома вузлами, щоб зберегти макет інтерфейсу користувача.
zh_cn: 将新容器放置在其他两个节点之间，以保持UI的布局。
zh_tw: 在其他兩個節點中間放置一個新的容器來維持 UI 的畫面配置。

source: Now we grouped the menu options together, we can tell their container to expand to take as much vertical space as possible. Select the ``MenuOptions`` node. In the Inspector, scroll down to the **Size Flags** category. Click on the field to the right of the **Vertical** property, and check **Expand** in addition to **Fill**. The container expands to take all the available vertical space while respecting its neighbors, the ``Logo`` and ``Version`` elements.
cs: Nyní, když jsme seskupili možnosti nabídky do jednoho kontejneru, můžeme mu říci, aby se rozbalil tak, aby zabral co nejvíce vertikálního prostoru. Vyberte uzel ``MenuOptions``. V Inspektoru přejděte dolů do kategorie **Size flags**. Klikněte na pole vpravo od vlastnosti **Vertical** a zaškrtněte kromě **Fill** také **Expand** . Kontejner se rozbalí tak, aby zabral veškerý dostupný vertikální prostor při respektování svých sousedů, prvků ``Logo`` a ``Version``.
de: Nachdem wir die Menüpunkte zusammengefasst haben, können wir ihren Container anweisen, so viel senkrechten Raum wie möglich einzunehmen. Wählen Sie den Node ``MenuOptions``. Gehen Sie im Inspektor herunter zu der Kategorie ``Size Flags``. Klicken Sie auf das Feld rechts neben der Eigenschaft ``Vertical`` und kreuzen ``Expand`` sowie ``Fill`` an. Der Container dehnt sich aus und nimmt den ganzen verfügbaren senkrechten Raum ein. Aber er berücksichtigt seine Nachbarn, die Elemente ``Logo`` und ``Version``.
ja: ここで、メニューオプションをグループ化して、コンテナを拡張し、できるだけ多くの垂直方向のスペースを取るように指示することができます。まず ``MenuOptions`` ノードを選択します。インスペクタで、 **Size Flags** カテゴリまでスクロールダウンします。 **Vertical** プロパティの右側のフィールドをクリックし、 **Fill** に加えて **Expand** をチェックします。コンテナは、隣接する ``Logo`` 要素と ``Version`` 要素を尊重しながら、利用可能なすべての垂直方向のスペースを取るように拡張します。
ko: 이제 메뉴 옵션을 함께 그룹화하면 컨테이너가 확장되어 가능한 한 많은 수직 공간을 차지하도록 할 수 있습니다. ``MenuOptions`` 노드를 선택합니다. 인스펙터(Inspector)에서 **Size Flags** 카테고리까지 아래로 스크롤하세요. **Vertical** 속성의 오른쪽에 있는 영역을 클릭하고 **Fill**\ 과 함께 **Expand**\ 를 선택하세요. 컨테이너는 이웃인 ``Logo`` 및 ``Version`` 요소의 영역을 침범하지 않으면서 사용 가능한 모든 수직 공간을 차지하도록 확장됩니다.
ru: Теперь мы сгруппировали варианты меню вместе, мы можем указать их контейнерам расшириться как можно больше вертикально. Выберите узел ``MenuOptions``. В инспекторе прокрутите вниз до категории ``Size Flags``. Нажмите на поле справа от свойства ``Vertical`` и установите флажок ``Expand`` в дополнение к ``Fill``. Контейнер расширится, чтобы взять все доступное вертикальное пространство, уважая при этом своих соседей, ``Logo`` и``Version``.
uk: Тепер, коли ми згрупували параметри меню разом, ми можемо змусити їх контейнер розширитись, щоб зайняти якомога більше вертикального простору. Виберіть вузол ``MenuOptions``. У Інспекторі прогорніть униз до розділу **Size Flags**. Клацніть на полі праворуч від властивості **Vertical** і встановіть галочку **Expand** на додаток до **Fill**. Контейнер розширюється, щоб зайняти весь доступний вертикальний простір, поважаючи своїх сусідів, елементи ``Logo`` та ``Version``.
zh_cn: 现在我们将菜单选项编组在一起，我们可以让它们的容器扩展到尽可能多的垂直空间。选择 ``MenuOptions`` 节点。在属性检查器面板中，向下滚动到 ``尺寸标志（Size Flags）`` 类别。点击 ``垂直（Vertical）`` 属性右侧的字段，并检查 ``展开（Expand）`` 和 ``填充（Fill）``。容器将扩展以占据所有可用的垂直空间。但它不会影响到它的邻居， 即 ``Logo`` 和 ``Version`` 元素。
zh_tw: 我們現在已經把所有選單選項都放在同一個群組內了，接著我們要讓這個選單選項的容器來儘可能在垂直方向伸展，佔掉所有可用的空間。選擇 ``MenuOptions`` 節點，並在屬性面板中往下滾動找到 **Size Flags** 分類。點擊 **Vertical** 屬性右邊的欄位並勾選 **Fill** 與 **Expand** 。接著容器應該會佔滿縱向所有可用的空間，但同時不會去擠壓到同級節點的 ``Logo`` 與 ``Version`` 元素。

source: To center the nodes in the ``VBoxContainer``, scroll to the top of the Inspector and change the **Alignment** property to **Center**.
cs: Abychom vycentrovaly uzly v ''VBoxContainer'', přejděte na začátek Inspektoru a změňte vlastnost **Alignment** na **Center**.
de: Um die Nodes im ``VBoxContainer`` zu zentrieren, gehe ganz nach oben im Inspektor und stelle die Eigenschaft ``Alignment`` auf ``Center``.
ja: ノードを ``VBoxContainer`` の中央に配置するには、インスペクタの一番上までスクロールし、 **Alignment** プロパティを **Center** に変更します。
ko: ``VBoxContainer`` 안의 노드들을 중앙에 배치하려면 인스펙터(Inspector) 위쪽으로 스크롤해서 **Alignment** 속성을 **Center**\ 로 변경하세요.
ru: Чтобы центрировать узлы в `VBoxContainer``, прокрутите до верхней части инспектора и измените свойство ``Alignment`` на ``Center``.
uk: Щоб центрувати вузли у ``VBoxContainer``, прогорніть до вершини Інспектора та змініть властивість **Alignment** (Вирівнювання) на **Center**.
zh_cn: 要使节点在 ``VBoxContainer`` 中居中，请滚动到属性检查器的顶部，然后将 ``Alignment`` 属性更改为 ``Center``。
zh_tw: 要將 ``VBoxContainer`` 容器中的節點置中，在屬性面板內滾動到最上面，並將 **Alignment** （對齊）屬性設為 **Center** （中央）。

source: The menu options should center vertically in the UI's left column.
cs: Možnosti nabídky by se měly vertikálně vycentrovat v levém sloupci uživatelského rozhraní.
de: Die Menüpunkte sollten sich in der linken Spalte der Oberfläche gleichzeitig senkrecht und mittig ausrichten.
ja: メニューオプションは、UIの左カラムの縦方向の中央に配置する必要があります。
ko: 메뉴 옵션들은 UI의 왼쪽 열에서 수직으로 중앙에 있어야 합니다.
ru: Пункты меню должны быть выровнены по центру по вертикали в левом столбце пользовательского интерфейса.
uk: Параметри меню повинні розташовуватися по центрі вертикалі в лівій колонці інтерфейсу користувача.
zh_cn: 菜单选项应在UI的左边的列式布局中垂直居中。
zh_tw: 現在 UI 左側的選單選項應該垂直置中了。

source: To wrap things up, let's add some separation between the menu options. Expand the **Custom Constants** category below **Size Flags**, and click the field next to the **Separation** parameter. Set it to 30. Once you press enter, the **Separation** property becomes active and Godot adds 30 pixels between menu options.
cs: Abychom to dokončili, přidejme určitý prostor mezi možnosti nabídky. Rozbalte kategorii **Custom constants** pod **Size Flags** a klikněte na pole vedle parametru **Separation**. Nastavte jej na 30. Jakmile stisknete klávesu Enter, vlastnost **Separation** se aktivuje a Godot přidá mezi možnosti nabídky 30 pixelů.
de: Zum Abschluss fügen wir Abstandshalter zwischen den Menüpunkten hinzu. Klappen Sie die Kategorie ``Custom Constants`` unter ``Size Flags`` auf und klicken auf das Feld neben dem Parameter ``Separation``. Setzen Sie es auf 30. Sobald Sie Eingabe drücken, wird die Eigenschaft ``Separation`` wirksam und Godot fügt 30 Pixel zwischen den Menüpunkten ein.
ja: 最後に、メニューオプションの間に区切りを追加します。 **Size Flags** の下の **Custom Constants** カテゴリを展開し、 **Separation** パラメータの横のフィールドをクリックして、値を30に設定します。Enterキーを押すと、 **Separation** プロパティがアクティブになり、Godotはメニューオプションの間に30ピクセルを追加します。
ko: 마무리를 위해 메뉴 옵션 사이에 약간의 분리 영역을 추가해 보겠습니다. **Size Flags** 아래의 **Custom Constants** 카테고리를 확장하고 **Separation** 매개변수 옆의 영역을 클릭하세요. 값을 30으로 설정하세요. 엔터를 누르면 **Separation** 속성이 활성화되고 Godot가 메뉴 옵션들 사이에 30픽셀씩 추가합니다.
ru: Наконец, давайте добавим некоторое разделение между параметрами меню. Разверните категорию **Custom Constants** которая ниже **Size Flags** и щелкните на поле рядом с параметром **Separation**. Установите его на 30. После нажатия клавиши Enter, свойство **Separation** становится активным и Godot добавляет 30 пикселей между MenuOptions.
uk: На завершення додамо відступи між параметрами меню. Розкрийте категорію **Custom Constants** під **Size Flags** та натисніть поле поруч із параметром **Separation**. Встановіть його на 30. Після натискання клавіші Enter, властивість розділення стане активною, і Godot додасть 30 пікселів між параметрами меню.
zh_cn: 为了把东西都包裹起来，让我们在菜单选项之间添加一些分隔。展开 ``大小标记（Size Flags）`` 下面的 ``自定义常量（Custom Constants）`` 类别，然后点击 ``分隔（Separation）`` 参数旁边的字段。设置为30。一旦您按下回车键，``分隔（Separation）`` 属性就会激活，Godot会在菜单选项之间增加30个像素。
zh_tw: 最後，讓我們來在選單項目中間加點空白。展開 **Size Flags** 底下的 **Custom Constants** 分類，接著點擊 **Separation** （分隔）參數旁邊的欄位並設為 30。按下 Enter 之後， **Separation** 屬性變會變為有效狀態，而 Godot 會自動在選單項目間加上 30px 的空白。

source: The final interface.
cs: Finální rozhraní.
de: Die fertige Oberfläche.
ja: 完成したインターフェイス。
ko: 최종 인터페이스.
ru: Финальный интерфейс.
uk: Кінцевий інтерфейс.
zh_cn: 最终界面。
zh_tw: 最終界面。

source: Without a single line of code, we have a precise and responsive main menu.
cs: Bez jediného řádku kódu máme do puntíku přesné a zároveň responzivní hlavní menu.
de: Ohne eine einzige Zeile Code zu schreiben, haben wir ein ordentliches und dynamisches Menü.
es: Sin una sola línea de código, tenemos un menú principal preciso y responsivo.
fr: Sans la moindre ligne de code, nous avons un menu principal s'adaptant précisément aux dimensions de l'écran.
ja: 一行のコードも書かずに、正確で応答性の高いメインメニューができました。
ko: 코드 한 줄도 안 쓰고, 우리는 정확하고 반응성 있는 메인 메뉴를 만들었습니다.
pt_br: Sem uma única linha de código, temos um menu principal preciso e responsívo.
ru: Без единой строки кода у нас есть точное и отзывчивое главное меню.
uk: Без єдиного рядка коду ми маємо точне та чутливе головне меню.
zh_cn: 没有一行代码，我们就有了一个精确且响应迅速的主菜单。
zh_tw: 連一行程式碼都不用寫，我們就做好了精準排放的回應式主選單。

source: Congratulations for getting there! You can download the final menu :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` to compare with your own. In the next tutorial, you'll create a Game User Interface with bars and item counters.
cs: Gratulujeme, že jste se dostali až sem! Můžete si stáhnout finální menu :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` k porovnání s vlastní verzí. V dalším tutoriálu vytvoříte uživatelské rozhraní hry s ukazately a čítači položek.
de: Glückwunsch, dass Sie es so weit geschafft haben! Sie können das fertige Menü herunterladen und mit Ihrem vergleichen: :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>`. In der nächsten Anleitung werden Sie eine Spieleoberfläche mit Leisten und Gegenstandszählern erstellen.
fr: Félicitations d'être arrivé jusqu'ici ! Vous pouvez télécharger le menu final :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` pour le comparer avec le vôtre. Dans le prochain tutoriel, vous créerez une interface utilisateur de jeu avec des barres et des compteurs d'objets.
ja: おめでとうございます！ 自分で作ったメニューとの比較用に、完成済みメニュー\ :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>`\ をダウンロードできます。次のチュートリアルでは、バーとアイテムカウンターを含むゲームユーザーインターフェイスを作成します。
ko: 여기까지 오신 것을 축하합니다! 최종 메뉴 :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>`\ 을 다운로드해서 여러분의 것과 비교할 수 있습니다. 다음 튜토리얼에서는 바와 아이템 카운터가 있는 게임 사용자 인터페이스를 만들 것입니다.
ru: Поздравляем с завершением! Вы можете скачать `final menu <#>`__, чтобы сравнить с вашим собственным. В следующем курсе уроков вы создадите UI игры с шкалами и инвентарем.
uk: Вітаємо з завершенням! Ви можете завантажити остаточний результат :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>`, щоб порівняти зі своїм власним. У наступному уроці ви створите Ігровий інтерфейс користувача з шкалами та лічильниками предметів.
zh_cn: 恭喜你到达！您可以下载最终菜单 :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` 以与您自己的进行比较。在下一个教程中，您将创建一个带有条形和项目计数器的游戏用户界面。
zh_tw: 恭喜完成！你可以下載最後的成品 :download:`ui_main_menu_design.zip <files/ui_main_menu_design.zip>` 並與你自己完成的結果比較一下。下一個教學我們會接著製作有血槽與道具計數器的遊戲的界面。

source: A responsive User Interface is all about making sure our UIs scale well on all screen types. TV screens and computer displays have different sizes and ratios. In Godot, we use containers to control the position and the size of UI elements.
cs: Responzivní uživatelské rozhraní je o tom, že se naše uživatelská rozhraní budou dobře škálovat na všech typech obrazovky. Televizní obrazovky a počítačové displeje mají různé velikosti a poměry stran. V Godotu používáme kontejnery k ovládání polohy a velikosti prvků uživatelského rozhraní.
de: Bei einer responsiven Benutzeroberfläche ist es wichtig dafür zu sorgen, dass die UI auf allen Bildschirmarten vernünftig skaliert wird. Fernsehbildschirme und Monitore haben unterschiedliche Größen und Seitenverhältnisse. In Godot benutzen wir Container, um die Position und Größe der UI-Elemente zu steuern.
fr: Une interface utilisateur dite "Responsive" fait en sorte de s'adapter correctement à tous les types d'écrans. Une télévision et un moniteur d'ordinateur possède des ratios et des tailles différentes. Dans Godot, nous utilisons des conteneurs pour contrôler la position et la taille des éléments constituants notre interface.
ja: レスポンシブなユーザーインターフェイスとは、すべての画面タイプで適切にスケーリングされるように作られたUIです。テレビ画面とコンピューターのディスプレイは、サイズと比率が異なります。 Godotでは、コンテナを使用してUI要素の位置とサイズを制御します。
ko: 반응형 사용자 인터페이스는 모든 화면 유형에서 UI가 잘 확장되도록 만드는 것을 의미합니다. TV 화면과 컴퓨터 디스플레이는 크기와 비율이 다릅니다. Godot에서는 컨테이너를 사용하여 UI 요소의 위치와 크기를 제어합니다.
ru: Гибкий пользовательский интерфейс - это способ сделать так, чтобы наши UI элементы менялись в зависимости от разных экранов. Экраны TV и компьютерных дисплеев имеют различные размеры и соотношения. В Godot мы используем контейнеры для управления позицией и размера элемента UI.
uk: Чутливий користувацький інтерфейс означає, що наші інтерфейси масштабуються під всі типи екранів. Екрани телевізорів та екрани комп'ютера мають різні розміри та співвідношення. У Godot ми використовуємо контейнери для контролю положення та розміру елементів інтерфейсу.
zh_cn: 响应式用户界面就是要确保我们的UI在所有屏幕类型上都能很好地缩放。电视屏幕和计算机显示器具有不同的大小和比例。在Godot中，我们使用容器来控制UI元素的位置和大小。
zh_tw: 製作回應式使用者界面的重點就在於確保 UI 能在各種螢幕類型間正確縮放。電影螢幕與電腦的顯示器有不同的大小與長寬比。在 Godot 中，我們使用 Container 來控制 UI 元素的位置與大小。
