Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: In the script settings window, you can leave the default settings alone. Just click "Create":
cs: V okně nastavení skriptu můžete ponechat výchozí nastavení. Stačí kliknout na „Vytvořit“:
de: Im Fenster mit den Skripteinstellungen können Sie die Standardeinstellungen beibehalten. Klicken Sie einfach auf "Erstellen":
es: En la ventana de configuración del script, puedes dejar los ajustes por defecto. Simplemente haz clic en "Crear":
fr: Dans la fenêtre de réglages du script, vous pouvez laisser les paramètres par défaut. Cliquez simplement sur "Créer" :
it: Nella finestra di impostazioni dello script, puoi lasciare le impostazioni di default. Clicca "Crea":
ja: スクリプト設定ウィンドウ内の設定はそのままで構いません。「作成」をクリックしてください:
ko: 스크립트 설정 창은 기본 설정으로 냅두어도 됩니다. 그냥 "만들기(Create)"를 누르세요:
pl: W oknie ustawień skryptu możesz pozostawić ustawienia domyślne. Kliknij na "Utwórz":
pt_br: Na janela de configurações de roteiro, você pode deixar as configurações padrões do jeito que estão. Apenas clique em "Criar":
ru: В окне настроек скрипта вы можете оставить все настройки по умолчанию. Просто нажмите "Создать":
uk: У вікні налаштувань скрипту ви можете залишити налаштування за замовчуванням. Просто натисніть "Створити":
zh_cn: 在脚本设置窗口中，您可以保留默认设置。只要点击 ``创建`` 就好：
zh_tw: 腳本設定視窗內的設定可以保持預設值。直接點擊 [建立] 就好：

source: If you're creating a C# script or other languages, select the language from the `language` drop down menu before hitting create.
cs: Pokud vytváříte skript v C# nebo v jiném jazyku, vyberte požadovaný jazyk z rozbalovací nabídky `jazyk` před tím, než kliknete vytvořit.
de: Wenn Sie ein C#-Skript oder andere Sprachen verwenden wollen, wählen Sie die Sprache aus dem Auswahlmenü "Sprache", bevor Sie auf Erstellen klicken.
es: Si quieres crear un script C# u otro lenguaje, selecciona el lenguaje en el menú desplegable "Lenguaje " antes de pulsar crear.
fr: Si vous créez un script en C# ou un autre langage, sélectionnez le language dans le menu déroulant `langage` avant de cliquer sur créer.
it: Se stai creando uno script C# o in altri linguaggi, scegli il linguaggio dal menu a tendina `linguaggio` prima di cliccare crea.
ja: C#スクリプトまたはその他の言語を作成する場合は、作成を実行する前に [言語] ドロップダウン メニューから言語を選択します。
ko: C#이나 다른 언어로 스크립트를 만들려면 만들기를 누르기 전에 `언어(language)` 드롭 다운 메뉴에서 언어를 선택하세요.
pl: Jeśli tworzysz skrypt C# lub w innych językach, wybierz język z menu rozwijanego `Język` przed naciśnięciem przycisku Utwórz.
pt_br: Se você estiver criando um script em C# ou em outras linguagens, selecione a linguagem em no menu suspenso `Idioma` antes de clicar em Criar.
ru: Если вы создаете скрипт на C# или другом языке, то перед созданием выберете этот язык в выпадающем меню `Язык`.
uk: Якщо ви створюєте скрипт на C# , або іншій мові, виберіть мову зі спадного меню `Мова`, перед тим, як створити скрипт.
zh_cn: 如果您要创建一个C#脚本或者其他语言的脚本，那就在创建之前在 `语言` 下拉菜单中选择语言。
zh_tw: 如果要建立 C# 腳本或其他語言的腳本，在點擊建立前記得在 [語言] 下拉選單內選擇語言。

source: If this is your first time encountering GDScript, please read :ref:`doc_scripting` before continuing.
cs: Pokud se poprvé setkáváte s GDScriptem, přečtěte si prosím :ref:`doc_scripting`, než budete pokračovat.
es: Si esta es la primera vez que te enfrentas con GDScript, por favor, lee :ref:`doc_scripting` antes de continuar.
ja: GDScriptに初めて触れる場合は、続行する前に\ :ref:`doc_scripting`\ をお読みください。
pl: Jeśli po raz pierwszy spotykasz się z GDScriptem, przeczytaj :ref:`doc_scripting` zanim przejdziesz dalej.
pt_br: Se esta é sua primeira vez se deparando com a GDScript, por favor leia :ref:`doc_scripting` antes de continuar.
ru: Если вы первый раз столкнулись с GDScript, то, прежде чем продолжить, пожалуйста прочитайте :ref:`doc_scripting`.
uk: Якщо ви вперше стикаєтесь з GDScript, прочитайте :ref:`doc_scripting`, перш ніж продовжувати.
zh_cn: 如果这是您第一次使用GDScript，请在继续之前阅读 :ref:`doc_scripting`。
zh_tw: 若是第一次接觸 GDScript，建議在繼續前先閱讀 :ref:`doc_scripting` 。

source: Start by declaring the member variables this object will need:
cs: Začněte deklarováním členských proměnných, které bude tento objekt potřebovat:
de: Beginnen Sie, indem Sie die Member-Variablen deklarieren, die dieses Objekt benötigt:
es: Comienza declarando las variables miembro que este objeto necesitará:
fr: Commencez par déclarer les variables membres dont cet objet aura besoin :
it: Inizia dichiarando le variabili membro che questo oggetto avrà bisogno:
ja: まず、このオブジェクトに必要なメンバー変数を宣言します:
ko: 이 오브젝트가 필요로 하는 멤버 변수를 선언함으로써 시작합시다:
pl: Zacznij od zadeklarowania zmiennych, których ten obiekt będzie potrzebował:
pt_br: Comece declarando as variáveis membro que este objeto irá precisar:
ru: Начните с объявления переменных - членов, которые понадобятся этому объекту:
uk: Почніть з оголошення змінних-членів, які будуть потрібні цьому об'єкту:
zh_cn: 首先声明该对象将需要的成员变量：
zh_tw: 首先我們先宣告這個物件所需要的成員變數：

source: Using the ``export`` keyword on the first variable ``speed`` allows us to set its value in the Inspector. This can be handy for values that you want to be able to adjust just like a node's built-in properties. Click on the ``Player`` node and you'll see the property now appears in the "Script Variables" section of the Inspector. Remember, if you change the value here, it will override the value written in the script.
cs: Pomocí klíčového slova „export“ pro první proměnnou „speed“ nám umožní nastavit její hodnotu v Inspektoru. To může být šikovné pro hodnoty, které chcete upravovat stejně jako vlastnosti věstavěných uzlu. Klikněte na uzel ``Player`` a uvidíte vlastnost, která se nyní bude objevovat v inspektoru v sekci "Proměnné skriptu". Pamatujte, že pokud zde změníte hodnotu, přepíšete tak hodnotu zapsanou ve skriptu.
de: Wenn Sie das Schlüsselwort ``export`` für die erste Variable ``speed`` verwenden, ermöglicht es Ihnen dessen Wert im Inspektor einzustellen. Dies kann für Werte nützlich sein, die Sie wie die integrierten Eigenschaften eines Nodes anpassen möchten. Klicken Sie auf den Node ``Player``, und die Eigenschaft wird jetzt im Bereich "Script Variables" des Inspektors angezeigt. Denken Sie daran, wenn Sie den Wert hier ändern, wird der im Skript verwendete Wert überschrieben.
es: Utilizar la palabra clave ``export`` en la primera variable ``speed`` nos permite asignar su valor desde el Inspector. Esto puede ser útil para valores que quieres ajustar como ajustas las propiedades de los nodos comunes. Haz clic en el nodo ``Player`` y verás que en la sección "Script Variables" del Inspector aparece la nueva propiedad. Recuerda que si cambias el valor aquí, sobrescribirá el valor asignado en el script al ejecutar el juego.
fr: L'utilisation du mot-clé ``export`` sur la première variable ``SPEED`` nous permet de définir sa valeur dans l'inspecteur. Cela peut être pratique pour les valeurs que vous voulez pouvoir ajuster de la même manière que les propriétés intégrées d'un nœud. Cliquez sur le nœud ``Player`` et vous verrez maintenant apparaître la section "Script Variables" dans l'inspecteur. Notez que, si vous changez la valeur ici, cela remplacera la valeur écrite dans le script.
it: Usando la parola chiave ``export`` sulla prima variabile ``speed`` ci permette di impostare il suo valore dall'Ispettore. Questo può essere utile per valori che vorresti poter modificare come le proprietà dei nodi. Clicca sul nodo ``Player`` e vedrai che la proprietà è ora apparsa nella sezione "Variabili di Script" dell'ispettore. Ricorda, se cambi il valore qui, si sovrascriverà al valore scritto nello script.
ja: 最初の変数 ``speed`` で ``export`` キーワードを使用すると、インスペクタでその値を設定できるようになります。これは、値をノードの組み込みプロパティのように調整できるようにする場合に便利です。 ``Player`` ノードをクリックすると、インスペクタの "Script Variables" セクションにプロパティが表示されます。ここで値を変更すると、スクリプトに記述された値が上書きされることに注意してください。
ko: 첫 번째 변수인 ``speed``\ 에 ``export`` 키워드를 사용하면 인스펙터(Inspector) 내에서 값을 설정할 수 있습니다. 인스펙터(Inspector)에서도 원하는 값으로 조정할 수 있어서 편리합니다. ``Player`` 노드를 선택하면 인스펙터(Inspector)의 "Script Variables" 섹션에 나타납니다. 여기서 값을 바꾸면 스크립트에 작성한 값을 오버라이드한다는 점을 기억하세요.
pt_br: Usar a palavra-chave ``export`` na primeira variável, ``speed``, nos permite definir seu valor pelo Inspetor. Isto pode ser útil para os valores que você deseja ser capaz de ajustar do mesmo jeito que se faz com as propriedades internas de um nó. Clique no nó ``Jogador`` e você verá que a propriedade agora aparece na seção "Variáveis de Script" do Inspetor. Lembre-se, se você modificar o valor aqui, ele irá sobrepor o valor que está definido no script.
ru: Использование ключевого слова ``export`` у первой переменной ``speed`` позволяет устанавливать ее значение в Инспекторе. Это может быть полезно, если вы хотите изменять значения точно так же как и встроенные свойства узла. Щелкните на узел ``Player`` и вы увидите, что свойство появилось в разделе "Script Variables" в Инспекторе. Помните, что если изменить значение здесь, то оно перезапишет значение, установленное в скрипте.
uk: Використання ключового слова ``export`` на першій змінній ``speed`` (швидкість) дозволяє нам встановлювати її значення в Інспекторі. Це може бути зручно для значень, які ви хочете мати можливість регулювати так само, як і вбудовані властивості вузла. Натисніть на вузол ``Player``, і ви побачите властивість, яка появилася в розділі інспектора "Script Variables" ("Змінні скриптів"). Пам'ятайте, що якщо ви зміните тут значення, воно перепише значення, записане в скрипті.
zh_cn: 在第一个变量 ``speed`` 上使用 ``export`` 关键字，这样允许在属性检查器中设置其值。对于希望能够像节点的内置属性一样进行调整的值，这可能很方便。点击 ``Player`` 节点，您将看到该属性现在显示在属性检查器的“脚本变量”部分中。请记住，如果您在此处更改值，它将覆盖脚本中已写入的值。
zh_tw: 在第一個變數 ``speed`` 上使用 ``export`` 關鍵字可以讓我們稍後在屬性面板中指定 speed 的值。當希望讓成員變數與節點內建屬性一樣可以在屬性面板中調整的話，就可以用這個功能。點擊 ``Player`` 節點，就可以在 [Script Variables] (腳本變數) 內看到這個屬性。但請記得，如果在屬性面板中修改了數值，會覆蓋掉腳本內所指定的值。

source: If you're using C#, you need to (re)build the project assemblies whenever you want to see new export variables or signals. This build can be manually triggered by clicking the word "Mono" at the bottom of the editor window to reveal the Mono Panel, then clicking the "Build Project" button.
cs: Pokud používáte C#, musíte (znovu) sestavit projekt, kdykoli chcete vidět nově exportované proměnné nebo signály. Toto sestavení lze spustit ručně kliknutím na slovo „Mono“ v dolní části okna editoru, čímž se odhalí panel Mono, a poté kliknutím na tlačítko „Build Project“.
de: Wenn Sie C# verwenden, müssen Sie die Projekt-Bausteine neu übersetzen, um neue Exportvariablen oder Signale sichtbar zu machen. Das kann manuell durch einen Klick auf das Wort "Mono" im unteren Fensterbereich geschehen, es wird das Mono-Panel eingeblendet und ein anschließender Klick auf "Build Project" führt die Aktion aus.
es: Si estás usando C#, necesitas (re)construir los archivos assembly del proyecto cada vez que quieras tener visibles las variables exportadas o las señales. Esta construcción puede ser lanzada manualmente pulsando en la palabra "Mono" en la parte inferior de la ventana de edición para revelar el Panel Mono, y luego haciendo clic en el botón "Construir Proyecto".
fr: Si vous utilisez C#, vous devez (re)compiler les assemblages du projet chaque fois que vous voulez voir de nouvelles variables d'exportation ou des nouveaux signaux. Cette compilation peut être déclenchée manuellement en cliquant sur le mot "Mono" au bas de la fenêtre de l'éditeur pour afficher le panneau Mono, puis en cliquant sur le bouton "Compiler Projet".
it: Se stai usando C#, devi (ri)costruire l'assemblaggio del progetto ogni volta che vuoi vedere le nuove variabili esportate o i segnali. Questa costruzione può essere attivata facendo click sulla parola "Mono" in basso, nella finestra dell' editor, per rivelare il panello Mono, quindi fare click sul pulsante "Build Project".
ja: C#を使用している場合、新しいエクスポート変数またはシグナルを表示する場合は、プロジェクトアセンブリを(再)ビルドする必要があります。このビルドは、エディタウィンドウの下部にある「Mono」をクリックしてMonoパネルを表示し、「Build Project」ボタンをクリックして手動でトリガーできます。
ko: 여러분이 C#을 사용한다면, 새로운 외부변수(export variables)나 시그널을 보기 위해서 프로젝트 구성물(assemblies)을 다시 빌드할 필요가 있습니다. 이 컴파일은 에디터 밑의 "Mono" 단어를 클릭해 Mono 패널이 나타나게 한 후 "프로젝트 빌드(Build Project)" 버튼을 눌러서 수동으로 진행됩니다.
pt_br: Se você estiver usando o C #, precisará (re) construir os assemblies do projeto sempre que desejar ver novas variáveis ou sinais de exportação. Essa construção pode ser acionada manualmente clicando na palavra "Mono" na parte inferior da janela do editor para revelar o Mono Panel e, em seguida, clicando no botão "Build Project".
ru: Если вы используете C#, вам нужно (пере)собирать сборки проекта всякий раз, когда вы хотите увидеть новые экспортируемые переменные или сигналы. Эта сборка может быть запущена вручную путем нажатия на слово "Mono" в нижней части окна редактора, чтобы открыть Mono Panel, а затем на кнопку "Build Project".
uk: Якщо ви використовуєте C#, вам потрібно (пере)будувати збірки проєктів, коли ви хочете бачити нові змінні експорту, чи сигнали. Цю збірку можна вручну запустити, натиснувши слово "Mono" внизу вікна редактора, щоб відкрити панель Mono, а потім натиснути кнопку "Build Project".
zh_cn: 如果使用的是C#，则每当要查看新的导出变量或信号时，都需要（重新）构建项目程序集。点击编辑器窗口底部的“ Mono”一词以显示Mono面板，然后单击“ 构建项目”按钮，即可手动触发此构建。
zh_tw: 使用 C# 時，若要看到新匯出的變數或訊號，就需要建置或重新建置專案。要重新建置專案可以手動點擊編輯器視窗底部的 [Mono] 文字來打開 Mono 面板，然後點擊 [建置專案] 按鈕。

source: The ``_ready()`` function is called when a node enters the scene tree, which is a good time to find the size of the game window:
cs: Funkce ``_ready ()`` se volá, když uzel vstoupuje do stromu scény, a to je dobrý čas k nalezení velikosti okna hry:
de: Die Funktion ``_ready()`` wird aufgerufen, wenn ein Node in den Szenenbaum eintritt, was ein guter Zeitpunkt ist, um die Größe des Spielfensters zu ermitteln:
es: La función ``_ready()`` se llama cuando un nodo entra en la escena, este es un buen momento para averiguar el tamaño de la ventana de juego:
fr: La fonction ``_ready()`` est appelée lorsqu'un nœud entre dans l'arbre de scène, ce qui est un bon moment pour trouver la taille de la fenêtre de jeu :
it: La funzione ``_ready()`` viene chiamata quando un nodo entra nello scene tree, è un momento ideale per andare a ricavare le dimensioni della finestra di gioco:
ja: ``_ready()`` 関数は、ノードがシーンツリーに入ると呼び出されます。これは、ゲームウィンドウのサイズを調べる良いタイミングです:
ko: ``_ready()`` 함수는 노드가 씬 트리에 들어올 때 호출되는데, 이 때가 게임 창의 크기를 알아보기 좋은 순간입니다:
pl: Funkcja ``_ready()`` jest wywoływana, gdy węzeł wchodzi do drzewa sceny, co jest dobrym momentem, aby ustalić rozmiar okna gry:
pt_br: A função ``_ready()`` é chamada quando um nó entra na árvore de cena, que é uma boa hora para descobrir o tamanho da janela do jogo:
ru: Функция ``_ready ()`` вызывается, когда узел входит в дерево сцены, что является хорошим моментом для определения размера игрового окна:
uk: Функція ``_ready()`` викликається , коли вузол входить в дерево сцени, чудовий момент , щоб задати розмір вікна гри:
zh_cn: 当节点进入场景树时，``_ready()`` 函数被调用，这是查找游戏窗口大小的好时机：
zh_tw: ``_ready()`` 函式是當節點進入場景樹後會呼叫的函式，這裡正是取得遊戲視窗大小的好時機：

source: Now we can use the ``_process()`` function to define what the player will do. ``_process()`` is called every frame, so we'll use it to update elements of our game, which we expect will change often. For the player, we need to do the following:
cs: Nyní můžeme pomocí funkce ``_process ()`` definovat, co bude hráč dělat. ``_process ()`` se volá v každém framu(snímku) takže tuto funkci použijeme k aktualizaci takových prvků naší hry, které se často změní. Pro hráče musíme udělat následující:
de: Jetzt können wir die Funktion ``_process()`` verwenden, um festzulegen, was der Spieler tun soll. ``_process()`` wird mit jedem Frame aufgerufen, deshalb werden wir es verwenden, um Elemente unseres Spiels zu aktualisieren, von denen wir erwarten, dass sie sich häufig ändern werden. Für den Spieler müssen wir Folgendes tun:
es: Ahora podemos utilizar la función ``_process()`` para definir lo que hará el jugador. ``_process()`` se llama en cada frame, así que la usaremos para actualizar elementos del juego que esperamos que cambien a menudo. Para el jugador haremos lo siguiente:
fr: Maintenant nous pouvons utiliser la fonction ``_process()`` pour définir ce que le joueur va faire. ``_process()`` est appelée à chaque image, nous l'utiliserons donc pour mettre à jour les éléments de notre jeu qui vont changer souvent. Pour le joueur, nous devons faire ce qui suit :
it: Ora possiamo usare la funzione ``_process()`` per definire cosa farà il player. La funzione ``_process()`` viene chiamata ad ogni frame, quindi la useremo per aggiornare gli elementi del nostro gioco che ci aspettiamo che cambino spesso. Per il player dobbiamo fare il seguente:
ja: これで ``_process()`` 関数を使用して、プレイヤーが何をするかを定義できます。 ``_process()`` はフレームごとに呼び出されるため、これを使用してゲームの要素を更新しますが、これは頻繁に変更されることが予想されます。プレイヤーの場合、次のことを行う必要があります:
ko: 이제 ``_process()`` 함수를 사용해서 플레이어가 무엇을 할 지 정의할 수 있습니다. ``_process()``\ 는 매 프레임마다 호출되므로, 게임에서 자주 변하는 요소들을 업데이트하기 위해서 사용할 수 있습니다. 플레이어에게는, 다음과 같은 작업이 필요합니다:
pt_br: Agora podemos usar a função ``_process()`` para definir o que o jogador fará. ``_process()`` é chamada a cada quadro, então usaremos isso para atualizar os elementos de nosso jogo que esperamos que mudem frequentemente. Para o jogador, precisamos fazer o seguinte:
ru: Теперь мы можем использовать функцию ``_process()`` для определения того, что игрок будет делать. ``_process()`` вызывается каждый кадр, поэтому мы будем использовать ее для обновления состояния тех элементов нашей игры, которые будут часто изменяться. Для игрока, сделаем следующее:
uk: Тепер ми можемо використовувати функцію ``_process()``, щоб визначити, що робитиме гравець. ``_process()`` викликається кожен кадр, тому ми будемо використовувати її для оновлення тих елементів нашої гри, які будуть часто змінюватися. Для гравця нам потрібно зробити наступне:
zh_cn: 现在我们可以使用 ``_process()`` 函数定义 ``Player`` 将执行的操作。``_process()`` 在每一帧都被调用，因此我们将使用它，来更新我们希望会经常变化的游戏元素。对于 ``Player`` ，我们需要执行以下操作：
zh_tw: 接著我們可以使用 ``_process()`` 函式來定義玩家要做的事。 ``_process()`` 在每一幀都會被呼叫，所以我們會用 _process() 來更新遊戲內需要常常變化的元素。而對於 Player，我們需要做這些事：

source: Check for input.
cs: Zkontrolovat vstup.
de: Auf Eingabe prüfen.
es: Comprobar entradas.
fr: Vérifier les entrées.
it: Controlla per input.
ja: 入力をチェックします。
ko: 입력을 확인.
pl: Sprawdza dane wejściowe.
pt_br: Verificação de entradas.
ru: Проверка ввода.
uk: Перевірити ввід.
zh_cn: 检查输入。
zh_tw: 檢查輸入。

source: Move in the given direction.
cs: Pohnout se v požadovaném směru.
de: In die angegebene Richtung bewegen.
es: Moverse en la dirección dada.
fr: Se déplacer dans la direction donnée.
it: Muovi nella direzione assegnata.
ja: 指定した方向に移動します。
ko: 주어진 방향으로 이동.
pl: Przesuwa się w określonym kierunku.
pt_br: Movimentação em uma certa direção.
ru: Перемещение в заданном направлении.
uk: Рухати в заданому напрямі.
zh_cn: 沿给定方向移动。
zh_tw: 沿指定方向移動。

source: Play the appropriate animation.
cs: Přehrát příslušnou animaci.
de: Die entsprechende Animation abspielen.
es: Reproducir la animación apropiada.
fr: Jouer l'animation appropriée.
it: Esegui l'animazione appropriata.
ja: 適切なアニメーションを再生します。
ko: 적절한 애니메이션을 재생.
pl: Odtwarza odpowiednią animację.
pt_br: Reprodução da animação apropriada.
ru: Воспроизведение соответствующей анимации.
uk: Відтворити відповідну анімацію.
zh_cn: 播放适当的动画。
zh_tw: 播放適當的動畫。

source: First, we need to check for input - is the player pressing a key? For this game, we have 4 direction inputs to check. Input actions are defined in the Project Settings under "Input Map". Here, you can define custom events and assign different keys, mouse events, or other inputs to them. For this demo, we will use the default events that are assigned to the arrow keys on the keyboard.
cs: Nejprve musíme zkontrolovat vstup - tiskne hráč klávesu? Pro tuto hru máme k dispozici 4 vstupy pro směr. Vstupní akce jsou definovány v Nastavení projektu v části „Mapa vstupů“. Zde můžete definovat vlastní události a přiřadit jim různé klávesy, události myši nebo jiné vstupy. Pro toto demo použijeme výchozí události, které jsou přiřazeny kurzorovým klávesám klávesnice.
de: Zuerst müssen wir auf Eingaben prüfen - drückt der Spieler eine Taste? Für dieses Spiel haben wir 4 Richtungseingaben zu überprüfen. Eingabeaktionen werden in den Projekteinstellungen unter "Eingabe-Zuordnung" definiert. Sie können benutzerdefinierte Ereignisse definieren und ihnen verschiedene Tasten, Mausereignisse oder andere Eingaben zuweisen. Für diese Demo werden wir die Standardereignisse verwenden, die den Pfeiltasten auf der Tastatur zugeordnet sind.
es: Primero, necesitamos comprobar entradas - ¿está el jugador presionando una tecla? Para este juego, tenemos 4 entradas de dirección para comprobar. Las acciones de entrada (Input actions) se definen en Configuración del Proyecto, dentro de la pestaña Mapa de Entrada. Puedes definir eventos personalizados y asignarlos a diferentes claves, eventos del ratón u otras entradas. Para esta demo, usaremos los eventos por defecto que se asignan a las flechas del teclado.
fr: Tout d'abord, nous devons vérifier les entrées - le joueur appuie-t-il sur une touche ? Pour ce jeu, nous avons 4 entrées de direction à vérifier. Les actions d'entrées sont définies dans les Paramètres du projet sous "Contrôles". Vous pouvez définir des événements personnalisés et leur affecter des touches, des événements souris ou d'autres entrées. Pour cette démo, nous utiliserons les événements par défaut qui sont assignés aux touches fléchées du clavier.
it: Prima di tutto, dobbiamo controllare per l'input - il giocatore sta premendo un pulsante? Per questo gioco abbiamo 4 direzioni di input da controllare. Le Azioni di Input sono definite nelle Impostazioni di Progetto sotto "Mappa Input". Qui puoi definire degli eventi personalizzati ed assegnargli pulsanti differenti, eventi del mouse, o altri tipi di input. Per questa demo useremo gli eventi default che sono assegnati alle frecce direzionali della tastiera.
ja: まず、入力をチェックする必要があります - プレイヤーはキーを押していますか？このゲームでは、4方向の入力チェックがあります。入力アクションは、プロジェクト設定の「インプットマップ」で定義されます。ここで、カスタムイベントを定義し、異なるキー、マウスイベント、またはその他の入力を割り当てることができます。このデモでは、キーボードの矢印キーに割り当てられているデフォルトのイベントを使用します。
ko: 먼저, 입력을 확인해야 합니다 - 플레이어가 키를 누르는 중일까요? 이 게임에서, 우리는 방향키 입력을 확인해야 합니다. 입력 액션은 프로젝트 설정(Project Settings)의 "입력 맵(Input Map)"에 정의되어 있습니다. 여기에서 사용자 지정 이벤트를 정의하고 여기에 다른 키, 마우스 이벤트, 혹은 다른 입력을 할당할 수도 있습니다. 이 데모에서, 우리는 키보드의 방향키가 할당된 기본 이벤트를 사용할 것입니다.
pt_br: Primeiro, precisamos verificar as entradas – o jogador está pressionando uma tecla? Para este jogo, temos 4 entradas de direção para verificar. Ações de entrada são definidas nas Configurações do Projeto na aba "Mapa de entrada". Você pode definir eventos personalizados e atribuir diferentes teclas, eventos de mouse ou outras entradas para eles. Para esta demonstração, vamos usar os eventos padrões que são atribuídos para as teclas de seta no teclado.
ru: Во-первых, нам нужно обрабатывать ввод с клавиатуры (нажимает ли игрок клавишу?). В этой игре у нас есть 4 направления движения, соответственно кнопок управляющих движением тоже будет 4. Назначить действия на определённые клавиши можно в настройках проекта в разделе "Список действий". Для данной демонстрации назначать клавиши не понадобится, потому что мы будем использовать действия назначенные по-умолчанию (стрелками на клавиатуре).
uk: Спочатку нам потрібно перевірити ввід - чи гравець натискає клавішу? Для цієї гри у нас є 4 напрямки для перевірки. Дії введення визначені в Параметрах проєкту в розділі "Карта введення". Тут ви можете визначити власні події та призначити їм різні клавіші, події миші чи інші входи. Для цієї демонстрації ми будемо використовувати події за замовчуванням, які призначені клавішам зі стрілками на клавіатурі.
zh_cn: 首先，我们需要检查输入—— ``Player`` 是否按下了键？对于这个游戏，我们有4个方向的输入要检查。输入动作在项目设置中的“输入映射”下定义。在这里，您可以定义自定义事件，并为其分配不同的键、鼠标事件、或其他输入。对于此演示项目，我们将使用分配给键盘上箭头键的默认事件。
zh_tw: 首先，我們需要檢查輸入——玩家有按按鍵嗎？在這個遊戲中，我們需要檢查四個方向的輸入。輸入操作是在專案設定中的 [輸入映射] 裡設定的。可以在輸入映射中定義自定事件，並給事件指定不同的按鍵、滑鼠事件或其他輸入。在這個示範遊戲中，我們會使用預設事件，這些事件是被分配到鍵盤上的方向鍵。
