Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: First, we get the list of animation names from the AnimatedSprite's ``frames`` property. This returns an Array containing all three animation names: ``["walk", "swim", "fly"]``.
cs: Zaprvé dostaneme seznam jmen animací z ``frames`` vlastnosti uzlu AnimatedSprite. Ta vrací pole obsahující všechny tři názvy animací: ``["walk", "swim", "fly"]``.
de: Zunächst werden wir die Liste der Animationsnamen von der Eigenschaft ``frames`` im AnimatedSprite erhalten. Diese gibt ein Array zuruück, dass alle drei Animationsnamen enthält: ``["walk", "swim", "fly"]``.
es: Primero, obtenemos la lista de nombres de animación de la propiedad ``frames`` del AnimatedSprite. Esto devuelve un Array que contiene los tres nombres de las animaciones: ``["walk", "swim", "fly"]``.
fr: Tout d'abord, nous obtenons la liste des noms d'animation à partir de la propriété ``frames`` de l'AnimatedSprite. On obtient ainsi un tableau contenant les trois noms d'animation : ``["walk", "swim", "fly"]`` pour "marche", "nage", et "vole".
it: Per prima cosa, otteniamo l'elenco dei nomi delle animazioni dalla proprietà ``frames`` di AnimatedSprite. Questo restituisce un Array contenente tutti e tre i nomi delle animazioni: ``["walk", "swim", "fly"]``.
ja: まず、アニメーション名のリストを AnimatedSprite の ``frames`` プロパティから取得します。これは3つのアニメーション名をすべて含む配列を返します: ``["walk", "swim", "fly"]`` 。
ko: 먼저 AnimatedSprite의 ``frames`` 속성에서 애니메이션 이름 목록을 가져옵니다. 이것은 ``["walk", "swim", "fly"]``\ 의 세 가지 애니메이션 이름을 모두 포함하는 배열을 반환합니다.
pt_br: Primeiro nós pegamos a lista dos nomes das animações da propriedade ``frames`` do AnimatedSprite. Que retorna um vetor contendo os nomes das três animações: ``["walk", "swim", "fly"]``.
ru: Сначала мы получаем список имён анимаций из свойства AnimatedSprite ``frames``. Это возвращает массив, содержащий все три имени анимации: ``["walk", "swim", "fly"]``.
uk: Спочатку ми отримуємо список назв анімацій з властивості AnimatedSprite ``frames``. Вона повертає массив, який містить три назви анімацій: ``["walk", "swim", "fly"]``.
zh_cn: 首先，我们从AnimatedSprite的``frames``读取所有动画的名称列表。这个属性会返回一个数组，该数组包含三个元素：``["walk", "swim", "fly"]`` 。
zh_tw: 首先，我們需要從 AnimatedSprite 的 ``frames`` 屬性中取得所有動畫的名稱。這個屬性會回傳一個陣列 (Array)，包含三個動畫的名稱： ``["walk", "swim", "fly"]`` 。

source: We then need to pick a random number between ``0`` and ``2`` to select one of these names from the list (array indices start at ``0``). ``randi() % n`` selects a random integer between ``0`` and ``n-1``.
cs: Potom musíme vybrat náhodné číslo mezi ``0`` a ``2``, abychom vybrali jedno z těchto jmen ze seznamu (indexy pole začínají ``0``). ``randi() % n`` vybere náhodné celé číslo mezi ``0`` a ``n-1``.
de: Wir werden eine zufällige Zahl zwischen ``0`` und ``2`` auswählen müssen, um einen von diesen Namen aus der Liste auswählen zu können (Arrays starten bei ``0``). ``randi() % n`` wählt eine zufällige Ganzzahl zwischen ``0`` und ``n-1`` aus.
es: Luego debemos tomar un número al azar entre ``0`` y ``2`` para seleccionar uno de los nombres en la lista (los índices de los array comienzan en ``0``). ``randi() % n`` selecciona un entero al azar entre ``0`` y ``n-1``.
fr: Nous devons ensuite choisir un nombre aléatoire entre ``0`` et ``2`` pour sélectionner l'un de ces noms dans la liste (les indices des listes commencent à ``0``). La fonction ``randi() % n`` sélectionne un nombre entier aléatoire entre ``0`` et ``n-1``.
it: Dobbiamo quindi scegliere un numero casuale tra ``0`` e ``2`` per selezionare uno di questi nomi dalla lista (gli indici degli array iniziano con ``0``). ``randi() % n`` seleziona un numero intero casuale tra ``0`` e ``n-1``.
ja: 次に、 ``0`` から ``2`` の間の乱数を選んで、リストから名前を選ぶ必要があります（配列のインデックスは ``0`` から始まります）。 ``randi() % n`` は ``0`` から ``n-1`` の間の乱数を選びます。
ko: 그런 다음 목록에서 이 이름 중 하나를 선택하려면 ``0``\ 과 ``2`` 사이의 임의의 숫자를 선택해야 합니다(배열 인덱스는 ``0``\ 에서 시작). ``randi() % n``\ 은 ``0``\ 과 ``n-1`` 사이의 임의의 정수를 선택합니다.
pt_br: Nós precisamos, então, de um número randômico entre ``0`` e ``2`` para selecionar um dos nomes da lista(os índices de um vetor começam do ``0`` ). ``randi() % n``seleciona randomicamente um inteiro entre ``0`` e ``n-1``.
ru: Дальше нам нужно выбрать случайное число между ``0`` и ``2``, чтобы выбрать имя одной из анимаций из списка (индексы массива начинаются с ``0``). Функция ``randi() % n`` выбирает случайное целое число между ``0`` и ``n-1``.
uk: Далі нам потрібно вибрати випадкове число між ``0`` та ``2``, щоб вибрати назву однієї з цих анімацій (массив індексується з ``0``). ``randi() % n`` вибирає випадкове ціле число між ``0`` та ``n-1``.
zh_cn: 然后我们需要在 ``0`` 和 ``2`` 之间选取一个随机的数字，以在列表中选择一个名称（数组索引以 ``0`` 起始）。``randi() % n`` 会在 ``0`` and ``n-1`` 之中选择一个随机整数。
zh_tw: 接著我們需要選擇 ``0`` 到 ``2`` 間的一個隨機數，用來從這個陣列中選擇名稱（陣列的索引從 ``0`` 開始）。 使用 ``randi() % n`` 可以從 ``0`` 到 ``n - 1`` 之間隨機選擇一個整數。

source: You must use ``randomize()`` if you want your sequence of "random" numbers to be different every time you run the scene. We're going to use ``randomize()`` in our ``Main`` scene, so we won't need it here.
cs: Musíte použít ``randomize()``, pokud chcete, aby se vaše sekvence "náhodných" čísel lišila pokaždé, když spustíte scénu. Budeme používat ``randomize()`` v naší ``Main`` scéně, takže to zde nebudeme potřebovat.
de: Sie müssen ``randomize()`` verwenden, wenn Sie möchten, dass Ihre Reihenfolge der "Zufallszahlen" bei jedem erneuten Ausführen der Szene unterschiedlich ist. Wir werden ``randomize()`` in unserer ``Main`` Szene verwenden, so dass wir es hier nicht brauchen. ``randi() % n`` ist der Standardweg, um eine zufällige ganze Zahl zwischen ``0`` und ``n-1`` zu erhalten.
es: Tienes que usar ``randomize()`` si quieres que la secuencia de números al "azar" sea diferente cada vez que se ejecute la escena. Usaremos ``randomize()`` en la escena ``Main``, así que no lo necesitaremos aquí.
fr: Vous devez utiliser ``randomize()`` si vous voulez que votre séquence de nombres "aléatoires" soit différente à chaque fois que vous exécutez la scène. Nous allons utiliser ``randomize()`` dans notre scène ``Main``, alors nous n'en aurons pas besoin ici.
it: È necessario utilizzare ``randomize()`` se si desidera che la sequenza di numeri "casuali" sia diversa ogni volta che si esegue la scena. Useremo ``randomize()`` nella nostra scena ``Main``, quindi non ne avremo bisogno qui.
ja: シーンを実行するたびに「ランダム」な数字のシーケンスを異なるようにするには、 ``randomize()`` を使用する必要があります。 ``Main`` シーンで ``randomize()`` を使用するので、ここでは必要はありません。
ko: 씬을 실행할 때 매 순간마다 "무작위" 숫자 배열이 다르기를 원한다면 ``randomize()``\ 를 사용해야 합니다. ``randomize()``\ 를 ``Main`` 씬에서 사용할 것이기 때문에 여기서는 필요하지 않습니다.
pt_br: Você deve usar ``randomize()`` se quiser que sua sequência de números "aleatórios" seja diferente toda vez que você executar a cena. Nós vamos usar ``randomize()`` em nossa cena ``Principal``, então não precisaremos dessa função aqui. ``randi () % n`` é a maneira padrão de obter um inteiro aleatório entre ``0`` e ``n-1``.
ru: Вы должны использовать ``randomize()``, если вы хотите, чтобы ваша последовательность "случайных" чисел отличалась при каждом запуске сцены. Мы будем использовать ``randomize()`` в нашей сцене ``Main``, поэтому здесь она нам не понадобится.
uk: Ви повинні використовувати, ``randomize()`` якщо хочете, щоб ваша послідовність "випадкових" чисел була щоразу різною, коли ви запускаєте сцену. Ми будемо використовувати ``randomize()`` в нашій ``Main`` сцені, тому тут це не потрібно.
zh_tw: 要讓「隨機」產生的數字在每次執行場景的時候都不同的話，需要呼叫 ``randomize()`` 。我們之後會在 ``Main`` 場景中呼叫 ``randomize()`` 的，現在還不需要他。

source: The last piece is to make the mobs delete themselves when they leave the screen. Connect the ``screen_exited()`` signal of the ``VisibilityNotifier2D`` node and add this code:
cs: Posledním kouskem kódu je,smazat nepřítele, když opustí obrazovku. Připojte signál ``screen_exited()`` uzlu ``VisibilityNotifier2D`` a přidejte tento kód:
de: Der letzte Schritt ist es, die Gagner (Mobs) dazu zu bringen, sich selbst zu löschen, wenn sie den Bildschirm verlassen. Verbinden Sie das Signal ``screen_exited()`` vom Node ``VisibilityNotifier2D`` und füge diesen Code hinzu:
es: La última parte es hacer que los enemigos se borren a sí mismos cuando abandonan la pantalla. Conecta la señal ``screen_exited()`` del nodo ``VisibilityNotifier2D`` y agrega este código:
fr: La dernière étape est de faire en sorte que les monstres se suppriment eux-mêmes lorsqu'ils quittent l'écran. Connecter le signal ``screen_exited()`` du nœud ``VisibilityNotifier2D`` et ajouter ce code :
it: L'ultimo pezzo è quello di fare in modo che i mob si cancellino loro stessi quando escono dallo schermo. Collegare il segnale ``screen_exited()`` del nodo ``VisibilityNotifier2D` e aggiungere questo codice:
ja: 最後のピースは、モブが画面を離れたときにモブ自身を削除することです。 ``VisibilityNotifier2D`` ノードの ``screen_exited()`` シグナルを接続し、次のコードを追加します:
ko: 마지막 과정은 몹이 화면을 떠날 때 스스로 삭제하도록 하는 것입니다. ``VisibilityNotifier2D`` 노드의 ``screen_exited()`` 시그널을 연결하고 다음 코드를 추가합니다:
pt_br: A última parte é fazer os inimigo se autodestruirem ao sair da tela. Conecte o sinal ``screen_exited()`` (saiu da tela) do nó ``VisibilityNotifier2D`` e adicione este código:
ru: Последняя часть - заставить мобов удалять себя, когда они покидают экран. Подключите сигнал ``screen exited()`` узла ``Visibility Notifier 2D`` и добавьте этот код:
uk: Останній фрагмент - це змусити мобів видаляти себе, коли вони залишають екран. Підключіть сигнал ``screen_exited()`` вузла ``VisibilityNotifier2D`` і додайте цей код:
zh_tw: 最後我們來讓怪物在離開畫面後刪除自己。連接 ``VisibilityNotifier2D`` 節點的 ``screen_exited()`` 訊號，並新增這段程式碼：

source: This completes the `Mob` scene.
cs: Tím je dokončena scéna `Mob`.
de: Damit ist die Szene des `Gegners` fertig.
es: Esto completa la escena `Mob`.
fr: Cela complète la scène `Mob`.
it: Questo completa la scena `Mob`.
ja: これで `Mob` シーンが完成します。
ko: 이것으로 `Mob` 씬이 완성되었습니다.
pl: To kończy tworzenie sceny `Przeciwnika`.
pt_br: Isto completa a cena dos Inimigos.
ru: На этом заканчиваем работу над сценой `Mob`.
uk: На цьому завершуємо сцену ``Mob``.
zh_cn: 这样就完成了 ``Mob`` 场景。
zh_tw: 這樣就完成了 `Mob` 場景。

source: Main scene
cs: Hlavní scéna
de: Main-Szene
es: Escena principal
fr: Scène principale
ja: Mainシーン
ko: 메인 씬
pt_br: Cena principal
ru: Главная сцена
uk: Головна сцена
zh_cn: ``Main`` 场景
zh_tw: Main（主要）場景

source: Now it's time to bring it all together. Create a new scene and add a :ref:`Node <class_Node>` named ``Main``. Ensure you create a Node, **not** a Node2D. Click the "Instance" button and select your saved ``Player.tscn``.
cs: Nyní je čas to všechno spojit. Vytvořte novou scénu a přidejte :ref:`Node<class_Node>` s názvem ``Main``. Klikněte na tlačítko "Instance" a vyberte uložený soubor ``Player.tscn``.
de: Jetzt ist es an der Zeit, alles zusammenzubringen. Erstellen Sie eine neue Szene und fügen einen :ref:`Node <class_Node>` namens ``Main`` hinzu. Stellen Sie sicher, dass Sie einen Node und **nicht** einen Node2D erstellen. Klicken Sie auf die Knopf "Instance" und wählen Ihre gespeicherte ``Player.tscn``.
es: Ahora es momento de juntar todo. Crea una nueva escena y agrega un :ref:`Node <class_Node>` llamado ``Main``. Asegúrate de crear un Node, **no** un Node2D. Haz clic en el botón "Instanciar" y selecciona la escena grabada ``Player.tscn``.
fr: Maintenant, il est temps de tout rassembler ensemble. Créer une nouvelle scène et ajouter un :ref:`Node <class_Node>` nommé ``Main``. Assurez-vous de créer un Node, **pas** un Node2D. Cliquez sur le bouton "Instance" et sélectionnez le fichier ``Player.tscn`` que vous avez sauvegardé.
it: Ora è il momento di mettere tutto insieme. Creare una nuova scena e aggiungere un :ref:`Node <class_Node_Node>`` chiamato ``Main``. Assicuratevi di creare un Nodo, **non** un Node2D. Clicca il pulsante "Instance" e seleziona il tuo ``Player.tscn`` salvato.
ja: さあ、すべてをまとめましょう。 新しいシーンを作成し、 ``Main`` という名前の :ref:`Node <class_Node>` を追加します。 Node2D **ではなく** 、Nodeを作成していることを確認してください。「インスタンス」ボタンをクリックして、保存した ``Player.tscn`` を選択します。
ko: 이제 모든 것을 하나로 모을 때입니다. 새 장면을 만들고 ``Main``\ 이라는 이름의 :ref:`Node <class_Node>`\ 를 추가하세요. Node2D가 아닌 **Node**\ 를 만들어야 합니다. "인스턴스화(Instance)" 버튼을 클릭하고 저장된 ``Player.tscn``\ 을 선택하세요.
uk: Тепер настав час зібрати все це до купи. Створіть нову сцену та додайте :ref:`Node <class_Node>`(Вузол) з ім'ям ``Main``. Переконайтеся, що ви створили Node (Вузол), а **не** Node2D (Вузол2D). Натисніть кнопку «Створити екземпляр» (іконка ланцюжка) і виберіть збережене ``Player.tscn``.
zh_tw: 現在該把所有東西都組合在一起了。先建立一個新的場景，並新增一個名稱為 ``Main`` 的 :ref:`Node <class_Node>` 。請確認一下建立的是 Node，**而不是** Node2D。點擊 [實體化] 按鈕並選擇稍早保存的 ``Player.tscn`` 。

source: Now, add the following nodes as children of ``Main``, and name them as shown (values are in seconds):
cs: Nyní přidejte následující uzly jako potomky ``Main`` a pojmenujte je podle obrázku (hodnoty jsou v sekundách):
de: Fügen Sie nun die folgenden Nodes als untergeordnete Elemente von ``Main`` hinzu und benenne sie wie abgebildet (Werte sind in Sekunden):
es: Ahora agrega los siguientes nodos como hijos de ``Main``, y nómbralos como se muestra (los valores son en segundos):
fr: Ajoutez maintenant les nœuds suivants en tant qu'enfants de ``Main``, et nommez-les comme indiqué (les valeurs sont en secondes) :
it: Ora, aggiungi i seguenti nodi come figli di ``Main``, e rinominali come mostrato (i valori sono in secondi):
ja: 次に ``Main`` の子供として以下のノードを追加します(値は秒単位です)。
ko: ``Main`` 의 자식으로 다음의 노드들을 추가하고, 설명대로 이름을 지으세요 (값은 초 단위입니다):
pt_br: Agora adicione os seguintes nós como filhos de ``Principal``, e os nomeie como mostrado (os valores estão em segundos):
ru: Теперь добавьте следующие узлы в виде дочерних элементов ``Main`` и назовите их как показано ниже (значения указаны в секундах):
uk: Тепер додайте ``Main``наступні вузли-нащадки та назвіть їх як показано (значення в секундах):
zh_cn: 现在，将以下节点添加为 ``Main`` 的子节点，并按如下所示对其进行命名（值以秒为单位）：
zh_tw: 現在，將下列節點新增為 ``Main`` 的子節點，並他們的名稱如下（數值單位為秒）：

source: :ref:`Timer <class_Timer>` (named ``MobTimer``) - to control how often mobs spawn
cs: :ref:`Timer <class_Timer>` (pojmenovaný ``MobTimer``) - pro ovládání času generování nepřátel
de: :ref:`Timer <class_Timer>` (genannt ``MobTimer``) - um zu steuern, wie oft Gegner erscheinen
es: :ref:`Timer <class_Timer>` (llamado ``MobTimer``) - para controlar cuán seguido aparecerán los enemigos
fr: :ref:`Timer <class_Timer>` (nommé ``MobTimer``) - pour contrôler à quelle fréquence les ennemis apparaissent
it: :ref:`Timer <class_Timer>` (chiamato ``MobTimer``) - per controllare quanto spesso i mob vengano generati
ja: :ref:`Timer <class_Timer>`\ ( ``MobTimer`` という名前) - モブが出現する頻度を制御する
ko: :ref:`Timer <class_Timer>` (``MobTimer`` 라고 이름지음) - 얼마나 자주 몹이 스폰하는지를 조절하기 위해 사용
pl: :ref:`Czasomierz<class_Timer>` (o nazwie ``MobTimer``) - do kontroli częstotliwości tworzenia przeciwników
pt_br: :ref:`Timer <class_Timer>` (nomeado ``MobTimer``) - para controlar a frequência com que a turba é gerada
ru: :ref:`Timer <class_Timer>` (назвать ``MobTimer``) - чтобы контролировать частоту появления мобов
uk: :ref:`Timer <class_Timer>` (названий ``MobTimer``) - щоб контролювати, як часто виникають моби
zh_cn: :ref:`Timer <class_Timer>` （名为 ``MobTimer``）——控制怪物产生的频率
zh_tw: :ref:`Timer <class_Timer>` （名稱為 ``MobTimer`` ）——用以控制怪物產生的頻率

source: :ref:`Timer <class_Timer>` (named ``ScoreTimer``) - to increment the score every second
cs: :ref:`Timer <class_Timer>` (pojmenovaný ``ScoreTimer``) - pro zvýšení skóre za každou sekundu bez srážky
de: :ref:`Timer <class_Timer>` (genannt ``ScoreTimer``) - um die Punktzahl jede Sekunde zu erhöhen
es: :ref:`Timer <class_Timer>` (llamado ``ScoreTimer``) - para incrementar el puntaje cada segundo
fr: :ref:`Timer <class_Timer>` (nommé ``ScoreTimer``) - pour incrémenter le score à chaque seconde
it: :ref:`Timer <class_Timer>` (chiamato ``ScoreTimer``) - per aumentare il punteggio ogni secondo
ja: :ref:`Timer <class_Timer>` ( ``ScoreTimer`` という名前) - 一秒ごとに得点を上げる
ko: :ref:`Timer <class_Timer>` (``ScoreTimer`` 라고 이름지음) - 매 초마다 점수를 증가시키기 위해 사용
pl: :ref:`Czasomierz <class_Timer>` (o nazwie ``ScoreTimer``) - aby co sekundę zwiększać liczbę punktów
pt_br: :ref:`Timer <class_Timer>` (nomeado ``ScoreTimer``) - para incrementar a pontuação a cada segundo
ru: :ref:`Timer <class_Timer>` (назвать ``ScoreTimer``) - чтобы каждую секунду увеличивать счет
uk: :ref:`Timer <class_Timer>` (названий ``ScoreTimer``) - збільшуватиме рахунок щосекунди
zh_cn: :ref:`Timer <class_Timer>` （名为 ``ScoreTimer``）——每秒增加分数
zh_tw: :ref:`Timer <class_Timer>` （名稱為 ``ScoreTimer`` ）——用以每秒增加成績

source: :ref:`Timer <class_Timer>` (named ``StartTimer``) - to give a delay before starting
cs: :ref:`Timer <class_Timer>` (pojmenovaný ``StartTimer``) - pro zpoždění před spuštěním
de: :ref:`Timer <class_Timer>` (genannt ``StartTimer``) - um eine Verzögerung vor dem Start zu geben
es: :ref:`Timer <class_Timer>` (llamado ``StartTimer``) - para crear una retardo antes de comenzar
fr: :ref:`Timer <class_Timer>` (nommé ``StartTimer``) - pour ajouter un délai avant le début
it: :ref:`Timer <class_Timer>` (chiamato``StartTimer``) - per definire un ritardo prima di iniziare
ja: :ref:`Timer <class_Timer>` ( ``StartTimer`` という名前) - 開始する前に遅延させる
ko: :ref:`Timer <class_Timer>` (``StratTimer`` 라고 이름지음) - 시작하기 전에 지연시간을 주기 위해 사용
pl: :ref:`Czasomierz <class_Timer>` (o nazwie ``StartTimer``) - aby podać opóźnienie przed rozpoczęciem
pt_br: :ref:`Timer <class_Timer>` (nomeado ``StartTimer``) - para dar um atraso antes de começar
ru: :ref:`Timer <class_Timer>` (назвать ``StartTimer``) - чтобы дать задержку перед стартом игры
uk: :ref:`Timer <class_Timer>` (названий ``StartTimer``) - щоб дати затримку перед запуском
zh_cn: :ref:`Timer <class_Timer>` （名为 ``StartTimer``）——在开始之前给出延迟
zh_tw: :ref:`Timer <class_Timer>` （名稱為 ``StartTimer`` ）——用以在開始前延遲

source: :ref:`Position2D <class_Position2D>` (named ``StartPosition``) - to indicate the player's start position
cs: :ref:`Position2D <class_Position2D>` (pojmenovaný ``StartPosition``) - pro označení počáteční pozice hráče
de: :ref:`Position2D <class_Position2D>` (genannt ``StartPosition``) - um die Startposition des Spielers anzuzeigen
es: :ref:`Position2D <class_Position2D>` (llamado ``StartPosition``) - para indicar la posición inicial del jugador
fr: :ref:`Position2D <class_Position2D>` (named ``StartPosition``) - pour indiquer la position de départ du joueur
it: :ref:`Posizione 2D <class_Position2D>` (chiamato``StartPosition``) - per indicare la posizione di partenza del giocatore
ja: \ :ref:`Position2D <class_Position2D>` (``StartPosition`` という名前) - プレイヤーの開始位置を示す
ko: :ref:`Position2D <class_Position2D>` (``StartPosition`` 이라고 이름지음) - 플레이어의 시작 지점을 표시하기 위해 사용
pl: :ref:`Position2D <class_Position2D>` (o nazwie ``StartPosition``) - wskazuje pozycję startową gracza
pt_br: :ref:`Position2D <class_Position2D>` (nomeado ``StartPosition``) - para indicar a posição inicial do jogador
ru: :ref:`Position2D <class_Position2D>` (назвать ``StartPosition``) - чтобы указать начальную позицию игрока
uk: :ref:`Position2D <class_Position2D>` (названий ``StartPosition``) - для визначення стартової позиції гравця
zh_cn: :ref:`Position2D <class_Position2D>` （名为 ``StartPosition``）——指示 ``Player`` 的起始位置
zh_tw: :ref:`Position2D <class_Position2D>` （名為 ``StartPosition`` ）——用以判斷玩家的起始位置

source: Set the ``Wait Time`` property of each of the ``Timer`` nodes as follows:
cs: Nastavte vlastnost ``Wait Time`` každého z uzlů ``Timer`` takto:
de: Stellen Sie die Eigenschaft ``Wait Time`` von jedem der ``Timer`` Nodes wie folgt ein:
es: Ajustar la propiedad ``Wait Time`` (tiempo de espera) de cada nodo ``Timer`` como se indica:
fr: Réglez la propriété ``Wait Time`` de chacun des nœuds ``Timer`` comme suit :
it: Impostare la proprietà ``Wait Time`` di ciascuno dei nodi ``Timer`` come segue:
ja: 各 ``Timer`` ノードの ``Wait Time`` プロパティを次のように設定します:
ko: 각 ``Timer``\ 마다 ``Wait Time`` 속성을 다음과 같이 설정하세요:
pl: Ustawić właściwość ``Czas oczekiwania`` każdego z węzłów ``Timer`` w następujący sposób:
pt_br: Defina a propriedade ``Wait Time`` (tempo de espera) para cada um dos nós ``Timer`` da seguinte forma:
ru: Задайте значение ``Wait Time`` для каждого из узлов ``Timer`` следующим образом:
uk: Встановіть властивість ``Wait Time`` кожного з вузлів ``Timer`` наступним чином:
zh_cn: 如下设置每个 ``Timer`` 节点的 ``Wait Time`` 属性：
zh_tw: 將每個 ``Timer`` 節點的 ``Wait Time`` （等待時間）屬性按照如下設定：

source: In addition, set the ``One Shot`` property of ``StartTimer`` to "On" and set ``Position`` of the ``StartPosition`` node to ``(240, 450)``.
cs: Dále nastavte vlastnost ``One Shot`` uzlu ``StartTimer`` na " On "a nastavte ``Position`` v uzlu ``StartPosition`` na ``(240, 450)``.
de: Stellen Sie zusätzlich die Eigenschaft ``One Shot`` von ``StartTimer`` auf "An" und die ``Position`` des ``StartPosition``-Nodes auf ``(240, 450)``.
es: Además, marca la propiedad ``One Shot`` (disparo único) como "Activado" y ajusta la propiedad ``Position`` del nodo ``StartPosition`` en ``(250,450)``.
fr: En outre, mettez la propriété ``One Shot`` de ``StartTimer`` sur "On" et réglez la ``Position`` du nœud ``StartPosition`` sur ``(240, 450)``.
it: Inoltre, imposta la proprietà "One Shot" di ``StartTimer``` su "On" e imposta la ``Posizione``` del nodo ``StartPosition``` su ``(240, 450)```.
ja: さらに、 ``StartTimer`` の ``One Shot`` プロパティを「On」に設定し、 ``StartPosition`` ノードの ``Position`` を ``(240, 450)`` に設定します。
ko: 그리고, ``StartTimer`` 속성의 ``One Shot``\ 을 "사용(On)"으로 설정하고 ``StartPosition`` 노드의 ``Position``\ 을 ``(240, 450)`` 으로 설정하세요.
pl: Dodatkowo, ustaw właściwość ``Jedno Przejście`` w ``StartTimer`` na "Włączony" i ustaw właściwość ``Position`` z węzła ``StartPosition`` na ``(240, 450)``.
pt_br: Além disso, configure a propriedade ``One Shot`` ("uma só vez") de ``StartTimer`` para "Ativo" e ``Position`` do nó ``StartPosition`` para ``(240, 450)``.
ru: Кроме того, установите для свойства ``One Shot`` узла ``StartTimer`` значение "Вкл" и для свойства ``Position`` узла ``StartPosition`` установите значение ``(240, 450)``.
uk: Крім того, встановіть властивість ``One Shot`` (одна спроба) в ``StartTimer`` на "включено" і задайте ``Position`` (позиція) в ``StartPosition`` на ``(240, 450)``.
zh_cn: 此外，将 ``StartTimer`` 的 ``One Shot`` 属性设置为 ``On``，并将 ``StartPosition`` 节点的 ``Position`` 设置为 ``(240, 450)``。
zh_tw: 另外，將 ``StartTimer`` 的 ``One Shot`` 屬性設為「開啟」，並將 ``StartPosition`` 節點的 ``Position`` 設為 ``(240, 450)`` 。

source: Spawning mobs
cs: Zrození nepřátel
de: Gegner (Mobs) erzeugen
es: Agregando enemigos
fr: Générer des monstres
it: Generare Mobs
ja: モブの生成
ko: 몹 스폰하기
pt_br: Gerando monstros
ru: Добавление мобов
uk: Поява мобів
zh_cn: 生成怪物
zh_tw: 產生怪物
