Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Your first game
cs: Vaše první hra
de: Das erste Spiel
es: Tu primer juego
fr: Votre premier jeu
it: Il tuo primo gioco
ja: 最初のゲーム
ko: 당신의 첫 게임
pt_br: Seu primeiro jogo
ru: Ваша Первая Игра
uk: Ваша перша гра
zh_cn: 您的第一个游戏
zh_tw: 第一個遊戲

source: Overview
cs: Přehled
de: Übersicht
es: Sinopsis
fr: Vue d'ensemble
it: Panoramica
ja: 概要
ko: 개요
pl: Przegląd
pt_br: Visão geral
ru: Обзор
uk: Огляд
zh_cn: 概览
zh_tw: 概覽

source: This tutorial will guide you through making your first Godot project. You will learn how the Godot editor works, how to structure a project, and how to build a 2D game.
cs: Tento tutorialvás provede vytvořením vašeho prvního projektu v Godotu. Dozvíte se, jak funguje editor Godotu, jak strukturovat projekt a jak vytvořit 2D hru.
de: Diese Anleitung wird Ihnen dabei helfen, Ihr erstes Godot-Projekt umzusetzen. Sie werden lernen wie der Godot-Editor funktioniert, wie ein Projekt zu strukturieren ist und man ein 2D-Spiel erstellt.
es: Este tutorial te guiará en la creación de tu primer proyecto en Godot. Aprenderás cómo funciona el editor, estructurar un proyecto y construir un juego 2D.
fr: Ce tutoriel vous guidera dans la réalisation de votre premier projet Godot. Vous apprendrez comment fonctionne l'éditeur de Godot, comment structurer un projet et comment réaliser un jeu 2D.
it: Questo tutorial ti guiderà nella creazione del tuo primo progetto in Godot. Imparerai come funziona l'editor di Godot, come strutturare un progetto e come sviluppare un gioco 2D.
ja: このチュートリアルではあなたの最初のGodotのプロジェクトの作りかたを紹介します。エディタの使い方、プロジェクトの構成方法、2Dゲームの作りかたを学びます。
ko: 이 튜토리얼은 첫 Godot 프로젝트를 만드는 과정을 안내합니다. Godot 에디터가 어떻게 작동하는지, 프로젝트를 구성하는 방법, 2D 게임을 만드는 방법을 배우게 됩니다.
pl: Ten samouczek pomoże ci stworzyć pierwszy projekt Godota. Dowiesz się, jak działa edytor Godot, jak ustawić strukturę projektu i jak zbudować grę 2D.
pt_br: Este tutorial lhe guiará sobre como fazer seu primeiro projeto no Godot. Você aprenderá como o editor Godot funciona, como estruturar um projeto e como construir um jogo 2D.
ru: Этот урок поможет вам сделать свой первый проект в Godot. Вы узнаете, как работает редактор Godot, как структурировать проект и как построить 2D-игру.
uk: Цей урок допоможе вам створити перший проєкт Godot. Ви дізнаєтесь, як працює редактор Godot, як структурувати проєкт та як побудувати 2D гру.
zh_cn: 本教程将指导您完成第一个Godot项目。您将学习Godot编辑器的工作原理、如何构建项目、以及如何构建2D游戏。
zh_tw: 本篇教學會帶領你製作出第一個 Godot 專案。在本篇教學中，會學習 Godot 是如何運作的、如何組織一個專案以及如何製作一個 2D 遊戲。

source: This project is an introduction to the Godot engine. It assumes that you have some programming experience already. If you're new to programming entirely, you should start here: :ref:`doc_scripting`.
cs: Tento projekt je úvodem k enginu Godot. Předpokládá se, že už máte nějaké zkušenosti s programováním. Pokud je pro vás programování "španělská vesnice", měli byste začít zde: :ref:`doc_scripting`.
es: Este proyecto es una introducción al motor Godot. Se asume que el lector posee alguna experiencia previa en programación. Sí estás empezando desde cero a programar, deberías empezar por aquí : :ref:`doc_scripting`.
ja: このプロジェクトはGodotエンジンへの入門用です。これは、あなたがすでにプログラミングの経験があるものとして書かれています。もし、まったくプログラミングの経験がなければ、\ :ref:`doc_scripting`\ から開始してください。
pl: Projekt ten jest wstępem do obsługi silnika Godota. Zakłada on, że masz już pewne doświadczenie w programowaniu. Jeśli jesteś początkującym programistą, powinieneś zacząć od: :ref:`doc_scripting`.
pt_br: Este projeto é uma introdução ao motor Godot. Ele assume que você já tenha uma experiência com programação. Se você é completamente cru em programação, deveria começar por aqui: :ref:`doc_scripting`.
ru: Этот проект представляет собой введение в движок Godot. Предполагается, что у вас уже есть опыт программирования. Если вы новичок в программировании, вам нужно начать отсюда: :ref:`doc_scripting`.
uk: Цей проєкт - це вступ до редактора Godot. Він передбачає, що ви вже маєте певний досвід програмування. Якщо ви взагалі не програмуєте, вам слід почати звідси: :ref:`doc_scripting`.
zh_cn: 该项目是Godot引擎的一个介绍。它假定您已经有一定的编程经验。如果您完全不熟悉编程，则应从这里开始： :ref:`doc_scripting`。
zh_tw: 這個專案是用來介紹 Godot 引擎的。在這裡我們會假設你已經有一些程式設計的經驗。如果完全沒有寫程式的經驗，請從 :ref:`doc_scripting` 開始。

source: The game is called "Dodge the Creeps!". Your character must move and avoid the enemies for as long as possible. Here is a preview of the final result:
cs: Hra se jmenuje „Dodge the Creeps!“. Vaše postava se musí pohybovat a vyhýbat se nepřátelům tak dlouho, jak je to možné. Zde je náhled konečného výsledku:
de: Das Spiel heißt "Dodge the Creeps!". Ihr Charakter muss sich bewegen, um den Gegnern so lange wie möglich auszuweichen. Hier eine Vorschau auf das Endergebnis:
es: El juego se llama "Dodge the Creeps!". El personaje debe moverse y esquivar los enemigos tanto tiempo como sea posible. Aquí hay una vista previa del resultado final:
fr: Le jeu s'appelle "Dodge the Creeps !". Votre personnage doit se déplacer et éviter les ennemis le plus longtemps possible. Voici un aperçu du résultat final :
it: Il gioco si chiama "Dodge the Creeps!". Il tuo personaggio deve muoversi ed evitare i nemici per il maggior tempo possibile. Questa è una dimostrazione del risultato finale:
ja: このゲームは「クリープをよけろ！」といいます。あなたのキャラクターはできるだけ長く動いて敵を避けなければなりません。以下が最終結果のプレビューです:
ko: 게임 이름은 "Dodge the Creeps!"입니다. 캐릭터는 가능한 오랫동안 움직이면서 적을 피해야 합니다. 다음은 앞으로 보게 될 최종 결과물입니다:
pl: Gra nazywa się "Dodge the Creeps!" Twoja postać musi się poruszać i unikać wrogów jak najdłużej. Poniżej znajduje się końcowy efekt:
pt_br: O jogo se chama "Dodge the Creeps!" (em tradução livre, "Desvie das Criaturas!"). Seu personagem deve se mover e evitar os inimigos por quanto tempo puder. Aqui está uma prévia do resultado final:
ru: Игра называется "Увернись от Крипов!". Ваш персонаж должен двигаться и избегать врагов как можно дольше. Вот предварительная демонстрация финального результата:
uk: Гра називається "Dodge the Creeps!" ("Ухиляйсь від Крипів"). Ваш персонаж повинен якомога довше рухатися і уникати ворогів. Ось попередній перегляд кінцевого результату:
zh_cn: 这个游戏叫做 ``Dodge the Creeps!``。您的角色必须尽可能长时间移动并避开敌人。这是最终结果的预览：
zh_tw: 這個遊戲叫做「Dodge the Creeps! 」。玩家角色必須不斷移動，儘可能地一直閃躲敵人。最終成果會長這樣：

source: **Why 2D?** 3D games are much more complex than 2D ones. You should stick to 2D until you have a good understanding of the game development process and how to use Godot.
cs: **Proč 2D?** 3D hry jsou mnohem složitější než hry 2D. Měli byste se držet 2D, dokud nebudete dobře rozumět procesu vývoje hry a tomu jak používat Godot.
de: **Warum 2D?** 3D-Spiele sind viel komplexer als 2D-Spiele. Sie sollten sich deshalb an 2D halten, bis Sie ein gutes Verständnis für den Spielentwicklungsprozess haben.
es: **¿Por qué 2D?** Los juegos 3D son mucho más complejos que los 2D. Debes permanecer en 2D hasta que hayas adquirido un conocimiento suficiente del proceso de desarrollo de un videojuego y de cómo utilizar Godot.
fr: **Pourquoi 2D ?** Les jeux 3D sont beaucoup plus complexes que les jeux 2D. Vous devriez vous en tenir à la 2D jusqu'à ce que vous ayez une bonne compréhension du processus de développement d'un jeu et de la façon d'utiliser Godot.
it: **Perchè 2D?** I giochi in 3D sono molto più complessi di quelli 2D. Dovresti continuare a creare giochi 2D fino a quando non avrai una buona comprensione del processo di sviluppo di un videogioco e di come usare Godot.
ja: **なぜ2Dから？** 3Dゲームは2Dより複雑です。ゲーム開発のプロセスやGodotの使い方をよく理解するまでは、2Dにとどまるべきです。
ko: **왜 2D인가요?** 3D 게임은 2D 게임보다 훨씬 더 복잡합니다. 게임 개발 과정과 Godot를 잘 알기 전까지는 2D 게임을 개발하는 것이 좋습니다.
pt_br: **Por que 2D?** Jogos 3D são muito mais complexos do que os 2D. Você deveria se concentrar em 2D até que tenha uma boa compreensão do processo de desenvolvimento de jogos e de como deve-se usar o Godot.
ru: **Почему 2D?** 3D-игры намного сложнее, чем 2D. Вам следует придерживаться 2D, пока вы не получите хорошее представление о процессе разработки игр и о том, как использовать Godot.
uk: ** Чому 2D? ** 3D-ігри набагато складніше, ніж 2D. Вам слід дотримуватися 2D, поки ви не отримаєте гарне уявлення про процес розробки ігор і про те, як використовувати Godot.
zh_tw: **為什麼是 2D？** 3D 遊戲比 2D 來得複雜多了。直到完整掌握了遊戲開發流程以及 Godot 使用方法，都應該先以 2D 為主。

source: Project setup
cs: Nastavení projektu
de: Projektkonfiguration
es: Configuración del proyecto
fr: Configuration du projet
it: Impostare il progetto
ja: プロジェクトの設定
ko: 프로젝트 설정하기
pt_br: Configuração do projeto
ru: Настройка проекта
uk: Налаштування проєкта
zh_cn: 项目设置
zh_tw: 設定專案

source: Launch Godot and create a new project. Then, download :download:`dodge_assets.zip <files/dodge_assets.zip>`. This contains the images and sounds you'll be using to make the game. Unzip these files in your project folder.
cs: Spusťte Godota a vytvořte nový projekt. Pak stáhněte :download:`dodge_assets.zip <files / dodge_assets.zip>`. Obsahuje obrázky a zvuky, které budete používat při tvorbě hry. Rozbalte tyto soubory ve složce projektu.
de: Starten Sie Godot und erstellen ein neues Projekt. Danach, laden Sie :download:`dodge_assets.zip <files/dodge_assets.zip>` herunter. Die Datei beinhaltet die Bilder und Töne, sogenannte "Assets", die Sie verwenden werden um das Spiel zu erstellen. Entpacken Sie die Dateien in den zuvor gewählten Projektordner.
es: Ejecuta Godot y crea un proyecto nuevo. Luego descarga :download:`dodge_assets.zip <files/dodge_assets.zip>`. Esto contiene las imágenes y sonidos que se utilizarán para hacer el juego. Descomprime los archivos en la carpeta del proyecto.
fr: Lancez Godot et créez un nouveau projet. Ensuite, téléchargez :download:`dodge_assets.zip <files/dodge_assets.zip>`. Il contient les images et les sons que vous utiliserez pour créer le jeu. Dézippez ces fichiers dans le dossier de votre projet.
it: Avvia Godot e crea un nuovo progetto. Poi scarica :download:`dodge_assets.zip <files/dodge_assets.zip>`. Contiene le immagini e i suoni che userai per fare il gioco. Estrai i file nella cartella del progetto appena creato.
ja: Godotを起動して新しいプロジェクトを作ります。\ :download:`dodge_assets.zip <files/dodge_assets.zip>`\ をダウンロードします。これにゲームを作るのに使う画像とサウンドが含まれます。これらのファイルをプロジェクトのフォルダに展開します。
ko: Godot를 실행하고 새 프로젝트를 만드세요. 그런 다음 :download:`dodge_assets.zip <files/dodge_assets.zip>`\ 을 다운로드하세요. 여기에는 게임에 쓸 이미지와 소리가 포함되어 있습니다. 프로젝트 폴더에서 압축을 풀어줍니다.
pt_br: Execute o Godot e crie um novo projeto. Então, baixe :download:`dodge_assets.zip <files/dodge_assets.zip>`. Ele contém as imagens e os sons que você usará para fazer o jogo. Descompacte esses arquivos na pasta do seu projeto.
ru: Запустите Godot и создайте новый проект. Затем загрузите :download:`dodge_assets.zip <files/dodge_assets.zip>`. Здесь содержатся изображения и звуки, которые вы будете использовать для создания игры. Разархивируйте эти файлы в папку вашего проекта.
uk: Запустіть Godot і створіть новий проєкт. Потім завантажте: download: `dodge_assets.zip <files / dodge_assets.zip>`. Тут містяться зображення і звуки, які ви будете використовувати для створення гри. Разархівіруйте ці файли в папку вашого проєкту.
zh_tw: 開啟 Godot 並建立一個新專案。接著，下載 :download:`dodge_assets.zip <files/dodge_assets.zip>` 。這個檔案包含了接下來製作遊戲時會使用到的圖片與聲音檔。把這些檔案解壓縮至專案資料夾中。

source: For this tutorial, we will assume you are familiar with the Godot editor. If you haven't read :ref:`doc_scenes_and_nodes`, do so now for an explanation of setting up a project and using the editor.
cs: V tomto tutoriálu předpokládáme, že jste obeznámeni s editorem Godot. Pokud jste nečetli :ref:`doc_scenes_and_nodes`, udělejte to nyní pro vysvětlení nastavení projektu a použití editoru.
de: In dieser Anleitung gehen wir davon aus, dass Sie mit dem Editor vertraut sind. Falls Sie :ref:`doc_scenes_and_nodes` noch nicht gelesen haben, informiere Sie sich darüber, wie Sie ein Projekt einrichten und den Editor verwenden können.
es: Para este tutorial, asumiremos que ya estás familiarizado con el editor. Si no te leiste :ref:`doc_scenes_and_nodes`, este es el momento de hacerlo para saber cómo configurar un proyecto y utilizar el editor.
fr: Pour ce tutoriel, nous supposerons que vous êtes familier avec l'éditeur de Godot. Si vous n'avez pas lu :ref:`doc_scenes_and_nodes`, faites-le maintenant pour une explication sur la mise en place d'un projet et l'utilisation de l'éditeur.
it: Per questo tutorial si da per scontato che tu abbia già familiarità con l'editor di Godot. Se non hai ancora letto :ref:`doc_scenes_and_nodes`, fallo ora per ricevere la spiegazione su come preparare un progetto ed utilizzare l'editor.
ja: このチュートリアルでは、Godotエディタの使い方が分かることを前提としています。まだ\ :ref:`doc_scenes_and_nodes`\ を読んでいない場合は、プロジェクトのセットアップ方法とエディタの使用についての説明があるので、先に読んでください。
ko: 이 튜토리얼에서는 여러분이 Godot 에디터에 익숙하다고 가정하겠습니다. 아직 :ref:`doc_scenes_and_nodes`\ 를 읽지 않았다면 돌아가서 에디터를 사용해 프로젝트를 설정하는 방법을 읽어보고 오세요.
pt_br: Para este tutorial vamos assumir que você está familiarizado com o editor. Se ainda não leu :ref:`doc_scenes_and_nodes`, faça isso agora para uma explicação sobre a configuração de um projeto e uso do editor.
ru: Для этого урока мы предположим, что вы уже знакомы с редактором Godot. Если вы еще не читали :ref:`doc_scenes_and_nodes`, то сделайте это сейчас для понимания настройки проекта и использования редактора.
uk: Для цього уроку ми припустимо, що ви вже знайомі з редактором Godot. Якщо ви ще не читали: ref: `doc_scenes_and_nodes`, то зробіть це зараз для розуміння налаштування проєкту і використання редактора.
zh_tw: 在這篇教學中，我們假設你已經熟悉 Godot 編輯器了。如果還沒讀過 :ref:`doc_scenes_and_nodes` ，請先閱讀，裡面有解釋如何設定專案以及編輯器使用方法。

source: This game is designed for portrait mode, so we need to adjust the size of the game window. Click on Project -> Project Settings -> Display -> Window and set "Width" to ``480`` and "Height" to ``720``.
cs: Tato hra je navržena pro režim na výšku, takže musíme upravit velikost okna hry. Klikněte na Projekt -> Nastavení projektu -> Displej -> Okno a nastavte "Šířka" na ``480`` a "Výška" na ``720``.
de: Dieses Spiel verwendet das Hochformat, daher müssen wir die Größe des Spielfensters anpassen. Klicken Sie auf Projekt -> Projekteinstellungen -> Display (Anzeige) -> Window (Fenster) und setzen "Width" auf ``480`` und "Height" auf ``720``.
es: Este juego utiliza el modo vertical (portrait), así que tendremos que ajustar el tamaño de la ventana. Haz clic en Proyecto -> Configuración del proyecto -> Display -> Window y colocar "Width" en ``480`` y "Height" en ``720``.
fr: Ce jeu est conçu pour le mode portrait, nous devons donc ajuster la taille de la fenêtre de jeu. Cliquez sur Projet -> Paramètres du projet -> Display-> Window et réglez "Width" à ``480`` et "Height" à ``720``.
it: Questo gioco è progettato per la modalità portrait, quindi abbiamo bisogno di modificare la dimensione della finestra di gioco. Clicca su Progetto -> Impostazioni Progetto -> Display -> Finestra ed imposta "Larghezza" su ``480`` e "Altezza" su ``720``.
ja: このゲームはポートレートモードを使うので、ゲームウィンドウのサイズを設定する必要があります。プロジェクト -> プロジェクト設定 -> Display -> Windowの順にクリックして 「Width」 を ``480`` に、「Height」を ``720`` にセットします。
ko: 이 게임은 세로 모드를 사용합니다. 따라서 게임 창의 크기를 조정해야 합니다. 프로젝트(Project) -> 프로젝트 설정(Project Settings) -> Display -> Window를 클릭하고 "Width"를 ``480``\ 으로, "Height"을 ``720``\ 으로 설정하세요.
pt_br: Este jogo usará o modo retrato, então precisamos ajustar as dimensões da janela de jogo. Clique em Projeto -> Configurações do Projeto -> Exibição -> Janela e configure "Largura" para 480 e "Altura" para 720.
ru: Эта игра разработана под портретный формат, поэтому нам нужно настроить размер игрового окна. Выберите меню "Project -> Project Settings -> Display -> Window" и задайте полю "Width" (Ширина) значение ``480``, а полю "Height" (Высота) значение ``720``.
uk: Ця гра розроблена під портретний формат, тому нам потрібно налаштувати розмір ігрового вікна. Виберіть меню "Project -> Project Settings -> Display -> Window" і задайте полю "Width" (Ширина) значення `` 480``, а полю "Height" (Висота) значення `` 720``.
zh_tw: 這個遊戲的畫面設計成了垂直顯示，我們需要調整遊戲視窗的大小。點擊 [專案] -> [專案設定] -> [Display] (顯示) -> [Window] (視窗)，接著把 [Width] (寬度) 設為 ``480`` ，[Height] (高度) 設為 ``720`` 。

source: Also in this section, under the "Stretch" options, set ``Mode`` to "2d" and ``Aspect`` to "keep". This ensures that the game scales consistently on different sized screens.
cs: Dále zde nastavte v sekci "Roztáhnout" položku ``Režim`` na "2d" a položku ``Aspekt`` na "keep". Tím je zajištěno, že hra nemění svoje měřítko na obrazovkách různých velikostí.
de: Setzen Sie auch in diesem Abschnitt unter den "Stretch" -Optionen ``Mode`` auf "2d" und "``Aspect`` auf "keep". Dies stellt sicher, dass das Spiel auf unterschiedlich großen Bildschirmen konsistent skaliert wird.
es: También en esta sección, bajo la opción "Stretch", coloca ``Mode`` a "2D y ``Aspect`` a "keep". Esto te asegura que el juego escala consistentemente en diferentes tamaños de pantalla.
fr: Toujours dans cette section, sous les options "Stretch", réglez ``Mode`` sur ``2d`` et ``Aspect`` sur "keep". Cela permet de s'assurer que le jeu s'adapte de manière cohérente sur des écrans de différentes tailles.
it: Sempre in questa sezione, sotto le opzioni "Stretch", impostare ``Mode`` a "2d" e ``Aspect`` a "keep". Questo assicura che il gioco sia scalabile in modo coerente su schermi di dimensioni diverse.
ja: このセクションでは、「Stretch」オプションのところで、 ``Mode`` を「2d」に、 ``Aspect`` を「keep」にします。これによって、異なるサイズのスクリーンでも、同じようにゲームが拡大縮小されて表示されます。
ko: 또한 이 섹션의 "Stretch" 옵션에서 ``Mode``\ 를 "2d"로, ``Aspect``\ 를 "keep"으로 설정하세요. 이렇게 하면 게임이 다양한 크기의 화면에서 일관되게 확장됩니다.
pt_br: Também nesta seção, nas opções "Alongamento(Stretch)", defina `` Modo(Mode)`` para "2d" e `` Aspecto(Aspect)`` para "manter(keep)". Isso garante que o jogo seja escalado consistentemente em telas de tamanhos diferentes.
ru: Также в этой секции, под опциями "Stretch", установите ``Mode`` на "2d" и ``Aspect`` на "keep". Это гарантирует, что игра последовательно масштабируется на экранах разного размера.
uk: Також в цій секції, під опціями "Stretch", встановіть `` Mode`` на "2d" і `` Aspect`` на "keep". Це гарантує, що гра послідовно масштабується на екранах різного розміру.
zh_tw: 另外，在同一個地方，將 [Stretch] (拉伸) 選項中的 ``Mode`` (模式) 設為「2d」，將 [Aspect] (比例) 設為「keep」(保持)。這樣就能確保遊戲在不同大小的螢幕上會保持相同的比例。

source: Organizing the project
cs: Uspořádání projektu
de: Projektorganisation
es: Organizando el proyecto
fr: Organisation du projet
it: Organizzare il progetto
ja: プロジェクトの編成
ko: 프로젝트 조직하기
pt_br: Organizando o projeto
ru: Организация Проекта
uk: Організація проєкту
zh_cn: 组织项目
zh_tw: 組織專案

source: In this project, we will make 3 independent scenes: ``Player``, ``Mob``, and ``HUD``, which we will combine into the game's ``Main`` scene. In a larger project, it might be useful to create folders to hold the various scenes and their scripts, but for this relatively small game, you can save your scenes and scripts in the project's root folder, identified by ``res://``. You can see your project folders in the FileSystem Dock in the lower left corner:
cs: V tomto projektu vytvoříme 3 nezávislé scény: ``Player``, ``Mob`` a ``HUD``, které zkombinujeme do hlavní scény hry:``Main`` . Ve větším projektu může být užitečné vytvořit složky, pro každkou scénu a její skript zvlášť, ale pro tuto relativně malou hru můžete ukládat své scény a skripty do kořenového adresáře projektu identifikovaného pomocí ``res: //``. Složky projektu můžete vidět v doku Souborový systém v levém dolním rohu:
de: In diesem Projekt werden 3 unabhängige Szenen erstellt: ``Player``, ``Mob`` und ``HUD``, die wir in der ``Main``-Szene des Spiels kombinieren werden. In einem größeren Projekt kann es nützlich sein, Ordner für die verschiedenen Szenen und deren Skripte zu erstellen. Bei diesem relativ kleinen Spiel können Sie Ihre Szenen und Skripte jedoch im Wurzelverzeichnis des Projekts speichern, der als ``res://`` bezeichnet wird. Sie können Ihren Projektordner im Dateisystem-Dock in der unteren linken Ecke sehen:
es: En este proyecto, haremos 3 escenas independientes: ``Player`` (jugador), ``Mob`` (enemigo), y ``HUD`` (visualización del estado del juego), los que se combinarán en la escena ``Main`` (principal). En un proyecto grande, puede ser útil crear carpetas que contengan las escenas y sus scripts, pero para este juego relativamente pequeño se pueden grabar las escenas y scripts en la carpeta raíz, normalmente referida como ``res://``. Se pueden ver las carpetas en el Panel de Sistema de Archivos, en la parte superior izquierda:
fr: Dans ce projet, nous allons créer 3 scènes indépendantes : ``Player``, ``Mob`` et ``HUD``, que nous combinerons dans la scène ``Main`` du jeu. Dans un projet de plus grande envergure, il peut être utile de créer des dossiers pour contenir les différentes scènes et leurs scripts, mais pour ce jeu relativement petit, vous pouvez sauvegarder vos scènes et scripts dans le dossier racine, appelé ``res://``. Vous pouvez voir vos dossiers de projet dans le dock Système de fichiers dans le coin supérieur gauche :
it: In questo progetto faremo 3 scene indipendenti: ``Player``, ``Mob``, e ``HUD``, che combineremo nella scena ``Main`` del nostro gioco. In un progetto più grande, potrebbe essere utile creare delle cartelle per contenere le varie scene e i loro script, ma per questo piccolo gioco puoi salvare le tue scene e script nella cartella principale del progetto, identificata come ``res://``. Puoi vedere la tua cartella del progetto nella FileSystem Dock nell'angolo in basso a sinistra:
ja: このプロジェクトでは、\ ``Player``\ 、\ ``Mob``\ 、\ ``HUD`` の3つの独立したシーンを作成し、これらをゲームの ``Main`` シーンに結合します。大規模なプロジェクトでは、さまざまなシーンとそのスクリプトを保持するフォルダを作成すると便利かもしれませんが、この比較的小さなゲームでは、 ``res://`` と呼ばれるプロジェクトのルートフォルダにシーンとスクリプトを保存します。プロジェクトフォルダは、左下隅の[ファイルシステム] ドックで確認できます:
ko: 이 프로젝트에서는 ``Player``, ``Mob``, ``HUD``\ 의 3개의 독립적인 씬을 만들고 게임의 ``Main`` 씬으로 결합할 것입니다. 더 큰 프로젝트에서는 다양한 씬과 해당 스크립트를 저장할 폴더를 만드는 것이 유용할 수 있지만 이와 같이 비교적 작은 게임의 경우 ``res://``\ 로 식별되는 프로젝트의 루트 폴더에 씬과 스크립트를 저장할 수 있습니다. 왼쪽 아래의 파일시스템(FileSystem) 독에서 프로젝트 폴더를 볼 수 있습니다:
pt_br: Neste projeto, vamos criar três cenas independentes: ``Jogador``, ``Inimigo`` e ``HUD``, que combinaremos na cena ``Principal`` do jogo. Em um projeto maior, pode ser útil criar pastas para armazenar as várias cenas e seus scripts, mas para este jogo relativamente pequeno, você pode salvar tudo na pasta raiz, referenciada como ``res://``. Você pode ver as pastas do seu projeto no painel Arquivos no canto inferior esquerdo:
ru: В этом проекте мы создадим 3 независимые сцены: ``Player``, ``Mob`` и ``HUD``, которые мы будем комбинировать со сценой ``Main``. В более крупном проекте было бы полезно сделать папки для хранения различных сцен и их скриптов, но для этой, относительно небольшой игры, вы можете сохранять свои сцены и скрипты в корневой папке, называемой ``res://``. Вы можете видеть папки проекта в окне FileSystem (Файловая Система) в нижнем левом углу:
uk: У цьому проєкті ми створимо 3 незалежні сцени: `` Player``, `` Mob`` і `` HUD``, які ми будемо комбінувати зі сценою `` Main``. У ширшому проєкті було б корисно зробити папки для зберігання різних сцен і їх скриптів, але для цієї, відносно невеликий гри, ви можете зберігати свої сцени і скрипти в кореневій папці, званої `` res: // ``. Ви можете бачити папки проєкту у вікні FileSystem (Файлова Система) в нижньому лівому кутку:
zh_tw: 在這個專案中，我們會使用三個獨立的場景： ``Player`` (玩家)、 ``Mob`` (怪物) 與 ``HUD`` ，我們會把這三個場景組合進遊戲的 ``Main`` (主要) 場景。在大型專案中，或許開一些資料夾來儲存不同的場景與其對應的腳本會比較好，但對於相對小型的遊戲，可以把場景跟腳本都保存在專案的根目錄下，也就是 ``res://`` 。可以在左下角的檔案系統 Dock 中看到專案資料夾：

source: Player scene
cs: Scéna Player (Hráč)
de: Spieler-Szene
es: Escena del jugador
fr: Scène Player
it: Scena del Player
ja: Playerシーン
ko: Player 씬
pt_br: Cena do jogador
ru: Сцена Игрока
uk: Сцена Гравця
zh_cn: ``Player`` 场景
zh_tw: Player 場景
