Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: In the ``HUD`` scene, select the ``StartButton`` and find its *Shortcut* property in the Inspector. Select "New Shortcut" and click on the "Shortcut" item. A second *Shortcut* property will appear. Select "New InputEventAction" and click the new "InputEventAction". Finally, in the *Action* property, type the name ``ui_select``. This is the default input event associated with the spacebar.
cs: Ve scéně ``HUD`` vyberte ``StartButton`` a najděte jeho vlastnost *Shortcut* v Inspektoru. Vyberte „New shortcut“ a klikněte na položku „Shortcut“. Zobrazí se druhá vlastnost *Shortcut*. Vyberte „Nový InputEventAction“ a klikněte na nový „InputEventAction“. Nakonec do vlastnosti *Action* zadejte název ``ui_select``. Toto je výchozí vstupní událost spojená s mezerníkem.
de: Wählen Sie in der ``HUD``-Szene den ``StartButton`` aus, und suchen im Inspektor nach seiner *Shortcut*-Eigenschaft. Wählen Sie "Neues Shortcut" und klicke auf das *Shortcut*-Element. Eine zweite „Shortcut“-Eigenschaft wird angezeigt. Wählen Sie „Neue InputEventAction“ und klicken auf das neue „InputEvent“-Element. Geben Sie schließlich in der Eigenschaft *Action* den Namen ``ui_select`` ein. Dies ist das Standard Eingabe-Ereignis, das der Leertaste zugeordnet ist.
es: En la escena ``HUD``, selecciona el ``StartButton`` y encuentra su propiedad *Shortcut** en el Inspector. Selecciona "New Shortcut" y haz clic en la opción "Shortcut". Aparecerá una segunda propiedad *Shortcut*. Selecciona "New InputEventAction" y haz clic en el nuevo "InputEvent". Finalmente, en la propiedad *Action*, escribe el nombre ``ui_select``. Este es el evento de entrada predeterminado asociado a la barra espaciadora.
fr: Dans la scène ``HUD``, sélectionnez le ``StartButton`` et trouvez sa propriété *Shortcut* dans l'Inspecteur. Sélectionnez "New Shortcut" et cliquez sur l'élément "Shortcut". Une deuxième propriété *Shortcut* apparaîtra. Sélectionnez "New InputEventAction" et cliquez sur le nouveau "InputEventAction". Enfin, dans la propriété *Action*, tapez le nom ``ui_select``. Il s'agit de l'événement d'entrée(input event) par défaut associé à la barre d'espace.
it: Nella scena ``HUD``, selezionare il ``StartButton`` e trova la sua proprietà *Shortcut* nell'Inspector. Seleziona "New Shortcut" e clicca sulla voce "Shortcut". Apparirà una seconda proprietà *Shortcut*. Seleziona "New InputEventAction" e clicca sulla nuova "InputEventAction". Infine, nella proprietà *Action*, digita il nome ``ui_select``. Questo è l'evento di input predefinito associato alla barra spaziatrice.
ja: ``HUD`` シーンで ``StartButton`` を選択し、インスペクタでその *Shortcut* プロパティを見つけます。「新規 Shortcut」を選択し、その「Shortcut」項目をクリックします。 2番目の *Shortcut* プロパティが表示されます。「新規 InputEventAction」を選択し、新しい「InputEvent」をクリックします。 最後に、 *Action* プロパティに ``ui_select`` という名前を入力します。これは、スペースバーに関連付けられたデフォルトの入力イベントです。
ko: ``HUD`` 씬에서 ``StartButton``\ 을 선택하고 인스펙터(Inspector)에서 *Shortcut* 속성을 찾으세요. "새 Shortcut(New Shortcut)"을 선택하고 "Shortcut" 항목을 클릭하세요. 두 번째 *Shortcut* 속성이 열립니다. "새 InputEventAction(New InputEventAction)"을 선택하세요. 마지막으로 *Action* 속성에서 이름을 "ui_select"로 입력하세요. 이것은 스페이스바로 지정된 기본 입력 이벤트입니다.
pt_br: Na cena ``HUD``, selecione o ``StartButton`` e encontre a propriedade *Atalho* no Inspetor. Selecione "Novo atalho" e clique no item "Atalho". Uma segunda propriedade *Atalho* aparecerá. Selecione "New InputEventAction" e clique no novo "InputEventAction". Finalmente, na propriedade *Action*, digite o nome "ui_select". Este é o evento de entrada padrão associado à barra de espaço.
ru: В сцене ``HUD`` выберите ``StartButton`` и найдите его свойство *Shortcut* в Инспекторе. Выберите "Новый Shortcut" и нажмите на пункт "Shortcut". Появится второе свойство *Shortcut*. Выберите "Новый InputEventAction" и нажмите на вновь появившийся "InputEventAction". Наконец, в свойстве *Action* введите имя ``ui_select``. Это событие ввода по умолчанию, связанное с пробелом.
uk: В сцені ``HUD`` виберіть ``StartButton`` і знайдіть його властивість *Shortcut* в Інспекторі. Виберіть "New Shortcut" і натисніть на пункт "Shortcut". З'явиться друга властивість *Shortcut*. Виберіть "New InputEventAction" та натисніть новий "InputEventAction". Нарешті, у властивості *Action* введіть назву ``ui_select``. Це подія введення за замовчуванням, пов'язана з пробілом.
zh_tw: 在 ``HUD`` 場景中選擇 ``StartButton`` ，並在屬性面板中找到 **Shortcut** 屬性。選擇「新增 Shortcut」並點擊「Shortcut」項目。接著會出現第二個 **Shortcut** 屬性。選擇「新增 InputEventAction」，並點擊新的「InputEventAction」。最後，在 **Action** 屬性中輸入名稱 ``ui_select`` 。這個是預設關聯在空白鍵上的輸入事件。

source: Now when the start button appears, you can either click it or press :kbd:`Space` to start the game.
cs: Nyní, když se objeví tlačítko Start, můžete na něj buď kliknout, nebo stisknout :kbd:`Space` pro spuštění hry.
de: Wenn nun die Start-Schaltfläche angezeigt wird, können Sie entweder darauf klicken oder die :kbd:`Leertaste` drücken, um das Spiel zu starten.
es: Ahora cuando aparezca el botón de inicio, puedes hacer clic en él o presionar la barra espaciadora para iniciar el juego.
fr: Maintenant, lorsque le bouton de démarrage apparaît, vous pouvez soit cliquer dessus, soit appuyer sur :kbd:`Space` pour démarrer le jeu.
it: Ora, quando appare il pulsante di avvio, puoi cliccare su di esso o premere :kbd:`Spazio` per avviare il gioco.
ja: スタートボタンが表示されたら、クリックするか、\ :kbd:`Space` を押してゲームを開始します。
ko: 이제 시작 버튼이 나타날 때, 버튼을 클릭하거나 :kbd:`Space`\ 를 눌러서 게임을 시작할 수 있습니다.
pt_br: Agora, quando o botão iniciar aparecer, você pode clicar nele ou pressionar :kbd: `Barra de Espaço` para iniciar o jogo.
ru: Теперь, когда появляется кнопка запуска, вы можете либо нажать на неё, либо на клавишу :kbd:`Пробел`, чтобы начать игру.
uk: Тепер, коли з’явиться кнопка запуску, ви можете, або натиснути на неї, або натиснути пробіл, щоб розпочати гру.
zh_tw: 現在當開始按鈕出現的時候，可以點擊按鈕或是使用按鍵 :kbd:`空白鍵` 來開始新遊戲。

source: Project files
cs: Soubory projektu
de: Projektdateien
es: Archivos del Proyecto
fr: Fichiers du projet
it: Files del progetto
ja: プロジェクトファイル
ko: 프로젝트 파일
pt_br: Arquivos do projeto
ru: Файлы проекта
uk: Файли проєкту
zh_cn: 项目文件
zh_tw: 專案檔案

source: You can find a completed version of this project at these locations:
cs: Dokončenou verzi tohoto projektu naleznete na těchto místech:
de: Eine vollständige Version dieses Projekts finden Sie unter:
es: Encontrarás una versión completada de este proyecto en las siguientes direcciones:
fr: Vous pouvez trouver une version complète de ce projet ici :
it: È possibile trovare una versione completa di questo progetto in queste posizioni:
ja: このプロジェクトの完成バージョンは、次の場所にあります。
ko: 여기에서 이 프로젝트의 완성 버전을 찾을 수 있습니다:
pt_br: Você pode encontrar uma versão finalizada deste projeto nestes locais:
ru: Вы можете найти завершённую версию этого проекта по этим ссылкам:
uk: Ви можете знайти завершену версію цього проєкту в таких місцях:
zh_cn: 您可以在以下位置找到该项目的完整版本：
zh_tw: 你可以在這幾個網址上找到這個專案的完成版：

source: The first scene we will make defines the ``Player`` object. One of the benefits of creating a separate Player scene is that we can test it separately, even before we've created other parts of the game.
pl: Pierwszą wykoną sceną będzie ``Player``. Jedną z zalet stworzenia oddzielnej sceny Player jest to, że możemy ją przetestować oddzielnie, nawet zanim utworzyliśmy inne części gry.
pt_br: A primeira cena que faremos define o objeto ``Jogador``. Um dos benefícios de criar uma cena Jogador em separado é que podemos testá-la separadamente, mesmo antes de criarmos outras partes do jogo.
ru: Первая сцена, которую мы создадим, определяет объект ``Player`` (Игрок). Одним из преимуществ создания отдельной сцены игрока является то, что мы можем протестировать ее отдельно, даже до того, как мы создали другие части игры.
zh_cn: 第一个场景，我们会定义 ``Player`` 对象。创建单独的 ``Player`` 场景的好处之一是，即使在创建游戏的其他部分之前，我们仍可以对其进行单独测试。

source: Now it's time to bring it all together. Create a new scene and add a :ref:`Node <class_Node>` named ``Main``. Click the "Instance" button and select your saved ``Player.tscn``.
pl: Teraz nadszedł czas, aby to wszystko połączyć. Utwórz nową scenę i dodaj :ref:`Węzeł <class_Node>` o nazwie ``Main``. Kliknij przycisk "Instancjuj" i wybierz zapisany ``Player.tscn``.
pt_br: Agora é hora de juntarmos tudo. Crie uma nova cena e adicione um :ref:`Nó <class_Node>` chamado ``Principal``. Clique no botão "Instanciar" e selecione seu ``Jogador.tscn`` já salvo.
ru: Пришло время собрать все это вместе. Создайте новую сцену и добавьте узел :ref:`Node <class_Node>` с именем ``Main``. Нажмите кнопку "Инстанцировать" и выберите сохраненную ранее сцену ``Player.tscn``.
zh_cn: 现在是时候将它们整合在一起了。创建一个新场景并添加一个名为 ``Main`` 的节点 :ref:`Node <class_Node>`。点击“实例”按钮，然后选择保存的 ``Player.tscn``。

source: Select the middle one ("Add Point") and draw the path by clicking to add the points at the corners shown. To have the points snap to the grid, make sure "Use Grid Snap" is selected. This option can be found to the left of the "Lock" button, appearing as a magnet next to some intersecting lines.
pt_br: Selecione o do meio ("Adicionar Ponto") e desenhe o caminho clicando para adicionar os pontos nos cantos mostrados. Para que os pontos fiquem alinhados à grade, verifique se a opção "Encaixar na Grade" está marcada. Essa opção pode ser encontrada à esquerda do botão "Travar", parecido como um ímã e ao lado de uma série de 3 pontos verticais.
zh_cn: 选择中间的那个（ ``添加点`` ），然后通过点击以在所示的角点处添加点来绘制路径。要使点吸附到网格，请确保选中 ``吸附到网格``。该选项可以在 ``锁定`` 按钮左侧的 ``捕捉选项`` 按钮下找到，显示为一系列三个垂直点。

source: *Text* : ``0``
it: *Testo* : ``0``
pt_br: *Texto*: ``0``

source: This project is an introduction to the Godot engine. It assumes that you have some programming experience already. If you're new to programming entirely, you should start here: :ref:`doc_scripting`. If you want to use C# in Godot, please also read :ref:`doc_c_sharp` before continuing.
fr: Ce projet est une introduction au moteur Godot. Il suppose que vous avez déjà une certaine expérience en programmation. Si vous n'avez jamais programmé, vous devriez commencer ici : :ref:`doc_scripting`. If vous voulez utiliser C# avec Godot, merci de lire également :ref:`doc_c_sharp` avant de continuer.
ko: 이 프로젝트는 Godot 엔진에 대한 소개입니다. 이 튜토리얼에서 여러분은 프로그래밍 경험이 조금 있다고 가정하겠습니다. 프로그래밍에 완전 처음이라면 여기서부터 시작하세요: :ref:`doc_scripting`. 만약 Godot에서 C#을 사용하고 싶다면, 진행하기 전에 :ref:`doc_c_sharp`\ 를 읽어보세요.

source: Your First Game
pl: Twoja pierwsza gra

source: **Why 2D?** 3D games are much more complex than 2D ones. You should stick to 2D until you have a good understanding of the game development process.
pl: **Dlaczego 2D?** Gry 3D są znacznie bardziej złożone niż 2D. Powinieneś trzymać się 2D dopóki dobrze nie zrozumiesz procesu tworzenia gry.

source: Project Setup
pl: Konfiguracja projektu

source: Launch Godot and create a new project. Then, download :download:`dodge_assets.zip <files/dodge_assets.zip>` - the images and sounds you'll be using to make the game. Unzip these files to your project folder.
pl: Uruchom Godota i stwórz nowy projekt. Następnie pobierz :download:`dodge_assets.zip <files/dodge_assets.zip>` - obrazy i dźwięki, których będziesz używać do tworzenia gry. Rozpakuj te pliki do folderu projektu.

source: For this tutorial, we will assume you are familiar with the editor. If you haven't read :ref:`doc_scenes_and_nodes`, do so now for an explanation of setting up a project and using the editor.
pl: W tym samouczku zakładamy, że znasz edytora. Jeśli nie przeczytałeś :ref:`doc_scenes_and_nodes`, zrób to teraz, aby uzyskać wyjaśnienie dotyczące konfiguracji projektu i korzystania z edytora.

source: This game will use portrait mode, so we need to adjust the size of the game window. Click on Project -> Project Settings -> Display -> Window and set "Width" to 480 and "Height" to 720.
pl: Ta gra będzie korzystać z trybu portretowego(pionowego), więc musimy dostosować rozmiar okna gry. Kliknij Projekt -> Ustawienia projektu -> Display -> Window i ustaw "Width" na 480 oraz "Height" na 720.

source: Organizing the Project
pl: Organizacja Projektu

source: In this project, we will make 3 independent scenes: ``Player``, ``Mob``, and ``HUD``, which we will combine into the game's ``Main`` scene. In a larger project, it might be useful to make folders to hold the various scenes and their scripts, but for this relatively small game, you can save your scenes and scripts in the root folder, referred to as ``res://``. You can see your project folders in the FileSystem Dock in the upper left corner:
pl: W tym projekcie powstaną 3 niezależne sceny: ``Player``, ``Mob`` i ``HUD``, które połączymy w scenę ``Main``. W większym projekcie, może być użyteczne, aby istniały różne foldery do przechowywania różnych scen i ich skryptów, ale w tej stosunkowo małej grze, można zapisać sceny i skrypty w folderze głównym, zwanym ``res://``. Foldery projektów są widoczne w Panelu systemu plików w lewym górnym rogu:

source: Player Scene
pl: Scena Player(Gracz)

source: Node Structure
pl: Struktura węzła

source: To begin, click the "Add/Create a New Node" button and add an :ref:`Area2D <class_Area2D>` node to the scene.
pl: Aby rozpocząć, kliknij przycisk "Dodaj/Twórz nowy węzeł" i dodaj węzeł :ref:`Area2D <class_Area2D>` do sceny.

source: With ``Area2D`` we can detect objects that overlap or run into the player. Change its name to ``Player`` by clicking on the node's name. This is the scene's root node. We can add additional nodes to the player to add functionality.
pl: Za pomocą ``Area2D`` możemy wykrywać obiekty, które zachodzą na siebie. Zmień jego nazwę na ``Player`` klikając na nazwę węzła. Jest to główny węzeł sceny. Możemy dodać dodatkowe węzły do odtwarzacza, aby zwiększyć jego funkcjonalność.

source: Save the scene. Click Scene -> Save, or press ``Ctrl+S`` on Windows/Linux or ``Command+S`` on Mac.
pl: Zapisz scenę. Kliknij Scena -> Zapisz lub naciśnij ``Ctrl+S`` w oknie Linuksa lub ``Command+S`` na komputerze Mac.

source: For this project, we will be following the Godot naming conventions. Classes (nodes) use ``PascalCase``, variables and functions use ``snake_case``, and constants use ``ALL_CAPS``.
pl: W tym projekcie będziemy postępować zgodnie z konwencjami nazewnictwa Godota. W klasach (węzłach) używane są ``DuzePierwszeLitery``, zmienne i funkcje ``male_litery``, a stałe ``WSZYSTKIE_DUZE``(Bez polskich znaków).

source: Sprite Animation
pl: Animacja Sprita

source: Click on the ``Player`` node and add an :ref:`AnimatedSprite <class_AnimatedSprite>` node as a child. The ``AnimatedSprite`` will handle the appearance and animations for our player. Notice that there is a warning symbol next to the node. An ``AnimatedSprite`` requires a :ref:`SpriteFrames <class_SpriteFrames>` resource, which is a list of the animations it can display. To create one, find the ``Frames`` property in the Inspector and click "<null>" -> "New SpriteFrames". Next, in the same location, click ``<SpriteFrames>`` to open the "SpriteFrames" panel:
pl: Kliknij na węzeł ``Player`` i dodaj węzeł :ref:`AnimatedSprite <class_AnimatedSprite>`jako dziecko. ``AnimatedSprite`` będzie obsługiwać wygląd i animacje dla naszego gracza. Zauważ, że obok węzła znajduje się symbol ostrzegawczy. ``AnimatedSprite`` wymaga zasobu :ref:`SpriteFrames <class_SpriteFrames>`, który jest listą animacji, które może wyświetlić. Aby go utworzyć, odszukaj właściwość ``Frames`` w inspektorze i kliknij "<null>" -> "New SpriteFrames". Następnie, w tej samej lokalizacji, kliknij ``<SpriteFrames>``, aby otworzyć panel "SpriteFrames":

source: On the left is a list of animations. Click the "default" one and rename it to "right". Then click the "Add" button to create a second animation named "up". Drag the two images for each animation, named ``playerGrey_up[1/2]`` and ``playerGrey_walk[1/2]``, into the "Animation Frames" side of the panel:
pl: Po lewej stronie znajduje się lista animacji. Kliknij "default" i zmień jego nazwę na "right". Następnie kliknij przycisk "Dodaj", aby utworzyć drugą animację o nazwie "up". Przeciągnij dwa obrazy dla każdej animacji o nazwie ``playerGrey_up[1/2]`` i ``playerGrey_walk[1/2]``, w panelu "Klatki animacji":

source: Finally, add a :ref:`CollisionShape2D <class_CollisionShape2D>` as a child of ``Player``. This will determine the player's "hitbox", or the bounds of its collision area. For this character, a ``CapsuleShape2D`` node gives the best fit, so next to "Shape" in the Inspector, click "<null>"" -> "New CapsuleShape2D". Resize the shape to cover the sprite:
pl: Na koniec dodaj :ref:`ColisionShape2D <class_CollisionShape2D>` jako dziecko ``Player``. W ten sposób zostaną wyznaczone granice obszaru kolizji gracza. Węzeł ``CapsuleShape2D`` najlepiej pasuje do tego węzła, więc obok "Shape" w inspektorze kliknij "<null>" -> "New CapsuleShape2D". Zmień rozmiar obszaru w celu okrycia całego sprite:

source: Don't scale the shape's outline! Only use the size handles (circled in red) to adjust the shape!
pl: Nie skaluj kształtu konturu! Do regulacji kształtu należy używać wyłącznie specjalnych uchwytów (zakreślonych na czerwono)!

source: Moving the Player
pl: Poruszanie graczem

source: Now we need to add some functionality that we can't get from a built-in node, so we'll add a script. Click the ``Player`` node and click the "Add Script" button:
pl: Teraz musimy dodać funkcjonalność, której nie możemy uzyskać z wbudowanego węzła, więc dodamy skrypt. Kliknij na węzeł ``Player`` i przycisk "Dodaj skrypt":

source: Using the ``export`` keyword on the first variable ``speed`` allows us to set its value in the Inspector. This can be handy for values that you want to be able to adjust just like a node's built-in properties. Click on the ``Player`` node and set the speed property to ``400``.
pl: Użycie słowa kluczowego ``export`` przy pierwszej zmiennej ``SPEED`` pozwala na ustawienie jej wartości w inspektorze. Może to być przydatne w przypadku wartości, które mają być dostosowywane w taki sam sposób, jak wbudowane właściwości węzła. Kliknij na węzeł ``Player`` i ustaw prędkość na ``400``.

source: If you're using C#, you need to restart godot editor temporarily to see exported variables in the editor until it's fixed.
pl: Jeśli używasz C#, musisz tymczasowo uruchomić ponownie edytor Godota, aby zobaczyć wyeksportowane zmienne w edytorze. Jest to tymczasowe rozwiązanie do naprawienia tego błędu.

source: Now we can use the ``_process()`` function to define what the player will do. ``_process()`` is called every frame, so we'll use it to update elements of our game which we expect will change often. Here we'll make it:
pl: Teraz możemy użyć funkcji ``_process()`` do zdefiniowania, co gracz będzie robił. ``_process()`` jest wywoływany co każda klatkę, więc użyjemy go do aktualizacji elementów naszej gry, które, jak się spodziewamy, będą się często zmieniać. Zrobimy to tak:

source: First, we need to check for input - is the player pressing a key? For this game, we have 4 direction inputs to check. Input actions are defined in the Project Settings under "Input Map". You can define custom events and assign different keys, mouse events, or other inputs to them. For this demo, we will use the default events that are assigned to the arrow keys on the keyboard.
pl: Po pierwsze, musimy sprawdzić wejście - czy gracz naciska przycisk? W tej grze mamy do sprawdzenia 4 kierunki. Działania wejściowe są zdefiniowane w ustawieniach projektu w sekcji "Input Map". Można definiować własne zdarzenia i przypisać do nich różne klawisze, zdarzenia myszy lub inne wejścia. W tym demie będziemy używać domyślnych zdarzeń, które są przypisane do klawiszy strzałek na klawiaturze.

source: You can detect whether a key is pressed using ``Input.is_action_pressed()``, which returns ``true`` if it is pressed or ``false`` if it isn't.
pl: Za pomocą ``Input.is_action_pressed()`` możesz sprawdzić który klawisz jest wciśnięty. Naciśnięty klawisz zwraca ``true`` a zwraca ``false`` gdy nie jest wciśnięty.

source: We check each input and add/subtract from the ``velocity`` to obtain a total direction. For example, if you hold ``right`` and ``down`` at the same time, the resulting ``velocity`` vector will be ``(1, 1)``. In this case, since we're adding a horizontal and a vertical movement, the player would move *faster* than if it just moved horizontally.
pl: Sprawdzamy każde wejście i dodajemy/odejmujemy od ``velocity``(prędkość) aby uzyskać kierunek całkowity. Na przykład, jeśli przytrzymasz jednocześnie ``prawo`` i `dół``, otrzymany wektor ``velocity`` będzie ``(1, 1) ``. W tym przypadku, ponieważ dodajemy ruch poziomy i pionowy, gracz poruszałby *szybciej* niż gdyby po prostu poruszał się poziomo.

source: We can prevent that if we *normalize* the velocity, which means we set its *length* to ``1``, and multiply by the desired speed. This means no more fast diagonal movement.
pl: Możemy temu zapobiec, jeśli *znormalizujemy* prędkość, co oznacza, że ustawimy jej *długość* na ``1`` i pomnożymy ją przez pożądaną prędkość. Oznacza to rezygnację z szybszego ruchu po przekątnej.

source: We also check whether the player is moving so we can start or stop the AnimatedSprite animation.
pl: Sprawdzamy również, czy gracz porusza się, abyśmy mogli uruchomić lub zatrzymać animację AnimatedSprite.

source: ``$`` returns the node at the relative path from this node, or returns ``null`` if the node is not found. Since AnimatedSprite is a child of the current node, we can use ``$AnimatedSprite``.
pl: ``$`` zwraca węzeł o ścieżce względnej dla aktuanego węzła lub ``null`` jeśli węzeł nie został znaleziony. Ponieważ AnimatedSprite jest dzieckiem bieżącego węzła, możemy użyć ``$AnimatedSprite``.

source: Now that we have a movement direction, we can update ``Player``'s position and use ``clamp()`` to prevent it from leaving the screen by adding the following to the bottom of the ``_process`` function:
pl: Teraz, gdy mamy kierunek ruchu, możemy zaktualizować położenie ``Player`` i użyć ``clamp()`` aby zapobiec opuszczeniu ekranu przez dodanie następującej informacji na dole funkcji ``_process``:

source: *Clamping* a value means restricting it to a given range.
pl: *Clamp* oznacza ograniczenie go do określonego zakresu.

source: If you get an error in the "Debugger" panel that refers to a "null instance", this likely means you spelled the node name wrong. Node names are case-sensitive and ``$NodeName`` or ``get_node("NodeName")`` must match the name you see in the scene tree.
pl: Jeśli w panelu "Debugger" pojawi się błąd odnoszący się do "null instance"(braku instancji), prawdopodobnie oznacza to, że nazwa węzła została błędnie wpisana. W nazwach węzłów wielkość liter ma znaczenie i ``$NodeName`` lub ``get_node("NodeName")`` musi odpowiadać nazwie widocznej w drzewie sceny.

source: Choosing Animations
pl: Wybieranie animacji

source: Now that the player can move, we need to change which animation the AnimatedSprite is playing based on direction. We have a "right" animation, which should be flipped horizontally using the ``flip_h`` property for left movement, and an "up" animation, which should be flipped vertically with ``flip_v`` for downward movement. Let's place this code at the end of our ``_process()`` function:
pl: Teraz, kiedy gracz może się poruszać, musimy zmienić, w której animacji, w zależności od kierunku, jest obecnie AnimatedSprite. Mamy animację "right"(prawo), która powinna być obracana poziomo za pomocą właściwości ``flip_h`` dla ruchu lewostronnego, oraz animację "up", która powinna być obracana pionowo za pomocą ``flip_v`` dla ruchu w dół. Umieśćmy ten kod na końcu naszej funkcji ``_process()``:
