Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: We want ``Player`` to detect when it's hit by an enemy, but we haven't made any enemies yet! That's OK, because we're going to use Godot's *signal* functionality to make it work.
cs: Chceme, aby ``Player`` detekoval, když je zasažen nepřítelem, ale zatím jsme žádného nepřítele nevytvořili! To je v pořádku, protože zde použijeme Gotovi *signály*.
de: Wir wollen, dass der ``Player`` erkennt, wann er von einem Feind getroffen wird, aber wir haben uns noch keine Feinde erstellt! Das ist in Ordnung, denn wir werden Godots *Signal*-Funktionalität nutzen, damit es funktioniert.
es: Queremos detectar cuando un enemigo alcanza a ``Player``, pero no hemos creado ningún enemigo todavía. Eso está bien, porque vamos a utilizar la funcionalidad de *señales* (signal) de Godot para hacer que funcione.
fr: Nous voulons que ``Player`` détecte quand il est touché par un ennemi, mais nous ne n’avons pas encore créé d'ennemis ! Ce n'est pas grave, car nous allons utiliser la fonctionnalité *signal* de Godot pour le faire fonctionner.
it: Vogliamo che il ``Player`` rilevi quando viene colpito da un nemico, ma non abbiamo ancora creato nemici! Non c'è problema, perché useremo la funzionalità *segnali* di Godot per fare in modo che funzioni.
ja: ``Player`` には敵に攻撃されたことを検知してもらいたいのですが、まだ敵を作っていません！Godotの\ *シグナル*\ 機能を使って動作させるので、大丈夫です。
ko: 우리는 ``Player``\ 가 적과 닿았다는 것을 감지하길 원하지만 아직 적을 만들지 않았습니다! 충돌이 작동하도록 우리는 Godot의 *시그널(signal)* 기능을 사용할 것이기 때문에 괜찮습니다.
pl: Chcemy, aby ``Player`` wykrył, kiedy został uderzony przez wroga, ale nie zrobiliśmy jeszcze żadnych wrogów! To w porządku, ponieważ będziemy korzystać z funkcji Godot *signal* (sygnał), aby to zadziałało.
pt_br: Nós queremos que o ``Jogador`` detecte quando é atingido por um inimigo, mas nós não fizemos nenhum inimigo ainda! Não tem problema, porque nós iremos utilizar a funcionalidade de *sinal* do Godot para fazer com que funcione.
ru: Мы хотим, чтобы ``Player`` обнаруживал столкновение с врагом, но мы еще не сделали никаких врагов! Это нормально, потому что мы будем использовать такой функционал Godot, как *сигнал*.
uk: Ми хочемо виявляти зіткнення гравця з ворогами, але ворогів ми ще не створили! Це добре, тому що ми будемо використовувати *сигнали* Godot.
zh_cn: 我们希望 ``Player`` 能够检测到何时被敌人击中，但是我们还没有任何敌人！没关系，因为我们将使用Godot的 *信号* 功能来使其正常工作。
zh_tw: 我們希望 ``Player`` 被敵人撞到時能偵測到，但我們還沒做好敵人！沒關係，因為我們會用 Godot 的 **訊號** 來做這個功能。

source: Add the following at the top of the script, after ``extends Area2D``:
cs: Po ``extends Area2D`` přidejte na začátek skriptu následující kód:
de: Fügen Sie folgendes oben im Skript nach ``extends Area2D`` hinzu:
es: Añade lo siguiente en la parte superior del script, después de ``extends Area2d``:
fr: Ajoutez ce qui suit en haut du script, après ``extends Area2D`` :
it: Aggiungi quanto di seguito in cima allo script, dopo ``extends Area2d``:
ja: スクリプトの先頭で ``extends Area2d`` の後に、次の行を追加します:
ko: 스크립트 맨 위 ``extends Area2D`` 다음에 아래 코드를 추가하세요:
pt_br: Adicione o trecho a seguir no início do script, depois de ``extends Area2D``:
ru: Добавьте следующее в верх скрипта после ``extends Area2d``:
uk: Додайте наступний код в початок скрипта, після ``extends Area2d``:
zh_tw: 將下列程式碼加在腳本頂部的 ``extends Area2D`` 後：

source: This defines a custom signal called "hit" that we will have our player emit (send out) when it collides with an enemy. We will use ``Area2D`` to detect the collision. Select the ``Player`` node and click the "Node" tab next to the Inspector tab to see the list of signals the player can emit:
cs: Toto definuje vlastní signál zvaný "hit", který bude hráč vysílat při srážce s nepřítelem. K detekci kolize použijeme ``Area2D``. Vyberte uzel ``Player`` a klikněte na záložku "Uzel" vedle záložky Inspektor, aby se zobrazil seznam signálů, které může hráč vyslat:
de: Dies definiert ein benutzerdefiniertes Signal namens "hit", das wir von unserem Spieler aussenden (send out) lassen, wenn es mit einem Gegner kollidiert. Wir werden ``Area2D`` verwenden, um die Kollision zu erkennen. Wählen Sie den Node ``Player`` und klicken auf die Registerkarte "Node" neben der Registerkarte Inspektor, um die Liste der Signale zu sehen, die der Spieler ausgeben kann:
es: Esto define una señal personalizada llamada "hit" que nuestro player emitirá (enviará) cuando colisione con un enemigo. Usaremos ``Area2D`` para detectar la colisión. Selecciona el nodo ``Player`` y haz clic en la pestaña "Nodos" junto a la pestaña Inspector para ver la lista de señales que puede emitir el player:
fr: Ceci définit un signal personnalisé appelé "hit" que notre joueur émettra lorsqu'il entre en collision avec un ennemi. Nous utiliserons ``Area2D`` pour détecter la collision. Sélectionnez le nœud ``Player`` et cliquez sur l'onglet "Nœud" à côté de l'onglet Inspecteur pour voir la liste des signaux que le joueur peut émettre :
it: Questo definisce un segnale personalizzato chiamato "hit" che il giocatore emetterà quando entra a contatto con un nemico. Useremo il nodo ``Area2D``per rilevare la collisione. Seleziona il nodo ``Player`` e fai click sull'etichetta "Node", vicino a "Inspector", per vedere la lista di segnali che il giocatore può emettere:
ja: これは、プレイヤーが敵と衝突したときにプレイヤーが発信する(送り出す)"hit"と呼ばれるカスタムシグナルを定義します。衝突を検出するために ``Area2D`` を使用します。 ``Player`` ノードを選択し、インスペクタタブの横にある「ノード」タブをクリックすると、プレイヤーが発信するシグナルのリストが表示されます:
ko: 이것은 적과 충돌할 때 플레이어가 방출하는 "hit"라는 사용자 지정 시그널을 정의합니다. 충돌을 감지하기 위해 ``Area2D``\ 를 사용합니다. ``Player`` 노드를 선택하고 인스펙터(Inspector) 독 옆에 있는 "노드(Node)" 독을 클릭해 플레이어가 방출할 수 있는 시그널 목록을 확인해보세요:
pl: Definiuje on niestandardowy sygnał zwany "hit"(trafieniem), który nasz gracz wyemituje (wyśle), kiedy zderzy się z wrogiem. Do wykrywania kolizji użyjemy ``Area2D``. Wybierz węzeł ``Player`` i kliknij zakładkę "Węzeł" obok zakładki Inspektor, aby zobaczyć listę sygnałów, które odtwarzacz może emitować:
pt_br: Isto define um sinal personalizado chamado "hit" (atingir) que faremos com que nosso jogador emita (envie) quando colidir com um inimigo. Iremos utilizar ``Area2D`` para detectar a colisão. Selecione o nó ``Jogador`` e clique na aba "Nó" ao lado da aba "Inspetor" para ver a lista de sinais que o jogador pode emitir:
ru: Это определяет пользовательский сигнал под названием "hit"("удар"), который наш игрок будет излучать (отправлять), когда он сталкивается с противником. Мы будем использовать ``Area2D`` для обнаружения столкновения. Выберите узел ``Player``("Игрок") и щелкните по вкладке "Узел" (Node) рядом с вкладкой "Инспектор" (Inspector), чтобы просмотреть список сигналов, которые игрок может посылать:
uk: Цей рядок визначає власний сигнал під назвою "hit" ("удар"), який буде випромінюватися з нашого гравця, коли він буде стикатися з ворогом. Ми будемо використовувати ``Area2D`` для виявлення зіткнення. Виберіть вузол ``Player`` і натисніть на вкладку "Вузол" поруч із вкладкою Інспектор, щоб побачити список сигналів, які гравець може випромінювати:
zh_cn: 这定义了一个称为 ``hit`` 的自定义信号，当 ``Player`` 与敌人碰撞时，我们将使其 ``Player`` 发射（发出）信号。我们将使用 ``Area2D`` 来检测碰撞。选择 ``Player`` 节点，然后点击属性检查器选项卡旁边的“节点”选项卡，以查看 ``Player`` 可以发出的信号列表：
zh_tw: 這段程式碼定義了一個叫做「hit」的自定訊號，稍後我們會讓玩家在碰撞到敵人的時候送出這個訊號。我們會使用 ``Area2D`` 來偵測碰撞。先選擇 ``Player`` 節點，然後點擊屬性面板旁邊的 [節點] 分頁來看看所有 Player 能送出的訊號：

source: Notice our custom "hit" signal is there as well! Since our enemies are going to be ``RigidBody2D`` nodes, we want the ``body_entered(body: Node)`` signal. This signal will be emitted when a body contacts the player. Click "Connect.." and the "Connect a Signal" window appears. We don't need to change any of these settings so click "Connect" again. Godot will automatically create a function in your player's script.
cs: Všimněte si, že je k dispozici i náš vlastní signál "hit"! Protože naši nepřátelé budou uzly ``RigidBody2D``, chceme signál ``body_entered(body:Node)``. Tento signál bude vydán, když se body dotkne hráče. Klikněte na „Připojit ...“ a objeví se okno „Připojit signál“. Nemusíme měnit žádné z těchto nastavení, takže znovu klikněte na Připojit. Godot automaticky vytvoří funkci ve skriptu vašeho hráče.
de: Beachten Sie, dass unser benutzerdefiniertes "hit"-Signal auch da ist! Da unsere Feinde ``RigidBody2D`` Nodes sein werden, brauchen wir das Signal ``body_entered(body: Node)``; dieses wird ausgesendet, wenn ein Körper den Spieler berührt. Klicken Sie auf "Verbinden..." und dann, im "Signal verbinden"-Fenster, wieder auf "Verbinden". Wir müssen keine dieser Einstellungen ändern - Godot erstellt automatisch eine Funktion im Skript des Spielers. Diese Funktion wird immer dann aufgerufen, wenn das Signal ausgelöst wird - sie handhabt das Signal.
es: Observa que nuestra señal personalizada de "hit" también está ahí. Como nuestros enemigos van a ser nodos ``RigidBody2D``, necesitamos la señal ``body_entered( Object body )``. Esta señal se emitirá cuando un cuerpo entre en contacto con el player. Haz clic en "Conectar..." y luego en "Conectar" de nuevo en la ventana " Conectar señal ". No necesitamos cambiar ninguna de estas configuraciones. Godot entonces creará automáticamente una función en el script de Player.
fr: Notez que notre signal personnalisé "hit" est là aussi ! Puisque nos ennemis vont être des nœuds ``RigidBody2D``, nous avons besoin du signal ``body_entered(body: Node)`` ; celui-ci sera émis lorsqu'un objet percute le joueur. Cliquez sur "Connecter..." et la fenêtre "Connecter un signal" apparaîtra. Nous n'avons pas besoin de modifier ces paramètres, alors cliquez à nouveau sur "Connect". Godot va automatiquement créer une fonction dans le script de votre joueur.
it: Come puoi notare la lista contiene anche il nostro segnale personalizzato "hit". Poiché i nemici saranno nodi ``RigidBody2D``, vogliamo usare il segnale ``body_entered(body: Node)``. Questo segnale viene emesso quando un corpo entra a contatto con il giocatore. Clicca "Connetti.." e appare la finestra "Connetti un Segnale". Non abbiamo bisogno di cambiare nessuna delle impostazioni quindi clicca "Connetti" nuovamente. Godot creerà automaticamente una funzione nello script del tuo player.
ja: カスタムの「hit」シグナルもありますね！ 敵は ``RigidBody2D`` ノードになるため、 ``body_entered(body: Node)`` シグナルが必要です。これは、ボディがプレイヤーに接触したときに発信されます。「接続」をクリックすると、「シグナルの接続」ウィンドウが現れます。これらの設定を変更する必要はないので、再度「接続」をクリックしてください。Godotはプレイヤーのスクリプトに自動的に関数を作成します。
ko: 우리의 커스텀 "hit" 시그널도 거기에 있다는 점에 주목하세요! 적들은 ``RigidBody2D`` 노드가 될 것이기 때문에, 우리는 ``body_entered(body: Node)`` 시그널이 필요합니다. 이 시그널을 적과 플레이어와 닿았을 때 방출할 것입니다. "연결(Connect)"을 누르면 "시그널을 메서드에 연결(Connect a Signal to a Method)" 창이 열립니다. 우리는 어떤 설정도 바꿀 필요가 없으므로 "연결(Connect)"을 누르세요. - Godot는 자동으로 플레이어 스크립트에 함수를 생성해줍니다.
pt_br: Observe que o nosso sinal personalizado "hit" também está lá! Já que nossos inimigos serão nós do tipo ``RigidBody2D``, queremos o sinal ``body_entered( Object body )``; ele será emitido quando um corpo entrar em contato com o jogador. Clique em "Conectar.." e a janela "Conectando Sinal" aparece. Nós não precisamos alterar nenhuma destas configurações – o Godot criará automaticamente uma função chamada ``_on_Jogador_body_entered`` no script do jogador. Esta função será chamada sempre que o sinal for emitido - ela *trata* do sinal.
ru: Обратите внимание, что наш пользовательский сигнал "hit" там также есть! Поскольку наши противники будут узлами ``RigidBody2D``, нам нужен сигнал ``body_entered(body: Node)``. Он будет отправляться при контакте тела (body) с игроком. Нажмите "Присоединить..." - появится окно "Подключить сигнал к методу". Нам не нужно изменять какие-либо из этих настроек, поэтому еще раз нажмите "Присоединить". Godot автоматически создаст функцию в скрипте вашего игрока.
uk: Зверніть увагу, що наш користувацький сигнал "hit" там також присутнiй! Оскільки наші противники будуть вузлами `` RigidBody2D``, нам потрібен сигнал ``body_entered(body: Node)``. Цей сигнал буде викликатися, коли тіло (body) контактує з гравцем. Натисніть "Підключити.." i з'явится вікно "Підключити сигнал". Нам не потрібно змінювати будь-які з цих налаштувань, тож знову натиснiть "Підключити". Godot автоматично створить функцію у скрипті вашого гравця.
zh_tw: 可以看到我們自定的「hit」訊號出現在這裡了！由於敵人使用 ``RigidBody2D`` 節點，所以我們會需要 ``body_entered(body: Node)`` 訊號。這個訊號會在敵人的形體 (Body) 接觸到玩家時送出。點擊 [連接...] 後會出現「連接訊號」視窗。我們先不動這裡的設定，點擊 [連接]。Godot 會自動在玩家腳本內建立一個函式。

source: Note the green icon indicating that a signal is connected to this function. Add this code to the function:
cs: Všimněte si zelené ikony označující, že signál je připojen k této funkci. Přidejte následující kód do funkce:
de: Beachten Sie das grüne Symbol, was anzeigt, dass das Signal mit dieser Funktion verbunden ist. Fügen Sie diesen Code zu der Funktion hinzu:
es: Nota el icono verde indicando que una señal es conectada a esta función. Agrega este código a la función:
fr: Notez l'icône verte indiquant qu'un signal est connecté à cette fonction. Ajoutez ce code à la fonction :
it: Notare l'icona verde che indica che a questa funzione è collegato un segnale. Aggiungere questo codice alla funzione:
ja: 信号がこの関数に接続されていることを示す緑色のアイコンに注意してください。次のコードを関数に追加します:
ko: 시그널이 이 기능에 연결되었음을 나타내는 녹색 아이콘에 유의하세요. 다음 코드를 함수에 추가하세요:
pt_br: Note que o icone verde indica que um sinal está conectado a esta função. Adicione esse código à função:
ru: Обратите внимание на зеленый значок, указывающий на то, что сигнал подключен к этой функции. Добавьте этот код в функцию:
uk: Зверніть увагу на зелений значок, який вказує на те, що сигнал підключений до цієї функції. Додайте цей код до функції:
zh_tw: 可以注意到，出現了一個綠色圖示。這個圖示代表有訊號連到這個函式上。將這段程式碼加到函式中：

source: Each time an enemy hits the player, the signal is going to be emitted. We need to disable the player's collision so that we don't trigger the ``hit`` signal more than once.
cs: Pokaždé, když hráče zasáhne nepřítel, bude vyslán signál. Musíme pak vypnout kolizi hráče, abychom nespustili signál „hit“ více než jednou.
de: Jedes Mal, wenn ein Feind den Spieler trifft, wird das Signal ausgesendet. Wir müssen die Kollision des Spielers deaktivieren, damit das ``Treffer``-Signal nicht mehr als einmal ausgelöst wird.
es: Cada vez que un enemigo golpea al jugador, la señal será emitida. Necesitamos deshabilitar la colisión del jugador para que no activemos la señal de ``hit`` más de una vez.
fr: Chaque fois qu'un ennemi frappe le joueur, le signal sera émis. Nous devons désactiver la collision du joueur afin de ne pas déclencher le signal ``hit`` plus d'une fois.
it: Ogni volta che un nemico colpirà il giocatore, il segnale verrà emesso. Bisogna disabilitare la collisione del giocatore per non innescare il segnale ``hit`` più di una volta.
ja: 敵がプレイヤーに当たるたびに、シグナルが発せられます。プレイヤーの衝突を無効にして、 ``hit`` シグナルを複数回トリガーしないようにする必要があります。
ko: 적이 플레이어에 충돌할 때마다 시그널이 방출됩니다. 우리는 두 번 이상 ``hit`` 시그널이 발동되지 않도록 플레이어의 콜리전을 비활성화 해야 합니다.
pt_br: Cada vez que um inimigo atinge o jogador, o sinal será emitido. Precisamos desativar a colisão do jogador para que não acione o sinal ``hit`` mais de uma vez.
ru: Каждый раз, когда противник ударяет игрока, будет посылаться сигнал. Нам нужно отключить столкновение игрока, чтобы не вызывать сигнал ``hit`` более одного раза.
uk: Кожен раз, коли ворог б’є гравця, буде випромінюватися сигнал. Нам потрібно відключити зіткнення гравця, щоб ми не запускали сигнал ``hit`` більше одного разу.
zh_cn: 每次敌人击中 ``Player`` 时，都会发出信号。我们需要禁用 ``Player`` 的碰撞，以便我们不会多次触发 ``hit`` 信号。
zh_tw: 每當敵人碰撞到玩家後都會送出這個訊號。這時我們需要關閉玩家的碰撞偵測，這樣才不會觸發超過一次的 ``hit`` 訊號。

source: Disabling the area's collision shape can cause an error if it happens in the middle of the engine's collision processing. Using ``set_deferred()`` tells Godot to wait to disable the shape until it's safe to do so.
cs: Zakázání kolizního tvaru uzlu může způsobit chybu, pokud k tomu dojde uprostřed zpracovávání kolize enginem. Pomocí ``set_deferred()`` řekneme Godotovi, aby počkal, s vypnutím kolizního tvaru, dokud to nebude bezpečné.
de: Das Deaktivieren der Kollisionsform während der Kollisionsberechnung der Engine kann einen Fehler auslösen. Die Verwendung von ``set_deferred()`` weist Godot an, mit dem Deaktivieren der Form bis zu einem sicheren Zeitpunkt zu warten.
es: Desactivar la forma de colisión del nodo Area puede causar un error si ocurre en medio del procesado de colisiones del motor. El uso de ``set_deferred()`` nos permite hacer que Godot espere para desactivar la forma hasta que sea seguro hacerlo.
fr: Désactiver la forme de la zone de collision peut provoquer une erreur si cela se produit pendant le traitement des collisions par le moteur. L'utilisation de ``set_deferred()`` indique à Godot d'attendre pour désactiver la forme jusqu'à ce que l'on puisse le faire en toute sécurité.
it: Disabilitare la forma di collisione dell'area può causare un errore se si usa mentre il motore sta elaborando le collisioni. Usando ```set_deferred()`` si dice a Godot di aspettare a disabilitare la forma di collisione, fino a quando non è sicuro farlo.
ja: エリアのコリジョン形状を無効にすると、それがエンジンの衝突処理の途中だったときにエラーが発生する可能性があります。 ``set_deferred()`` を使用すると、安全にシェイプを無効にできるようになるまでGodotを待機させることができます。
ko: 엔진의 충돌 처리 도중에 영역의 콜리전 모양을 비활성화하면 오류가 발생할 수 있습니다. ``set_deferred()``\ 를 사용하면 Godot가 모양을 비활성화 하기에 안전해질 때까지 기다려줍니다.
pt_br: Desativar o formato de colisão da área pode causar um erro se ocorrer no meio do processamento de colisão da engine. Usando ``set_deferred ()`` nos permite que o Godot aguarde para desabilitar a forma até que seja seguro fazê-lo.
ru: Отключение формы области столкновения может привести к ошибке, если это происходит во время обработки движком столкновений. Использование ``set_deferred()`` говорит Godot ждать отключения этой формы, пока это не будет безопасно.
uk: Відключення області зіткнення може призвести до помилки, якщо це станеться під час опрацювання редактором зіткнень. Використання ``set_deferred()`` говорить Godot почекати, і вимкнути область, коли це буде безпечно.
zh_tw: 如果在引擎處理碰撞過程中間禁用碰撞區域可能會發生錯誤。所以我們需要使用 ``set_deferred()`` 來讓 Godot 等到能安全禁用碰撞區域後再禁用。

source: The last piece is to add a function we can call to reset the player when starting a new game.
cs: Posledním kusem je přidání funkce, kterou můžeme nazvat resetem hráče při spuštění nové hry.
de: Das letzte was wir tun müssen ist eine Funktion hinzuzufügen, die wir aufrufen können, um den Spieler beim erneuten Start des Spiels zurückzusetzen.
es: Lo último será agregar una función que llamaremos para reiniciarlo cuando comenzamos un juego nuevo.
fr: La dernière étape consiste à ajouter une fonction que nous pouvons appeler pour réinitialiser le joueur au début d'une nouvelle partie.
it: L'ultimo pezzo è aggiungere una funzione che chiamiamo per resettare il player quando inizia una nuova partita.
ja: 最後のピースとなるのは、新しいゲームの開始時にPlayerをリセットするため、呼び出す関数を追加することです。
ko: 마지막으로 새로운 게임을 시작할 때 플레이어를 초기화하기 위해 호출할 수 있는 함수를 추가합니다.
pt_br: A última peça para nosso jogador é adicionar uma função que possamos chamar para reiniciar o jogador para começarmos um novo jogo.
ru: Последняя деталь - добавить функцию, которую мы можем вызвать для перезагрузки игрока при запуске новой игры.
uk: Остання деталь, яку треба додати це функція, яку ми можемо викликати для появи гравця при запуску нової гри.
zh_cn: 最后再为``Player``添加一个函数，用于在开始新游戏时调用来重置 ``Player`` 。
zh_tw: 最後我們要做的，就是新增一個函式，用來在開始新遊戲時重設玩家。

source: Enemy scene
cs: Scéna Nepřítel
de: Feind-Szene
es: Escena del enemigo
fr: Scène de l'ennemi
it: Scena del nemico
ja: Enemyシーン
ko: 적 씬
pt_br: Cena do inimigo
ru: Сцена Врага
uk: Сцена ворога
zh_cn: ``Enemy`` 场景
zh_tw: Enemy (敵人) 場景

source: Now it's time to make the enemies our player will have to dodge. Their behavior will not be very complex: mobs will spawn randomly at the edges of the screen, choose a random direction, and move in a straight line.
cs: Nyní je čas, vytvořit nepřátele, kterým se náš hráč bude muset vyhnout. Jejich chování nebude příliš složité: náhodně se vynoří na okrajích obrazovky, vyberou náhodný směr a budou se dál pohybovat po přímce.
de: Jetzt ist es an der Zeit die Feinde zu erstellen, denen der Spieler ausweichen muss. Ihr Verhalten wird nicht allzu komplex sein: Gegner werden zufällig an den Rändern des Bildschirms erscheinen und sich in einer zufälligen Richtung in einer geraden Linie fortbewegen, um danach geradeaus weiterzugehen.
es: Es momento de hacer los enemigos que nuestro jugador tendrá que evitar. Su comportamiento no será muy complejo: los enemigos aparecerán al azar en los bordes de la pantalla y se moverán en una dirección al azar en línea recta.
fr: Il est temps maintenant de créer des ennemis que notre joueur devra esquiver. Leur comportement ne sera pas très complexe : des monstres vont apparaître au hasard aux bords de l'écran et se déplacer dans une direction aléatoire en ligne droite, puis disparaître lorsqu'ils sortent de l'écran.
it: Ora è il momento di creare i nemici che il nostro giocatore dovrà schivare. Il loro comportamento non sarà molto complesso: i mob saranno generati in modo casuale ai bordi dello schermo, sceglieranno una direzione casuale e si muoveranno in linea retta.
ja: 次はプレイヤーが避けるべき敵を作りましょう。敵の行動はあまり複雑ではありません。モブは画面の端でランダムに生まれると、ランダムな方向を選び、一直線に進みます。
ko: 이제 우리의 플레이어가 피할 몹을 만들 차례입니다. 이들의 행동은 그리 복잡하진 않을 것입니다: 몹이 아무렇게나 화면의 가장자리에서 나타나고 무작위 방향을 선택해 직선으로 이동합니다.
pt_br: Agora é hora de criarmos os inimigos que nosso jogador terá que se desviar. Seu comportamento não será tão complexo: inimigos irão nascer aleatoriamente nos cantos da tela e irão se mover em uma direção também aleatória, só que em linha reta, para, então desaparecerem ao sair da tela.
ru: Теперь пришло время сделать врагов, от которых нашему игроку предстоит уклоняться. Их поведение будет не очень сложным: толпы (мобы) будут появляться случайно по краям экрана, выбирать случайное направление и двигаться по прямой линии.
uk: Тепер настав час зробити ворогів, від яких гравцеві доведеться ухилятися. Їх поведінка буде не дуже складною: вони будуть час від часу виникати по краях екрана і рухатися у випадковому напрямку по прямій лінії.
zh_tw: 是時候來做一些讓玩家閃躲的敵人了。這些敵人的行為不會很複雜：怪物會隨機在螢幕的邊緣產生，接著隨機選一個方向來直線移動。

source: We'll create a ``Mob`` scene, which we can then *instance* to create any number of independent mobs in the game.
cs: Vytvoříme scénu ``Mob``, pomocí jejích *instancí* pak stvoříme ve hře libovolný počet nezávislých nepřátel.
de: Wir werden dies in eine ``Mob``-Szene einbauen, die wir dann *instanziieren* um beliebig viele unabhängige Gegner im Spiel erstellen zu können.
es: Crearemos una escena ``Mob``, la que podremos *instanciar* para crear cualquier número independiente de enemigos en el juego.
fr: Nous allons créer une scène ``Mob``, que nous pouvons ensuite *instancier* pour créer un nombre quelconque de monstres indépendants dans le jeu.
it: Creeremo una scena ``Mob``, che possiamo poi *istanziare* per creare un qualsiasi numero di mob indipendenti nel gioco.
ja: これから ``Mob`` シーンを作り、それを\ *インスタンス化*\ して、ゲーム内に任意の数の独立したモブを作成します。
ko: 먼저 ``Mob`` 장면을 생성할 것입니다. 그런 다음 *인스턴스화*\ 해서 게임에서 원하는 수의 독립적인 몹을 생성할 수 있습니다.
pt_br: Nós iremos construir isso em uma cena ``Inimigo``, que poderemos então *instanciar* para criar uma quantidade de inimigos independentes no jogo.
ru: Мы создадим сцену ``Mob``, которую затем сможем *инстанцировать*, чтобы создать любое количество независимых мобов в игре.
uk: Ми створимо сцену ``Mob``, яку ми зможемо потім використати, для створення будь-якої кількості незалежних мобів в грі.
zh_tw: 我們來建立一個 ``Mob`` (怪物) 場景，我們利用這個場景來在遊戲中 **實體化** 多個獨立的怪物。
