Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Once you've done this on the ``ScoreLabel``, you can click the down arrow next to the DynamicFont property and choose "Copy", then "Paste" it in the same place on the other two Control nodes.
cs: Jakmile to uděláte v ``ScoreLabel``, můžete kliknout na šipku dolů vedle vlastnosti DynamicFont a zvolit "Kopírovat", pak "Vložit" na stejné místo na ostatních dvou řídících uzlech.
de: Sobald Sie das auf dem ``ScoreLabel`` erledigt haben, können Sie den Pfeil nach unten drücken neben der DynamicFont-Eigenschaft und wählen "Kopieren", dann "Einfügen" in den gleichen Ort bei den anderen zwei Control-Nodes.
es: Una vez que haz hecho esto en ``ScoreLabel``, puedes hacer clic en la flecha junto a la propiedad DynamicFont y seleccionar "Copiar", luego "Pegar" en el mismo lugar en los otros dos nodos Control.
fr: Une fois que vous avez fait cela sur le ``ScoreLabel``, vous pouvez cliquer sur la flèche vers le bas à côté de la propriété DynamicFont et choisir "Copier", puis "Coller" au même endroit sur les deux autres nœuds Control.
it: Una volta fatto questo sul ``ScoreLabel``, è possibile fare clic sulla freccia rivolta verso il basso accanto alla proprietà DynamicFont e scegliere "Copia", quindi "Incolla" nello stesso punto degli altri due nodi Controllo.
ja: これを ``ScoreLabel`` で行ったら、DynamicFont プロパティの横にある下向き矢印をクリックして「コピー」を選択し、他の２つのコントロールノードの同じ場所に「ペースト」してください。
ko: ``ScoreLabel``\ 에서 이 작업을 수행하고 나면 DynamicFont 속성 옆에 있는 아래쪽 화살표를 클릭하고 "복사(Copy)"를 선택한 다음 다른 두 Control 노드의 같은 위치에 "붙여넣기(Paste)"를 할 수 있습니다.
pt_br: Depois de fazer isso no `` ScoreLabel``, você pode clicar na seta para baixo ao lado da propriedade DynamicFont e escolher "Copiar", depois "Colar" no mesmo local que os outros dois nós de Controle.
ru: Как только вы проделали это с ``ScoreLabel``, можете нажать стрелку вниз рядом со свойством DynamicFont и выбрать "Копировать", а затем "Вставить" его в том же месте на двух других узлах Control.
uk: Зробивши це зі ``ScoreLabel`` ви можете натиснути стрілку вниз поряд з властивістю DynamicFont і вибрати "Копіювати", а потім "Вставити" його в тому ж місці на других вузлах Control.
zh_cn: 在“ ScoreLabel”上完成此操作后，可以单击DynamicFont属性旁边的向下箭头，然后选择“复制”，然后将其“粘贴”到其他两个Control节点的相同位置。
zh_tw: 完成 ``ScoreLabel`` 的設定後，點擊 DynamicFont 屬性旁邊的下拉箭頭，並選擇「Copy」（複製），接著在另外兩個 Control 節點上相同的地方「Paste」（貼上）。

source: **Anchors and Margins:** ``Control`` nodes have a position and size, but they also have anchors and margins. Anchors define the origin - the reference point for the edges of the node. Margins update automatically when you move or resize a control node. They represent the distance from the control node's edges to its anchor. See :ref:`doc_design_interfaces_with_the_control_nodes` for more details.
cs: **Kotvy (Anchors) a okraje(Margins):** Uzly ``Control`` mají polohu a velikost, ale mají také kotvy a okraje. Kotvy definují počátek - referenční bod pro okraje uzlu. Okraje se aktualizují automaticky, když přesunete nebo změníte velikost řídicího uzlu. Představují vzdálenost od okrajů řídicího uzlu k jeho kotvě. Viz :ref:`doc_design_interfaces_with_the_control_nodes` pro více informací.
de: **Anker und Ränder:** ``Control``-Nodes haben eine Position und Größe, aber sie haben auch Anker und Ränder. Anker definieren den Ursprung - den Bezugspunkt für die Kanten des Nodes. Die Ränder werden automatisch aktualisiert, wenn Sie einen Control-Node verschieben oder in der Größe ändern. Sie stellen den Abstand von den Kanten des Control-Nodes zu seinem Anker dar. Siehe :ref:`doc_design_interfaces_with_the_control_nodes` für weitere Details.
es: **Anclas y Márgenes:** Nodos ``Control`` tienen posición y tamaño, pero también tienen anclas (anchor) y márgenes (margin). Anclas definen el origin - El punto de referencia para los bordes del nodo. Los márgenes se actualizan automaticamente cuando cambias el tamaño de un nodo Control. Representan la distancia del borde al ancla del nodo Control. Para más detalles, ver :ref:`doc_design_interfaces_with_the_control_nodes`.
fr: **Ancres et marges :** Les nœuds ``Control`` ont une position et une taille, mais ils ont aussi des ancres et des marges. Les ancres définissent l'origine - le point de référence pour les bords du nœud. Les marges se mettent à jour automatiquement lorsque vous déplacez ou redimensionnez un nœud control. Ils représentent la distance entre les bords du nœud control et son ancrage. Voir :ref:`doc_design_interfaces_with_the_control_nodes` pour plus de détails.
it: I nodi "Ancoraggi e Margini": "Controllo" hanno una posizione e una dimensione, ma hanno anche ancoraggi e margini. Gli ancoraggi definiscono l'origine, ovvero il punto di riferimento per gli spigoli del nodo. I margini si aggiornano automaticamente quando si sposta o si ridimensiona un nodo di controllo. Rappresentano la distanza dai bordi del nodo di controllo all'ancoraggio. Vedere :ref:'doc_design_interfaces_with_the_control_nodes' per ulteriori dettagli.
ja: **アンカーとマージン**\ : ``Control`` ノードには、位置とサイズがありますが、アンカーとマージンもあります。アンカーによって、原点 (節点のエッジの参照点) が定義されます。余白は、コントロールノードを移動またはサイズ変更すると自動的に更新されます。コントロールノードのエッジからアンカーまでの距離を表します。詳細は\ :ref:`doc_design_interfaces_with_the_control_nodes`\ を参照してください。
ko: **앵커(Anchors)와 마진(Margins):** ``Control`` 노드는 위치와 크기를 가지고 있고, 앵커와 마진 또한 가지고 있습니다. 앵커는 노드의 가장자리에 대한 참조점인 원점을 정의합니다. 마진은 컨트롤 노드를 움직이거나 크기를 조정할 때 자동으로 업데이트됩니다. 마진은 컨트롤 노드들의 모서리가 앵커로부터 얼마나 떨어져 있는 지를 나타냅니다. 더 자세한 설명은 :ref:`doc_design_interfaces_with_the_control_nodes`\ 를 참고하세요.
pl: **Kotwice i marginesy:** Węzły ``Control`` mają położenie i wielkość, ale także kotwice i margiesy. Kotwice określają początek - punkt odniesienia dla krawędzi węzła. Marginesy są aktualizowane automatycznie po przesunięciu lub zmianie rozmiaru węzła control. Przedstawiają one odległość od krawędzi węzła control do jego punktu zakotwiczenia. Więcej informacji na ten temat można znaleźć w temacie :ref:`doc_design_interfaces_with_the_control_nodes`.
pt_br: **Âncoras e Margens:** Nós ``Control`` têm uma posição e um tamanho, mas eles também têm âncoras e margens. Âncoras definem a origem – o ponto de referência para as bordas do nó. Margens atualizam automaticamente quando você move ou redimensiona um nó de controle. Elas representam a distância das bordas do nó Control até sua âncora. Veja :ref:`doc_design_interfaces_with_the_control_nodes` para mais detalhes.
ru: **Якоря и Отступы:** Узлы ``Control`` имеют не только положение и размер, но также якоря и отступы. Якоря определяют начало координат - опорную точку для краев узла. Отступы обновляются автоматически при перемещении или изменении размера узла управления. Они представляют расстояние от краев ``Control``-узла до его якоря. См. :ref:`doc_design_interfaces_with_the_control_nodes` для получения более подробной информации.
uk: **Прив'язки та поля:** вузли ``Control`` (контрольні) мають положення та розмір, але вони також мають прив'язки (якорі) та поля. Прив'язки визначають початок координат - опорну точку для країв вузла. Поля оновлюються автоматично під час переміщення, чи зміни розміру, контрольного вузла. Вони представляють відстань від країв контрольного вузла до його прив'язки. Детальнішу інформацію дивіться :ref:`doc_design_interfaces_with_the_control_nodes`.
zh_cn: **锚点和边距**： ``Control`` 节点不仅有位置和大小，也有锚点和边距。锚点定义了原点——节点边缘的参考点。当您移动或调整 ``Control`` 节点大小时，边距会自动更新。它们表示从 ``Control`` 节点的边缘到其锚点的距离。详情请参阅 :ref:`doc_design_interfaces_with_the_control_nodes` 。
zh_tw: **錨點與外邊距：** ``Control`` 節點除了位置與大小之外，也可以設定錨點 (Anchor) 與外邊距 (Margin)。錨點定義原點（相對於節點邊緣的參考點）。外邊距則會在移動或縮放 Control 節點時自動更新。這兩個屬性的變化會反映出 Control 節點到錨點的距離。詳細說明請參考 :ref:`doc_design_interfaces_with_the_control_nodes` 。

source: Arrange the nodes as shown below. Click the "Layout" button to set a Control node's layout:
cs: Uspořádejte uzly podle obrázku níže. Kliknutím na tlačítko "Rozložení" nastavíte rozvržení řídicího uzlu:
de: Ordnen Sie die Nodes wie unten gezeigt an. Klicken Sie auf den "Layout"-Knopf, um das Layout eines Control-Nodes festzulegen:
es: Organiza los nodos como se muestra a continuación. Haz clic en el botón "Layout" para establecer la disposición de un nodo de Control:
fr: Disposez les nœuds comme indiqué ci-dessous. Cliquez sur le bouton "Layout" pour définir la disposition d'un nœud de contrôle :
it: Disponi i nodi come illustrato di seguito. Fare clic sul pulsante "Layout" per impostare l'ancoraggio di un nodo Control:
ja: 以下に示すようにノードを配置します。「レイアウト」ボタンをクリックして、コントロールノードのレイアウトを設定します:
ko: 아래에 보이는 대로 노드를 배열하세요. "레이아웃(Layout)" 버튼을 클릭해서 Control 노드의 레이아웃을 설정하세요:
pt_br: Organize os nós conforme indicado abaixo. Clique no botão "Disposição (Layout)" para definir a disposição de um nó de controle:
ru: Организуйте узлы, как показано ниже. Нажмите кнопку "Макет", чтобы задать макет для узла Control:
uk: Впорядкуйте вузли, як показано нижче. Натисніть кнопку "Макет", щоб встановити макет вузла керування:
zh_cn: 按如下图所示排列节点。点击“布局”按钮以设置 一个Control 节点的布局：
zh_tw: 依照下圖排列節點。點擊「畫面配置」按鈕來設定 Control 節點的配置：

source: You can drag the nodes to place them manually, or for more precise placement, use the following settings:
cs: Uzly můžete přetáhnout a umístit je ručně, nebo pro přesnější umístění použijte následující nastavení:
de: Sie können die Nodes manuell verschieben um sie zu platzieren oder verwenden Sie die folgenden Einstellungen für eine genauere Platzierung:
es: Puedes arrastrar y ubicarlos manualmente o, para un modo más preciso, usa la siguiente configuración:
fr: Vous pouvez faire glisser les nœuds pour les placer manuellement ou, pour un placement plus précis, utiliser les paramètres suivants :
it: È possibile trascinare i nodi per posizionarli manualmente o, per un posizionamento più preciso, utilizzare le seguenti impostazioni:
ja: ノードをドラッグして手動で配置したり、より正確な配置を行うには、次の設定を使用します:
ko: 여러분은 노드를 드래그해서 수동으로 놓을 수도 있지만 더 정확하게 하고 싶다면 다음 설정을 사용하세요:
pl: Węzły można przeciągnąć ręcznie lub, aby uzyskać bardziej precyzyjne rozmieszczenie, należy użyć następujących ustawień:
pt_br: Você pode arrastar os nós para colocá-los manualmente ou, para um posicionamento mais preciso, usar as seguintes configurações:
ru: Вы можете перетаскивать узлы, размещая их вручную, либо используйте следующие параметры для более точного размещения:
uk: Ви можете перетягнути вузли, щоб розмістити їх вручну, або, для більш точного розміщення, скористайтеся такими налаштуваннями:
zh_cn: 您可以拖动节点以手动放置它们，或者要进行更精确的放置，请使用以下设置：
zh_tw: 可以拖移節點來手動排列，或是使用下列設定來更精確地排放：

source: ScoreLabel
de: ScoreLabel (HighScore)
uk: ScoreLabel (Мітка рахунку)

source: *Layout* : "Top Wide"
de: *Layout* : "Oben groß"
fr: *Layout* / *Disposition sur l'écran* : "Top Wide"
ko: *레이아웃(Layout)* : "위쪽 넓게(Top Wide)"
ru: *Макет* : "Сверху по всей ширине"
uk: *Макет* : "Згори за шириною"
zh_cn: *布局*： "顶部宽度"
zh_tw: **畫面配置** ：「上延伸」

source: *Align* : "Center"
it: *Allinea*: "Centro"
pt_br: *Alinhamento* : "Centralizado"
uk: *Align* (вирівнювання): "Center"
zh_cn: *对齐*： "居中"

source: Message
cs: Zpráva
de: Nachricht
it: Messaggio
pt_br: MessageLabel
uk: Message (Повідомлення)

source: *Layout* : "HCenter Wide"
cs: *Rozložení*: "HCenter Wide"
de: *Layout* : "HCenter groß"
es: *Disposición* : "HCenter Wide"
fr: *Layout* / *Disposition sur l'écran* : "HCenter Wide"
ko: *레이아웃(Layout)* : "수평선 중앙 넓게(HCenter Wide)"
pt_br: *Layout* : "Center" (Centro)
ru: *Макет*: "По центру по всей ширине"
uk: *Макет* : "Гор. за центром за шириною"
zh_cn: *布局*： "水平中心宽"
zh_tw: **畫面配置** ：「水平中央延長」

source: *Text* : ``Dodge the Creeps!``
it: * Testo *: `` Dodge the Creeps! ``
pt_br: *Text*: ``Desvie dos Bichos!``
ru: *Text*: ``Уворачивайся от крипов!``
uk: *Text* : ``Dodge the Creeps!`` (``Ухились від крипів!``)
zh_cn: *文本*： ``Dodge the Creeps!``

source: *Autowrap* : "On"
de: *Autowrap* : "An"
es: *Envoltura Automatica* : "Encendida"
pt_br: *Autowrap* : "Ativo"
ru: *Autowrap* : "Вкл"
uk: *Autowrap* (Авто-згортання) : "Увімкнено"
zh_cn: *自动换行*：“开”
zh_tw: **Autostrap** ： 「開啟」

source: StartButton
de: StartButton (Startknopf)
uk: StartButton (Кнопка Старту)

source: *Text* : ``Start``
it: *Testo* : ``Start``
pt_br: Text: ``Iniciar``
ru: *Text* : ``Старт``
uk: *Text* : ``Start`` (``Старт``)
zh_cn: *文本*： ``Start``

source: *Layout* : "Center Bottom"
de: *Layout* : "Mitte unten"
es: *Disposición* : "Center Bottom"
fr: *Layout* / *Disposition sur l'écran* : "Center Bottom"
ko: *레이아웃(Layout)* : "아래쪽 중앙(Center Bottom)"
ru: *Макет*: "Внизу посередине"
uk: *Макет* : "За центром внизу "
zh_cn: *布局*： "中心底部"
zh_tw: **畫面配置** ：「中下」

source: *Margin* :
it: *Margine* :
pt_br: Margem (Margin) :
uk: *Margin* (Поле) :
zh_cn: *边距*：

source: Top: ``-200``
it: In alto: ``-200``
pl: Góra: ``-200``
uk: Top (зверху): ``-200``
zh_cn: 顶部： ``-200``

source: Bottom: ``-100``
it: In basso: ``-100``
pl: Dół: ``-100``
pt_br: Inferior: ``-100``
uk: Bottom (Знизу): ``-100``
zh_cn: 底部： ``-100``

source: On the ``MessageTimer``, set the ``Wait Time`` to ``2`` and set the ``One Shot`` property to "On".
cs: V ``MessageTimer`` nastavte ``Wait Time`` na ``2`` a nastavte vlastnost ``One Shot`` na ``On``.
de: Stellen Sie im ``MessageTimer`` die ``Wait Time`` auf ``2`` und stellen Sie die ``One Shot`` Eigenschaft auf "An".
es: En el ``MessageTimer``, ajusta el ``Wait Time`` en ``2`` y la propiedad ``One Shot`` en "Activado".
fr: Sur le ``MessageTimer``, mettez le ``Wait Time`` à ``2`` et mettez la propriété ``One Shot`` à "On".
it: Sul ``MessageTimer``, imposta ``Tempo d'attesa`` su ``2`` e imposta la proprietà ``One Shot`` su "On".
ja: ``MessageTimer`` 上で、\ ``Wait Time`` を ``2`` に設定し、\ ``One Shot`` プロパティを「On」に設定してください。
ko: ``MessageTimer``\ 에서 ``Wait Time``\ 을 ``2``\ 로 설정하고 ``One Shot`` 속성을 "사용(On)"으로 설정합니다.
pt_br: No ``MessageTimer``, defina o ``Wait Time`` (Tempo de Espera) para ``2`` e configure a propriedade ``One Shot`` (Apenas uma Vez) como "Ativo".
ru: В ``MessageTimer`` установите параметр ``Wait Time`` на ``2``, а параметр ``One Shot`` на значение "Вкл".
uk: На ``MessageTimer``, встановіть ``Wait Time`` (Час затримки) на ``2`` і встановіть властивість ``One Shot`` на "Увімкнено".
zh_tw: 將 ``MessageTimer`` 的 ``Wait Time`` 設為 ``2`` ，將 ``One Shot`` 設為「開啟」。

source: Now add this script to ``HUD``:
cs: Nyní přidejte tento skript do ``HUD``:
de: Fügen Sie nun dieses Skript zu ``HUD`` hinzu:
es: Ahora agrega este script a ``HUD``:
fr: Ajoutez à présent ce script au ``HUD`` :
it: Ora aggiungi questo script a ''HUD'':
ja: 次に、このスクリプトを ``HUD`` に追加します:
ko: 이제 ``HUD``\ 에 이 스크립트를 추가하세요:
pl: Teraz dodaj ten skrypt do ``HUD``:
pt_br: Agora, adicione este script ao ``HUD``:
ru: Теперь добавьте этот скрипт в ``HUD``:
uk: Тепер додайте скрипт до ``HUD``:
zh_cn: 现将这个脚本添加到 ``HUD``：
zh_tw: 現在將這個腳本新增至 ``HUD`` ：

source: The ``start_game`` signal tells the ``Main`` node that the button has been pressed.
cs: Signál ``start_game`` oznamuje uzlu ``Main``, že bylo tlačítko stisknuto.
de: Das Signal ``start_game`` signalisiert dem Node ``Main``, dass die Taste gedrückt wurde.
es: La señal ``start_game`` dirá al nodo ``Main`` que se ha presionado un botón.
fr: Le signal ``start_game`` indique au nœud ``Main`` que le bouton a été pressé.
it: Il segnale ''start_game'' indica al nodo ''Main'' che il pulsante è stato premuto.
ja: ``start_game`` シグナルは、ボタンが押されたことを ``Main`` ノードに通知します。
ko: ``start_game`` 시그널은 ``Main`` 노드에게 버튼이 눌려졌음을 알립니다.
pl: Sygnał ``start_game`` informuje węzeł ``Main`` o naciśnięciu przycisku.
pt_br: O sinal ``start_game`` diz ao nó ``Main`` que o botão foi pressionado.
ru: Сигнал ``start_game`` сообщает узлу ``Main``, что кнопка была нажата.
uk: Сигнал ``start_game`` вказує вузлу ``Main``, що кнопка була натиснута.
zh_cn: ``start_game`` 信号通知 ``Main`` 节点，按钮已经被按下。
zh_tw: ``start_game`` 訊號會告訴 ``Main`` 節點按鈕被按下。

source: This function is called when we want to display a message temporarily, such as "Get Ready".
cs: Tato funkce se volá, když chceme dočasně zobrazit zprávu, například „Připravte se“.
de: Diese Funktion wird aufgerufen, wenn wir eine Nachricht vorübergehend anzeigen möchten, z.B. "Get Ready".
es: Esta función se llamará cuando queramos mostrar un mensaje temporalmente, como "Get Ready".
fr: Cette fonction est appelée lorsque nous voulons afficher temporairement un message, tel que "Get Ready".
it: Questa funzione è chiamata quando si desidera visualizzare temporaneamente un messaggio, ad esempio "Get Ready".
ja: この関数は、「Get Ready」などのメッセージを一時的に表示させたい場合に呼び出されます。
ko: 이 함수는 "Get Ready"와 같은 메시지를 일시적으로 표시하고 싶을 때 호출됩니다.
pt_br: Esta função é chamada quando queremos mostrar uma mensagem temporariamente, como a "Prepare-se".
ru: Эта функция вызывается, когда мы хотим временно отобразить сообщение, такое как "Приготовьтесь".
uk: Ця функція буде викликатися тоді, коли ми хочемо показати повідомлення тимчасово, наприклад, "Приготуйся".
zh_tw: 當我們想要暫時顯示訊息（如「Get Ready」）時可以呼叫這個函式。

source: This function is called when the player loses. It will show "Game Over" for 2 seconds, then return to the title screen and, after a brief pause, show the "Start" button.
cs: Tato funkce se volá, když hráč prohraje. Na 2 sekundy se zobrazí „Game Over“, poté se vratíme na titulní obrazovku a po krátké pauze se zobrazí tlačítko „Start“.
de: Diese Funktion wird aufgerufen, wenn der Spieler verliert. "Game Over" wird für 2 Sekunden angezeigt und wechselt dann zum Titelbildschirm. Nach einer kurzen Pause wird die "Start"-Schaltfläche angezeigt.
es: Esta función se llamará cuando el jugador pierde. Mostrará "Game Over" durante 2 segundos, luego volverá a la pantalla de título y revelará el botón "Start".
fr: Cette fonction est appelée lorsque le joueur perd. Elle affichera "Game Over" pendant 2 secondes, puis reviendra à l'écran de titre et affichera le bouton "Start".
it: Questa funzione viene chiamata quando il giocatore perde. Mostra "Game Over" per 2 secondi, poi ritorna alla schermata del titolo e, dopo una breve pausa, mostra il pulsante "Start".
ja: この関数は、プレイヤーが負けたときに呼び出されます。 2秒間「Game Over」と表示され、タイトル画面に戻り、少し間を置いて「Start」ボタンが表示されます。
ko: 이 함수는 플레이어가 패배했을 때 호출됩니다. 이 함수는 2초동안 "Game Over"를 보여주고, 타이틀 화면으로 돌아와서, 잠깐 일시정지한 후 "Start" 버튼을 보여줍니다.
pt_br: Esta função é chamada quando o jogador perde. Ela mostrará "Game Over" por 2 segundos e depois retornará à tela de título após uma breve pausa e mostrará o botão "Iniciar".
ru: Эта функция вызывается, когда игрок проигрывает. Она покажет надпись "Game Over" на 2 секунды, затем произойдет возврат к основному экрану, и после короткой паузы появится кнопка "Start".
uk: Ця функція викликається, коли гравець програє. Вона показує напис "Game Over" протягом 2 секунд, потім повертає екран заголовка і, після короткої паузи, покаже кнопку "Старт".
zh_cn: 当 ``Player`` 输掉时调用这个函数。它将显示 ``Game Over`` 2秒，然后返回标题屏幕并显示 ``Start`` 按钮。
zh_tw: 當玩家輸了之後會呼叫這個函式。會在畫面上顯示 2 秒「Game Over」，然後回到標題畫面、暫停一下，最後顯示「Start」按鈕。

source: When you need to pause for a brief time, an alternative to using a Timer node is to use the SceneTree's ``create_timer()`` function. This can be very useful to add delays such as in the above code, where we want to wait some time before showing the "Start" button.
cs: Pokud potřebujete pozastavit na krátkou dobu, alternativou k použití uzlu Timer je použití funkce ``create_timer()`` třídy SceneTree. To může být velmi užitečné pro přidání zpoždění, jako například ve výše uvedeném kódu, kdy chceme počkat, než se zobrazí tlačítko „Start“.
de: Falls eine kurze Pause benötigt wird, kann als Alternative zum Timer-Node die Funktion ``create_timer()`` von SceneTree verwendet werden. Das kann sehr nützlich sein, um eine Verzögerung hinzuzufügen. Wie im obigen Code, wo wir ein wenig warten wollen, bevor der "Start"-Knopf angezeigt wird.
es: Cuando necesite hacer una pausa por un breve tiempo, una alternativa al uso de un nodo temporizador es usar la función ``create_timer()`` del árbol de escena. Esto puede ser muy útil para retrasar, como en el código anterior, donde queremos esperar un poco de tiempo antes de mostrar el botón "Start".
fr: Quand vous avez besoin d'une courte pause, une alternative à l'utilisation d'un nœud Timer est d'utiliser la fonction ``create_timer()`` de l'arborescence de scène. Ceci peut être très utile pour créer un délais, comme dans le code ci-dessus, où nous voulons attendre un peu avant de faire apparaître le bouton "Start".
it: Quando è necessario sospendere per un breve periodo di tempo, un'alternativa all'utilizzo di un nodo Timer consiste nell'utilizzare la funzione ``create_timer()`` di SceneTree. Questo può essere molto utile per ritardare, come nel codice sopra, dove vogliamo aspettare un po 'di tempo prima di mostrare il pulsante "Start".
ja: 短い間、一時停止する必要がある場合は、Timerノードを使用する代わりに、SceneTreeの ``create_timer()`` 関数を使用します。 これは、上記のコードのように、"Start" ボタンを表示する前に少し時間を置きたい場合など、遅延させるのに非常に役立ちます。
ko: 잠시 일시 정지를 해야 한다면 타이머 노드를 사용하는 대신 SceneTree의 ``create_timer()`` 함수를 사용하는 것이 좋습니다. 이 함수는 "Start" 버튼을 표시하기 전에 잠시 기다려야 하는 위의 코드와 같이 지연을 추가하는 데 매우 유용할 수 있습니다.
pt_br: Quando você precisa pausar por um breve tempo, uma alternativa ao do nó Timer é usar a função ``create_timer()`` do SceneTree. Isso pode ser muito útil para atrasar, como no código acima, onde queremos esperar um pouco de tempo antes de mostrar o botão "Iniciar".
ru: Если вам нужно сделать паузу на короткое время, то альтернативой использованию узла Timer является использование функции SceneTree ``create_timer()``. Может быть очень полезно добавлять задержки наподобие таких, как в вышеприведенном коде, где нам хотелось бы подождать немного времени, прежде чем показывать кнопку "Start".
uk: Коли вам потрібно зробити паузу на короткий час, альтернативою використанню вузла Timer є використання функції SceneTree (Дерева Сцени) ``create_timer()``. Це може бути дуже корисно для такої затримки, як, наприклад, у наведеному вище коді, де ми хочемо зачекати трохи часу, перш ніж показувати кнопку "Старт".
zh_tw: 需要暫停一下下的時候，除了使用 Timer 節點外也可以使用 SceneTree（場景樹）的 ``create_timer()`` 函式。當需要像上面的程式碼一樣新增一點延遲的時候很有用，上面的例子中我們用它來在顯示「Start」按鈕前增加一點點等待時間。

source: This function is called by ``Main`` whenever the score changes.
cs: Tatu funkci volá uzel ``Main``, kdykoli se skóre změní.
de: Diese Funktion wird von ``Main`` aufgerufen, wenn sich der Punktestand ändert.
es: Esta función será llamada por ``Main`` cada vez que el puntaje cambie.
fr: Cette fonction est appelée dans ``Main`` chaque fois que le score change.
it: Questa funzione viene chiamata da ''Main'' ogni volta che il punteggio cambia.
ja: この関数はスコアが変わるたびに ``Main`` によって呼び出されます。
ko: 이 함수는 점수가 변경될 때마다 ``Main``\ 에 의해서 호출됩니다.
pt_br: Esta função é chamada por ``Main``sempre que a pontuação for alterada.
ru: Эта функция вызывается из ``Main`` каждый раз, когда изменяется количество очков.
uk: Ця функція викликається ``Main`` щоразу, коли рахунок змінюється.
zh_cn: 每当分数改变，这个函数会被 ``Main`` 调用。
zh_tw: 這個函式會由 ``Main`` 在分數改動的時候呼叫。
