Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: The first scene will define the ``Player`` object. One of the benefits of creating a separate Player scene is that we can test it separately, even before we've created other parts of the game.
cs: První scéna, kterou vytvoříme, definuje objekt ``Player``. Jednou z výhod vytvoření samostatné hráčské scény je to, že ji můžeme testovat samostatně, dokonce ještě předtím, než vytvoříme další části hry.
de: Die erste erstellte Szene definiert das ``Player``-Objekt. Einer der Vorteile einer separaten Spieler-Szene ist, dass diese unabhängig vom Rest des Spiels getestet werden kann, bevor andere Teile des Spiels existieren müssen.
es: La primer escena define el objeto ``Player``. Uno de los beneficios de crear una escena aparte para el jugador es que se puede probar de manera separada, aún antes de haber creado otras partes del juego.
fr: La première scène définira l'objet ``Player``. L'un des avantages de la création d'une scène Player séparée est que nous pouvons la tester séparément, avant même d'avoir créé d'autres parties du jeu.
it: La prima scena definirà l'oggetto ``Player``. Uno dei vantaggi di creare una scena separata per il giocatore è che possiamo testarla separatamente, anche prima di aver creato altre parti del gioco.
ja: 最初のシーンでは、 ``Player`` オブジェクトを定義します。Player シーンを独立して作成する利点の 1 つは、たとえゲームの他の部分を作成する前であっても、個別にテストができることです。
ko: 첫 번째 씬은 ``Player`` 오브젝트를 정의합니다. 별도의 플레이어 씬을 만드는 것의 장점 중 하나는 게임의 다른 부분을 만들기 전에도 별도로 테스트할 수 있다는 것입니다.
uk: Перша сцена, яку ми зробимо, визначає об'єкт ``Player`` (Гравець) . Однією з переваг створення окремої сцени гравця є те, що ми можемо протестувати її окремо, ще до того, як створили інші частини гри.
zh_tw: 第一個場景，我們要來定義 ``Player`` 物件。把玩家做成獨立一個 Player 場景的好處是：就算遊戲其他部分還沒做好，也可以獨立測試單一場景。

source: Node structure
cs: Struktura uzlu
de: Node Struktur
es: Estructura de nodos
fr: Structure des nœuds
it: Struttura del nodo
ja: ノード構成
ko: 노드 구조
pt_br: Estrutura de nós
ru: Структура узла
uk: Структура вузлів
zh_cn: 节点结构
zh_tw: 節點結構

source: To begin, we need to choose a root node for the player object. As a general rule, a scene's root node should reflect the object's desired functionality - what the object *is*. Click the "Other Node" button and add an :ref:`Area2D <class_Area2D>` node to the scene.
cs: Nejprve musíme vybrat kořenový uzel pro objekt hráče. Obecně by kořen scény měl odrážet požadovanou funkčnost objektu - to čím objekt *je*. Klikněte na tlačítko "Jiný uzel" a do scény přidejte uzel :ref:`Area2D <class_Area2D>`.
de: Um zu beginnen, müssen wir einen Wurzel-Node für das Spieler-Objekt wählen. Als eine generelle Regel gilt, ein Wurzel-Node einer Szene sollte immer die gewünschte Funktionalität des Objektes reflektieren - was das Objekt *ist*. Klicken Sie auf den "Andere Node" - Knopf und fügen einen :ref:`Area2D <class_Area2D>` Node zu der Szene hinzu.
es: Para empezar, necesitamos elegir un nodo raíz para el objeto jugador. Como regla general, el nodo raíz de una escena debe reflejar la funcionalidad deseada del objeto - lo que el objeto *es*. Haz clic en el botón "Otro Nodo" y añade un nodo :ref:`Area2D <clase_Area2D>` a la escena.
fr: Pour commencer, nous devons choisir un nœud racine pour l'objet joueur. En règle générale, le nœud racine d'une scène doit refléter la fonctionnalité souhaitée de l'objet - ce que l'objet *est*. Cliquez sur le bouton "Other Node" et ajoutez un nœud :ref:`Area2D <class_Area2D>` à la scène.
it: Per iniziare, dobbiamo scegliere un nodo radice per l'oggetto giocatore. Come regola generale, il nodo radice di una scena dovrebbe riflettere la funzionalità desiderata dell'oggetto - ciò che l'oggetto *è*. Fare clic sul pulsante "Altro nodo" e aggiungere un nodo :ref:`Area2D <class_Area2D>`` alla scena.
ja: はじめに、プレイヤーオブジェクトのルートノードを選択する必要があります。原則として、シーンのルートノードはオブジェクトに望まれる機能（オブジェクトが何 *である* か）を反映する必要があります。「その他のノード」のボタンをクリックして、シーンに :ref:`Area2D <class_Area2D>`` ノードを加えます。
ko: 시작하려면 플레이어 오브젝트의 루트 노드를 선택해야 합니다. 일반적으로 씬의 루트 노드는 개체가 원하는 기능, 즉 개체가 *무엇*인지를 반영해야 합니다. "다른 노드(Other Node)" 버튼을 클릭하고 씬에 :ref:`Area2D <class_Area2D>` 노드를 추가하세요.
pt_br: Para iniciarmos, precisamos escolher o nó raiz para o objeto jogador. Como regra geral, o nó raiz da cena deve refletir à funcionalidade desejado do objeto - o que o objeto *é*. Clique no botão "Outros Nós" e adicione o nó :ref:`Area2D <class_Area2D>` à cena.
ru: Для начала нам нужно выбрать корневой узел для объекта игрока. Как правило, корневой узел сцены должен отображать желаемую функциональность объекта - *чем* объект является. Нажмите кнопку "Другой узел" (Other Node) и добавьте узел :ref:`Area2D <class_Area2D>` в сцену.
uk: Для початку нам потрібно вибрати кореневої вузол [Root Node] для об'єкта player. У загальному випадку, кореневий вузол сцени повинен відображати бажану функціональність об'єкта - чим об'єкт є. Натисніть кнопку "Other Node" і додайте вузол: ref: `Area2D <class_Area2D>` в сцену.
zh_cn: 首先，我们需要为player对象选择一个根节点。作为一般规则，场景的根节点应该反映对象所需的功能-对象*是什么*。单击“其他节点”按钮并将：ref:`Area2D<class_Area2D>`节点添加到场景中。
zh_tw: 首先，我們需要選擇玩家物件的根節點。一般來說，場景的根節點通常對應了物件所需要的功能——也就是物件 **是什麼**。點擊 [其他節點] 按鈕，並新增 :ref:`Area2D <class_Area2D>` 節點至場景中。

source: Godot will display a warning icon next to the node in the scene tree. You can ignore it for now. We will address it later.
cs: Godot zobrazí varovnou ikonu vedle uzlu ve stromu scény. Prozatím to můžete ignorovat. Vyřešíme to později.
de: Godot zeigt ein Icon mit einem Warnhinweis im Node des Szenenbaumes. Dieses kann vorerst ignoriert werden, wir werden uns später darum kümmern.
es: Godos mostrará un ícono de advertencia junto al nodo en el árbol de la escena. Puedes ignorarlo por ahora, lo resolveremos más adelante.
fr: Godot affichera une icône d'avertissement près du nœud dans l'arbre de scène. Vous pouvez l'ignorer pour le moment. Nous y reviendrons plus tard.
it: Godot mostrerà un'icona di avvertimento accanto al nodo nell'albero della scena. Per ora lo puoi ignorare. Ce ne occuperemo successivamente.
ja: Godotは、シーンツリーのノードの横に警告アイコンを表示します。現時点では無視して構いません。後で対処します。
ko: Godot는 씬 트리에서 노드 옆에 경고 아이콘을 보여줍니다. 지금은 무시해도 됩니다. 나중에 다룰 것입니다.
pt_br: Godot vai mostrar um ícone de aviso próximo do nó na árvore de cenas. Você pode ignorar isso por enquanto. Nós vamos falar disso mais tarde.
ru: Godot отобразит значок предупреждения рядом с этим узлом в древе сцены. Пока что не обращайте внимание на это. Мы рассмотрим это позже.
uk: Godot виведе попереджувальний значок поруч із вузлом у дереві сцени. Ви можете проігнорувати його наразі. Ми розглянемо цей значок пізніше.
zh_cn: Godot将在场景树中的节点旁边显示警告图标。你现在可以忽略它。我们稍后再谈。
zh_tw: Godot 會在場景樹中的節點旁邊顯示一個警告圖示。可以暫時忽略，之後再來處理。

source: With ``Area2D`` we can detect objects that overlap or run into the player. Change the node's name to ``Player`` by double-clicking on it. Now that we've set the scene's root node, we can add additional nodes to give it more functionality.
cs: Pomocí ``Area2D`` můžeme detekovat objekty, které se překrývají nebo naráží do hráče. Změňte název uzlu na ``Player`` poklepáním na něj. Nyní, když jsme nastavili kořen scény hráče, můžeme do něho přidat další podřízené uzly, abychom mu rozšířili funkčnost a poskytli více vlastností.
de: Mit ``Area2D`` können Objekte erkannt werden, die mit dem Spieler überlappen oder diesen berühren. Wir ändern den Namen des Nodes zu ``Player``, indem wir darauf Doppelklicken. Nun da wir den Wurzel-Node der Szene gesetzt haben, können wir weitere Nodes hinzufügen, um ihm damit mehr Funktionalität zu geben.
es: Con ``Area2D`` podemos detectar objetos que se superponen o entran en contacto con el jugador. Cambia su nombre a ``Player`` haciendo clic en el nombre del nodo. Este es el nodo raíz de la escena. Podemos añadir nodos adicionales al player para añadir funcionalidad.
fr: Avec ``Area2D``, nous pouvons détecter les objets qui chevauchent ou heurtent le joueur. Changez le nom du nœud en ``Player`` en double-cliquant sur son nom. Maintenant que nous avons défini le nœud racine de la scène, nous pouvons ajouter des nœuds supplémentaires pour lui donner plus de fonctionnalités.
it: Con il nodo ``Area2D`` possiamo rilevare gli oggetti che si sovrappongono o scontrano con il giocatore. Rinomina il nodo in ``Player`` facendo doppio click sopra di esso. Ora che abbiamo impostato la scena principale, possiamo aggiungere ulteriori nodi al giocatore per aggiungere altre funzionalità.
ja: ``Area2D`` を使用すると、プレイヤーに重なり合ったり、プレイヤーに衝突したりするオブジェクトを検出できます。ノードの名前をダブルクリックして、その名前を ``Player`` に変更します。シーンのルートノードを決めたので、これにノードを追加して機能を追加できます。
ko: ``Area2D``\ 를 사용하면 플레이어와 겹치거나 충돌하는 물체를 감지할 수 있습니다. 노드를 두 번 클릭하여 노드 이름을 ``Player``\ 로 변경하세요. 이제 씬의 루트 노드를 설정했으므로 노드를 추가해 더 많은 기능을 줄 수 있습니다.
pt_br: Com ``Area2D``, nós podemos detectar objetos que se sobreponham ou vão de encontro ao jogador. Mude seu nome para ``Jogador`` com um clique duplo no nome do nó. Já que nós configuramos o nó raiz, nós agora podemos inserir nós adicionais para adicionar mais funcionalidades.
ru: С помощью ``Area2D`` мы можем обнаруживать объекты, которые перекрывают или сталкиваются с игроком. Измените имя узла на ``Player``, дважды щёлкнув по нему. Теперь, когда мы установили корневой узел сцены, мы можем добавлять дополнительные узлы, чтобы привнести больше функционала.
uk: За допомогою `` Area2D`` ми можемо виявляти об'єкти, які перекривають або стикаються з гравцем. Змініть ім'я вузла на `` Player``, двічі клацнувши по ньому. Тепер, коли ми встановили кореневої вузол сцени, ми можемо додавати додаткові вузли, щоб привнести більше функціоналу.
zh_tw: 有了 ``Area2D`` 節點，我們就能偵測跑到了玩家範圍內物件。我們先點兩下節點，把節點名稱改成 ``Player`` 。現在，場景根節點已經設定好了，接著來設定更多節點，新增更多功能。

source: Before we add any children to the ``Player`` node, we want to make sure we don't accidentally move or resize them by clicking on them. Select the node and click the icon to the right of the lock; its tooltip says "Makes sure the object's children are not selectable."
cs: Než přidáme děti do uzlu ''Player'', chceme si být jisti, že je omylem nepřesuneme nebo nezměníme jejich velikost. Vyberte uzel a klepněte na ikonu vpravo od zámku; jeho popis říká: "Zajišťuje, že podřízené objektu nelze vybrat."
de: Bevor wir weitere untergeordnete Nodes zu ``Player`` hinzufügen, wollen wir sicherstellen, dass wir diese nicht aus Versehen bewegen oder deren Größe ändern, indem wir auf sie klicken. Wählen Sie den Node aus und klicke auf das Symbol rechts neben dem Schloss; sein Tooltip lautet "Verhindert das Auswählen von Unterobjekten dieses Nodes."
es: Antes de que agreguemos un hijo al nodo ``Player``, debemos asegurarnos de no moverlos o escalarlos accidentalmente al hacer clic en ellos. Selecciona el nodo y haz clic en el icono a la derecha del candado; su descripción dice "Hace que los hijos de un nodo no sean seleccionables".
fr: Avant d'ajouter des enfants au nœud ``Player``, nous voulons nous assurer de ne pas les déplacer ou les redimensionner accidentellement en cliquant dessus. Sélectionnez le nœud et cliquez sur l'icône à droite du cadenas ; son info-bulle indique "Rendre la sélection des enfants de l'objet impossible."
it: Prima di aggiungere figli al nodo ``Player``, vogliamo assicurarci di non muoverli o ridimensionarli accidentalmente cliccandoci sopra. Seleziona il nodo e fai click sull'icona a destra del lucchetto; la descrizione del comando dice "Accerta che i figli dell'oggetto non siano selezionabili."
ja: ``Player`` ノードに子を追加する前に、子をクリックして誤って移動したりサイズを変更したりしないようにします。ノードを選択し、ロックの右側にあるアイコンをクリックします。ツールチップには「オブジェクトの子を選択不可にする。」と書いてあります
ko: ``Player`` 노드에 자식을 추가하기 전에, 실수로 자식을 클릭해서 자식이 움직이거나 크기가 바뀌지 않도록 해야 합니다. 노드를 선택하고 자물쇠 오른쪽에 있는 아이콘을 클릭하세요. 노드의 툴 팁에는 "오브젝트의 자식을 선택하지 않도록 합니다." 라고 표시됩니다.
pl: Przed dodaniem dzieci do węzła ``Player`` chcemy się upewnić, że nie przesunęliśmy ich przypadkowo lub nie zmieniliśmy ich wielkości klikając na nie. Zaznacz węzeł i kliknij ikonę po prawej stronie zamka; jego podpowiedź brzmi "Upewnij się, że dzieci nie są wybieralne."
pt_br: Antes de adicionar filhos ao nó ``Jogador``, queremos ter certeza que não os moveremos nem os redimensionaremos acidentalmente ao clicar neles. Selecione o nó e clique no ícone à direita do cadeado; seu texto de dica diz "Garante que os filhos do objeto não sejam selecionáveis."
ru: Прежде чем мы добавим потомков на узел ``Player``, мы хотим убедиться, что нажав на них, мы не переместим их и не изменим их размер. Выберите узел и нажмите на значок справа от блокировки; его всплывающая подсказка гласит: "Делает потомков объекта невыбираемыми."
uk: Перш ніж додати будь-яких нащадків до вузла ``Player``, ми хочемо переконатися, що випадково їх не перемістимо, чи не змінимо розмір, натиснувши на них. Виберіть вузол і натисніть на значок праворуч від блокування; в підказці написано: "Гарантує, що нащадки об'єкта не можуть бути вибрані."
zh_cn: 在将任何子级添加到 ``Player`` 节点之前，我们要确保不会通过点击它们而意外地移动它们或调整其大小。选择节点，然后点击锁右侧的图标；它的工具提示显示 ``确保对象的子级不可选择。``
zh_tw: 在我們給 ``Player`` 新增任何子節點前，需要先確保不會因為點到 Player 物件而移動到 Player 或改變到大小。先選擇 Player 節點，然後點擊鎖頭右邊的圖示，滑鼠移到圖示上方的時候會顯示提示「確保物件的子級項目無法被選擇。」

source: Save the scene. Click Scene -> Save, or press :kbd:`Ctrl + S` on Windows/Linux or :kbd:`Cmd + S` on macOS.
cs: Uložte scénu. Klikněte na Scéna -> Uložit nebo stiskněte :kbd:`Ctrl + S` v systému Windows / Linux nebo :kbd:`Cmd + S` v systému MacOS.
de: Speichern Sie die Szene. Klicken Sie auf Szene -> Speichern oder drücken :kbd:`Ctrl + S` unter Windows/Linux oder :kbd:`Cmd + S` unter MacOS.
es: Guarda la escena. Haz clic en Escenas -> Guardar escena, o presiona ``Ctrl+S`` en Windows/Linux o ``Comando + S`` en Mac.
fr: Sauvegardez la scène. Cliquez sur Scène -> Enregistrer la scène, ou appuyez sur :kbd:`Ctrl + S` sous Windows/Linux ou :kbd:`Cmd + S` sous macOS.
it: Salva la scena. Clicca su Scena -> Salva, oppure premi :kbd:`Ctrl + S` su Windows/Linux o :kbd:`Cmd + S` su Mac.
ja: シーンを保存します。 [シーン]-> [シーンを保存]をクリックするか、Windows/Linuxでは :kbd:`Ctrl + S` を押し、macOSでは :kbd:`Cmd + S` を押します。
ko: 씬을 저장합니다. 씬(Scene) -> 씬 저장(Save Scene)을 클릭하거나 Windows/Linux에서는 :kbd:`Ctrl + S`\ 를, Mac에서는 :kbd:`Cmd + S`\ 를 누르세요.
pt_br: Salve a cena. Clique em Cena -> Salvar ou pressione :kbd: `Ctrl+S` no Windows/Linux ou :kbd: `Cmd+S` no MacOS.
ru: Сохраните сцену. Нажмите "Сцена" -> "Сохранить сцену" в верхней панели или нажмите сочетание клавиш :kbd:`Ctrl + S` на Windows/Linux или :kbd:`Cmd + S` на Mac.
uk: Збережіть сцену. Клацніть Сцена -> Зберегти, або натисніть :kbd:`Ctrl+S` на Windows/Linux, або :kbd:`Cmd + S` на macOS.
zh_tw: 接著保存場景。選擇 [場景] -> [保存]，或是在 Windows/Linux 上按鍵盤 :kbd:`Ctrl + S` ，在 macOS 上則是 :kbd:`Cmd + S` 。

source: For this project, we will be following the Godot naming conventions.
cs: V tomto projektu budeme dodržovat Godot pravidla pro názvy identifikátorů.
de: Für dieses Projekt halten wir uns an die Godot-Namenskonvention.
es: Para este proyecto, seguiremos las convenciones de nomenclatura de Godot.
fr: Pour ce projet, nous suivrons les conventions de nommage de Godot.
it: Per questo progetto seguiremo le convenzioni di denominazione di Godot.
ja: このプロジェクトでは、Godotの命名規則に従います。
ko: 이 프로젝트에서, 우리는 Godot의 명명 규칙을 따를 것입니다.
pt_br: Para esse projeto, vamos seguir as convenções de nomeação Godot.
ru: Для этого проекта мы будем следовать правилам именования Godot.
uk: У цьому проєкті ми будемо дотримуватися правил іменування Godot.
zh_cn: 对于此项目，我们将遵循Godot的命名约定。
zh_tw: 在這個專案中，我們會遵守 Godot 的命名慣例。

source: **GDScript**: Classes (nodes) use PascalCase, variables and functions use snake_case, and constants use ALL_CAPS (See :ref:`doc_gdscript_styleguide`).
cs: **GDScript**: Třídy (uzly) používají PascalCase, proměnné a funkce používají snake_case a konstanty používají ALL_CAPS (viz :ref:`doc_gdscript_styleguide`).
de: **GDScript**: Klassen (Nodes) nutzen ``PascalCase``, Variablen und Funktionen ``snake_case`` und Konstanten ``ALL_CAPS`` (Siehe :ref:`doc_gdscript_styleguide`).
es: **GDScript**: Clases (nodos) usan PascalCase, variables y funciones utilizan snake_case, y las constantes TODO_MAYUSCULAS (Lee :ref:`doc_gdscript_styleguide`).
fr: **GDScript** : Les classes (nœuds) utilisent PascalCase, les variables et les fonctions utilisent snake_case, et les constantes utilisent ALL_CAPS (Voir :ref:`doc_gdscript_styleguide`).
it: **GDScript**: Le classi (nodi) usano PascalCase, le variabili e le funzioni snake_case e le costanti usano ALL_CAPS (Vedi :ref:`doc_gdscript_styleguide`).
ja: **GDScript**: クラス(ノード)はPascalCaseを使用し、変数と関数はsnake_caseを使用し、定数はALL_CAPSを使用します(\ :ref:`doc_gdscript_styleguide`\ を参照)。
ko: **GDScript**: 클래스(노드)는 파스칼 표기법(PascalCase)을 사용하고, 변수와 함수는 스네이크_표기법(snake_case)을 사용하며, 상수는 전부 대문자(ALL_CAPS)를 사용합니다(:ref:`doc_gdscript_styleguide` 참조).
pt_br: **GDScript**: Classes (nós) usam o estilo ``PascalCase`` (IniciaisMaiúsculas), variáveis e funções usam ``snake_case`` (minúsculas_separadas_por_sublinha), e constantes usam ``ALL_CAPS`` (TODAS_MAIÚSCULAS) (Veja mais em :ref:`doc_gdscript_styleguide`).
ru: **GDScript**: Классы (узлы) используют PascalCase, переменные и функции - snake_case, константы - ALL_CAPS (см. :ref:`doc_gdscript_styleguide`).
uk: **GDScript**: Класи (вузли) використовують PascalCase, змінні та функції використовують snake_case, а константи використовують ALL_CAPS (Дивіться :ref:`doc_gdscript_styleguide` ).
zh_cn: **GDScript**：类（节点）使用大驼峰命名法（PascalCase），变量和函数使用蛇形命名法（snake_case），常量使用全大写（ALL_CAPS）（请参阅 :ref:`doc_gdscript_styleguide`）。
zh_tw: **GDScript** ：類別 (節點) 使用大駝峰法 (PascalCase)，變數與函式名稱使用蛇形法 (snake_case)，常數則使用全大寫 (ALL_CAPS) (詳細請參考 :ref:`doc_gdscript_styleguide`)。

source: **C#**: Classes, export variables and methods use PascalCase, private fields use _camelCase, local variables and parameters use camelCase (See :ref:`doc_c_sharp_styleguide`). Be careful to type the method names precisely when connecting signals.
cs: **C #**: Třídy, exportované proměnné a metody používají PascalCase, soukromá pole používají _camelCase, lokální proměnné a parametry používají camelCase (viz :ref:`doc_c_sharp_styleguide`). Při připojování signálů buďte opatrní, abyste přesně zadali názvy metod.
de: **C#**: Klassen, Exportvariablen und Methoden verwenden die ``PascalCase``-Schreibweise, private Felder ``_camelCase``, lokale Variablen und Parameter verwenden ``camelCase`` (Siehe :ref:`doc_c_sharp_styleguide`). Beachten Sie die genaue Schreibweise, wenn Sie Signale einbinden möchten.
es: **C#**: Las clases, las variables de exportación y los métodos usan PascalCase, los campos privados usan _camelCase, y las variables y parámetros locales usan camelCase (Ver :ref:`doc_c_sharp_styleguide`). Ten cuidado de escribir los nombres de los métodos de manera precisa al conectar señales.
fr: **C#** : Les classes, les variables d'exportation et les méthodes utilisent PascalCase, les attributs privés utilisent _camelCase, les variables locales et les paramètres utilisent camelCase (Voir :ref:`doc_c_sharp_styleguide`). Attention à taper les noms des méthodes précisément lorsque vous connectez des signaux.
it: **C#**: Le classi, le variabili export e i metodi usano PascalCase, i campi privati usano _camelCase, le variabili locali e i parametri usano camelCase (Vedi :ref:`doc_c_sharp_styleguide`). Bisogna dare attenzione a scrivere il nome dei metodi correttamente quando si connettono i segnali.
ja: **C#**: クラス、export変数、メソッドはPascalCaseを使用し、プライベートフィールドは_camelCaseを使用し、ローカル変数とパラメーターはcamelCaseを使用します(\ :ref:`doc_c_sharp_styleguide`\ を参照)。シグナルを接続するときは、メソッド名を正確に入力してください。
ko: **C#**: 클래스, export 변수 그리고 메서드는 파스칼 표기법(PascalCase)을 사용합니다. private 필드는 카멜 표기법(_camelCase)를 사용합니다. 지역변수와 매개변수는 카멜 표기법(camelCase)을 사용합니다(:ref:`doc_c_sharp_styleguide` 참고). 시그널을 연결할 때는 메서드 이름을 정확하게 입력하도록 주의하세요.
pt_br: ** C # **: Classes, variáveis de exportação e métodos usam PascalCase, campos privados usam _camelCase, variáveis locais e parâmetros usam camelCase (Veja: ref: `doc_c_sharp_styleguide`). Tenha o cuidado de digitar os nomes dos métodos com precisão ao conectar os sinais.
ru: **C#**: Классы, экспортируемые переменные и методы используют PascalCase, приватные поля - _camelCase, локальные переменные и параметры - сamelCase (см. :ref:`doc_c_sharp_styleguide`). Будьте осторожны: точно набирайте имена методов при подключении сигналов.
uk: **C#**: Класи, експортовані змінні та методи використовують PascalCase, приватні поля використовують _camelCase, локальні змінні та параметри використовують camelCase (Дивіться :ref:`doc_c_sharp_styleguide` ). Будьте обережні, вводячи назви методів саме під час підключення сигналів.
zh_cn: **C#**：类、导出变量和方法使用PascalCase，私有字段使用_camelCase，局部变量和参数使用camelCase(参见 :ref:`doc_c_sharp_styleguide`)。连接信号时，请务必准确键入方法名称。
zh_tw: **C#** ：類別與匯出的變數與方法使用大駝峰法 (PascalCase)，Private 欄位使用底線加小駝峰 (_camelCase)，區域變數與參數使用小駝峰法 (camelCase) (請參考 :ref:`doc_c_sharp_styleguide` )。在連接訊號的時候請特別注意不要打錯方法名稱。

source: Sprite animation
cs: Animace spritu
es: Animación del sprite
fr: Animation du sprite
it: Animazione Sprite
ja: スプライトアニメーション
ko: 스프라이트 애니메이션
pt_br: Animação por Sprites
ru: Анимация Спрайтов
uk: Анімація спрайта
zh_cn: 精灵动画
zh_tw: Sprite 動畫
