Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: See :ref:`doc_instancing` to learn more about instancing.
cs: Další informace o vytváření instancí najdete na :ref:`doc_instancing`.
de: Siehe :ref:`doc_instancing`, um mehr über das Instanzieren zu erfahren.
es: Mira :ref:`doc_instancing` para aprender más sobre instanciación.
fr: Voyez :ref:`doc_instancing` pour en apprendre davantage à propos de l'instanciation.
it: Vedi :ref:`doc_instancing` per saperne di più sull'istanziamento.
ja: インスタンス化の詳細については、\ :ref:`doc_instancing`\ を参照してください。
ko: 인스턴스에 대해 더 알고 싶다면 :ref:`doc_instancing` 를 읽어보세요.
pl: Zobacz :ref:`doc_instancing` aby dowiedzieć się więcej o instancjach.
pt_br: Veja :ref:`doc_instancing` para aprender mais sobre instanciação.
ru: Посмотрите :ref:`doc_instancing`, чтобы узнать больше об инстанцировании.
uk: Перегляньте :ref:`doc_instancing`, щоб дізнатися більше про створення екземплярів (інстансування).
zh_cn: 请参阅 :ref:`doc_instancing` 以了解有关实例化的更多信息。
zh_tw: 請參考 :ref:`doc_instancing` 以瞭解更多有關實體化的資訊。

source: Node setup
cs: Nastavení uzlu
de: Node einrichten
es: Configuración del Nodo
fr: Configuration du nœud
it: Impostazione dei nodi
ja: ノードの設定
ko: 노드 설정하기
pt_br: Configuração de nós
ru: Настройка узла
uk: Налаштування вузлів
zh_cn: 节点设置
zh_tw: 設定節點

source: Click Scene -> New Scene and add the following nodes:
cs: Klikněte na Scéna -> Nová scéna a přidejte následující uzly:
de: Klicken Sie auf Szene -> Neue Szene und fügen Sie die folgenden Nodes hinzu:
es: Haz clic en Escena -> Nueva escena y agrega los siguientes nodos:
fr: Cliquez sur Scène -> Nouvelle scène et ajoutez les nœuds suivants :
it: Clicca Scena -> Nuova Scena e aggiungi i seguenti nodi:
ja: [シーン → 新規シーン] をクリックして、次のノードを追加します:
ko: 씬(Scene) -> 새 씬(New Scene)을 클릭 후 다음 노드들을 추가하세요:
pt_br: Clique Cena -> Nova Cena e adcione os seguintes nós:
ru: Нажмите "Сцена" -> "Новая сцена" и добавьте следующие узлы:
uk: Клацніть Сцена -> Нова сцена та додайте наступні вузли:
zh_tw: 點擊 [場景] -> [新增場景]，然後新增下列節點：

source: :ref:`RigidBody2D <class_RigidBody2D>` (named ``Mob``)
cs: :ref:`RigidBody2D <class_RigidBody2D>` (pojmenovaný ``Mob``)
de: :ref:`RigidBody2D <class_RigidBody2D>` (genannt ``Mob``)
es: :ref:`RigidBody2D <class_RigidBody2D>` (llamado ``Mob``)
fr: :ref:`RigidBody2D <class_RigidBody2D>` (nommé ``Mob``)
it: :ref:`RigidBody2D <class_RigidBody2D>` (chiamato ``Mob``)
ja: :ref:`RigidBody2D <class_RigidBody2D>`\ ( ``Mob`` という名前)
ko: :ref:`RigidBody2D <class_RigidBody2D>` ( ``Mob``\ 으로 이름지음)
pl: :ref:`RigidBody2D <class_RigidBody2D>` (o nazwie ``Mob``)
pt_br: :ref:`RigidBody2D <class_RigidBody2D>` (chamado ``Turba``)
ru: :ref:`RigidBody2D <class_RigidBody2D>` (названный ``Mob``)
uk: :ref:`RigidBody2D <class_RigidBody2D>` (тверде тіло 2D) (названий ``Mob``)
zh_cn: :ref:`RigidBody2D <class_RigidBody2D>` （名为 ``Mob``）
zh_tw: :ref:`RigidBody2D <class_RigidBody2D>` (設定名稱為 ``Mob`` )

source: :ref:`AnimatedSprite <class_AnimatedSprite>`
uk: :ref:`AnimatedSprite <class_AnimatedSprite>`(Анімація спрайту)

source: :ref:`CollisionShape2D <class_CollisionShape2D>`
uk: :ref:`CollisionShape2D <class_CollisionShape2D>`(Форма зіткнення 2D)

source: :ref:`VisibilityNotifier2D <class_VisibilityNotifier2D>`
ko: :ref:`VisibilityNotifier2D <class_VisibilityNotifier2D>` ( ``Visibility``\ 로 이름지음)
pt_br: :ref:`VisibilityNotifier2D <class_VisibilityNotifier2D>` (chamado ``Visibilidade``)
uk: :ref:`VisibilityNotifier2D <class_VisibilityNotifier2D>` (Видимість)

source: Don't forget to set the children so they can't be selected, like you did with the Player scene.
cs: Nezapomeňte nastavit podřízené uzly tak, aby nemohly být vybrány, jako jste to udělali na scéně Player.
de: Vergessen Sie nicht, die Unterobjekte so einzustellen, dass sie nicht ausgewählt werden können, wie Sie es bei der Player-Szene getan haben.
es: No olvides marcar los hijos para que no se puedan seleccionar, como hiciste con la escena Player.
fr: N'oubliez pas de configurer les enfants pour qu'ils ne puissent pas être sélectionnés, comme vous l'avez fait avec la scène Player.
it: Non dimenticare di impostare i nodi figli in modo che non possano essere selezionati, come hai fatto con la scena del Giocatore.
ja: Playerシーンと同様に、選択できないように子を設定することを忘れないでください。
ko: 플레이어 씬에서 한 것과 마찬가지로, 자식이 선택되지 않도록 설정하는 것을 잊지마세요.
pl: Nie zapomnij ustawić dzieci tak, aby nie mogły być wybierane, jak to miało miejsce w przypadku sceny z graczem.
pt_br: Não se esqueça de configurar os filhos para que não possam ser selecionados, assim como você fez na cena Jogador.
ru: Не забудьте настроить дочерние узлы, чтобы они не могли быть выбраны, как вы это делали со сценой игрока.
uk: Не забудьте налаштувати нащадків, щоб вони не могли бути обрані, як ви робили це зі сценою гравця.
zh_cn: 别忘了设置子项，使其无法被选中，就像您对 ``Player`` 场景所做的那样。
zh_tw: 別忘了把子節點設定成無法選擇，跟剛剛在 Player 場景中一樣。

source: In the :ref:`RigidBody2D <class_RigidBody2D>` properties, set ``Gravity Scale`` to ``0``, so the mob will not fall downward. In addition, under the ``PhysicsBody2D`` section, click the ``Mask`` property and uncheck the first box. This will ensure the mobs do not collide with each other.
cs: Ve vlastnostech :ref:`RigidBody2D <class_RigidBody2D>` nastavte ``Gravity Scale`` na ``0``, takže nepřítel nebude klesat dolů. Kromě toho v sekci ``PhysicsBody2D`` klikněte na vlastnost ``Maska`` a zrušte zaškrtnutí prvního políčka. Tím bude zajištěno, že nepřátelé nebudou navzájem kolidovat.
de: Stellen Sie in den :ref:`RigidBody2D <class_RigidBody2D>` Eigenschaften ``Gravity Scale`` auf ``0``, damit der Gegner nicht nach unten fällt. Klicken Sie außerdem unter dem Abschnitt ``PhysicsBody2D`` auf die Eigenschaft ``Mask`` und deaktivieren das erste Kontrollkästchen. Dadurch wird sichergestellt, dass die Gegner nicht miteinander kollidieren.
es: En las propiedades de :ref:`RigidBody2D <class_RigidBody2D>`, ajustar ``Gravity Scale`` a ``0``, así los enemigos no caerán hacia abajo. Además, dentro de la sección ``PhysicsBody2D``, haz clic en la propiedad ``Mask`` y desmarca el primer cuadro, para asegurarse que los enemigos no colisionen entre sí.
fr: Dans les propriétés du :ref:`RigidBody2D <class_RigidBody2D>`, réglez ``Gravity Scale`` sur ``0``, afin que le monstre ne tombe pas vers le bas. De plus, sous la section ``PhysicsBody2D``, cliquez sur la propriété ``Mask`` et décochez la première case. Cela permettra de s'assurer que les monstres n'entrent pas en collision les uns avec les autres.
it: Nelle proprietà di :ref:`RigidBody2D <class_RigidBody2D>`, imposta ``Gravity Scale`` a ``0``, in modo che il nemico non cada verso il basso. Inoltre, sotto la sezione ``PhysicsBody2D``, clicca sulla proprietà ``Mask`` e deseleziona la prima casella. Questo farà in modo che i nemici non collidano tra di loro.
ja: :ref:`RigidBody2D <class_RigidBody2D>`\ プロパティで、 ``Gravity Scale`` を ``0`` に設定して、モブが下方に落ちないようにします。さらに、 ``PhysicsBody2D`` セクションの下にある ``Mask`` プロパティをクリックし、最初のチェックボックスをオフにします。これにより、モブが互いに衝突しないようになります。
ko: :ref:`RigidBody2D <class_RigidBody2D>` 속성에서 ``Gravity Scale`` 을 ``0`` 으로 설정해 몹이 아래로 떨어지지 않도록 합니다. 그리고, ``PhysicsBody2D`` 섹션의 ``Mask`` 속성을 클릭하고 첫 번째 상자의 체크를 푸세요. 이것은 몹들끼리 충돌하지 않도록 만듭니다.
pl: We właściwościach :ref:`RigidBody2D <class_RigidBody2D>` ustaw ``Gravity Scale``(Skala Grawitacji) na ``0``, tak aby przeciwnik nie spadł w dół. Ponadto w sekcji ``PhysicsBody2D``(Ciało fizyczne 2D) kliknij na właściwość ``Mask``(Maska) i odznaczyć pierwsze pole wyboru. Zapewni to, że przeciwnicy nie będą się zderzać.
pt_br: Nas propriedades de :ref:`RigidBody2D <class_RigidBody2D>`, configure ``Gravity Scale`` (escala da gravidade) para ``0``, para que os inimigos não caiam para a parte de baixo da tela. Além disso, dentro da seção ``PhysicsBody2D``, clique na propriedade ``Mask`` (máscara) e desmarque a primeira caixa. Isso vai garantir que o inimigos não colidam uns com os outros.
ru: В свойствах :ref:`RigidBody2D <class_RigidBody2D>` установите в поле ``Gravity Scale`` значение ``0``, чтобы моб не упал вниз. Кроме того, в разделе ``PhysicsBody2D`` выберите свойство ``Mask`` и снимите первый флажок. Это гарантирует, что мобы не столкнутся друг с другом.
uk: У властивостях :ref:`RigidBody2D <class_RigidBody2D>` встановіть значення ``Gravity Scale`` (сила гравітації) на ``0``, щоб моб не падав вниз. Крім того, в розділі ``PhysicsBody2D`` натисніть властивість ``Mask`` і зніміть прапорець у першому полі. Завдяки цьому в натовпі моби не будуть стикатися один з одним.
zh_cn: 在 :ref:`RigidBody2D <class_RigidBody2D>` 属性中，将 ``Gravity Scale`` 设置为 ``0``，这样怪物就不会下坠。此外，在 ``PhysicsBody2D`` 部分下，点击 ``Mask`` 属性并去除第一个复选框的勾选。这会确保怪物不会彼此碰撞。
zh_tw: 將 :ref:`RigidBody2D <class_RigidBody2D>` 的 ``Gravity Scale`` (重力量級) 設為 ``0`` ，讓怪物不會下墜。另外，在 ``PhysicsBody2D`` 中，點擊 ``Mask`` (遮罩) 屬性並取消選擇第一個勾選框，就可以確保怪物不會互相碰撞。

source: Set up the :ref:`AnimatedSprite <class_AnimatedSprite>` like you did for the player. This time, we have 3 animations: ``fly``, ``swim``, and ``walk``. There are two images for each animation in the art folder.
cs: Nastavte :ref:`AnimatedSprite <class_AnimatedSprite>` tak jako pro hráče. Tentokrát máme 3 animace: ``fly``, ``swim`` a ``walk``. Pro každou animacijsou ve složce art dva obrázky.
de: Richten Sie das :ref:`AnimatedSprite <class_AnimatedSprite>` so ein, wie wir es für den Spieler getan haben. Dieses Mal haben wir drei Animationen: ``fly``, ``swim``, und ``walk``. Zu jeder Animation gibt es zwei Bilder im "art" Ordner.
es: Configura el :ref:`AnimatedSprite <class_AnimatedSprite>` como hiciste con el jugador. Esta vez, tenemos 3 animaciones: ``fly``, ``swim``, y ``walk``. Hay dos imágenes para cada animación en la carpeta art.
fr: Configurez l':ref:`AnimatedSprite <class_AnimatedSprite>` comme vous l'avez fait pour le joueur. Cette fois, nous avons 3 animations : ``fly``, ``swim``, et ``walk``. Il y a deux images pour chaque animation dans le dossier art.
it: Imposta :ref: `AnimatedSprite <class_AnimatedSprite>` come hai fatto per il giocatore. Questa volta abbiamo 3 animazioni: `` fly``, `` swim`` e `` walk``. Ci sono due immagini per ogni animazione nella cartella grafica.
ja: プレイヤーに対して行ったように :ref:`AnimatedSprite <class_AnimatedSprite>` を設定します。 今回は、3つのアニメーションがあります: ``fly``\ 、\ ``swim``\ 、\ ``walk``\ です。 artフォルダ内には、各アニメーション用の画像が2枚あります。
ko: 플레이어에서 설정한 것처럼 :ref:`AnimatedSprite <class_AnimatedSprite>`\ 를 설정합니다. 이번에는 ``fly``, ``swim``, ``walk``\ 의 3가지 애니메이션이 있습니다. art 폴더에는 각 애니메이션에 대해 두 개의 이미지가 있습니다.
pt_br: Configure o :ref:`AnimatedSprite <class_AnimatedSprite>` assim como você fez para o jogador. Desta vez, temos 3 animações: ``voar`` (*fly*), ``nadar`` (*swim*) e ``andar`` (*walk*). Defina a propriedade ``Playing`` (reproduzindo_ no Inspetor para "Ativo" e ajuste a configuração "Velocidade (FPS)" como mostrado abaixo. Vamos selecionar uma dessas animações aleatoriamente para que a turba tenha alguma variedade.
ru: Настройте :ref:`AnimatedSprite <class_AnimatedSprite>`, как вы сделали это для игрока. На этот раз у нас есть 3 анимации: ``fly`` (лететь), ``swim`` (плыть) и ``walk`` (ходить). В папке art есть две картинки для каждой анимации.
uk: Налаштуйте :ref:`AnimatedSprite <class_AnimatedSprite>` так, як ви налаштовували його для гравця. На цей раз, у нас є 3 анімації: ``fly``(літати), ``swim``(плавати), і ``walk``(ходити). В папці art є по два зображення для кожної анімації.
zh_tw: 接著像剛才設定玩家那樣，設定 :ref:`AnimatedSprite <class_AnimatedSprite>` 。這次有三種動畫： ``fly`` (飛行)、 ``swim`` (游泳) 與 ``walk`` (行走)。每個動畫都有兩個圖片，放在 art 資料夾中。

source: Adjust the "Speed (FPS)" to ``3`` for all animations.
cs: Nastavte "Speed(FPS)" na ``3`` pro všechny animace.
de: Setzen Sie die "Geschwindigkeit (FPS)" für alle Animationen auf ``3``.
es: Ajusta la "Speed (FPS)" a ``3`` para todas las animaciones.
fr: Ajustez la vitesse "Speed (FPS)" à ``3`` pour toutes les animations.
it: Regolare "Speed (FPS)" su ```3`` per tutte le animazioni.
ja: 全てのアニメーションの "Speed (FPS)" を ``3`` に調整してください。
ko: 모든 애니메이션의 "속도(FPS)"를 ``3``\ 으로 조정하세요.
pt_br: Ajuste o "Speed (FPS)" para ``3`` em todas as animações.
ru: Установите "Speed (FPS)" на ``3`` для всех анимаций.
uk: Встановіть "Speed (FPS)" на ``3`` для всіх анімацій.
zh_cn: 将所有动画的速度(FPS)修改为3。
zh_tw: 將所有動畫的「速度 (FPS)」調整為 ``3`` 。

source: Set the ``Playing`` property in the Inspector to “On”.
cs: V inspektoru nastavte vlastnost ``Playing`` na „On“.
de: Stelle die Eigenschaft ``Playing`` im Inspektor auf "On".
es: Marca la propiedad ``Playing`` como "Activado" en el inspector.
fr: Mettez la propriété ``Playing`` dans l'inspecteur sur “On”.
it: Imposta la proprietà ``Playing`` nell' Inspector su "On".
ja: インスペクタの ``Playing`` プロパティを「On」に設定します。
ko: 인스펙터(Inspector)에서 ``Playing`` 속성을 "사용(On)"으로 설정하세요.
pt_br: Defina a propriedade ``Playing`` no Inspector para "On".
ru: Установите свойство ``Playing`` в инспекторе на "Вкл".
uk: Встановіть властивість ``Playing`` в Інспекторі на "On" ("Вкл").
zh_tw: 在屬性面板中勾選 ``Playing`` (播放) 屬性為「開啟」。

source: We'll select one of these animations randomly so that the mobs will have some variety.
cs: Jednu z těchto animací vybereme náhodně, aby nepřátelé měly určitou rozmanitost.
de: Wir werden eine der Animationen zufällig auswählen, sodass die Gegner eine gewisse Vielfalt haben.
es: Nosotros seleccionamos una de estas animaciones al azar así los mobs tendrán algo de variedad.
fr: Nous allons choisir une de ces animations au hasard pour que les monstres aient une certaine variété.
it: Selezioneremo una di queste animazioni a caso in modo che i nemici abbiano una certa varietà.
ja: モブにバラエティを持たせるために、1つのアニメーションをランダムに選択します。
ko: 몬스터가 다양해질 수 있도록 이 애니메이션 중 하나를 무작위로 선택할 것입니다.
pt_br: Vamos selecionar uma das animações aleatoriamente para que os inimigos tenham alguma variedade.
ru: Мы выберем одну из этих анимаций случайным образом, так что мобы будут иметь некоторое разнообразие.
uk: Ми вибиратимемо одну з цих анімації випадковим чином, тому моби будуть мати певну різноманітність.
zh_cn: 我们将从中随机选择一个动画，以便产生不同的动态物件。
zh_tw: 接著我們會隨機選擇其中一個動畫來播放，這樣才不會讓所有怪物看起來都一樣。

source: Like the player images, these mob images need to be scaled down. Set the ``AnimatedSprite``'s ``Scale`` property to ``(0.75, 0.75)``.
cs: Stejně jako u obrázků hráčů musí být tyto obrázky zmenšeny. Nastavte vlastnost ``Měřítko`` uzlu ``AnimatedSprite`` na ``(0.75, 0.75)``.
de: Wie die Spieler-Bilder müssen auch diese Gegner-Bilder verkleinert werden. Setze die ``Scale`` Eigenschaft von ``AnimatedSprite`` auf ``(0.75, 0.75)``.
es: Como las imágenes del jugador, la de los enemigos deberán escalarse. Ajusta la propiedad ``Scale`` de ``AnimatedSprite`` a ``(0.75, 0.75)``.
fr: Comme les images du joueur, ces images de monstre doivent être réduites. Réglez la propriété ``Scale`` d' ``AnimatedSprite`` sur ``(0.75, 0.75)``.
it: Come per le immagini del giocatore, anche quelle del nemico dovranno essere rimpicciolite. Imposta la proprietà ``Scale`` dell' ``AnimatedSprite`` a ``(0.75, 0.75)``.
ja: プレイヤーの画像と同様に、これらのモブ画像は縮小する必要があります。 ``AnimatedSprite`` の ``Scale`` プロパティを ``(0.75, 0.75)`` に設定します。
ko: 플레이어 이미지처럼, 이 몹 이미지들도 크기를 줄일 필요가 있습니다. ``AnimatedSprite``\ 의 ``Scale`` 속성을 ``(0.75, 0.75)``\ 로 설정하세요.
pl: Podobnie jak sprite gracza, też i sprite przeciwników muszą być zmniejszone. Ustaw właściwość ``AnimatedSprite`` - ``Skala`` na ``(0,75, 0,75)``.
pt_br: Como as imagens do jogador, essas imagens da turba precisam ser reduzidas. Defina a propriedade ``Scale`` (escala) do ``AnimatedSprite`` para ``(0.75, 0.75)``.
ru: Также как изображения игрока, изображения мобов нужно уменьшить. Установите для ``AnimatedSprite`` в свойстве ``Scale`` значение ``(0.75, 0.75)``.
uk: Як і зображення гравця, ці зображення мобів потрібно зменшити. Встановіть в ``AnimatedSprite`` властивість ``Scale`` на ``(0.75, 0.75)``.
zh_cn: 像 ``Player`` 图像一样，这些怪物的图像也要缩小。设置 ``AnimatedSprite`` 的 ``Scale`` 属性为 ``(0.75, 0.75)``。
zh_tw: 就像玩家的圖片一樣，這些怪物的圖片也需要縮小。將 ``AnimatedSprite`` 的 ``Scale`` (縮放) 屬性設為 ``(0.75, 0.75)`` 。

source: As in the ``Player`` scene, add a ``CapsuleShape2D`` for the collision. To align the shape with the image, you'll need to set the ``Rotation Degrees`` property to ``90`` (under "Transform" in the Inspector).
cs: Stejně jako tak jako ve scéně ``Player`` přidejte pro kolizi ``CapsuleShape2D``. Chcete-li zarovnat tvar s obrázkem, musíte nastavit vlastnost ``Rotation Degrees`` na ``90`` (v Inspektoru pod "Transform").
de: Wie in der Szene ``Player``, fügen Sie eine ``CapsuleShape2D`` für die Kollision hinzu. Um die Form mit dem Bild auszurichten, müssen Sie die Eigenschaft ``Rotation Degrees`` auf ``90`` (unter ``Node2D``-Transform im Inspektor) einstellen.
es: Igual que en la escena ``Player``, añade un ``CapsuleShape2D`` para las colisiones. Para alinear la forma de colisión con la imagen, deberás ajustar la propiedad ``Rotation Degrees`` a ``90`` (en la sección "Transform" del Inspector).
fr: Comme dans la scène ``Player``, ajouter un ``CapsuleShape2D`` pour la collision. Pour aligner la forme avec l'image, vous aurez besoin de paramétrer la propriété ``Rotation Degrees`` à ``90`` (sous "Transform" dans l'inspecteur).
it: Come nella scena ``Player``, aggiungi un ``CapsuleShape2D`` per la collisione. Per allineare la forma con l'immagine, dovrai impostare la proprietà ``Gradi di rotazione`` su ``90`` (sotto "Trasforma" nell'Inspector).
ja: ``Player`` シーンと同様に、コリジョンに ``CapsuleShape2D`` を追加します。図形を画像に合わせるには、\ ``Rotation Degrees`` プロパティを ``90`` に設定する必要があります (インスペクタの「Transform」の下にあります)。
ko: ``Player`` 씬처럼 콜리전을 위한 ``CapsuleShape2D``\ 을 추가하세요. 이미지와 모양이 같도록, ``Node2D`` 아래 ``Rotation Degrees`` 속성을 ``90``\ 으로 설정해야 합니다(인스펙터(Inspector)의 "Transform" 아래에 있음).
pt_br: Como na cena do ``Jogador``, adicione um ``CapsuleShape2D`` para a colisão. Para alinhar a forma com a imagem, você precisará definir a propriedade ``Rotation Degrees`` (graus de rotação) como ``90`` na seção ``Node2D``.
ru: Как и в сцене ``Player``, добавьте форму ``CapsuleShape2D`` для расчета столкновений. Чтобы выровнять фигуру с изображением, вам нужно установить свойство ``Rotation Degrees`` на значение ``90`` (в разделе "Transform" в инспекторе).
uk: Як і в сцені ``Player``, додайте ``CapsuleShape2D`` для зіткнення. Щоб вирівняти фігуру із зображенням, потрібно встановити властивість ``Rotation Degrees``(градус поворота) на ``90`` (під "Transform" в Інспекторі).
zh_tw: 與 ``Player`` 場景中一樣，新增 ``CapsuleShape2D`` 來設定碰撞區域。你會需要將 ``Rotation Degrees`` （旋轉角度）屬性設定為 ``90`` 才能將形狀對齊圖片（這個屬性在屬性面板中的「Transform」（變形）底下）。

source: Save the scene.
cs: Ulož scénu.
de: Speichern Sie die Szene.
es: Guarda la escena.
fr: Enregistrer la scène.
it: Salva Scena.
ja: シーンを保存します。
ko: 씬을 저장하세요.
pt_br: Salvar Cena.
ru: Сохраните сцену.
uk: Зберегти сцену.
zh_tw: 保存場景。

source: Enemy script
cs: Skript nepřítele
de: Feind-Skript
es: Script del enemigo
fr: Script de l'ennemi
it: Script del nemico
ja: Enemyスクリプト
ko: 적 스크립트
pt_br: Script do inimigo
ru: Скрипт врага
uk: Скрипт ворога
zh_cn: 敌人的脚本
zh_tw: 敵人腳本

source: Add a script to the ``Mob`` and add the following member variables:
cs: Ke scéně ``Mob`` přidej skript a vytvoř následující členské proměnné:
de: Fügen Sie ein Skript zur ``Mob``-Szene hinzu und fügen Sie im Skript folgende Member-Variablen ein:
es: Añade un script al nodo ``Mob`` y luego añade las siguientes variables miembro:
fr: Ajouter un script au ``Mob`` et ajouter les variables membres suivantes :
it: Aggiungi uno script a ``Mob`` e le seguenti variabili membro:
ja: ``Mob`` にスクリプトを追加し、次のメンバー変数を追加します:
ko: ``Mob``\ 에게 스크립트를 추가해주고 다음 멤버 변수를 추가해주세요:
pl: Dodaj skrypt do ``Mob`` i dodaj do niego następujące zmienne:
pt_br: Adicione um roteiro ao nó ``Turba`` e adicione as seguintes variáveis membros:
ru: Прикрепите скрипт к ``Mob`` и добавьте следующие переменные:
uk: Додайте скрипт до ``Mob`` та додайте такі змінні:
zh_cn: 将脚本添加到 ``Mob`` 并添加以下成员变量：
zh_tw: 為 ``Mob`` 新增一個腳本，並新增下列成員變數：

source: When we spawn a mob, we'll pick a random value between ``min_speed`` and ``max_speed`` for how fast each mob will move (it would be boring if they were all moving at the same speed).
cs: Když se narodí nepřítel, pro jeho rychlost pohybu vybereme náhodnou hodnotu mezi ``min_speed`` and ``max_speed`` (byla by to nuda, kdyby se všichni pohybovali stejné rychle).
de: Wir wählen mit einem Zufallswert zwischen ``min_speed`` und ``max_speed``, wie schnell sich jeder Gegner bewegen wird (es wäre trivial, würden sich alle mit der selben Geschwindigkeit fortbewegen). Stelle sie im Inspektor auf ``150`` und ``250``. Wir haben auch einen Array mit den Namen der drei Animationen, mit dessen Hilfe wir eine Zufällige auswählen können.
es: Cuando creamos un "mob", tomaremos un número al azar entre ``min_speed`` y ``max_speed`` para decidir cuán rápido se debe mover cada uno (sería aburrido si todos se moviesen a la misma velocidad).
fr: Quand nous faisons apparaître un monstre, Nous allons prendre une valeur aléatoire entre ``min_speed`` et ``max_speed`` pour la vitesse à laquelle chaque monstre se déplacera (ce serait ennuyant s'ils bougeaient tous à la même vitesse).
it: Quando viene generato un nemico, sceglieremo un valore casuale tra ``min_speed``` e ``max_speed``` per regolare la velocità con cui ogni nemico si muoverà (sarebbe noioso se si muovessero tutti alla stessa velocità).
ja: モブを生み出す時、各モブの移動速度について ``min_speed`` と ``max_speed`` の間のランダムな値を選択します (すべて同じ速度で移動していると退屈なので)。
ko: 모든 몹이 같은 속도로 움직인다면 지루하기 때문에 몹을 생성할 때 각 몹이 이동하는 속도에 대해 ``min_speed``\ 와 ``max_speed`` 사이의 임의의 값을 선택할 것입니다.
pt_br: Quando gerarmos um inimigo, vamos escolher um valor aleatório entre ``min_speed`` (velocidade mínima) e ``max_speed`` (velocidade máxima) para definir a velocidade com que cada inimigo irá se mover (seria bem entediante se todos eles se movessem na mesma velocidade).
ru: Когда мы порождаем моба, мы выбираем случайное значение между ``min_speed`` и ``max_speed`` для того, как быстро будет двигаться каждый моб (было бы скучно, если бы все они двигались с одинаковой скоростью).
uk: Коли наш ворог створюється, він обирає випадкове значення між ``min_speed`` і ``max_speed`` щоби визначити свою особисту швидкість (було б нудно, якби вони рухалися з однаковою швидкістю).
zh_tw: 當產生怪物時，我們會在 ``min_speed`` 與 ``max_speed`` 間取一個隨機數，用來判斷怪物需要移動多快（因為如果所有怪物都用同樣速度移動的話會很無聊）。

source: Now let's look at the rest of the script. In ``_ready()`` we randomly choose one of the three animation types:
cs: Nyní se podívejme na zbytek skriptu. V ``_ready()`` náhodně vybereme jeden ze tří typů animací:
de: Lassen Sie uns nun den Rest des Skripts betrachten. In ``_ready()`` wählen wir zufällig einen der drei Animationstypen:
es: Ahora veamos el resto del script. En ``_ready()`` seleccionaremos al azar una de las tres animaciones:
fr: Maintenant, regardons le reste du script. Dans ``_ready()``, nous choisissons aléatoirement l'un des trois types d'animations :
it: Ora guardiamo il resto della sceneggiatura. In ``_ready()`` scegliamo casualmente uno dei tre tipi di animazione:
ja: それでは、スクリプトの残りの部分を見てみましょう。 ``_ready()`` では、次の3つのアニメーションタイプのいずれかをランダムに選択します:
ko: 이제 스크립트의 나머지를 봅시다. ``_ready()`` 에서 우리는 무작위로 세 개의 애니메이션 유형 중 하나를 고릅니다:
pl: Spójrzmy teraz na resztę skryptu. W ``ready()`` losowo wybieramy jeden z trzech typów animacji:
pt_br: Agora, vamos ver o resto do roteiro. Em ``_ready () ``, escolhemos aleatoriamente um dos três tipos de animação:
ru: Теперь давайте посмотрим на остальную часть скрипта. В функции ``_ready()`` мы случайным образом выбираем один из трех типов анимации:
uk: Тепер давайте розглянемо решту скрипту. В ``_ready()`` ми випадковим чином вибираємо одну з трьох типів анімації:
zh_cn: 现在让我们看一下脚本的其余部分。在 ``_ready()`` 中，我们从三个动画类型中随机选择一个：
zh_tw: 現在來看看腳本剩下的部分。我們在 ``_ready()`` 中隨機在三種動畫中選擇一個：
