Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: You can detect whether a key is pressed using ``Input.is_action_pressed()``, which returns ``true`` if it's pressed or ``false`` if it isn't.
cs: Zda je klávesa stisknuta můžete zjistit pomocí funkce ``Input.is_action_pressed()``, která vrací ``true``, pokud je stisknuta, nebo ``false``, pokud není.
de: Sie können herausfinden, ob eine Taste gedrückt wird, indem Sie ``Input.is_action_pressed()`` benutzen, welches ``true`` zurückgibt, wenn eine Taste gedrückt wird und ``false`` wenn nicht.
es: Puedes detectar si una tecla se está presionando usando ``Input.is_action_pressed()``, lo que devuelve ``true`` si está presionada o ``false`` en caso contrario.
fr: Vous pouvez détecter si une touche est pressée en utilisant ``Input.is_action_pressed()``, qui retourne ``true`` s'il elle est pressée ou ``false`` si elle ne l'est pas.
it: Puoi rilevare quando un pulsante è premuto usando ``Input.is_action_pressed()``, che ritorna ``true`` se è premuto o ``false`` se non lo è.
ja: キーが押されているかどうかを ``Input.is_action_pressed()`` を使用して検出できます。これは、押された場合は ``true`` 、押されていない場合は ``false`` を返します。
ko: ``Input.is_action_pressed()``\ 를 사용해서 키가 눌러졌는지를 감지할 수 있는데, 눌러지면 ``true`` 값을 반환하고 그렇지 않으면 ``false`` 값을 반환합니다.
pt_br: Você pode detectar se uma tecla é pressionada usando ``Input.is_action_pressed()``, que retorna ``true`` (verdadeiro) se é pressionada ou ``false`` (falso) em caso contrário.
ru: Вы можете определить, нажата ли клавиша с помощью функции ``Input.is_action_pressed()``, которая возвращает ``true``, если клавиша нажата, или ``false``, если нет.
uk: Ви можете визначити, чи натиснута кнопка за допомогою функції `` Input.is_action_pressed () ``, яка повертає `` true``, якщо клавіша натиснута або `` false``, якщо немає.
zh_tw: 可以用 ``Input.is_action_pressed()`` 來偵測按鍵是否被按下。這個函式會在按鍵被按下時回傳 ``true`` ，若沒按下則會回傳 ``false`` 。

source: We start by setting the ``velocity`` to ``(0, 0)`` - by default, the player should not be moving. Then we check each input and add/subtract from the ``velocity`` to obtain a total direction. For example, if you hold ``right`` and ``down`` at the same time, the resulting ``velocity`` vector will be ``(1, 1)``. In this case, since we're adding a horizontal and a vertical movement, the player would move *faster* diagonally than if it just moved horizontally.
cs: Začneme nastavením ``velocity`` na ``(0, 0)`` - ve výchozím nastavení by se hráč neměl pohybovat. Pak zkontrolujeme každý vstup a přidáme / odečteme z ``velocity``, abychom získali celkový směr. Například pokud podržíte ``right`` a ``down`` současně, bude výsledný vektor ``velocity`` ``(1, 1)``. V tomto případě, protože přidáváme vodorovný a svislý pohyb, by se hráč pohyboval *rychleji* diagonálně, než kdyby se pohyboval vodorovně.
de: Wir fangen damit an, die ``velocity`` (Geschwindigkeit) auf ``(0,0)`` zu setzen - standardmäßig sollte sich der Spieler nicht bewegen. Dann überprüfen wir jede Eingabe und addieren/subtrahieren von der ``velocity``, um eine Gesamtrichtung zu erhalten. Wenn Sie beispielsweise ``rechts`` und ``runter`` gleichzeitig halten, ist der resultierende ``velocity``-Vektor ``(1, 1)``. In diesem Fall, da wir eine horizontale und vertikale Bewegung addieren, würde sich der Spieler *schneller* bewegen, als wenn er sich nur horizontal bewegen würde.
es: Comenzaremos colocando ``velocity`` en ``(0,0)`` - por defecto, el jugador no se debería estar moviendo. Luego revisamos cada entrada y sumamos o restamos de ``velocity`` para obtener la dirección. Por ejemplo, si mantienes ``right`` (derecha) y ``down`` (abajo) al mismo tiempo, el resultado del vector ``velocity`` será ``(1,1)``. En este caso, como estamos agregando un movimiento horizontal y vertical, el jugador podrá moverse *más rápido* que si solo se estuviese moviendo horizontalmente.
fr: Nous commençons par régler ``velocity`` à ``(0, 0)`` - par défaut le joueur ne doit pas bouger. Ensuite nous vérifions chaque entrées et les ajoutons ou les soustrayons à la ``velocity`` pour obtenir une direction totale. Par exemple, si vous maintenez ``right`` et ``down`` en même temps, le vecteur ``velocity`` résultant sera ``(1, 1)``. Dans ce cas, puisque nous ajoutons un mouvement horizontal et un mouvement vertical, le joueur se déplacerait *plus vite* que s'il se déplaçait horizontalement.
it: Iniziamo impostando la ``velocity`` a ``(0, 0)`` - di default il giocatore non dovrebbe muoversi. Poi controlliamo ogni input e aggiungiamo/sottraiamo da ``velocity`` per ottenere una direzione globale. Per esempio, se tieni premuto ``destra`` e ``giù`` allo stesso tempo, il vettore ``velocity`` che otterremo sarà ``(1, 1)``. In questo caso, dato che stiamo sommando un movimento orizzontale e uno verticale, il giocatore si muoverà *più* *velocemente* in diagonale rispetto al solo movimento orizzontale.
ja: まず ``velocity`` を ``(0, 0)`` に設定することから始めます - デフォルトでは、プレイヤーは動いてはいけません。次に、各入力をチェックし、 ``velocity`` から加算/減算して全体の方向を取得します。たとえば、 ``右`` と ``下`` を同時に押した場合、結果の ``velocity`` ベクトルは ``(1, 1)`` になります。この場合、水平方向と垂直方向の動きを追加しているため、プレイヤーは水平方向に移動した場合よりも、斜め方向に\ *速く*\ 移動します。
ko: 먼저 ``velocity``\ 를 ``(0, 0)``\ 으로 설정합니다. 기본적으로 플레이어는 움직이지 않아야 합니다. 그런 다음 각 입력을 확인하고 ``velocity``\ 에서 더하거나 빼서 최종 방향을 얻습니다. 예를 들어, ``오른쪽 방향키``\ 와 ``아래쪽 방향키``\ 을 동시에 누르고 있으면 결과 ``velocity`` 벡터는 ``(1, 1)``\ 이 됩니다. 이 경우 동시에 수평과 수직 방향으로 이동하기 때문에 플레이어는 수평으로 이동할 때보다 대각선으로 *더 빠르게* 이동합니다.
pt_br: Iniciamos definindo a ``velocidade`` como sendo ``(0, 0)`` - por padrão o jogador não deve estar se movendo. Então nós verificamos cada entrada e adicionamos/subtraímos da ``velocidade`` para obter a direção resultante. Por exemplo, se você segurar ``direita`` e ``baixo`` ao mesmo tempo, o vetor resultante ``velocidade`` será ``(1, 1)``. Neste caso, já que estamos adicionando um movimento vertical e um horizontal, o jogador iria se mover *mais rápido* do que se apenas se movesse horizontalmente.
ru: Начнём с того, что установим значение ``velocity`` в``(0, 0)`` - по умолчанию игрок двигаться не должен. Затем, мы проверяем каждый ввод и добавляем/вычитаем значение из ``velocity``, чтобы получить общее направление. Например, если вы одновременно удерживаете ``right`` и ``down``, полученный вектор ``velocity`` будет ``(1, 1)``. В этом случае, поскольку мы добавляем горизонтальное и вертикальное движение, игрок будет двигаться *быстрее*, чем если бы он перемещался только по горизонтали.
uk: Почнемо з того, що встановимо значення `` velocity`` в`` (0, 0) `` - за замовчуванням гравець рухатися не повинен. Потім, ми перевіряємо кожен введення і додаємо / віднімаємо значення з `` velocity``, щоб отримати загальний напрямок. Наприклад, якщо ви одночасно утримуєте `` right`` і `` down``, отриманий вектор `` velocity`` буде `` (1, 1) ``. В цьому випадку, оскільки ми додаємо горизонтальне і вертикальний рух, гравець буде рухатися * швидше *, ніж якби він переміщався тільки по горизонталі.
zh_tw: 我們先從設定 ``velocity`` (速率) 開始，設定成 ``(0, 0)`` ——這表示在預設情況下，玩家應該不會移動。接著依據不同的輸入來增加／減少 ``velocity`` 來往不同方向移動。例如，如果同時按住 ``右`` 與 ``下`` 方向鍵，最終的 ``velocity`` 向量值應該是 ``(1, 1)`` 。因為這個情況下我們同時增加了水平與垂直方向的移動距離，所以玩家的移動速度應該比只在水平方向上移動 **還要快** 。

source: We can prevent that if we *normalize* the velocity, which means we set its *length* to ``1``, then multiply by the desired speed. This means no more fast diagonal movement.
cs: Můžeme tomu zabránit, pokud *normalizujeme* vektor rychlosti, což znamená, že nastavíme jeho *velikost* na ``1``, a vynásobíme jej velikostí požadované rychlostí. To znamená, už žádné rychlé diagonální pohyby.
de: Wir können das verhindern, indem wir die Geschwindigkeit *normalisieren*, was bedeutet, dass wir ihre *Länge* auf ``1`` festlegen, anschließend multiplizieren wir mit der gewünschten Geschwindigkeit. Das sorgt dafür, dass keine schnelle diagonale Bewegung mehr stattfindet.
es: Podemos prevenir eso *normalizando* ``velocity``, lo que significa que su *longitud* será ``1``, y multiplicando por la velocidad total deseada. Esto hará que el movimiento diagonal no sea más rápido.
fr: Nous pouvons empêcher cela si nous *normalisons* la vitesse, ce qui signifie que nous réglons sa *longueur* à ``1``, et la multiplions par la vitesse désirée. Cela signifie qu'il n'y a plus de mouvement diagonal rapide.
it: Possiamo prevenire ciò *normalizzando* la velocità, che significa impostare la sua *lunghezza* a ``1``, dopodiché possiamo moltiplicare il vettore per la velocità desiderata. In questo modo possiamo evitare i movimenti diagonali a velocità maggiore.
ja: 加速度を\ *正規化*\ すれば、これを防ぐことができます。つまり、速度の\ *長さ*\ を ``1`` に設定し、それから希望の速度を乗算します。これは、これ以上速い対角移動がないことを意味します。
ko: 우리는 velocity를 *정규화(normalize)*\하면, 즉 velocity의 *길이(length)*\ 를 ``1``\ 로 설정한 다음, 원하는 속도를 곱하면 이 문제를 방지할 수 있습니다. 이렇게 하면 더 이상 대각선 방향 이동속도가 더 빠르지 않습니다.
pt_br: Podemos evitar isso se *normalizarmos* a velocidade, o que significa que podemos definir seu *comprimento* (módulo) para ``1`` e multiplicar pela velocidade desejada. Isso resolve o problema de movimentação mais rápida nas diagonais.
ru: Можно избежать этого, если мы *нормализуем* скорость, что означает, что мы устанавливаем ее *длину* на ``1`` и умножаем на желаемую скорость. Это означает отсутствие более быстрого диагонального движения.
uk: Можна уникнути цього, якщо ми * нормалізуємо * швидкість, що означає, що ми встановлюємо її * довжину * на `` 1`` і множимо на бажану швидкість. Це означає відсутність більш швидкого діагонального руху.
zh_tw: 我們可以通過 **正規化** (Normalize) 速率來防止這種情況，也就是要把移動的 **距離** 設定為 ``1`` ，接著乘以需要的速度。這表示在對角線上移動不會比水平移動還要快了。

source: If you've never used vector math before, or need a refresher, you can see an explanation of vector usage in Godot at :ref:`doc_vector_math`. It's good to know but won't be necessary for the rest of this tutorial.
cs: Pokud jste nikdy předtím nepoužívali vektorovou matematiku, nebo potřebujete málé opáčko, používání vektorů v Godotu najdete na :ref:`doc_vector_math`. Je dobré vektory znát, ale po zbytek tohoto tutoriálu to nebude nutné.
de: Wenn Sie noch nie zuvor Vektor-Mathematik verwendet haben oder eine Auffrischung benötigen, finden Sie eine Erklärung zur Vektorverwendung in Godot unter :ref:`doc_vector_math`. Es ist gut zu wissen, wird aber für den Rest dieser Anleitung nicht notwendig sein.
es: Si no has usado antes cálculo vectorial, o necesitas un repaso, puedes ver una explicación de la utilización de vectores en Godot en :ref:`doc_vector_math`. Es bueno saberlo pero no será necesario para el resto de este tutorial.
fr: Si vous n'avez jamais utilisé les mathématiques vectorielles auparavant, ou si vous avez besoin d'un rafraîchissement, vous pouvez voir une explication de l'utilisation des vecteurs dans Godot à :ref:`doc_vector_math`. C'est bon à savoir mais ça ne sera pas nécessaire pour le reste de ce tutoriel.
it: Se non hai mai usato la matematica vettoriale prima d'ora, oppure hai bisogno di una rinfrescata, puoi vedere una spiegazione sull'uso dei vettori in Godot a v:ref:`doc_vector_math`. È buona cosa da sapere, ma non sarà necessario per il resto di questo tutorial.
ja: 以前にベクトル演算を使用したことがない場合、あるいは忘れてしまった場合は、\ :ref:`doc_vector_math`\ でGodotのベクトル使用の説明をみることができます。これは知っておくと良いですが、このチュートリアルの残りの部分では必要ないでしょう。
ko: 이제까지 벡터 수학을 안 써봤거나 복습이 필요하다면 :ref:`doc_vector_math`\ 에서 Godot에서 벡터를 어떻게 사용하는지 볼 수 있습니다. 보면 좋지만 나머지 튜토리얼을 위해 꼭 필수적인 것은 아닙니다.
pl: Jeśli nigdy wcześniej nie używałeś matematyki wektorowej lub potrzebujesz przypomnienia, możesz zobaczyć wyjaśnienie użycia wektorów w Godot :ref:`doc_vector_math`. Dobrze jest wiedzieć, ale nie będzie to konieczne dla reszty tego poradnika.
pt_br: Se você nunca usou matemática vetorial antes, ou precisa refrescar a memória, você pode ver uma explicação do uso de vetores no Godot em :ref:`doc_vector_math`. É bom conhecê-la, mas não será necessário para o resto deste tutorial.
ru: Если вы никогда раньше не использовали векторную математику или нуждаетесь в повторении, вы можете увидеть объяснение использования вектора в Godot по ссылке :ref:`doc_vector_math`. Ее полезно знать, но она не понадобится для остальной части этого урока.
uk: Якщо ви ніколи раніше не використовували векторну математику, або вам потрібно освіжити знання, ви можете побачити пояснення по використанню векторів у Godot у :ref:`doc_vector_math`. Це добре знати, але це не буде потрібно для решти цього уроку.
zh_cn: 如果您以前从未使用过向量数学，或者需要复习，可以在Godot中的 :ref:`doc_vector_math` 上查看向量用法的解释。最好了解一下，但对于本教程的其余部分而言，这不是必需的。
zh_tw: 如果你從來沒學習過向量數學運算或是需要複習的話，可以參考這篇 :ref:`doc_vector_math` 瞭解 Godot 中是如何使用向量的。雖然對於這篇本篇教學剩下的部分來說不必要，但若能瞭解 Godot 中的向量是最好不過的了。

source: We also check whether the player is moving so we can call ``play()`` or ``stop()`` on the AnimatedSprite.
cs: Také ověříme zda se hráč pohybuje, takže na můžeme volat metody ``play ()`` nebo ``stop ()`` uzlu AnimatedSprite.
de: Wir prüfen auch, ob sich der Spieler bewegt, damit wir die AnimatedSprite-Animation mit ``play()`` und ``stop()``, starten oder stoppen können.
es: También revisaremos si el jugador (player) se está moviendo llamar a ``play()`` (comenzar) o ``stop()`` (detener) en el AnimatedSprite.
fr: Nous vérifions également si le joueur se déplace afin de pouvoir appeler ``play()`` ou ``stop()`` sur l'AnimatedSprite.
it: Possiamo anche controllare se il giocatore si sta muovendo così possiamo chiamare ``play()`` o ``stop()`` sul nodo AnimatedSprite.
ja: また、AnimatedSpriteの ``play()`` または ``stop()`` を呼び出せるようにするため、プレイヤーが移動中かどうかも確認します。
ko: 이제 AnimatedSprite에서 ``play()``\ 와 ``stop()``\ 을 호출할 수 있도록 플레이어가 움직이고 있는지를 확인할 것입니다.
pt_br: Nós também verificamos se o jogador está se movendo, para que possamos iniciar ou parar a animação do AnimatedSprite.
ru: Мы также проверяем, движется ли игрок, чтобы мы могли вызвать ``play()`` или ``stop()`` на AnimatedSprite.
uk: Ми також перевіряємо, чи програвач рухається, щоб ми могли викликати `` play () `` або `` stop () `` на AnimatedSprite.
zh_tw: 同時也需要檢查玩家有沒有在移動，這樣才能呼叫 AnimatedSprite 上的 ``play()`` 跟 ``stop()`` 。

source: ``$`` is shorthand for ``get_node()``. So in the code above, ``$AnimatedSprite.play()`` is the same as ``get_node("AnimatedSprite").play()``.
cs: ``$`` je zkratka pro ``get_node()``. Takže ve výše uvedeném kódu je ``$AnimatedSprite.play()`` stejný jako ``get_node("AnimatedSprite").Play()``.
de: ``$`` ist eine Abkürzung für ``get_node()``. Im obigen Code ist ``$AnimatedSprite.play()`` dasselbe wie ``get_node("AnimatedSprite").play()``.
es: ``$`` es una abreviatura de``get_node()``. En el código anterior, ``$AnimatedSprite.play()`` es lo mismo que ``get_node("AnimatedSprite").play()``.
fr: ``$`` est un raccourci pour ``get_node()``. Dans le code ci-dessus, ``$AnimatedSprite.play()`` est donc identique à ``get_node("AnimatedSprite").play()``.
it: ``$`` è la versione breve per ``get_node()``. Quindi nel codice sopra, ``$AnimatedSprite.play()`` è uguale a ``get_node("AnimatedSprite").play()``.
ja: ``$`` は ``get_node()`` の省略形です。したがって、上記のコードでは、\ ``$AnimatedSprite.play()`` は ``get_node("AnimatedSprite").play()`` と同じです。
ko: ``$``\ 는 ``get_node()``\ 의 줄임말입니다. 그래서 위의 코드인 ``$AnimatedSprite.play()``\ 는 ``get_node("AnimatedSprite").play()``\ 와 같습니다.
pl: ``$`` jest skrótem od ``get_node()``. Tak więc w kodzie powyżej, ``$AnimatedSprite.play()`` jest taki sam jak ``get_node("AnimatedSprite").play()``.
pt_br: ``$`` é um atalho para ``get_node()``. Então, no código acima, ``$AnimatedSprite.play()`` é o mesmo que ``get_node("AnimatedSprite").play()``.
ru: ``$`` является сокращением для ``get_node()``. Поэтому в приведенном выше коде ``$AnimatedSprite.play()`` это то же самое, что и ``get_node("AnimatedSprite").play()``.
uk: ``$``це скорочення для ``get_node()``. Так що в наведеному вище коді ``$AnimatedSprite.play()`` це те саме, що і ``get_node("AnimatedSprite").play()``.
zh_cn: ``$`` 是 ``get_node()`` 的简写。因此在上面的代码中， ``$AnimatedSprite.play()`` 与 ``get_node("AnimatedSprite").play()`` 相同。
zh_tw: ``$`` 是 ``get_node()`` 的簡寫。所以上面的程式碼中 ``$AnimatedSprite.play()`` 等同於 ``get_node("AnimatedSprite").play()`` 。

source: In GDScript, ``$`` returns the node at the relative path from the current node, or returns ``null`` if the node is not found. Since AnimatedSprite is a child of the current node, we can use ``$AnimatedSprite``.
cs: V GDScript, ``$`` vrací relativní cestu uzlu vzhledem k uzlu aktuálnímu, anebo ``null``, pokud uzel nebyl nalezen. Protože AnimatedSprite je potomkem aktuálního uzlu, můžeme použít ``$AnimatedSprite``.
de: In GDScript gibt ``$`` den Node am relativen Pfad zum aktuellen Node zurück oder ``null``, wenn der Node nicht gefunden wird. Da AnimatedSprite ein Unterobjekt des aktuellen Nodes ist, können wir ``$AnimatedSprite`` verwenden.
es: En GDScript, ``$`` retorna el nodo acorde a la ruta relativa al nodo actual, o ``null`` si no se encuentra el nodo. Como AnimatedSprite es hijo del nodo actual, podemos utilizar ``$AnimatedSprite``.
fr: En GDScript, ``$`` retourne le nœud au chemin relatif depuis ce nœud, ou retourne ``null`` si le nœud n'est pas trouvé. Puisque AnimatedSprite est un enfant du nœud courant, nous pouvons utiliser ``$AnimatedSprite``.
it: In GDScript, ``$`` ritorna il percorso relativo del nodo che ci serve dal nodo corrente, altrimenti ritorna ``null`` se il nodo non è stato trovato. Siccome AnimatedSprite è figlio del nodo corrente, possiamo usare ``$AnimatedSprite``.
ja: GDScriptでは、\ ``$`` は現在のノードからの相対パスにあるノードを返し、ノードが見つからない場合は ``null`` を返します。 AnimatedSpriteは現在のノードの子であるため、\ ``$AnimatedSprite`` を使用できます。
ko: GDScript에서, ``$``\ 는 현재 노드에서 상대적인 경로에 있는 노드를 반환하거나, 노드가 없다면 ``null`` 값을 반환합니다. AnimatedSprite가 현재 노드의 자식인 상태이므로, ``$AnimatedSprite``\ 를 사용할 수 있습니다.
pt_br: Em GDScript, ``$`` retorna o nó no caminho relativo a partir deste nó, ou retorna ``null`` (nulo) se o nó não for encontrado. Já que AnimatedSprite é um filho do nó atual, podemos usar ``$AnimatedSprite``.
ru: В GDScript, ``$`` возвращает узел по относительному пути от текущего узла или возвращает ``null``, если узел не найден. Поскольку AnimatedSprite является дочерним элементом текущего узла, мы можем использовать ``$AnimatedSprite``.
uk: У GDScript ``$`` повертає вузол на відносний шлях від поточного вузла, або повертає ``null`` якщо вузол не знайдено. Оскільки AnimatedSprite є нащадком поточного вузла, ми можемо використовувати ``$AnimatedSprite``.
zh_cn: 在GDScript中，``$`` 返回在当前节点的相对路径处的节点，如果找不到该节点，则返回 ``null``。由于AnimatedSprite是当前节点的子项，因此我们可以使用 ``$AnimatedSprite``。
zh_tw: 在 GDScript 中， ``$`` 會回傳與目前節點相對路徑上的節點，若找不到則會回傳 ``null`` 。由於 AnimatedSprite 是目前節點的子節點，所以可以寫成 ``$AnimatedSprite`` 。

source: Now that we have a movement direction, we can update the player's position. We can also use ``clamp()`` to prevent it from leaving the screen. *Clamping* a value means restricting it to a given range. Add the following to the bottom of the ``_process`` function (make sure it's not indented under the `else`):
cs: Nyní, když máme směr pohybu, můžeme aktualizovat pozici hráče. Můžeme také použít ``clamp()``, abychom zabránili opuštění obrazovky. *Clamp* hodnotu znamená omezit ji na určitý rozsah. Na konec funkce ``_process`` přidejte následující (ujistěte se, že není odsazeno jako pokračování větve `else`):
de: Jetzt, da wir eine Bewegungsrichtung haben, können wir die Position des Spielers aktualisieren und mit ``clamp()`` verhindern, dass er den Bildschirm verlässt. ``clamp()`` beschränkt dabei einen Wert auf einen angegebenen Bereich. Am Ende der ``_process`` Funktion fügen wir also folgendes hinzufügen:
es: Ahora que tenemos la dirección del movimiento, podemos actualizar la posición de ``Player``. También podemos usar ``clamp()`` para prevenir que abandone la pantalla. Aplicar *clamp* quiere decir que vamos a restringir un valor a un determinado rango. Agrega lo siguiente al final de la función ``_process`` (asegúrate de que no esté indentada dentro del else):
fr: Maintenant que nous avons une direction de mouvement, nous pouvons mettre à jour la position du joueur. Nous pouvons aussi utiliser ``clamp()`` pour l'empêcher de quitter l'écran. *Clamping* une valeur signifie la limiter à une plage donnée. Ajoutez ce qui suit au bas de la fonction ``_process`` (assurez-vous que ce n'est pas indenté sous le `else`) :
it: Ora che abbiamo una direzione di movimento, possiamo aggiornare la posizione del player. Possiamo inoltre usare ``clamp()`` per prevenire che il player esca dallo schermo. Fare il *clamping* di un valore significa restringerlo ad un certo intervallo. Aggiungi il seguente codice sul fondo della funzione ``_process()`` (assicurati che non sia indentato sotto `else`):
ja: 移動方向がわかったので、プレイヤーの位置を更新します。\ ``clamp()`` を使用して、プレイヤーが画面を離れないようにします。\ *Clamping*\ の意味は長さに制限をかける事です。\ ``_process`` 関数の下部に追加して下さい (`else` までインデントしないように注意):
ko: 이동 방향이 있으므로 이제 플레이어의 위치를 업데이트할 수 있습니다. 또한 ``clamp()``\ 를 사용해 플레이어가 화면에서 나가는 것을 방지할 수 있습니다. *클램핑(Clamping)*\ 은 값을 주어진 범위로 제한하는 것을 의미합니다. ``_process`` 함수의 맨 아래에 다음을 추가합니다(`else` 아래에 들여쓰기가 되어 있지 않은지 확인하세요):
pt_br: Agora que temos uma direção de movimento, podemos atualizar a posição do jogador. Podemos também usar ``clamp()`` para impedir que ele saia da tela. *Clamp* (fixar) um valor significa restringi-lo a um determinado intervalo. Adicione o seguinte código embaixo da função ``_process``(Tenha certeza de que não está identado ao `else`):
ru: Теперь, когда у нас есть направление движения, мы можем обновить позицию игрока. Мы также можем использовать ``clamp()``, чтобы он не покинул экран. *Clamping* означает ограничение движения диапазоном. Добавьте следующее в конец функции ``_process`` (убедитесь, что он не имеет отступа под `else`):
uk: Тепер, коли у нас є напрямок руху, ми можемо оновити позицію гравця. Ми також можемо використовувати `` clamp () ``, щоб він не покинув екран. * Clamping * означає обмеження руху діапазоном. Додайте наступне в кінець функції `` _process`` (переконайтеся, що він не має відступу під `else`):
zh_cn: 现在我们有了一个运动方向，我们可以更新玩家的位置了。我们也可以使用 ``clamp()`` 来防止它离开屏幕。*clamp* 一个值意味着将其限制在给定范围内。将以下内容添加到 ``_process`` 函数的底部：
zh_tw: 現在玩家會面向不同方向了，可以接著來更新玩家的位置。還可以使用 ``clamp()`` (箝制) 來防止 Player 物件跑出畫面外。**箝制** 一個值，就代表把值限制在一個給定的範圍內。將下列程式碼放到 ``_process`` 函式的末尾 (記得確定不要放到 `else` 縮排下了)：
