Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Play the scene again and check that the animations are correct in each of the directions. When you're sure the movement is working correctly, add this line to ``_ready()`` so the player will be hidden when the game starts:
pl: Odtwórz scenę ponownie i sprawdź, czy animacje są poprawne w każdym z kierunków. Jeśli jesteś pewien, że ruch działa poprawnie, dodaj ten wiersz do ``ready()`` tak, by gracz był ukryty, kiedy gra się rozpocznie:

source: Preparing for Collisions
pl: Przygotowanie do kolizji

source: Add the following at the top of the script, after ``extends Area2d``:
pl: W górnej części skryptu, po ``extends Area2d``: dodaje się następujący tekst:

source: Notice our custom "hit" signal is there as well! Since our enemies are going to be ``RigidBody2D`` nodes, we want the ``body_entered( Object body )`` signal; this will be emitted when a body contacts the player. Click "Connect.." and then "Connect" again on the "Connecting Signal" window. We don't need to change any of these settings - Godot will automatically create a function called ``_on_Player_body_entered`` in your player's script.
pl: Zauważ, że nasz niestandardowy sygnał "hit" jest tam również! Ponieważ nasi wrogowie będą węzłami ``RigidBody2D``, chcemy sygnału ``body_entered( Object body )``; będzie on emitowany, gdy ciało zetknie się z graczem Kliknij "Połącz...", a następnie "Połącz" ponownie w oknie "Łączenie z sygnałem". Nie musimy zmieniać żadnego z tych ustawień - Godot automatycznie utworzy w skrypcie Twojego gracza funkcję ``_on_Player_body_entered``.

source: When connecting a signal, instead of having Godot create a function for you, you can also give the name of an existing function that you want to link the signal to.
pl: Podczas podłączania sygnału, zamiast domyślnie utworzenie funkcję, możesz również podać nazwę już istniejącej funkcji, z którą chcesz powiązać sygnał.

source: Add this code to the function:
pl: Dodaj ten kod do funkcji:

source: Disabling the area's collision shape means it won't detect collisions. By turning it off, we make sure we don't trigger the ``hit`` signal more than once.
pl: Wyłączenie kształtu obszaru kolizji oznacza, że nie wykryje on kolizji. Wyłączając go, upewniamy się, że nie wyzwalamy sygnału ``hit`` więcej niż raz.

source: The last piece for our player is to add a function we can call to reset the player when starting a new game.
pl: Ostatnim elementem dla naszego gracza jest dodanie funkcji, którą możemy wywołać, aby zresetować gracza podczas uruchamiania nowej gry.

source: Enemy Scene
pl: Scena - Wróg

source: Now it's time to make the enemies our player will have to dodge. Their behavior will not be very complex: mobs will spawn randomly at the edges of the screen and move in a random direction in a straight line, then despawn when they go offscreen.
pl: Teraz nadszedł czas, aby zrobić wrogów, których nasz gracz będzie musiał unikać. Ich zachowanie nie będzie zbyt skomplikowane: tłumy będą się pojawiać losowo na krawędziach ekranu i poruszać w losowym kierunku po linii prostej, a następnie usuwać się, gdy znikają z ekranu.

source: We will build this into a ``Mob`` scene, which we can then *instance* to create any number of independent mobs in the game.
pl: Zbudujemy to w scenie ``Mob``(Przeciwnik), której możemy utworzyć *instancje* czyli utworzyć dowolną wolną liczbę niezależnych przeciwników w grze.

source: Node Setup
pl: Konfiguracja węzła

source: Click Scene -> New Scene and we'll create the Mob.
pl: Kliknij Scena -> Nowa scena i stwórzmy Mob.

source: The Mob scene will use the following nodes:
pl: Scena Mob będzie korzystać z następujących węzłów:

source: :ref:`VisibilityNotifier2D <class_VisibilityNotifier2D>` (named ``Visibility``)
pl: :ref:`VisibilityNotifier2D <class_VisibilityNotifier2D>` (o nazwie ``Visibility``)

source: Set up the :ref:`AnimatedSprite <class_AnimatedSprite>` like you did for the player. This time, we have 3 animations: ``fly``, ``swim``, and ``walk``. Set the ``Playing`` property in the Inspector to "On" and adjust the "Speed (FPS)" setting as shown below. We'll select one of these animations randomly so that the mobs will have some variety.
pl: Skonfiguruj :ref:`AnimatedSprite <class_AnimatedSprite>` tak jak zrobiłeś to dla gracza. Tym razem mamy 3 animacje: ``fly``, ``swim`` i ``walk``. Ustawić właściwość ``Odtwarzanie`` w inspektorze na "Włączony" i dostosować ustawienie "Prędkość na sekundę", jak pokazano poniżej. Jedną z tych animacji wybierzemy losowo, tak aby przeciwnicy mieli jakąś różnorodność.

source: ``fly`` should be set to 3 FPS, with ``swim`` and ``walk`` set to 4 FPS.
pl: ``fly`` powinno wyświetlać się w 3 FPS, a ``swim`` i ``walk`` w 4 FPS.

source: As in the ``Player`` scene, add a ``CapsuleShape2D`` for the collision. To align the shape with the image, you'll need to set the ``Rotation Degrees`` property to ``90`` under ``Node2D``.
pl: Podobnie jak w przypadku sceny ``Player``, dodaj ``CapsuleShape2D`` dla kolizji. Aby wyrównać kształt z spritem, należy ustawić właściwość ``Rotation Degrees``(Kąt) na ``90`` pod ``Node2D``.

source: Enemy Script
pl: Skrypt Wroga

source: You must use ``randomize()`` if you want your sequence of "random" numbers to be different every time you run the scene. We're going to use ``randomize()`` in our ``Main`` scene, so we won't need it here. ``randi() % n`` is the standard way to get a random integer between ``0`` and ``n-1``.
pl: Musisz użyć ``randomize()``, jeśli chcesz, aby sekwencja liczb "losowych" różniła się za każdym razem, gdy uruchamiasz scenę. Będziemy używać ``randomize()`` w naszej scenie ``Main``, więc nie będziemy tego tutaj potrzebować. ``randi() % n`` jest standardowym sposobem uzyskania losowej liczby całkowitej pomiędzy ``0`` i ``n-1``.

source: The last piece is to make the mobs delete themselves when they leave the screen. Connect the ``screen_exited()`` signal of the ``Visibility`` node and add this code:
pl: Ostatnim krokiem jest zmuszenie przeciwników do samodzielnego usunięcia się po opuszczeniu ekranu. Trzeba podłączyć funkcję ``screen_exited()`` z sygnałem ``Visibility`` i dodać ten kod:

source: Main Scene
pl: Scena główna

source: Now add the following nodes as children of ``Main``, and name them as shown (values are in seconds):
pl: Teraz dodaj następujące węzły jako dzieci ``Main`` i nazwij je tak, jak pokazano na rysunku (wartości są w sekundach):

source: Spawning Mobs
pl: Tworzenie Przeciwników

source: Select the middle one ("Add Point") and draw the path by clicking to add the points at the corners shown. To have the points snap to the grid, make sure "Snap to Grid" is checked. This option can be found under the "Snapping options" button to the left of the "Lock" button, appearing as a series of three vertical dots.
pl: Wybierz środkowy ("Dodaj punkt") i narysuj ścieżkę, klikając, aby dodać punkty w wyświetlonych rogach. Aby punkty były wyrównane do siatki, sprawdź, czy zaznaczona jest opcja "Wyrównaj do siatki". Opcję tę można znaleźć pod przyciskiem "Opcje przyciągania" po lewej stronie przycisku "Zablokuj", pojawiającym się jako trzy pionowe kropki.

source: Main Script
pl: Główny skrypt

source: Add a script to ``Main``. At the top of the script we use ``export (PackedScene)`` to allow us to choose the Mob scene we want to instance.
pl: Dodaj skrypt do ``Main``. W górnej części skryptu używamy ``export (PackedScene)``, aby umożliwić nam wybór sceny Mob(Przeciwnika), którą chcemy wyświetlić.

source: Drag ``Mob.tscn`` from the "FileSystem" panel and drop it in the ``Mob`` property under the Script Variables of the ``Main`` node.
pl: Przeciągnij ``Mob.tscn`` z panelu "System plików" i upuść go we właściwość ``Mob`` pod zmiennymi skryptu węzła ``Main``.

source: Next, click on the Player and connect the ``hit`` signal. We want to make a new function named ``game_over``, which will handle what needs to happen when a game ends. Type "game_over" in the "Method In Node" box at the bottom of the "Connecting Signal" window. Add the following code, as well as a ``new_game`` function to set everything up for a new game:
pl: Następnie kliknij na Player i podłącz sygnał ``hit``. Chcemy stworzyć nową funkcję o nazwie ``game_over``, która będzie obsługiwać to, co musi się zdarzyć, gdy gra się skończy. Wpisz "game_over" w polu "Funkcje w węźle" u dołu okna "Łączenie sygnału". Dodaj następujący kod, jak również funkcję ``new_game``, aby skonfigurować wszystko, co jest skonfigurowane dla nowej gry:

source: In ``_on_MobTimer_timeout()`` we will create a mob instance, pick a random starting location along the ``Path2D``, and set the mob in motion. The ``PathFollow2D`` node will automatically rotate as it follows the path, so we will use that to select the mob's direction as well as its position.
pl: W ``on_MobTimer_timeout()``będziemy tworzyć instancję przeciwnika, wybieramy losową lokalizację początkową wzdłuż ``Path2D`` i wprawiamy przeciwnika w ruch. Węzeł ``PathFollow2D`` będzie się automatycznie obracał w miarę podążania ścieżką, więc będziemy go używać do wybierania kierunku i położenia przeciwników.

source: Add the following code:
pl: Dodaj poniższy kod:

source: In functions requiring angles, GDScript uses *radians*, not degrees. If you're more comfortable working with degrees, you'll need to use the ``deg2rad()`` and ``rad2deg()`` functions to convert between the two.
pl: W przypadku funkcji wymagających kąta, GDScript używa *radianów*, a nie stopni. Jeśli jest tobie łatwiej pracować ze stopniami, trzeba będzie użyć ``deg2rad()`` i ``rad2deg()`` do konwersji między tymi dwoma funkcjami.

source: The HUD displays the following information:
pl: HUD wyświetla następujące informacje:

source: :ref:`Label <class_Label>` named ``MessageLabel``.
pl: :ref:`Label <class_Label>` nazwany ``MessageLabel``.

source: Arrange the nodes as shown below. Click the "Anchor" button to set a Control node's anchor:
pl: Uporządkuj węzły w sposób pokazany poniżej. Kliknąć przycisk "Zakotwicz", aby ustawić dla węzła Control kotwicę:

source: ``Layout``: "Center Top"
pl: ``Layout``: "Górny Środek"

source: ``Margin``:
pl: ``Margines``:

source: Left: ``-25``
pl: Lewy: ``-25``

source: Top: ``0``
pl: Góra: ``0``

source: Right: ``25``
pl: Prawo: ``25``

source: Bottom: ``100``
pl: Dół: ``100``

source: Text: ``0``
pl: Tekst: ``0``

source: ``Layout``: "Center"
pl: ``Layout``: "Środek"

source: Left: ``-200``
pl: Lewy: ``-200``

source: Top: ``-150``
pl: Góra: ``-150``

source: Right: ``200``
pl: Prawy: ``200``

source: Bottom: ``0``
pl: Dół: ``0``

source: Text: ``Dodge the Creeps!``
pl: Tekst: ``Dodge the Creeps!``

source: ``Layout``: "Center Bottom"
pl: ``Layout``: "Środek Dół"

source: Left: ``-100``
pl: Lewy: ``-100``

source: Right: ``100``
pl: Prawy: ``100``

source: Text: ``Start``
pl: Tekst: ``Start``

source: The default font for ``Control`` nodes is small and doesn't scale well. There is a font file included in the game assets called "Xolonium-Regular.ttf". To use this font, do the following for each of the three ``Control`` nodes:
pl: Domyślna czcionka dla węzłów ``Control`` jest mała i nie skaluje się dobrze. W zasobach gry znajduje się plik czcionki o nazwie "Xolonium-Regular.ttf". Aby użyć tej czcionki, wykonaj następujące czynności dla każdego z trzech węzłów ``Control``:

source: Click on the "DynamicFont" you added, and under "Font Data", choose "Load" and select the "Xolonium-Regular.ttf" file. You must also set the font's ``Size``. A setting of ``64`` works well.
pl: Kliknij na dodaną "Dynamiczna czcionka", a następnie w polu "Ustawienia Czcionki" wybierz "Załaduj" i wybierz plik "Xolonium-Regular.ttf". Należy również ustawić ``Rozmiar`` czcionki. Ustawienie ``64`` powinno działać dobrze.

source: This function is called when we want to display a message temporarily, such as "Get Ready". On the ``MessageTimer``, set the ``Wait Time`` to ``2`` and set the ``One Shot`` property to "On".
pl: Ta funkcja jest wywoływana, gdy chcemy tymczasowo wyświetlić komunikat, taki jak "Przygotuj się". W ``MessageTimer`` ustaw ``Czas oczekiwania`` na ``2`` i ustaw właściwość ``Jednokrotny`` na "Włączone".

source: This function is called when the player loses. It will show "Game Over" for 2 seconds, then return to the title screen and show the "Start" button.
pl: Ta funkcja jest wywoływana, gdy gracz przegrywa. Przez 2 sekundy na ekranie będzie wyświetlał się napis "Game Over" (Koniec Gry), następnie powróci do ekranu tytułowego i pojawi się przycisk "Start".

source: This function is called in ``Main`` whenever the score changes.
pl: Funkcja ta jest wywoływana w ``Main`` przy każdej zmianie wyniku.

source: Connect the ``timeout()`` signal of ``MessageTimer`` and the ``pressed()`` signal of ``StartButton``.
pl: Podłączyć ``Timeout()`` do sygnału ``MessageTimer`` i ``naciśnięty()`` do sygnału ``StartButton``.

source: Now that we're done creating the ``HUD`` scene, save it and go back to ``Main``. Instance the ``HUD`` scene in ``Main`` like you did the ``Player`` scene, and place it at the bottom of the tree. The full tree should look like this, so make sure you didn't miss anything:
pl: Teraz, kiedy już stworzyłeś scenę ``HUD``, zapisz ją i wróć do `Main``. Stwórz instancję ``HUD`` w ``Main`` tak, jak zrobiłeś to ``Player`` scenę i umieść ją na dole drzewa. Pełne drzewo powinno wyglądać tak, więc upewnij się, że niczego nie przegapiłeś:

source: In the Node tab, connect the HUD's ``start_game`` signal to the ``new_game()`` function.
pl: W zakładce Węzeł należy podłączyć sygnał HUD'a ``start_game`` do funkcji ``new_game()``.

source: Finishing Up
pl: Kończenie

source: The default gray background is not very appealing, so let's change its color. One way to do this is to use a :ref:`ColorRect <class_ColorRect>` node. Make it the first node under ``Main`` so that it will be drawn behind the other nodes. ``ColorRect`` only has one property: ``Color``. Choose a color you like and drag the size of the ``ColorRect`` so that it covers the screen.
pl: Domyślnie szare tło nie jest zbyt atrakcyjne, więc zmieńmy jego kolor. Jednym ze sposobów na to jest użycie węzła :ref:`ColorRect <class_ColorRect>`. Stwórz pierwszy węzeł pod ``Main`` tak, aby był rysowany za innymi węzłami. ``ColorRect`` ma tylko jedną właściwość: ``Kolor``. Wybierz kolor, który chcesz i przeciągnij ``ColorRect`` tak, aby zakrył ekran.

source: You can also add a background image, if you have one, by using a ``Sprite`` node.
pl: Obraz tła można również dodać, jeśli taki istnieje, za pomocą węzła ``Sprite``.

source: Sound Effects
pl: Efekty dźwiękowe

source: Particles
pl: Cząsteczki

source: For one last bit of visual appeal, let's add a trail effect to the player's movement. Choose your ``Player`` scene and add a :ref:`Particles2D <class_Particles2D>` node named ``Trail``.
pl: Na koniec dodajmy efekt smugi do ruchu gracza. Wybierz swoją scenę i dodaj węzeł :ref:`Particles2D <class_Particles2D>` o nazwie ``Trail``.

source: There are a large number of properties to choose from when configuring particles. Feel free to experiment and create different effects. For the effect in this example, use the following settings:
pl: Konfiguracja cząsteczek jest bardzo prosta. Zachęcamy do eksperymentowania i tworzenia różnych efektów. Aby uzyskać efekt jak w tym przykładzie, należy użyć następujących ustawień:

source: You also need to create a ``Material`` by clicking on ``<null>`` and then "New ParticlesMaterial". The settings for that are below:
pl: Musisz również utworzyć ``Materiał`` klikając na ``<null>``, a następnie "New ParticlesMaterial". Poniżej znajdują się ustawienia w tym zakresie:

source: Click "New GradientTexture", then under "Gradient", click "New Gradient". You'll see a window like this:
pl: Kliknij "New GradientTexture", a następnie pod "Gradient", kliknij "Nowy Gradient". Zobaczysz takie okno:

source: The left and right boxes represent the start and end colors. Click on each and then click the large square on the right to choose the color. For the first color, set the ``A`` (alpha) value to around halfway. For the second, set it all the way to ``0``.
pl: Lewe i prawe okienko przedstawiają kolory początkowe i końcowe. Kliknij na każdym z nich, a następnie kliknij duży kwadrat po prawej stronie, aby wybrać kolor. Dla pierwszego koloru należy ustawić wartość ``A`` (alfa) na około połowę. Dla drugiego, ustaw go aż do ``0``.

source: See :ref:`Particles2D <class_Particles2D>` for more details on using particle effects.
pl: Zobacz :ref:`Particles2D <class_Particles2D>` aby uzyskać więcej szczegółów na temat wykorzystania efektów cząsteczkowych.

source: Project Files
pl: Pliki projektu

source: You can find a completed version of this project here: https://github.com/kidscancode/Godot3_dodge/releases
pl: Ukończoną wersję projektu można znaleźć pod adresem: https://github.com/kidscancode/Godot3_dodge/releases
