Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Click on the ``Player`` node and add an :ref:`AnimatedSprite <class_AnimatedSprite>` node as a child. The ``AnimatedSprite`` will handle the appearance and animations for our player. Notice that there is a warning symbol next to the node. An ``AnimatedSprite`` requires a :ref:`SpriteFrames <class_SpriteFrames>` resource, which is a list of the animations it can display. To create one, find the ``Frames`` property in the Inspector and click "[empty]" -> "New SpriteFrames". Click again to open the "SpriteFrames" panel:
cs: Klikněte na uzel ``Player`` a jako podřízený uzel přidejte :ref:`AnimatedSprite <class_AnimatedSprite>`. ``AnimatedSprite`` bude zabezpečovat vzhled a animace našeho hráče. Všimněte si, že vedle uzlu je varovný symbol. ``AnimatedSprite`` vyžaduje zdroj :ref:`SpriteFrames <class_SpriteFrames>`, což je seznam animací, které je schopen zobrazit. Chcete-li jej vytvořit, najděte v inspektoru vlastnost ``Frames`` a klikněte na "[empty]" -> "New SpriteFrames". Opětovným kliknutím otevřete panel „SpriteFrames“:
de: Klicken Sie auf den ``Player`` Node und fügen ein :ref:`AnimatedSprite <class_AnimatedSprite>` Node als Unterobjekt hinzu. Das ``AnimatedSprite`` übernimmt das Erscheinungsbild und die Animationen für unseren Spieler. Achten Sie auf das Warnsymbol neben dem Node . Ein ``AnimatedSprite`` benötigt eine :ref:`SpriteFrames <class_SpriteFrames>` Ressource, eine Liste der Animationen, die angezeigt werden können. Um eine zu erstellen suchen Sie die Eigenschaft ``Frames`` im Inspektor und klicken "[leer]" -> "Neues SpriteFrames". Nun sollte sich automatisch das Animationspanel öffnen:
es: Haz clic en el nodo ``Player`` y añade un nodo :ref:`AnimatedSprite <class_AnimatedSprite>` como hijo. El ``AnimatedSprite`` se encargará de la apariencia y las animaciones de nuestro jugador. Observa que hay un símbolo de advertencia junto al nodo. Un ``AnimatedSprite`` requiere un recurso :ref:`SpriteFrames <class_SpriteFrames>`, compuesto por una lista de las animaciones que puede mostrar. Para crear uno, busca la propiedad ``Frames`` en el Inspector y haz clic en "[empty]" -> "New SpriteFrames". Clic de nuevo para abrir el panel "SpriteFrames":
fr: Cliquez sur le nœud ``Player`` et ajoutez un nœud :ref:`AnimatedSprite <class_AnimatedSprite>` comme nœud enfant. ``AnimatedSprite`` s'occupera de l'apparence et des animations pour notre joueur. Notez qu'il y a un symbole d'avertissement à côté du nœud. Un ``AnimatedSprite`` nécessite une ressource :ref:`SpriteFrames <class_SpriteFrames>`, qui contient la liste des animations qu'il peut afficher. Pour en créer une, trouvez la propriété ``Frames`` dans l'Inspecteur et cliquez sur "[vide]" -> "Nouveau SpriteFrames". Cliquez à nouveau pour ouvrir le panneau "SpriteFrames" :
it: Clicca su il nodo ``Player`` e aggiungi un :ref:`AnimatedSprite <class_AnimatedSprite>` come figlio. Il nodo ``AnimatedSprite`` si occuperà dell'aspetto e delle animazioni del nostro giocatore. Nota che ci sarà un segnale di allarme vicino al nodo. Un ``AnimatedSprite`` richiede una risorsa :ref:`SpriteFrames <class_SpriteFrames>`, la quale è una lista di animazioni che può mostrare. Per crearne una, cerca la proprietà ``Frames`` nell'Inspector e clicca "[vuoto]" -> "Nuovo SpriteFrames". Clicca ancora per aprire il pannello "SpriteFrames":
ja: ``Player`` ノードをクリックし、\ :ref:`AnimatedSprite <class_AnimatedSprite>` ノードを子として追加します。 ``AnimatedSprite`` は、Playerの外観とアニメーションを処理します。ノードの横に警告マークがあることに注意してください。\ ` `AnimatedSprite`` には :ref:`SpriteFrames <class_SpriteFrames>` リソースが必要です。これは、表示できるアニメーションのリストです。作成するには、インスペクタで ``Frames`` プロパティを見つけ、「[空]」→「新規 SpriteFrames」をクリックします。これにより、SpriteFramesパネルが自動的に開きます:
ko: ``Player`` 노드를 클릭하고 :ref:`AnimatedSprite <class_AnimatedSprite>` 노드를 자식으로 추가하세요. ``AnimatedSprite``\ 는 플레이어의 모양과 애니메이션을 처리합니다. 노드 옆을 보면 주의 표시가 있습니다. ``AnimatedSprite``\ 에는 표시할 수 있는 애니메이션 목록인 :ref:`SpriteFrames <class_SpriteFrames>` 리소스가 필요합니다. 리소스를 만들려면 인스펙터(Inspector)에서 ``Frames`` 속성을 찾아, "[비었음]([empty])" -> "새 SpriteFrames(New SpriteFrames)"를 클릭하세요. 이러면 자동으로 "SpriteFrames" 패널이 열립니다:
pt_br: Clique no nó ``Jogador`` e adicione um nó :ref:`AnimatedSprite <class_AnimatedSprite>` (sprite animado) como filho. O ``AnimatedSprite`` irá lidar com a aparência e as animações do nosso jogador. Note que existe um símbolo de alerta ao lado do nó. Um ``AnimatedSprite`` exige um recurso do tipo :ref:`SpriteFrames <class_SpriteFrames>` (quadros de sprite), que é uma lista das animações que ele pode mostrar. Para criar um, encontre a propriedade ``Frames`` no Inspetor e clique em "[empty]" -> "Novo SpriteFrames". Clique novamente para abrir o painel de "SpriteFrames":
ru: Кликните на узел ``Player`` и добавьте дочерний узел :ref:`AnimatedSprite <class_AnimatedSprite>`. ``AnimatedSprite`` будет обрабатывать внешний вид и анимации для нашего игрока. Обратите внимание на символ предупреждения рядом с узлом. ``AnimatedSprite`` требует ресурс :ref:`SpriteFrames <class_SpriteFrames>`, который представляет собой список отображаемых анимаций. Чтобы его создать, найдите свойство ``Frames`` в окне инспектора и кликните на «[пусто]» -> «Новый SpriteFrames». Снова кликните в том же месте на ``SpriteFrames``, чтобы открыть панель:
uk: Натисніть на вузол ``Player`` і додайте йому в нащадки вузол :ref:`AnimatedSprite <class_AnimatedSprite>` (Анімація спрайту). ``AnimatedSprite`` оброблятиме зовнішній вигляд і анімацію для нашого гравця. Зауважте, що поруч із вузлом є символ попередження. ``AnimatedSprite`` вимагає ресурсу :ref:`SpriteFrames <class_SpriteFrames>` (кадри спрайту), який являє собою список кадрів, які він може відображати. Щоб створити його, знайдіть властивість ``Frames`` (Кадри) у Інспекторі та натисніть "[порожній]" -> "Нові SpriteFrames" (Нові кадри спрайту). Це має автоматично відкрити панель SpriteFrames (Кадри спрайту):
zh_tw: 點擊 ``Player`` 節點然後新增一個 :ref:`AnimatedSprite <class_AnimatedSprite>` 子節點。這個 ``AnimatedSprite`` 會負責處理玩家的外觀與動畫效果。可以注意到節點旁邊有一個警告圖示。所有 ``AnimatedSprite`` 都必須要有 :ref:`SpriteFrames <class_SpriteFrames>` 資源，裡面包含了所有能顯示的動畫。可以在屬性面板中 ``Frames`` (影格) 屬性上點選 [空] ->[新增 SpriteFrames] 來建立 SpriteFrames。再點擊一次就能打開 [SpriteFrames] 面板：

source: On the left is a list of animations. Click the "default" one and rename it to "walk". Then click the "New Animation" button to create a second animation named "up". Find the player images in the "FileSystem" tab - they're in the ``art`` folder you unzipped earlier. Drag the two images for each animation, named ``playerGrey_up[1/2]`` and ``playerGrey_walk[1/2]``, into the "Animation Frames" side of the panel for the corresponding animation:
cs: Vlevo je seznam animací. Klikněte na „výchozí“ a přejmenujte jej na "walk". Poté klikněte na tlačítko „Nová animace“ a vytvořte druhou animaci s názvem "up". Vyhledejte obrázky přehrávače na kartě "Souborový systém" - jsou ve složce ``art`` kterou jste dříve rozbalili. Přetáhněte dva obrázky pro každou animaci, pojmenované ``playerGrey_up [1/2]`` a ``playerGrey_walk [1/2]``, na stranu "Animation Frames" na panelu pro příslušnou animaci:
de: Auf der linken Seite befindet sich eine Liste von Animationen. Klicken Sie auf die "default" Animation und benennen sie in "walk" um. Dann klicken Sie auf die "hinzufügen" Schaltfläche, um eine zweite Animation "up" hinzuzufügen. Finden Sie die zwei Bilder, ``playerGrey_up[1/2]`` und ``playerGrey_walk[1/2]``, im "Dateisystem"-Reiter und ziehen diese in den "Animationsbilder"-Bereich zu den entsprechenden Animationen:
es: A la izquierda hay una lista de animaciones. Haz clic en la opción "default" y renómbrala a "walk". Luego haz clic en el botón "Nueva Animación" para crear una segunda animación llamada "up". Busca las imágenes en el panel "Sistema de Archivos", están en la carpeta ``art`` de la carpeta descomprimina anteriormente. Arrastra las dos imágenes, llamadas ``playerGrey_up[1/2]`` y ``playerGrey_walk[1/2]`` para cada animación a la sección "Cuadros de animación" que corresponde en el panel:
fr: A gauche, vous trouverez une liste d'animations. Cliquez sur "default" et renommez-la en "walk". Cliquez ensuite sur le bouton "New Animation" pour créer une deuxième animation nommée "up". Trouvez les images du joueur dans l'onglet "Système de fichiers" - elles se trouvent dans le dossier ``art`` que vous avez décompressé plus tôt. Faites glisser les deux images pour chaque animation, nommées ``playerGrey_up[1/2]`` et ``playerGrey_walk[1/2]``, dans le côté "Animation Frames" du panneau pour l'animation correspondante :
it: Sulla sinistra c'è un elenco di animazioni. Fai clic su quella chiamata "default" e rinominala in "walk". Quindi fare clic sul pulsante "Nuova animazione" per creare una seconda animazione denominata "up". Trova le immagini del giocatore nella scheda "FileSystem", si trovano nella cartella `` art`` che hai decompresso in precedenza. Trascina le due immagini per ogni animazione, chiamate `` playerGrey_up [1/2] `` e `` playerGrey_walk [1/2] ``, nella parte "Fotogrammi animazione" del pannello per l'animazione corrispondente:
ja: 左側にはアニメーションの一覧があります。「default」をクリックし、「walk」に名前を変更します。次に、「新規アニメーション」ボタンをクリックして、「up」という名前の 2 番目のアニメーションを作成します。 ``playerGrey_up[1/2]`` と ``playerGrey_walk[1/2]`` という名前の各アニメーションの 2 つの画像をパネルの 「アニメーション フレーム」側にドラッグします:
ko: 왼쪽에는 애니메이션 목록이 있습니다. "default"를 클릭하고 이름을 "right"로 바꾸세요. 그런 다음 "새 애니메이션(New Animation)" 버튼을 클릭해 "up"이라는 두 번째 애니메이션을 만드세요. "파일시스템(FileSystem)" 독에서 플레이어 이미지를 찾으세요. 이 이미지는 이전에 압축을 푼 ``art`` 폴더 안에 있습니다. ``playerGrey_up[1/2]``\ 와 ``playerGrey_walk[1/2]`` 두 개의 이미지를 해당 애니메이션에 대한 패널의 "애니메이션 프레임(Animation Frame)" 쪽으로 끌어다 놓으세요:
pt_br: À esquerda está uma lista de animações. Clique em "default" e a renomeie para "caminhar". Então, clique no botão "Nova Animação" para criar uma segunda animação chamada "cima". Encontre as imagens do jogador na aba "Sistema de Arquivos" - eles estão na pasta ``art`` que você descompactou mais cedo. Arraste as duas imagens de cada animação, chamadas ``playerGrey_up[1/2]`` e ``playerGrey_walk[1/2]`` para dentro do "Animation Frames" ao lado do painel correspondende de cada animação:
ru: Слева находится список анимаций. Нажмите на "default" и переименуйте на "walk". Затем щелкните по кнопке "Новая анимация" для создания второй анимации с именем "up". Найдите изображения игрока на вкладке "Файловая система" - они находятся в папке "art", которую вы разархивировали ранее. Перетащите два изображения с названиями ``playerGrey_up[1/2]`` и ``playerGrey_walk[1/2]`` на сторону панели "Кадры анимации" для каждой анимации соответственно:
uk: Зліва знаходиться список анімацій. Натисніть на "default" і перейменуйте на "right". Потім клацніть кнопку "Add" для створення другої анімації під ім'ям "up". Для кожної анімації, перетягніть на сторону "Animation Frames" два зображення з іменами `` playerGrey_up [1/2] `` і `` playerGrey_walk [1/2] ``:
zh_tw: 左側顯示的是動畫列表。點擊「default」(預設) 並重新命名為「walk」(走路)。接著點擊 [新增動畫] 按鈕來建立第二個動畫，將其命名為「up」(上移)。接著到 [檔案系統] 頁籤中找到玩家圖片——應該放在稍早解壓縮出來的 ``art`` 資料夾內。在動畫列表上選擇對應的動畫，並把圖片 ``playerGrey_up[1/2]`` 以及 ``playerGrey_walk[1/2]`` 拖移到 [動畫影格] 那裡 ：

source: The player images are a bit too large for the game window, so we need to scale them down. Click on the ``AnimatedSprite`` node and set the ``Scale`` property to ``(0.5, 0.5)``. You can find it in the Inspector under the ``Node2D`` heading.
cs: Obrázky hráče jsou pro okno hry příliš velké, takže je musíme zmenšit. Klikněte na uzel ``AnimatedSprite`` a nastavte vlastnost ``Scale`` na ``(0.5, 0.5)``. Najdete ji v Inspektoru pod hlavičkou ``Node2D``.
de: Die Spielerbilder sind ein bisschen zu groß für das Spielefenster, also müssen wir sie verkleinern. Klicken Sie auf den ``AnimatedSprite`` Node und setzen die Eigenschaft ``Scale`` auf ``(0.5, 0.5)``. Sie können sie im Inspektor unterhalb der Überschrift ``Node2D`` finden.
es: Las imágenes del jugador son un poco grandes para la ventana del juego, así que tenemos que reducirlas. Haz clic en el nodo ``AnimatedSprite`` y establece la propiedad ``Scale`` en ``(0.5, 0.5)``. Puedes encontrarla en el Inspector bajo el título ``Node2D``.
fr: Les images du joueur sont un peu trop grandes pour la fenêtre de jeu, nous devons donc les réduire. Cliquez sur le nœud ``AnimatedSprite`` et réglez la propriété ``Scale`` sur ``(0.5, 0.5)``. Vous pouvez la trouver dans l'Inspecteur sous la catégorie ``Node2D``.
it: Le immagini del giocatore sono un po' troppo grandi per la finestra di gioco, quindi dobbiamo rimpicciolirle. Fai clic sul nodo ``AnimatedSprite`` e imposta la proprietà ``Scale`` a ``(0.5, 0.5)``. La si può trovare all'interno dell' Inspector nella sezione ``Node2D``.
ja: プレイヤーの画像はゲームウィンドウに対して少し大きすぎるため、縮小する必要があります。 ``AnimatedSprite`` ノードをクリックし、 ``Scale`` プロパティを ``(0.5,0.5)`` に設定します。``Node2D`` の下のインスペクタにあります。
ko: 플레이어 이미지가 게임 창에 비해 너무 크기 때문에, 크기를 줄여야 합니다. ``AnimatedSprite`` 노드를 클릭하고 ``Scale`` 속성을 ``(0.5, 0.5)``\ 로 설정하세요. 인스펙터(Inspecter)의 ``Node2D`` 에서 찾을 수 있습니다.
pl: Obrazy graczy są zbyt duże, aby zmieściły się w oknie gry, więc musimy je pomniejszyć. Kliknij na węzeł ``AnimatedSprite`` i ustaw właściwość ``Scale`` na ``(0.5, 0.5)``. W inspektorze można ją znaleźć pod nagłówkiem ``Node2D``.
pt_br: As imagens do jogador são um tanto grandes demais para a janela de jogo, então precisamos reduzir sua escala. Clique no nó ``AnimatedSprite`` e configure a propriedade ``Scale`` para ``(0.5, 0.5)``. Você pode encontrá-la no Inspetor na seção ``Node2D``.
ru: Изображения игрока немного великоваты для игрового окна, потому нам надо их слегка уменьшить. Нажмите на узел``AnimatedSprite`` и установите параметр ``Scale`` в ``(0.5, 0.5)``. Вы можете найти его в Инспекторе под заголовком ``Node2D``.
uk: Зображення гравця трохи занадто великі для вікна гри, тому нам потрібно їх масштабувати. Клацніть на вузлі ``AnimatedSprite`` та встановіть властивість ``Scale`` (Масштаб) на ``(0.5, 0.5)``. Ви можете знайти її в Інспекторі під заголовком ``Node2D``.
zh_cn: ``Player`` 图像对于游戏窗口来说有点太大，所以我们需要缩小它们。点击 ``AnimatedSprite`` 节点并将 ``Scale`` 属性设置为 ``(0.5,0.5)`` 。您可以在属性检查器面板中的 ``Node2D`` 标题下找到它。
zh_tw: 對於遊戲視窗來說，這些玩家圖片看起來有點大，所以我們需要把圖片縮小。點擊 ``AnimatedSprite`` 節點，然後把 ``Scale`` (縮放) 屬性設為 ``(0.5, 0.5)`` 。這個屬性位在屬性面板中 ``Node2D`` 標題底下。

source: Finally, add a :ref:`CollisionShape2D <class_CollisionShape2D>` as a child of ``Player``. This will determine the player's "hitbox", or the bounds of its collision area. For this character, a ``CapsuleShape2D`` node gives the best fit, so next to "Shape" in the Inspector, click "[empty]"" -> "New CapsuleShape2D". Using the two size handles, resize the shape to cover the sprite:
cs: Nakonec přidejte :ref:`CollisionShape2D <class_CollisionShape2D>` jako potomka ``Player``. Tím se určí hráčův "hitbox" neboli hranice jeho kolizní oblasti. Pro tuto postavu je uzel ``CapsuleShape2D`` nejvhodnější, takže v Inspektoru vedle "Shape" klikněte na „[empty]“ -> „New CapsuleShape2D“. Pomocí dvou úchytů velikosti změňte tvar tak, aby pokryl celý sprite:
de: Abschließend fügen Sie ein :ref:`CollisionShape2D <class_CollisionShape2D>` als ein Unterobjekt von ``Player`` hinzu. Er bestimmt die "Hitbox" des Spielers oder die Grenzen seines Kollisionsbereichs. Für diesen Charakter ist ein ``CapsuleShape2D`` Node am besten geeignet. Klicken Sie im Inspektor neben "Shape" auf "[leer]" -> "Neues CapsuleShape2D". Verwenden Sie die zwei Anfasser und verändern die Form so, dass sie das Sprite überdeckt:
es: Finalmente, añade un :ref:`CollisionShape2D <class_CollisionShape2D>` como hijo de ``Player``. Esto determinará el "hitbox" del jugador, o los límites de su área de colisión. Para este personaje, un nodo ``CapsuleShape2D`` sería el más indicado ya que se ajusta mejor a la imagen, así que junto a "Shape" en el Inspector, haz clic en "<null>" -> "New CapsuleShape2D". Ahora usa los dos manejadores de tamaño y redimensiona la forma de colisión para cubrir el sprite:
fr: Enfin, ajoutez un :ref:`CollisionShape2D <class_CollisionShape2D>` en tant qu'enfant de ``Player``. Ceci déterminera la "hitbox" du joueur, soit les limites de sa zone de collision. Pour ce personnage, un nœud ``CapsuleShape2D`` donne le meilleur ajustement, donc à côté de "Shape" dans l'Inspecteur, cliquez sur "[vide]" -> "Nouveau CapsuleShape2D". En utilisant les poignées, redimensionnez la forme pour couvrir le sprite :
it: Infine, aggiungi un :ref:`CollisionShape2D <class_CollisionShape2D>` come figlio di ``Player``. Questo determinerà la "hitbox" del giocatore, in altre parole i limiti dell'area di collisione. Per questo personaggio, un nodo ``CapsuleShape2D`` è la scelta migliore, quindi vicino a "Shape" nel Inspector, clicca "[empty]"" -> "New CapsuleShape2D". Usando le due maniglie di dimensione, ridimensiona la forma in modo da coprire la sprite:
ja: 最後に、\ :ref:`CollisionShape2D <class_CollisionShape2D>`\ を ``Player`` の子として追加します。これにより、プレイヤーの「ヒットボックス」、またはその衝突領域の境界が決定されます。このキャラクターでは、 ``CapsuleShape2D`` ノードがうまくフィットするので、インスペクタの「Shape」の隣で「[空]」->「新規 CapsuleShape2D」をクリックします。2つのサイズハンドルを使用して、スプライトを覆うようにシェイプのサイズを変更します:
ko: 마지막으로, :ref:`CollisionShape2D <class_CollisionShape2D>`\ 를 ``Player``\ 의 자식으로 추가하세요. 이것이 플레이어의 "히트박스(hitbox)", 즉 콜리전 영역을 결정합니다. 이 캐릭터에게는 ``CapsuleShape2D`` 노드가 가장 적합합니다, 그러므로 인스펙터(Inspecter)의 "Shape" 옆에 "[비었음]([empty])" -> "새 CapsuleShape2D(New CapsuleShape2D)"를 클릭하세요. 스프라이트 전체를 덮도록 두 개의 크기 핸들로 콜리전 영역 크기를 조절하세요:
pt_br: Finalmente, adicione um :ref:`CollisionShape2D <class_CollisionShape2D>` (forma de colisão 2D) como filho de ``Jogador``. Isso determina a "caixa de acerto" do jogador, ou seja, os limites da sua área de colisão. Para este personagem, um nó ``CapsuleShape2D`` (forma cápsula 2D) é o que melhor se encaixa. Então, ao lado de "Shape" (forma) no Inspetor, clique em "<null>" -> "Novo CapsuleShape2D". Utilizando os dois manipuladores, redimensione a forma para cobrir o sprite:
ru: Наконец, добавьте :ref:`CollisionShape2D <class_CollisionShape2D>` в качестве потомка в ``Player``. Это определит "hitbox" игрока или, иначе говоря, границы его области столкновения. Для этого персонажа лучше всего подходит узел ``CapsuleShape2D``, поэтому далее идем в Инспектор и в разделе "Shape" щелкаем "[пусто]" -> "Новый CapsuleShape2D". Используя указатели двух размеров, подгоните размер фигуры под размер изображения:
uk: Нарешті створіть ще одного нащадка ``Player``, додайте :ref:`CollisionShape2D <class_CollisionShape2D>` (Форма межі зіткнень). Він визначатиме "ударну коробку" гравця, або межі його зони зіткнення. Для цього персонажа найкраще підходить вузол ``CapsuleShape2D`` (Форма капсули 2D), тому поруч із пунктом "Shape" ("Форма") в Інспекторі натисніть "[порожній]" "->" Нова CapsuleShape2D ". Використовуючи дві ручки розмірів, змініть розмір форми, щоб покрити спрайт:
zh_cn: 最后，添加一个 :ref:`CollisionShape2D <class_CollisionShape2D>` 作为 ``Player`` 的子节点。它用于决定 ``Player`` 的“碰撞盒”，亦或者说是它碰撞区域的边界。对于该角色，``CapsuleShape2D`` 节点最适合，因此，在属性检查器中的“形状”旁边，单击“ [空]””->“新建CapsuleShape2D”。使用两个尺寸手柄，调整形状，以覆盖住精灵：
zh_tw: 最後，在 ``Player`` 節點下新增一個 :ref:`CollisionShape2D <class_CollisionShape2D>` 子節點。這個節點是用來判斷玩家的「碰撞區域 (Hitbox 或 Collision Area)」。在這個角色上很適合使用 ``CapsuleShape2D`` 節點，所以我們可以到屬性面板中的 [Shape] (形狀)，點擊 [空] -> [新增 CapsuleShape2D]。使用兩個控制尺寸的圓點來把大小調整至覆蓋 Sprite：

source: When you're finished, your ``Player`` scene should look like this:
cs: Až skončíte, měla by vaše ``Player`` scéna vypadat takto:
de: Wenn Sie fertig sind sollte Ihre ``Player`` Szene die folgende Struktur haben:
es: Cuando hayas terminado, tu escena ``Player`` debería verse así:
fr: Lorsque vous avez terminé, votre scène ``Player`` devrait ressembler à ceci :
it: Quando hai finito, la tua scena ``Player`` dovrebbe essere simile a questa:
ja: 完了すると、 ``Player`` シーンは次のようになります:
ko: 다 되셨다면, 당신의 ``Player`` 씬은 이렇게 되어야 합니다:
pl: Po zakończeniu, scena ``Player`` powinna wyglądać w ten sposób:
pt_br: Quando tiver finalizado, sua cena ``Jogador`` deveria se parecer assim:
ru: Когда вы закончите, сцена с вашим ``Player`` будет выглядеть вот так:
uk: Коли ви закінчите, ваша сцена ``Player`` повинна виглядати так:
zh_cn: 完成后，您的 ``Player`` 场景看起来应该像这样：
zh_tw: 完成之後， ``Player`` 看起來應該會像這樣：

source: Make sure to save the scene again after these changes.
cs: Po těchto změnách nezapomeňte scénu znovu uložit.
de: Speichern Sie die Szene nach diesen Änderungen wieder ab.
es: Estate seguro de salvar la escena de nuevo después de estos cambios.
fr: Veillez à sauvegarder à nouveau la scène après ces changements.
it: Assicurati di salvare di nuovo la scena dopo queste modifiche.
ja: これらの変更後は、必ずシーンを再度保存してください。
ko: 이러한 변경 후에 씬을 다시 저장하는 것을 잊지 마세요.
pt_br: Certifique-se de salvar a cena novamente após as alterações.
ru: После этих изменений обязательно сохраните сцену еще раз.
uk: Не забудьте зберегти сцену знову після цих змін.
zh_cn: 修改完成后请确保再次保存场景。
zh_tw: 修改完畢後記得保存場景。

source: Moving the player
cs: Pohybování hráčem
de: Den Spieler Bewegen
es: Movimiento del jugador
fr: Déplacer le joueur
it: Muovere il giocatore
ja: プレイヤーを動かす
ko: 플레이어 움직이기
pt_br: Movendo o Jogador
ru: Движение Игрока
uk: Переміщення гравця
zh_cn: 移动 ``Player``
zh_tw: 移動玩家

source: Now we need to add some functionality that we can't get from a built-in node, so we'll add a script. Click the ``Player`` node and click the "Attach Script" button:
cs: Nyní musíme přidat některé funkce, které nám připravený uzel neposkytuje, proto je naprogramujeme pomocí skriptu. Klikněte na uzel ``Player`` a dále na tlačítko "Připojit skript":
de: Jetzt müssen wir einige Funktionen hinzufügen, die wir von einem integrierten Node nicht erhalten können, also fügen wir ein Skript hinzu. Klicken Sie auf den Node ``Player`` und dann auf die Schaltfläche "Skript hinzufügen":
es: Ahora necesitamos añadir alguna funcionalidad que no podemos obtener de un nodo integrado, así que añadiremos un script. Haz clic en el nodo ``Player`` y en el botón "Añadir Script":
fr: Maintenant, nous devons ajouter des fonctionnalités que nous ne pouvons pas obtenir à partir d'un nœud intégré, nous allons donc ajouter un script. Cliquez sur le nœud ``Player`` et cliquez sur le bouton "Attacher un script" :
it: Ora abbiamo bisogno di aggiungere alcune funzionalità che non abbiamo con un nodo pre-esistente, quindi aggiungeremo uno script. Clicca il nodo ``Player`` e clicca il bottone "Aggiungi Script":
ja: 次に、組み込みノードからは得られない機能を追加する必要があるので、スクリプトを追加します。 ``Player`` ノードをクリックし、「スクリプトをアタッチ」ボタンをクリックします:
ko: 이제 내장 노드 만으로는 얻을 수 없는 몇 가지 기능을 추가해야 하므로 스크립트를 만들겁니다. ``Player`` 노드를 클릭하고 "스크립트 추가(Attach Script)" 버튼을 누르세요:
pt_br: Agora precisamos adicionar algumas funcionalidades que não conseguimos em um nó embutido, então adicionaremos um script. Clique no nó ``Jogador`` e depois clique no botão "Adicionar Script":
ru: Теперь нам надо добавить немного функционала, который мы не можем получить с помощью встроенных узлов и поэтому мы добавим скрипт. Нажмите на узел ``Player`` и нажмите кнопку "Прикрепить скрипт":
uk: Тепер нам треба додати трохи функціоналу, який ми не можемо отримати за допомогою вбудованих вузлів і тому ми додамо скрипт. Клацніть на вузлі `` Player`` і натисніть кнопку "Attach Script":
zh_tw: 現在我們需要一個內建節點沒有提供的功能，所以需要自己寫腳本了。點擊 ``Player`` 節點，然後點擊 [附加腳本] 按鈕：
