Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: The ``call_group()`` function calls the named function on every node in a group - in this case we are telling every mob to delete itself.
cs: Funkce ``call_group()`` volá pojmenovanou funkci na každém uzlu ve skupině - v tomto případě říkáme každému nepříteli, aby se sám odstranil.
de: Die Funktion ``call_group()`` ruft die benannte Funktion auf jedem Node in einer Gruppe auf - in diesem Fall sagen wir jedem Gegner, dass er sich selbst löschen soll.
es: La función ``call_group()`` llama a la función nombrada en cada nodo de un grupo - en este caso le estamos diciendo a cada grupo que se elimine a sí mismo.
fr: La fonction ``call_group()`` appelle la fonction nommée sur chaque nœud d'un groupe - dans ce cas nous disons à chaque mob de s'effacer eux-même.
it: La funzione ``call_group()``` chiama la funzione cosi denominata su ogni nodo di un gruppo - cosi facendo diciamo ad ogni mob di cancellarsi.
ja: ``call_group()`` 関数はグループ内の全てのノードに対して名前付きの関数を呼び出します - この場合は全てのモブに自分自身を削除するように指示しています。
ko: ``call_group()`` 함수는 그룹의 모든 노드에서 지정된 함수를 호출합니다. 이 경우 모든 몹에게 자신을 삭제하도록 지시합니다.
pt_br: A função ``call_group()``chama a função passada como parâmetro em cada nó do grupo - neste caso nós estamos falando para cada inimigo se auto-destruir.
ru: Функция ``call_group()`` вызывает каждую именованную функцию на каждом узле в группе - в этом случае мы говорим каждому мобу удалять себя.
uk: Функція ``call_group()`` викликає кожну іменовану функцію на кожному вузлу в групі - в цьому випадку ми кажемо кожному мобу видаляти себе.
zh_cn: call_group（）函数在组中的每个节点上调用命名函数-在这种情况下，我们告诉每个生物都将其删除。
zh_tw: ``call_group()`` 函式會呼叫群組中所有節點的指定名稱的函式——在這裡我們用來讓所有怪物刪除自己。

source: Finishing up
cs: Dokončení
de: Fertigstellung
es: Finalizando
fr: Pour terminer
it: Rifinitura
ja: 仕上げ
ko: 마무리 작업
pt_br: Terminando
ru: Завершающие штрихи
uk: Завершальна обробка
zh_cn: 完成了
zh_tw: 最終調整

source: We have now completed all the functionality for our game. Below are some remaining steps to add a bit more "juice" to improve the game experience. Feel free to expand the gameplay with your own ideas.
cs: Nyní jsme dokončili všechny funkce pro naši hru. Níže uvádíme několik zbývajících kroků pro přidání trochu více „šťávy“ pro zlepšení herního zážitku. Nebojte se rozšířit hru o své vlastní nápady.
de: Wir haben jetzt alle Funktionen für unser Spiel fertiggestellt. Im Folgenden werden einige Schritte beschrieben, um etwas mehr „Tiefe“ hinzuzufügen, die das Spielerlebnis verbessert. Zögern Sie nicht, das Gameplay mit Ihren eigenen Ideen zu erweitern.
es: Ahora que hemos completado toda la funcionalidad de nuestro juego. Debajo están los pasos restantes para agregar más "jugo" y mejorar la experiencia de juego. Eres libre de expandir el juego con sus propias ideas.
fr: Nous avons maintenant terminé toutes les fonctionnalités de notre jeu. Ci-dessous sont quelques étapes restantes pour ajouter un peu plus de "jus" pour améliorer l'expérience de jeu. N'hésitez pas à développer le gameplay avec vos propres idées.
it: Ora abbiamo completato tutte le funzionalità del nostro gioco. Di seguito sono riportati alcuni passaggi rimanenti per aggiungere un po' più "succo" per migliorare l'esperienza di gioco. Sentitevi liberi di espandere il gameplay con le vostre idee.
ja: これで、ゲームのすべての機能が完了しました。以下は、ゲーム体験を向上させるためにもう少し「精彩」を加えるための、いくつかの残りの手順です。あなた自身のアイデアによって、ゲームプレイを自由に拡張してください。
ko: 우리는 게임의 모든 기능을 마친 상태입니다. 밑에 남아있는 단계는 게임의 경험을 향상시킬 "주스"를 추가하는 것입니다. 독창적인 아이디어로 자유롭게 게임 플레이를 확장시켜보세요.
pl: Ukończyliśmy już wszystkie funkcjonalności naszej gry. Poniżej przedstawiamy kilka kroków, które należy jeszcze podjąć, aby dodać trochę więcej funkcji w celu poprawy wrażeń z gry. Zapraszamy do rozszerzenia rozgrywki o własne pomysły.
pt_br: Agora completamos toda a funcionalidade do nosso jogo. Abaixo estão alguns passos restantes para adicionar um pouco mais de "sabor" para melhorar a experiência do jogo. Sinta-se livre para expandir a jogabilidade com suas próprias ideias.
ru: На данный момент мы завершили всю функциональность для нашей игры. Ниже остаются некоторые шаги, слегка добавляющие "сока" и улучшающие игровой опыт. Не стесняйтесь совершенствовать геймплей своими собственными идеями.
uk: На разі ми завершили весь функціонал для нашої гри. Нижче наведено декілька кроків, щоб додати трохи більше «соку» для покращення ігрового досвіду. Не соромтеся розширювати ігровий процес своїми власними ідеями.
zh_cn: 现在，我们已经完成了游戏的所有功能。以下是一些剩余的步骤，可以添加更多“果汁”以改善游戏体验。随心所欲地扩展游戏玩法。
zh_tw: 現在，這個遊戲的所有功能都已經完成了。接下來的這些步驟可以讓遊戲畫龍點睛、增進遊戲體驗。如果你有更多 Idea 的話，也可以自由地擴展遊戲。

source: Background
cs: Pozadí
de: Hintergrund
es: Imagen de fondo
fr: Arrière-plan
it: Sfondo
ja: Background(背景)
ko: 배경(Background)
pl: Tło
pt_br: Plano de fundo
ru: Фон
uk: Тло
zh_cn: 背景
zh_tw: 背景

source: The default gray background is not very appealing, so let's change its color. One way to do this is to use a :ref:`ColorRect <class_ColorRect>` node. Make it the first node under ``Main`` so that it will be drawn behind the other nodes. ``ColorRect`` only has one property: ``Color``. Choose a color you like and select "Layout" -> "Full Rect" so that it covers the screen.
cs: Výchozí šedé pozadí není příliš přitažlivé, změňte tedy jeho barvu. Jedním ze způsobů, jak toho dosáhnout, je použít uzel :ref:`ColorRect <class_ColorRect>`. Je to první uzel pod ``Main`` , takže bude nakreslen za ostatními uzly. ``ColorRect`` má pouze jednu vlastnost: ``Color``. Vyberte barvu, která se vám líbí, a vyberte "Rozložení" -> "Úplný obdélník" tak, aby pokrýval celou obrazovku.
de: Der voreingestellte graue Hintergrund ist nicht sehr ansprechend, ändern wir also die Farbe. Eine Möglichkeit, dies zu tun ist die Verwendung eines :ref:`ColorRect <class_ColorRect> -Nodes. Machen Sie ihn zum ersten Node unter ``Main``, damit er hinter dem anderen Node gezeichnet wird. ``ColorRect`` hat nur eine Eigenschaft: ``Color``. Wählen Sie eine Farbe aus die Ihnen gefällt und ziehe die Größe des ``ColorRect`` so, dass es den Bildschirm abdeckt.
es: El gris por defecto no es muy atractivo, así que cambiemos el color. Un modo de hacer esto es usar un nodo :ref:`ColorRect <class_ColorRect>`. Lo haremos el primer nodo dentro de ``Main`` así aparecerá detrás de los otros nodos. ``ColorRect`` tiene una sola propiedad: ``Color``. Escoge el color que quieras y arrastra el borde del ``ColorRect`` para que cubra la pantalla.
fr: Le fond gris par défaut n'est pas très attrayant, changeons donc sa couleur. Une façon de le faire est d'utiliser un nœud :ref:`ColorRect <class_ColorRect>`. Faites-en le premier nœud sous ``Main`` de sorte qu'il soit dessiné derrière les autres nœuds. ``ColorRect`` n'a qu'une seule propriété : ``Color``. Choisissez une couleur que vous aimez et sélectionnez "Layout" -> "Full Rect" pour qu'elle couvre l'écran.
it: Lo sfondo grigio di default non è molto attraente, quindi cambiamo il suo colore. Un modo per farlo è usare un nodo :ref:`ColorRect <class_ColorRect>``. Rendilo il primo nodo sotto ``Main`` in modo che sia disegnato dietro gli altri nodi. ``ColorRect`` ha una sola proprietà: ``Color``. Scegli un colore che ti piace e seleziona "Layout" -> "Full Rect" in modo che copra lo schermo.
ja: デフォルトのグレーの背景はあまり魅力的ではないので、色を変更してみましょう。これを行う 1 つの方法は、\ :ref:`ColorRect <class_ColorRect>` ノードを使用することです。他のノードの後ろに描画されるように、それを ``Main`` の下の最初のノードにします。 ``ColorRect`` には、 ``Color`` というプロパティのみがあります。好きな色を選択し、「レイアウト」→「Rect全面」を選べば、画面はそれで覆われます。
ko: 회색 기본 배경은 그다지 매력적이지 않아요, 그러니 색깔을 바꿔봅시다. 그 방법 중 하나는 :ref:`ColorRect <class_ColorRect>` 노드를 사용하는 것입니다. ``Main`` 바로 밑의 첫 번째 노드로 만들어서 다른 노드의 뒤에 그려지도록 하세요. ``ColorRect``\ 에는 오직 하나의 속성: ``Color``\ 만 있습니다. 원하는 색깔을 고르고 "레이아웃(Layout)" -> "사각형 전체(Full Rect)"를 선택해서 화면을 덮어주세요.
pt_br: O plano de fundo padrão cor cinza não é muito apelativo, então vamos mudar sua cor. Uma maneira de fazer isso é usar um Nó :ref:`ColorRect <class_ColorRect>` ("retângulo colorido"). Faça ele ser o primeiro Nó de ``Principal`` para que ele seja desenhado por trás dos outros Nós. ``ColorRect`` tem apenas uma propriedade: ``Color`` ("cor"). Escolha uma cor que goste e selecione, em "Layout", "Full Rect" para cobrir toda a tela.
ru: Серый фон по умолчанию не очень привлекателен, так что давайте поменяем его цвет. Один из способов сделать это - использовать узел :ref:`ColorRect <class_ColorRect>`. Создайте его первым узлом под ``Main`` - таким образом он будет прорисовываться за другими узлами. ``ColorRect`` имеет только одно свойство: ``Color``. Подберите цвет, который вам нравится, и выберите "Макет" -> "Полный прямоугольник" так, чтобы он покрывал экран.
uk: Сіре тло за замовчуванням не дуже привабливе, тому давайте змінимо його колір. Один із способів зробити це - використати вузол :ref:`ColorRect <class_ColorRect>`. Перемістіть його на самий верх нащадків, щоби він був одразу після вузла ``Main``, щоби малювався позаду інших вузлів. ``ColorRect`` має тільки одну властивість:``Color``. Підберіть колір до вподоби і виберіть "Layout" -> "Full Rect", щоб покрити ввесь екран.
zh_tw: 預設的灰色背景並不是很吸睛，所以來改個顏色。其中一種改背景的方式是新增一個 :ref:`ColorRect <class_ColorRect>` 節點。將 ColorRect 新增為 ``Main`` 底下的第一個節點，這樣 ColorRect 才會被繪製在其他節點的下方。``ColorRect`` 只有一個屬性： ``Color`` （色彩）。選擇一個你喜歡的顏色，並選擇「畫面配置」->「全矩形」，這樣就會覆蓋整個畫面。

source: You could also add a background image, if you have one, by using a ``TextureRect`` node instead.
cs: Můžete také, pokud jej máte, místo změny barvy přidat pomocí uzlu ``TextureRect`` na pozadí obrázek.
de: Wenn Sie ein Hintergrundbild haben, können Sie dies stattdessen mittels ``TextureRect`` Node hinzufügen.
es: También puedes agregar una imagen de fondo, si tienes una, utilizando un nodo ``TextureRect`` en su lugar.
fr: Vous pouvez également ajouter une image de fond, si vous en avez une, en utilisant un nœud ``TextureRect`` à la place.
it: Puoi anche aggiungere un'immagine di sfondo, se ne hai una, usando invece un nodo ``TextureRect``.
ja: 背景画像がある場合は、代わりに ``TextureRect`` ノードを使用して、それを追加することもできます。
ko: 대신 ``TextureRect`` 노드를 사용해 배경 이미지를 추가할 수도 있습니다.
pt_br: Você também pode adicionar uma imagem de plano de fundo, se tiver uma, ao usar um nó ``TextureRect``.
ru: Вы также можете добавить фоновое изображение, если у вас оно есть , используя вместо него узел ``TextureRect``.
uk: Ви також можете додати фонове зображення, якщо воно у вас є, за допомогою вузла ``TextureRect``.
zh_tw: 如果你有適合的圖片的話，也可以用圖片作為背景。改用 ``TextureRect`` 節點即可。

source: Sound effects
cs: Zvukové efekty
de: Soundeffekte
es: Efectos de sonido
fr: Effets sonores
it: Effetti Sonori
ja: 効果音
ko: 음향 효과(Sound effects)
pt_br: Efeitos sonoros
ru: Звуковые эффекты
uk: Звукові ефекти
zh_cn: 音效
zh_tw: 音效

source: Sound and music can be the single most effective way to add appeal to the game experience. In your game assets folder, you have two sound files: "House In a Forest Loop.ogg" for background music, and "gameover.wav" for when the player loses.
cs: Zvuk a hudba mohou být jediným efektivním způsobem, jak zvýšit přitažlivost hry. Ve složce herních zdrojů máte dva zvukové soubory: „House in a Forest Loop.ogg“ pro hudbu na pozadí a „gameover.wav“, kdy hráč prohraje.
de: Sound und Musik können effektive Mittel sein, das Spielerlebnis attraktiver zu gestalten. In Ihrem Ordner mit den Spielressourcen befinden sich zwei Sounddateien: „House in a Forest Loop.ogg“ für Hintergrundmusik und „gameover.wav“ für den Fall, dass der Spieler verliert.
es: La música y el sonido pueden ser el modo más efectivo de agregar atractivo a la experiencia de juego. En la carpeta de recursos hay dos archivos de sonido: "House In a Forest Loop.ogg" para música de fondo y "gameover.wav" para cuando el jugador pierde.
fr: Le son et la musique peuvent être le moyen le plus efficace d'ajouter de l'attrait à l'expérience de jeu. Dans votre dossier de ressources de jeu, vous avez deux fichiers son : "House In a Forest Loop.ogg" pour la musique de fond, et "gameover.wav" pour quand le joueur perd.
it: Suono e musica possono essere il modo più efficace per aggiungere fascino all'esperienza di gioco. Nella cartella delle risorse di gioco sono presenti due file audio: "House In a Forest Loop.ogg" per la musica di sottofondo e "gameover.wav" per quando il giocatore perde.
ja: サウンドと音楽は、ゲーム体験に魅力を与えるには最上級に効果的な方法となりえます。ゲームのアセットフォルダには、BGMの ``House In a Forest Loop.ogg`` と、プレイヤーが負けたとき用の ``gameover.wav`` という2つのサウンドファイルがあります。
ko: 사운드와 음악은 게임 경험을 매력적으로 만들어주는 가장 효과적인 요소가 될 수 있습니다. 게임 애셋 폴더에서, 두 개의 사운드 파일을 찾을 수 있습니다: "House In a Forest Loop.ogg"는 배경 음악으로, "gameover.wav"는 플레이어가 죽었을 때 사용하면 됩니다.
pl: Dźwięk i muzyka mogą być najskuteczniejszym sposobem na uatrakcyjnienie wrażeń z gry. W folderze zasobów do gry znajdują się dwa pliki dźwiękowe: "House In a Forest Loop.ogg" na muzykę w tle i "gameover.wav" odtwarzaną w razie przegranej.
pt_br: Som e música podem ser a forma mais efetiva de adicionar um atrativo à experiência de jogo. Na pasta de ativos do seu jogo, você tem dois arquivos de áudio: "House In a Forest Loop.ogg" para música de fundo e "gameover.wav" para quando o jogador perde.
ru: Звук и музыка могут быть одним из самых эффективных способов придания игровому процессу большей привлекательности. В папке ресурсов вашей игры есть два звуковых файла: "House In a Forest Loop.ogg" для фоновой музыки и "gameover.wav" для случаев, когда игрок проигрывает.
uk: Звук і музика можуть бути єдиним найефективнішим способом додати привабливість до гри. У теці ваших ігрових ресурсів у вас є два звукових файли: "House In a Forest Loop.ogg" для фонової музики та "gameover.wav" - коли гравець програє.
zh_cn: 声音和音乐可能是增加游戏体验吸引力的最有效方法。在游戏素材文件夹中，您有两个声音文件： ``House in a Forest Loop.ogg`` 用于背景音乐，而 ``gameover.wav`` 用于当玩家失败时。
zh_tw: 聲音與音樂可以是一種最有效能增加遊戲體驗吸引力的方法。遊戲素材資料夾中有兩個聲音檔案：背景音樂用的「House In A Forest Loop.ogg」與玩家 Game Over 時用的「gameover.wav」。

source: Add two :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` nodes as children of ``Main``. Name one of them ``Music`` and the other ``DeathSound``. On each one, click on the ``Stream`` property, select "Load", and choose the corresponding audio file.
cs: Přidejte dva :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` uzly jako podřízené uzlu ``Main``. Pojmenujte jednoho z nich ``Music`` a druhého ``DeathSound``. U každého z nich, klikněte na ``Stream`` vlastnost, vyberte možnost "Načíst", a vyberte odpovídající zvukový soubor.
de: Fügen Sie zwei :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` Nodes als Unterelemente von ``Main`` hinzu. Benennen Sie einen davon ``Music`` und den anderen ``DeathSound``. Klicken Sie bei jedem Node auf die Eigenschaft ``Stream``, klicken Sie auf „Lade“ und wählen Sie die entsprechende Audiodatei aus.
es: Agrega dos nodos :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` hijos de ``Main``. Nombre uno de ellos ``Music`` y el otro ``DeathSound``. En cada uno, haz clic en la propiedad ``Stream``, selecciona "Load" y escoge el archivo de audio correspondiente.
fr: Ajouter deux nœuds :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` en tant qu'enfants de ``Main``. Nommez l'un d'eux ``Music`` et l'autre ``DeathSound``. Sur chacun d'eux, cliquez sur la propriété ``Stream``, sélectionnez "Charger", et choisissez le fichier audio correspondant.
it: Aggiungere due nodi :ref:`AudioStreamPlayer <class_AudioStreamPlayer>``come figli di ``Main``. Chiamane uno ``Music`` e l'altro ``DeathSound``. Per ognuno di essi, clicca sulla proprietà ``Stream``, seleziona "Load" e scegli il file audio corrispondente.
ja: 2つの\ :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`\ ノードを ``Main`` の子として追加します。その1つに ``Music`` 、もう1つに ``DeathSound`` と名前を付けます。各ファイルにて ``Stream`` プロパティをクリックし、「読み込み」を選択してから、対応するオーディオファイルを選択します。
ko: 두 개의 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 노드를 ``Main``\ 의 자식으로 추가하세요. 하나는 ``Music``\ 으로, 다른 하나는 ``DeathSound``\ 로 이름지으세요. 각각 ``Stream`` 속성을 클릭하고 "불러오기(Load)"를 선택해서 이름에 맞는 오디오 파일을 선택하세요.
pl: Dodaj dwa węzły :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` jako dzieci ``Main``. Nazwij jedną z nich ``muzykę``, a drugą ``DeathSound``. Na każdym z nich kliknij na właściwość ``Stream``, wybierz opcję "Wczytaj" i wybierz odpowiedni plik audio.
pt_br: Adicione dois nós :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` como filhos de ``Principal``. Nomeie um deles como ``Musica`` e o outro como ``SomDeMorte``. Em cada um, clique na propriedade ``Stream`` ("fluxo"), selecione "Carregar", e escolha o arquivo sonoro correspondente.
ru: Добавьте два узла :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` как дочерние для ``Main``. Назовите один из них ``Music``, а другой - ``DeathSound``. В каждом из них нажмите на свойство ``Stream``, выберите "Загрузить" и добавьте соответствующий звуковой файл.
uk: Додайте два вузли :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` нащадками ``Main``. Назвіть один з них ``Music`` а інший ``DeathSound``. На кожному з них натисніть на властивість ``Stream``, виберіть "Завантажити" та виберіть відповідний аудіо-файл.
zh_cn: 添加两个 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 节点作为 ``Main`` 的子节点。将其中一个命名为 ``Music``，将另一个命名为 ``DeathSound``。在每个节点选项上，点击 ``Stream`` 属性， 选择 ``加载``，然后选择相应的音频文件。
zh_tw: 在 ``Main`` 中新增兩個 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 節點作為子節點。將其中一個命名為 ``Music`` ，另一個則為 ``DeathSound`` 。在各個節點上點擊 ``Stream`` （串流）屬性，選擇「載入」，並選擇對應的音訊檔。

source: To play the music, add ``$Music.play()`` in the ``new_game()`` function and ``$Music.stop()`` in the ``game_over()`` function.
cs: Chcete-li přehrát hudbu, přidejte ``$Music.play()`` do funkce ``new_game()`` a ``$Music.stop()`` do funkce ``game_over()``.
de: Um die Musik abzuspielen, fügen Sie ``$Music.play()`` in der ``new_game()`` Funktion und ``$Music.stop()`` in der ``game_over()`` Funktion hinzu.
es: Para reproducir la música, agregua ``$Music.play()`` en la función ``new_game()`` y ``$Music.stop()`` en ``game_over()``.
fr: Pour jouer de la musique, ajouter ``$Music.play()`` dans la fonction ``new_game()`` et ``$Music.stop()`` dans la fonction ``game_over()``.
it: Per riprodurre la musica, aggiungete ``$Music.play()`` nella funzione ``new_game()`` e ``$Music.stop()`` nella funzione ``game_over()``.
ja: 音楽を再生するには、 ``new_game()`` 関数に ``$Music.play()`` を追加し、 ``game_over()`` 関数に ``$Music.stop()`` を追加します。
ko: 음악을 실행시키려면, ``new_game()`` 함수에 ``$Music.play()``\ 를 추가하고 ``game_over()`` 함수에 ``$Music.stop()``\ 을 추가하세요.
pl: Aby odtwarzać muzykę, dodaj ``$Music.play()`` w funkcji ``new_game()`` i ``$Music.stop( )`` w funkcji ``game_over()``.
pt_br: Para reproduzir a música, adicione ``$Musica.play()``na função ``new_game()`` e ``$Musica.stop()`` na função ``game_over()``.
ru: Для воспроизведения музыки добавьте ``$Music.play()`` в функцию ``new_game()`` и ``$Music.stop()`` в функцию ``game_over()``.
uk: Щоб відтворити музику, додайте ``$Music.play()`` у функцію ``new_game()`` та ``$Music.stop()`` у функцію ``game_over()``.
zh_cn: 要播放音乐，在 ``new_game()`` 函数中添加 ``$Music.play()``，在 ``game_over()`` 函数中添加 ``$Music.stop()`` 。
zh_tw: 要播放音樂，在 ``new_game()`` 函式中新增 ``$Music.play()`` ，並在 ``game_over()`` 函式中新增 ``$Music.stop()`` 。

source: Finally, add ``$DeathSound.play()`` in the ``game_over()`` function.
cs: Nakonec přidejte do funkce ``game_over()`` ``$ DeathSound.play()``.
de: Fügen Sie abschließend ``$DeathSound.play()`` in der ``game_over()`` Funktion hinzu.
es: Finalmente, agregua ``$DeathSound.play()`` en la función ``game_over()``.
fr: Enfin, ajoutez ``$DeathSound.play()`` dans la fonction ``game_over()``.
it: Dopodichè , aggiungi ''$DeathSound.play()'' nella funzione ''game_over()''.
ja: 最後に、 ``game_over()`` 関数に ``$DeathSound.play()`` を追加します。
ko: 마지막으로 ``game_over()`` 함수에 ``$DeathSound.play()``\ 를 추가하세요.
pl: Na koniec dodaj ``$DeathSound.play()`` do funkcji ``game_over()``.
pt_br: Por fim, adicione ``$SomDeMorte.play()`` na função ``game_over()``.
ru: Наконец, добавьте ``$DeathSound.play()`` в функцию ``game_over()``.
uk: Нарешті, додайте ``$DeathSound.play()`` у функцію``game_over()``.
zh_cn: 最后， 在 ``game_over()`` 函数中添加 ``$DeathSound.play()`` 。
zh_tw: 最後，在 ``game_over()`` 函式中新增 ``$DeathSound.play()`` 。

source: Keyboard shortcut
cs: Klávesová zkratka
de: Tastenkürzel
es: Atajo del teclado
fr: Raccourci clavier
it: Scorciatoia da tastiera
ja: キーボード ショートカット
ko: 키보드 단축키
pt_br: Atalho de teclado
ru: Сочетание клавиш
uk: Гарячі клавіші
zh_tw: 鍵盤快捷鍵

source: Since the game is played with keyboard controls, it would be convenient if we could also start the game by pressing a key on the keyboard. We can do this with the "Shortcut" property of the ``Button`` node.
cs: Protože se hra ovládá pomocí klávesnice, bylo by vhodné, kdybychom ji mohli také spustit stisknutím klávesy na klávesnici. Můžeme to udělat pomocí vlastnosti "Shortcut" v uzlu ``Button``.
de: Da das Spiel mit Tastatur gesteuert wird, wäre es praktisch, wenn wir das Spiel auch durch Drücken einer Taste auf der Tastatur starten könnten. Eine Möglichkeit hierzu ist die Verwendung der „Shortcut“ -Eigenschaft des ``Button``-Nodes.
es: Dado que el juego se juega con los controles del teclado, sería conveniente si también pudiéramos iniciar el juego presionando una tecla. Una forma de hacerlo es usando la propiedad "Shortcut" del nodo ``Button``.
fr: Puisque le jeu se joue avec les touches du clavier, il serait pratique si nous pouvions également commencer le jeu en appuyant sur une touche du clavier. Une façon d'y parvenir est d'utiliser la propriété "Raccourci" du nœud ``Button``.
it: Poiché il gioco si gioca con i comandi della tastiera, sarebbe conveniente se potessimo iniziare il gioco anche premendo un tasto sulla tastiera. Possiamo farlo con la proprietà "Shortcut" del nodo ``Button``.
ja: このゲームはキーボード コントロールにてプレイするので、キーボードのキーを押してゲームを開始できると便利です。それには ``Button`` ノードの「Shortcut」プロパティを使用すれば可能です。
ko: 게임은 키보드 조작으로 진행되기 때문에 키보드의 키를 눌러 게임을 시작할 수도 있다면 편리할 것입니다. ``Button`` 노드의 "Shortcut" 속성을 사용해 이 작업을 수행할 수 있습니다.
pt_br: Como o jogo é jogado com controles de teclado, seria conveniente se pudéssemos iniciar o jogo pressionando uma tecla do teclado. Uma maneira de fazer isso é usando a propriedade "Atalho" do nó ``Button``.
ru: Поскольку в игру играют с помощью клавиш управления, было бы удобно, если бы мы могли начать игру, нажав клавишу на клавиатуре. Мы можем сделать это с помощью свойства "Shortcut" узла ``Button``.
uk: Оскільки гра проводиться за допомогою клавіатурних елементів управління, було б зручно, якби ми також могли розпочати гру, натиснувши клавішу на клавіатурі. Один із способів зробити це - використання властивості "Shortcut" вузла ``Button``.
zh_tw: 由於這個遊戲是用鍵盤控制來玩的，如果能用鍵盤上的按鍵也能開始新遊戲的話會很方便。我們可以使用 ``Button`` 節點的「Shortcut」（快捷鍵）屬性來做到。
