Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: You should see a list of the signals for the ``Player`` node. Find and double-click the ``hit`` signal in the list (or right-click it and select "Connect..."). This will open the signal connection dialog. We want to make a new function named ``game_over``, which will handle what needs to happen when a game ends. Type "game_over" in the "Receiver Method" box at the bottom of the signal connection dialog and click "Connect". Add the following code to the new function, as well as a ``new_game`` function that will set everything up for a new game:
cs: Měli byste vidět seznam signálů pro uzel ``Player``. Vyhledejte a poklepejte na signál ``hit`` v seznamu (nebo na něj klikněte pravým tlačítkem a vyberte "Připojit ..."). Otevře se dialogové okno pro připojení signálu. Chceme vytvořit novou funkci s názvem ``game_over``, která se postará o to, co se musí stát, až hra skončí. Do pole „Metoda příjemce“ ve spodní části dialogového okna pro připojení signálu zadejte „game_over“ a klikněte na „Připojit“. K nové funkci přidejte následující kód a také funkci ``new_game``, která nastaví vše pro novou hru:
de: Sie sollten eine Liste der Signale für den ``Player``-Node sehen. Suchen und doppelklicken Sie das ``hit`` Signal (oder Rechtsklicke darauf und drücken "Verbinden..."). Dies wird das Fenster für die Signal-Verbindung öffnen. Wir wollen eine neue Funktion namens ``game_over`` erstellen, welche angeben wird, was passieren muss, wenn das Spiel beendet wurde. Schreiben Sie "game_over" in das "Empfängermethode"-Eingabefeld unten im Fenster und klicken auf "Verbinden". Fügen Sie dann sowohl den folgenden Code zur neuen Funktion, als auch eine ``new_game``-Funktion, die alles für ein neues Spiel einstellen wird:
es: Deberías ver una lista de señales para el nodo ``Player``. Busca la señal ``hit`` en la lista y haz doble clic en esta (o clic derecho y selecciona "Conectar..."). Esto abrirá el diálogo de conexión. Haremos una nueva función llamada ``game_over``, la que ejecutará lo que debe suceder cuando el juego termina. Escribe "game_over" en el campo "Método receptor" en la parte inferior de la ventana y haz clic en "Conectar". Agrega el siguiente código a la nueva función, así como una función ``new_game`` que configurará todo en un juego nuevo:
fr: Vous devriez voir une liste des signaux pour le nœud ``Player``. Trouvez et double-cliquez sur le signal ``hit`` dans la liste (ou faites un clic droit et sélectionnez "Connect..."). Cela ouvrira le dialogue de connexion des signaux. Nous voulons créer une nouvelle fonction appelée ``game_over``, qui gérera ce qui doit se passer quand une partie se termine. Tapez "game_over" dans la case "Receiver Method" en bas du dialogue de connexion des signaux et cliquez sur "Connect". Ajoutez le code suivant à la nouvelle fonction, ainsi qu'une fonction ``new_game`` qui configurera tout pour une nouvelle partie :
it: Dovresti vedere una lista dei segnali per il nodo ``Player``. Trova e clicca due volte sul segnale ``hit`` dalla lista (o fai un click con il mouse destro del mouse e seleziona "Connetti..."). In questo modo si aprirà la finestra di dialogo per la connessione del segnale. Vogliamo creare una nuova funzione chiamata ``game_over```, che gestirà ciò che deve accadere quando un gioco finisce. Digitate "game_over" nella casella "Receiver Method" in fondo alla finestra di dialogo della connessione del segnale e cliccate su "Connect". Aggiungete il seguente codice alla nuova funzione, e allo stesso modo crea una funzione ``new_game`` che imposterà un nuovo gioco:
ja: ``Player`` ノードのシグナルのリストが表示されているはずです。リストの中から ``hit`` のシグナルを見つけてダブルクリックしてください (または右クリックして "接続..." を選択)。これでシグナルの接続ダイアログが開きます。ゲームが終了したときに必要な処理を行う ``game_over`` という名前の新しい関数をこれから作ります。シグナル接続ダイアログの下部にある「受信側メソッド」ボックスに「game_over」と入力し、「接続」をクリックしてください。新しい関数に以下のコードを追加し、さらに、新しいゲームのための設定を行う ``new_game`` 関数も追加します:
ko: ``Player`` 노드에 대한 시그널 목록이 표시되어야 합니다. 목록에서 ``hit`` 시그널을 찾아 두 번 클릭하세요(또는 마우스 오른쪽 단추로 클릭하고 "연결...(Connect...)" 선택). 그러면 시그널 연결 대화 상자가 열립니다. 우리는 게임이 끝났을 때 일어날 일을 처리할 ``game_over``\ 라는 새로운 함수를 만들고 싶습니다. 신호 연결 대화 상자 아래쪽의 "받는 메서드(Receiver Method)" 상자에 "game_over"를 입력하고 "연결(Connect)"을 클릭하세요. 다음 코드를 새 함수에 추가하고 새 게임에 대한 모든 것을 설정하는 ``new_game`` 함수를 추가합니다:
pt_br: Você deve ver uma lista de sinais para o nó ``Player``. Em seguida, encontre e dê dois cliques no sinal ``hit`` da lista (ou clique com o botão direito e selecione "Conectar..."). Isso abrirá a caixa de diálogo de conexão de sinal. Queremos criar uma função chamada ``game_over``, que lidará com tudo o que precisa acontecer quando um jogo acaba. Digite "game_over" na caixa "Método no Nó" na parte inferior da janela de conexão de sinal e clique em "Conectar". Adicione o código a seguir à nova função, assim como uma função ``new_game`` (novo jogo) para definir tudo para um novo jogo:
ru: Вы должны увидеть список сигналов для узла ``Player``. В списке найдите и дважды щелкните по сигналу ``hit`` (или щелкните по нему правой кнопкой мыши и выберите "Присоединить..."). Это откроет диалоговое окно подключения сигнала. Мы хотим создать новую функцию с именем ``game_over``, которая будет обрабатывать то, что должно произойти, когда игра заканчивается. Введите "game_over" в поле "Метод-приёмник" в нижней части диалогового окна подключения сигнала и нажмите "Присоединить". Добавьте следующий код в новую функцию, а также функцию ``new_game``, которая настроит всё для новой игры:
uk: Ви повинні побачити список сигналів для вузла ``Player``. Знайдіть у списку сигнал ``hit`` і двічі клацніть по ньому (або клацніть по ньому правою клавішею мишки і виберіть "Під'єднати..."). Це відкриє діалогове вікно підключення сигналу. Ми хочемо створити нову функцію з назвою ``game_over``, яка буде працювати з тим, що має відбуватися, коли гра закінчується. Введіть "game_over" у поле "Метод отримувач" внизу вікна "З’єднати сигнал з методом". Додайте наступний код до нової функції, а також функцію ``new_game``, щоб налаштувати все для нової гри:
zh_tw: 接著應該可以看到所有 ``Player`` 節點的訊號。點兩下列表中的 ``hit`` 訊號 (或是右鍵點擊然後選擇 [連接...])。這樣便可以打開訊號連接對話框。這裡我們要把新函式命名為 ``game_over`` ，這個函式會負責處理遊戲結束時要做的事。在 [連接訊號] 視窗中的 [Receiver 方法] 內輸入「game_over」，並點擊 [連接]。將下列程式碼加到新建立的函式當中，接著新增一個 ``new_game`` 函式，負責在遊戲開始時搞定一切：

source: Now connect the ``timeout()`` signal of each of the Timer nodes (``StartTimer``, ``ScoreTimer`` , and ``MobTimer``) to the main script. ``StartTimer`` will start the other two timers. ``ScoreTimer`` will increment the score by 1.
cs: Nyní připojte signál ``timeout()`` každého z uzlů časovače ( ``StartTimer``, ``ScoreTimer`` a ``MobTimer``) do hlavního skriptu. ``StartTimer`` spustí další dva časovače. ``ScoreTimer`` zvýší skóre o 1.
de: Verbinden Sie nun das Signal ``Timeout()`` von jedem der Timer-Nodes (``StartTimer``, ``ScoreTimer`` ` und ``MobTimer``) mit dem Main-Skript. ``StartTimer`` startet die anderen beiden Timer. ``ScoreTimer`` erhöht die Punktzahl um 1.
es: Ahora conecta la señal ``timeout()`` de cada uno de los nodos Timer (``StartTimer``, ``ScoreTimer`` y ``MobTimer``) al script de Main. ``StartTimer`` iniciará los otros dos temporizadores. ``ScoreTimer`` incrementará la puntuación en 1.
fr: Maintenant, connectez le signal ``timeout()`` de chacun des nœuds Timer (``StartTimer``, ``ScoreTimer`` et ``MobTimer``) au script principal. ``StartTimer`` démarrera les deux autres timers. ``ScoreTimer`` incrémentera le score de 1.
it: Collega ora il segnale ``timeout()`` di ciascuno dei nodi Timer (``StartTimer``, ``ScoreTimer`` e ``MobTimer``) allo script principale. ``StartTimer`` avvierà gli altri due timer. ``ScoreTimer`` incrementerà il punteggio di 1.
ja: 次に、各Timerノード (``StartTimer``\ 、\ ``ScoreTimer``\ 、\ および ``MobTimer``) の ``timeout()`` シグナルをメインスクリプトに接続します。\ ``StartTimer`` は他の2つのタイマーを開始します。\ ``ScoreTimer`` はスコアを1増やします。
ko: 이제 각 Timer 노드(``StartTimer``, ``ScoreTimer`` 및 ``MobTimer``)의 ``timeout()`` 시그널을 메인 스크립트에 연결하세요. ``StartTimer``\ 는 다른 두 타이머를 작동시킵니다. ``ScoreTimer``\ 는 점수를 1씩 증가시킵니다.
pt_br: Agora, conecte o sinal ``timeout()`` de cada um dos nós de Timer (``StartTimer``, ``ScoreTimer`` , e``MobTimer``) para o script principal. ``StartTimer`` irá iniciar os outros dois temporizadores. ``ScoreTimer`` irá incrementar a pontuação em 1.
ru: Теперь присоедините сигнал ``timeout()`` каждого из узлов Timer (``StartTimer``, ``ScoreTimer`` и ``MobTimer``) к главному скрипту. ``StartTimer`` запустит два других таймера. ``ScoreTimer`` будет увеличивать счет на 1.
uk: Тепер підключіть сигнал ``timeout()`` кожного з вузлів Timer ( ``StartTimer``, ``ScoreTimer`` і ``MobTimer``) до головного скрипту. ``StartTimer`` запустить інші два таймери. ``ScoreTimer`` буде збільшувати рахунок на 1.
zh_tw: 現在，將各個 Timer 節點（ ``StartTimer`` 、 ``ScoreTimer`` 、與 ``MobTimer`` ）的 ``timeout()`` 訊號連接到 Main 腳本中。 ``StartTimer`` 會啟動另外兩個 Timer。 ``ScoreTimer`` 會以 1 為單位增加分數。

source: In ``_on_MobTimer_timeout()``, we will create a mob instance, pick a random starting location along the ``Path2D``, and set the mob in motion. The ``PathFollow2D`` node will automatically rotate as it follows the path, so we will use that to select the mob's direction as well as its position.
cs: V ``_on_MobTimer_timeout ()`` vytvoříme instanci nepřítele, vybereme náhodné počáteční místo podél ``Path2D`` a dáme nepřítele do pohybu. Uzel ``PathFollow2D`` se bude automaticky otáčet, jak následuje cestu, takže ji použijeme k výběru směru a polohy nepřátel.
de: In ``_on_MobTimer_timeout()`` erstellt eine Mob-Instanz, wählt einen zufälligen Startpunkt entlang des ``Path2D`` aus und setzt den Gegner in Bewegung. Der ``PathFollow2D``-Node dreht sich automatisch, wenn er dem Pfad folgt. Wir verwenden diesen, um die Richtung des Gegners sowie dessen Position auszuwählen.
es: En ``_on_MobTimer_timeout()``, crearemos una instancia del enemigo, tomaremos una ubicación aleatoria a lo largo del ``Path2D``, y luego pondermos al enemigo en movimiento. El nodo ``PathFollow2D`` rotará automáticamente mientras recorre el camino, así que usaremos eso para seleccionar la dirección y la posición del enemigo.
fr: Dans ``_on_MobTimer_timeout()`` nous allons créer une instance de monstre, choisir un emplacement de départ aléatoire le long du ``Path2D``, et mettre le monstre en mouvement. Le nœud ``PathFollow2D`` tournera automatiquement puisqu'il suit le chemin, donc nous l'utiliserons pour sélectionner la direction du monstre ainsi que sa position.
it: In ``_on_MobTimer_timeout()``, creeremo un'istanza mob, sceglieremo una posizione di partenza casuale lungo il ``Path2D``, e metteremo in movimento il mob. Il nodo ``PathFollow2D`` ruoterà automaticamente mentre segue il percorso, quindi lo useremo per selezionare la direzione e la posizione del mob.
ja: ``_on_MobTimer_timeout()`` では、mobインスタンスを作成し、 ``Path2D`` に沿って開始位置をランダムに選択してから、mobを動かします。 ``PathFollow2D`` ノードはパスに沿って自動的に回転するので、それを使用してmobの方向と位置を決めます。
ko: ``_on_MobTimer_timeout()``\ 에서 우리는 몹 인스턴스를 만들고, ``Path2D``\ 에 따라 무작위 시작점을 결정하고, 몹이 움직이도록 설정할 것입니다. ``PathFollow2D`` 노드는 자동으로 경로를 따라 돌기 때문에 몹들의 위치와 방향을 선택하기 위해서 사용할 수 있습니다.
pt_br: Em ``_on_MobTimer_timeout()``, vamos criar uma instância de inimigo, pegar um local de início aleatório ao longo do ``Path2D``, e pôr o mob em movimento. O nó ``PathFollow2D`` irá rotacionar automaticamente à medida em que ele segue o caminho, então usaremos isso para escolher a direção do inimigo, bem como sua posição.
ru: В функции ``_on_MobTimer_timeout()`` мы создадим экземпляр моба, выберем случайное начальное местоположение вдоль ``Path2D`` и приведем его в движение. Узел ``PathFollow2D`` будет автоматически поворачивать его по направлению пути, поэтому мы воспользуемся этим, чтобы выбрать направление моба и его позицию.
uk: У функції ``_on_MobTimer_timeout()`` ми створимо екземпляр моба, підберемо випадкове початкове місце уздовж ``Path2D`` та приведемо моба у рух. Вузол ``PathFollow2D`` буде автоматично обертатися по мірі просування по шляху, так що ми будемо використовувати його, щоб вибрати напрямок моба, а також його позицію.
zh_cn: 在 ``_on_MobTimer_timeout()`` 中，我们将创建一个 ``mob`` 实例，沿着 ``Path2D`` 随机选择一个起始位置，然后让 ``mob`` 移动。``PathFollow2D`` 节点将沿路径移动，因此会自动旋转，所以我们将使用它来选择怪物的方向及其位置。
zh_tw: 接著我們在 ``_on_MobTimer_timeout()`` 中建立怪物的實體，並沿著 ``Path2D`` 來隨機選擇一個起始位置，然後讓怪物開始移動。在跟隨路徑時 ``PathFollow2D`` 節點會自動旋轉，所以我們在使用這個節點來選擇怪物的位置的同時也會一起選擇方向。

source: Note that a new instance must be added to the scene using ``add_child()``.
cs: Všimněte si, že do scény musí být přidána nová instance pomocí ``add_child()``.
de: Beachten Sie, dass der Szene mit ``add_child()`` eine neue Instanz hinzugefügt werden muss.
es: Observa que añadiremos la nueva instancia a la escena usando ``add_child()``.
fr: Notez qu'une nouvelle instance doit être ajoutée à la scène en utilisant ``add_child()``.
it: Si noti che una nuova istanza deve essere aggiunta alla scena utilizzando ''add_child()''.
ja: 注意点として、新しいインスタンスは ``add_child()`` を使ってシーンに追加しなければなりません。
ko: 새로운 인스턴스는 ``add_child()``\ 를 사용해야 추가할 수 있습니다.
pl: Nowa instancja musi być dodana do sceny za pomocą ``add_child()``.
pt_br: Note que uma nova instância deve ser adicionada à cena usando ``add_child()`` (adicionar filho).
ru: Обратите внимание, что новый экземпляр должен быть добавлен в сцену с помощью функции ``add_child()``.
uk: Зауважте, що новий екземпляр потрібно додати до сцени за допомогою ``add_child()``.
zh_cn: 注意，必须使用 ``add_child()`` 将新实例添加到场景中。
zh_tw: 需要注意的是，新建立的節點必須要使用 ``add_child()`` 來將節點新增到場景中。

source: Why ``PI``? In functions requiring angles, GDScript uses *radians*, not degrees. If you're more comfortable working with degrees, you'll need to use the ``deg2rad()`` and ``rad2deg()`` functions to convert between the two.
cs: Proč ``PI``? Ve funkcích vyžadujících úhly používá GDScript *radiany*, nikoli stupně. Pokud se vám pracuje pohodlněji se stupni, budete muset použít převodní funkce ``deg2rad()`` a ``rad2deg()``.
de: Warum ``PI``? In Funktionen die Winkel erfordern, verwendet GDScript *Bogenmaß*, nicht Grad. Wenn Sie sich beim Arbeiten mit Grad wohler fühlen, müssen Sie die Funktionen ``deg2rad()`` und ``rad2deg()`` verwenden, um zwischen beiden zu konvertieren.
es: ¿Por qué ``PI``? En funciones que requieren ángulos, GDScript usa *radianes*, no grados. Si prefieres utilizar grados, deberás utilizar ``deg2rad()`` y ``rad2deg()`` para convertir entre ambas.
fr: Pourquoi ``PI`` ? Dans les fonctions nécessitant des angles, GDScript utilise des *radians* et non des degrés. Si vous êtes plus à l'aise avec les degrés, vous devrez utiliser les fonctions ``deg2rad()`` et ``rad2deg()`` pour convertir les angles entre les deux.
it: Perché ``PI``? Nelle funzioni che richiedono angoli, GDScript utilizza i *radianti*, non i gradi. Se si ha più familiarità con i gradi, è necessario utilizzare le funzioni ``deg2rad()`` e ``rad2deg()`` per eseguire la conversione tra i due.
ja: なぜ ``PI`` なのでしょう？ 角度を必要とする関数では、GDScriptは度ではなく\ *ラジアン*\ を使用します。度を使用する方が快適な場合は、 ``deg2rad()`` 関数と ``rad2deg()`` 関数を使用して 2 つの間で変換する必要があります。
ko: 왜 ``PI``\ 인가요? 각도가 필요한 함수에서 GDScript는 디그리(degree)가 아닌 라디안(*radians*)을 사용합니다. 디그리를 가지고 작업하는 것이 더 편하다면 ``deg2rad()``\ 와 ``rad2deg()`` 함수를 사용해 변환해야 합니다.
pt_br: Por que ``PI``? Em funções que demandem ângulos, GDScript usa *radianos*, e não graus. Se você se sente mais confortável trabalhando com graus, precisará usar as funções ``deg2rad()`` (graus para radianos) e ``rad2deg()`` (radianos para graus) para fazer as conversões.
ru: Почему ``PI``? В функциях, требующих углы, GDScript использует *радианы*, а не градусы. Если вам удобнее работать с градусами, вам нужно использовать функции ``deg2rad()`` и ``rad2deg()`` для преобразования между ними.
uk: Чому ``PI``? У функціях, що вимагають кутів, GDScript використовує *радіани* , а не градуси. Якщо вам зручніше працювати з градусами, вам потрібно буде скористатися функціями ``deg2rad()`` та ``rad2deg()`` для перетворення між ними.
zh_tw: 為什麼要使用 ``PI`` （圓周率）呢？在需要角度的函式中，GDScript 會使用 **弧度** 而不是角度。如果你比較喜歡用角度的話，則需要使用 ``deg2rad()`` （角度轉弧度）與 ``rad2deg()`` （弧度轉角度）兩個函式來轉換弧度與角度。

source: Testing the scene
cs: Testování scény
de: Die Szene testen
es: Probando la escena
fr: Tester la scène
it: Testare la scena
ja: シーンのテスト
ko: 씬 테스트하기
pt_br: Testando a cena
ru: Тестирование сцены
uk: Тестування сцени
zh_tw: 測試場景

source: Let's test the scene to make sure everything is working. Add this to ``_ready()``:
cs: Vyzkoušejte scénu, abychom se ujistili, že vše funguje. Přidejte toto do ``_ready()``:
de: Lassen Sie uns die Szene testen, um sicherzustellen, dass alles funktioniert. Fügen Sie folgendes ``_ready()`` hinzu:
es: Probemos la escena para asegurarnos de que todo funcione. Agregue esto a `` _ready () ``:
fr: Maintenant, testons la scène pour s'assurer que tout fonctionne. Ajoutez cela à ``_ready()`` :
it: Proviamo la scena per assicurarci che tutto funzioni. Aggiungere questo a ``_ready()``:
ja: シーンをテストして、すべてが動作していることを確認してみましょう。これを ``_ready()`` に追加してください:
ko: 모든 것이 제대로 작동하는지 확인하기 위해 씬을 테스트해 보겠습니다. ``_ready()``\ 에 다음을 추가합니다:
pt_br: Vamos testar a cena para garantir que tudo esta funcionando. Adicione isso ao ``_ready()``:
ru: Давайте протестируем сцену, чтобы убедиться, что все работает. Добавьте в ``_ready()`` следующие строки:
uk: Давайте протестуємо сцену, щоб переконати, що все працює. Додайте наступне до ``_ready()``:
zh_cn: 让我们测试这个场景，确保一切正常。将这段添加至 ``_ready()``：
zh_tw: 來測試一下場景，看看是不是所有東西都正常了。將下面這段程式碼新增至 ``_ready()`` 中：

source: Let's also assign ``Main`` as our "Main Scene" - the one that runs automatically when the game launches. Press the "Play" button and select ``Main.tscn`` when prompted.
cs: Pojďme také přiřadit ``Main`` jako „Hlavní scénu“ - ta, která se spustí automaticky při spuštění hry. Stiskněte tlačítko "Play" a po zobrazení výzvy vyberte ``Main.tscn``.
de: Lassen Sie uns auch ``Main`` zu unserer "Main-Szene" hinzufügen - die automatisch läuft, wenn das Spiel startet. Drücken Sie dazu den "Start"-Knopf und wählen ``Main.tscn`` im Dialog.
es: También asignemos ``Principal`` como nuestra ``Escena Principal``, la que se ejecuta automáticamente cuando se lanza el juego. Presiona el botón "Play" y selecciona ``Main.tscn`` cuando se te pida.
fr: Assignons également ``Main`` comme "Main Scene" - celle qui s'exécute automatiquement au lancement du jeu. Appuyez sur le bouton "Play" et sélectionnez ``Main.tscn`` lorsque vous y êtes invité.
it: Assegniamo anche ``Main``` come nostra "Scena principale" - quella che viene eseguita automaticamente al lancio del gioco. Premi il pulsante "Play" e seleziona ``Main.tscn``` quando richiesto.
ja: また、 ``Main`` を「メインシーン」として設定してみましょう - ゲームが起動したときに自動的に実行されるシーンです。「実行」ボタンを押して、プロンプトが表示されたら ``Main.tscn`` を選択してください。
ko: 게임이 시작될 때 자동으로 실행되는 "Main Scene"으로 ``Main``\ 을 지정해 보겠습니다. "재생(Play)" 버튼을 누르고 메시지가 표시되면 ``Main.tscn``\ 을 선택하세요.
pt_br: Vamos também atribuir ``Main`` como nossa "Cena Principal" - aquela que é executada automaticamente quando o jogo é iniciado. Pressione o botão "Reproduzir" e selecione `` Main.tscn`` quando solicitado.
ru: Также давайте назначим сцену ``Main`` в качестве нашей "Главной сцены", которая запускается автоматически при запуске игры. Нажмите кнопку "Play" и выберите ``Main.tscn`` при появлении запроса.
uk: Також визначимо ``Main``, як нашу "Головну Сцену" - вона буде запускатися автоматично при кожному запуску гри. Натисніть кнопку "Відтворити" і виберіть ``Main.tscn`` при появі запиту.
zh_cn: 让我们同时指定 ``Main`` 作为我们的“主场景” —— 游戏启动时自动运行的场景。 按下“运行”按钮，当弹出提示时选择 ``Main.tscn`` 。
zh_tw: 同時，將 ``Main`` 設為「主要場景」——也就是遊戲啟動後會自動執行的場景。點擊「執行」按鈕，當提示框出現後選擇 ``Main.tscn`` 。

source: You should be able to move the player around, see mobs spawning, and see the player disappear when hit by a mob.
cs: Měli byste být schopni pohybovat hráčem do všech směrů, vidět rozmnožování nepřátek a sledovat, jak hráč zmizí, když je zasažen nepřítelem.
de: Es sollte jetzt möglich sein den Spieler zu bewegen, erscheinende Gegner zu sehen, und den Spieler verschwinden zu sehen, wenn er von einem Gegner getroffen wird.
es: Deberías poder mover al jugador alrededor, ver a los mobs creándose, y ver al jugador desaparecer cuando es golpeado por un mob.
fr: Vous devriez être capable de bouger le joueur, voir les monstres apparaître, et voir le joueur disparaître quand il est touché par un monstre.
it: Dovresti essere in grado di muovere il giocatore, vedere i mob che vengono generati e vedere il giocatore scomparire quando viene colpito da un mob.
ja: プレイヤーを移動でき、モブが発生したり、モブに当たった時にプレイヤーが消えるようになっているはずです。
ko: 플레이어를 움직이고, 몹들이 스폰되는 것을 보고, 플레이어가 몹과 충돌할 때 사라지는 것을 볼 수 있어야 합니다.
pt_br: Você deve ser capaz de mover o jogador, ver os inimigos nascendo, e ver o jogador desaparecer quando atingido por um inimigo.
ru: У вас должна быть возможность перемещать игрока, видеть, как появляются мобы, и видеть, как игрок исчезает, когда его бьет моб.
uk: Ви мали би успішно переміщати повсюди гравця, спостерігати, як народжуються моби, і бачити, як зникає гравець від зіткненя з мобом.
zh_cn: 你应该可以四处移动游戏角色，看到可动对象生成，以及玩家被可动对象击中时会消失。
zh_tw: 現在應該可以到處移動玩家了，並會看到怪物產生出來。玩家在被怪物撞到後會消失。

source: When you're sure everything is working, remove the call to ``new_game()`` from ``_ready()``.
cs: Pokud jste si jisti, že vše funguje, odeberte volání ``new_game()`` z ``_ready()``.
de: Wenn Sie sicher sind, dass alles läuft, löschen Sie den Funktionsaufruf ``new_game()`` von ``_ready()``.
es: Cuando estés seguro de que todo funciona, quita la llamada a ``new_game()`` de ``ready()``.
fr: Quand vous êtes sûr que tout fonctionne, supprimez l'appel à ``new_game()`` depuis ``_ready()``.
it: Quando si è sicuri che tutto funzioni, rimuovere la chiamata a ``new_game()`` da ``_ready()``.
ja: 全て動作していることが確認できたら、 ``_ready()`` から ``new_game()`` の呼び出しを削除してください。
ko: 모든 것이 제대로 작동한다고 확신한다면 '_ready()'에서 ``new_game()`` 함수 호출을 제거하세요.
pt_br: Quando tiver certeza que tudo esta funcionando, remova a chamada de ``new_game()`` em ``_ready()``.
ru: Когда вы убедитесь, что всё работает, удалите вызов ``new_game()`` из ``_ready()``.
uk: Переконавшись, що все працює видаліть виклик ``new_game()`` з ``_ready()``.
zh_cn: 当你确定一切正常时，在``_ready()``中移除对``new_game()``的调用。
zh_tw: 確定好了所有東西都正常後，將呼叫 ``new_game()`` 的程式碼從 ``_ready()`` 裡刪除。

source: HUD
ja: ヘッドアップディスプレイ(HUD)
uk: HUD (інтерфейс)
