Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Connect the ``timeout()`` signal of ``MessageTimer`` and the ``pressed()`` signal of ``StartButton`` and add the following code to the new functions:
cs: Připojte signál ``timeout()`` uzlu ``MessageTimer`` a ``pressed()`` signál uzlu ``StartButton`` a k novým funkcím přidejte následující kód:
de: Verbinden Sie jeweils das ``timeout()``-Signal von ``MessageTimer`` und das ``pressed()``-Signal von ``StartButton`` und fügen Sie den folgenden Code in die neuen Funktionen ein:
es: Conecta la señal ``timeout()`` del ``MessageTimer`` y la señal ``pressed()`` de ``StartButton`` y agrega el siguiente código a las nuevas funciones:
fr: Connectez le signal ``timeout()`` de ``MessageTimer`` et le signal ``pressed()`` de ``StartButton`` et ajoutez le code suivant aux nouvelles fonctions :
it: Collega il segnale ``timeout()`` di ``MessageTimer`` e il segnale ``pressed()`` di ``StartButton`` e aggiungi il seguente codice alle nuove funzioni:
ja: ``MessageTimer`` の ``timeout()`` シグナルと ``StartButton`` の ``pressed()`` シグナルを接続してから、下記のコードを新しい関数に加えます:
ko: ``MessageTimer``\ 의 ``timeout()`` 시그널과 ``StartButton``\ 의 ``pressed()`` 시그널을 연결하고 다음 코드를 새 함수에 추가하세요:
pt_br: Conecte o sinal ``timeout()``do ``MessageTimer`` e o sinal ``pressed()`` do ``StartButton`` e adicione o seguinte código às novas funções:
ru: Присоедините сигнал ``timeout()`` из ``MessageTimer`` и сигнал ``pressed()`` из ``StartButton`` и добавьте следующий код к новым функциям:
uk: Підключіть сигнал ``timeout()`` від ``MessageTimer`` і сигнал ``pressed()`` від ``StartButton``та додайте наступний код до нових функцій:
zh_tw: 連接 ``MessageTimer`` 的 ``timeout() 訊號與 ``StartButton`` 的 ``pressed()`` 訊號，並新增下列程式碼到新函式當中：

source: Connecting HUD to Main
cs: Připojení HUD k Main
de: Das HUD mit Main verbinden
es: Conectando HUD a Main
fr: Connecter le HUD à Main
it: Collegamento di HUD a Main
ja: HUDをメインに接続する
ko: 메인에 HUD를 연결하기
pl: Podłączenie HUD do Main
pt_br: Conectando HUD a Principal
ru: Подключение HUD к Main
uk: Підключення HUD до Main
zh_cn: 将HUD场景连接到Main场景
zh_tw: 將 HUD 場景連接至 Main 場景

source: Now that we're done creating the ``HUD`` scene, go back to ``Main``. Instance the ``HUD`` scene in ``Main`` like you did the ``Player`` scene. The scene tree should look like this, so make sure you didn't miss anything:
cs: Nyní, když jsme dokončili scénu ``HUD``, vraťte se ke scéně ``Main``. Vytvořte instanci scény ``HUD`` ve ``Main``, jak jste to udělali se scénou ``Player``. Strom scény by měl vypadat takto, takže se ujistětě, že vám něco neuniklo:
de: Jetzt, da wir die ``HUD``-Szene erstellt haben, gehen Sie zurück zu ``Main`` und platziere die ``HUD``-Szene in ``Main`` genauso wie die ``Player``-Szene. Der gesamte Szenenbaum sollte so aussehen, also stellen Sie sicher, dass nichts fehlt:
es: Ahora que hemos terminado de crear la escena del ``HUD``, regresa a ``Main``. Instancia la escena ``HUD`` en ``Main`` como hiciste con la escena de ``Player``. El árbol de la escena debe verse así, asegúrate que no te olvidaste de nada:
fr: Maintenant que nous avons fini de créer la scène du ``HUD``, sauvegardez-la et retournez à ``Main``. Instanciez la scène ``HUD`` dans ``Main`` comme vous l'avez fait dans la scène ``Player``. L'arbre de scène devrait ressembler à ça, alors assurez-vous de ne rien manquer :
it: Ora che abbiamo finito di creare la scena ``HUD``, tornare a ``Main``. Istanza la scena ``HUD`` in ``Main`` come hai fatto per la scena ``Player``. L'albero della scena completo dovrebbe essere simile a questo, quindi assicurati di non aver tralasciato nulla:
ja: ``HUD`` シーンの作成が完了したら、 ``Main`` に戻ります。 ``Player`` のシーンと同じように ``HUD`` シーンを ``Main`` にインスタンス化し、ツリーの一番下に配置します。ツリー全体は次のようになるはずです。何も見落としていないか確認してください:
ko: 이제 ``HUD`` 씬 만들기가 끝났으니 저장하고 다시 ``Main``\ 으로 돌아가세요. ``Player`` 씬에서 했듯이 ``HUD`` 씬을 ``Main``\ 에 인스턴스화하고, 트리의 맨 아래에 배치하세요. 모든 트리는 다음처럼 보여야 하므로, 놓친 것이 없는지 확인해보세요:
pt_br: Agora que terminamos de criar a cena ``HUD``, salve-a e volte para a ``Principal``. Crie uma instância da cena ``HUD`` como fez com a cena ``Jogador``, e coloque-a no final da árvore. A árvore completa deveria se parecer assim, então confira se não falta alguma coisa:
ru: Теперь, когда мы закончили создание сцены ``HUD``, вернитесь к ``Main``. Инстанцируйте сцену ``HUD`` в ``Main`` подобно тому, как вы это делали со сценой ``Player``. Дерево сцены должно выглядеть так, поэтому убедитесь, что вы ничего не упустили:
uk: Тепер, коли ми закінчили створення сцени ``HUD``, збережіть її та поверніться до ``Main``. Вставте ``HUD`` сцену в ``Main``, як ви вставили сцену ``Player``. Повне дерево має виглядати так, тож переконайтеся, що ви нічого не пропустили:
zh_tw: 我們現在做好 ``HUD`` 場景了。讓我們回到 ``Main``。像剛才實體化 ``Player`` 場景一樣，在 ``Main`` 場景中實體化 ``HUD``。場景樹會看起來像這樣，檢查一下有沒有漏了什麼：

source: Now we need to connect the ``HUD`` functionality to our ``Main`` script. This requires a few additions to the ``Main`` scene:
cs: Nyní musíme propojit funkcionalitu ``HUD`` se skriptem ``Main``. To vyžaduje několik přídavků ke scéně ``Main``:
de: Nun müssen wir die ``HUD``-Funktionalität mit unserem ``Main``-Skript verbinden. Dies erfordert einige Ergänzungen in der ``Main``-Szene:
es: Ahora conectaremos la funcionalidad de ``HUD`` a nuestro script ``Main``. Esto requiere unas pocas adiciones a la escena ``Main``:
fr: Nous devons maintenant connecter la fonctionnalité ``HUD`` à notre script ``Main``. Cela nécessite quelques ajouts à la scène ``Main`` :
it: Ora dobbiamo collegare la funzionalità ''HUD'' al nostro script ''Main''. Ciò richiede alcune aggiunte alla scena ''Main'':
ja: 次に、 ``HUD`` 機能を ``Main`` のスクリプトに接続します。これには、 ``Main`` シーンにいくつかの追加が必要です:
ko: 이제 ``HUD`` 기능을 ``Main`` 스크립트에 연결할 것입니다. 여기에는 ``Main`` 씬에 추가적인 것들이 요구됩니다:
pl: Teraz musimy podłączyć funkcję ``HUD`` do naszego skryptu ``Main``. Wymaga to paru poprawek do sceny ``Main``:
pt_br: Agora precisamos conectar a funcionalidade de ``HUD`` ao roteiro de ``Principal``. Isso exige algumas adições à cena ``Principal``:
ru: Теперь нам нужно подключить функционал ``HUD`` в наш ``Main``-скрипт. Для этого потребуются некоторые дополнения к сцене ``Main``:
uk: Тепер нам потрібно підключити функції ``HUD`` до нашого скрипту ``Main``. Для цього потрібно кілька доповнень до сцени ``Main``:
zh_cn: 现在我们需要将 ``HUD`` 功能与我们的 ``Main`` 脚本连接起来。这需要在 ``Main`` 场景中添加一些内容：
zh_tw: 我們現在需要把 ``HUD`` 的功能連接到 ``Main`` 腳本。所以我們需要在 ``Main`` 場景內新增一點點東西：

source: In the Node tab, connect the HUD's ``start_game`` signal to the ``new_game()`` function of the Main node by typing "new_game" in the "Receiver Method" in the "Connect a Signal" window. Verify that the green connection icon now appears next to ``func new_game()`` in the script.
cs: Na kartě Uzel připojte signál ``start_game`` scény HUD k funkci ``new_game()`` Main uzlu zadáním "new_game" v "Metoda příjemce" v okně "Připojit signál". Ověřte, že zelená ikonka připojení se nyní objeví ve skriptu vedle ``func new_game()``.
de: Verbinden Sie auf der Registerkarte "Node" das Signal ``start_game`` des HUD mit der Funktion ``new_game()`` des Main-Nodes, indem Sie "new_game" in die "Empfängermethode" im Fenster "Ein Signal mit einer Methode verbinden" eingeben. Stellen Sie sicher, dass das grüne Verbindungssymbol jetzt neben ``func new_game()`` im Skript angezeigt wird.
es: En la pestaña Nodo, conecte la señal `` start_game '' del HUD a la función `` new_game () `` del nodo Principal escribiendo "new_game" en el "Método del receptor" en la ventana "Conectar una señal". Verifique que el icono de conexión verde ahora aparezca junto a `` func new_game () `` en el script.
fr: Dans l'onglet Nœud, connectez le signal ``start_game`` du HUD à la fonction ``new_game()`` du nœud Main en tapant "new_game" dans la "Receiver Method" de la fenêtre "Connect a Signal". Vérifiez que l'icône de connexion verte apparaît maintenant à côté de ``func new_game()`` dans le script.
it: Nella scheda Node, collegare il segnale ``start_game`` dell'HUD alla funzione ``new_game()`` del nodo principale digitando "new_game" nel "Receiver Method" nella finestra "Connect a Signal". Verificare che l'icona verde di connessione appaia ora accanto a ``func new_game()`` nello script.
ja: ノードタブで、「シグナルを接続」ウィンドウの 「受信側メソッド」に "new_game" と入力して、HUDの ``start_game`` のシグナルをメインノードの ``new_game()`` 関数に接続します。スクリプトの ``func new_game()`` の横に緑色の接続アイコンが表示されていることを確認してください。
ko: Node 탭에서 "시그널을 메서드에 연결(Connect a Signal to a Method)" 창의 "받는 메서드(Receiver Method)"에 "new_game"을 입력해 HUD의 ``start_game`` 신호를 Main 노드의 ``new_game()`` 함수에 연결하세요. 이제 스크립트의 ``func new_game()`` 옆에 녹색 연결 아이콘이 나타나는지 확인하세요.
pt_br: Na guia Nó, conecte o sinal `` start_game`` do HUD à função `` new_game () `` do nó Principal, digitando "new_game" no "Receiver Method" na janela "Connect a Signal". Verifique se o ícone de conexão verde agora aparece ao lado de `` func new_game () `` no script.
ru: Во вкладке "Узел" присоедините сигнал HUD ``start_game`` к функции узла Main ``new_game()``, введя "new_game" в поле "Метод-приёмник" в окне "Подключить сигнал к методу" . Убедитесь, что в скрипте рядом с функцией ``func new_game()`` теперь появилась зелёная иконка подключения.
uk: На вкладці Вузол приєднайте сигнал HUD ``start_game`` до функції ``new_game()`` вузла Main ввівши "new_game" в "Receiver Method" у вікні "Під'єднання сигналу". Переконайтеся, що в скрипті поряд з ``func new_game()`` появилася зелена іконка підключення.
zh_cn: 在“节点”选项卡中，通过在“连接信号”窗口的“接收器方法”中键入“ new_game”，将HUD的“ start_game”信号连接到主节点的“ new_game（）”功能。 验证绿色的连接图标现在是否在脚本中的func new_game（）旁边出现。
zh_tw: 在節點分頁中，設定 HUD 的 ``start_game`` 訊號的連接，在「連接訊號」視窗中將「Receiver 方法」設為「new_game」來將訊號連接到 Main 節點的 ``new_game()`` 函式。之後檢查看看腳本中的 ``func new_game()``旁邊有沒有出現綠色的連線圖示。

source: In ``new_game()``, update the score display and show the "Get Ready" message:
cs: V ``new_game()`` aktualizujte zobrazení skóre a zobrazte zprávu „Připravte se“:
de: Aktualisieren Sie in ``new_game()`` die Punkteanzeige und zeigen Sie die Meldung "Get Ready" an:
es: En``new_game()``, actualiza la puntuación y muestra el mensaje "Get Ready":
fr: Dans ``new_game()``, mettez à jour l'affichage des scores et affichez le message "Get Ready" :
it: In ``new_game()``, aggiornare la visualizzazione del punteggio e mostrare il messaggio "Get Ready":
ja: ``new_game()`` で、スコア表示を更新し、「Get Ready」メッセージを表示します:
ko: ``new_game()``\ 에서, 점수 화면을 업데이트하고 "Get Ready" 메시지를 보이게 합니다:
pl: W ``new_game()``, zaktualizuj wyświetlany wynik i pokaż komunikat "Przygotuj się":
pt_br: Em ``new_game()``, atualize o mostrador de pontuação e mostre a mensagem "Prepare-se":
ru: В ``new_game()`` обновим отображение счёта и выведем сообщение "Get Ready":
uk: У ``new_game()`` поновіть відображення рахунку і покажіть повідомлення "Get Ready" ("Приготуйся"):
zh_cn: 在 ``new_game()`` 函数中， 更新分数显示并显示 ``Get Ready`` 消息：
zh_tw: ``new_game()`` 中，需要更新分數並顯示「Get Ready」訊息：

source: In ``game_over()`` we need to call the corresponding ``HUD`` function:
cs: V ``game_over()`` musíme zavolat odpovídající `HUD`` funkci:
de: In ``game_over()`` müssen wir die entsprechende ``HUD`` Funktion aufrufen:
es: En ``game_over()`` necesitaremos llamar la función correspondiente en ``HUD``:
fr: Dans ``game_over()`` nous devons appeler la fonction ``HUD`` correspondante :
it: In ''game_over()'' è necessario chiamare la funzione ''HUD'' corrispondente:
ja: ``game_over()`` では、対応する ``HUD`` 関数を呼び出す必要があります:
ko: ``game_over()``\ 에서는, 해당 ``HUD`` 함수를 호출해야 합니다:
pl: W ``game_over()`` musimy wywołać odpowiednią funkcję w ``HUD``:
pt_br: Em ``game_over()``, precisamos chamar a correspondente função de ``HUD``:
ru: В ``game_over()`` нам нужно вызвать соответствующую функцию ``HUD``:
uk: У ``game_over()`` нам потрібно викликати відповідну функцію ``HUD``:
zh_cn: 在 ``game_over()`` 中我们需要调用相应的 ``HUD`` 函数：
zh_tw: ``game_over()`` 中我們需要呼叫對應的 ``HUD`` 函式：

source: Finally, add this to ``_on_ScoreTimer_timeout()`` to keep the display in sync with the changing score:
cs: Nakonec přidejte toto do ``_on_ScoreTimer_timeout()``, aby byl displej synchronizován s měnícím se skóre:
de: Abschließend fügen Sie nachfolgendes in ``_on_ScoreTimer_timeout()`` hinzu, um die Anzeige mit den sich ändernden Punkten zu synchronisieren:
es: Finalmente, agrega ``_on_ScoreTimer_timeout()`` para mantener la interfaz en sincronía al cambiar la puntuación:
fr: Enfin, ajoutez ceci à ``on_ScoreTimer_timeout()`` pour que l'affichage reste synchronisé avec le changement de score :
it: Infine, aggiungere questo valore a ''_on_ScoreTimer_timeout()'' per mantenere la visualizzazione sincronizzata con il punteggio modificato:
ja: 最後に、これを ``_on_ScoreTimer_timeout()`` に追加して、変更されたスコアと同期して表示を維持します:
ko: 마지막으로, ``_on_ScoreTimer_timeout()``\ 을 추가해서 점수가 바뀌면 화면과 일치하도록 합니다:
pl: Na koniec dodaj to do ``on_on_ScoreTimer_timeout()``, aby wyświetlacz był zsynchronizowany ze zmieniającym się wynikiem:
pt_br: Finalmente, adicione isto a ``_on_ScoreTimer_timeout()`` para manter o mostrador em sincronia com as mudanças de pontuação:
ru: Наконец добавьте это в ``_on_ScoreTimer_timeout()``, чтобы синхронизировать отображение с изменением количества очков:
uk: Нарешті, додайте це до ``_on_ScoreTimer_timeout()`` для синхронізації відображення рахунку зі зміною рахунку:
zh_cn: 最后，将下面的代码添加到 ``_on_ScoreTimer_timeout()`` 以保持不断变化的分数的同步显示：
zh_tw: 最後，將這段程式碼加到 ``_on_ScoreTimer_timeout()`` 來讓分數改變的時候能同步顯示：

source: Now you're ready to play! Click the "Play the Project" button. You will be asked to select a main scene, so choose ``Main.tscn``.
cs: Nyní jste připraveni hrát! Klikněte na tlačítko „Přehrát projekt“. Budete vyzváni k výběru hlavní scény, takže zvolte ``Main.tscn``.
de: Jetzt können Sie spielen! Klicken Sie auf die Schaltfläche "Projekt abspielen (F5)". Sie werden aufgefordert, eine Hauptszene auszuwählen. Wählen Sie dann ``Main.tscn`` aus.
es: ¡Ahora estás listo para jugar! Haz clic en el botón "Reproducir el proyecto". Se te pedirá que selecciones una escena principal, así que elige ``Main.tscn``.
fr: Vous êtes maintenant prêt à jouer ! Cliquez sur le bouton "Lancer le projet". Il vous sera demandé de sélectionner une scène principale, choisissez alors ``Main.tscn``.
it: Ora sei pronto per giocare! Fare clic sul pulsante "Riproduci il progetto". Ti verrà chiesto di selezionare una scena principale, quindi scegli ''Main.tscn'.
ja: これでプレイの準備が整いました！ [プロジェクトを実行] ボタンをクリックします。メインシーンを選択するように求められますので、 ``Main.tscn`` を選択します。
ko: 이제 실행할 준비가 끝났습니다! "프로젝트 실행" 버튼을 누르세요. 메인 씬을 선택하라고 물어보면 ``Main.tscn``\ 을 골라줍시다.
pl: Teraz jesteś gotowy do gry! Kliknąć przycisk "Uruchom projekt". Zostaniesz poproszony o wybranie głównej sceny, więc wybierz ``Main.tscn``.
pt_br: Agora está tudo pronto para jogar! Clique no botão "Rodar o Projeto". Será solicitada a seleção de uma cena principal, então escolha ``Principal.tscn``.
ru: Теперь вы готовы к игре! Нажмите на кнопку "Запустить проект". Вам будет предложено выбрать основную сцену - выбирайте ``Main.tscn``.
uk: Тепер ви готові грати! Натисніть кнопку "Відтворити проєкт". Вам буде запропоновано вибрати головну сцену, тому виберіть ``Main.tscn``.
zh_cn: 现在您可以开始游戏了！点击 ``开始项目`` 按钮。将要求您选择一个主场景，因此选择 ``Main.tscn``。
zh_tw: 現在已經可以執行遊戲了！點擊「執行專案」按鈕。接著會被要求選擇一個主場景，這裡我們選 ``Main.tscn`` 。

source: Removing old creeps
cs: Odstranění starých nepřátel
de: Alte Gegner entfernen
es: Removiendo los viejos "creeps"
fr: Supprimer les vieux Creeps
it: Rimozione old creeps
ja: 古い「クリープ」を削除する
ko: 오래된 적들 제거하기
pt_br: Removendo antigas criaturas
ru: Удаляем старых крипов
uk: Видалення старих крипів
zh_cn: 删除旧的小怪
zh_tw: 刪除舊的怪物

source: If you play until "Game Over" and then start a new game right away, the creeps from the previous game may still be on the screen. It would be better if they all disappeared at the start of a new game. We just need a way to tell *all* the mobs to remove themselves. We can do this with the "group" feature.
cs: Pokud budete hrát až do „Game Over“ a ihned poté zahájíte novou hru, můžou se na obrazovce stále zobrazovat nepřátelé z předchozí hry. Bylo by lepší, kdyby všichni zmizeli na začátku hry nové. Potřebujeme jen způsob, jak říct všem nepřátelům, aby zmizeli. Můžeme to udělat pomocí funkcionality „skupina“.
de: Wenn Sie bis zum "Game Over" spielen und dann ein neues Spiel starten, befinden sich die Gegner des vorherigen Spiel noch auf dem Bildschirm. Es wäre besser wenn diese beim Start eines neuen Spiels verschwinden würden. Wir benötigen einen Weg um *alle* Gegner zu entfernen und dies geschieht mit der "Gruppen" Funktion.
es: Si juegas hasta el "Game Over" y comienzas un juego nuevo, los "creeps" del juego previo estarán todavía en pantalla. Sería mejor si todos desaparecen al comienzo del juego nuevo. Sólo necesitamos decirle a todos los enemigos que se remuevan solos. Podemos hacer esto con la característica de "grupos".
fr: Si vous jouez jusqu'au "Game Over" et que vous commencez une nouvelle partie immédiatement, les monstres de la partie précédente sont toujours à l'écran. Il vaudrait mieux qu'ils disparaissent tous au début d'une nouvelle partie. Il nous faut juste un moyen de dire à *tous* les monstres de se supprimer. Nous pouvons le faire grâce à la fonction "groupe".
it: Se giochi fino al "Game Over" e inizi subito una nuova partita, i creeps del gioco precedente potrebbero essere ancora sullo schermo. Sarebbe meglio se scomparissero tutti all'inizio di una nuova partita. Abbiamo solo bisogno di un modo per dire a *tutti* i mob di sparire. Possiamo farlo con la funzione "gruppo".
ja: 「ゲームオーバー」までプレイしてから新しいゲームを開始すると、前のゲームの「クリープ」が画面に表示されたままになっています。 それらすべて、新しいゲームの開始時には消したほうがいいでしょう。それには、\ *すべて*\ のモブたちに自身の削除を指示する方法が必要です。これは「グループ」機能を使えば可能です。
ko: "Game Over"까지 플레이한 다음 바로 새 게임을 시작하면 이전 게임의 크립이 화면에 계속 표시될 수 있습니다. 새 게임이 시작될 때 모두 사라지면 더 좋을 것입니다. 우리는 *모든* 몹에게 스스로 제거하도록 지시할 방법이 필요합니다. "그룹(group)" 기능으로 이 작업을 수행할 수 있습니다.
pt_br: Se você jogar até o "Game Over" e iniciar um novo jogo, as criaturas do jogo anterior ainda poderão estar na tela. Seria melhor se todas elas desaparecessem no iníco de cada partida. Nós só precisamos de um jeito de *falar* para todos os inimigos se auto-destruirem. Nós podemos fazer isso com a funcionalidade "group"(grupo).
ru: Если вы играете до "Game Over", а затем сразу начинаете новую игру, то крипы из предыдущей игры могут все еще оставаться на экране. Было бы лучше, если бы все они исчезали в начале новой игры. Нам просто нужен способ сказать *всем* мобам, чтобы они удалились. Мы можем сделать это с помощью функции "group" ("группа").
uk: Якщо ви дограєте до кінця гри, а потім починаєте нову гру, крипи з попередньої гри все ще залишаються на екрані. Було б краще, якби вони всі зникли на початку нової гри. Нам просто потрібно сказати *всім* мобам, що вони мають знищитися. Ми можемо зробити це за допомогою функції "group" (*група*).
zh_tw: 如果一直玩到「Game Over」並直接開始新遊戲的話，上一場遊戲的怪物可能還在畫面上。開始遊戲的時候如果能讓舊的怪物消失會更好。而我們只需要告訴 **所有** 怪物，刪除自己。我們可以在這裡使用「群組」功能。

source: In the ``Mob`` scene, select the root node and click the "Node" tab next to the Inspector (the same place where you find the node's signals). Next to "Signals", click "Groups" and you can type a new group name and click "Add".
cs: Ve scéně ``Mob`` vyberte kořenový uzel a klikněte na kartu "Uzel" vedle Inspektoru (na stejném místě, kde najdete signály uzlu). Vedle položky "Signály" klikněte na "Skupiny" a můžete zadat nový název skupiny a kliknout na tlačítko "Přidat".
de: Wählen Sie in der Szene ``Mob`` den Wurzel-Node und klicken Sie auf die Registerkarte "Node" neben dem Inspektor (die gleiche Stelle, an der Sie die Signale des Nodes finden). Klicken Sie neben "Signale" auf "Gruppen", und Sie können einen neuen Gruppennamen eingeben und auf "Hinzufügen" klicken.
es: En la escena ``Mob``, selecciona el nodo raíz y haz clic en la pestaña "Node" junto al Inspector (el mismo lugar donde encuentras las señales del nodo). Al lado de "Señales", haz clic en "Grupos" y puedes escribir un nuevo nombre de grupo y hacer clic en "Añadir".
fr: Dans la scène ``Mob``, sélectionnez le nœud racine et cliquez sur l'onglet "Nœud" à côté de l'inspecteur (le même endroit où vous trouvez les signaux du nœud). À côté de "Signaux", cliquez sur "Groupes" et vous pouvez taper un nouveau nom de groupe et cliquer sur "Ajouter".
it: Nella scena ``Mob``, selezionare il nodo radice e cliccare sulla scheda "Nodo" accanto all'Inspector (lo stesso posto dove si trovano i segnali del nodo). Accanto a "Segnali", cliccare su "Gruppi" e si può digitare un nuovo nome per il gruppo e cliccare su "Aggiungi".
ja: ``Mob`` シーンでルートノードを選択し、インスペクタの隣にある「ノード」タブをクリックしてください（ノードのシグナルを見つけるのと同じ場所です）。「シグナル」の横にある「グループ」をクリックして、新しいグループ名を入力して「追加」をクリックします。
ko: ``Mob`` 씬에서 루트 노드를 선택하고 인스펙터 옆에 있는 "노드(Node)" 탭을 클릭하세요(노드의 시그널을 찾을 수 있는 동일한 위치). "시그널(Signals)" 옆에 있는 "그룹(Groups)"을 클릭하고 새 그룹 이름을 입력하고 "추가(Add)"를 클릭하세요.
pt_br: Na cena do ``Inimigo``, selecione o nó raiz e clique na aba "Nó" próxima ao Inspetor(No mesmo lugar onde vocÊ encontra os sinais do nó). Próximo a "Sinais", clique "Grupos", você pode digitar o nome do novo grupo e clicar em "Adicionar".
ru: В сцене ``Mob`` выберите корневой узел и нажмите вкладку "Узел" рядом с Инспектором (там же, где вы находите сигналы узла). Рядом с "Сигналы" нажмите "Группы", введите новое имя группы и нажмите "Добавить".
uk: В сцені ``Mob`` виберіть кореневий вузол і клацніть вкладку "Вузол" поряд з Інспектором (там де ви знаходите сигнали вузла). Біля "Сигнали" натисніть "Групи", і ви можете ввести нову назву групи та натиснути "Додати".
zh_cn: 在“ Mob”场景中，选择根节点，然后单击检查器旁边的“ Node”选项卡（在该位置可以找到节点的信号）。 在“信号”旁边，单击“组”，然后可以输入新的组名称，然后单击“添加”。
zh_tw: 在 ``Mob`` 場景中，先選擇根節點，然後點擊屬性面板旁邊的「節點」分頁（跟設定節點訊號的地方相同）。點擊「訊號」旁邊的「群組」，接著編輯器會讓你設定新群組名稱，最後點擊「新增」。

source: Now all mobs will be in the "mobs" group. We can then add the following line to the ``game_over()`` function in ``Main``:
cs: Nyní budou všechny davy ve skupině „mobs“. K funkci ``game_over()`` v ``Main`` pak můžeme přidat následující řádek:
de: Nun werden alle Gegner in der Gruppe "mobs" sein. Wir können dann die folgende Zeile zur Funktion ``game_over()`` in ``Main`` hinzufügen:
es: Ahora todos los enemigos estarán en el grupo "mobs". Podremos entonces agregar la siguiente línea a la función ``game_over()`` en ``Main``:
fr: Désormais, toutes les monstres feront partie du groupe des "mobs" (monstres). Nous pouvons alors ajouter la ligne suivante à la fonction ``game_over()`` dans ``Main`` :
it: Ora tutti i mob saranno nel gruppo "mob". Possiamo quindi aggiungere la seguente riga alla funzione ``game_over()`` nella funzione ``Main``:
ja: これですべてのモブが 「mobs」グループに入るようになります。あとは、 ``Main`` 内の ``game_over()`` 関数に次の行を追加します。
ko: 이제 모든 몹이 "몹" 그룹에 포함됩니다. 그런 다음 ``Main``\ 의 ``game_over()`` 함수에 다음 줄을 추가하세요:
pt_br: Agora todos os inimigos estarão no grupo "inimigos". Podemos então adicionar a seguinte linha à função ``game_over()`` em ``Main``:
ru: Теперь все мобы будут в группе "mobs". Затем мы можем добавить следующие строки к функции ``game_over()`` в ``Main``:
uk: Тепер всі моби будуть в групі "mobs". Ми можемо додати наступні рядки до функції ``game_over()`` в ``Main``:
zh_cn: 现在，所有生物都将属于“生物”组。 然后，我们可以将以下行添加到Main中的game_over（）函数中：
zh_tw: 現在所有的怪物都會被放在「mobs」群組內了。我們可以接著在 ``Main`` 腳本的 ``game_over()`` 函式中增加下面這行的程式碼：
