Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: The `delta` parameter in the `_process()` function refers to the *frame length* - the amount of time that the previous frame took to complete. Using this value ensures that your movement will remain consistent even if the frame rate changes.
cs: Parametr ``delta`` ve funkci ``_process()`` označuje délku *snímku* - dobu, kterou předchozí snímek potřeboval k dokončení. Použitím této hodnoty zajistíte, že pohyb zůstane konzistentní, i když se změní snímková frekvence.
de: Der Parameter `delta` in der Funktion `__process ()`bezieht sich auf die *Frame-Länge* - die Zeit, die der vorherige Frame für die Fertigstellung benötigt hat. Durch die Verwendung dieses Werts wird sichergestellt, dass Ihre Bewegung auch dann konstant bleibt, wenn sich die Bildrate ändert.
es: El parámetro `delta` en la función `_process()` se refiere al *frame length* -la cantidad de tiempo que le tomo al frame anterior para completarse. Usando este valor aseguras que tu movimiento sera consistente incluso si el frame rate cambia .
fr: Le paramètre `delta` de la fonction `_process()` fait référence à la *longueur de l'image* - le temps qu'à mis l'image précédente pour se terminer. Utiliser cette valeur assure que le mouvement restera constant même si le taux d'images par seconde varie.
it: Il parametro `delta` della funzione `_process()` si riferisce alla *lunghezza del frame* - il tempo di esecuzione del frame precedente. Usare questo valore garantisce che il movimento sia proporzionale al frame precedente, in caso di variazione del frame rate.
ja: `_process()` 関数の `delta` パラメータは *フレームの長さ* - 前のフレームが完了するまでに要した時間を参照します。この値を使うことで、動きの処理はフレームレートの変動の影響を受けなくなります。
ko: `_process()` 함수에 있는 매개변수 `delta` 는 (이전 프레임이 완료되는데 걸린 시간인) "프레임 길이(frame length)" 를 참조합니다. 이 값을 사용하면 프레임 레이트가 변경되어도 플레이어의 이동속도를 항상 일정하게 유지할 수 있습니다.
pt_br: O parâmetro `delta` na função `_process()` se refere ao *comprimento do frame* - a quantidade de tempo que o frame anterior levou para ser completado. Usando este valor você se certifica que seu movimento será constante, mesmo quando o frame rate sofrer alterações.
ru: Параметр "delta" в функции "_process()" означает *длительность кадра*, то есть время, потраченное на завершение обработки предыдущего кадра. Благодаря использованию этого значения скорость движения будет постоянной даже при изменении частоты кадров.
uk: Параметр ``delta`` у функції ``_process ()`` означає *тривалість кадру* - тобто часу, необхідного для завершення попереднього кадру. Використання цього значення гарантує, що ваш рух залишатиметься послідовним, навіть якщо частота кадрів змінюється.
zh_cn: `_process()` 函数的 `delta` 参数是*帧长度*——完成上一帧所花费的时间。使用这个值的话，可以保证你的移动不会被帧率的变化所影响。
zh_tw: **_process()** 函式的 **delta** 參數代表了 **影格時長** ——即是自從上一個影格到現在這個影格所花費的時間。通過這個數值可以確保即使幀率發生變化，移動的距離也能保持不變。

source: Click "Play Scene" (``F6``) and confirm you can move the player around the screen in all directions.
cs: Klikněte na "Přehrát scénu" (``F6``) a ujistěte se, že můžete hráčem posunovat po obrazovce ve všech směrech.
de: Klicken Sie auf "Szene abspielen" (``F6``) und stellen sicher, dass der Spieler sich auf dem Bildschirm in alle Richtungen bewegen kann.
es: Haz click en "Reproducir Escena" (``F6``) y confirma que puedes mover el jugador alrededor de la escena en todas direcciones.
fr: Cliquez sur "Lancer la scène" (``F6``) et vérifiez que vous pouvez déplacer le joueur autour de l'écran dans toutes les directions.
it: Clicca su "Avvia Scena" (``F6``) e verifica di poter muovere il giocatore sullo schermo in tutte le direzioni.
ja: 「シーンを実行」(``F6``)をクリックして、スクリーンで全方向にプレイヤーを移動できることを確認してください。
ko: "씬 실행(Play Scene)" (``F6``)을 누르고 플레이어가 화면 내에서 모든 방향으로 움직일 수 있는지 확인하세요.
pl: Kliknij "Uruchom Scenę" (``F6``) i potwierdź, że możesz poruszać graczem po ekranie we wszystkich kierunkach.
pt_br: Clique em "Rodar Cena" (``F6``) e confira se consegue mover o jogador pela tela em todas as direções.
ru: Нажмите "Запустить сцену" (``F6``) и удостоверьтесь, что вы можете перемещать игрока по экрану во всех направлениях.
uk: Натисніть "Відтворити сцену" (``F6``) і переконайтеся, що можете рухати гравця по екрані у всіх напрямках.
zh_cn: 点击“运行场景”（``F6``）并确认您能够在屏幕中沿任一方向移动玩家。
zh_tw: 點擊 [執行場景] (``F6``) 並測試玩家能否夠移動到任何一個方向。

source: If you get an error in the "Debugger" panel that says
cs: Pokud se zobrazí následující chyba v panelu "Debugger"
de: Wenn ein Fehler im "Debugger" Bereich auftaucht, der sagt
es: Si tu obtienes un error en el panel "Debugger" que dice
fr: Si vous obtenez une erreur le panneau "Debugger" qui dit
it: Se si ottiene un errore nel pannello "Debugger" che dice
ja: 「デバッガ」パネルで以下のようなエラーが発生した場合
ko: "디버거(Debugger)" 패널에 다음과 같은 오류가 표시되는 경우
pt_br: Se encontrar um erro no painel "Depurador" que diz
ru: Если вы получаете ошибку в панели "Отладчик", которая говорит
uk: Якщо ви отримуєте помилку на панелі "Зневаджувач", яка говорить
zh_cn: 如果您在调试器(Debugger)面板中看到错误：
zh_tw: 若「除錯工具」中出現了這樣的錯誤

source: ``Attempt to call function 'play' in base 'null instance' on a null instance``
cs: ``Pokus o volání funkce 'play' v základní 'null instance' na null instance``
es: `` Intento de llamar a la función 'play' en la base 'null instance' en una instancia nula ''
it: ``Tentativo di chiamare la funzione 'play' nella base 'istanza nulla' su un'istanza nulla``
ja: ``null インスタンス上の ベース 'null インスタンス' の関数 'play' を呼び出そうとしています。``
pt_br: ``A tentativa de chamar a função 'play' na base 'instance null' em uma instância nula``
ru: ``Попытка вызова функции 'play' в основании 'null instance' на нулевом экземпляре``
uk: ``Спроба виклику функції 'play' в основі 'null instance' на нульовому зразкові``
zh_tw: ``Attempt to call function 'play' in base 'null instance' on a null instance`` (嘗試在基礎型別為「null 實體」的 null 實體上呼叫「play」函式)

source: this likely means you spelled the name of the AnimatedSprite node wrong. Node names are case-sensitive and ``$NodeName`` must match the name you see in the scene tree.
cs: to pravděpodobně znamená, že jste špatně zadali název uzlu AnimatedSprite. Názvy uzlů rozlišují velká a malá písmena a ``$NodeName`` musí odpovídat jménu, které vidíte ve stromu scény.
de: bedeutet das wahrscheinlich, dass der Node-Namen des AnimatedSprite falsch geschrieben wurde. Node-Namen sind case-sensitive und ``$NodeName`` oder ``get_node("NodeName")`` müssen mit dem Namen übereinstimmen, der im Szenenbaum zu sehen ist.
es: esto puede significar que se ha escrito mal el nombre del nodo AnimatedSprite. Los nombres de nodo son sensible a mayúsculas y ``$NodeName`` debe coincidir con el nombre que ves en el árbol de escenas.
fr: cela signifie probablement que vous avez mal orthographié le nom du nœud AnimatedSprite. Les noms de nœuds sont sensibles à la casse et ``$NodeName`` doit correspondre au nom que vous voyez dans l'arbre de scènes.
it: questo probabilmente significa che hai scritto il nome del nodo AnimatedSprite in modo sbagliato. I nomi dei nodi sono case-sensitive e ``$NomeNodo`` deve corrispondere al nome che vedi nello scene tree.
ja: この場合、AnimatedSpriteノード名のスペルが間違っている可能性があります。ノード名は大文字と小文字を区別するので、\ ``$NodeName`` はシーン ツリーに表示されている名前と一致させる必要があります。
ko: 이는 AnimatedSprite 노드의 이름을 잘못 입력했음을 의미합니다. 노드 이름은 대소문자를 구분하며 ``$NodeName``\ 또는 ``get_node("NodeName")``\ 이 씬 트리에 표시되는 이름과 일치해야 합니다.
pt_br: Se você vir no painel "Depurador" um erro referente a "null instance" (instância nula), provavelmente significa que você digitou o nome do nó errado. Letras maiúsculas e minúsculas fazem diferença nos nomes dos nós, e ``$NomeDoNo`` ou ``get_node("NomeDoNo")`` tem que coincidir com o nome que você vê na árvore da cena.
ru: это, скорее всего, означает, что вы ввели название узла AnimatedSprite неверно. Имена узлов чувствительны к регистру, а ``$NodeName`` должен совпадать с именем, которое вы видите в дереве сцены.
uk: це, ймовірно, означає, що ви неправильно написали ім'я вузла AnimatedSprite. Імена вузлів залежать від регістру і `` $ NodeName`` повинен відповідати імені, яке ви бачите в дереві сцен.
zh_tw: 通常這代表程式中的 AnimatedSprite 節點名稱拼錯了。節點名稱有區分大小寫，而且 ``$NodeName`` 這種語法中的名稱必須與場景樹裡能看到的節點名稱一致。

source: Choosing animations
cs: Výběr animací
de: Animationen
es: Seleccionar animaciones
fr: Choisir les animations
it: Scegliere le animazioni
ja: アニメーションの選択
ko: 애니메이션 고르기
pt_br: Selecionado as Animações
ru: Выбор анимации
uk: Вибір анімації
zh_cn: 选择动画
zh_tw: 選擇動畫

source: Now that the player can move, we need to change which animation the AnimatedSprite is playing based on its direction. We have the "walk" animation, which shows the player walking to the right. This animation should be flipped horizontally using the ``flip_h`` property for left movement. We also have the "up" animation, which should be flipped vertically with ``flip_v`` for downward movement. Let's place this code at the end of the ``_process()`` function:
cs: Nyní, když se hráč může pohybovat, musíme změnit podle směru jeho pohybu animaci, kterou AnimatedSprite přehrává. Máme animaci „chůze“, která ukazuje pohyb hráče doprava, Tato animace by se měla vodorovně převrátit pomocí vlastnosti ``flip_h`` pro pohyb doleva. Máme také animaci "nahoru", která by měla být svisle převrácená s ``flip_v`` pro pohyb dolů. Umístíme tento kód na konec funkce ``_process()``:
de: Nachdem sich der Player bewegen kann, müssen wir die von AnimatedSprite abgespielte Animation anhand seiner Richtung ändern. Wir haben die "Walk" -Animation, die den Spieler zeigt, wie er nach rechts geht. Diese Animation sollte horizontal gespiegelt werden, indem die Eigenschaft ``flip_h`` für die Bewegung nach links verwendet wird. Wir haben auch die "Auf" -Animation, die vertikal mit ``flip_v`` für die Abwärtsbewegung gespiegelt werden sollte. Platzieren wir diesen Code am Ende der Funktion ``_process()``:
es: Ahora que Player se puede mover, necesitamos cambiar la animación que AnimatedSprite ejecutará basándose en la dirección. Tenemos una animación "walk" (caminar), que mostrará a Player caminando hacia la derecha. Esta animación será volteada (flip) horizontalmente usando la propiedad ``flip_h`` para movimiento hacia la izquierda. También tenemos la animación "up" (arriba) que usará ``flip_v`` para movimiento hacia abajo. Coloquemos este código al final de nuestra función ``_process()``:
fr: Maintenant que le joueur peut se déplacer, nous devons changer l'animation que l'AnimatedSprite joue en fonction de la direction. Nous avons une animation "walk", qui montre le joueur marchant vers la droite. Cette animation doit être retournée horizontalement en utilisant la propriété ``flip_h`` pour le mouvement vers la gauche, et une animation "up", qui doit être retournée verticalement avec ``flip_v`` pour le mouvement vers le bas. Rajoutez ce code à la fin de notre fonction ``_process()`` :
it: Ora che il giocatore si può muovere, abbiamo bisogno di cambiare l'animazione eseguita da AnimatedSprite in base alla direzione. Abbiamo l'animazione "right", che deve essere specchiata orizzontalmente usando la proprietà ``flip_h`` per ottenere il movimento a sinistra, e un animazione "up", la quale deve essere capovolta verticalmente con ``flip_v`` per ottenere il movimento verso il basso. Aggiungiamo questo pezzo di codice alla fine della funzione ``_process()``:
ja: プレイヤーを移動できるようになったので、AnimatedSpriteが再生するアニメーションを方向に合わせて変更させる必要があります。今あるのは「walk」アニメーションで、プレイヤーは右方向へ歩きます。左への動きには ``flip_h`` プロパティを使用して水平に反転させます。また「up」アニメーションもあり、これは ``flip_v`` で垂直に反転させれば、下への動きになります。では、このコードを ``_process()`` 関数の最後に配置します:
ko: 이제 플레이어가 이동할 수 있으므로 방향에 따라 AnimatedSprite가 재생 중인 애니메이션을 변경해야 합니다. 플레이어가 오른쪽으로 걷는 것을 보여주는 "walk" 애니메이션이 있습니다. 이 애니메이션은 왼쪽 이동을 위해 ``flip_h`` 속성을 사용해 수평으로 뒤집혀져야 합니다. 아래로 이동하려면 ``flip_v``\ 로 수직으로 뒤집혀져야 하는 "up" 애니메이션도 있습니다. 이 코드를 ``_process()`` 함수의 끝에 배치해 보겠습니다:
pt_br: Agora que o jogador consegue se mover, precisamos alterar qual animação do AnimatedSprite é reproduzida conforme a direção. Temos uma animação "andar", que mostra o jogador andando para a direita. Essa animação deve ser espelhada horizontalmente usando a propriedade ``flip_h`` para o jogador se movimentar à esquerda. Temos também a animação "cima", que deveria ser espelhada verticalmente com ``flip_v`` para o movimento para baixo. Vamos colocar este código no fim da nossa função ``_process()``:
ru: Теперь, когда игрок может двигаться, нам нужно изменять анимацию AnimatedSprite в зависимости от направления движения. У нас есть анимация "walk", которая показывает игрока, идущего направо. Эту анимацию следует перевернуть горизонтально, используя свойство ``flip_h`` для движения влево. У нас также есть анимация "up", которую нужно перевернуть вертикально с помощью ``flip_v`` для движения вниз. Поместим этот код в конец функции ``_process ()``:
uk: Тепер, коли гравець може рухатися, нам потрібно змінити, яку анімацію грає AnimatedSprite, виходячи з її напрямку. У нас є анімація "прогулянка", яка показує гравцеві, що йде праворуч. Цю анімацію слід перевернути горизонтально, використовуючи властивість `` flip_h '' для руху ліворуч. У нас також є анімація "вгору", яку слід перевернути вертикально "flip_v" для руху вниз. Розмістимо цей код в кінці функції `` _process () ``:
zh_tw: 現在玩家可以移動了，現在讓我們來根據移動的方向改變播放的 AnimatedSprite。「walk」動畫會讓玩家看起來朝右邊行走，朝左邊行走時使用 ``flip_h`` 屬性來水平翻轉動畫。另一個動畫是「up」，朝下行走時使用 ``flip_v`` 來垂直翻轉。來把程式碼放到 ``_process()`` 函式的尾端：

source: The boolean assignments in the code above are a common shorthand for programmers. Since we're doing a comparison test (boolean) and also *assigning* a boolean value, we can do both at the same time. Consider this code versus the one-line boolean assignment above:
cs: Booleovská přiřazení ve výše uvedeném kódu jsou běžnými zkratkami při programování. Protože provádíme porovnání (booleovsky) a pak *přiřazujeme* booleovskou hodnotu, můžeme oba kroky provést současně. Porovnejte tento kód s jednořádkovým přiřazením výše:
de: Die booleschen Zuweisungen im obigen Code sind eine gebräuchliche Abkürzung für Programmierer. Da wir einen Vergleichstest (boolescher Wert) durchführen und auch einen booleschen Wert *zuweisen*, können wir beide gleichzeitig durchführen. Betrachten Sie diesen Code im Vergleich zur obigen einzeiligen booleschen Zuweisung:
es: Las asignaciones booleanas en el código de arriba son una abreviatura para los programadores. Como estamos haciendo una comparación (booleana) y al mismo tiempo asignando un valor booleano, podemos hacer las dos cosas a la vez. Considere este código versus la asignación booleana abreviada de arriba:
fr: Les affectations booléennes dans le code ci-dessus sont un raccourci courant pour les programmeurs. Puisque nous faisons un test de comparaison (booléen) et aussi *assignons* une valeur booléenne, nous pouvons faire les deux en même temps. Considérez ce code par rapport à l'affectation booléenne d'une ligne ci-dessus :
it: Le assegnazioni booleane nel codice qui sopra sono comuni abbreviazioni per i programmatori. Siccome stiamo facendo una comparazione (booleano) a anche *assegnando* un valore booleano, possiamo fare entrambi allo stesso momento. Considera questo codice contro l'assegnamento booleano in un'unica riga mostrato sopra:
ja: 上記のコードにおけるブール値の代入は、プログラマーがよく使う略式記法です。比較テスト（ブール値）とブール値の代入を行っていますが、両方とも同時に行うことができます。次のコードと、上記の1行でのブール値代入とを比べてみましょう。
ko: 위 코드의 불리언(boolean) 값 할당은 프로그래머를 위한 일반적인 축약입니다. 우리는 비교 테스트(boolean)를 수행하고 또한 boolean 값을 *할당*하기 때문에 두 가지를 동시에 수행할 수 있습니다. 아래 코드와 위의 한 줄 부울 할당 명령문을 비교해보세요:
pt_br: As atribuiçoes booleanas no código acima são um encurtamento comum para programadores. Já que estamos fazendo um teste de comparação(booleano) e *atribuindo* um valor booleano, é possível fazer os dois ao mesmo tempo. Compare esse código a atribuição booleana encurtada, acima:
ru: Логические присваивания в коде выше являются общим сокращением для программистов. Поскольку мы проводим проверку сравнения (логическую, булеву), а также *присваиваем* булево значение, мы можем делать и то, и другое одновременно. Рассмотрим этот код в сравнении с однострочным логическим присваиванием выше:
uk: Булеві призначення в наведеному вище коді - це звичайна стенограма для програмістів. Оскільки ми робимо тест порівняння (булевий), а також * присвоюємо * булеве значення, ми можемо робити і те й інше. Розглянемо цей код порівняно з однорядним булевим призначенням вище:
zh_tw: 在這段程式碼中的布林賦值是程式設計師常用的一種簡寫方式。因為做了數值比較 (會得到布林值) 後也需要將這個布林值 **賦值** 到變數上，所以我們可以把這兩件事合在一起做。可以比較看看下面這段程式碼跟上方範例中單行布林賦值的程式：

source: Play the scene again and check that the animations are correct in each of the directions.
cs: Zahrajte si scénu znovu a zkontrolujte, zda jsou animace ve všech směrech odpovídající.
de: Spielen Sie die Szene erneut ab und überprüfen Sie, ob die Animationen in jeder Richtung korrekt sind.
es: Reproduce la escena de nuevo y revisa si las animaciones son correctas en cada una de las direcciones.
fr: Relancez la scène et vérifiez que les animations sont correctes dans chacune des directions.
it: Riprodurre la scena e verificare che le animazioni siano corrette in ciascuna delle direzioni.
ja: もう一度シーンを再生して、それぞれの方向のアニメーションが正しいことを確認してください。
ko: 씬을 다시 재생하고 애니메이션이 각 방향에서 올바른지 확인합니다.
pt_br: Execute a cena novamente e verifique se as animações estão corretas em cada uma das direções.
ru: Воспроизведите сцену еще раз и проверьте правильность анимации в каждом из направлений.
uk: Відтворіть сцену ще раз і перевірте правильність анімації в кожному з напрямків.
zh_cn: 再次播放场景并检查每个方向上的动画是否正确。
zh_tw: 再執行一次場景來看看各個方向的動畫是否正確。

source: A common mistake here is to type the names of the animations wrong. The animation names in the SpriteFrames panel must match what you type in the code. If you named the animation ``"Walk"``, you must also use a capital "W" in the code.
cs: Častou chybou je nesprávné zadání názvů animací. Názvy animací v panelu SpriteFrames se musí shodovat s tím, co zadáte v kódu. Pokud jste animaci pojmenovali ``"Walk"``, musíte v kódu také použít velké písmeno "W".
de: Ein allgemeiner Fehler ist hier, die Namen der Animationen falsch zu benennen. Die Animationsnamen in dem SpriteFrames Bereich müssen mit dem, was im Code geschrieben steht, übereinstimmen. Wenn die Animation ``"Walk"`` heißt, dann muss auch ein großgeschriebenes "W" im Code stehen.
es: Un error común aquí es escribir los nombres de las animaciones mal. Los nombres de las animaciones en el SpriteFrames panel deberán coincidir con lo que tu escribes en tu código. si tu llamas la animación ``"Caminar"``, tu también deberás usar la mayúscula "C" en el código.
fr: Une erreur courante consiste ici à mal taper les noms des animations. Les noms des animations dans le panneau SpriteFrames doivent correspondre à ce que vous tapez dans le code. Si vous avez nommé l'animation ``"Walk"``, vous devez également utiliser un "W" majuscule dans le code.
it: Un errore comune è quello di sbagliare i nomi delle animazioni. I nomi delle animazioni nel pannello SpriteFrames devono corrispondere a quello che si digita nel codice. Se avete chiamato l'animazione ```"Walk"```, dovete anche usare una "W" maiuscola nel codice.
ja: ここでよくある間違いは、アニメーションの名前を間違って入力してしまうことです。SpriteFramesパネルに表示されるアニメーションの名前は、コードの中で入力したものと一致していなければなりません。もしアニメーションの名前を ``"Walk"`` とした場合、コード中では大文字の "W" も使わなければなりません。
ko: 흔한 실수로 애니메이션 이름을 잘못 입력합니다. SpriteFrames 패널의 애니메이션 이름은 코드에 입력한 것과 일치해야 합니다. 애니메이션 이름을 ``"Walk"``\ 으로 지은 경우 코드에 대문자 "W"를 사용해야 합니다.
pt_br: Um erro comum aqui é digitar os nomes das animações de forma errada. O nome das animações no painel SpriteFrames deve ser igual ao que foi digitado no código. Se você nomeou a animação ``"Walk"`` você também deve usar a letra maiúscula "W" no código.
ru: Общей ошибкой является неправильное именование анимаций. Имена анимаций в панели SpriteFrames должны совпадать с именами анимаций в вашем коде. Если вы назвали анимацию "Walk", вы должны также использовать заглавную букву "W" в коде.
uk: Загальною помилкою є неправильне іменування анімацій. Імена анімацій в панелі SpriteFrames повинні збігатися з іменами анімацій в вашому коді. Якщо ви назвали анімацію "Walk", ви повинні також використовувати велику літеру "W" в коді.
zh_tw: 很多人會在這裡打錯動畫名稱。SpriteFrames 面板上的動畫名稱必須與程式碼中輸入的名稱一致。如果動畫名稱為 ``「Walk」`` ，則程式碼中也必須使用大寫的「W」。

source: When you're sure the movement is working correctly, add this line to ``_ready()``, so the player will be hidden when the game starts:
cs: Pokud jste si jisti, že pohyb funguje správně, přidejte tento řádek do ``_ready () ``, takže hráč bude při spuštění hry skrytý:
de: Spielen Sie die Szene noch einmal ab und überprüfen, ob die Animationen in jede Richtung korrekt sind. Wenn Sie sich sicher sind, dass die Bewegung korrekt funktioniert, fügen Sie diese Zeile zu ``_ready()`` hinzu, damit der Spieler zu Beginn des Spiels ausgeblendet wird:
es: Cuando estés seguro de que el movimiento funciona correctamente, agrega esta línea a ``_ready()`` para que el jugador esté oculto cuando comience el juego:
fr: Lorsque vous êtes sûr que le mouvement fonctionne correctement, ajoutez cette ligne à ``_ready()``, afin que le joueur soit caché au début du jeu :
it: Quando sei sicuro che il movimento stia funzionando correttamente, aggiungi questa linea a ``_ready()``, così che il player sarà nascosto quando il gioco inizia:
ja: 動きが正しく機能していることを確認したら、次の行を ``_ready()`` に追加して、ゲームの開始時にプレイヤーが非表示になるようにします:
ko: 플레이어가 제대로 움직이고 있다고 생각하면 다음 줄을 ``_ready()``\ 에 추가해보세요. 게임이 시작될 때 플레이어가 숨겨집니다:
pt_br: Quando tiver certeza que a movimentação está funcionando corretamente, adicione esta linha à ``_ready()`` para que o jogador fique oculto no início do jogo:
ru: Если вы уверены, что движение работает правильно, добавьте эту строку в ``_ready()``, чтобы игрок был скрыт при запуске игры:
uk: Коли ви впевнені, що рух працює правильно, додайте цей рядок до ``_ready ()``, щоб гравець був прихований, коли гра починається:
zh_cn: 当您确定移动正常工作时，请将此行添加到 ``_ready()``，以便 ``Player`` 在游戏开始时会被隐藏：
zh_tw: 確保能正常移動後，來把下面這行程式碼加到 ``_ready()`` 裡。如此一來在遊戲開始的時候玩家會隱藏起來：

source: Preparing for collisions
cs: Příprava na kolize
de: Vorbereitung auf Kollisionen
es: Preparacion para las colisiones
fr: Préparation pour les collisions
it: Preparazione per le collisioni
ja: コリジョン(衝突/当り判定)の準備
ko: 콜리전 준비하기
pt_br: Preparando para colisões
ru: Подготовка к столкновениям
uk: Підготовка до зіткнень
zh_cn: 准备碰撞
zh_tw: 準備碰撞
