Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: The final piece our game needs is a UI: an interface to display things like score, a "game over" message, and a restart button. Create a new scene, and add a :ref:`CanvasLayer <class_CanvasLayer>` node named ``HUD``. "HUD" stands for "heads-up display", an informational display that appears as an overlay on top of the game view.
cs: Posledním kouskem, který naše hra potřebuje, je UI: rozhraní pro zobrazování věcí, jako je skóre, zpráva „konec hry“ a tlačítko restartu. Vytvořte novou scénu a přidejte uzel s názvem ``HUD`` :ref:`CanvasLayer <class_CanvasLayer>`. „HUD“ znamená „heads-up display“, informační displej, který se zobrazuje jako překryv v horní části herní obrazovky.
de: Das letzte Bauteil, das unser Spiel braucht, ist eine Benutzeroberfläche: eine Schnittstelle, um Dinge wie Punktestand, eine "Game Over"-Meldung und einen Neustart-Button anzuzeigen. Erstellen Sie eine neue Szene und füge einen :ref:`CanvasLayer <class_CanvasLayer>` Node namens ``HUD`` hinzu. "HUD" steht für "Heads-up Display", ein Informationsanzeige, das als Überlagerung über der Spielansicht erscheint.
es: La pieza final de nuestro juego es una UI (interfaz de usuario): una interfaz para mostrar cosas como la puntuación, el mensaje de "juego terminado" y un botón de reinicio. Crea una nueva escena, agrega un nodo :ref:`CanvasLayer <class_CanvasLayer>` llamado ``HUD``. "HUD" viene de "heads-up display" y es la serie de elementos informativos que aparecen encima de la vista de juego.
fr: La dernière partie dont notre jeu a besoin est une interface utilisateur : une interface pour afficher des choses comme le score, un message "game over" et un bouton pour recommencer. Créez une nouvelle scène, et ajoutez un nœud :ref:`CanvasLayer <class_CanvasLayer>` nommé ``HUD``. "HUD" signifie "heads-up display", un écran d'information qui est affiché superposé à la vue du jeu.
it: L'ultimo pezzo di cui il nostro gioco ha bisogno è un'interfaccia utente: qualcosa per visualizzare il punteggio, un messaggio "game over" e un pulsante di riavvio. Creare una nuova scena e aggiungere un nodo :ref:'CanvasLayer <class_CanvasLayer>' denominato ''HUD''. Esso sta per "heads-up display", un display informativo che appare come una sovrapposizione sulla parte superiore della vista di gioco.
ja: ゲームに必要な最後の部分は、スコア、「ゲームオーバー」メッセージ、再起動ボタンなどを表示するインターフェイスです。新しいシーンを作成し、 ``HUD`` という名前の\ :ref:`CanvasLayer <class_CanvasLayer>`\ ノードを追加します。「HUD」は、ゲームビューの上にオーバーレイとして表示される情報表示である「ヘッドアップディスプレイ」の略です。
ko: 게임에 마지막으로 필요한 것은 UI입니다: 인터페이스로 점수, "game over" 메시지, 재시작 버튼을 화면에 보여줍니다. 새 씬을 만들고, :ref:`CanvasLayer <class_CanvasLayer>` 노드를 추가하고 ``HUD``\ 라고 이름지으세요. "HUD"는 "heads-up display"의 약자로, 정보를 게임 화면 앞에 덮어씌우는 방식입니다.
pl: Ostatnim elementem, którego potrzebuje nasza gra jest interfejs użytkownika: interfejs do wyświetlania takich informacji, jak wynik, komunikat "game over"(koniec gry) i przycisk restartu. Utwórz nową scenę i dodaj węzeł :ref:`CanvasLayer <class_CanvasLayer>` o nazwie ``HUD``. "HUD" oznacza "Heads-up display" - wyświetlacz informacyjny, który pojawia się jako nakładka na widoku gry i informuje o np. liczbie punktów, punktów życia.
pt_br: A peça final que nosso jogo precisa é uma interface com usuário: uma interface que mostra coisas como pontuação, uma mensagem de "fim de jogo" e um botão de reinício. Crie uma cena e adicione um nó :ref:`CanvasLayer <class_CanvasLayer>` chamado ``HUD``. "HUD" significa "heads-up display", um mostrador informativo que aparece como uma camada de sobreposição à visão do jogo.
ru: Последняя часть, в которой нуждается наша игра, - это UI: интерфейс для отображения таких вещей, как игровой счет, сообщение "игра окончена" и кнопка перезапуска. Создайте новую сцену и добавьте узел :ref:`CanvasLayer <class_CanvasLayer>` с именем ``HUD``. "HUD" означает "heads-up display", информационный дисплей, отображающийся поверх игры.
uk: Останній фрагмент, який потрібен нашій грі, - це інтерфейс користувача: інтерфейс для відображення таких речей, як рахунок, повідомлення "game over" ("гра закінчена") та кнопка перезапуску. Створіть нову сцену та додайте вузол :ref:`CanvasLayer <class_CanvasLayer>` з іменем ``HUD``. "HUD" означає "head-up display" , інформаційний дисплей, який з'являється у вигляді перекриття поверх ігрового вікна.
zh_cn: 我们的游戏需要的最后一块是UI：一个界面，用于显示得分、“游戏结束”消息、和重新启动按钮。创建一个新场景，并添加一个名为 ``HUD`` 的 :ref:`CanvasLayer <class_CanvasLayer>` 节点。``HUD`` 表示 ``平视显示（heads-up display）``，这是一种信息显示，显示为游戏视图顶部的叠加层。
zh_tw: 最後，這個遊戲需要 UI：一個會顯示如分數、「Game Over」訊息、與重新開始遊戲按鈕的界面。建立一個新場景並新增一個名為 ``HUD`` 的 :ref:`CanvasLayer <class_CanvasLayer>` 節點。HUD 是覆蓋顯示於遊戲畫面上方，用於表示資訊的「擡頭顯示器 (Heads-Up Display)」的簡稱。

source: The :ref:`CanvasLayer <class_CanvasLayer>` node lets us draw our UI elements on a layer above the rest of the game, so that the information it displays isn't covered up by any game elements like the player or mobs.
cs: Uzel :ref:`CanvasLayer <class_CanvasLayer>` umožňuje nakreslit naše prvky uživatelského rozhraní do vrstvy nad zbytkem hry, takže informace, které zobrazuje, nejsou zakryty žádnými herními prvky, jako je hráč nebo nepřátelé.
de: Mit dem Node :ref:`CanvasLayer <class_CanvasLayer>` können wir unsere Oberflächenelemente auf einer Ebene über dem Rest des Spiels zeichnen, so dass die angezeigten Informationen nicht durch irgendwelche Spielelemente wie den Spieler oder Gegner verdeckt werden.
es: El nodo :ref:`CanvasLayer <class_CanvasLayer>` nos permitirá colocar elementos de nuestra UI en una capa por encima del juego, así la información que mostrará no estará cubierta por ningún elemento como el jugador o los enemigos.
fr: Le nœud :ref:`CanvasLayer <class_CanvasLayer>` nous permet de dessiner nos éléments de l'interface utilisateur sur un calque au-dessus du reste du jeu, de sorte que les informations qu'il affiche ne sont couvertes par aucun élément du jeu comme le joueur ou les monstres.
it: Il nodo :ref:'CanvasLayer <class_CanvasLayer>' ci consente di disegnare i nostri elementi dell'interfaccia utente su un livello sopra il resto del gioco, in modo che le informazioni visualizzate non vengano coperte da elementi di gioco come il giocatore o i mob.
ja: :ref:`CanvasLayer <class_CanvasLayer>`\ ノードを使用すると、ゲームの他の部分よりも上のレイヤにUI要素を描画することができるため、表示される情報がプレイヤーやモブなどのゲーム要素によって隠されることがなくなります。
ko: :ref:`CanvasLayer <class_CanvasLayer>` 노드는 게임 위 레이어에 우리의 UI 요소들을 그릴수 있게 해주고, 이로써 보여지는 정보가 플레이어나 몹과 같은 게임 요소들에 의해 가려지지 않게 만듭니다.
pl: Węzeł :ref:`CanvasLayer <class_CanvasLayer>` pozwala nam narysować nasze elementy interfejsu użytkownika na warstwie będącą przed resztą gry, tak aby wyświetlane przez niego informacje nie były zakryte żadnymi elementami gry, takimi jak gracz lub przeciwnik.
pt_br: O nó :ref:`CanvasLayer <class_CanvasLayer>` nos permite desenhar nossos elementos de interface em uma camada acima do resto do jogo, de forma que as informações que ela mostrar não fiquem cobertas por quaisquer elementos do jogo, como o jogador ou os inimigos.
ru: Узел :ref:`CanvasLayer <class_CanvasLayer>` позволяет нам прорисовывать элементы нашего UI на слое поверх всей остальной игры, поэтому отображаемая информация не перекрывается никакими игровыми элементами, такими как игрок или мобы.
uk: Вузол :ref:`CanvasLayer <class_CanvasLayer>` дозволяє нам малювати наші елементи призначені для інтерфейсу користувача поверх решти частини гри, так що відображена в ньому інформація не прикривається ніякими ігровими елементами, такими як гравець, чи моби.
zh_cn: :ref:`CanvasLayer <class_CanvasLayer>` 节点允许我们在游戏其余部分上面的层上绘制UI元素， 以便其显示的信息不会被任何游戏元素覆盖，比如 ``Player`` 或 ``mobs``。
zh_tw: 使用 :ref:`CanvasLayer <class_CanvasLayer>` 節點可以讓我們在遊戲上方的圖層上繪製 UI 元素，這樣上面顯示的資訊就不會被其他遊戲元素如玩家或怪物給蓋住。

source: The HUD needs to display the following information:
cs: HUD musí zobrazit následující informace:
de: Das HUD sollte die folgenden Informationen anzeigen:
es: El HUD necesitará mostrar la siguiente información:
fr: Le HUD doit afficher les informations suivantes :
it: L'HUD deve mostrare le seguenti informazioni:
ja: HUDには、次の情報を表示する必要があります:
ko: HUD는 다음 정보를 표시해야 합니다:
pt_br: O HUD exibirá as seguintes informações:
ru: HUD должен отображать следующую информацию:
uk: HUD повинен відобразити наступну інформацію:
zh_tw: HUD 需要顯示如下資訊：

source: Score, changed by ``ScoreTimer``.
cs: Skóre, změněno uzlem ``ScoreTimer``.
de: Punktzahl, geändert durch ``ScoreTimer``.
es: Puntuación, cambiado por ``ScoreTimer``.
fr: Le score, modifié par ``ScoreTimer``.
it: Punteggio, modificato da ''ScoreTimer''.
ja: ``ScoreTimer`` によって変更されるスコア。
ko: ``ScoreTimer``\ 에 의해 변경되는 점수(Score).
pl: Wynik, zmieniany przez ``ScoreTimer``.
pt_br: Pontuação, alterado por ``ScoreTimer``.
ru: Счет, измененный ``ScoreTimer``.
uk: Рахунок, змінюваний ``ScoreTimer``.
zh_cn: 得分，由 ``ScoreTimer`` 更改。
zh_tw: 分數，會通過 ``ScoreTimer`` 來更改。

source: A message, such as "Game Over" or "Get Ready!"
cs: Zprávu, například „Game Over“ nebo „Připravte se!“
de: Eine Nachricht, wie z.B. "Game Over" oder "Get Ready!"
es: Un mensaje como "Game Over" o "Get Ready!"
fr: Un message, tel que "Game Over" ou "Get Ready"
it: Un messaggio, ad esempio "Game Over" o "Get Ready!"
ja: 「Game Over」や「Get Ready! (よーい！)」 などのメッセージ
ko: "Game Over"나 "Get Ready!"와 같은 메시지
pl: Wiadomości takie jak "Koniec Gry" lub "Przygotuj Się!"
pt_br: Uma mensagem, como "Game Over" ou "Prepare-se!"
ru: Сообщение, например "Game Over" или "Get Ready!"
uk: Повідомлення, наприклад "Game Over" ("Гра закінчена"), або "Get Ready!" ("Готуйся!")
zh_cn: 一条消息，例如 ``Game Over`` 或 ``Get Ready！``
zh_tw: 訊息，如「Gamer Over」或「請準備！」

source: A "Start" button to begin the game.
cs: Tlačítko "Start" pro zahájení hry.
de: Eine "Start"-Taste, um das Spiel zu starten.
es: Un botón "Start" para comenzar el juego.
fr: Un bouton "Démarrer" pour commencer le jeu.
it: Un pulsante "Start" per iniziare il gioco.
ja: ゲームを開始する「スタート」ボタン。
ko: 게임을 시작하기 위한 "Start" 버튼.
pl: Przycisk "Start" rozpoczyna grę.
pt_br: Um botão "Iniciar" para começar o jogo.
ru: Кнопка "Start", чтобы начать игру.
uk: Кнопка "Start"("Старт"), щоб розпочати гру.
zh_cn: 一个 ``Start`` 按钮来开始游戏。
zh_tw: 用來開始遊戲的「Start」按鈕。

source: The basic node for UI elements is :ref:`Control <class_Control>`. To create our UI, we'll use two types of :ref:`Control <class_Control>` nodes: :ref:`Label <class_Label>` and :ref:`Button <class_Button>`.
cs: Základní uzel pro prvky uživatelského rozhraní je :ref:`Control <class_Control>`. K vytvoření našeho uživatelského rozhraní použijeme dva typy :ref:`Control <class_Control>` nodes: :ref:`Label <class_Label>` a :ref:`Button <class_Button>`.
de: Der Basis-Node für UI-Elemente ist :ref:`Control <class_Control>`. Um unsere Benutzeroberfläche zu erstellen, verwenden wir zwei Arten vom :ref:`Control <class_Control>` Node: :ref:`Label <class_Label>` und :ref:`Button <class_Button>`.
es: El nodo básico para elementos de UI es :ref:`Control <class_Control>`. Para crear nuestra UI, usaremos dos tipos de nodos :ref:`Control <class_Control>`: :ref:`Label <class_Label>` y :ref:`Button <class_Button>`.
fr: Le nœud de base pour les éléments de l'interface utilisateur est :ref:`Control <class_Control_Control>`. Pour créer notre interface utilisateur, nous utiliserons deux types de nœuds :ref:`Control <class_Control>` : :ref:`Label <class_Label>` et :ref:`Button <class_Button>`.
it: Il nodo di base per gli elementi dell'interfaccia utente è :ref:'Controllo <class_Control>'. Per creare l'interfaccia utente, useremo due tipi di :ref:'Controlla <class_Control>' nodi: :ref:'Label <class_Label>' e :ref:'Button <class_Button>'.
ja: UI要素の基本ノードは\ :ref:`コントロール <class_Control>`\ です。UIを作成するには、\ :ref:`ラベル <class_Label>`\ と\ :ref:`ボタン <class_Button>`\ の2種類の\ :ref:`コントロール <class_Control>`\ ノードを使用します。
ko: UI 요소의 기초가 되는 노드는 :ref:`Control <class_Control>`\ 입니다. UI를 만들기 위해, 우리는 두 가지 타입의 :ref:`Control <class_Control>` 노드: :ref:`Label <class_Label>`\ 과 :ref:`Button <class_Button>`\ 을 사용할 것입니다.
pl: Podstawowym węzłem elementów interfejsu użytkownika jest :ref:`Control <class_Control>`. Aby utworzyć nasz interfejs użytkownika, będziemy używać dwóch typów węzła ref:`Control <class_Control>` - :ref:`Label <class_Label>` oraz :ref:`Button <class_Button>`.
pt_br: O nó básico para elementos de interface é :ref:`Control <class_Control>`. Para criar nossa interface, usaremos dois tipos de nós :ref:`Control <class_Control>`: :ref:`Label <class_Label>` e :ref:`Button <class_Button>`.
ru: Основной узел для элементов UI — это :ref:`Control <class_Control>`. Чтобы создать наш UI, мы будем использовать два типа узлов :ref:`Control <class_Control>`: :ref:`Label <class_Label>` и :ref:`Button <class_Button>`.
uk: Основний вузол для елементів інтерфейсу - :ref:`Control <class_Control>`. Для створення нашого інтерфейсу ми будемо використовувати два типи цього вузла : :ref:`Label <class_Label>` та :ref:`Button <class_Button>`.
zh_cn: UI元素的基本节点是 :ref:`Control <class_Control>`。要创造UI，我们会使用 :ref:`Control <class_Control>` 的两种节点： :ref:`Label <class_Label>` 和 :ref:`Button <class_Button>` 。
zh_tw: UI 元素所使用的基本節點是 :ref:`Control <class_Control>` 。我們需要使用兩種類型的 :ref:`Control <class_Control>` 節點來給這個遊戲建立 UI： :ref:`Label <class_Label>` （標籤）與 :ref:`Button <class_Button>` （按鈕）。

source: Create the following as children of the ``HUD`` node:
cs: Jako podřízené uzlu ``HUD`` vytvořte následující:
de: Erstelle das Folgende als Unterobjekte des ``HUD``-Nodes:
es: Cree los siguientes hijos del nodo ``HUD``:
fr: Créez les éléments suivants en tant qu'enfants du nœud ``HUD`` :
it: Creare quanto segue come elementi figlio del nodo ''HUD'':
ja: ``HUD`` ノードの子として次を作成します:
ko: 다음 노드들을 ``HUD`` 노드의 자식으로 추가하세요:
pl: Utwórz je jako dzieci węzła ``HUD``:
pt_br: Crie os seguintes itens como filhos do nó ``HUD``:
ru: Создайте следующие узлы в качестве потомков узла '' HUD'':
uk: Додайте вузлу ``HUD`` таких нащадків:
zh_cn: 创建以下节点作为 ``HUD`` 的子节点：
zh_tw: 為 ``HUD`` 節點建立下列子節點：

source: :ref:`Label <class_Label>` named ``ScoreLabel``.
cs: :ref:`Label <class_Label>` s názvem ``ScoreLabel``.
de: :ref:`Label <class_Label>` genannt ``ScoreLabel``.
es: :ref:`Label <class_Label>` llamado ``ScoreLabel``.
fr: Un :ref:`Label <class_Label>` nommé ``ScoreLabel``.
it: :ref:`Label <class_Label>` denominato ``ScoreLabel``.
ja: ``ScoreLabel`` という名前の\ :ref:`ラベル <class_Label>`\ 。
ko: ``ScoreLabel``\ 로 이름지은 :ref:`Label <class_Label>`.
pl: :ref:`Label <class_Label>` nazwany ``ScoreLabel``.
pt_br: :ref:`Label <class_Label>` nomeado ``ScoreLabel``.
ru: :ref:`Label <class_Label>` с именем ``ScoreLabel``.
uk: :ref:`Label <class_Label>` названа ``ScoreLabel`` (Мітка рахунку).
zh_cn: :ref:`Label <class_Label>` 命名为 ``ScoreLabel``。
zh_tw: :ref:`Label <class_Label>` ，命名為 ``ScoreLabel`` 。

source: :ref:`Label <class_Label>` named ``Message``.
cs: :ref:`Label <class_Label>` pojmenovaný ``Message``.
de: :ref:`Label <class_Label>` genannt ``Message``.
es: :ref:`Label <class_Label>` llamado ``Message``.
fr: Un :ref:`Label <class_Label>` nommé ``Message``.
it: :ref:`Label <class_Label>` denominato ``Message``.
ja: ``Message`` という名前の\ :ref:`Label <class_Label>`\ 。
ko: ``Message``\ 로 이름지은 :ref:`Label <class_Label>`.
pt_br: :ref:`Label <class_Label>` nomeado ``MessageLabel``.
ru: :ref:`Label <class_Label>` с именем ``Message``.
uk: :ref:`Label <class_Label>` названа ``Message``( повідомлення).
zh_tw: :ref:`Label <class_Label>` ，命名為 ``Message`` 。

source: :ref:`Button <class_Button>` named ``StartButton``.
cs: :ref:`Button <class_Button>` s názvem ``StartButton``.
de: :ref:`Button <class_Button>` genannt ``StartButton``.
es: :ref:`Button <class_Button>` llamado ``StartButton``.
fr: Un :ref:`Button <class_Button>` nommé ``StartButton``.
it: :ref:`Button <class_Button>` denominato ``StartButton``.
ja: ``StartButton`` という名前の\ :ref:`ボタン <class_Button>`\ 。
ko: ``StartButton``\ 으로 이름지은 :ref:`Button <class_Button>`.
pl: Przycisk :ref:`Button <class_Button>` o nazwie ``StartButton``.
pt_br: :ref:`Button <class_Button>` nomeado ``StartButton``.
ru: :ref:`Button <class_Button>` с именем ``StartButton``.
uk: :ref:`Button <class_Button>` названа ``StartButton``(кнопка старту).
zh_cn: :ref:`Button <class_Button>` 命名为 ``StartButton``。
zh_tw: :ref:`Button <class_Button>` ，命名為 ``StartButton`` 。

source: :ref:`Timer <class_Timer>` named ``MessageTimer``.
cs: :ref:`Timer <class_Timer>` s názvem ``MessageTimer``.
de: :ref:`Timer <class_Timer>` genannt ``MessageTimer``.
es: :ref:`Timer <class_Timer>` llamado ``MessageTimer``.
fr: Un :ref:`Timer <class_Timer>` nommé ``MessageTimer``.
it: :ref:`Timer <class_Timer>` denominato ``MessageTimer``.
ja: ``MessageTimer`` という名前の\ :ref:`Timer <class_Timer>`\ 。
ko: ``MessageTimer``\ 로 이름지은 :ref:`Timer <class_Timer>`.
pl: :ref:`Timer <class_Timer>` o nazwie ``MessageTimer``.
pt_br: :ref:`Timer <class_Timer>` nomeado ``MessageTimer``.
ru: :ref:`Timer <class_Timer>` с именем ``MessageTimer``.
uk: :ref:`Timer <class_Timer>` названий ``MessageTimer``(таймер повідомлення).
zh_cn: :ref:`Timer <class_Timer>` 命名为 ``MessageTimer`` 。
zh_tw: :ref:`Timer <class_Timer>` ，命名為 ``MessageTimer`` 。

source: Click on the ``ScoreLabel`` and type a number into the ``Text`` field in the Inspector. The default font for ``Control`` nodes is small and doesn't scale well. There is a font file included in the game assets called "Xolonium-Regular.ttf". To use this font, do the following:
cs: Klikněte na ``ScoreLabel`` a zadejte číslo do pole ``Text`` v Inspektoru. Výchozí písmo pro uzly ``Control`` je malé a neškáluje se dobře. Ve herníchzdrojích je obsažen soubor s názvem „Xolonium-Regular.ttf“. Chcete-li použít toto písmo, proveďte následující:
de: Klicken Sie auf das ``ScoreLabel`` und geben eine Zahl in das ``Text``-Feld im Inspektor ein. Die Standardschriftart für ``Control``-Nodes ist klein und lässt sich nicht gut skalieren. In den Spielassets ist eine Schriftdatei namens "Xolonium-Regular.ttf" enthalten. Um diese Schriftart zu verwenden, gehen Sie für jeden der drei ``Control``-Nodes wie folgt vor:
es: Haz clic en ``ScoreLabel`` y escribe un número en el campo ``Text`` del inspector. La fuente por defecto para los nodos ``Control`` es pequeña y no escala bien. En los recursos del juego se incluye una fuente llamada "Xolonium-Regular.ttf". Para usar esta fuente, haz lo siguiente:
fr: Cliquez sur le ``ScoreLabel`` et dans l'inspecteur, entrez un nombre dans le champ ``Text``. La police par défaut pour les nœuds ``Control`` est petite et ne s'ajuste pas correctement. Il existe un fichier de police inclus dans les ressources du jeu appelé "Xolonium-Regular.ttf". Pour utiliser cette police, procédez comme suit :
it: Fare clic su ``ScoreLabel`` e digitare un numero nel campo ``Testo`` nell'Inspector. Il tipo di font predefinito per i nodi ``Control`` è piccolo e non scala bene. C'è un file di font incluso nelle risorse di gioco chiamato "Xolonium-Regular.ttf". Per utilizzare questo font, eseguire le operazioni seguenti:
ja: ``ScoreLabel`` をクリックし、インスペクタの\ *Text*\ フィールドに数字を入力します。 ``Control`` ノードのデフォルトのフォントは小さく、うまくスケールしません。そこで、ゲームアセットに含まれる 「Xolonium-Regular.ttf」というフォントファイルがあります。 このフォントを使用するには、次のようにしてください:
ko: ``ScoreLabel``\ 을 클릭하고 인스펙터(Inspecter)의 *Text* 필드에 숫자를 입력하세요. ``Control`` 노드의 기본 폰트는 작아서 크기 조정이 잘 되지 않습니다. 게임 에셋에는 "Xolonium-Regular.ttf"라는 폰트 파일이 있습니다. 이 폰트를 사용하려면, 각 ``Control`` 노드마다 다음과 같이 하세요:
pt_br: Clique no ``ScoreLabel`` e digite um número no campo ``Text``no Inspetor. A fonte padrão para os nós ``Control`` é pequena e não escala bem. Há um arquivo de fonte incluído nos assets do jogo chamado "Xolonium-Regular.ttf". Para usar esta fonte, faça o seguinte para cada um dos três nós ``Control``:
ru: Нажмите на ``ScoreLabel`` и введите число в поле ``Text`` в Инспекторе. Стандартный шрифт для узлов ``Control`` мал и плохо масштабируется. В ресурсы игры включен файл шрифта под названием "Xolonium-Regular.ttf". Чтобы использовать этот шрифт, сделайте следующее:
uk: Клацніть на ``ScoreLabel`` і введіть число в поле ``Text`` в Інспекторі. Шрифт за замовчуванням для вузлів ``Control`` невеликий і не дуже масштабується. У ігрових активах є файл шрифту, який називається "Xolonium-Regular.ttf" (даний шрифт підтримує кирилицю). Щоб використовувати цей шрифт, виконайте наступне:
zh_tw: 點擊 ``ScoreLabel`` 並在屬性面板中的 ``Text`` 輸入一個數字。 ``Control`` 節點的預設字體很小，而且也縮放得不是很好。遊戲素材裡有包含了一個字體檔，檔名為「Xolonium-Regular.ttf」。依照下列步驟來使用這個字體：

source: Under "Custom Fonts", choose "New DynamicFont"
cs: V části „Vlastní písma“ vyberte „Nový DynamicFont“
de: Wählen Sie unter "Custom Fonts" "Neues DynamicFont"
es: Dentro de "Custom Fonts", seleccionar "New DynamicFont"
fr: Sous "Polices personnalisées", choisissez "Nouveau DynamicFont"
it: In "Caratteri personalizzati", scegli "Nuovo DynamicFont"
ja: 「カスタムフォント」で 「新しい動的フォント」を選択します
ko: "Custom Fonts" 에서, "새 DynamicFont"를 선택하세요
pl: W zakładce "Czcionki niestandardowe" wybierz opcję "Nowa czcionka dynamiczna"
pt_br: Na propriedade "Custom Fonts" (Fontes Personalizadas), escolha "Novo DynamicFont"
ru: Под "Custom Fonts" выберите "Новый DynamicFont"
uk: У розділі "Custom Fonts" ("Спеціальні шрифти") виберіть "New DynamicFont" ("Новий динамічний шрифт")
zh_cn: 在 ``自定义字体`` 的下拉选项中，选择 ``新建DynamicFont``
zh_tw: 在「Custom Fonts」（自定義字體）中，選擇「New DynamicFont」（新增 DynamicFont 格式的字體）

source: Click on the "DynamicFont" you added, and under "Font/Font Data", choose "Load" and select the "Xolonium-Regular.ttf" file. You must also set the font's ``Size``. A setting of ``64`` works well.
cs: Klikněte na "DynamicFont", který jste přidali, a pod "Font / Font Data", zvolte "Načíst" a vyberte soubor "Xolonium-Regular.ttf". Musíte také nastavit písmo ``Velikost``. Nastavení ``64`` funguje dobře.
de: Klicken Sie auf den von Ihnen hinzugefügten "DynamicFont" und wählen unter "Font/Font Data" "Lade" und wählen Sie die Datei "Xolonium-Regular.ttf". Ändern Sie die Schriftgröße (``Size``) auf ``64``.
es: Haz clic en la "DynamicFont" agregada y, dentro de "Font Data", elige "Load" y selecciona el archivo "Xolonium-Regular.ttf". Deberás también cambiar el ``Size`` (tamaño) de la fuente. Un valor de ``64`` funcionará bien.
fr: Cliquez sur le "DynamicFont" que vous avez ajouté, et sous "Font/Font Data", choisissez "Charger" et sélectionnez le fichier "Xolonium-Regular.ttf". Vous devez également définir ``Size`` la taille de la police de caractères. Un réglage à ``64`` fonctionne bien.
it: Fare clic su "DynamicFont" aggiunto e in "Font/Font Data", scegliere "Carica" e selezionare il file "Xolonium-Regular.ttf". È inoltre necessario impostare il tipo di carattere ''Size'. Un'impostazione di ''64'' funziona bene.
ja: 追加した "DynamicFont" をクリックし、"Font/Font Data" の下で [読み込み] を選択し、"Xolonium-Regular.ttf" ファイルを選択します。 また、フォントの ``Size`` も設定する必要があります。 ``64`` の設定はうまく機能します。
ko: 추가한 "DynamicFont"를 클릭하고, "Font/Font Data" 아래에서, "불러오기(Load)"를 눌러서 "Xolonium-Regular.ttf" 파일을 선택하세요. 또한 폰트의 ``Size``\ 도 설정해야 합니다. ``64`` 정도가 좋습니다.
pt_br: Clique na "DynamicFont" que você adicionou, e em "Font/Font Data" (dados da fonte), escolha "Carregar" e selecione o arquivo "Xolonium-Regular.ttf". Você tem também que definir o tamanho ``Size`` da fonte. Uma configuração de ``64`` funciona bem.
ru: Нажмите на только что добавленный "DynamicFont" и в разделе "Font/Font Data" выберите "Загрузить" и выберите файл "Xolonium-Regular.ttf" . Также вы должны установить размер шрифта ``Size``. Значение ``64`` хорошо подходит.
uk: Клацніть на доданому "DynamicFont", а під "Font/Font Data" («Шрифт / Дані шрифту») виберіть "Завантажити" та виберіть файл "Xolonium-Regular.ttf". Ви також повинні встановити розмір шрифта в полі ``Size``. Добре працює значення ``64``.
zh_cn: 点击您添加的 ``DynamicFont``，然后在 ``Font/Font Data`` 的下拉选项中选择 ``Load`` 并选择 ``Xolonium-Regular.ttf`` 文件。您还必须设置字体的 ``Size`` 。设置为 ``64`` 就可以了。
zh_tw: 點擊新增的「DynamicFont」，並點擊「Font/Font Data」（字體與字體資料）中的「載入」，接著選擇「Xolonium-Regular.ttf」檔案。另外也必須設定字體的 ``Size`` （大小）。可以設定為 ``64``。
