Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/your_first_game.po
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: The Main node will be spawning new mobs, and we want them to appear at a random location on the edge of the screen. Add a :ref:`Path2D <class_Path2D>` node named ``MobPath`` as a child of ``Main``. When you select ``Path2D``, you will see some new buttons at the top of the editor:
cs: Main uzel bude vytvářet nové nepřátele a chceme, aby se objevili na náhodné místě při okraji obrazovky. Přidejte a :ref:`Path2D <class_Path2D>` uzel s názvem ``MobPath`` jako potomka ``Main``. Když vyberete ``Path2D``, uvidíte v horní části editoru některá nová tlačítka:
de: Der Main-Node wird neue Gegner hervorbringen, und wir möchten, dass sie an einer beliebigen Stelle am Rande des Bildschirms erscheinen. Fügen Sie einen :ref:`Path2D <class_Path2D>`Node namens ``MobPath`` als Unterobjekt von ``Main`` hinzu. Wenn Sie ``Path2D`` auswählen, sehen Sie oben im Editor einige neue Schaltflächen:
es: El nodo Main generará los nuevos enemigos, y queremos que aparezcan en una ubicación al azar en el borde de la pantalla. Agregue un nodo :ref:`Path2D <class_Path2D>` llamado ``MobPath`` como hijo de ``Main``. Cuando seleccione ``Path2D``, verá que aparecen nuevos botones en la parte de arriba del editor:
fr: Le nœud principal va générer de nouveaux monstres, et nous voulons qu'ils apparaissent à un endroit aléatoire sur le bord de l'écran. Ajouter un nœud :ref:`Path2D <class_Path2D>` nommé ``MobPath`` comme un enfant de ``Main``. Lorsque vous sélectionnez ``Path2D``, vous verrez de nouveaux boutons en haut de l'éditeur :
it: Il nodo Main genererà nuovi mob, e vogliamo che appaiano in una posizione casuale sul bordo dello schermo. Aggiungi un nodo :ref:`Path2D <class_Path2D>` chiamato ``MobPath`` come figlio di ``Main``. Quando selezioni ``Path2D``, vedrai alcuni nuovi pulsanti nella parte superiore dell'editor:
ja: メインノードは新しいモブを生成し、画面の端のランダムな場所に表示するようにします。 ``Main`` の子として ``MobPath`` という名前の\ :ref:`Path2D <class_Path2D>`\ ノードを追加します。 ``Path2D`` を選択すると、エディタの上部にいくつかの新しいボタンが表示されます:
ko: 메인 노드는 새로운 몹을 스폰할 것이고 우리는 몹이 화면 모서리 아무 위치에서나 나타나도록 만들고 싶습니다. :ref:`Path2D <class_Path2D>` 노드를 ``Main``\ 의 자식으로 추가하고 ``MobPath``\ 라고 이름지으세요. ``Path2D``\ 를 선택하면 편집기 위쪽에 새로운 버튼들이 나타납니다:
pl: Węzeł główny Main będzie się tworzył nowych przeciwników. Chcemy, aby pojawiały się one w przypadkowym miejscu na krawędzi ekranu. Dodaj węzeł :ref:`Path2D <class_Path2D>` o nazwie ``MobPath`` jako dziecko ``Main``. Po wybraniu ``Path2D`` na górze edytora pojawi się kilka nowych przycisków:
pt_br: O nó Principal ficará gerando novos inimigos, e nós queremos que eles apareçam em lugares aleatórios nos cantos da tela. Adicione um nó :ref:`Path2D <class_Path2D>` chamado ``CaminhoTurba`` como filho de ``Principal``. Quando você selecionar ``Path2D``, aparecerão alguns botões novos na parte superior do editor:
ru: Узел Main будет порождать новых мобов, и мы хотим, чтобы они появлялись в случайном месте на краю экрана. Добавьте узел :ref:`Path2D <class_Path2D>` с именем ``MobPath`` как дочерний элемент узла ``Main``. Когда вы выберете ``Path2D``, вы увидите несколько новых кнопок в верхней части редактора:
uk: Головний вузол породжує нових мобів, і ми хочемо, щоб вони з’являлись у випадковому місці на краю екрана. Додайте вузол :ref:`Path2D <class_Path2D>` (Шлях 2D), нащадком ``Main`` і назвіть ``MobPath``. Вибравши ``Path2D``, ви побачите нові кнопки вгорі редактора:
zh_cn: ``Main`` 节点将产生新的生物，我们希望它们出现在屏幕边缘的随机位置。添加一个名为 ``MobPath`` 的 :ref:`Path2D <class_Path2D>` 节点作为 ``Main`` 的子级。当您选择 ``Path2D`` 时，您将在编辑器顶部看到一些新按钮：
zh_tw: Main 節點會產生新的怪物，而我們希望這些怪物出現在畫面邊緣上不同的位置。新增一個 :ref:`Path2D <class_Path2D>` 節點作為 ``Main`` 的子節點，設定名稱為 ``MobPath`` 。之後當選擇 ``Path2D`` 的時候，編輯器上方會出現一些新的按鈕：

source: Select the middle one ("Add Point") and draw the path by clicking to add the points at the corners shown. To have the points snap to the grid, make sure "Use Grid Snap" and "Use Snap" are both selected. These options can be found to the left of the "Lock" button, appearing as a magnet next to some dots and intersecting lines, respectively.
cs: Vyberte prostřední ("Add point") a nakreslete křivku přidáním bodů klepnutím v zobrazených rozích. Chcete-li, aby se body přichytíly k mřížce, ujistěte se, že je vybraná možnost "Use Grid Snap" mřížky. Tuto možnost lze nalézt nalevo od tlačítka "Lock", které se zobrazí jako magnet vedle některých protínajících se čar.
de: Wählen Sie die Mittlere ("Punkt hinzufügen (in leerem Raum)"). Zeichnen Sie den Pfad, indem Sie durch klicken auf die dargestellten Ecken die Punkte hinzuzufügen. Damit die Punkte am Gitter einrasten, stellen Sie sicher, dass "Gitter-Einrasten benutzen(Shift+G)" aktiviert ist. Diese Option findet sich links vom "Schloss"-Symbol und wird als ein "Magnet neben sich schneidender Linien" dargestellt.
es: Selecciona el botón del medio ("Añadir Punto") y dibuja el camino haciendo clic para agregar los puntos en las esquinas como se muestra. Para tener los puntos ajustados a la cuadrícula, asegúrate de tener marcado "Ajustar a cuadrícula". Esta opción se encuentra a la izquierda del botón "Bloquear", que aparece como un imán al lado de las líneas de intersección.
fr: Sélectionnez celui du milieu ("Ajouter un point") et tracez le chemin en cliquant pour ajouter les points aux coins montrés. Pour que les points s'accrochent à la grille, assurez-vous que "Utiliser l’aimantation à la grille" et "Utiliser l’aimantation intelligente" sont sélectionnés. Cette option se trouve à gauche du bouton "Verrouiller", apparaissant comme un aimant à côté de lignes qui se croisent.
it: Seleziona quello centrale ("Add Point") e disegna il percorso cliccando per aggiungere i punti agli angoli mostrati. Per fare in modo che i punti si aggancino alla griglia, assicurati che "Use Grid Snap" e "Use Snap" siano entrambi selezionati. Queste opzioni si trovano a sinistra del pulsante "Blocca", che appare come un magnete accanto ad alcuni punti e linee che si intersecano, rispettivamente.
ja: 中央のアイコン([点を追加])を選択し、表示されているコーナーをクリックしてポイントを追加してパスを描画します。ポイントをグリッドにスナップするには、[グリッドスナップを使う]が選択されていることを確認します。このオプションは、[ロック]ボタンの左側にあり、「交差する線と磁石」のアイコンで表示されています。
ko: 가운데 버튼 "점 추가(Add Point)"을 선택하고 점을 추가하기 위해 표시된 모서리를 클릭해서 경로를 그리세요. 점이 그리드에 스냅(snap)되도록 하려면 "격자 스냅 사용(Use Grid Snap)" 및 "스냅 사용(Use Snap)"이 모두 선택되어 있는지 확인하세요. 이 옵션은 "잠금(Lock)" 버튼 왼쪽에서 찾을 수 있으며, 각각 점과 교차선 옆에 자석이 있는 모양입니다.
uk: Виберіть середню ("Додати точку") та намалюйте шлях, клацнувши, щоб додати точки у вказаних кутах. Щоб точки прикріпилися до сітки (ґратки), переконайтеся, що опції "Використати до ґратки" та "Використати прив'язку", обидві включені. Ці опції можна знайти зліва від кнопки «Блокування», виглядає як магніт з кількома лініями, що перетинаються.
zh_tw: 選擇中間的按鈕 (「新增控制點」)，然後點擊顯示的轉角處來新增控制點並繪製路徑。若要將控制點吸附到網格上，請開啟「使用網格吸附」與「使用吸附」選項，這兩個選項在「鎖定」按鈕的左邊，顯示的圖示是一個磁鐵跟幾條相交的線。

source: Draw the path in *clockwise* order, or your mobs will spawn pointing *outwards* instead of *inwards*!
cs: Nakreslete cestu *ve směru hodinových ručiček*, jinak budou vaši nepřátelé natočení *směrem ven* místo *dovnitř*!
de: Zeichnen Sie den Pfad im *Uhrzeigersinn*, sonst erscheinen Ihre Gegner *nach außen* statt *nach innen*!
es: Dibuja la ruta en *el sentido de las agujas del reloj* ¡o tus enemigos apuntarán *hacia afuera* en lugar de *hacia adentro*!
fr: Tracez le chemin dans le *sens des aiguilles d'une montre*, ou vos monstres pointeront *vers l'extérieur* au lieu de *vers l'intérieur* !
it: Disegnare il percorso in ordine *orario*, o i tuoi nemici verranno generati *verso l'esterno* invece che *verso l'interno*!
ja: *時計回り*\ にパスを描画します。そうしないと、モブは\ *内側*\ ではなく\ *外側*\ を向いて発生します！
ko: *시계 방향* 으로 그리세요, 그렇지 않으면 몹들은 *안쪽* 이 아닌 *바깥쪽* 으로 향할 것입니다!
pl: Narysuj ścieżkę zgodnie z ruchem zegara albo twoje przeciwnicy będą się tworzyli na zewnątrz zamiast do wewnątrz!
pt_br: Desenhe o caminho em sentido *horário*, ou sua turba vai surgir apontando para *fora* em vez de para *dentro*!
ru: Нарисуйте путь в порядке *по часовой стрелке*, иначе ваши мобы будут появляться с направлением *наружу*, а не *внутрь*!
uk: Малюйте доріжку *за годинниковою стрілкою* , інакше ваші моби будуть виникати спрямовані *назовні*, а не *всередину*!
zh_cn: 以 *顺时针* 的顺序绘制路径，否则小怪会 *向外* 而非 *向内* 生成！
zh_tw: 請確定以 **順時針** 方向繪製路徑，不然的話怪物會 **向外** 產生而不是 **向內** 產生！

source: After placing point ``4`` in the image, click the "Close Curve" button and your curve will be complete.
cs: Po umístění bodu ``4`` do obrázku klikněte na tlačítko „Zavřít křivku“ a vaše cesta bude úplná.
de: Nachdem Sie den Punkt ``4`` im Bild platziert haben, klicken Sie auf die Schaltfläche "Kurve schließen" und Ihre Kurve ist vollständig.
es: Después de colocar el punto ``4``, haz clic en el botón "Cerrar Curva" y la curva se completará.
fr: Après avoir placé le point ``4`` dans l'image, cliquez sur le bouton "Fermer la courbe" et votre courbe sera terminée.
it: Dopo aver posizionato il punto ''4'' nell'immagine, fare clic sul pulsante "Chiudi curva" e la curva sarà completa.
ja: 画像にポイント ``4`` を配置した後、「カーブを閉じる」ボタンをクリックすると、カーブが完成します。
ko: 이미지에서 ``4``\ 개의 점을 찍고 난 후, "곡선 닫기(Close Curve)" 버튼을 누르면 곡선이 완성됩니다.
pl: Po umieszczeniu punktu ``4`` na obrazku, kliknij przycisk "Zamknij krzywą", a krzywa zostanie zamknięta.
pt_br: Depois de colocar o ponto ``4`` na imagem, clique no botão "Fechar Curva", e sua curva estará completa.
ru: Поместив точку "4" на изображение, нажмите кнопку "Сомкнуть кривую", и она будет завершена.
uk: Після розміщення четвертої точки на зображенні натисніть кнопку "Закрити криву", і ваша крива буде завершена.
zh_cn: 在图像上放置点 ``4`` 后，点击 ``闭合曲线`` 按钮，您的曲线将完成。
zh_tw: 在圖片內放置了點 ``4`` 以後，點擊「關閉曲線」按鈕，就可以完成繪製曲線。

source: Now that the path is defined, add a :ref:`PathFollow2D <class_PathFollow2D>` node as a child of ``MobPath`` and name it ``MobSpawnLocation``. This node will automatically rotate and follow the path as it moves, so we can use it to select a random position and direction along the path.
cs: Nyní, když je cesta definována, přidejte uzel :ref:`PathFollow2D <class_PathFollow2D>` jako podřízený uzel ``MobPath`` a pojmenujte jej ``MobSpawnLocation``. Tento uzel se bude automaticky otáčet a sledovat cestu, jak se pohybuje, takže ji můžeme použít k výběru náhodné polohy a směru podél cesty.
de: Jetzt, nachdem der Pfad definiert ist, fügen Sie einen :ref:`PathFollow2D <class_PathFollow2D>` Node als Unterobjekt von ``MobPath`` hinzu und nenne ihn ``MobSpawnLocation``. Dieser Node dreht sich automatisch und folgt dem Pfad, während er sich bewegt, so dass wir damit eine beliebige Position und Richtung entlang des Pfades auswählen können.
es: Ahora que el camino está definido, agrega un nodo :ref:`PathFollow2D <class_PathFollow2D>` como hijo de ``MobPath`` y nómbralo ``MobSpawnLocation``. Este nodo rotará automáticamente y seguirá el camino mientras se mueve, así podemos usarlo para seleccionar una posición al azar y una dirección a lo largo del camino.
fr: Maintenant que le chemin est défini, ajoutez un nœud :ref:`PathFollow2D <class_PathFollow2D>` en tant qu'enfant de ``MobPath`` et nommez-le ``MobSpawnLocation``. Ce nœud tournera automatiquement et suivra le chemin au fur et à mesure qu'il se déplace, de sorte que nous pouvons l'utiliser pour sélectionner une position et une direction aléatoires le long du chemin.
it: Ora che il percorso è definito, aggiungere un nodo :ref:'PathFollow2D <class_PathFollow2D>' come figlio di ''MobPath'' e denominarlo ''MobSpawnLocation''. Questo nodo ruoterà automaticamente e seguirà il percorso mentre si muove, quindi possiamo usarlo per selezionare una posizione e una direzione casuali lungo il percorso.
ja: パスが定義されたので、 ``MobPath`` の子として\ :ref:`PathFollow2D <class_PathFollow2D>`\ ノードを追加し、 ``MobSpawnLocation`` という名前を付けます。このノードは自動的に回転し、パスの移動に従うので、パスに沿ってランダムな位置と方向を選択できます。
ko: 이제 경로를 정의하기 위해 :ref:`PathFollow2D <class_PathFollow2D>` 노드를 ``MobPath``\ 의 자식으로 추가한 후 ``MobSpawnLocation``\ 이라고 이름지으세요. 이 노드는 자동으로 회전하고 이동하면서 경로를 따라갈 것입니다, 그러므로 경로를 따라 임의의 위치와 방향을 선택하기 위해 이것을 사용할 수 있습니다.
pl: Teraz, gdy ścieżka jest zdefiniowana, dodaj węzeł :ref:`PathFollow2D <class_PathFollow2D>`jako dziecko ``MobPath`` i nazwij go ``MobSpawnLocation``. Węzeł ten będzie automatycznie obracał się i podążał ścieżką, tak abyśmy mogli go wykorzystać do wybrania losowego położenia i kierunku wzdłuż ścieżki.
pt_br: Agora que o caminho está definido, adicione um nó :ref:`PathFollow2D <class_PathFollow2D>` como filho de ``CaminhoTurba`` e dê o nome de ``LocalGeraçãoTurba``. Esse nó vai rotacionar automaticamente e seguir o caminho conforme ele se move, para que possamos usá-lo para selecionar uma posição e uma direção aleatória ao longo do caminho.
ru: Теперь, когда путь определен, добавьте узел :ref:`PathFollow2D <class_PathFollow2D>` как дочерний элемент ``MobPath`` и назовите его ``MobSpawnLocation``. Этот узел будет автоматически вращаться и следовать по пути при его перемещении, поэтому мы можем использовать его для выбора случайной позиции и направления вдоль пути.
uk: Тепер, коли шлях визначений, додайте вузол :ref:`PathFollow2D <class_PathFollow2D>` (слідувати за шляхом 2D) нащадком ``MobPath`` та назвіть його ``MobSpawnLocation``. Цей вузол автоматично обертатиметься та рухатиметься по шляху, тому ми можемо використовувати його для вибору випадкової позиції та напрямку вздовж шляху.
zh_cn: 现在已经定义了路径，添加一个 :ref:`PathFollow2D <class_PathFollow2D>` 节点作为 ``MobPath`` 的子节点，并将其命名为 ``MobSpawnLocation``。该节点在移动时，将自动旋转并沿着该路径，因此我们可以使用它沿路径来选择随机位置和方向。
zh_tw: 現在路徑已經定義好了，接著我們新增一個 :ref:`PathFollow2D <class_PathFollow2D>` 節點作為 ``MobPath`` 的子節點，並將其命名為 ``MobSpawnLocation`` 。這個節點會在移動的時候自動旋轉並跟著路徑移動，所以我們可以用 MobPath 來在路徑上隨機選擇位置與方向。

source: Your scene should look like this:
cs: Vaše scéna by měla vypadat takto:
de: Die Szene sollte so aussehen:
es: Tu escena debería verse así:
fr: Votre scène devrait ressembler à ceci :
it: La tua scena dovrebbe essere così:
ja: シーンは次のようになります:
ko: 씬 트리는 다음과 같아야 합니다:
pt_br: Sua cena deve se parecer com isso:
ru: Ваша сцена должна выглядеть так:
uk: Ваше сцена має виглядати так:
zh_tw: 現在場景看起來會這樣：

source: Main script
cs: Hlavní skript
de: Main-Skript
es: Script Principal
fr: Script principal
it: Script principale
ja: Mainスクリプト
ko: 메인 스크립트
pt_br: Script principal
ru: Главный скрипт
uk: Головний скрипт
zh_cn: ``Main`` 脚本
zh_tw: Main（主要）腳本

source: Add a script to ``Main``. At the top of the script, we use ``export (PackedScene)`` to allow us to choose the Mob scene we want to instance.
cs: Přidejte do ``Main`` skript. V horní části skriptu používáme ``export (PackedScene)``, abychom nám mohli vybrat scénu Mob, pro kterou chceme vytvořit instanci.
de: Füge ein Skript zu ``Main`` hinzu. Am Anfang des Skripts verwenden wir ``export (PackedScene)``, damit wir die Mob-Szene auswählen können, die wir als Instanz verwenden wollen.
es: Agrega un script a ``Main``. Al principio del script usaremos ``export (PackedScene)`` para permitirnos elegir la escena de enemigos que queremos instanciar.
fr: Ajoutez un script à ``Main``. Au début du script nous utilisons ``export (PackedScene)`` pour nous permettre de choisir la scène du monstre que nous voulons instancier.
it: Aggiungi uno script a `` Main``. Nella parte superiore dello script, utilizziamo `` export (PackedScene) `` per permetterci di scegliere la scena Mob che vogliamo istanziare.
ja: スクリプトを ``Main`` に追加します。 スクリプトの上部で、\ ``export(PackedScene)`` を使用して、インスタンス化するMobシーンを選択できるようにします。
ko: ``Main``\ 에 스크립트를 추가합니다. 스크립트의 위에 ``export (PackedScene)``\ 를 사용해서 우리가 인스턴스화하길 원하는 몹 씬을 고를 수 있도록 만듭니다.
pt_br: Adicione um roteiro a ``Principal``. No começo do script, nós usamos ``export (PackedScene)`` para permitir-nos escolher a cena Inimigo que queremos instanciar.
ru: Добавьте скрипт к узлу ``Main``. В верхней части скрипта мы пишем ``export (PackedScene)``, что позволяет нам выбрать сцену Mob, экземпляр которой мы хотим сделать.
uk: Додайте скрипт до вузла ``Main``. У верхній частині скрипту ми використовуємо ``export (PackedScene)``, щоб ми могли вибрати сцену ``Mob``, екземпляр якої ми хочемо створити.
zh_cn: 将脚本添加到 ``Main``。在脚本的顶部，我们使用 ``export (PackedScene)`` 来允许我们选择要实例化的 ``Mob`` 场景。
zh_tw: 為 ``Main`` 新增一個腳本。在腳本的頂部，我們會用 ``export (PackedScene)`` 來選擇要實體化的 ``Mob`` 場景。

source: Click the ``Main`` node and you will see the ``Mob`` property in the Inspector under "Script Variables".
cs: Klikněte na uzel ``Main`` a uvidíte vlastnost ``Mob`` v Inspektoru pod "Proměnné skriptu".
de: Klicken Sie auf die ``Main`` Node und man wird eine ``Mob`` Eigenschaft im Inspector unter "Script Variables" erkennen.
es: Haz clic en el nodo ``Principal`` y verás la propiedad ``Mob`` en el Inspector bajo "Script Variables".
fr: Cliquez sur le nœud ``Main`` et vous verrez la propriété ``Mob`` dans l'inspecteur sous "Script Variables".
it: Clicca sul nodo ``Main``` e vedrai la proprietà ``Mob`` nell'Inspector sotto "Script Variables".
ja: ``Main`` ノードをクリックすると、インスペクタの「Script Variables(スクリプト変数)」の下に ``Mob`` プロパティがあります。
ko: ``Main`` 노드를 클릭하면 인스펙터(Inspector)의 "Script Variables" 아래에서 ``Mob`` 속성을 볼 수 있습니다.
pt_br: Clique no nó ``Principal``e você verá a propriedade ``Mob`` no inspetor, abaixo das ``Variáveis do Script``.
ru: Выберите узел ``Main`` и вы увидите свойство ``Mob`` в окне Инспектора под "Script Variables".
uk: Виберіть вузол ``Main`` і побачите в Інспекторі під "Script Variables" (Властивості скрипта) властивість ``Mob``.
zh_cn: 单击``Main``节点，就可以在属性检查器（Inspector）的脚本变量区（Script Variables）看到``Mob``属性。
zh_tw: 點擊 ``Main`` 節點，接著可以在屬性面板中的「Script Variables」（腳本變數）中看到 ``Mob`` 屬性。

source: You can assign this property's value in two ways:
cs: Hodnotu této vlastnosti můžete přiřadit dvěma způsoby:
de: Man kann einen Wert für eine Eigenschaft auf zwei Wege hinzufügen:
es: Puedes asignar el valor de esta propiedad de dos maneras:
fr: Vous pouvez affecter la valeur de cette propriété de deux façons :
it: È possibile assegnare il valore di questa proprietà in due modi:
ja: このプロパティの値は、ふたつの方法で指定できます:
ko: 다음 두 가지 방법으로 이 속성의 값을 할당할 수 있습니다:
pt_br: Você pode atribuir o valor dessa propriedade de duas formas:
ru: Значение этого свойства можно присвоить двумя способами:
uk: Ви можете змінити значення цієї властивості двома шляхами:
zh_cn: 有两种方法来给这个属性赋值：
zh_tw: 要為這個屬性賦值有兩個方法：

source: Drag ``Mob.tscn`` from the "FileSystem" panel and drop it in the ``Mob`` property .
cs: Přetáhněte ``Mob.tscn`` z panelu "FileSystem" do vlastnosti ``Mob``.
de: Ziehen Sie ``Mob.tscn`` aus dem Panel "FileSystem" und legen Sie es in der Eigenschaft ``Mob`` unter den Skript-Variablen des Nodes ``Main`` ab.
es: Arrastra ``Mob.tscn``del panel "Sistema de Archivos" y suéltalo en la propiedad ``Mob``.
fr: Faites glisser ``Mob.tscn`` depuis le panneau "Système de fichiers" et déposez-le sur la propriété ``Mob``.
it: Trascinare ''Mob.tscn'' dal pannello "FileSystem" e rilasciarlo nella proprietà ''Mob''.
ja: 「ファイルシステム」パネルから ``Mob.tscn`` をドラッグし、 ``Mob`` プロパティにドロップします。
ko: "파일시스템(FileSystem)" 패널에서 ``Mob.tscn``\ 을 ``Main`` 노드의 스크립트 속성 아래 ``Mob`` 속성에 끌어다 놓으세요.
pt_br: Arraste ``Mob.tscn`` do painel do "Sistema de Arquivos" e solte-o na propriedade ``Mob``.
uk: Перетягнути ``Mob.tscn`` з панелі "Файлова система" у властивість ``Mob``.
zh_tw: 從「檔案系統」面板中拖移 ``Mob.tscn`` 到 ``Mob`` 屬性來。

source: Click the down arrow next to "[empty]" and choose "Load". Select ``Mob.tscn``.
cs: Klikněte na šipku dolů vedle „[prázdné]“ a vyberte „Načíst“. Vyberte `` Mob.tscn``.
de: Klicken Sie auf den Pfeil nach unten neben "[leer]" und wählen "Lade". Klicken Sie anschließend auf ``Mob.tscn``.
es: Haga clic en la flecha hacia abajo junto a "[empty]" y elija "Load". Selecciona ``Mob.tscn``.
fr: Cliquez sur la flèche vers le bas à côté de "[empty]" et choisissez "Load". Sélectionnez ``Mob.tscn``.
it: Cliccare la freccia rivolta verso il basso accanto a "[empty]" e scegliere "Load". Selezionare ``Mob.tscn```.
ja: [空] の隣にある下矢印をクリックして「読み込み」を選び、\ ``Mob.tscn`` を選択します。
ko: "[비었음]([empty])" 옆에 있는 아래쪽 화살표를 클릭하고 "불러오기(Load)"를 선택하세요. ``Mob.tscn``\ 을 선택하세요.
pt_br: Clique na seta para baixo ao lado de "[vazio]" e escolha "Carregar". Selecione ``Mob.tscn``.
ru: Нажмите стрелочку вниз рядом с "[пусто]"("[empty]") и выберите "Загрузить"("Load"). Затем выберите ``Mob.tscn``.
uk: Клацнути стрілочку вниз поряд з "[empty]"(пусто) і вибрати "Load" (Завантажити). Виберіть ``Mob.tscn``.
zh_tw: 點擊「[空]」旁邊的下拉箭頭，並選擇「載入」。接著選擇 ``Mob.tscn`` 。

source: Next, select the ``Player`` node in the Scene dock, and access the Node dock on the sidebar. Make sure to have the Signals tab selected in the Node dock.
cs: Vyberte uzel ``Player`` ve stromové struktuře scény a poté zvolte kartu „Uzel“. Dále se ujistěte, že máte vybranou možnost „Signály“.
de: Wählen Sie den „Player“-Node im Szenenbaum aus und klicken dann auf die "Node"-Registerkarte. Als nächstes stellen Sie sicher, dass "Signale" ausgewählt ist.
es: A continuación selecciona el nodo ``Player`` en el panel de escenas y accede al panel Nodo en la barra lateral. Asegúrate de tener seleccionada la pestaña ``Señales``.
fr: Ensuite, sélectionnez le nœud ``Player`` dans le dock Scène, et accédez au dock Nœud dans la barre latérale. Assurez-vous que l'onglet Signaux est sélectionné dans le dock Nœud.
it: Quindi, seleziona il nodo ``Player`` nel dock Scene e accedi al dock Nodo sulla barra laterale. Assicurati di avere la scheda Segnali selezionata nel dock Nodo.
ja: 次に、シーンドックの ``Player`` ノードを選択し、サイドバーのノードドックにアクセスします。ノードドックでは、シグナルタブが選択されていることを確認してください。
ko: 다음으로 씬(Scene) 독에서 ``Player`` 노드를 선택하고 사이드바에서 노드(Node) 독에 접근하세요. 노드(Node) 독에서 시그널(Signal) 탭을 선택하세요.
pt_br: Em seguida, selecione o nó do ``Player`` no painel Cena, e acesse o nó na barra lateral. Certifique-se de selecionar a aba Sinais no Painel de nós.
uk: Далі виберіть вузол ``Player`` на вкладці Сцена і виберіть вкладку "Вузол". Переконайтесь, що на вкладці "Вузол" вибрано "Сигнали".
zh_tw: 接著，從場景 Dock 中選擇 ``Player`` 節點，然後前往側欄的節點 Dock 中。節選選擇節點 Dock 中的 [訊號] 分頁。
