Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/audio/sync_with_audio.po
Languages: de

source: Sync the gameplay with audio and music
de: Gameplay mit Audio und Musik synchronisieren

source: Introduction
de: Einführung

source: In any application or game, sound and music playback will have a slight delay. For games, this delay is often so small that it is negligible. Sound effects will come out a few milliseconds after any play() function is called. For music this does not matter as in most games it does not interact with the gameplay.
de: In jeder Anwendung oder jedem Spiel verzögert sich die Ton- und Musikwiedergabe geringfügig. Bei Spielen ist diese Verzögerung oft so gering, dass sie vernachlässigbar ist. Soundeffekte werden einige Millisekunden nach dem Aufrufen einer play() Funktion ausgegeben. Für Musik spielt dies keine Rolle, da sie in den meisten Spielen nicht mit dem Gameplay interagiert.

source: Still, for some games (mainly, rhythm games), it may be required to synchronize player actions with something happening in a song (usually in sync with the BPM). For this, having more precise timing information for an exact playback position is useful.
de: Bei einigen Spielen (hauptsächlich Rhythmus-Spielen) kann es jedoch erforderlich sein, Spieleraktionen mit etwas zu synchronisieren, das in einem Song passiert (normalerweise synchron mit dem BPM). Zu diesem Zweck ist es nützlich, genauere Timing-Informationen für eine genaue Wiedergabeposition zu haben.

source: Achieving very low playback timing precision is difficult. This is because many factors are at play during audio playback:
de: Es ist schwierig, eine sehr geringe Zeitgenauigkeit der Wiedergabe zu erreichen. Dies liegt daran, dass während der Audiowiedergabe viele Faktoren eine Rolle spielen:

source: Audio is mixed in chunks (not continuously), depending on the size of audio buffers used (check latency in project settings).
de: Audio wird in Blöcken gemischt (nicht kontinuierlich), abhängig von der Größe der verwendeten Audiopuffer (überprüfen Sie die Latenz in den Projekteinstellungen).

source: Mixed chunks of audio are not played immediately.
de: Gemischte Audiostücke werden nicht sofort abgespielt.

source: Graphics APIs display two or three frames late.
de: Grafik-APIs zeigen zwei oder drei Frames zu spät an.

source: When playing on TVs, some delay may be added due to image processing.
de: Bei der Wiedergabe auf Fernsehgeräten kann es aufgrund der Bildverarbeitung zu Verzögerungen kommen.

source: The most common way to reduce latency is to shrink the audio buffers (again, by editing the latency setting in the project settings). The problem is that when latency is too small, sound mixing will require considerably more CPU. This increases the risk of skipping (a crack in sound because a mix callback was lost).
de: Die häufigste Methode zum Reduzieren der Latenz besteht darin, die Audiopuffer zu verkleinern (wiederum durch Bearbeiten der Latenzzeiteinstellung in den Projekteinstellungen). Das Problem ist, dass bei zu geringer Latenz für das Mischen von Sounds erheblich mehr CPU erforderlich ist. Dies erhöht das Risiko des Überspringens (ein Riss im Sound, weil ein Mix-Rückruf verloren gegangen ist).

source: This is a common tradeoff, so Godot ships with sensible defaults that should not need to be altered.
de: Dies ist ein häufiger Kompromiss, daher wird Godot mit vernünftigen Standardeinstellungen geliefert, die nicht geändert werden müssen.

source: The problem, in the end, is not this slight delay but synchronizing graphics and audio for games that require it. Beginning with Godot 3.2, some helpers were added to obtain more precise playback timing.
de: Das Problem ist letztendlich nicht diese leichte Verzögerung, sondern die Synchronisierung von Grafik und Audio für Spiele, die dies erfordern. Beginnend mit Godot 3.2 wurden einige Hilfen hinzugefügt, um ein genaueres Wiedergabe-Timing zu erhalten.

source: Using the system clock to sync
de: Nutze die Systemzeit zum synchronisieren

source: This delay can't be avoided but it can be estimated by calling :ref:`AudioServer.get_time_to_next_mix()<class_AudioServer_method_get_time_to_next_mix>`.
de: Diese Verzögerung kann nicht vermieden werden, kann jedoch durch Aufrufen von :ref:`AudioServer.get_time_to_next_mix()<class_AudioServer_method_get_time_to_next_mix>` geschätzt werden.

source: Add these two and it's possible to guess almost exactly when sound or music will begin playing in the speakers during *_process()*:
de: Wenn Sie diese beiden hinzufügen, können Sie fast genau erraten, wann während *_process()* Ton oder Musik in den Lautsprechern abgespielt werden:

source: In the long run, though, as the sound hardware clock is never exactly in sync with the system clock, the timing information will slowly drift away.
de: Auf lange Sicht werden die Timing-Informationen jedoch langsam verschwinden, da die Sound-Hardware-Uhr nie genau mit der Systemuhr synchronisiert ist.

source: For a rhythm game where a song begins and ends after a few minutes, this approach is fine (and it's the recommended approach). For a game where playback can last a much longer time, the game will eventually go out of sync and a different approach is needed.
de: Für ein Rhythmus-Spiel, bei dem ein Song nach einigen Minuten beginnt und endet, ist dieser Ansatz in Ordnung (und auch empfohlen). Für ein Spiel, bei dem die Wiedergabe viel länger dauern kann, ist das Spiel möglicherweise nicht mehr synchron und es ist ein anderer Ansatz erforderlich.

source: Using the sound hardware clock to sync
de: Verwenden der Sound-Hardware-Uhr zum Synchronisieren

source: Using :ref:`AudioStreamPlayer.get_playback_position()<class_AudioStreamPlayer_method_get_playback_position>` to obtain the current position for the song sounds ideal, but it's not that useful as-is. This value will increment in chunks (every time the audio callback mixed a block of sound), so many calls can return the same value. Added to this, the value will be out of sync with the speakers too because of the previously mentioned reasons.
de: Verwende :ref:`AudioStreamPlayer.get_playback_position() <class_AudioStreamPlayer_method_get_playback_position>` um die aktuelle Position des Songs zu erhalten, bei der das Lied ideal klingt. Dies ist aber nicht so nützlich wie es sich anhört. Dieser Wert wird in Blöcken erhöht (jedes Mal, wenn der Audio-Rückruf einen Tonblock mischt), sodass viele Aufrufe denselben Wert zurückgeben können. Hinzu kommt, dass der Wert aus den zuvor genannten Gründen auch nicht mit den Lautsprechern synchron ist.

source: Adding the return value from this function to *get_playback_position()* increases precision:
de: Das Hinzufügen des Rückgabewerts dieser Funktion zu *get_playback_position()* erhöht die Genauigkeit:

source: To increase precision, subtract the latency information (how much it takes for the audio to be heard after it was mixed):
de: Um die Genauigkeit zu erhöhen, subtrahieren Sie die Latenzinformationen (wie viel Zeit benötigt wird, um das Audio nach dem Mischen zu hören):

source: The result may be a bit jittery due how multiple threads work. Just check that the value is not less than in the previous frame (discard it if so). This is also a less precise approach than the one before, but it will work for songs of any length, or synchronizing anything (sound effects, as an example) to music.
de: Das Ergebnis kann aufgrund der Funktionsweise mehrerer Threads etwas verzerrt sein. Überprüfen Sie einfach, ob der Wert nicht kleiner als im vorherigen Frame ist (verwerfen Sie ihn gegebenenfalls). Dies ist auch ein weniger präziser Ansatz als der vorherige, funktioniert jedoch für Songs beliebiger Länge oder zum Synchronisieren von Elementen (z.B. Soundeffekte) mit Musik.

source: Here is the same code as before using this approach:
de: Hier ist derselbe Code wie vor diesem Ansatz:
