Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/project_setup/project_organization.po
Languages: pt_br, ru

source: Project organization
pt_br: Organização do projeto
ru: Организация проекта

source: Introduction
pt_br: Introdução
ru: Введение

source: Since Godot has no restrictions on project structure or filesystem usage, organizing files when learning the engine can seem challenging. This tutorial suggests a workflow which should be a good starting point. We will also cover using version control with Godot.
ru: Поскольку Godot не имеет ограничений по структуре проекта или использованию файловой системы, организация файлов при изучении движка может показаться сложной задачей. Этот учебник предлагает рабочий процесс, который должен быть хорошей отправной точкой. Мы также рассмотрим использование контроля версий с Godot.

source: Organization
pt_br: Organização
ru: Организация

source: Godot is scene-based in nature, and uses the filesystem as-is, without metadata or an asset database.
ru: Godot по своей природе основан на сценах и использует файловую систему как есть, без метаданных или базы данных ресурсов.

source: Unlike other engines, many resources are contained within the scene itself, so the amount of files in the filesystem is considerably lower.
ru: В отличие от других движков, многие ресурсы содержатся внутри самой сцены, поэтому количество файлов в файловой системе значительно ниже.

source: Considering that, the most common approach is to group assets as close to scenes as possible; when a project grows, it makes it more maintainable.
ru: Учитывая это, наиболее распространенным подходом является группирование ресурсов как можно ближе к сценам; когда проект будет расти, это делает его обслуживание легче.

source: As an example, one can usually place into a single folder their basic assets, such as sprite images, 3D model meshes, materials, and music, etc. They can then use a separate folder to store built levels that use them.
ru: Например, обычно можно поместить в одну папку основные ресурсы, такие как изображения спрайтов, сетки 3D-моделей, материалы и музыку и т.д. Затем можно использовать отдельную папку для хранения созданных уровней, которые их используют.

source: Importing
pt_br: Importando
ru: Импорт

source: Godot versions prior to 3.0 did the import process from files outside the project. While this can be useful in large projects, it resulted in an organization hassle for most developers.
ru: Версии Godot до 3.0 импортировали файлы вне проекта. Хотя это может быть полезно в больших проектах, это привело к хлопотам в организации для большинства разработчиков.

source: Because of this, assets are now transparently imported from within the project folder.
ru: Благодаря этому ресурсы теперь прозрачно импортируются из папки проекта.

source: To prevent Godot from importing files contained in a specific folder, create an empty file called ``.gdignore`` in the folder (the leading ``.`` is required). This can be useful to speed up the initial project importing.
ru: Чтобы запретить Godot импортировать файлы, содержащиеся в определенной папке, создайте в этой папке пустой файл с именем ``.gdignore`` (необходим ведущий ``.``). Это может оказаться полезным для ускорения первоначального импорта проекта.

source: To create a file whose name starts with a dot on Windows, you can use a text editor such as Notepad++ or use the following command in a command prompt: ``type nul > .gdignore``
ru: Чтобы создать файл, имя которого начинается с точки в Windows, вы можете использовать текстовый редактор, например Notepad ++, или использовать следующую команду в командной строке: ``type nul> .gdignore``

source: Once the folder is ignored, resources in that folder can't be loaded anymore using the ``load()`` and ``preload()`` methods.
ru: Как только папка игнорируется, ресурсы в этой папке больше не могут быть загружены с использованием методов ``load ()`` и ``preload ()``.

source: Ignoring a folder will also automatically hide it from the FileSystem dock, which can be useful to reduce clutter.
ru: Игнорирование папки также автоматически скрывает ее от меню FileSystem, что может быть полезно для уменьшения беспорядка.

source: This tutorial is aimed to propose a simple workflow on how to organize projects. Since Godot allows the programmer to use the file-system as they please, figuring out a way to organize the projects when starting to use the engine can be a little challenging. Because of this, a simple workflow will be described, which can be used or not, but should work as a starting point.
pt_br: Esse tutorial foi escrito para propor um simples fluxo de trabalho em como organizar projetos. Uma vez que o Godot permite ao programador usar o sistema de arquivos como quiserem, encontrar um modo de organizar os projetos ao começar a usar a engine pode ser um pouco desafiador. Por causa disso, um simples fluxo de trabalho será descrito, que pode ser usado ou não, mas pode funcionar como um ponto inicial.

source: Additionally, using version control can be challenging so this proposition will include that too.
pt_br: Adicionalmente, usar controle de versão pode ser desafiador, então essa proposta incluirá isso também.

source: Godot is scene based in nature, and uses the filesystem as-is, without metadata or an asset database.
pt_br: Godot é baseado em cenas por natureza, e usa o sistema de arquivos como ele é, sem metadata ou um bando de dados de recursos.

source: Unlike other engines, a lot of resource are contained within the scene itself, so the amount of files in the filesystem is considerably lower.
pt_br: Ao contrário de outras engines, muitos recursos estão contidos dentro da própria cena, então a quantidade de arquivos no sistema de arquivos é consideravelmente mais baixa.

source: Considering that, the most common approach is to group assets close to scenes as, when a project grows, it makes it more maintainable.
pt_br: Considerando isso, o modo mais comum de lidar com isso é agrupar recursos com as cenas, assim, quando um projeto cresce, ele fica mais gerenciável.

source: As example, base sprite images, 3D model scenes or meshes, materials, etc. can usually be organized in a place, while a separate folder is used to store built levels that use them.
pt_br: Como exemplo, imagens, cenas de modelos 3D ou meshes, materiais, etc. podem geralmente ser organizados em um lugar, enquanto uma pasta separada é usada para salvar levels construídos que os usam.

source: Because of this, assets are now imported from within the project folder transparently.
pt_br: Por causa disso, os ativos agora são importados de dentro da pasta do projeto de forma transparente.
