Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/project_setup/version_control_systems.po
Languages: es, fr, ru, zh_tw

source: Version Control Systems
es: Sistemas de Control de Versiones
fr: Systèmes de contrôle de version
ru: Система Контроля Версий
zh_tw: 版本控制系統

source: Introduction
es: Introducción
ru: Введение
zh_tw: 簡介

source: Godot aims to be VCS friendly and generate mostly readable and mergeable files. Godot also supports the use of version control systems in the editor itself. However, VCS in the editor requires a plugin for the specific VCS you are using. VCS can be setup or shut down in the editor under **Project > Version Control**.
es: Godot trata de ser amigable a los VCS (siglas en inglés de sistema de control de versiones) y en general crea archivos legibles y combinables. Godot además soporta el uso de sistemas de control de versiones desde el editor mismo, sin embargo, VCS en el editor requiere de un plugin específico para el VCS que se está usando. El VCS puede ser configurado o detenido en el editor, dentro de **Project > Version Control**.
fr: Godot vise à être compatible avec les VCS et à générer des fichiers principalement lisibles et fusionnables. Godot prend également en charge l'utilisation de systèmes de contrôle de version dans l'éditeur lui-même. Cependant, utiliser un VCS dans l'éditeur nécessite un plugin pour le VCS spécifique que vous utilisez. Un VCS peut être configuré ou arrêté dans l'éditeur sous **Projet> Contrôle de version**.
ru: Godot стремиться быть совместимым с VCS и генерировать удобночитаемые и легко сливаемые файлы. Godot также поддерживает использование систем контроля версий прямо из редактора. Но, поддержка конкретного VCS, который вы используете, требует конкретного плагина. VCS может быть задан или убран в редакторе в **Проект > Управление Версиями**.
zh_tw: Godot 旨在對 VCS 友善並儘量產生高可讀性與可合併的檔案。Godot 也支援在編輯器中使用版本控制系統。但在編輯器中使用版本控制系統需要安裝對應的外掛。可於 **[專案] > [版本控制]** 中設定或關閉版本控制系統。

source: Official Git plugin
es: Plugin Git oficial
fr: Plugin Git officiel
ru: Официальный плагин для Git
zh_tw: 官方 Git 外掛

source: Using Git from inside the editor is supported with an official plugin. You can find the latest releases `here <https://github.com/godotengine/godot-git-plugin/releases>`__ (it is not available in the asset library). Documentation on how to use the Git plugin can be found `here <https://github.com/godotengine/godot-git-plugin/wiki>`__.
es: El uso de Git desde el editor está soportado con un plugin oficial. Puedes encontrar las versiones más recientes `aquí <https://github.com/godotengine/godot-git-plugin/releases>`__ (no está disponible en la assets library). La documentación sobre cómo usar el plugin Git está `aquí <https://github.com/godotengine/godot-git-plugin/wiki>`__.
fr: L'utilisation de Git depuis l'intérieur de l'éditeur est prise en charge avec un plugin officiel. Vous pouvez trouver les dernières versions `ici <https://github.com/godotengine/godot-git-plugin/releases>`__ (elles ne sont pas disponibles dans la bibliothèque de ressources). Une documentation sur l'utilisation du plugin Git peut être trouvée `ici <https://github.com/godotengine/godot-git-plugin/wiki>`__.
ru: Использование Git внутри редактора поддерживается официальным плагином. Вы можете найти последние релизы `здесь <https://github.com/godotengine/godot-git-plugin/releases>`__ (он недоступен в библиотеке активов). Документацию по использованию плагина Git можно найти `здесь <https://github.com/godotengine/godot-git-plugin/wiki>`__.
zh_tw: 可以使用官方外掛來在編輯器中使用 Git。可於 `此處 <https://github.com/godotengine/godot-git-plugin/releases>`__ 取得最新版本 (該外掛不在素材庫中)。關於如何使用 Git 外掛的說明文件可參考 `此處 (英文) <https://github.com/godotengine/godot-git-plugin/wiki>`__ 。

source: Files to exclude from VCS
es: Archivos a excluir del VCS
fr: Fichiers à exclure du VCS
ru: Файлы, исключаемые из VCS
zh_tw: 在版本控制系統中忽略的檔案

source: There are some folders Godot creates you should have your VCS ignore:
es: Existe algunas carpetas creadas por Godot que tienes que hacer que el VCS ignore:
fr: Il y a quelques dossiers que Godot crée, que votre VCS devrait ignorer :
ru: Есть некоторые папки, созданные Godot, которые вы должны игнорировать своими VCS:
zh_tw: 有一些 Godot 建立的資料夾應該於版本控制系統中忽略：

source: ``.import/``: This folder stores all the files it imports automatically based on your source assets and their import flags.
es: ``.import/``: Esta carpeta contiene todos los archivos que importa automaticament basados en tus assets de origen y sus configuraciones de importación.
fr: ``.import/`` : ce dossier stocke tous les fichiers qu'il importe automatiquement en fonction de vos ressources source et de leurs drapeaux d'importation.
ru: ``.import/``: в этой папке хранятся все файлы, которые он импортирует автоматически на основе ваших исходных ресурсов и их флагов импорта.
zh_tw: ``.import/`` ：依據原始素材與其旗標，自動保存所有匯入的檔案。

source: ``*.translation``: These files are binary imported translations generated from CSV files.
es: ``*.translation``: Esos son archivos binarios de traducciones importadas generadas desde archivos CSV.
fr: ``*.translation`` : Ces fichiers sont des traductions importées binaires générées à partir de fichiers CSV.
ru: ``*.translation``: эти файлы представляют собой двоичные импортированные переводы, сгенерированные из CSV-файлов.
zh_tw: ``*.translation`` ：依據 CSV 檔產生，二進位匯入的翻譯。

source: ``export_presets.cfg``: This file contains all the export presets for the project, including sensitive information such as Android keystore credentials.
es: ``export_presets.cfg``: Este archivo contiene todas las configuraciones de exportación del proyecto, incluyendo información sensible como las credenciales de Android keystore.
fr: ``export_presets.cfg`` : ce fichier contient tous les préréglages d'exportation pour le projet, y compris des informations sensibles telles que les informations d'identification keystore Android.
ru: ``export_presets.cfg``: этот файл содержит все предустановки экспорта для проекта, включая конфиденциальную информацию, такую как учетные данные хранилища ключей Android.
zh_tw: ``export_presets.cfg`` ：內有專案的所有匯出預設設定，包含機敏資訊如 Android 金鑰儲存區認證。

source: ``.mono/``: This folder stores automatically-generated Mono files. It only exists in projects that use the Mono version of Godot.
es: ``.mono/``: Esta carpeta guarda archivos Mono generados automáticamente. Sólo existe en la versión Mono de Godot.
fr: ``.mono/`` : Ce dossier contient les fichiers Mono générés automatiquement. Il n'existe que dans les projets utilisant la version Mono de Godot.
ru: ``.mono/``: в этой папке хранятся автоматически сгенерированные Mono-файлы. Он существует только в проектах, использующих Mono-версию Godot.
zh_tw: ``.mono/`` ：儲存自動產生的 Mono 檔案。只在專案使用 Mono 版本的 Godot 時會有此資料夾。

source: Working with Git on Windows
fr: Travailler avec Git sous Windows
ru: Работает с Git на Windows
zh_tw: 在 Windows 上使用 Git

source: Most Git for Windows clients are configured with the ``core.autocrlf`` set to ``true``. This can lead to files unnecessarily being marked as modified by Git due to their line endings being converted automatically. It is better to set this option as::
fr: La plupart des clients Git pour Windows sont configurés avec le ``core.autocrlf`` réglé sur ``true``. Cela peut conduire à ce que des fichiers soient inutilement marqués comme modifiés par Git, car leurs fins de ligne sont converties automatiquement. Il est préférable de définir cette option comme suit :
ru: Настройка большинства Git-приложений не обходится без параметра ``core.autocrlf`` со значением ``true``. Это может привести к излишней статусной маркировке — modified, из-за автоматического преобразования окончания строк. Лучше всего изменить это значение на::
zh_tw: Windows 上大多數的 Git 用戶端都會將 ``core.autocrlf`` 設為 ``true`` 。這個設定會使檔案被 Git 標記為已修改，因為這些檔案的行結尾會自動被轉換。最好更改這個選項：
