Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/development/cpp/configuring_an_ide.po
Languages: fr, ja, ru

source: Open the scheme editor again
fr: Ouvrez de nouveau l'éditeur de schéma
ja: スキームエディタを再度開きます
ru: Откройте редактор схем снова

source: Click Run
fr: Cliquez sur Run
ja: 実行をクリック
ru: Кликните Run

source: Set the *Executable* to the file you linked in your post build action script
fr: Définissez l'*Executable* au fichier que vous avez lié dans votre script d'action post-construction
ja: *Executable*\ を、ビルド後のアクションスクリプトでリンクしたファイルに設定します
ru: Установите *Executable* на файл который вы присоединили к вашему скрипту сборки

source: Check *Debug executable* if it isn't already
fr: Cochez *Debug executable* s'il ne l'est pas déjà
ja: まだ実行されていない場合は、\ *デバッグ実行可能ファイル*\ をチェックします
ru: Проверьте *Debug executable* если он уже не установлен

source: You can go to *Arguments* tab and add an -e and a -path to a project to debug the editor not the project selection screen
fr: Vous pouvez aller dans l'onglet *Arguments* et ajouter un -e et un -path à un projet pour déboguer l'éditeur mais pas l'écran de sélection de projet
ja: *引数*\ タブに移動し、プロジェクトに -e と -path を追加して、プロジェクト選択画面ではなくエディタをデバッグできます
ru: Вы можете перейти во вкладку *Arguments* и добавить -e и -path для проекта чтобы отлаживать редактор, а не экран выбора проекта

source: Test it:
fr: Essaye-le :
ja: それをテストします:
ru: Протестируйте это:

source: Set a breakpoint in platform/osx/godot_main_osx.mm
fr: Définissez un point d'arrêt dans platform/osx/godot_main_osx.mm
ja: プラットフォーム /osx/godot_main_osx.mm でブレークポイントを設定する
ru: Установите точку отладки в platform/osx/godot_main_osx.mm

source: It should break at the point!
fr: Il devrait s'interrompre au point !
ja: そのポイントでブレークするはずです!
ru: Он должен останавливаться на этой точке!

source: Setup
fr: Configuration

source: Debugging
fr: Débogage

source: Ensure that C/C++ extension is installed. You can find instructions in `docs <https://code.visualstudio.com/docs/languages/cpp>`_.
fr: Assurez-vous que l'extension C/C++ est installée. Vous pouvez trouver les instructions dans `docs <https://code.visualstudio.com/docs/languages/cpp>`_.
ja: C/C++拡張機能がインストールされていることを確認してください。手順は `docs <https://code.visualstudio.com/docs/languages/cpp>`_ にあります。
ru: Убедитесь что расширение C/C++ установлено. Вы можете найти инструкции в `документации <https://code.visualstudio.com/docs/languages/cpp>`_.

source: Open cloned godot folder in VS Code with ``File > Open Folder...``
fr: Ouvrez un dossier godot cloné dans VS Code avec ``File > Open Folder...``

source: In order to build the project, you need two configuration files: *launch.json* and *tasks.json*. To create them:
fr: Pour construire le projet, vous avez besoin de deux fichiers de configuration : *launch.json* et *tasks.json*. Pour les créer :

source: Open *Debug* view by pressing :kbd:`Ctrl + Shift + D` and select cogwheel with an orange dot:
fr: Ouvrez la vue *Debug* en appuyant sur :kbd:`Ctrl + Shift + D` et sélectionnez la roue dentée avec un point orange :

source: Select *C++ (GDB/LLDB)* (it might be named differently on macOS or Windows)
fr: Sélectionnez *C++ (GDB/LLDB)* (il peut être nommé différemment sous MacOS ou Windows)
ja: *C++ (GDB/LLDB)* を選択します(macOSまたはWindowsでは異なる名前が付けられる場合があります)

source: Update *launch.json* to match:
fr: Mettez à jour *launch.json* pour qu'il corresponde :
ja: 一致するように *launch.json* を更新します:
ru: Обновите *launch.json* для соответствия:

source: (Note that *godot.x11.tools.64* in "program" value might be named differently on macOS or Windows)
fr: (Notez que *godot.x11.tools.64* dans la valeur "program" peut être nommé différemment sous MacOS ou Windows)
ja: ("program"値の *godot.x11.tools.64* の名前は、macOSまたはWindowsでは異なる場合があることに注意してください)

source: Create *tasks.json* by starting the Debug process with :kbd:`F5`. VS Code will show a dialog with a *Configure Task* button. Tap it and select *Create tasks.json file from template*, then select *Others*
fr: Créez *tasks.json* en démarrant le processus de débogage avec :kbd:`F5`. VS Code affichera un dialogue avec un bouton *Configure Task*. Pressez le bouton et sélectionnez *Create tasks.json file from template*, puis sélectionnez *Others*

source: Update *tasks.json* to match:
fr: Mettez à jour *tasks.json* pour qu'il corresponde :
ja: 一致するように *tasks.json* を更新します:
ru: Обновите *tasks.json* до соответствия:

source: (Note that *platform=x11* will be different for macOX and Windows)
fr: (Notez que *platform=x11* sera différent pour macOX et Windows)
ja: (*platform = x11* はmacOXとWindowsでは異なります)
ru: (Заметьте что *platform=x11* может слегка отличаться для macOX и Windows)

source: You can now start the Debug process again to test that everything works.
fr: Vous pouvez maintenant relancer le processus de débogage pour vérifier que tout fonctionne.
ja: デバッグプロセスを再度開始して、すべてが機能することをテストできます。

source: If the build phase fails, check the console for hints. On Linux it's most likely that some dependencies are missing. Check :ref:`Compiling for X11 (Linux, \*BSD) <doc_compiling_for_x11>`
fr: En cas d'échec de la phase de construction, consultez la console pour obtenir des conseils. Sous Linux, il est très probable que certaines dépendances manquent. Consultez :ref:`Compiler pour X11 (Linux, \*BSD) <doc_compiling_for_x11>`
ja: ビルドフェーズが失敗した場合は、コンソールでヒントを確認してください。 Linuxでは、いくつかの依存関係が欠落している可能性が最も高いです。要確認 :ref:`X11用のコンパイル (Linux、\ * BSD) <doc_compiling_for_x11>`

source: `Android Studio <https://developer.android.com/studio>`_ is a `JetBrains <https://www.jetbrains.com/>`_ IDE for Android development. It has a feature-rich editor which supports Java and C/C++, so it can be used for development of the Godot core engine, and Android platform codebases.
fr: `Android Studio <https://developer.android.com/studio>`_ est un `JetBrains <https://www.jetbrains.com/>`_ IDE pour le développement d'Android. Il dispose d'un éditeur riche en fonctionnalités qui supporte Java et C/C++, et peut donc être utilisé pour le développement du cœur du moteur Godot et des bases de code de la plate-forme Android.

source: From the Android Studio *Welcome to Android Studio* window, select *Open an existing Android Studio project*
fr: Dans la fenêtre *Welcome to Android Studio*, sélectionnez *Open an existing Android Studio project*
ja: Android Studio *Welcome to Android Studio* ウィンドウから、\ *Open an existing Android Studio project* を選択します

source: Navigate to ``<godot root directory>/platform/android/java`` and select the ``settings.gradle`` gradle file.
fr: Naviguez jusqu'au ``<godot root directory>/platform/android/java`` et sélectionnez le fichier gradle ``settings.gradle``.
ja: ``<godot root directory>/platform/android/java`` に移動し、\ ``settings.gradle`` gradleファイルを選択します。

source: Android Studio will import and index the project.
fr: Android Studio va importer et indexer le projet.
ja: Android Studioはプロジェクトをインポートしてインデックスを作成します。

source: To build the project, follow the :ref:`compiling instructions <toc-devel-compiling>`.
fr: Pour construire le projet, suivez les instructions de la section :ref:`compilation <toc-devel-compilation>`.
ja: プロジェクトをビルドするには、\ :ref:`コンパイル手順<toc-devel-compiling>` に従ってください。

source: `CLion <https://www.jetbrains.com/clion/>`_ is a commercial IDE for C++. It requires a ``CMakeLists.txt`` file as a project file, which is problematic for Godot which uses the SCons buildsystem and not CMake. However, there is a ``CMakeLists.txt`` configuration for :ref:`Android Studio <doc_configuring_an_ide_android_studio>` which can also be used by CLion.
fr: `CLion <https://www.jetbrains.com/clion/>`_ est un IDE commercial pour C++. Il nécessite un fichier ``CMakeLists.txt`` comme fichier projet, ce qui est problématique pour Godot qui utilise le système de construction SCons et non CMake. Cependant, il existe une configuration ``CMakeLists.txt`` pour :ref:`Android Studio <doc_configuring_an_ide_android_studio>` qui peut également être utilisée par CLion.
ja: `CLion <https://www.jetbrains.com/clion/>`_ はC++用の商用IDEです。プロジェクトファイルとして ``CMakeLists.txt`` ファイルが必要です。これは、CMakeではなくSConsビルドシステムを使用するGodotにとって問題です。ただし、CLionでも使用できる :ref:`Android Studio <doc_configuring_an_ide_android_studio>` の ``CMakeLists.txt`` 設定があります。

source: Choose *File* -> *Open*.
fr: Choisissez *Fichier* -> *Ouvrir*.
ja: *File* → *Open* を選択します。

source: Navigation to your Godot Git clone, and select the folder ``platform/android/java/lib`` (the ``CMakeLists.txt`` file is located there). Select the folder, not the ``CMakeLists.txt file``. Then click *Ok*.
fr: Naviguez vers votre clone Git de Godot, et sélectionnez le dossier ``platform/android/java/lib`` (le fichier ``CMakeLists.txt`` s'y trouve). Sélectionnez le dossier, et non le fichier ``CMakeLists.txt file``. Cliquez ensuite sur *Ok*.
ja: Godot Gitクローンに移動し、\ ``platform/android/java/lib`` フォルダを選択します(``CMakeLists.txt`` ファイルはそこにあります)。\ ``CMakeLists.txtファイル`` ではなく、フォルダを選択します。次に、\ *OK* をクリックします。

source: If this popup window appears, select *This window* to open the project.
fr: Si cette fenêtre popup apparaît, sélectionnez *Cette fenêtre* pour ouvrir le projet.
ja: このポップアップウィンドウが表示されたら、\ *This window* を選択してプロジェクトを開きます。

source: Choose *Tools* -> *CMake* -> *Change Project Root* and select the root Godot folder.
fr: Choisissez *Tools* -> *CMake* -> *Change Project Root* et sélectionnez le dossier racine de Godot.
ja: *Tools* → *CMake* → *Change Project Root* を選択し、ルートGodotフォルダを選択します。

source: You should be now be able to see all the project files. Autocomplete should work, when the project finish indexing.
fr: Vous devriez maintenant être en mesure de voir tous les fichiers de projets. L'auto-complétion devrait fonctionner, lorsque le projet aura terminé l'indexation.
ja: これで、すべてのプロジェクトファイルを表示できるはずです。プロジェクトのインデックス作成が完了すると、オートコンプリートが機能するはずです。

source: As a developer you usually want to frequently pull the latest commits from the upstream git repository or a specific fork etc. However this brings a little problem with it: as the development continues, source files (and folders) are added or removed. These changes needs to be reflected in your project files for Qt Creator too, so you continue to have a nice experience coding in it. A simple way to check is to right click at your root folder in the "Projects View" and click on "Edit files..."
ja: 開発者は、通常、上流のgitリポジトリまたは特定のフォークなどから最新のコミットを頻繁にプルする必要があります。ただし、開発を続けると、ソースファイル(およびフォルダ)が追加または削除されるため、少し問題が生じます。 これらの変更はQt Creatorのプロジェクトファイルにも反映される必要があるため、それをちゃんと反映した上で引き続きコーディングを行ってください。チェックする簡単な方法は、"Projects View"のルートフォルダを右クリックし、"Edit files..."をクリックすることです。

source: Now a new dialog should appear that is similar in functionality to the one in the third step of the "Importing the project" section. Here you can check whether you want to add/remove specific files and/or folders. You can chose by clicking with your mouse or just simply by clicking the "Apply Filter" button. A simple click on "Ok" and you're ready to continue your work.
ja: これで、 "Importing the project" セクションの3番目のステップの機能と同様の新しいダイアログが表示されます。ここで、特定のファイルやフォルダを追加または削除するかどうかを確認できます。マウスでクリックするか、単に "Apply Filter" ボタンをクリックするだけで選択できます。 "OK" をクリックするだけで、作業を続行できます。

source: Now open cloned godot folder in VS Code (File > Open Folder...)
ru: Теперь откройте склонированную папку godot в VS Code (File > Open Folder...)
