Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/development/cpp/configuring_an_ide.po
Languages: fr, ja, ru

source: Configuring an IDE
fr: Configurer un EDI
ja: IDEの構成
ru: Настройка IDE

source: We assume that you have already `cloned <https://github.com/godotengine/godot>`_ and :ref:`compiled <toc-devel-compiling>` Godot.
fr: Nous supposons que vous avez déjà `cloné <https://github.com/godotengine/godot>`_ et :ref:`compilé <toc-devel-compiling>` Godot.
ja: すでにGodotの\ `クローンを作成 <https://github.com/godotengine/godot>`_ \ し、\ :ref:`コンパイル <toc-devel-compiling>`\ したとします。

source: You can easily develop Godot with any text editor and by invoking ``scons`` on the command line, but if you want to work with an IDE (Integrated Development Environment), here are setup instructions for some popular ones:
fr: Vous pouvez facilement développer Godot avec n'importe quel éditeur de texte et en appelant ``scons``avec la ligne de commande, mais si vous souhaitez travailler avec un EDI (Environnement de Développement intégré), voici les instructions de configuration pour certains d'entre eux :
ja: 任意のテキストエディタを使用してコマンドラインで ``scons`` を呼び出すことで簡単にGodotを開発できますが、IDE(統合開発環境)で作業する場合の、いくつかの一般的なもののセットアップ手順を以下に示します:
ru: Вы можете легко разрабатывать Godot из любого текстового редактора и вызывать ``scons`` из командной строки, но если вы хотите разрабатывать с помощью IDE (Integrated Development Environment), здесь вы можете найти инструкции для самых популярных:

source: :ref:`Qt Creator <doc_configuring_an_ide_qtcreator>` (all desktop platforms)
fr: :ref:`Qt Creator <doc_configuring_an_ide_qtcreator>` (toutes les plate-formes de bureau)
ja: :ref:`Qt Creator <doc_configuring_an_ide_qtcreator>` (すべてのデスクトッププラットフォーム)
ru: :ref:`Qt Creator <doc_configuring_an_ide_qtcreator>` (все десктопные платформы)

source: :ref:`Kdevelop <doc_configuring_an_ide_kdevelop>` (all desktop platforms)
fr: :ref:`Kdevelop <doc_configuring_an_ide_kdevelop>` (toutes les plate-formes de bureau)
ja: :ref:`Kdevelop <doc_configuring_an_ide_kdevelop>` (すべてのデスクトッププラットフォーム)
ru: :ref:`Kdevelop <doc_configuring_an_ide_kdevelop>` (все десктопные платформы)

source: :ref:`Visual Studio Code<doc_configuring_an_ide_vscode>` (all desktop platforms)
fr: :ref:`Visual Studio Code<doc_configuring_an_ide_vscode>` (toutes les plate-formes de bureau)
ja: :ref:`Visual Studio Code<doc_configuring_an_ide_vscode>` (すべてのデスクトッププラットフォーム)
ru: :ref:`Visual Studio Code<doc_configuring_an_ide_vscode>` (все десктопные платформы)

source: :ref:`Android Studio<doc_configuring_an_ide_android_studio>` (all desktop platforms)
fr: :ref:`Android Studio<doc_configuring_an_ide_android_studio>` (toutes les plate-formes de bureau)
ja: :ref:`Android Studio<doc_configuring_an_ide_android_studio>` (すべてのデスクトッププラットフォーム)

source: :ref:`CLion<doc_configuring_an_ide_clion>` (all desktop platforms)
fr: :ref:`CLion<doc_configuring_an_ide_clion>` (toutes les plate-formes de bureau)
ja: :ref:`CLion<doc_configuring_an_ide_clion>` (すべてのデスクトッププラットフォーム)

source: It is possible to use other IDEs, but their setup is not documented yet.
fr: Il est possible d'utiliser d'autres EDI, mais leur configuration n'est pas encore documentée.
ja: 他のIDEを使用することは可能ですが、それらのセットアップはまだ文書化されていません。
ru: Возможно использовать и другие IDE, но их настройка ещё не задокументирована.

source: Importing the project
fr: Importation du projet
ja: プロジェクトのインポート
ru: Импортирование проекта

source: Choose *New Project* -> *Import Project* -> *Import Existing Project*.
fr: Choisir *Nouveau Projet* -> *Importer Projet* -> *Importer Projet Existant*.
ja: *新しいプロジェクト* → *プロジェクトのインポート* → *既存プロジェクトのインポートを* を選択します。
ru: Выберите *New Project* -> *Import Project* -> *Import Existing Project*.

source: Set the path to your Godot root directory and enter the project name.
fr: Définissez le chemin pour votre répertoire racine de Godot et entre le nom du projet.
ja: Godotルートディレクトリへのパスを設定し、プロジェクト名を入力します。
ru: Установить путь к корневой директории Godot и введите имя проекта.

source: Here you can choose which folders and files will be visible to the project. C/C++ files are added automatically. Potentially useful additions: \*.py for buildsystem files, \*.java for Android development, \*.mm for macOS. Click "Next".
fr: Ici vous pouvez choisir les dossiers et fichiers qui seront visibles au projet. Les fichiers C/C++ seront ajoutés automatiquement. Ajouts potentiellement utiles : \*.py pour les fichiers du système de construction, \*.java pour le développement Android, \*.mm pour macOS. Cliquez sur "Suivant".
ja: ここでは、プロジェクトに表示するフォルダとファイルを選択できます。C/C++ファイルは自動的に追加されます。利用可能な拡張子: ビルドシステムファイルの \*.py、Android 開発用 \*.java、macOS用 \*.mm。[次へ] をクリックします。
ru: Здесь вы можете выбрать какие папки и файлы будут видимы в проекте. Файлы C/C++ добавляются автоматически. Потенциально хорошо добавить: \*.py для конфигурационных файлов, \*.java для разработки под Android, \*.mm для macOS. Щёлкните "Next".

source: Click *Finish*.
fr: Cliquez sur *Terminé*.
ja: *完了* をクリックします。
ru: Щёлкните *Finish*.

source: Add a line containing ``.`` to *project_name.includes* to get working code completion.
fr: Ajoutez une ligne au contenant ``.`` à *project_name.includes* pour faire fonctionner l'auto-complétion de code.
ja: ``.`` を含む行を\ *project_name.includes*\ に追加して、作業コードの完了を取得します。
ru: Добавьте строку содержащую ``.`` в *project_name.includes* для включения функции авто-завершения кода.

source: Build and run
fr: Construire et exécuter
ja: ビルドと実行
ru: Сборка и запуск

source: Build configuration:
fr: Configuration de construction :
ja: ビルド構成:
ru: Конфигурация сборки:

source: Click on *Projects* and open the *Build* tab.
fr: Cliquez sur *Projets* et ouvrez l'onglet *Build*.
ja: *プロジェクト*\ をクリックし、\ *ビルド*\ タブを開きます。
ru: Щёлкните *Projects* и откройте вкладку *Build*.

source: Delete the pre-defined ``make`` build step.
fr: Supprimer l'étape de construction prédéfinie ``make``.
ja: 定義済みの ``make`` ビルド ステップを削除します。
ru: Удалите предустановленный этап сборки ``make``.

source: Click *Add Build Step* -> *Custom Process Step*.
fr: Cliquez sur *Add Build Step* -> *Custom Process Step*.
ja: *ビルドステップを追加*\ -> \ *カスタムプロセスステップ*\ をクリックします。
ru: Щёлкните *Add Build Step* -> *Custom Process Step*.

source: Type ``scons`` in the *Command* field. If it fails with 'Could not start process "scons"', it can mean that ``scons`` is not in your ``PATH`` environment variable, so you may have to use the full path to the SCons binary.
fr: Tapez ``scons`` dans le champ *Command*. Si cela rate avec 'Could not start process "scons"', Cela peut signifier que ``scons`` n'est pas dans votre variable d'environnement ``PATH``, vous devez donc utiliser le chemin complet vers le binaire de SCons.
ja: *Command* フィールドに ``scons`` と入力します。\ ``Could not start process "scons"`` で失敗した場合、\ ``scons`` が ``PATH`` 環境変数にないため、SConsバイナリへのフルパスを使用しなければならない可能性があります。
ru: Выберите ``scons`` во поле *Command*. Если он будет ругаться 'Could not start process "scons"', это будет означать что ``scons`` не установлен в переменной среды ``PATH``, так что вам нужно будет установить полный путь к бинарнику SCons.

source: Fill the *Arguments* field with your compilation options. (e.g.: ``p=x11 target=debug -j 4``)
fr: Remplissez le champ *Arguments* avec vos options de compilation. (e.g. : ``p=x11 target=debug -j 4``)
ja: *引数*\ フィールドにコンパイルオプションを入力します。(例: ``p=x11 target=debug -j 4`` )
ru: Заполните поле *Arguments* вашими опциями компиляции. (напр.: ``p=x11 target=debug -j 4``)

source: Run configuration:
fr: Exécuter la configuration :
ja: 構成の実行:
ru: Конфигурация запуска:

source: Open the *Run* tab.
fr: Ouvrez l'onglet *Run*.
ja: *実行*\ タブを開きます。
ru: Откройте вкладку *Run*.

source: Point the *Executable* to your compiled Godot binary (e.g: ``%{buildDir}/bin/godot.x11.opt.tools.64``)
fr: Pointez l'*Exécutable* vers votre binaire Godot compilé (par exemple : ``%{buildDir}/bin/godot.x11.opt.tools.64``)
ja: *Executable* をコンパイル済みのGodotバイナリにポイントします(例: ``%{buildDir}/bin/godot.x11.opt.tools.64``)
ru: Настройте *Executable* на скомпилированный бинарный файл Godot (напр.: ``%{buildDir}/bin/godot.x11.opt.tools.64``)

source: If you want to run a specific game or project, point *Working directory* to the game directory.
fr: Si vous voulez exécuter un jeu ou projet spécifique, pointez *Working directory* vers le répertoire du jeu.
ja: 特定のゲームまたはプロジェクトを実行する場合は、\ *作業ディレクトリ*\ をゲームディレクトリに指定します。
ru: Если вы хотите запустить определённую игру или проект, настройте *Working directory* на директорию игры.

source: If you want to run the editor, add ``-e`` to the *Command line arguments* field.
fr: Si vous voulez exécuter l'éditeur, ajoutez ``-e`` au champ *Command line arguments*.
ja: エディタを実行する場合は、\ *コマンドライン引数*\ フィールドに ``-e`` を追加します。
ru: Если вы хотите запустить редактор, добавьте ``-e`` в поле *Command line arguments*.

source: Updating sources after pulling latest commits
fr: Mise à jour des sources après pull les derniers commits
ja: 最新のコミットをプルした後のソースの更新
ru: Обновление источников после получения последних коммитов

source: Code style configuration
fr: Configuration du style de code
ja: コードスタイル設定
ru: Конфигурация стилей кода

source: Developers must follow the project's :ref:`code style <doc_code_style_guidelines>` and IDE should help them to do it. By default, Qt Creator does use spaces for indentation which is incorrect for Godot project. You can change this behavior by changing the "Code Style" in *Options* -> *C++*.
fr: Les développeurs doivent suivre le :ref:`code style <doc_code_style_guidelines>` du projet et l'IDE devrait les aider à le faire. Par défaut, Qt Creator utilise des espaces pour l'indentation, ce qui est incorrect pour le projet Godot. Vous pouvez changer ce comportement en modifiant le "Style de code" dans *Options* -> *C++*.
ja: 開発者はプロジェクトの :ref:`コードスタイル<doc_code_style_guidelines>` に従う必要があり、IDEはそれを支援する必要があります。デフォルトでは、Qt Creatorはインデントにスペースを使用しますが、これはGodotプロジェクトでは正しくありません。この動作を変更するには、\ *オプション* → *C++* の「コードスタイル」を変更します。
ru: Разработчики должны следовать проектным :ref:`стилям кода <doc_code_style_guidelines>` и IDE должно помогать им в этом. По умолчанию, Qt Cretor использует пробелы для отступов что некорректно в проектах на Godot. Вы можете изменить это поведение в "Code Style" в *Options* -> *C++*.

source: Click on *Edit* to change the current settings, then click on *Copy Built-in Code Style* button to set a new code style. Set a name for it (e.g. Godot) and change the Tab policy to be *Tabs Only*.
fr: Cliquez sur *Edit* pour modifier les paramètres actuels, puis cliquez sur le bouton *Copy Built-in Code Style* pour définir un nouveau style de code. Donnez-lui un nom (par exemple, Godot) et modifiez la politique de tabulation pour qu'elle soit *Tabs Only*.
ja: [編集]をクリックして現在の設定を変更し、[ビルトイン コードスタイルをコピー]ボタンをクリックして新しいコードスタイルを設定します。名前を設定し(例: Godot)、タブポリシーを *タブのみ* に変更します。
ru: Щёлкнув по *Edit* вы измените текущие настройки, после кликните по кнопке *Copy Built-in Code Style* для установки нового стиля кода. Установить имя (напр. Godot) и измените настройку вкладок в *Tabs Only*.

source: `KDevelop <https://www.kdevelop.org>`_ is a free, open source IDE for all desktop platforms.
fr: `KDevelop <https://www.kdevelop.org>`_ est un IDE libre et open source pour toutes les plateformes de bureau.
ja: `KDevelop <https://www.kdevelop.org>`_ は、すべてのデスクトッププラットフォーム向けの無料のオープンソースIDEです。
ru: `KDevelop <https://www.kdevelop.org>`_ это бесплатная, открытая IDE для всех десктопных платформ.

source: You can find a video tutorial `here <https://www.youtube.com/watch?v=yNVoWQi9TJA>`_. Or you may follow this text version tutorial.
fr: Vous pourrez trouver un tutoriel vidéo `ici <https://www.youtube.com/watch?v=yNVoWQi9TJA>`_. Ou vous pouvez suivre la version manuscrite du tutoriel.
ja: ビデオチュートリアルは `こちら <https://www.youtube.com/watch?v=yNVoWQi9TJA>`_ です。または、このテキストバージョンのチュートリアルに従ってください。
ru: Вы можете найти видео обучения `здесь <https://www.youtube.com/watch?v=yNVoWQi9TJA>`_. Или вы можете следовать инструкциям в текстовом виде далее.

source: Start by opening KDevelop and choosing "open project".
fr: Commencez par ouvrir Kdevelop et choisir "open project".
ja: KDevelopを開き、"open project" を選択して開始します。
ru: Начните с открытия KDevelop и выбирания "open project".

source: Choose the directory where you cloned Godot.
fr: Choisissez le dossier où vous avez cloné Godot.
ja: Godotのクローンを作成したディレクトリを選択します。
ru: Выберите директорию где вы склонировали Godot.

source: On the next screen, choose "Custom Build System" for the *Project manager*.
fr: Sur l'écran suivant, choisissez "Custom Build System" pour le *Project manager*.
ja: 次の画面で、\ *Project manager* の "Custom Build System" を選択します。
ru: На следующем экране, выберите "Custom Build System" для *Project manager*.

source: Now that the project has been imported, open the project configuration.
fr: Maintenant que le projet a été importé, ouvrez la configuration du projet.
ja: プロジェクトがインポートされたので、プロジェクトの設定を開きます。
ru: Теперь, когда проект импортирован, откройте конфигурацию проекта.

source: Add the following includes/imports:
fr: Ajouter les includes/imports suivants :
ja: 次を includes/imports に追加します:
ru: Добавьте следующие инклуды/импорты:

source: Apply the changes.
fr: Appliquez les changements.
ja: 変更(Apply)を適用します。
ru: Примените изменения.

source: Switch to the "Custom Build System" tab. Add a build configuration and keep the build directory blank. Enable build tools and add ``scons`` as the executable then add ``platform=x11 target=debug`` (``platform=osx`` if you're on macOS) as the arguments.
fr: Passez à l'onglet "Custom Build System". Ajoutez une configuration de compilation et laissez le répertoire de compilation vide. Activez les outils de compilation et ajoutez ``scons`` comme exécutable puis ajoutez ``platform=x11 target=debug`` (``platform=osx`` si vous êtes sous MacOS) comme argument.
ja: "Custom Build System" タブに切り替えます。ビルド構成(Build configuration)を追加し、ビルドディレクトリ(Build Directory)を空白のままにします。ビルドツール(Build Tools)を有効(Enable)にし、実行可能ファイル(Executable)として `` scons`` を追加してから、引数(Arguments)として ``platform = x11 target = debug`` (macOSを使用している場合は `` platform = osx``)を追加します。
ru: Переключитесь на вкладку "Custom Build System". Добавьте сонфигурацию сборки и сохраните бланк директории сборки. Включите утилиты сборки и добавьте ``scons`` как ваш исполняемый файл и ``platform=x11 target=debug`` (``platform=osx`` если вы используете macOS) как аргументы.

source: Next we need to tell KDevelop where to find the binary. From the "Run" menu, choose "Configure Launches".
fr: Ensuite, nous devons dire à KDevelop où trouver le binaire. Dans le menu "Run", choisissez "Configure Launches".
ja: 次に、バイナリを見つける場所をKDevelopに指示する必要があります。"Run" メニューから[起動設定]を選択します。
ru: Затем вы должны сообщить KDevelop где найти исполняемый файл. Из меню "Run" выберите "Configure Launches".

source: Click "Add" if no launcher exists. Then add the path to your executable in the executable section. Your executable should be located in the ``bin/`` sub-directory and should be named something like ``godot.x11.tools.64`` (the name could be different depending on your platform and depending on your build options).
fr: Cliquez sur "Add" si aucun lanceur n'existe. Ajoutez ensuite le chemin d'accès à votre exécutable dans la section des exécutables. Votre exécutable doit être situé dans le sous-répertoire ``bin/`` et doit être nommé quelque chose comme ``godot.x11.tools.64`` (le nom peut être différent selon votre plate-forme et selon vos options de compilation).
ja: ランチャーが存在しない場合は、[追加] をクリックします。次に、実行可能(Executable)セクションに実行可能ファイルへのパスを追加します。実行可能ファイルは ``bin/`` サブディレクトリに配置し、\ ``godot.x11.tools.64`` のような名前を付ける必要があります(名前はプラットフォームやビルドオプションによって異なる場合があります) 。
ru: Кликните по "Add" если лаунчер отсутствует. Затем добавьте путь к экзешнику в секции исполнямых файлов. Ваш исполняемый файл должен находиться в под-директории ``bin/`` и должен иметь имя подобное ``godot.x11.tools.64`` (имя может быть немного другим в зависимости от вашей платформы и ваших опций сборки).

source: That's it! Now you should be good to go :)
fr: C'est tout ! Maintenant, vous devriez être prêt :)
ja: 以上です!これで準備完了です (^^)
ru: Отлично ! Теперь всё хорошо :)

source: Project setup
fr: Configuration du projet
ja: プロジェクトの設定
ru: Настройка проекта

source: Create an Xcode external build project anywhere
fr: Créer un projet de construction externe Xcode n'importe où
ja: 任意の場所にXcode外部ビルドプロジェクトを作成する
ru: Создаёте внешний проект Xcode в любом месте

source: Set the *Build tool* to the path to scons
fr: Réglez le *Build tool* au chemin de scons
ja: *ビルドツール*\ をsconsへのパスに設定します
ru: Установите *Build tool* на путь до scons

source: Modify Build Target's Xcode Info Tab:
fr: Modifiez dans l'onglet Info de Xcode la cible de construction :
ja: ビルドターゲットのXcode情報タブを変更します:
ru: Измените Цели Сборки во вкладке Xcode Info Tab:

source: Set *Arguments* to something like: platform=osx tools=yes bits=64 target=debug
fr: Définissez *Arguments* comme suit : platform=osx tools=yes bits=64 target=debug
ja: *引数*\ を次のようなものに設定します: platform=osx tools=はい bits=64 target=debug
ru: Установите *Arguments* на что-то подобное: platform=osx tools=yes bits=64 target=debug

source: Set *Directory* to the path to Godot's source folder. Keep it blank if project is already there.
fr: Réglez *Directory* au chemin au dossier source de Godot. Laissez le vide si le projet s'y trouve déjà.
ja: *Directory*\ を Godot のソース フォルダへのパスに設定します。プロジェクトが既に存在する場合は、空白のままにします。
ru: Установите *Directory* на путь к папке исходного кода Godot. Оставьте его пустым если проект уже установлен.

source: You may uncheck *Pass build settings in environment*
fr: Vous pouvez décocher *Pass build settings in environment*
ja: *環境内のビルド設定を渡す*\ のチェックを外すことが\ *できます*
ru: Вы можете снять флажок *Pass build settings in environment*

source: Add a Command Line Target:
fr: Ajouter une cible de ligne de commandement :
ja: コマンドラインターゲットの追加:
ru: Добавьте Цель Командной Строки:

source: Go to Xcode File > New > Target... and add a new Xcode command line target
fr: Allez dans Xcode File > New > Target... et ajoutez une nouvelle cible de ligne de commande Xcode
ja: [Xcodeファイル]> [新規]> [ターゲット...]に移動し、新しいXcodeコマンドラインターゲットを追加します
ru: Зайдите в Xcode File > New > Target... и добавьте новую цель командной строки Xcode

source: Name it something so you know not to compile with this target
fr: Donnez-lui un nom pour que vous sachiez qu'il ne faut pas compiler avec cette cible
ja: このターゲットでコンパイルしないように名前を付けます
ru: Назовите её так, чтобы вы запомнили что её не надо компилировать

source: e.g. ``GodotXcodeIndex``
fr: par exemple ``GodotXcodeIndex``
ja: 例: ``GodotXcodeIndex``
ru: напр. ``GodotXcodeIndex``

source: Goto the newly created target's *Build Settings* tab and search for *Header Search Paths*
fr: Allez à l'onglet *Build Settings* de la cible nouvellement créée et recherchez pour *Header Search Paths"
ja: 新しく作成したターゲットの\ *ビルド設定*\ タブに移動し、\ *ヘッダー検索パスを検索します*
ru: Перейдите на вкладку *Build Settings* и поищите *Header Search Paths*

source: Set *Header Search Paths* to an absolute path to Godot's source folder
fr: Définir *Header Search Paths* vers un chemin absolu vers le dossier source de Godot
ja: *ヘッダー検索パス*\ をGodotのソースフォルダへの絶対パスに設定する
ru: Установите *Header Search Paths* на абсолютный путь к папке исходных кодов Godot

source: Make it recursive by adding two \*'s to the end of the path
fr: Rendre le tout récursif en ajoutant deux \* à la fin du chemin
ja: パスの末端に 「\*\*」を追加して再帰的にする
ru: Сделайте её рекурсивной добавив две \* в конец пути

source: e.g. ``/Users/me/repos/godot-source/\**``
fr: exemple : ``/Users/me/repos/godot-source/\**``
ja: 例: ``/Users/me/repos/godot-source/\**``
ru: напр. ``/Users/me/repos/godot-source/\**``

source: Add Godot Source to the Project:
fr: Ajouter la source Godot au projet :
ja: プロジェクトにGodotソースを追加する:
ru: Добавьте Исходный Код Godot в Проект:

source: Drag and drop Godot source into project file browser.
fr: Glissez-déposez la source Godot dans le navigateur de fichiers de projet.
ja: Godotソースをプロジェクトファイルブラウザにドラッグアンドドロップします。
ru: Перетащите исходный код Godot в браузер файлов проекта.

source: Uncheck *Create External Build System*
fr: Décochez *Create External Build System*
ja: チェックを外す: \ *外部ビルド システムの作成*
ru: Снимите флажок *Create External Build System*

source: Click Next
fr: Cliquez sur Suivant
ja: 次へをクリックします
ru: Щёлкните Next

source: Select *create groups*
fr: Sélectionnez *créer des groupes*
ja: *グループの作成を選択*
ru: Выберите *create groups*

source: Check off only your command line target in the *Add to targets* section
fr: Cochez uniquement votre cible de ligne de commande dans la section « Ajouter aux cibles »
ja: *ターゲットに追加*\ セクションでコマンドラインターゲットのみをオフにします
ru: Выберите только свою командную строку цели в разделе *Add to targets*

source: Click finish. Xcode will now index the files.
fr: Cliquez sur Terminer. Xcode va maintenant indexer les fichiers.
ja: 終了をクリックします。次に、Xcodeがファイルのインデックスを作成します。
ru: Щёлкните finish. Xcode начнёт индексировать файлы.

source: Grab a cup of coffee... Maybe make something to eat, too
fr: Prenez une tasse de café... Faites peut-être quelque chose à manger aussi
ja: コーヒーを1杯取って...もしかしたら、何か食べるものも作るかもしれません
ru: Примите чашечку кофе... Возможно перекусите, также

source: You should have jump to definition, auto completion, and full syntax highlighting when it is done.
fr: Vous devriez avoir accès à la définition, à la saisie semi-automatique et à la coloration syntaxique complète une fois l'opération terminée.
ja: 定義、自動補完、および完全な構文の強調表示が完了したら、その定義にジャンプする必要があります。
ru: Вы сможете перейти к определению, настройкам авто завершения, и полной подсветке синтаксиса когда процесс закончится.

source: Scheme setup
fr: Configuration du schéma
ja: スキームのセットアップ
ru: Настройка схемы

source: Edit Build Scheme of External Build Target:
fr: Modifier le schéma de compilation (Build Scheme ) de la cible de compilation externe :
ja: 外部ビルドターゲットのビルドスキームの編集:
ru: Редактируйте Схему Сборки для Внешней Цели Сборки:

source: Open scheme editor of external build target
fr: Ouvrir l'éditeur de schéma de la cible de compilation externe
ja: 外部ビルドターゲットのオープンスキームエディタ
ru: Откройте редактор схемы внешней цели сборки

source: Expand the *Build* menu
fr: Développez le menu *Build*
ja: *ビルド*\ メニューを展開する
ru: Разверните меню *Build*

source: Goto *Post Actions*
fr: Allez à *Post Actions*
ja: *アクションの投稿へ飛ぶ*
ru: Перейдите в *Post Actions*

source: Add a new script run action, select your project in ``Provide build settings from`` as this allows you to use ``${PROJECT_DIR}`` variable.
fr: Ajoutez une nouvelle action d'exécution de script, sélectionnez votre projet dans ``Provide build settings from`` cela vous permet d'utiliser la variable ``${PROJECT_DIR}``.
ja: 新しいスクリプト実行アクションを追加し、 ``Provide build settings from`` でプロジェクトを選択すると、 ``${PROJECT_DIR}`` 変数を使用することができます。
ru: Добавьте новый скрипт запуска, выберите ваш проект в ``Provide build settings from`` так как это позволит вам использовать переменную ``${PROJECT_DIR}``.

source: Write a script that gives the binary a name that Xcode will recognize
fr: Écrivez un script qui donne au binaire un nom que Xcode reconnaîtra
ja: Xcodeが認識する名前をバイナリに与えるスクリプトを記述する
ru: Напишите скрипт чтобы дать имя исполняемому файлу которое поймёт Xcode

source: e.g. ``ln -f ${PROJECT_DIR}/godot/bin/godot.osx.tools.64 ${PROJECT_DIR}/godot/bin/godot``
fr: par exemple ``ln -f ${PROJECT_DIR}/godot/bin/godot.osx.tools.64 ${PROJECT_DIR}/godot/bin/godot``
ja: 例: ``ln -f ${PROJECT_DIR}/godot/bin/godot.osx.tools.64 ${PROJECT_DIR}/godot/bin/godot``
ru: напр. ``ln -f ${PROJECT_DIR}/godot/bin/godot.osx.tools.64 ${PROJECT_DIR}/godot/bin/godot``

source: Build the external build target
fr: Construisez la cible de construction externe
ja: 外部ビルドターゲットの構築
ru: Постройте внешнюю цель сборки

source: Edit Run Scheme of External Build Target:
fr: Éditez le Schéma d'Exécution de la Cible de Construction Externe :
ja: 外部ビルドターゲットの実行スキームの編集:
ru: Редактируйте Схему Запуска во Внешней Цели Сборки:
