Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/development/cpp/core_types.po
Languages: de

source: Core types
de: Kerntypen

source: Godot has a rich set of classes and templates that compose its core, and everything is built upon them.
de: Godot hat eine Vielzahl von Klassen und Vorlagen, aus denen sich sein Kern zusammensetzt, und alles baut darauf auf.

source: This reference will try to list them in order for their better understanding.
de: Diese Referenz wird versuchen sie aufzulisten, um sie besser zu verstehen.

source: Definitions
de: Definitionen

source: Godot uses the standard C99 datatypes, such as ``uint8_t``, ``uint32_t``, ``int64_t``, etc. which are nowadays supported by every compiler. Reinventing the wheel for those is not fun, as it makes code more difficult to read.
de: Godot verwendet die Standard-C99-Datentypen wie ``uint8_t``, ``uint32_t``, ``int64_t`` usw., die heutzutage von jedem Compiler unterstützt werden. Das Rad für diese neu zu erfinden macht keinen Spaß, da es das Lesen von Code erschwert.

source: In general, care is not taken to use the most efficient datatype for a given task unless using large structures or arrays. ``int`` is used through most of the code unless necessary. This is done because nowadays every device has at least a 32 bits bus and can do such operations in one cycle. It makes code more readable too.
de: Im Allgemeinen wird nicht darauf geachtet, den effizientesten Datentyp für eine bestimmte Aufgabe zu verwenden, es sei denn, Sie verwenden große Strukturen oder Arrays. ``int`` wird im größten Teil des Codes verwendet, sofern dies nicht erforderlich ist. Dies geschieht, weil heutzutage jedes Gerät mindestens einen 32-Bit-Bus hat und solche Operationen in einem Zyklus ausführen kann. Es macht Code auch lesbarer.

source: For files or memory sizes, ``size_t`` is used, which is warranted to be 64 bits.
de: Für Dateien oder Speichergrößen wird ``size_t`` verwendet, die garantiert 64 Bit beträgt.

source: For Unicode characters, CharType instead of wchar_t is used, because many architectures have 4 bytes long wchar_t, where 2 bytes might be desired. However, by default, this has not been forced and CharType maps directly to wchar_t.
de: Für Unicode-Zeichen wird CharType anstelle von wchar_t verwendet, da viele Architekturen ein 4 Bytes langes wchar_t haben, wobei 2 Bytes möglicherweise erwünscht sind. Standardmäßig wurde dies jedoch nicht erzwungen und CharType wird direkt wchar_t zugeordnet.

source: References:
de: Referenzen:

source: Memory model
de: Speichermodell

source: PC is a wonderful architecture. Computers often have gigabytes of RAM, terabytes of storage and gigahertz of CPU, and when an application needs more resources the OS will swap out the inactive ones. Other architectures (like mobile or consoles) are in general more limited.
de: PC ist eine wunderbare Architektur. Computer verfügen häufig über Gigabytes an RAM, Terabytes an Speicher und Gigahertz CPU. Wenn eine Anwendung mehr Ressourcen benötigt, lagert das Betriebssystem die inaktiven aus. Andere Architekturen (wie Mobilgeräte oder Konsolen) sind im Allgemeinen eingeschränkter.

source: The most common memory model is the heap, where an application will request a region of memory, and the underlying OS will try to fit it somewhere and return it. This often works best and is flexible, but over time and with abuse, this can lead to segmentation.
de: Das gebräuchlichste Speichermodell ist der Heap, bei dem eine Anwendung einen Speicherbereich anfordert und das zugrunde liegende Betriebssystem versucht, ihn irgendwo anzupassen und zurückzugeben. Dies funktioniert oft am besten und ist flexibel, aber im Laufe der Zeit und bei Missbrauch kann dies zu einer Segmentierung führen.

source: Segmentation slowly creates holes that are too small for most common allocations, so that memory is wasted. There is a lot of literature about heap and segmentation, so this topic will not be developed further here. Modern operating systems use paged memory, which helps mitigate the problem of segmentation but doesn't solve it.
de: Durch die Segmentierung werden langsam Löcher erzeugt, die für die meisten gängigen Zuordnungen zu klein sind, sodass Speicherplatz verschwendet wird. Es gibt viel Literatur über Heap und Segmentierung, daher wird auf dieses Thema hier nicht weiter eingegangen. Moderne Betriebssysteme verwenden ausgelagerten Speicher, wodurch das Segmentierungsproblem zwar gemindert, aber nicht gelöst wird.

source: However, in many studies and tests, it is shown that given enough memory, if the maximum allocation size is below a given threshold in proportion to the maximum heap size and proportion of memory intended to be unused, segmentation will not be a problem over time as it will remain constant. In other words, leave 10-20% of your memory free and perform all small allocations and you are fine.
de: In vielen Studien und Tests wurde jedoch gezeigt, dass bei ausreichendem Speicher die Segmentierung im Laufe der Zeit kein Problem darstellt, wenn die maximale Zuordnungsgröße im Verhältnis zur maximalen Heap-Größe und zum Anteil des Speichers, der nicht verwendet werden soll, unter einem bestimmten Schwellenwert liegt wie es konstant bleiben wird. Mit anderen Worten, lassen Sie 10-20% Ihres Speichers frei und führen Sie alle kleinen Zuweisungen durch, und alles ist gut.

source: Godot ensures that all objects that can be allocated dynamically are small (less than a few kb at most). But what happens if an allocation is too large (like an image or mesh geometry or large array)? In this case Godot has the option to use a dynamic memory pool. This memory needs to be locked to be accessed, and if an allocation runs out of memory, the pool will be rearranged and compacted on demand. Depending on the need of the game, the programmer can configure the dynamic memory pool size.
de: Godot stellt sicher, dass alle Objekte, die dynamisch zugewiesen werden können, klein sind (höchstens einige KB). Aber was passiert, wenn eine Zuordnung zu groß ist (z.B. ein Bild oder eine Mesh-Geometrie oder ein großes Array)? In diesem Fall hat Godot die Möglichkeit einen dynamischen Speicherpool zu verwenden. Dieser Speicher muss gesperrt sein, damit auf ihn zugegriffen werden kann. Wenn einer Zuordnung der Speicherplatz ausgeht, wird der Pool bei Bedarf neu angeordnet und komprimiert. Abhängig von den Anforderungen des Spiels kann der Programmierer die Größe des dynamischen Speicherpools konfigurieren.

source: Allocating memory
de: Speicher zuweisen

source: Godot has many tools for tracking memory usage in a game, especially during debug. Because of this, the regular C and C++ library calls should not be used. Instead, a few other ones are provided.
de: Godot verfügt über viele Tools zum Verfolgen der Speichernutzung in einem Spiel, insbesondere während des Debuggens. Aus diesem Grund sollten die regulären C und C++ Bibliotheksaufrufe nicht verwendet werden. Stattdessen werden einige andere bereitgestellt.

source: For C-style allocation, Godot provides a few macros:
de: Für die Zuweisung im C-Stil bietet Godot einige Makros:

source: These are equivalent to the usual malloc, realloc, free of the standard C library.
de: Diese entsprechen dem üblichen malloc, realloc, freigeben aus der Standard C-Bibliothek.

source: For C++-style allocation, special macros are provided:
de: Für die Zuweisung im C++ Stil stehen spezielle Makros zur Verfügung:

source: which are equivalent to new, delete, new[] and delete[].
de: die äquivalent zu new, delete, new [] und delete [] sind.

source: memnew/memdelete also use a little C++ magic and notify Objects right after they are created, and right before they are deleted.
de: memnew/memdelete verwenden auch eine kleine C++-Magie und benachrichtigen Objekte direkt nach ihrer Erstellung und direkt vor dem Löschen.

source: For dynamic memory, the PoolVector<> template is provided. PoolVector is a standard vector class, and is very similar to vector in the C++ standard library. To create a PoolVector buffer, use this:
de: Für den dynamischen Speicher wird das PoolVector<> Template bereitgestellt. PoolVector ist eine Standardvektorklasse und dem Vektor in der C++ - Standardbibliothek sehr ähnlich. Verwenden Sie Folgendes, um einen PoolVector-Puffer zu erstellen:

source: PoolVector can be accessed using the [] operator and a few helpers exist for this:
de: Auf PoolVector kann mit dem Operator [] zugegriffen werden. Hierzu gibt es einige Helfer:

source: These operations allow fast read/write from PoolVectors and keep it locked until they go out of scope. However, PoolVectors should be used for small, dynamic memory operations, as read() and write() are too slow for a large amount of accesses.
de: Diese Operationen ermöglichen ein schnelles Lesen/Schreiben von PoolVectors und halten es gesperrt, bis sie den Gültigkeitsbereich verlassen. PoolVectors sollten jedoch für kleine, dynamische Speicheroperationen verwendet werden, da read() und write() für eine große Anzahl von Zugriffen zu langsam sind.

source: Containers
de: Container

source: Godot provides also a set of common containers:
de: Godot bietet auch eine Reihe gängiger Container:

source: Vector
de: Vektor

source: They are simple and aim to be as minimal as possible, as templates in C++ are often inlined and make the binary size much fatter, both in debug symbols and code. List, Set and Map can be iterated using pointers, like this:
de: Sie sind einfach und sollen so minimal wie möglich zu sein, da Vorlagen in C++ häufig inline sind und die Binärgröße sowohl in Debug-Symbolen als auch den Code aufblähen. List, Set und Map können mit folgenden Zeigern iteriert werden:

source: The Vector<> class also has a few nice features:
de: Die Vector<> -Klasse hat auch ein paar nette Funktionen:

source: It does copy on write, so making copies of it is cheap as long as they are not modified.
de: Sie kopiert beim Schreiben, daher ist das Erstellen von Kopien günstig, solange sie nicht geändert werden.

source: It supports multi-threading, by using atomic operations on the reference counter.
de: Sie unterstützt Multithreading durch Verwendung kleinster Operationen am Referenzzähler.

source: String
de: Zeichenkette

source: Godot also provides a String class. This class has a huge amount of features, full Unicode support in all the functions (like case operations) and utf8 parsing/extracting, as well as helpers for conversion and visualization.
de: Godot bietet auch eine String-Klasse. Diese Klasse bietet eine Vielzahl von Funktionen, vollständige Unicode-Unterstützung für alle Funktionen (z.B. Falloperationen) und das Parsen bzw. Extrahieren von utf8 sowie Helfer für die Konvertierung und Visualisierung.

source: StringNames are like a String, but they are unique. Creating a StringName from a string results in a unique internal pointer for all equal strings. StringNames are useful for using strings as identifier, as comparing them is basically comparing a pointer.
de: StringNames sind wie ein String, sind aber eindeutig. Das Erstellen eines StringName aus einem String führt zu einem eindeutigen internen Zeiger für alle gleichen Strings. StringNames sind nützlich um Strings als Bezeichner zu verwenden, da beim Vergleich im Grunde genommen ein Zeiger verglichen wird.

source: Creation of a StringName (especially a new one) is slow, but comparison is fast.
de: Die Erstellung eines StringName (insbesondere eines neuen) ist langsam, der Vergleich jedoch schnell.

source: Math types
de: Mathe-Typen

source: There are several linear math types available in the core/math directory.
de: Im Verzeichnis core/math stehen mehrere lineare Mathe-Typen zur Verfügung.

source: This is a special datatype used for storing paths in a scene tree and referencing them fast.
de: Dies ist ein spezieller Datentyp, mit dem Pfade in einem Szenenbaum gespeichert und schnell referenziert werden.

source: RIDs are resource IDs. Servers use these to reference data stored in them. RIDs are opaque, meaning that the data they reference can't be accessed directly. RIDs are unique, even for different types of referenced data.
de: RIDs sind Ressourcen-IDs. Server verwenden diese um auf darin gespeicherte Daten zu verweisen. RIDs sind undurchsichtig, was bedeutet, dass auf verwiesene Daten nicht direkt zugegriffen werden kann. RIDs sind eindeutig, auch für verschiedene Arten von Daten, auf die verwiesen wird.
