Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/development/cpp/custom_modules_*_cpp.po
Languages: ja, ru

source: Custom modules in C++
ja: C++のカスタムモジュール
ru: Собственные модули на C++

source: Modules
ja: モジュール
ru: Модули

source: Godot allows extending the engine in a modular way. New modules can be created and then enabled/disabled. This allows for adding new engine functionality at every level without modifying the core, which can be split for use and reuse in different modules.
ja: Godotでは、モジュール方式でエンジンを拡張できます。新しいモジュールを作成してから、有効/無効にすることができます。これにより、コアを変更せずにすべてのレベルで新しいエンジン機能を追加できます。コアは別のモジュールで使用および再利用するために分割できます。
ru: Godot позволяет улучшать себя модульным путём. Новые модули могут быть созданы, а затем включены или выключены. Это позволяет добавлять новую функциональность в движок на любом уровне без модификации ядра, что позволяет разделить для использования или повторного использования разные модули.

source: Modules are located in the ``modules/`` subdirectory of the build system. By default, many different modules exist, such as GDScript (which, yes, is not part of the base engine), the Mono runtime, a regular expressions module, and others. As many new modules as desired can be created and combined, and the SCons build system will take care of it transparently.
ru: Модули содержаться в под-директории ``modules/`` системы сборки. Из коробки, существует много различных модулей, таких как GDScript (да он не часть базы движка), исполняемая среда Mono, модуль регулярных выражений, и другие. Многие новые модули которые желательны могут быть созданы и скомбинированы, и система сборки SCons делает это прозрачным.

source: What for?
ja: 何のために？
ru: Для чего это?

source: While it's recommended that most of a game is written in scripting (as it is an enormous time saver), it's perfectly possible to use C++ instead. Adding C++ modules can be useful in the following scenarios:
ru: В то время как рекомендуется писать игру через скриптинг (так как это значительно экономит время), существует возможность использовать вместо этого C++. Добавление модулей C++ может быть полезно для следующих сценариев:

source: Binding an external library to Godot (like PhysX, FMOD, etc).
ja: 外部ライブラリをGodot にバインドする(PhysX、FMODなど)。
ru: Связка внешней библиотеки с Godot (PhysX, FMOD, итд).

source: Optimize critical parts of a game.
ja: ゲームの重要な部分を最適化します。
ru: Оптимизация критических частей игры.

source: Adding new functionality to the engine and/or editor.
ja: エンジンまたはエディタに新しい機能を追加します。
ru: Добавление новой функциональности в движок и/или редактор.

source: Porting an existing game.
ja: 既存のゲームを移植します。
ru: Портирование существующей игры.

source: Write a whole, new game in C++ because you can't live without C++.
ja: C++なしでは生きていけないので、C++で新しいゲームを書きます。
ru: Написание целой, новой игры на C++ поскольку вы не можете жить без C++.

source: Creating a new module
ja: 新しいモジュールの作成
ru: Создание нового модуля

source: Before creating a module, make sure to download the source code of Godot and manage to compile it. There are tutorials in the documentation for this.
ja: モジュールを作成する前に、Godot のソースコードをダウンロードし、コンパイルに成功してください。このドキュメントにはチュートリアルがあります。
ru: Перед созданием модуля, убедитесь что загрузили исходный код Godot и можете его скомпилировать. Существуют обучающие материалы в документации для этого.

source: To create a new module, the first step is creating a directory inside ``modules/``. If you want to maintain the module separately, you can checkout a different VCS into modules and use it.
ja: 新しいモジュールを作成するには、最初のステップは ``modules/`` 内にディレクトリを作成することです。モジュールを個別に保守する場合は、別のVCSをモジュールにチェックアウトして使用できます。
ru: Для создания нового модуля, первым шагом создайте директорию внутри ``modules/``. Если вы хотите поддерживать модуль отдельно, вы можете назначить другую систему контроля версий(VCS) на модули и использовать её.

source: The example module will be called "summator", and is placed inside the Godot source tree (``C:\godot`` refers to wherever the Godot sources are located):
ja: 例のモジュールは「summator」と呼ばれ、Godot ソースツリー内に配置されます( ``C:\godot`` は Godot ソースが配置されている場所を指します):
ru: Для примера возьмём модуль который назовём "summator", и поместим его внутри дерева кода Godot (``C:\godot`` ссылается на место где размещается коды Godot):

source: Inside we will create a simple summator class:
ja: 内部では、単純なsummatorクラスを作成します:
ru: Внутри мы создадим простой класс для сложения суммы:

source: And then the cpp file.
ja: それからcppファイル。
ru: А затем файл cpp.

source: Then, the new class needs to be registered somehow, so two more files need to be created:
ja: 次に、新しいクラスを何らかの方法で登録する必要があるので、さらに2つのファイルを作成する必要があります:
ru: Затем, новый класс нужно где-то зарегистрировать, для этого нужно создать еще два файла:

source: With the following contents:
ru: Со следующим наполнением:

source: Next, we need to create a ``SCsub`` file so the build system compiles this module:
ja: 次に、ビルドシステムがこのモジュールをコンパイルできるように ``SCsub`` ファイルを作成する必要があります:
ru: Далее, мы должны создать файл ``SCsub`` чтобы система сборки скомпилировала этот модуль:

source: With multiple sources, you can also add each file individually to a Python string list:
ja: 複数のソースを使用して、各ファイルをPython文字列リストに個別に追加することもできます:
ru: С несколькими файлами кода, вы также можете добавить каждый файл отдельно в список строк Python:

source: This allows for powerful possibilities using Python to construct the file list using loops and logic statements. Look at some of the other modules that ship with Godot by default for examples.
ru: Это открывает доступ к широким возможностям Python для собирания списка файлов используя циклы и логические выражения. Посмотрите в другие модули Godot для примеров.

source: To add include directories for the compiler to look at you can append it to the environment's paths:
ja: コンパイラが見るインクルードディレクトリを追加するには、環境のパスに追加します:
ru: Чтобы добавить директории включения(include) для компилятора, вы может добавить их в пути переменных сред:

source: If you want to add custom compiler flags when building your module, you need to clone `env` first, so it won't add those flags to whole Godot build (which can cause errors). Example `SCsub` with custom flags:
ja: モジュールのビルド時にカスタムコンパイラフラグを追加する場合は、最初に `env` のクローンを作成する必要があるので、これらのフラグはGodotビルド全体に追加されません(エラーが発生する可能性があります)。カスタムフラグを使用した `SCsub` の例:
ru: Если вы желаете добавить собственные флаги компиляции когда строите модуль, вы должны сначала клонировать `env`, чтобы он не добавлял флаги целиком в Godot (что вызовет ошибки). К примеру `SCsub` с собственными флагами:

source: And finally, the configuration file for the module, this is a simple python script that must be named ``config.py``:
ja: 最後に、モジュールの構成ファイルは、 ``config.py`` という名前を付けなければならない単純なPythonスクリプトです:
ru: И наконец, файл конфигурации для модуля, это просто файл скрипта питона который должен быть назван ``config.py``:

source: The module is asked if it's ok to build for the specific platform (in this case, True means it will build for every platform).
ru: Модуль спросит если ему нужно быть собранным для определённой платформа (в этом случае, True означает что он будет построен для каждой платформы).

source: And that's it. Hope it was not too complex! Your module should look like this:
ja: 以上です。あまり複雑でなければいいのですが。モジュールは次のようになります:
ru: Вот так. Надеемся это не было слишком сложным! Ваш модуль должен выглядеть примерно так:

source: You can then zip it and share the module with everyone else. When building for every platform (instructions in the previous sections), your module will be included.
ja: その後、それを圧縮し、他の人とモジュールを共有することができます。すべてのプラットフォーム (前のセクションの手順)を構築する場合は、モジュールが含まれます。
ru: Затем вы можете сжать и раздать модуль всем желающим. При сборке под каждую платформу (инструкции в предыдущих разделах), ваш модуль будет включен.

source: Using the module
ja: モジュールの使用
ru: Использование модуля

source: You can now use your newly created module from any script:
ja: これで、任意のスクリプトから新しく作成したモジュールを使用できます:
ru: Теперь вы можете использовать ваш новый модуль из любого скрипта:

source: And the output will be ``60``.
ru: И вывод будет ``60``.

source: The previous Summator example is great for small, custom modules, but what if you want to use a larger, external library? Refer to :ref:`doc_binding_to_external_libraries` for details about binding to external libraries.
ru: Предыдущий пример Summator был великолепен для маленьких, ручных модулей, но что если вы хотите использовать большую, внешнюю библиотеку? Перейдите в :ref:`doc_binding_to_external_libraries` для подробностей связки внешних библиотек.

source: Improving the build system for development
ja: 開発のためのビルドシステムの改善
ru: Улучшение системы сборки для разработки

source: So far we defined a clean and simple SCsub that allows us to add the sources of our new module as part of the Godot binary.
ja: ここまでは、Godotバイナリの一部として新しいモジュールのソースを追加できるクリーンでシンプルなSCsubを定義しました。
ru: Итак мы определили чистый и простой SCsub что позволило нам добавить код в новый модуль как часть бинарного файла Godot.

source: This static approach is fine when we want to build a release version of our game given we want all the modules in a single binary.
ja: この静的なアプローチは、すべてのモジュールを1つのバイナリにしたい場合に、ゲームのリリースバージョンを構築したいときに適しています。
ru: Статический подход хорош когда вы хотите собрать конечную версию вашей игры, когда мы хотим все модули в одном исполняемом файле.

source: The solution to avoid such a cost is to build our own module as a shared library that will be dynamically loaded when starting our game's binary.
ja: このようなコストを回避するソリューションは、ゲームのバイナリを起動するときに動的に読み込まれる共有ライブラリとして独自のモジュールを構築することです。
ru: Решение для избежания таких расходов это сборка собственного модуля как общей(shared) библиотеки которая динамически загрузится при старте нашей игры.

source: Once compiled, we should end up with a ``bin`` directory containing both the ``godot*`` binary and our ``libsummator*.so``. However given the .so is not in a standard directory (like ``/usr/lib``), we have to help our binary find it during runtime with the ``LD_LIBRARY_PATH`` environ variable:
ru: Однажды скомпилировав, мы должны в конечном итоге создать папку ``bin`` содержащую бинарный файл``godot*`` и наш ``libsummator*.so``. Хотя данный .so находится на в обычной директории (как ``/usr/lib``), мы можем помочь нашему бинарному файлу найти его в среде выполнения через переменную среды ``LD_LIBRARY_PATH``:

source: **note**: Pay attention you have to ``export`` the environ variable otherwise you won't be able to play you project from within the editor.
ru: **замечание**: Будьте внимательны в экспорте переменной среды иначе вы не сможете запустить ваш проект из редактора.

source: On top of that, it would be nice to be able to select whether to compile our module as shared library (for development) or as a part of the Godot binary (for release). To do that we can define a custom flag to be passed to SCons using the `ARGUMENT` command:
ja: さらに、モジュールを共有ライブラリとして(開発用)コンパイルするか、Godotバイナリの一部として(リリース用)コンパイルするかを選択できると便利です。それには、\ `ARGUMENT` コマンドを使用してSConsに渡すカスタムフラグを定義できます:
ru: Кроме того, было бы неплохо иметь возможность выбрать нужно ли скомпилировать ваш модуль как общую библиотеку (для разработки) или как часть бинарного файла Godot (для релиза). Для этого мы можем установить собственный флаг для SCons используя команду `ARGUMENT`:

source: Now by default ``scons`` command will build our module as part of godot's binary and as a shared library when passing ``summator_shared=yes``.
ru: Теперь по умолчанию команда ``scons`` будет собирать наш модуль как часть бинарного файла godot, а в общую библиотеку когда будет передано ``summator_shared=yes``.

source: Finally you can even speedup build further by explicitly specifying your shared module as target in the scons command:
ru: Наконец вы можете даже ускорить сборку явно определяя ваш общий модуль как цель для команды scons:

source: Writing custom documentation
ja: カスタムドキュメントの作成
ru: Написание собственной документации

source: Writing documentation may seem like a boring task, but it is highly recommended to document your newly created module in order to make it easier for users to benefit from it. Not to mention that the code you've written one year ago may become indistinguishable from the code that was written by someone else, so be kind to your future self!
ja: ドキュメントを書くのは退屈な作業のように思えるかもしれませんが、ユーザーが役立てやすくするために、新しく作成したモジュールを文書化することを強くお勧めします。1年前に書いたコードは、他の人が書いたコードと区別がつかないかもしれないので、将来の自分に親切にしてください!
ru: Написание документации может выглядеть скучным занятием, но вообще крайне рекомендуется документировать ваши новые модули чтобы делать их легче для пользователей и извлекать из этого выгоду. Не говоря уж о том что код который вы написали один год назад может быть спутан с кодом который был написан другим человеком, так что будьте добры к самим себе!

source: There are several steps in order to setup custom docs for the module:
ja: モジュールのカスタムドキュメントをセットアップするには、いくつかの手順があります:
ru: Существует много шагов для установки собственной документации в модуль:

source: Make a new directory in the root of the module. The directory name can be anything, but we'll be using the ``doc_classes`` name throughout this section.
ja: モジュールのルートに新しいディレクトリを作成します。ディレクトリ名は何でもかまいませんが、このセクションでは ``doc_classes`` という名前を使用します。
ru: Создайте новую папку в корне модуля. Имя папки может быть любым, но мы используем ``doc_classes`` в этом разделе.

source: Append the following code snippet to ``config.py``:
ru: Добавьте следующий кусочек кода в ``config.py``:

source: The ``get_doc_classes()`` method is necessary for the build system to know which documentation classes of the module must be merged, since the module may contain several classes. Replace ``ClassName`` with the name of the class you want to write documentation for. If you need docs for more than one class, append those as well.
ru: Метод ``get_doc_classes()`` необходим для системы сборки чтобы знать какие классы документации модуля должны быть слиты вместе, поскольку модуль может содержать несколько классов. Замените ``ClassName`` именем класса который вы хотите документировать. Если вам нужна документация для более чем одного класса, добавьте её также.

source: The ``get_doc_path()`` method is used by the build system to determine the location of the docs. In our case, they will be located in the ``doc_classes`` directory.
ru: Метод ``get_doc_path()`` используется системой сборки для определения позиции документации. В нашем случае, они располагаются в папке ``doc_classes``.

source: Run command:
ja: コマンドの実行:
ru: Команда запуска:

source: This will dump the engine API reference to the given ``<path>`` in XML format. Notice that you'll need to configure your ``PATH`` to locate Godot's executable, and make sure that you have write access rights. If not, you might encounter an error similar to the following:
ru: Это сбросит справку по API в определенный ``<path>`` в формате XML. Заметьте что вы должны настроить ваш ``PATH`` для нахождения бинарного файла Godot, и убедиться что вы имеете права доступа на запись. Если нет, вы столкнётесь с подобной ошибкой:

source: Get generated doc file from ``godot/doc/classes/ClassName.xml``
ru: Получить сгенерированный файл документации из ``godot/doc/classes/ClassName.xml``

source: Copy this file to ``doc_classes``, optionally edit it, then compile the engine.
ru: Скопируйте этот файл в ``doc_classes``, опционально отредактируйте его, затем скомпилируйте движок.

source: The build system will fetch the documentation files from the ``doc_classes`` directory and merge them with the base types. Once the compilation process is finished, the docs will become accessible within the engine's built-in documentation system.
ru: Система сборки соберёт файлы документации из папки ``doc_classes`` и соединит их в базовые типы. После завершения процесса компиляции, документация будет доступна через встроенную систему документации движка.

source: In order to keep documentation up-to-date, all you'll have to do is simply modify one of the ``ClassName.xml`` files and recompile the engine from now on.
ru: Для содержания документации в актуальном состоянии, все что вам нужно делать это редактировать один из файлов ``ClassName.xml`` и компилировать движок.

source: Summing up
ja: まとめ
ru: Итоги

source: Remember to:
ja: 覚えておいてください:
ru: Запомните:

source: use ``GDCLASS`` macro for inheritance, so Godot can wrap it
ja: 継承に ``GDCLASS`` マクロを使用するので、Godotはそれをラップできます
ru: используйте ``GDCLASS`` для наследования, чтобы Godot мог распознать класс

source: use ``_bind_methods`` to bind your functions to scripting, and to allow them to work as callbacks for signals.
ja: 関数をスクリプトにバインドし、シグナルのコールバックとして機能できるようにするには、 ``_bind_methods`` を使用します。
ru: используйте ``_bind_methods`` для связки ваших функций для скриптинга, и разрешите им работать как обратные вызовы для сигналов.

source: But this is not all, depending what you do, you will be greeted with some (hopefully positive) surprises.
ja: しかし、これはすべてではありません、あなたが何をするかに応じて、いくつかの(うまくいけば肯定的な)驚きで迎えられます。
ru: Но это еще не все, в зависимости от того что вы делаете, вы столкнётесь с некоторыми (надеемся позитивными) сюрпризами.

source: If you inherit from :ref:`class_Node` (or any derived node type, such as Sprite), your new class will appear in the editor, in the inheritance tree in the "Add Node" dialog.
ja: :ref:`class_Node` (またはSpriteなどの派生ノードタイプ) から継承すると、新しいクラスがエディタに表示され、「ノードの追加」ダイアログボックスの継承ツリーに表示されます。
ru: Если вы наследуете от :ref:`class_Node` (или другого наследника ноды, такой как Sprite), ваш новый класс будет показан в редакторе, в дереве наследований в диалоге "Add Node".

source: If you inherit from :ref:`class_Resource`, it will appear in the resource list, and all the exposed properties can be serialized when saved/loaded.
ja: :ref:`class_Resource`\ から継承すると、リソース リストに表示され、公開されているすべてのプロパティは、保存/読み込み時にシリアル化できます。
ru: Если вы наследуете от :ref:`class_Resource`, он будет показан в списке ресурсов, и все ваши открытые свойства будут сериализованы во время загрузки/сохранения.

source: By this same logic, you can extend the Editor and almost any area of the engine.
ja: この同じロジックによって、エディタとエンジンのほぼすべての領域を拡張できます。
ru: Следуя той же логике, вы можете расширить возможности Редактора и почти любой области движка.

source: While it's recommended that most of a game be written in scripting (as it is an enormous time saver), it's perfectly possible to use C++ instead. Adding C++ modules can be useful in the following scenarios:
ja: ゲームの大部分はスクリプトで記述することをお勧めしますが(時間を大幅に節約できるため)、代わりに完全にC++を使用することも可能です。 C++モジュールの追加は、次のシナリオで役立ちます:

source: The module is asked if it's OK to build for the specific platform (in this case, ``True`` means it will build for every platform).
ja: モジュールは、特定のプラットフォーム用にビルドしてもよいかどうかを尋ねられます(この場合、\ ``True`` はすべてのプラットフォーム用にビルドすることを意味します)。

source: There is a parameter limit of 5 in C++ modules for things such as subclasses. This can be raised to 13 by including the header file ``core/method_bind_ext.gen.inc``.
ja: サブクラスなどのC++モジュールには、パラメーター数が5までの制限があります。これは、ヘッダーファイル ``core/method_bind_ext.gen.inc`` を含めることで13に上げることができます。

source: The output will be ``60``.
ja: 出力は ``60`` になります。

source: The previous Summator example is great for small, custom modules, but what if you want to use a larger, external library? Refer to :ref:`doc_binding_to_external_libraries` for details about binding to external libraries.
ja: 前のSummatorの例は、小さなカスタムモジュールに最適ですが、より大きな外部ライブラリを使用する場合はどうでしょうか。外部ライブラリへのバインドの詳細については、\ :ref:`doc_binding_to_external_libraries` を参照してください。

source: If your module is meant to be accessed from the running project (not just from the editor), you must also recompile every export template you plan to use, then specify the path to the custom template in each export preset. Otherwise, you'll get errors when running the project as the module isn't compiled in the export template. See the :ref:`Compiling <toc-devel-compiling>` pages for more information.
ja: モジュールが(エディタからだけでなく)実行中のプロジェクトからアクセスされる場合、使用する予定のすべてのエクスポートテンプレートを再コンパイルし、各エクスポートプリセットでカスタムテンプレートへのパスを指定する必要があります。そうしないと、モジュールがエクスポートテンプレートでコンパイルされないため、プロジェクトの実行時にエラーが発生します。詳細については、\ :ref:`Compiling <toc-devel-compiling>` ページを参照してください。

source: Now by default ``scons`` command will build our module as part of Godot's binary and as a shared library when passing ``summator_shared=yes``.
ja: 現在、デフォルトで ``scons`` コマンドは、モジュールをGodotのバイナリの一部として、そして ``summator_shared = yes`` を渡すときに共有ライブラリとしてビルドします。

source: Adding custom editor icons
ja: カスタムエディタアイコンの追加

source: Similarly to how you can write self-contained documentation within a module, you can also create your own custom icons for classes to appear in the editor.
ja: モジュール内で自己完結型のドキュメントを作成する方法と同様に、エディタに表示されるクラスの独自のカスタムアイコンを作成することもできます。

source: For the actual process of creating editor icons to be integrated within the engine, please refer to :ref:`doc_editor_icons` first.
ja: エンジン内に統合されるエディタアイコンを作成する実際のプロセスについては、最初に :ref:`doc_editor_icons` を参照してください。

source: Once you've created your icon(s), proceed with the following steps:
ja: アイコンを作成したら、次の手順に進みます:

source: Make a new directory in the root of the module named ``icons``. This is the default path for the engine to look for module's editor icons.
ja: ``icons`` という名前のモジュールのルートに新しいディレクトリを作成します。これは、モジュールのエディタアイコンを検索するエンジンのデフォルトパスです。

source: Move your newly created ``svg`` icons (optimized or not) into that folder.
ja: 新しく作成した ``svg`` アイコン(最適化されているかどうかに関係なく)をそのフォルダに移動します。

source: Recompile the engine and run the editor. Now the icon(s) will appear in editor's interface where appropriate.
ja: エンジンを再コンパイルし、エディタを実行します。必要に応じて、エディタのインターフェースにアイコンが表示されます。

source: If you'd like to store your icons somewhere else within your module, add the following code snippet to ``config.py`` to override the default path:
ja: モジュール内の別の場所にアイコンを保存したい場合は、次のコードスニペットを ``config.py`` に追加してデフォルトパスをオーバーライドします:
