Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/development/cpp/object_class.po
Languages: de, zh_cn

source: Object class
de: Objekt Klasse
zh_cn: 对象类

source: This page describes the C++ implementation of objects in Godot. Looking for the Object class reference? :ref:`Have a look here. <class_Object>`
de: Diese Seite beschreibt die C++ - Implementierung von Objekten in Godot. Suchen Sie nach der Objektklassenreferenz? :ref:`Have a look here. <class_Object>`

source: General definition
de: Allgemeine Definition
zh_cn: 一般定义

source: :ref:`Object <class_object>` is the base class for almost everything. Most classes in Godot inherit directly or indirectly from it. Objects provide reflection and editable properties, and declaring them is a matter of using a single macro like this.
de: :ref:`Object <class_object>` ist die Basisklasse für fast alles. Die meisten Klassen in Godot erben direkt oder indirekt davon. Objekte bieten Reflexions- und bearbeitbare Eigenschaften, und für deren Deklaration muss ein einziges Makro wie dieses verwendet werden.
zh_cn: :ref:`Object <class_object>` 几乎是所有东西的基类。 Godot中的大多数类都直接或间接地从它继承。 对象提供反射和可编辑属性，并声明它们是使用像这样的单个宏。

source: This makes Objects gain a lot of functionality, like for example
de: Dadurch erhalten Objekte viele Funktionen, wie zum Beispiel
zh_cn: 这使得Objects获得了很多功能，例如

source: References:
de: Referenzen:
zh_cn: 参阅资料:

source: Registering an Object
de: Ein Objekt registrieren
zh_cn: 注册对象

source: ClassDB is a static class that holds the entire list of registered classes that inherit from Object, as well as dynamic bindings to all their methods properties and integer constants.
de: ClassDB ist eine statische Klasse, welche die gesamte Liste der von Object geerbten registrierten Klassen sowie dynamische Bindungen an alle Methodeneigenschaften und Ganzzahlkonstanten enthält.
zh_cn: ClassDB是一个静态类，它包含从Object继承的已注册类的完整列表，以及对其所有方法属性和整数常量的动态绑定。

source: Classes are registered by calling:
de: Klassen werden registriert durch Aufruf:
zh_cn: 通过调用来注册类:

source: Registering it will allow the class to be instanced by scripts, code, or creating them again when deserializing.
de: Durch die Registrierung kann die Klasse durch Skripte, Code instanziiert oder beim Deserialisieren erneut erstellt werden.
zh_cn: 注册它将允许通过脚本，代码实例化类，或在反序列化时再次创建它们。

source: Registering as virtual is the same but it can't be instanced.
de: Die Registrierung als virtuell ist die gleiche, aber sie kann nicht instanziert werden.
zh_cn: 注册为虚拟是相同的，但它不能实例化。

source: Object-derived classes can override the static function ``static void _bind_methods()``. When one class is registered, this static function is called to register all the object methods, properties, constants, etc. It's only called once. If an Object derived class is instanced but has not been registered, it will be registered as virtual automatically.
de: Von Objekten abgeleitete Klassen können die statische Funktion ``static void _bind_methods()`` überschreiben. Wenn eine Klasse registriert ist, wird diese statische Funktion aufgerufen, um alle Objektmethoden, Eigenschaften, Konstanten usw. zu registrieren. Sie wird nur einmal aufgerufen. Wenn eine von Object abgeleitete Klasse instanziiert, aber nicht registriert wurde, wird sie automatisch als virtuell registriert.
zh_cn: 对象派生类可以覆盖静态函数``static void _bind_methods()``。 当一个类被注册时，调用这个静态函数来注册所有对象方法，属性，常量等。它只被调用一次。 如果Object派生类已实例但尚未注册，则它将自动注册为虚拟。

source: Inside ``_bind_methods``, there are a couple of things that can be done. Registering functions is one:
de: In ``_bind_methods`` gibt es ein paar Dinge, die getan werden können. Das Registrieren von Funktionen ist eine:
zh_cn: 在 ``_bind_methods`` 里面，有几件事可以做。 注册功能是一个:

source: Default values for arguments can be passed in reverse order:
de: Standardwerte für Argumente können in umgekehrter Reihenfolge übergeben werden:
zh_cn: 参数的默认值可以按相反的顺序传递:

source: ``D_METHOD`` is a macro that converts "methodname" to a StringName for more efficiency. Argument names are used for introspection, but when compiling on release, the macro ignores them, so the strings are unused and optimized away.
de: ``D_METHOD`` ist ein Makro, das "Methodenname" zur Steigerung der Effizienz in einen StringName konvertiert. Argumentnamen werden zur Selbstbeobachtung verwendet, aber beim Kompilieren bei der Veröffentlichung werden sie vom Makro ignoriert, sodass die Zeichenfolgen nicht verwendet und nicht optimiert werden.
zh_cn: ``D_METHOD``是一个宏，它将“methodname”转换为StringName以提高效率。 参数名称用于内省，但在发布时进行编译时，宏会忽略它们，因此字符串未使用并优化掉。

source: Check ``_bind_methods`` of Control or Object for more examples.
de: Weitere Beispiele finden Sie unter ``_bind_methods`` von Control oder Objekt.
zh_cn: 有关更多示例，请查看Control或Object的 ``_bind_methods`` 。

source: If just adding modules and functionality that is not expected to be documented as thoroughly, the ``D_METHOD()`` macro can safely be ignored and a string passing the name can be passed for brevity.
de: Wenn nur Module und Funktionen hinzugefügt werden, von denen nicht erwartet wird, dass sie so gründlich dokumentiert werden, kann das Makro ``D_METHOD()`` ignoriert und eine Zeichenfolge, die den Namen übergibt, kann der Kürze halber übergeben werden.
zh_cn: 如果只是添加不希望被彻底记录的模块和功能，可以安全地忽略 ``D_METHOD()`` 宏，并且为了简洁起见，可以传递传递名称的字符串。

source: Constants
de: Konstanten
zh_cn: 常量

source: Classes often have enums such as:
de: Klassen haben oft Aufzählungen wie:
zh_cn: 类通常有枚举，例如:

source: For these to work when binding to methods, the enum must be declared convertible to int, for this a macro is provided:
de: Damit diese beim Binden an Methoden funktionieren, muss die Aufzählung als in int konvertierbar deklariert werden. Dazu wird ein Makro bereitgestellt:
zh_cn: 为了使这些在绑定到方法时起作用，必须将枚举声明为可转换为int，为此提供了一个宏:

source: The constants can also be bound inside ``_bind_methods``, by using:
de: Die Konstanten können auch innerhalb von ``_bind_methods`` gebunden werden, indem Sie Folgendes verwenden:
zh_cn: 常量也可以绑定在 ``_bind_methods`` 中，使用:

source: Properties (set/get)
de: Eigenschaften (set/get)
zh_cn: 属性(设置/获取)

source: Objects export properties, properties are useful for the following:
de: Objekte exportieren Eigenschaften, Eigenschaften sind für Folgendes nützlich:
zh_cn: 对象导出属性，属性对以下内容很有用:

source: Serializing and deserializing the object.
de: Serialisierung und Deserialisierung des Objekts.
zh_cn: 序列化和反序列化对象。

source: Creating a list of editable values for the Object derived class.
de: Erstellen einer Liste editierbarer Werte für die vom Objekt abgeleitete Klasse.
zh_cn: 为Object派生类创建可编辑值列表。

source: Properties are usually defined by the PropertyInfo() class. Usually constructed as:
de: Eigenschaften werden normalerweise durch die Klasse PropertyInfo() definiert. Normalerweise konstruiert als:
zh_cn: 属性通常由PropertyInfo()类定义。 通常构造为:

source: For example:
de: Zum Beispiel:
zh_cn: 例如:

source: This is an integer property, named "amount", hint is a range, range goes from 0 to 49 in steps of 1 (integers). It is only usable for the editor (edit value visually) but won't be serialized.
de: Dies ist eine Ganzzahl-Eigenschaft mit dem Namen "amount". Der Hinweis ist ein Bereich. Der Bereich reicht von 0 bis 49 in Schritten von 1 (Ganzzahlen). Es kann nur für den Editor verwendet werden (Wert visuell bearbeiten), wird jedoch nicht serialisiert.
zh_cn: 这是一个整数属性，名为“amount”，提示是一个范围，范围从0到49，步长为1(整数)。 它仅适用于编辑器(可视化编辑值)，但不会被序列化。

source: Another example:
de: ein weiteres Beispiel:
zh_cn: 另一个示例:

source: This is a string property, can take any string but the editor will only allow the defined hint ones. Since no usage flags were specified, the default ones are PROPERTY_USAGE_STORAGE and PROPERTY_USAGE_EDITOR.
de: Dies ist eine Zeichenfolgeeigenschaft, die eine beliebige Zeichenfolge annehmen kann, der Editor jedoch nur die definierten Hinweiszeichen zulässt. Da keine Verwendungsflags angegeben wurden, sind die Standardflags PROPERTY_USAGE_STORAGE und PROPERTY_USAGE_EDITOR.
zh_cn: 这是一个字符串属性，可以接受任何字符串，但编辑器只允许定义的提示字符串。 由于未指定使用标志，因此默认值为PROPERTY_USAGE_STORAGE和PROPERTY_USAGE_EDITOR。

source: There are plenty of hints and usage flags available in object.h, give them a check.
de: In object.h sind viele Hinweise und Verwendungsflags verfügbar. Überprüfen Sie sie.
zh_cn: object.h中有很多提示和用法标志，给他们一张支票。

source: Properties can also work like C# properties and be accessed from script using indexing, but this usage is generally discouraged, as using functions is preferred for legibility. Many properties are also bound with categories, such as "animation/frame" which also make indexing impossible unless using operator [].
de: Eigenschaften können auch wie C# -Eigenschaften funktionieren und über das Index mithilfe der Indizierung aufgerufen werden. Von dieser Verwendung wird jedoch im Allgemeinen abgeraten, da die Verwendung von Funktionen aus Gründen der Lesbarkeit bevorzugt wird. Viele Eigenschaften sind auch an Kategorien gebunden, z. B. "Animation/Frame", die eine Indizierung nur mit dem Operator [] unmöglich machen.
zh_cn: 属性也可以像C#属性一样工作，并且可以使用索引从脚本访问，但通常不鼓励这种用法，因为使用函数是易读性的首选。 许多属性也与类别绑定，例如“动画/帧”，除非使用operator []，否则也无法建立索引。

source: From ``_bind_methods()``, properties can be created and bound as long as set/get functions exist. Example:
de: Aus ``_bind_methods()`` können Eigenschaften erstellt und gebunden werden, solange set/get-Funktionen vorhanden sind. Beispiel:
zh_cn: 从 ``_bind_methods()`` 开始，只要存在set / get函数，就可以创建和绑定属性。 例:

source: This creates the property using the setter and the getter.
de: Dadurch wird die Eigenschaft mit Hilfe des Setters und des Getters erstellt.
zh_cn: 这将使用setter和getter创建属性。

source: Binding properties using ``_set``/``_get``/``_get_property_list``
de: Bindung von Eigenschaften mit ``_set``/``_get``/``_get_property_list``
zh_cn: 使用``_set`` /``_get`` /``_get_property_list`绑定属性

source: An additional method of creating properties exists when more flexibility is desired (i.e. adding or removing properties on context).
de: Ein zusätzliches Verfahren zum Erstellen von Eigenschaften besteht, wenn mehr Flexibilität gewünscht wird (d.H. Hinzufügen oder Entfernen von Eigenschaften im Kontext).
zh_cn: 当需要更大的灵活性时(即在上下文中添加或删除属性)，存在另一种创建属性的方法。

source: The following functions can be overridden in an Object derived class, they are NOT virtual, DO NOT make them virtual, they are called for every override and the previous ones are not invalidated (multilevel call).
de: Die folgenden Funktionen können in einer von Object abgeleiteten Klasse überschrieben werden. Sie sind NICHT virtuell. Machen Sie sie NICHT virtuell. Sie werden bei jeder Überschreibung aufgerufen und die vorherigen Funktionen werden nicht ungültig gemacht (mehrstufiger Aufruf).
zh_cn: 可以在Object派生类中重写以下函数，它们不是虚拟的，不要将它们设置为虚拟，它们会在每次覆盖时调用，而前一个函数不会失效(多级调用)。

source: This is also a little less efficient since ``p_property`` must be compared against the desired names in serial order.
de: Dies ist auch etwas weniger effizient, da ``p_property`` mit den gewünschten Namen in serieller Reihenfolge verglichen werden muss.
zh_cn: 这也有点效率低，因为必须将 ``p_property`` 与所需的名称按顺序进行比较。

source: Dynamic casting
de: dynamisches Casting
zh_cn: 动态铸造

source: Godot provides dynamic casting between Object-derived classes, for example:
de: Godot bietet zum Beispiel dynamisches Casting zwischen von Objekten abgeleiteten Klassen:
zh_cn: Godot在Object派生类之间提供动态转换，例如:

source: If cast fails, NULL is returned. This system uses RTTI, but it also works fine (although a bit slower) when RTTI is disabled. This is useful on platforms where a small binary size is ideal, such as HTML5 or consoles (with low memory footprint).
de: Wenn die Umwandlung fehlschlägt, wird NULL zurückgegeben. Dieses System verwendet RTTI, funktioniert aber auch einwandfrei (wenn auch etwas langsamer), wenn RTTI deaktiviert ist. Dies ist nützlich auf Plattformen, auf denen eine kleine Binärgröße ideal ist, z. B. HTML5 oder Konsolen (mit geringem Speicher).
zh_cn: 如果强制转换失败，则返回NULL。 这个系统使用RTTI，但是当RTTI被禁用时它也可以正常工作(虽然有点慢)。 这在小型二进制大小理想的平台上非常有用，例如HTML5或控制台(内存占用少)。

source: Signals
de: Signale
zh_cn: 信号

source: Objects can have a set of signals defined (similar to Delegates in other languages). Connecting to them is rather easy:
de: Für Objekte kann eine Reihe von Signalen definiert werden (ähnlich wie bei Delegierten in anderen Sprachen). Die Verbindung zu ihnen ist ziemlich einfach:
zh_cn: 对象可以定义一组信号(类似于其他语言的代理)。 连接它们很容易:

source: The method ``_node_entered_tree`` must be registered to the class using ``ClassDB::bind_method`` (explained before).
de: Die Methode ``_node_entered_tree`` muss bei der Klasse mit ``ClassDB::bind_method`` registriert werden (siehe oben).

source: Adding signals to a class is done in ``_bind_methods``, using the ``ADD_SIGNAL`` macro, for example:
de: Das Hinzufügen von Signalen zu einer Klasse erfolgt in ``_bind_methods``, z.B. mit dem Makro ``ADD_SIGNAL``:
zh_cn: 使用 ``ADD_SIGNAL`` 宏在 ``_bind_methods`` 中添加信号到类中，例如:

source: References
de: Referenzen
zh_cn: 参考

source: :ref:`Reference <class_reference>` inherits from Object and holds a reference count. It is the base for reference counted object types. Declaring them must be done using Ref<> template. For example:
de: :ref:`Referenz <class_reference>` erbt von Object und enthält einen Referenzzähler. Es ist die Basis für referenzgezählte Objekttypen. Die Deklaration muss mit dem Ref<> Template erfolgen. Zum Beispiel:
zh_cn: :ref:`Reference <class_reference>` 继承自Object并保存引用计数。 它是引用计数对象类型的基础。 必须使用Ref <>模板来声明它们。 例如:

source: ``myref`` is reference counted. It will be freed when no more Ref<> templates point to it.
de: ``myref`` wird als Referenz gezählt. Es wird freigegeben, wenn keine Ref<> Templates mehr darauf verweisen.
zh_cn: ``myref``是引用计数。 当没有更多Ref <>模板指向它时，它将被释放。

source: Resources:
de: Ressourcen:
zh_cn: 资源:

source: :ref:`Resource <class_resource>` inherits from Reference, so all resources are reference counted. Resources can optionally contain a path, which reference a file on disk. This can be set with ``resource.set_path(path)``. This is normally done by the resource loader though. No two different resources can have the same path, attempt to do so will result in an error.
de: :ref:`Resource <class_resource>` erbt von Reference, sodass alle Ressourcen als Referenz gezählt werden. Ressourcen können optional einen Pfad enthalten, der auf eine Datei auf der Festplatte verweist. Dies kann mit ``resource.set_path(path)`` eingestellt werden. Dies wird normalerweise vom Ressourcenlader durchgeführt. Keine zwei verschiedenen Ressourcen können denselben Pfad haben. Wenn Sie dies versuchen, wird ein Fehler angezeigt.
zh_cn: :ref:`Resource <class_resource>` 继承自Reference，因此所有资源都被引用计数。 资源可以选择包含引用磁盘上文件的路径。 这可以用 ``resource.set_path(path)`` 设置。 这通常由资源加载器完成。 没有两个不同的资源可以具有相同的路径，尝试这样做会导致错误。

source: Resources without a path are fine too.
de: Ressourcen ohne Pfad sind ebenfalls in Ordnung.
zh_cn: 没有路径的资源也很好。

source: Resource loading
de: Ressourcen laden
zh_cn: 资源加载

source: Resources can be loaded with the ResourceLoader API, like this:
de: Ressourcen können mit der ResourceLoader-API wie folgt geladen werden:
zh_cn: 可以使用ResourceLoader API加载资源，如下所示:

source: If a reference to that resource has been loaded previously and is in memory, the resource loader will return that reference. This means that there can be only one resource loaded from a file referenced on disk at the same time.
de: Wenn zuvor ein Verweis auf diese Ressource geladen wurde und sich im Speicher befindet, gibt der Ressourcenlader diesen Verweis zurück. Dies bedeutet, dass nur eine Ressource gleichzeitig aus einer Datei geladen werden kann, auf die auf der Festplatte verwiesen wird.
zh_cn: 如果先前已加载对该资源的引用并且该内容在内存中，则资源加载器将返回该引用。 这意味着只能从磁盘上引用的文件同时加载一个资源。

source: Resource saving
de: Ressourcen speichern
zh_cn: 资源保存

source: Saving a resource can be done with the resource saver API:
de: Das Speichern einer Ressource kann mit der RessourcenSpeicher-API erfolgen:
zh_cn: 可以使用资源保护程序API保存资源:

source: Instance will be saved. Sub resources that have a path to a file will be saved as a reference to that resource. Sub resources without a path will be bundled with the saved resource and assigned sub-IDs, like "res://someresource.res::1". This also helps to cache them when loaded.
de: Instanz wird gespeichert. Unterressourcen, die einen Pfad zu einer Datei haben, werden als Referenz auf diese Ressource gespeichert. Unterressourcen ohne Pfad werden mit der gespeicherten Ressource und den zugewiesenen Unter-IDs wie "res: //someresource.res::1" gebündelt. Dies hilft auch, sie beim Laden zwischenzuspeichern.
zh_cn: 实例将被保存。 具有文件路径的子资源将保存为对该资源的引用。 没有路径的子资源将与保存的资源和分配的子ID捆绑在一起，例如“res://someresource.res :: 1”。 这也有助于在加载时缓存它们。

source: The method ``_node_entered_tree`` must be registered to the class using ``ClassDB::register_method`` (explained before).
zh_cn: 必须使用``ClassDB :: register_method``(之前解释过)将方法``_node_entered_tree``注册到类中。
