Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/development/cpp/variant_class.po
Languages: de, zh_cn

source: Variant class
de: Variant Klasse
zh_cn: 变量类

source: About
de: Über
zh_cn: 关于

source: Variant is the most important datatype of Godot, it's the most important class in the engine. A Variant takes up only 20 bytes and can store almost any engine datatype inside of it. Variants are rarely used to hold information for long periods of time, instead they are used mainly for communication, editing, serialization and generally moving data around.
de: Variant ist der wichtigste Datentyp von Godot, es ist die wichtigste Klasse in der Engine. Eine Variante benötigt nur 20 Bytes und kann fast jeden Engine-Datentyp darin speichern. Varianten werden selten verwendet, um Informationen über einen längeren Zeitraum zu speichern. Stattdessen werden sie hauptsächlich für die Kommunikation, Bearbeitung, Serialisierung und das allgemeine Verschieben von Daten verwendet.
zh_cn: Variant 是 Godot引 擎中最重要的数据类型，也是引擎中最重要的类。 一个 Variant 对象值占用 20 个字节内存，但它能够存储引擎中几乎所有的数据类型。 Variant 很少用于长时间保存信息，而主要用于通信，编辑，序列化 和移动数据。

source: A Variant can:
de: Ein Variant kann:
zh_cn: 一个变种可以:

source: Store almost any datatype
de: fast jeden Datentyp speichern
zh_cn: 存储任意类型的数据

source: Perform operations between many variants (GDScript uses Variant as its atomic/native datatype).
de: Operationen zwischen vielen Varianten ausführen (GDScript verwendet Variant als atomaren/nativen Datentyp).
zh_cn: 在多个 Variant 对象间执行操作符运算 (GDScript 使用 Variant 作为原生最基础的数据类型)。

source: Be hashed, so it can be compared quickly to other variants
de: gehasht sein, damit sie schnell mit anderen Varianten verglichen werden können
zh_cn: 经过哈希处理，因此它能够与其他 Variant 对象进行快速比较

source: Be used to convert safely between datatypes
de: verwendet werden, um sicher zwischen Datentypen zu konvertieren
zh_cn: 用于在数据类型之间安全地转换

source: Be used to abstract calling methods and their arguments (Godot exports all its functions through variants)
de: werden genutzt um aufrufende Methoden und ihre Argumente zu abstrahieren (Godot exportiert alle seine Funktionen über Varianten)
zh_cn: 用于抽象调用方法及其参数(Godot通过变体导出其所有函数)

source: Be used to defer calls or move data between threads.
de: Werden verwendet, um Anrufe zu verschieben oder Daten zwischen Threads zu verschieben.
zh_cn: 用于推迟调用或在线程之间交换数据。

source: Be serialized as binary and stored to disk, or transferred via network.
de: Als binär serialisiert und auf der Festplatte gespeichert oder über das Netzwerk übertragen werden.
zh_cn: 支持序列化为二进制格式，能被存储到磁盘或通过网络进行传输。

source: Be serialized to text and use it for printing values and editable settings.
de: in Text serialisiert und verwenden dies zum Drucken von Werten und bearbeitbaren Einstellungen.
zh_cn: 能被序列化为文本，用于输出值和编辑配置。

source: Work as an exported property, so the editor can edit it universally.
de: Arbeitet wie eine exportierte Eigenschaft, damit der Editor sie universell bearbeiten kann.
zh_cn: 作为导出的属性， 这样编辑器能够使用统一的方式进行修改值。

source: Be used for dictionaries, arrays, parsers, etc.
de: Wird für Wörterbücher, Arrays, Parser usw. verwendet.
zh_cn: 能被用于字典、数组、解析器等等常用工具中。

source: Basically, thanks to the Variant class, writing Godot itself was a much, much easier task, as it allows for highly dynamic constructs not common of C++ with little effort. Become a friend of Variant today.
de: Dank der Variant-Klasse war das Schreiben von Godot selbst eine viel, viel einfachere Aufgabe, da es mit wenig Aufwand hochdynamische Konstrukte ermöglicht, die in C++ nicht üblich sind. Werden Sie noch heute ein Freund von Variant.
zh_cn: 基本上归功于Variant类，编写 Godot 本身变成了一件更加轻松的工作，因为它允许使用 C++ 中不常见的高度动态构造，并只需要写很少的代码。 今天就和 Variant 成为朋友吧。

source: References:
de: Referenzen:
zh_cn: 参阅资料:

source: Containers: Dictionary and Array
de: Container: Wörterbuch und Array
zh_cn: 容器: 字典(Dictionary) 和 数组(Array)

source: Both are implemented using variants. A Dictionary can match any datatype used as key to any other datatype. An Array just holds an array of Variants. Of course, a Variant can also hold a Dictionary and an Array inside, making it even more flexible.
de: Beide werden mit Varianten implementiert. Ein Wörterbuch kann jeden Datentyp der als Schlüssel verwendet wird mit jedem anderen Datentyp abgleichen. Ein Array enthält nur ein Feld von Varianten. Natürlich kann ein Variant auch ein Wörterbuch und ein Array enthalten, was es noch flexibler macht.
zh_cn: 他们都是使用 Variant 实现的。

source: Modifications to a container will modify all references to it. A Mutex should be created to lock it if multi threaded access is desired.
de: Durch Änderungen an einem Container werden alle Verweise darauf geändert. Es sollte ein Mutex erstellt werden um ihn zu sperren, wenn ein Multithread-Zugriff gewünscht wird.
zh_cn: 对容器的修改将修改对它的所有引用。 如果需要多线程访问，应创建互斥锁以锁定它。

source: Copy-on-write (COW) mode support for containers was dropped with Godot 3.0.
de: Die Unterstützung des COW-Modus (Copy-on-Write) für Container wurde mit Godot 3.0 eingestellt.
zh_cn: Godot 3.0 删除了对容器的写时拷贝(COW)模式支持。
