Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/introduction.po
Languages: de

source: Introduction to the animation features
de: Einführung in die Animationsfunktionen

source: Overview
de: Übersicht

source: The :ref:`class_AnimationPlayer` node allows you to create anything from simple to complex animations.
de: Der :ref:`class_AnimationPlayer`-Node erlaubt es, allerlei Animationen zu erstellen - von ganz einfachen bis hin zu recht komplexen Abläufen.

source: In this guide you learn to:
de: In dieser Einführung lernst Du:

source: Work with the Animation Panel
de: mit dem Animationspanel zu arbeiten

source: Animate any property of any node
de: eine Eigenschaft eines beliebigen Nodes zu animieren

source: Create a simple animation
de: eine simple Animation zu erstellen

source: Call functions with the powerful Call Function Tracks
de: auf Funktionen mithilfe der Funktionsaufrufspur zuzugreifen

source: In Godot, you can animate anything available in the Inspector, such as Node transforms, sprites, UI elements, particles, visibility and color of materials, and so on. You can also modify values of script variables and call any function.
de: In Godot können Sie jeden Wert im Inspektor animieren. Eine Animation entsteht, indem der Wert oder Zustand einer Eigenschaft zeitabhängig verändert wird. So lässt sich alles Mögliche animieren: Sprites, UI-Elemente, Partikel, die Sichtbarkeit sowie Texturfarben. Aber nicht nur: Sie können jede Funktion eines Skripts aus dem AnimationPlayer aufrufen und so den weiteren Spielverlauf steuern.

source: Create an AnimationPlayer node
de: Einen AnimationPlayer-Node anlegen

source: To use the animation tools we first have to create an :ref:`class_AnimationPlayer` node.
de: Um die Werkzeuge zur Animation zu verwenden, benötigen wir zunächst einen :ref:`class_AnimationPlayer`-Node.

source: The AnimationPlayer node type is the data container for your animations. One AnimationPlayer node can hold multiple animations, that can automatically transition to one another.
de: Der AnimationPlayer-Node dient als Container für Animationsabfolgen. Es können mehrere Animationen in einem AnimationPlayer-Node enthalten sein, sodass es einen automatischen Übergang von der einen zur anderen gibt.

source: The AnimationPlayer node
de: Der AnimationPlayer-Node

source: After creating one click on the AnimationPlayer node in the Node tab to open the Animation Panel at the bottom of the viewport.
de: Klicken Sie nach dem Erstellen auf den AnimationPlayer-Node im Node-Tab, um das Animationspanel im Ansichtsbereich unten zu öffnen.

source: The animation panel position
de: Das Animationspanel in der Bodenleiste

source: It consists of four parts:
de: Es besteht aus vier Bereichen:

source: The animation panel
de: Das Animationspanel

source: Animation controls (i.e. add, load, save, and delete animations)
de: Bedienfelder zur Organisation von Animationen (d.h. hinzufügen, laden, speichern und löschen von Animationen)

source: The tracks listing
de: die Liste der Animationsspuren

source: The timeline with keyframes
de: die Zeitleiste mit angelegten Schlüsselbildern (Keyframes)

source: The timeline and track controls, where you can zoom the timeline and edit tracks for example.
de: die Bedienfelder zur Verkleinerung/Vergrößerung der Zeitleiste sowie Bearbeitung der Spuren.

source: Computer animation relies on keyframes
de: Computeranimation basiert auf Keyframes

source: A keyframe defines the value of a property at a certain point in time.
de: Ein Keyframe definiert den Wert einer Eigenschaft zu einem bestimmten Zeitpunkt.

source: Keyframes in Godot
de: Schlüsselframes in Godot

source: The engine interpolates values between keyframes, resulting in a gradual change in values over time.
de: Die Engine interpoliert Werte zwischen Keyframes, was zu einer allmählichen Veränderung der Werte im Laufe der Zeit führt.

source: Two keyframes are all it takes to obtain a smooth motion
de: Zwei Keyframes genügen, um eine reibungslose Bewegung zu erreichen

source: The timeline in the animation panel
de: Die Zeitleiste im Animationsfenster

source: Example of Normal animation tracks
de: Beispiel für normale Animationsspuren

source: Tutorial: Creating a simple animation
de: Anleitung: Erstellen einer einfachen Animation

source: Scene setup
de: Eine Szene einrichten

source: Our scene setup
de: Unser Szenenaufbau

source: Add a new animation
de: Fügen Sie eine neue Animation hinzu

source: Adding a track
de: Hinzufügen einer Spur

source: To add a new track for our sprite, select it and take a look in the toolbar:
de: Um eine neue Spur für unser Sprite hinzuzufügen, wählen Sie sie aus und sehen Sie in der Symbolleiste nach:

source: Convenience buttons
de: Komfortable Schaltflächen

source: These switches and buttons allow you to add keyframes for the selected node's location, rotation, and scale respectively.
de: Mit diesen Schaltern und Schaltflächen können Sie Keyframes für die Position, Rotation und Skalierung des ausgewählten Nodes hinzufügen.

source: Deselect rotation, because we are only interested in the location of our sprite for this tutorial and click on the key button.
de: Deaktivieren Sie die Rotation, da wir für diese Anleitung nur an der Position unseres Sprites interessiert sind und klicken Sie auf die Schlüssel-Schaltfläche.

source: As we don't have a track already set up for the transform/location property, Godot asks whether it should set it up for us. Click **Create**.
de: Da wir noch keine Spur für die Transformation/Lokation-Eigenschaft eingerichtet haben, fragt Godot, ob er es für uns einrichten soll. Klicken Sie auf **Erstellen**.

source: This creates a new track and our first keyframe at the beginning of the timeline:
de: Dadurch entsteht eine neuer Spur und unser erster Keyframe am Anfang der Zeitachse:

source: The sprite track
de: Die Sprite-Spur

source: The second keyframe
de: Der zweite Keyframe

source: Now we need to set the destination where our sprite should be headed and how much time it takes to get there.
de: Jetzt müssen wir das Ziel festlegen, wohin unser Sprite gehen soll und wie lange es dauert, bis es dort ankommt.

source: Let's say, we want it to take 2 seconds to go to the other point. By default the animation is set to last only 1 second, so change this in the timeline controls in animation panel's lower panel to 2.
de: Nehmen wir an wir möchten, dass es 2 Sekunden dauert, um zum anderen Punkt zu kommen. Standardmäßig dauert die Animation nur 1 Sekunde. Ändern Sie dies in den Steuerelementen der Zeitleiste im unteren Bereich des Animationsfensters auf 2.

source: Animation length
de: Animationslänge

source: Click on the timeline header near the 2-second mark and move the sprite to the target destination on the right side.
de: Klicken Sie auf die Kopfzeile der Zeitleiste in der Nähe der 2-Sekunden-Marke und bewegen Sie das Sprite zum Zielort auf der rechten Seite.

source: Again, click the key button in the toolbar. This creates our second keyframe.
de: Klicken Sie erneut auf die Schaltfläche in der Symbolleiste. Dadurch wird unser zweiter Keyframe erstellt.

source: Run the animation
de: Die Animation starten

source: Click on the "Play from beginning" (|Play from beginning|) button.
de: Klicken Sie auf die Schaltfläche "Von Anfang an spielen" (|Von Anfang an spielen|).

source: Yay! Our animation runs:
de: JA! Unsere Animation läuft:

source: The animation
de: Die Animation

source: Back and forth
de: Hin und her

source: Godot has an additional feature here. Like said before, Godot always calculates the frames between two keyframes. In a loop, the first keyframe is also the last keyframe, if no keyframe is specified at the end.
de: Godot hat hier eine zusätzliche Funktion. Wie bereits erwähnt, berechnet Godot immer die Frames zwischen zwei Keyframes. In einer Schleife ist der erste Keyframe auch der letzte, wenn am Ende kein weiterer Keyframe angegeben wird.

source: Animation loop
de: Animationsschleife

source: If you set the animation length to 4 seconds now, the animation moves back and forth. You can change this behavior if you change the track's loop mode. This is covered in the next chapter.
de: Wenn Sie jetzt die Animationslänge auf 4 Sekunden einstellen, bewegt sich die Animation vor und zurück. Sie können dieses Verhalten ändern, wenn Sie den Schleifenmodus der Spur ändern. Dies wird im nächsten Kapitel behandelt.

source: Track settings
de: Spur-Einstellungen

source: Each track has a settings panel at the end, where you can set the update mode, the track interpolation, and the loop mode.
de: Jede Spur verfügt über ein Einstellungsfenster am Ende, in dem Sie den Aktualisierungsmodus, die Spurinterpolation und den Schleifenmodus festlegen können.

source: The update mode of a track tells Godot when to update the property values. This can be:
de: Der Aktualisierungsmodus einer Spur teilt Godot mit, wann die Eigenschaftswerte aktualisiert werden sollen. Dies kann sein:

source: Continuous: Update the property on each frame
de: Fortlaufend: Aktualisiert die Eigenschaft für jeden Frame

source: Discrete: Only update the property on keyframes
de: Diskret: Aktualisiert die Eigenschaft nur für Keyframes

source: Trigger: Only update the property on keyframes or triggers
de: Trigger: Aktualisiert die Eigenschaft nur für Keyframes oder Trigger

source: Capture: The current value of a property is remembered, and it will blend with the first animation key found
de: Erfassen: Der aktuelle Wert einer Eigenschaft wird gespeichert und mit dem ersten gefundenen Animationsschlüssel vermischt

source: Track mode
de: Spur-Modus

source: In normal animations, you usually use "Continuous". The other types are used to script complex animations.
de: In normalen Animationen verwenden Sie normalerweise "Fortlaufend". Die anderen Typen werden verwendet, um komplexe Animationen zu skripten.

source: The interpolation tells Godot how to calculate the frame values between the keyframes. These interpolation modes are supported:
de: Die Interpolation sagt Godot, wie die Frame-Werte zwischen den Keyframes berechnet werden sollen. Diese Interpolationsmodi werden unterstützt:

source: Nearest: Set the nearest keyframe value
de: Nächstgelegene: Legen Sie den nächsten Keyframe-Wert fest

source: Linear: Set the value based on a linear function calculation between the two keyframes
de: Linear: Legen Sie den Wert basierend auf einer linearen Funktionsberechnung zwischen den beiden Keyframes fest

source: Cubic: Set the value based on a cubic function calculation between the two keyframes
de: Kubisch: Legen Sie den Wert basierend auf einer Berechnung der kubischen Funktion zwischen den beiden Keyframes fest

source: Track interpolation
de: Spur-Interpolation

source: Cubic interpolation leads to a more natural movement, where the animation is slower at a keyframe and faster between keyframes. This is usually used for character animation. Linear interpolation creates more of a robotic movement.
de: Die kubische Interpolation führt zu einer natürlicheren Bewegung, wobei die Animation bei einem Keyframe langsamer und zwischen den Keyframes schneller ist. Dies wird normalerweise für Charakteranimation verwendet. Die lineare Interpolation führt zu einer eher roboterhaften Bewegung.

source: Godot supports two loop modes, which affect the animation if it's set to loop:
de: Godot unterstützt zwei Schleifenmodi, die sich auf die Animation auswirken, wenn sie auf Schleife eingestellt ist:

source: Loop modes
de: Schleifenmodi

source: Clamp loop interpolation: When this is selected, the animation stops after the last keyframe for this track. When the first keyframe is reached again, the animation will reset to its values.
de: Klemmschleifen-Interpolation: Wenn dies ausgewählt ist, stoppt die Animation nach dem letzten Keyframe für diese Spur. Wenn das erste Keyframe wieder erreicht wird, wird die Animation auf ihre Werte zurückgesetzt.

source: Wrap loop interpolation: When this is selected, Godot calculates the animation after the last keyframe to reach the values of the first keyframe again.
de: Wrap-Loop-Interpolation: Wenn diese Option ausgewählt ist, berechnet Godot die Animation nach dem letzten Keyframe, um wieder die Werte des ersten Keyframes zu erreichen.

source: Keyframes for other properties
de: Keyframes für andere Eigenschaften

source: Godot doesn't restrict you to only edit transform properties. Every property can be used as a track where you can set keyframes.
de: Godot beschränkt Sie nicht darauf, nur Transformationseigenschaften zu bearbeiten. Jede Eigenschaft kann als eine Spur verwendet werden, in der Sie Keyframes festlegen können.

source: If you select your sprite while the animation panel is visible, you get a small keyframe button for all the sprite's properties. Click on this button and Godot automatically adds a track and keyframe to the current animation.
de: Wenn Sie Ihr Sprite auswählen, während das Animationspanel sichtbar ist, erhalten Sie einen kleinen Keyframe-Button für alle Eigenschaften des Sprites. Wenn Sie auf diese Schaltfläche klicken, fügt Godot automatisch eine Spur und ein Keyframe zur aktuellen Animation hinzu.

source: Edit keyframes
de: Keyframes bearbeiten

source: For advanced use and to edit keyframes in detail, You can click on them to bring up the keyframe editor in the inspector. You can use this to directly edit its values.
de: Zur erweiterten Verwendung und zum detaillierten Bearbeiten von Keyframes können Sie darauf klicken, um den Keyframe-Editor im Inspektor aufzurufen. Sie können dies verwenden, um die Werte direkt zu bearbeiten.

source: Keyframe editor editing a key
de: Keyframe-Editor zum Bearbeiten eines Schlüssels

source: Additionally, you can also edit the easing value for this keyframe by clicking and dragging the easing setting. This tells Godot, how to change the property values when it reaches this keyframe.
de: Darüber hinaus können Sie den Beschleunigungswert für diesen Keyframe bearbeiten, indem Sie auf die Beschleunigungseinstellung klicken und sie ziehen. Dies teilt Godot mit, wie die Eigenschaftswerte geändert werden sollen, wenn dieser Keyframe erreicht wird.

source: You usually tweak your animations this way, when the movement doesn't "look right".
de: Normalerweise optimieren Sie Ihre Animationen auf diese Weise, wenn die Bewegung nicht "richtig aussieht".

source: Advanced: Call Method tracks
de: Fortgeschritten: Aufruf von Methodenspuren

source: Godot's animation engine doesn't stop here. If you're already comfortable with Godot's scripting language :ref:`doc_gdscript` and :doc:`/classes/index` you know that each node type is a class and has a bunch of callable methods.
de: Godots Animations-Engine hört hier nicht auf. Wenn Sie bereits mit Godots Skriptsprache :ref:`doc_gdscript` und :doc:`/classes/index` vertraut sind, wissen Sie, dass jeder Node-Typ eine Klasse ist und über eine Reihe von aufrufbaren Methoden verfügt.

source: For example, the :ref:`class_AudioStreamPlayer` node type has a method to play an audio stream.
de: Beispielsweise verfügt der Node-Typ :ref:`class_AudioStreamPlayer` über eine Methode zum Abspielen eines Audiostreams.

source: Wouldn't it be great to use a method at a specific keyframe in an animation? This is where "Call Method Tracks" come in handy. These tracks reference a node again, this time without a reference to a property. Instead, a keyframe holds the name and arguments of a method, that Godot should call when it reaches this keyframe.
de: Wäre es nicht toll, eine Methode an einem bestimmten Keyframe in einer Animation zu verwenden? Hier sind "Call Method Tracks" praktisch. Diese Spuren verweisen erneut auf einen Node, diesmal ohne Verweis auf eine Eigenschaft. Stattdessen enthält ein Keyframe den Namen und die Argumente einer Methode, die Godot aufrufen sollte, wenn er diesen Keyframe erreicht.

source: To demonstrate, we're going to use a call method track to play audio at a specific keyframe. Normally to play audio you should use an audio track, but for the sake of demonstrating methods we're going to do it this way.
de: Zur Demonstration verwenden wir eine Aufrufmethode, um Audio in einem bestimmten Keyframe abzuspielen. Normalerweise sollten Sie zum Abspielen von Audio eine Audiospur verwenden, aber um die Methoden zu demonstrieren, werden wir dies auf diese Weise tun.

source: Add a :ref:`class_AudioStreamPlayer` to the Scene Tree and setup a stream using an audio file you put in your project.
de: Fügen Sie dem Szenenbaum ein :ref:`class_AudioStreamPlayer` hinzu und richten Sie einen Stream mit einer Audiodatei ein, die Sie in Ihr Projekt eingefügt haben.

source: Click on "Add track" (|Add track|) on the animation panel's track controls.
de: Klicken Sie auf "Spur hinzufügen" (|Spur hinzufügen|) in der Spursteuerung des Animationspanels.

source: Select "Add Call Method Track" from the list of possible track types.
de: Wählen Sie "Anrufmethode-Spur hinzufügen" aus der Liste der möglichen Spur-Typen.

source: Add Call Method Track
de: Aufrufmethoden-Spur hinzufügen

source: Select the :ref:`class_AudioStreamPlayer` node in the selection window. Godot adds the track with the reference to the node.
de: Wählen Sie im Auswahlfenster den Node :ref:`class_AudioStreamPlayer`. Godot fügt die Spur mit dem Verweis auf den Node hinzu.

source: Select AudioStreamPlayer
de: AudioStreamPlayer auswählen

source: Right click the timeline where Godot should play the sample and click the "Insert Key" option. This will bring up a list of methods that can be called for the AudioStreamPlayer node. Select the first one.
de: Klicken Sie mit der rechten Maustaste auf die Zeitachse, in der Godot das Beispiel abspielen soll und klicken Sie auf die Option "Schlüssel einfügen". Dadurch wird eine Liste der Methoden angezeigt, die für den AudioStreamPlayer-Node aufgerufen werden können. Wählen Sie die erste Methode aus.

source: When Godot reaches the keyframe, Godot calls the :ref:`class_AudioStreamPlayer` node's "play" function and the stream plays.
de: Wenn Godot den Keyframe erreicht, ruft Godot die "Play"-Funktion des Nodes :ref:`class_AudioStreamPlayer` auf und der Stream wird abgespielt.

source: You can change its position by dragging it on the timeline, you can also click on the keyframe and use the keyframe settings in the inspector.
de: Sie können die Position ändern, indem Sie sie auf die Timeline ziehen. Sie können auch auf den Keyframe klicken und die Keyframe-Einstellungen im Inspektor verwenden.
