Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/introduction_2d.po
Languages: es, fr, ja

source: Introduction to the 2D animation features
es: Introducción a las características de la animación 2D
fr: Introduction aux fonctions de l'animation 2D
ja: 2Dアニメーション機能の紹介

source: Overview
es: Sinopsis
fr: Vue d'ensemble
ja: 概要

source: The :ref:`class_AnimationPlayer` node allows you to create anything from simple to complex animations.
es: El nodo :ref:`class_AnimationPlayer` permite crear desde animaciones simples hasta complejas.
fr: Le nœud :ref:`class_AnimationPlayer` vous permet de créer des animations simples ou complexes.
ja: :ref:`class_AnimationPlayer` ノードを使用すると、単純なアニメーションから複雑なアニメーションまで何でも作成できます。

source: In this guide you learn to:
es: En esta guía aprenderás a hacerlo:
fr: Dans ce guide, vous apprendrez à :
ja: このガイドでは、次のことを学びます:

source: Work with the Animation Panel
es: Trabajar con el Panel de Animación
fr: Travailler avec le panneau d'animation
ja: アニメーションパネルを使用する

source: Animate any property of any node
es: Animar cualquier propiedad de cualquier nodo
fr: Animer n'importe quelle propriété de n'importe quel nœud
ja: 任意のノードのプロパティをアニメーション化する

source: Create a simple animation
es: Crear una animación simple
fr: Créer une animation simple
ja: シンプルなアニメーションを作成する

source: Call functions with the powerful Call Function Tracks
es: Funciones de llamada con la potente Pista de Llamada a Funciones
fr: Appeler des fonctions avec la puissante fonction d'appel Call Function Tracks
ja: 強力な関数呼び出しトラックで関数を呼び出す

source: In Godot, you can animate anything available in the Inspector, such as Node transforms, sprites, UI elements, particles, visibility and color of materials, and so on. You can also modify values of script variables and call any function.
fr: Dans Godot, vous pouvez animer tout ce qui est disponible dans l'inspecteur, comme les transformations de nœuds, les sprites, les éléments d'interface utilisateur, les particules, la visibilité et la couleur des matériaux, etc. Vous pouvez également modifier les valeurs des variables de script et appeler n'importe quelle fonction.
ja: Godotでは、ノードの幾何学変換、スプライト、UI要素、パーティクル、マテリアルの可視性と色など、インスペクタで利用可能なすべての項目をアニメーション化できます。スクリプト変数の値を変更して、任意の関数を呼び出すこともできます。

source: Create an AnimationPlayer node
es: Crear un nodo AnimationPlayer
fr: Créer un nœud AnimationPlayer
ja: AnimationPlayerノードを作成する

source: To use the animation tools we first have to create an :ref:`class_AnimationPlayer` node.
es: Para usar las herramientas de animación primero tenemos que crear un nodo :ref:`class_AnimationPlayer`.
fr: Pour utiliser les outils d'animation, nous devons d'abord créer un nœud :ref:`class_AnimationPlayer`.
ja: アニメーションツールを使用するには、最初に :ref:`class_AnimationPlayer` ノードを作成する必要があります。

source: The AnimationPlayer node type is the data container for your animations. One AnimationPlayer node can hold multiple animations, that can automatically transition to one another.
es: El tipo de nodo AnimationPlayer es el container de datos para las animaciones. Un nodo AnimationPlayer puede contener varias animaciones, que pueden hacer una transición automática entre estas.
fr: Le type de nœud AnimationPlayer est le conteneur de données pour vos animations. Un nœud AnimationPlayer peut contenir plusieurs animations, qui peuvent passer automatiquement les unes aux autres.
ja: AnimationPlayerノード型は、アニメーションのデータコンテナーです。 1つのAnimationPlayerノードは複数のアニメーションを保持でき、自動的に相互に移行できます。

source: The AnimationPlayer node
es: El nodo AnimationPlayer
fr: Le nœud AnimationPlayer
ja: AnimationPlayerノード

source: After creating one click on the AnimationPlayer node in the Node tab to open the Animation Panel at the bottom of the viewport.
fr: Après avoir créé un clic sur le nœud AnimationPlayer dans l'onglet Nœud pour ouvrir le panneau Animation en bas de la fenêtre d'affichage.
ja: 作成後、[ノード]タブのAnimationPlayerノードをクリックして、ビューポートの下部にあるアニメーションパネルを開きます。

source: The animation panel position
es: La posición del panel de animación
fr: La position du panneau d'animation
ja: アニメーションパネルの位置

source: It consists of four parts:
fr: Il se compose de quatre parties :
ja: 次の4つの部分で構成されます:

source: The animation panel
es: El panel de animación
fr: Le panneau d'animation
ja: アニメーションパネル

source: Animation controls (i.e. add, load, save, and delete animations)
es: Controles de animación (es decir, añadir, cargar, guardar y eliminar animaciones)
fr: Contrôles d'animation (c.-à-d. ajouter, charger, enregistrer et supprimer des animations)
ja: アニメーションコントロール (アニメーションの追加、読み込み、保存、削除など)

source: The tracks listing
es: El listado de pistas
fr: La liste des pistes
ja: トラックリスト

source: The timeline with keyframes
es: La línea de tiempo con fotogramas clave
fr: La timeline avec les clés d'animation
ja: キーフレーム付きのタイムライン

source: The timeline and track controls, where you can zoom the timeline and edit tracks for example.
es: Los controles de línea de tiempo y pista, donde se puede ampliar la línea de tiempo y editar pistas, por ejemplo.
fr: Les contrôles de timeline et de piste, où vous pouvez zoomer sur la timeline et éditer les pistes par exemple.
ja: タイムラインとトラックコントロールでは、タイムラインをズームしたり、トラックを編集したりできます。

source: Computer animation relies on keyframes
es: La animación por computadora se basa en fotogramas clave
fr: L'animation par ordinateur repose sur des clés d'animation
ja: コンピューターアニメーションはキーフレームに依存しています

source: A keyframe defines the value of a property at a certain point in time.
es: Un fotograma clave define el valor de una propiedad en un momento determinado.
fr: Une clé d'animation définit la valeur d'une propriété à un moment donné.
ja: キーフレームは、特定の時点でのプロパティの値を定義します。

source: Diamond shapes represent keyframes in the timeline. A line between two keyframes indicates that the value hasn't changed.
fr: Les formes en diamant représentent les clés d'animation dans la timeline. Une ligne entre deux images clés indique que la valeur n'a pas changé.
ja: ひし形のシェイプは、タイムラインのキーフレームを表します。2 つのキーフレーム間の線は、値が変更されていないことを示します。

source: Keyframes in Godot
es: Fotogramas clave en Godot
fr: clés d'animation dans Godot
ja: Godotのキーフレーム

source: The engine interpolates values between keyframes, resulting in a gradual change in values over time.
es: El motor interpola valores entre fotogramas clave, lo que da como resultado un cambio gradual de los valores a lo largo del tiempo.
fr: Le moteur interpole les valeurs entre les clés d'animation résultant en un changement graduel des valeurs au cours du temps.
ja: エンジンはキーフレーム間で値を補間するため、時間の経過とともに値が徐々に変化します。

source: Two keyframes are all it takes to obtain a smooth motion
es: Dos fotogramas clave son todo lo que se necesita para obtener un movimiento suave
fr: Deux clés d'animation sont tout ce qu'il faut pour obtenir un mouvement fluide
ja: 滑らかな動きを得るために必要な2つのキーフレーム

source: The timeline lets you insert keyframes and change their timing. It also defines how long the animation is.
es: La línea de tiempo permite insertar fotogramas clave y cambiar su timming. También define la duración de la animación.
fr: La timeline vous permet d'insérer des clés d'animation et de changer leur timing. Elle définit aussi la durée de l'animation.
ja: タイムラインを使用すると、キーフレームを挿入してタイミングを変更できます。また、アニメーションの長さも定義します。

source: The timeline in the animation panel
es: La línea de tiempo en el panel de animación
fr: La timeline dans le panneau d'animation
ja: アニメーションパネルのタイムライン

source: Each line of the Animation Panel is an animation track. Normal and Transform tracks reference node properties. Their name or id is a path to the node and the affected property.
es: Cada línea del Panel de Animación es una pista de animación. Normal y Transform rastrea las propiedades del nodo de referencia. Su nombre o id es una ruta al nodo y a la propiedad afectada.
fr: Chaque ligne dans le panneau d'animation est une piste d'animation. Les pistes de type Normal et Transform référencent les propriétés du nœud. Leurs nom ou identifiant est un chemin vers le nœud et sa propriété affectée.
ja: アニメーションパネルの各行はアニメーショントラックです。[標準]および[幾何学変換]トラックはノードのプロパティを参照します。それらの名前またはIDは、ノードと影響を受けるプロパティへのパスです。

source: Example of Normal animation tracks
es: Ejemplo de pistas de animación normales
fr: Exemple de piste d'animation de type Normal
ja: 標準のアニメーショントラックの例

source: If you animate the wrong property, you can edit a track's path anytime. Double click on it and type the new path. Play the animation using the "Play from beginning" button |Play from beginning| (or pressing :kbd:`Shift + D` on keyboard) to see the changes instantly.
fr: Si vous animez la mauvaise propriété, vous pouvez éditer le chemin d'une piste à tout moment. Double-cliquez dessus et tapez le nouveau chemin. Lire l'animation à l'aide du bouton "Lire du début" |Lire du début| (Raccourci par défaut :kbd:`Shift + D`) pour voir les changements instantanément.
ja: 間違ったプロパティをアニメートした場合は、いつでもトラックのパスを修正できます。それをダブルクリックして、新しいパスを入力します。[最初から再生]ボタンを使用して(またはキーボードの :kbd:`Shift + D` を押して)アニメーションを再生すると、変更内容が即座に表示されます。

source: Tutorial: Creating a simple animation
es: Tutorial: Crear una animación simple
fr: Tutoriel : Création d'une animation simple
ja: チュートリアル: シンプルなアニメーションの作成

source: Scene setup
es: Configuración de la escena
fr: Configuration de la scène
ja: シーンの設定

source: For this tutorial, we'll create an AnimationPlayer node and a sprite node as its child.
fr: Pour ce tutoriel, nous allons créer un nœud d'AnimationPlayer et un nœud sprite qui sera son enfant.

source: Our scene setup
es: Nuestra configuración de la escena
fr: Notre configuration de scène
ja: シーンのセットアップ

source: The sprite holds an image texture. We animate that sprite to move between two points on the screen. For this tutorial, use the default Godot icon as the sprite's texture. As a starting point, move the sprite to a left position on the screen.
fr: Le sprite contient une texture d'image. Nous animons ce sprite pour qu'il se déplace entre deux points sur l'écran. Pour ce tutoriel, utilisez l'icône Godot par défaut comme texture du sprite. Comme point de départ, déplacez le sprite vers une position à gauche à l'écran.

source: Adding animated nodes as children to the AnimationPlayer node is not required, but it is a nice way of distinguishing animated nodes from non-animated nodes in the Scene Tree.
es: No es necesario añadir nodos animados como hijos al nodo AnimationPlayer, pero es una buena forma de distinguir los nodos animados de los nodos no animados en el árbol de escenas.
fr: Il n'est pas nécessaire d'ajouter les nœuds animés en tant qu'enfants au nœud AnimationPlayer, mais c'est un bon moyen de distinguer les nœuds animés des nœuds non animés dans l'arbre des scènes.
ja: アニメーションするノードを子としてAnimationPlayerノードに追加する必要はありませんが、シーンツリー内のアニメーションするノードと非アニメーションノードを区別するのに便利な方法です。

source: Select the AnimationPlayer node, then click the "Animation" button in the animation editor. From the list select "New" (|Add Animation|) to add a new animation. And Enter a name for the animation in the dialog box.
fr: Sélectionnez le nœud AnimationPlayer, puis cliquez sur le bouton "Animation" dans l'éditeur d'animation. Dans la liste, sélectionnez "Nouveau" (|Add Animation|) pour ajouter une nouvelle animation. Et Saisissez un nom pour l'animation dans la boîte de dialogue.
ja: AnimationPlayerノードを選択し、アニメーションエディタの[アニメーション]ボタンをクリックします。リストから[新規] (|Add Animation|)を選択して、新しいアニメーションを追加します。そして、ダイアログボックスにアニメーションの名前を入力します。

source: Add a new animation
es: Añadir una nueva animación
fr: Ajouter une nouvelle animation
ja: 新しいアニメーションの追加

source: Adding a track
es: Añadir una pista
fr: Ajout d'une piste
ja: トラックの追加

source: To add a new track for our sprite, select it and take a look in the toolbar:
es: Para añadir una nueva pista para nuestro sprite, selecciónala y echa un vistazo a la barra de herramientas:
fr: Pour ajouter une nouvelle piste pour notre sprite, sélectionnez-le et regardez dans la barre d'outils :
ja: スプライトに新しいトラックを追加するには、それを選択してツールバーで見てください:

source: Convenience buttons
es: Botones de conveniencia
fr: Les boutons convénients
ja: 便利なボタン

source: These switches and buttons allow you to add keyframes for the selected node's location, rotation, and scale respectively.
es: Estos interruptores y botones permiten agregar fotogramas clave para la ubicación, rotación y escala del nodo seleccionado, respectivamente.
fr: Ces commutateurs et boutons vous permettent d'ajouter des clés d'animation pour l'emplacement, la rotation et l'échelle du nœud sélectionné respectivement.
ja: これらのスイッチとボタンを使用すると、選択したノードの位置、回転、スケールにそれぞれキーフレームを追加できます。

source: Deselect rotation, because we are only interested in the location of our sprite for this tutorial and click on the key button.
es: Deselecciona rotación, porque sólo nos interesa la ubicación de nuestro sprite para este tutorial y haz clic en el botón con forma de llave.
fr: Désélectionnez la rotation, car nous ne sommes intéressés que par l'emplacement de notre sprite pour ce tutoriel et cliquez sur le bouton clé.
ja: このチュートリアルではスプライトの位置にのみ関心があるため、回転の選択を解除し、キーボタンをクリックします。

source: As we don't have a track already set up for the transform/location property, Godot asks whether it should set it up for us. Click **Create**.
fr: Comme nous n'avons pas de piste déjà configurée pour la propriété transform/location, Godot demande, si il doit la configurée pour nous. Cliquez sur **Créer**.

source: This creates a new track and our first keyframe at the beginning of the timeline:
es: Esto crea una nueva pista y nuestro primer fotograma clave al principio de la línea de tiempo:
fr: Cela crée une nouvelle piste et notre première clé d'animation au début de la timeline :
ja: これにより、タイムラインの先頭に新しいトラックと最初のキーフレームが作成されます:

source: The sprite track
es: La pista de sprite
fr: La piste de sprite
ja: スプライトトラック

source: The second keyframe
es: El segundo fotograma clave
fr: La deuxième clé d'animation
ja: 2番目のキーフレーム

source: Now we need to set the destination where our sprite should be headed and how much time it takes to get there.
es: Ahora tenemos que establecer el destino al que debe dirigirse nuestro sprite y cuánto tiempo se tarda en llegar allí.
fr: Maintenant, nous devons définir la destination vers laquelle notre sprite doit se diriger et combien de temps il lui faut pour y arriver.
ja: ここで、スプライトが向かうべき位置と、そこに到達するまでの時間を設定する必要があります。

source: Let's say, we want it to take 2 seconds to go to the other point. By default the animation is set to last only 1 second, so change this in the timeline controls in animation panel's lower panel to 2.
es: Digamos que queremos que tarden 2 segundos en llegar al otro punto. De forma predeterminada, la animación está configurada para que dure sólo 1 segundo, así que cámbiala en los controles de la línea de tiempo en el panel inferior del panel de animación a 2.
fr: Disons que nous voulons qu'il faille 2 secondes pour aller à l'autre point. Par défaut l'animation est réglée pour durer une seconde, nous allons changer cela dans les commandes de la ligne de temps : dans le deuxième sous panel du panel d'animation.
ja: たとえば、もう一方のポイントに行くのに2秒かかるとします。既定では、アニメーションの持続時間は2秒に設定されているので、アニメーションパネルの下部パネルのタイムラインコントロールでこれを2に変更します。

source: Animation length
es: Duración de la animación
fr: Durée de l'animation
ja: アニメーションの長さ

source: Click on the timeline header near the 2-second mark and move the sprite to the target destination on the right side.
fr: Cliquez sur l'en-tête de la timeline près du repère de 2 secondes et déplacez le sprite vers la destination cible sur le côté droit.

source: Again, click the key button in the toolbar. This creates our second keyframe.
es: De nuevo, haz clic en el botón de la barra de herramientas. Esto creará nuestro segundo fotograma clave.
fr: De nouveau, cliquez sur le bouton clé dans la barre d'outils. Ceci crée notre deuxième clé d'animation.
ja: 再度、ツールバーのキーボタンをクリックします。これにより、2番目のキーフレームが作成されます。

source: Run the animation
es: Reproducir la animación
fr: Lancer l'animation
ja: アニメーションを実行する

source: Click on the "Play from beginning" (|Play from beginning|) button.
es: Haz clic en el botón " Reproducir desde el principio" (|Play from beginning|).
fr: Cliquez sur le "Play from beginning" Jouer depuis le début) Bouton.
ja: [最初から再生] (|Play from beginning|) ボタンをクリックします。

source: Yay! Our animation runs:
es: ¡Genial! Nuestra animación funciona:
fr: Yeah ! Notre animation fonctionne :
ja: イェーイ！アニメーションが実行されます:

source: The animation
es: La animación
fr: L'animation
ja: アニメーション

source: Back and forth
es: De un lado a otro
fr: Allers et retours
ja: 行ったり来たり

source: Godot has an additional feature here. Like said before, Godot always calculates the frames between two keyframes. In a loop, the first keyframe is also the last keyframe, if no keyframe is specified at the end.
fr: Godot a une fonctionnalité supplémentaire ici. Comme dit précédemment, Godot calcule toujours l'image entre deux clés d'animation. Dans une boucle, la première clé d'animation est aussi la dernière si aucune clé d'animation n'est précisé à la fin.
ja: Godot には追加機能があります。前に述べたように、Godotは常に2つのキーフレーム間のフレームを計算します。ループでは、最後にキーフレームが指定されていない場合、最初のキーフレームが最後のキーフレームにもなります。

source: Animation loop
es: Bucle de animación
fr: Boucle d'animation
ja: アニメーションループ

source: If you set the animation length to 4 seconds now, the animation moves back and forth. You can change this behavior if you change the track's loop mode. This is covered in the next chapter.
fr: Si vous réglez la durée de l'animation à 4 secondes maintenant, l'animation se déplace d'avant en arrière. Vous pouvez modifier ce comportement si vous changez le mode de boucle de la piste. Ceci est abordé dans le chapitre suivant.

source: Track settings
es: Ajustes de pista
fr: Paramètres de la piste
ja: トラックの設定

source: Each track has a settings panel at the end, where you can set the update mode, the track interpolation, and the loop mode.
fr: Chaque piste a un panneau de configuration à la fin, où vous pouvez définir le mode de mise à jour, l'interpolation de la piste et le mode boucle.
ja: 各トラックの最後には、更新モード、トラック補間、ループモードを設定できる設定パネルがあります。

source: The update mode of a track tells Godot when to update the property values. This can be:
fr: Le mode de mise à jour d'une piste indique à Godot quand mettre à jour les valeurs des propriétés. Cela peut l'être :
ja: トラックの更新モードは、プロパティ値を更新するタイミングをGodotに指示します。これには次のものがあります:

source: Continuous: Update the property on each frame
es: Continuo: Actualiza la propiedad en cada frame
fr: Continu : Mise à jour de la propriété sur chaque image
ja: 継続的: 各フレームのプロパティを更新します

source: Discrete: Only update the property on keyframes
es: Discreto: Sólo se actualiza la propiedad en fotogramas clave
fr: Discret : Mise à jour de la propriété uniquement sur les clés d'animation
ja: 離散: キーフレームのプロパティのみを更新します

source: Trigger: Only update the property on keyframes or triggers
es: Trigger: Sólo se actualiza la propiedad en fotogramas clave o triggers
fr: Trigger : Met à jour la propriété seulement sur les clés d'animation ou les déclencheurs
ja: トリガー: キーフレームまたはトリガーのプロパティのみを更新します

source: Capture: The current value of a property is remembered, and it will blend with the first animation key found
fr: Capture : La valeur de la propriété est mémorisée, et la propriété variera continuellement entre cette valeur et la valeur de la première clé d'animation trouvée
ja: キャプチャ: プロパティの現在の値が記憶され、最初に見つかったアニメーション キーとブレンドされます

source: Track mode
fr: Mode piste
ja: トラックモード

source: In normal animations, you usually use "Continuous". The other types are used to script complex animations.
es: En animaciones normales, normalmente se utiliza "Continuo". Los otros tipos se utilizan para escribir animaciones complejas.
fr: Dans les animations normales, vous utilisez généralement "Continuous". Les autres types sont utilisés pour scripter des animations complexes.
ja: 普通のアニメーションでは、通常は「継続的」を使用します。他のタイプは、複雑なアニメーションをスクリプト化するために使用されます。

source: The interpolation tells Godot how to calculate the frame values between the keyframes. These interpolation modes are supported:
es: La interpolación le dice a Godot cómo calcular los valores de los fotogramas entre los fotogramas clave. Estos modos de interpolación son compatibles:
fr: L'interpolation indique à Godot comment calculer les valeurs d'image entre les clés d'animation. Ces modes d'interpolation sont pris en charge :
ja: 補間は、キーフレーム間のフレーム値を計算する方法をGodotに伝えます。次の補間モードがサポートされています:

source: Nearest: Set the nearest keyframe value
es: Nearest: Se establece el valor de fotograma clave más cercano
fr: Le plus proche : définit la plus valeur de la clé d'animation la plus proche
ja: 近傍: 最も近いキーフレーム値を設定します

source: Linear: Set the value based on a linear function calculation between the two keyframes
es: Lineal: Se establece el valor basado en un cálculo de función lineal entre los dos fotogramas clave
fr: Linéaire : Change la valeur en se basant sur un calcul linéaire entre deux clés d'animation
ja: リニア: 2つのキーフレーム間の線形関数計算に基づいて値を設定します

source: Cubic: Set the value based on a cubic function calculation between the two keyframes
es: Cúbica: Se establece el valor basado en el cálculo de una función cúbica entre los dos fotogramas clave
fr: Cubique : change la valeur en se basant sur un calcul par fonction cubique entre deux clés d'animation
ja: キュービック: 2つのキーフレーム間の3次関数計算に基づいて値を設定します

source: Track interpolation
es: Interpolación de pista
fr: Interpolation de piste
ja: トラック補間

source: Cubic interpolation leads to a more natural movement, where the animation is slower at a keyframe and faster between keyframes. This is usually used for character animation. Linear interpolation creates more of a robotic movement.
es: La interpolación cúbica conduce a un movimiento más natural, donde la animación es más lenta en un fotograma clave y más rápida entre fotogramas clave. Normalmente se utiliza para la animación de personajes. La interpolación lineal crea más bien un movimiento robótico.
fr: L'interpolation cubique donne un mouvement plus naturel où l'animation est plus lente à la clé d'animation et plus rapide entre les clés d'animation. Ceci est habituellement utilisé pour l'animation de personnage. L'interpolation linéaire crée un mouvement plus robotique.
ja: キュービック補間は、より自然な動きをもたらします。アニメーションは、キーフレームでは遅くなり、キーフレーム間では速くなります。これは通常、キャラクターアニメーションに使用されます。リニア補間は、よりロボット的な動きを作成します。

source: Godot supports two loop modes, which affect the animation if it's set to loop:
es: Godot admite dos modos de bucle, que afectan a la animación si está configurada para bucle:
fr: Godot prend en charge deux modes de boucle, qui affectent l'animation si elle est réglée pour boucler :
ja: Godotは 2つのループ モードをサポートしており、ループに設定されている場合、アニメーションに影響を与えます:

source: Loop modes
es: Modos de bucle
fr: Modes de boucle
ja: ループモード

source: Clamp loop interpolation: When this is selected, the animation stops after the last keyframe for this track. When the first keyframe is reached again, the animation will reset to its values.
es: Clamp loop interpolation: Cuando se selecciona esta opción, la animación se detiene después del último fotograma clave de esta pista. Cuando se alcanza de nuevo el primer fotograma clave, la animación se restablece a sus valores.
fr: Clamp loop interpolation : Lorsque cette option est sélectionnée, l'animation s'arrête après la dernière clé d'animation pour cette piste. Lorsque la première clé d'animation est atteinte à nouveau, l'animation se réinitialise à ses valeurs.
ja: クランプループ補間(Clamp): これを選択すると、このトラックの最後のキーフレームの後にアニメーションが停止します。最初のキーフレームに再び到達すると、アニメーションはその値にリセットされます。
