Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/introduction_2d.po
Languages: es, fr, ja

source: Wrap loop interpolation: When this is selected, Godot calculates the animation after the last keyframe to reach the values of the first keyframe again.
es: Wrap loop interpolation: Cuando se selecciona esta opción, Godot calcula la animación después del último fotograma clave para alcanzar de nuevo los valores del primer fotograma clave.
fr: Wrap loop interpolation : Lorsque cette option est sélectionnée, Godot calcule l'animation après la dernière clé d'animation pour atteindre à nouveau les valeurs de la première clé d'animation.
ja: ラップループ補間(Wrap): これを選択すると、Godotは最後のキーフレームの後もアニメーションを計算して、最初のキーフレームの値に再び到達します。

source: Keyframes for other properties
fr: Clés d'animation pour d'autres propriétés
ja: その他のプロパティのキーフレーム

source: Godot doesn't restrict you to only edit transform properties. Every property can be used as a track where you can set keyframes.
fr: Godot ne vous restreint pas à éditer uniquement des propriétés de transformations. Toutes les propriétés peuvent être utilisées comme piste où vous pouvez insérer des clés d'animation.
ja: Godotでは、(位置などの)変換プロパティのみが編集できるように制限されるわけではありません。すべてのプロパティは、キーフレームを設定できるトラックとして使用できます。

source: If you select your sprite while the animation panel is visible, you get a small keyframe button for all the sprite's properties. Click on this button and Godot automatically adds a track and keyframe to the current animation.
fr: Si vous sélectionnez votre sprite pendant que le panel d'animation est visible, vous obtenez un petit bouton clé d'animation pour chacune des propriétés du sprite. Cliquez sur le bouton et Godot ajoute automatiquement une piste et clé d'animation à votre animation actuelle.

source: Edit keyframes
fr: Modifier les clés d'animation
ja: キーフレームの編集

source: For advanced use and to edit keyframes in detail, You can click on them to bring up the keyframe editor in the inspector. You can use this to directly edit its values.
fr: Pour une utilisation et édition avancée des clés d'animation en détail, vous pouvez cliqué sur elles pour faire apparaître l'éditeur de clé d'animation dans l'inspecteur.
ja: 高度な使用や詳細な編集のために、キーフレームをクリックすると、インスペクタでキーフレームエディタが表示されます。これを使用して、値を直接編集できます。

source: Keyframe editor editing a key
es: Editor de fotogramas clave editando una clave
fr: Éditeur clé d'animation éditant une clé d'animation
ja: キーを編集するキーフレームエディタ

source: Additionally, you can also edit the easing value for this keyframe by clicking and dragging the easing setting. This tells Godot, how to change the property values when it reaches this keyframe.
fr: En outre, vous pouvez également modifier la valeur d'assouplissement pour cette clé d'animation en cliquant et en faisant glisser le paramètre d'assouplissement. Ceci indique à Godot, comment changer les valeurs des propriétés quand il atteint cette clé d'animation.
ja: また、イージング(Easing)設定をクリックしてドラッグすることにより、このキーフレームのイージング値を編集することもできます。これは、このキーフレームに到達したときにプロパティ値を変更する方法をGodotに伝えます。

source: You usually tweak your animations this way, when the movement doesn't "look right".
fr: Vous ajustez généralement vos animations de cette façon, lorsque le mouvement ne "semble pas correct".
ja: 通常、動きが「正しく見えない」場合は、この方法でアニメーションを微調整します。

source: Advanced: Call Method tracks
fr: Avancé : Pistes de la méthode d'appel
ja: 高度: メソッド呼出しトラック

source: Godot's animation engine doesn't stop here. If you're already comfortable with Godot's scripting language :ref:`doc_gdscript` and :doc:`/classes/index` you know that each node type is a class and has a bunch of callable methods.
fr: Le moteur d'animation de Godot ne s'arrête pas là. Si vous êtes déjà à l'aise avec le langage de script de Godot :ref:`doc_gdscript` et :doc:`/classes/index` vous savez que chaque type de nœud est une classe et possède plusieurs méthodes que vous pouvez appeler.
ja: Godotのアニメーションエンジンはここで止まりません。既にGodotのスクリプト言語 :ref:`doc_gdscript` および :doc:`/classes/index` に慣れている場合は、各ノードタイプがクラスであり、呼び出し可能なメソッドがたくさんあることがわかります。

source: For example, the :ref:`class_AudioStreamPlayer` node type has a method to play an audio stream.
fr: Par exemple le nœud type :ref:`class_AudioStreamPlayer` possède une méthode pour jouer un flux audio.
ja: たとえば、\ :ref:`class_AudioStreamPlayer` ノードタイプには、オーディオストリームを再生するメソッドがあります。

source: Wouldn't it be great to use a method at a specific keyframe in an animation? This is where "Call Method Tracks" come in handy. These tracks reference a node again, this time without a reference to a property. Instead, a keyframe holds the name and arguments of a method, that Godot should call when it reaches this keyframe.
fr: Ce serait quand même pas mal de pouvoir appeler une méthode à une clé d'animation spécifique de l'animation... C'est ici qu'entre en jeu "Call Method Tracks" ou (piste d'appel de méthode). Ces pistes ont chacune la référence à un nœud mais pas de référence à une propriété. A la place, une clé d'animation contient le nom et les arguments de la méthode qu'on souhaite appeler au moment ou Godot atteint la clé d'animation.
ja: アニメーションの特定のキーフレームでメソッドを使用するのは素晴らしいことではありませんか？これは、「メソッド呼び出しトラック」が役立つ場所です。これらのトラックは、今度はプロパティへの参照なしでノードを再度参照します。代わりに、キーフレームはメソッドの名前と引数を保持し、Godotはこのキーフレームに到達したときに呼び出しを行います。

source: To demonstrate, we're going to use a call method track to play audio at a specific keyframe. Normally to play audio you should use an audio track, but for the sake of demonstrating methods we're going to do it this way.
fr: En guise de démonstration, on va utiliser une piste d'appel de méthode pour jouer un son à une clé d'animation spécifique. Normalement, pour jouer un son on devrait utiliser une piste audio, mais pour le bien de la démonstration de l'appel de méthodes on va le faire de cette manière.
ja: デモのために、メソッド呼び出しトラックを使用して、特定のキーフレームでオーディオを再生します。通常、オーディオを再生するにはオーディオトラックを使用する必要がありますが、手法を示すためにこの方法で行います。

source: Add a :ref:`class_AudioStreamPlayer` to the Scene Tree and setup a stream using an audio file you put in your project.
fr: Ajouter un :ref:`class_AudioStreamPlayer` à l'arbre des scènes et préparer un flux audio, utilisant un fichier audio que vous rajouter dans votre projet.
ja: シーンツリーに :ref:`class_AudioStreamPlayer` を追加し、プロジェクトに配置したオーディオファイルを使用してストリームを設定します。

source: Click on "Add track" (|Add track|) on the animation panel's track controls.
fr: Cliquez sur "Ajouter une piste" (|Add track|) dans les commandes de piste du panneau d'animation.
ja: アニメーションパネルのトラックコントロールで[トラックを追加] (|Add track|) をクリックします。

source: Select "Add Call Method Track" from the list of possible track types.
fr: Sélectionner "Add Call Method Track" (ou "ajouter une piste d'appel de méthode") depuis la liste des différents types de piste.
ja: 可能なトラックタイプのリストから「メソッド呼出しトラック」を選択します。

source: Add Call Method Track
fr: Ajouter Une Piste d'Appel de Méthode
ja: メソッド呼出しトラックの追加

source: Select the :ref:`class_AudioStreamPlayer` node in the selection window. Godot adds the track with the reference to the node.
fr: Sélectionner le nœud :ref:`class_AudioStreamPlayer` dans la fenêtre de sélection. Godot ajoute la piste avec la référence au nœud.
ja: 選択ウィンドウで :ref:`class_AudioStreamPlayer` ノードを選択します。 Godotは、ノードへの参照を含むトラックを追加します。

source: Select AudioStreamPlayer
fr: Sélectionner L'AudioStreamPlayer
ja: AudioStreamPlayerを選択

source: Right click the timeline where Godot should play the sample and click the "Insert Key" option. This will bring up a list of methods that can be called for the AudioStreamPlayer node. Select the first one.
fr: Clique droit sur la ligne du temps où Godot devrait jouer l'extrait et cliquez sur l'option"Insérer une clé". Une liste des méthodes qui peuvent être appelées pour l'AudioStreamPlayer devrait apparaître. Sélectionner la première.
ja: Godotがサンプルを再生するタイムラインを右クリックし、[キーを挿入]オプションをクリックします。これにより、AudioStreamPlayerノードに対して呼び出すことができるメソッドのリストが表示されます。最初のものを選択します。

source: When Godot reaches the keyframe, Godot calls the :ref:`class_AudioStreamPlayer` node's "play" function and the stream plays.
fr: Quand Godot atteint la clé d'animation, Godot appelle la fonction "play" du nœud AudioStreamPlayer et le flux audio est joué.
ja: Godotがキーフレームに到達すると、Godotは :ref:`class_AudioStreamPlayer` ノードの "play" 関数を呼び出し、ストリームが再生されます。

source: You can change its position by dragging it on the timeline, you can also click on the keyframe and use the keyframe settings in the inspector.
fr: Vous pouvez changer la position de la clé d'animation en cliquant glissant sur la ligne temporelle, vous pouvez aussi cliquez sur la clé d'animation et changer ses paramètres dans l'inspecteur.
ja: タイムライン上でドラッグして位置を変更できます。キーフレームをクリックして、インスペクタのキーフレーム設定を使用することもできます。

source: In Godot you can animate anything you find in the Inspector. Animations are changes to properties over time. This means you can animate anything visual in nature: sprites, UI elements, particles, the visibility, and color of textures. But not only. You can also control gameplay related values and call any function.
es: En Godot puedes animar cualquier cosa que encuentres en el Inspector. Las animaciones son cambios en las propiedades en el transcurso del tiempo. Esto significa que puedes animar cualquier elemento visual que tengas a mano: sprites, elementos de UI, partículas, la visibilidad y el color de las texturas. Pero no solo eso, también puedes controlar los valores relacionados con el juego y llamar a cualquier función.

source: Click on the AnimationPlayer node in the Node tab to open the Animation Panel at the bottom of the viewport.
es: Haz clic en el nodo AnimationPlayer en la pestaña Nodos para abrir el Panel de Animación en la parte inferior de la ventana de visualización.

source: It consists of five parts:
es: Consta de cinco partes:

source: The keyframe editor (when enabled)
es: El editor de fotogramas clave (cuando está habilitado)

source: See the `animation panel reference <#animation-panel-reference>`__ below for details.
es: Para obtener más detalles, consulta la `referencia del panel de animación <#animation-panel-reference>`__ a continuación.

source: White and blue diamond shapes represent keyframes in the timeline.
es: Las formas de diamantes blancos y azules representan fotogramas clave en la línea de tiempo.

source: If you animate the wrong property, you can edit a track's path anytime. Double click on it and type the new path. Play the animation using the "Play from beginning" button |Play from beginning| (Default shortcut: Shift+D) to see the changes instantly.
es: Si animas la propiedad incorrecta, puedes editar la ruta de una pista en cualquier momento. Haz doble clic sobre él y escribe la nueva ruta. Reproduce la animación con el botón "Reproducir desde el principio" |Play from beginning| (Método abreviado predeterminado: Mayúsculas+D) para ver los cambios al instante.

source: For this tutorial, we'll going to create an AnimationPlayer node and a sprite node as an AnimationPlayer node child.
es: Para este tutorial, vamos a crear un nodo AnimationPlayer y un nodo sprite como un nodo AnimationPlayer hijo.

source: The sprite holds an image texture and we animate that sprite to move between two points on the screen. As a starting point, move the sprite to a left position on the screen.
es: El sprite contiene una textura de imagen y animamos a ese sprite para que se mueva entre dos puntos de la pantalla. Como punto de partida, mueve el sprite a la posición izquierda de la pantalla.

source: Select the AnimationPlayer node and click on "Add animation" (|Add Animation|) in the animation tab to add a new animation.
es: Selecciona el nodo AnimationPlayer y haz clic en "Añadir animación" (|Add Animation|) en la pestaña Animación para añadir una nueva animación.

source: Enter a name for the animation in the dialog box.
es: Introduce un nombre para la animación en la ventana de diálogo.

source: As we don't have a track already set up for the transform/location property, Godot asks, whether it should set it up for us. Click on "Create".
es: Como no tenemos una pista ya configurada para la propiedad de transform/location, Godot nos preguntará si debería configurarla para nosotros. Haz clic en "Crear".

source: The track name consists of a Node Path, followed by a colon, followed by a reference to its property, that we would like to modify.
es: El nombre de la pista consiste en una ruta de nodo, seguida de dos puntos, seguidos de una referencia a su propiedad, que nos interesaría modificar.

source: In our example, the path is ``AnimationPlayer/Sprite`` and the property is ``position``.
es: En nuestro ejemplo, la ruta es ``AnimationPlayer/Sprite`` y la propiedad es ``position``.

source: The path always starts at the AnimationPlayer node's parent (so paths always have to include the AnimationPlayer node itself).
es: La ruta siempre comienza en el nodo padre AnimationPlayer (por lo que las rutas siempre tienen que incluir el propio nodo AnimationPlayer).

source: Don't worry if you change the names of nodes in the Scene Tree, that you already have tracks for. Godot automatically updates the paths in the tracks.
es: No te preocupes si cambias los nombres de los nodos del árbol de escenas para los que ya tienes pistas. Godot actualiza automáticamente las rutas en las pistas.

source: Click on the timeline header near the 2 second mark and move the sprite to the target destination on the right side.
es: Haz clic en el encabezado de la línea de tiempo cerca de la marca de 2 segundos y mueve el sprite al destino deseado en el lado derecho.

source: As you can see, the "loop" button is enabled by default and our animation loops. Godot has an additional feature here. Like said before, Godot always calculates the frames between two keyframes. In a loop, the first keyframe is also the last keyframe, if no keyframe is specified at the end.
es: Como puede ver, el botón "loop" está habilitado por defecto y nuestros bucles de animación. Godot tiene una característica adicional aquí. Como se ha dicho antes, Godot siempre calcula los fotogramas entre dos fotogramas clave. En un bucle, el primer fotograma clave es también el último fotograma clave, si no se especifica ningún fotograma clave al final.

source: If you set the animation length to 4 seconds now, the animation moves back and forth. You can change this behaviour if you change the track's loop mode. This is covered in the next chapter.
es: Si ahora ajustas la duración de la animación a 4 segundos, la animación avanza y retrocede. Puedes cambiar este comportamiento si cambias el modo de bucle de la pista. Esto se explicará en el siguiente capítulo.

source: Each track has a settings panel at the end, where you can set the update rate, the track interpolation, and the loop mode.
es: Cada pista tiene un panel de ajustes al final, donde puede establecer la velocidad de actualización, la interpolación de pista y el modo de bucle.

source: The update rate of a track tells Godot when to update the property values. This can be:
es: La velocidad de actualización de una pista le indica a Godot cuándo actualizar los valores de la propiedad. Esto puede ser:

source: Track rate
es: Velocidad de pista

source: If you select your sprite while the animation panel is visible, you get a small keyframe button for all of the sprite's properties. Click on this button and Godot automatically adds a track and keyframe to the current animation.
es: Si seleccionas tu sprite mientras el panel de animación está visible, obtendrás un pequeño botón de fotograma clave para todas las propiedades del sprite. Haga clic en este botón y Godot añade automáticamente una pista y un fotograma clave a la animación actual.

source: For advanced use and to edit keyframe in detail, enable the keyframe editor (|Keyframe editor|).
es: Para un uso avanzado y para editar el fotograma clave en detalle, habilita el editor de fotogramas clave (|Keyframe editor|).

source: This adds an editor pane on the right side of the track settings. When you select a keyframe, you can directly edit its values in this editor:
es: Esto añade un panel de editor en el lado derecho de la configuración de la pista. Cuando seleccionas un fotograma clave, puedes editar directamente sus valores en este editor:

source: Additionally, you can also edit the transition value for this keyframe:
es: Además, también puedes editar el valor de transición para este fotograma clave:

source: Keyframe editor editing a transition
es: Editor de fotogramas clave editando una transición

source: This tells Godot, how to change the property values when it reaches this keyframe.
es: Esto le dice a Godot, cómo cambiar los valores de la propiedad cuando alcanza este fotograma clave.

source: Wouldn't it be great to play a stream at a specific keyframe in an animation? This is where "Call Func Tracks" come in handy. These tracks reference a node again, this time without a reference to a property. Instead, a keyframe holds the name and arguments of a function, that Godot should call when it reaches this keyframe.
es: ¿No sería genial reproducir una secuencia en un fotograma clave específico de una animación? Aquí es donde "Pista de Llamada a Funciones" resulta útil. Estas pistas hacen referencia a un nodo de nuevo, esta vez sin referencia a una propiedad. En su lugar, un fotograma clave contiene el nombre y los argumentos de una función, que Godot debería llamar cuando llegue a este fotograma clave.

source: To let Godot play a sample when it reaches a keyframe, follow this list:
es: Para permitir que Godot reproduzca una muestra cuando alcanza un fotograma clave, sigue esta lista:

source: Enable the Keyframe Editor by clicking on |Keyframe editor|.
es: Activa el Editor de fotogramas clave haciendo clic en |Keyframe editor|.

source: Click on "Add keyframe" near the settings of our func track (|Add keyframe|) and select the keyframe.
es: Haz clic en "Añadir fotograma clave" cerca de la configuración de nuestra pista funcional (|Add keyframe|) y selecciona el fotograma clave.

source: Add a keyframe to the call func track
es: Añadir un fotograma clave a la pista de función de llamada

source: Keyframe settings of a call func track
es: Ajustes de fotogramas clave de una pista de función de llamada

source: When Godot reaches the keyframe, Godot calls the :ref:`class_AnimationPlayer` node's "play" function and the stream plays.
es: Cuando Godot alcanza el fotograma clave, llama a la función "play" del nodo :ref:`class_AnimationPlayer` y se reproduce la secuencia.

source: Toggle keyframe editor
es: Cambiar el editor de fotogramas clave
