Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/autoloads_versus_internal_nodes.po
Languages: es, fr, ko, zh_cn

source: Autoloads versus internal nodes
es: Autoloads y nodos internos
fr: Chargements automatiques par rapport aux nœuds internes
ko: 오토로드 대 내장 노드
zh_cn: 自动加载VS内部节点

source: Other engines might encourage the use of creating "manager" classes that organize lots of functionality into a globally accessible entity. Godot thrives by supporting ways to cut down the size of such objects. Instead it shifts content into individual nodes as much as possible.
es: Otros motores suelen incentivar el uso de crear clases "manager" para organizar las funcionalidades en una entidad accesible globalmente. Godot soporta modos que permiten reducir el tamaño y cantidad de dichos objetos. En su lugar divide el contenido en nodos individuales cuanto sea posible.
fr: D'autres moteurs pourraient encourager l'utilisation de la création de classes "manager" qui organisent un grand nombre de fonctionnalités en une entité globalement accessible. Godot se distingue en fournissant les moyens de réduire la taille de ces objets. Il déplace autant que possible le contenu dans des nœuds individuels.
ko: 다른 엔진에서는 전역으로 접근 가능할 개체에 다양한 기능을 구성하는 "관리자" 클래스를 만들어 쓰는 것을 권장할 지도 모릅니다. Godot는 이러한 객체의 크기를 줄이는 방식을 지원하는 것으로 커집니다. 대신 내용물을 가능한 한 개별 노드로 이동시킵니다.
zh_cn: 其他引擎可能鼓励创建“管理”类，这些类将许多功能组织成一个全局可访问的实体。Godot通过支持减少此类对象大小的方法而蓬勃发展。相反，它尽可能地将内容转移到各个节点。

source: For example, what if a developer is building a platformer and they want to collect coins that play a sound effect? Well, there's a node for that: the :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`. But they notice during their testing that if they "play" an AudioStreamPlayer while it is already playing the sound, then the new sound interrupts the first sound, terminating it before it can play.
es: Por ejemplo, ¿qué puede hacer un desarrollador está creando un juego de plataformas y quiere que al recolectar monedas se reproduzca un efecto de sonido? Existe un nodo para hacer eso, :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`. Pero notará durante las pryebas que si reproduce un "AudioStreamPlayer" mientras está ejecutando un sonido, el nuevo sonido interrumpirá el que se está reproduciendo, terminándolo antes de que se pueda reproducir.
fr: Par exemple, que se passe-t-il si un développeur construit un platformer et qu'il veut collectionner des pièces qui jouent un effet sonore ? Eh bien, il y a un nœud pour cela : le :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`. Mais ils remarquent pendant leur test que s'ils "jouent" un AudioStreamPlayer alors qu'il joue déjà le son, alors le nouveau son interrompt le premier son, le terminant avant qu'il puisse finir de jouer.
ko: 예를 들어, 한 개발자가 플랫포머 게임을 제작하면서 동전을 먹을 때 음향 효과가 나게 하려면 어떻게 해야 할까요? 글쎄요, 이를 위한 노드가 있습니다: :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`. 하지만 소리가 재생되고 있는 도중 AudioStreamPlayer를 "재생(play)"하면, 새로운 소리는 첫 번째 소리가 끝나기 전에 재생하면서 방해가 된다는 것을, 테스트를 하면서 알게 됩니다.
zh_cn: 例如，如果开发人员正在创建一个平台游戏，而他们想要在收集金币时，能播放音效，那该怎么办？好吧，为此有一个节点 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`。但是他们在测试中注意到，如果他们 ``播放`` 一个已经在播放声音的 ``AudioStreamPlayer``，则新声音会中断第一个声音，在可以播放前终止它。

source: Users tend to think the best solution is to make the whole system smarter by making a SoundManager autoload node. It generates a pool of AudioStreamPlayers that cycle through as each new request for sound effects comes in. They then make this SoundManager an autoload so that they can access it from anywhere with `SFX.play("coin_pickup.ogg")`. Little do they know, they've invited a great many complications into their code.
es: Los usuarios tienden a creer que la mejor solución es crear un sistema más práctico haciendo un nodo SoundManager (administrador de sonidos) en modo autoload. Este genera un pool de AudioStreamPlayers que administra cada requerimiento de un nuevo efecto de sonido. Entonces hacen de este SoundManager un autoload para que pueda accederse desde cualquier parte con como `SFX.play("coin_pickup.ogg")`. Poco saben que han agregado mucha complejidad a su código.
fr: Les utilisateurs ont tendance à penser que la meilleure solution est de rendre l'ensemble du système plus intelligent en créant un nœud de chargement automatique SoundManager. Il génère un groupe de lecteurs AudioStreamPlayers qui passent d'un lecteur à l'autre à chaque nouvelle demande d'effets sonores. Ils font alors de ce SoundManager un autoload de sorte qu'ils puissent y accéder de n'importe où avec `SFX.play("coin_pickup.ogg")`. Ils ne savent pas qu' ils ont invité beaucoup de complications dans leur code.
ko: 사용자는 SoundManager 오토로드 노드를 만들어 더 똑똑한 전체 시스템을 만드는 것이 최선의 해결책이라고 생각하는 경향이 있습니다. 이것은 새로운 음향 효과 요청이 들어올 때마다 순환하는 AudioStreamPlayer들의 풀(Pool)을 만들어냅니다. 그런 다음 SoundManager를 오토로드로 만들어 어디서든 `SFX.play("coin_pickup.ogg")`\ 를 가지고 접근하도록 합니다. 사용자는 거의 알지 못했습니다, 자신이 많은 복잡한 문제를 코드로 가지고 왔습니다.
zh_cn: 用户倾向于认为最好的解决方案是，通过使 ``SoundManager`` 自动加载节点，使整个系统更智能。它会生成一个 ``AudioStreamPlayers`` 池，随着每个新的音效请求的出现，而循环播放。然后，他们将 ``SoundManager`` 设置为自动加载，以便可以使用 ``SFX.play("coin_pickup.ogg")`` 从任何位置进行访问。殊不知，他们已经引入了许多复杂的东西到他们的代码。

source: **global state**: One object is now responsible for all objects' data. If SFX has errors or doesn't have an AudioStreamPlayer available, everything will break.
es: **estado global**: Un objeto es ahora responsable de todos los datos del objeto. Si SFX tiene errores o no tiene un AudioStreamPlayer disponible, todo se romperá.
fr: **état global** : Un seul objet est maintenant responsable des données de tous les objets. Si le SFX a des erreurs ou n'a pas d'AudioStreamPlayer disponible, tout va dysfonctionner.
ko: **전역 상태**: 한 객체가 이제 모든 객체의 데이터를 담당합니다. SFX가 오류가 발생하거나 AudioStreamPlayer를 사용할 수 없다면, 전부 망가집니다.
zh_cn: **全局状态**：一个对象现在负责所有对象的数据。如果音效有错误，或没有一个可用的 ``AudioStreamPlayer``，一切都会崩溃。

source: **global access**: Now that any object can call `SFX.play(sound_path)` from anywhere, there's no longer an easy way to track where an SFX bug began.
es: **acceso global**: Ahora que cualquier objeto puede llamar a `SFX.play(sound_path)` desde cualquier parte, no habrá un modo sencillo de rastrear un error relacionado al SFX.
fr: **accès global** : Maintenant que n'importe quel objet peut appeler `SFX.play(sound_path)`de n'importe où, il n'y a plus de moyen facile de suivre où un bug SFX a commencé.
ko: **전역 접근**: 이제 모든 객체가 어디서든 `SFX.play(sound_path)`\ 를 호출할 수 있습니다, SFX 버그가 어디서 시작했는 지를 아는 쉬운 방법은 더 이상 없습니다.
zh_cn: **全局访问**：现在，任何对象都可以从任何地方调用 `SFX.play(sound_path)`，因此不再存在一种简单的方法，来跟踪音效bug的开始位置。

source: **global resource allocation**: If all objects' data and processing is centralized from the start, then one must either...
es: **asignación global de recursos**: Si todos los datos de un objeto y su procesamiento es centralizado desde el principio, entonces uno debe...
fr: **allocation globale des ressources** : Si les données et le traitement de tous les objets sont centralisés dès le départ, alors il faut soit....
ko: **전역 리소스 할당**: 모든 객체의 데이터와 처리가 처음부터 중앙 집중화 된다면, 다음 중 하나를 거쳐야 합니다...
zh_cn: **全局资源分配**：如果从一开始，就集中所有对象的数据和处理，则必须要么...

source: risk under-allocating resources which might lead to faulty behavior.
es: arriesgarse a sub-asignar recursos que podrían provocar un comportamiento erróneo.
fr: le risque de sous-affectation des ressources, ce qui pourrait conduire à des comportements erronés.
ko: 결함있는 행동으로 이어질 수 있는 자원을 과소 할당하게 됩니다.
zh_cn: 存在资源分配不足的风险，这可能会导致错误的行为。

source: Ex: Have too few AudioStreamPlayers in the object pool. Sound doesn't play or it interrupts another sound.
es: Ej: Tener muy pocos AudioStreamPlayers en el grupo de objetos. El sonido no se reproduce o interrumpe otro sonido.
fr: Ex : Avoir trop peu de AudioStreamPlayers dans le pool d'objets. Le son ne joue pas ou interrompt un autre son.
ko: 예: 객체 풀에 AudioStreamPlayer가 너무 적게 있습니다. 소리가 재생되지 않거나 다른 소리를 방해할 수 있습니다.
zh_cn: 例如：在对象池中 ``AudioStreamPlayer`` 太少。声音不播放或打断其他声音。

source: over-allocate resources and use more memory/processing than it needs.
es: sobre-asignar recursos y usar más memoria/procesamiento de lo necesario.
fr: surallouer les ressources et utiliser plus de mémoire et de traitement qu'il n'en faut.
ko: 과다 할당한 리소스로 필요보다 많은 메모리/처리를 사용합니다.
zh_cn: 过度分配资源，使用超过必需的内存/处理。

source: Ex: Have an arbitrarily large number of AudioStreamPlayers, with many of them idling away and not doing anything.
es: Ej: Tener un número arbitrariamente grande de AudioStreamPlayers, muchos de ellos inactivos y sin hacer nada.
fr: Ex : Avoir un nombre arbitrairement grand de AudioStreamPlayers, avec beaucoup d'entre eux qui tournent au ralenti et ne font rien.
ko: 예: 임의로 많은 수의 AudioStreamPlayer가 있습니다, 이들 중 대부분이 휴식 상태이고 아무 것도 하지 않습니다.
zh_cn: 例如：拥有任意数量的 ``AudioStreamPlayer``，其中许多闲置而无所事事。

source: have each object that needs an AudioStreamPlayer register exactly how many it needs and for which sounds. This defeats the purpose of using a 3rd party though; it is now coupled to each object, just as a child node would have been. One has added an unnecessary middleman to the equation.
es: Cada objeto que necesita un AudioStreamPlayer registra exactamente cuántos necesita y para qué sonidos. Esto anula el propósito de usar un tercero; ahora está acoplado a cada objeto, tal como lo estaría un nodo hijo. Uno ha añadido un intermediario innecesario a la ecuación.
fr: a chaque objet qu’a besoin un AudioStreamPlayer s’inscrire nombreux exactement comment il a besoin et pour qui sonne. Il défait le but d’utiliser une 3ème partie cependant ; Il est maintenant couplé à chaque objet, comme un nœud enfant aurait été. Celui-ci a ajouté un intermédiaire inutile à l’équation.
ko: AudioStreamPlayer이 필요한 각 객체마다 얼마나 많이, 그리고 어떤 소리가 필요한지 등록하게 됩니다. 이것은 제 3자를 사용하는 목적을 없애버립니다; 이제 소리는 자식 노드처럼 각 객체에 연결되어버립니다. 누군가는 여기에 불필요한 중개자를 추가합니다.
zh_cn: 让每个需要 ``AudioStreamPlayer`` 的对象，准确地注册它需要，多少个以及哪个声音。但是，这违反了使用第三方的宗旨；现在，它已耦合到每个对象，就像子节点一样。增加了一个不必要的中间人到方程中。

source: Contrast this with each scene keeping as many AudioStreamPlayer nodes as it needs within itself and all these problems go away.
es: Contrasta esto con cada escena manteniendo tantos nodos de AudioStreamPlayer como sean necesarios dentro de sí mismo y todos estos problemas desaparecerán.
fr: Chaque scène conserve autant de nœuds AudioStreamPlayer qu'elle en a besoin et tous ces problèmes disparaissent.
ko: 이것과 반대로 각 씬이 필요한 만큼의 AudioStreamPlayer 노드를 유지하면 이 문제는 사라집니다.
zh_cn: 与之形成对比的是，每个场景在其内部，保留尽可能多的 ``AudioStreamPlayer`` 节点，所有这些问题都会消失。

source: Each scene manages its own state information. If there is a problem with the data, it will only cause issues in that one scene.
es: Cada escena gestiona su propia información de estado. Si hay un problema con los datos, únicamente causará problemas en esa escena.
fr: Chaque scène gère ses propres informations d'état. S'il y a un problème avec les données, cela ne causera des problèmes que dans une seule scène.
ko: 각 씬은 자체적인 상태 정보를 관리합니다. 데이터에 문제가 생기면, 해당 데이터가 있는 씬 내에서만 사고를 일으킵니다.
zh_cn: 每个场景管理自己的状态信息。如果数据有问题，则只会在该场景中引起问题。

source: Each scene accesses only its own nodes. Now, if there is a bug, tracing which node is responsible (probably the root node of the scene), and where in the code it's making the problematic call (locate where the code references the given node) is going to be much easier.
es: Cada escena accede sólo a sus propios nodos. Ahora, si hay un error, rastrear qué nodo es el responsable (probablemente el nodo raíz de la escena), y en qué parte del código está haciendo la llamada problemática (localizar dónde el código hace referencia al nodo en cuestión) va a ser mucho más fácil.
fr: Chaque scène n'accède qu'à ses propres nœuds. Maintenant, s'il y a un bogue, tracer quel nœud est responsable (probablement le nœud racine de la scène), et où dans le code est fait l'appel problématique (localiser où le code référence le nœud donné) va être beaucoup plus facile.
ko: 각 씬은 자체 노드에만 접근합니다. 이제 버그가 나타나면 (아마 씬의 루트 노드이겠지만) 어떤 노드에 책임이 있는 지를 추적하기 쉬워지고, 코드에서 문제가 되는 호출 (주어진 코드를 참조하는 코드가 위치한 곳)을 훨씬 더 쉽게 찾을 수 있습니다.
zh_cn: 每个场景仅访问其自己的节点。现在，如果存在一个bug，则跟踪那个是要负责的节点（可能是场景的根节点），以及在代码中哪里进行了问题调用（定位代码引用给定节点的位置），将变得更加容易。

source: Each scene knows exactly how many resources it needs for the task it performs. No waste of memory or processing due to a lack of information.
es: Cada escena sabe exactamente cuántos recursos necesita para la tarea que realiza. No hay pérdida de memoria o procesamiento por falta de información.
fr: Chaque scène sait exactement de combien de ressources elle a besoin pour la tâche qu'elle exécute. Aucun gaspillage de mémoire ou de traitement dû à un manque d'information.
ko: 각 씬은 실행하기 위해 얼마나 많은 리소스가 필요한지 확실하게 압니다. 정보 부족으로 인한 메모리나 처리의 낭비가 없습니다.
zh_cn: 每个场景都确切地知道执行任务需要多少资源。不会由于缺少信息而浪费内存或处理。

source: The typical justifications for the Autoload include, "I have common Xs that involve many nodes across many scenes, and I want each scene to have X."
es: Las justificaciones típicas para el Autoload incluyen, "Tengo X's comunes que involucran muchos nodos a través de muchas escenas, y quiero que cada escena tenga X."
fr: Les justifications typiques de l'Autoload sont : "J'ai X communs qui impliquent de nombreux nœuds sur plusieurs scènes, et je veux que chaque scène ait X."
ko: 오토로드의 일반적인 정당성은 이런 것입니다, "나는 여러 씬에 많은 노드가 있는 X들을 갖고 있습니다, 그리고 각 씬이 X를 갖고 있도록 하고 싶습니다."
zh_cn: 自动加载的典型理由包括：``我的通用X，涉及许多场景中的许多节点，我希望每个场景都有X。``

source: If X is a function, then the solution is to create a new type of :ref:`Node <class_Node>` that deals with providing that feature for an individual scene or node subtree.
es: Si X es una función, entonces la solución es crear un nuevo tipo de :ref:`Nodo <class_Node>` que se ocupe de proporcionar esa característica para una escena individual o subárbol de un nodo.
fr: Si X est une fonction, alors la solution est de créer un nouveau type de :ref:`Node <class_Node>>` qui s'occupe de fournir cette fonctionnalité pour une scène individuelle ou un sous-arbre de nœud.
ko: X가 함수라면, 각 씬이나 노드 하위 트리에 기능을 제공하는 :ref:`Node <class_Node>`\ 의 새로운 타입을 만드는 것으로 해결합니다.
zh_cn: 如果X是一个函数，则解决方案是：创建一种新的 :ref:`Node <class_Node>` 类型，该类型用于为单个场景或节点子树提供该功能。

source: If X is data, then the solution is either 1) to create a new type of :ref:`Resource <class_Resource>` to share the data, or 2) to store the data in an object to which each node has access (nodes within a scene can use `get_owner()` to fetch the scene root for example).
es: Si X es dato, entonces la solución es, 1) crear un nuevo tipo de :ref:`Resource <class_Resource>` para compartir datos, o 2) guardar los datos en un objeto al cual cada nodo tenga acceso (nodos dentro de una escena pueden utilizar `get_owner()` para obtener la raíz de su escena).
fr: Si X est une donnée, alors la solution est soit 1) de créer un nouveau type de :ref:`Resource <class_Resource>` pour partager les données, soit 2) de stocker les données dans un objet auquel chaque nœud a accès (les nœuds dans une scène peuvent utiliser `get_owner()' pour récupérer la racine de la scène par exemple).
ko: X가 데이터라면, 해결 방법은 두 가지로, 1) :ref:`Resource <class_Resource>`\ 의 새로운 타입을 만들어 데이터를 공유하거나, 2) 각 노드가 접근할 수 있는 객체에 데이터를 저장하는 것입니다 (예를 들어 씬이 있는 노드는 `get_owner()`\ 를 사용하여 씬 루트를 가져올 수 있습니다).
zh_cn: 如果X是数据，则解决方案是：1）创建一个新的 :ref:`Resource <class_Resource>` 类型以共享数据，或2）将数据存储在每个节点均可访问的对象中（例如，场景中的节点可以使用 ``get_owner()`` 获取场景根）。

source: So when *should* one use an autoload?
es: Entonces, ¿cuándo *debería* utilizarse un autoload?
fr: Alors, quand *devrait-on* utiliser un auto-chargement ?
ko: 그러면 언제 오토로드를 *사용해야 할까요*?
zh_cn: 那么什么时候 *应该* 使用自动加载呢？

source: **Static Data**: if you need static data, i.e. data that should be associated with a class (so there is only ever one copy of the data), then autoloads are good opportunities for that. Static data doesn't exist in Godot's scripting API, so autoload singletons are the next best thing. If one creates a class as an autoload, and never creates another copy of that class within a scene, then it will function in place of a formal singleton API.
es: **Datos estáticos**: si necesitas datos estáticos, por ejemplo, datos que deben ser asociados a una clase (así hay sólo una única copia de los datos), entonces los autoloads son una buena oportunidad para eso. Los datos estáticos no existen en la API de scripting de Godot, así que los autoload singletons son lo mejor disponible. Si uno crea una clase como autoload y nunca crea otra copia de esa clase dentro de una escena, entonces esta funcionará en como un singleton.
fr: **Données statiques** : si vous avez besoin de données statiques, c'est-à-dire de données qui doivent être associées à une classe (il n'y a donc toujours qu'une seule copie des données), alors les chargements automatiques sont de bonnes opportunités pour cela. Les données statiques n'existent pas dans l'API de script de Godot, donc les chargements automatiques singletons sont la meilleure chose à faire. Si l'on crée une classe en tant que chargement automatique, et que l'on ne crée jamais une autre copie de cette classe dans une scène, alors elle fonctionnera à la place d'une API singleton formelle.
ko: **정적 데이터**: 클래스에 반드시 연관되어야 하는 (그래서 오직 하나의 데이터 사본만 있는) 정적 데이터가 필요하다면, 오토로드가 좋은 기회입니다. 정적 데이터는 Godot의 스크립팅 API에 존재하지 않기 때문에, 오토로드 싱글톤이 차선책이 됩니다. 클래스를 오토로드로 생성하고, 씬 내에서 클래스의 사본을 생성하지 않는다면, 그것은 형식적인 싱글톤 API를 대신할 것입니다.
zh_cn: **静态数据**：如果需要静态数据，即应该与类关联的数据（因此，数据永远只有一个副本），自动加载是很好的机会。静态数据并不存在于Godot的脚本API中，所以自动装载单例是其次最好的事情。将类创建为自动加载，而且永远不会在场景中创建该类的另一个副本，那么它将代替正式的单例API起作用。

source: **Convenience**: autoloaded nodes have a global variable for their name generated in GDScript. This can be very convenient for defining objects that should always exist, but which need object instance information. The alternative is to create a namespace script: a script that's purpose is only to load and create constants to access other Script or PackedScene resources, resulting in something like ``MyAutoload.MyNode.new()``.
es: **Convenience**: los nodos en modo autoload tienen una variable global generada para GDScript. Esto puede ser conveniente para definir objetos que deben existir siempre pero que necesitan información de instancia de objeto. La alternativa es crear un script de espacio de nombres, un script cuyo único propósito es cargar y crear constantes para acceder a otros recursos Script o PackedScene, resultando en algo como ``MyAutoload.MyNode.new()``.
fr: **Commodité** : les nœuds chargés automatiquement ont une variable globale pour leur nom générée en GDScript. Ceci peut être très pratique pour définir des objets qui doivent toujours exister, mais qui ont besoin d'informations d'instance d'objet. L'alternative est de créer un script d'espace de noms : un script dont le but est seulement de charger et de créer des constantes pour accéder à d'autres ressources Script ou PackedScene, résultant en quelque chose comme ``MyAutoload.MyNode.new()``.
ko: **편의**: 오토로드된 노드는 GDScript에 그들의 이름으로 된 전역 변수를 갖습니다. 이것은 항상 존재해야 하지만 객체 인스턴스 정보가 필요한 객체를 정의하는 데 매우 편리합니다. 대안은 네임스페이스 스크립트를 만드는 것입니다: 스크립트는 다른 스크립트나 PackedScene 리소스에 접근하기 위해 상수를 불러오고 생성하는 것으로도, ``MyAutoload.MyNode.new()``\ 와 같은 결과를 낳습니다.
zh_cn: **便利**：自动加载的节点在GDScript中，以其名称生成一个全局变量。这对于定义应该始终存在的对象非常方便，但是需要对象实例的信息。另一种方法是创建一个命名空间脚本：一个脚本的目的只是加载和创建常量，来访问其他脚本或 ``PackedScene`` 资源，生成类似于 ``MyAutoload.MyNode.new()`` 的东西。

source: Note that the introduction of script classes in Godot 3.1 questions the validity of this reason. With them, one can access scripts using an explicit name from GDScript. Using an autoload to get to a namespace script becomes unnecessary, e.g. ``MyScriptClass.MyPreloadedScript.new()``.
es: Nota que la introducción de classes de script en Godot 3.1 cuestiona la validez de esta lógica. Con ellas, se pueden acceder scripts usando un nombre explícito desde GDScript. Usando un autoload para crear un espacio de nombres se vuelve innecesario, por ejemplo: ``MyScriptClass.MyPreloadedScript.new()``.
fr: Notez que l'introduction des classes de script dans Godot 3.1 remet en question la validité de cette raison. Avec elles, on peut accéder aux scripts en utilisant un nom explicite depuis GDScript. L'utilisation d'un chargement automatique pour accéder à un script d'espace de noms devient inutile, par exemple ``MyScriptClass.MyPreloadedScript.new()``.
ko: Godot 3.1에서 스크립트 클래스를 도입하면서 이런 이유의 정당성은 의문이 됩니다. 스크립트 클래스로 GDScript에서 명시적 이름을 사용해 스크립트에 접근할 수 있습니다. 오토로드를 사용하여 네임스페이스 스크립트를 갖는 행위는 불필요해졌습니다, 예시: ``MyScriptClass.MyPreloadedScript.new()``.
zh_cn: 注意，Godot 3.1中引入的脚本类对这个原因的有效性提出了质疑。对于它们，可以使用GDScript的显式名称访问脚本。没有必要使用自动加载来获取命名空间脚本，如 ``MyScriptClass.MyPreloadedScript.new()``。

source: If the singleton is managing its own information and not invading the data of other objects, then it's a great way to create a "system" class that handles a broad-scoped task. For example a targeting system, quest system, or dialogue system would be great use cases of singleton implementations.
es: Si el singleton mantiene su propia información y no invade los datos de otros objetos, entonces es un buen modo de crear una clase "system" que maneje tareas de ámbito amplio. Por ejemplo, un sistema de rastreo de blancos, de misiones o diálogo, pueden ser casos de uso de implementación de singletons.
fr: Si le singleton gère ses propres informations et n'envahit pas les données d'autres objets, alors il est un excellent moyen de créer une classe "système" qui gère une tâche de grande portée. Par exemple, un système de ciblage, système de quête, ou système de dialogue seraient des cas d'utilisation d'implémentations de singleton.
ko: 싱글톤이 자체 정보를 관리하고 있고, 다른 객체의 데이터에 침범하지 않는다면, 넓은 범위의 작업을 다루기 위해 "시스템" 클래스를 만드는 것이 좋은 방법입니다. 예를 들어 타겟팅 시스템, 퀘스트 시스템, 아니면 대화 상자 시스템이 대표적인 싱글톤 구현 사례입니다.
zh_cn: 如果单例对象管理自身的信息，而不入侵其他对象的数据，那么这正是创建处理广泛任务的 ``系统`` 类的一个好方法。例如一个目标系统、任务系统、以及对话系统，将是单例实现的很好用例。
