Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/data_preferences.po
Languages: es, zh_cn

source: Objects also give users the opportunity to create even more specialized data structures. With it, one can design their own List, Binary Search Tree, Heap, Splay Tree, Graph, Disjoint Set, and any host of other options.
es: Los objetos también ofrecen a los usuarios la oportunidad de crear estructuras de datos aún más especializadas. De esta forma, uno puede diseñar su propia List, Binary Search Tree, Heap, Splay Tree, Graph, Disjoint Set, y cualquier otra opción.
zh_cn: 对象还让用户有机会创建更专门化的数据结构.有了它,一个人可以设计自己的列表、二叉搜索树、堆、散列树、图、不相交集、以及其他选择.

source: "Why not use Node for tree structures?" one might ask. Well, the Node class contains things that won't be relevant to one's custom data structure. As such, it can be helpful to construct one's own node type when building tree structures.
es: "¿Por qué no usar Node para estructuras de árbol?", uno podría preguntarse. Bueno, la clase Node contiene cosas que no serán relevantes para la estructura de datos personalizada de cada quien. Como tal, puede ser útil construir un tipo de nodo propio al construir estructuras de árbol.
zh_cn: "为什么不在树结构中使用节点？"有人可能会问.节点类包含与自定义数据结构无关的内容.因此在构建树结构时,构造自己的节点类型是很有帮助的.

source: From here, one can then create their own structures with specific features, limited only by their imagination.
es: A partir de aquí, uno puede crear sus propias estructuras con características específicas, limitadas sólo por su imaginación.
zh_cn: 从这里开始,然后就可以创建具有特定功能的结构,只会受到他们想象力的限制.

source: Enumerations: int vs. string
es: Enumeraciones: int vs. string
zh_cn: 枚举:整数VS字符串

source: Most languages offer an enumeration type option. GDScript is no different, but unlike most other languages, it allows one to use either integers or strings for the enum values (the latter only when using the ``export`` keyword in GDScript). The question then arises, "which should one use?"
es: La mayoría de los idiomas ofrecen una opción de tipo de enumeración. GDScript no es diferente, pero a diferencia de la mayoría de los otros lenguajes, permite usar enteros o strings para los valores enumerados (esto último sólamente cuando se utiliza la palabra clave ``export`` en GDScript). Entonces surge la pregunta, "¿qué se debe usar?"
zh_cn: 大多数语言都提供了一个枚举类型选项.GDScript也不例外,但与大多数其他语言不同的是,它允许人们使用整数或字符串作为枚举值(只有在GDScript中使用 ``export`` 关键字时才可使用后者).那么问题就来了,"应该使用哪一种？"

source: The short answer is, "whichever you are more comfortable with." This is a feature specific to GDScript and not Godot scripting in general; The languages prioritizes usability over performance.
es: La respuesta corta es: "Con el que te sientas más cómodo". Esta es una característica específica de GDScript y no de Godot scripting en general; los lenguajes priorizan la usabilidad sobre el rendimiento.
zh_cn: 简而言之,"你觉得哪个更舒服就选哪个."这是GDScript特有的特性,而并非一般的Godot脚本；该语言将可用性置于性能之上.

source: On a technical level, integer comparisons (constant-time) will happen faster than string comparisons (linear-time). If one wants to keep up other languages' conventions though, then one should use integers.
es: A nivel técnico, las comparaciones entre enteros (tiempo-constante) serán más rápidas que las comparaciones entre strings (tiempo-lineal). Sin embargo, si uno quiere mantener las convenciones de otros idiomas, entonces debería usar enteros.
zh_cn: 在技术层面上,整数比较(常量时间)比字符串比较(线性时间)更快.如果你想保持其他语言的习惯,那么应该使用整数.

source: The primary issue with using integers comes up when one wants to *print* an enum value. As integers, attempting to print MY_ENUM will print ``5`` or what-have-you, rather than something like ``"MyEnum"``. To print an integer enum, one would have to write a Dictionary that maps the corresponding string value for each enum.
es: El problema principal con el uso de enteros surge cuando uno quiere *imprimir* un valor numérico. Como enteros, al intentar imprimir MY_ENUM se imprimirá ``5`` o lo que sea, en lugar de algo como ``"MyEnum"``. Para imprimir un entero, uno tendría que escribir un Diccionario que mapea el valor de la cadena correspondiente para cada enumeración.
zh_cn: 当您想要 *打印* 枚举值时,使用整数的主要问题就出现了.作为整数尝试打印 ``MY_ENUM``,将会打印 ``5`` 之类的东西,而不是像 ``MyEnum`` 这样的词.要打印整数枚举,必须编写一个字典来映射每个枚举对应的字符串值.

source: If the primary purpose of using an enum is for printing values and one wishes to group them together as related concepts, then it makes sense to use them as strings. That way, a separate data structure to execute on the printing is unnecessary.
es: Si el propósito principal de usar una enumeración es para imprimir valores y uno desea agruparlos en conceptos relacionados, entonces tiene sentido usarlos como strings. De esta manera, no es necesaria una estructura de datos separada para ejecutar en la impresión.
zh_cn: 如果使用枚举的主要目的是打印值,并且希望将它们作为相关概念组合在一起,那么使用它们作为字符串是有意义的.这样,就不需要在打印上执行单独的数据结构.

source: Under what circumstances should one use each of Godot's animation classes? The answer may not be immediately clear to new Godot users.
es: ¿Bajo qué circunstancias se debe utilizar cada una de las clases de animación de Godot? La respuesta puede no ser muy clara para los nuevos usuarios de Godot.
zh_cn: 在什么情况下应该使用Godot的各种动画类？对于Godot的新用户来说,可能不是马上清楚答案.

source: :ref:`AnimatedTexture <class_AnimatedTexture>` is a texture that the engine draws as an animated loop rather than a static image. Users can manipulate...
es: :ref:`AnimatedTexture <class_AnimatedTexture>` es una textura que el motor dibuja como un bucle animado en lugar de una imagen estática. Los usuarios pueden manipular...
zh_cn: :ref:`AnimatedTexture <class_AnimatedTexture>` 是引擎绘制一个动画循环,而不是一个静态图像的纹理.用户可以进行如下操作…

source: the rate at which it moves across each section of the texture (fps).
es: la velocidad a la que se mueve a través de cada sección de la textura (fps).
zh_cn: 它在纹理的每个部分移动的速率(每秒帧数).

source: the number of regions contained within the texture (frames).
es: el número de regiones que contiene la textura (frames).
zh_cn: 纹理中包含的区域数(帧).

source: Godot's :ref:`VisualServer <class_VisualServer>` then draws the regions in sequence at the prescribed rate. The good news is that this involves no extra logic on the part of the engine. The bad news is that users have very little control.
es: Godot's :ref:`VisualServer <class_VisualServer>` entonces dibuja las regiones en secuencia a la tasa establecida. La buena noticia es que esto no implica ninguna lógica adicional por parte del motor. La mala noticia es que los usuarios tienen muy poco control.
zh_cn: Godot的 :ref:`VisualServer <class_VisualServer>` 按规定的速度依次绘制区块.好消息是,这并不涉及引擎部分额外的逻辑.坏消息是,用户几乎没有控制权.

source: Also note that AnimatedTexture is a :ref:`Resource <class_Resource>` unlike the other :ref:`Node <class_Node>` objects discussed here. One might create a :ref:`Sprite <class_Sprite>` node that uses AnimatedTexture as its texture. Or (something the others can't do) one could add AnimatedTextures as tiles in a :ref:`TileSet <class_TileSet>` and integrate it with a :ref:`TileMap <class_TileMap>` for many auto-animating backgrounds that all render in a single batched draw call.
es: Tambien notese que AnimatedTexture es un :ref:`Resource <class_Resource>` a diferencia de los demás objetos ref:`Node <class_Node>` mencionados aquí.Se puede crear un nodo :ref:`Sprite <class_Sprite>` que utiliza AnimatedTexture como textura. O (algo que otros no pueden hacer) se puede agregar AnimatedTextures como tiles en un :ref:`TileSet <class_TileSet>` e integrarlo con un ref:`TileMap <class_TileMap>` para muchos fondos con animación automática que se renderizan en una sola llamada.
zh_cn: 另外请注意,``AnimatedTexture`` 是一个 :ref:`Resource <class_Resource>`,与此处讨论的其他 :ref:`Node <class_Node>` 对象不同.可以创建一个 :ref:`Sprite <class_Sprite>` 节点,该节点使用 ``AnimatedTexture`` 作为其纹理.或者(其他方法做不到的)可以将 ``AnimatedTexture`` 作为图块,添加到一个 :ref:`TileSet <class_TileSet>` 中,并将其与 :ref:`TileMap <class_TileMap>` 集成在一起,以获得许多自动动画化的背景,所有的渲染将在单个批处理内绘制调用.

source: The AnimatedSprite node, in combination with the :ref:`SpriteFrames <class_SpriteFrames>` resource, allows one to create a variety of animation sequences through spritesheets, flip between animations, and control their speed, regional offset, and orientation. This makes them well-suited to controlling 2D frame-based animations.
es: El nodo AnimatedSprite, en combinación con el recurso :ref:`SpriteFrames <class_SpriteFrames>`, permite crear una variedad de secuencias de animación a través de hojas de sprites, voltear entre animaciones, y controlar su velocidad, desplazamiento por regiones y orientación. Esto los vuelve muy buenos para controlar animaciones basadas en cuadros 2D.
zh_cn: ``AnimatedSprite`` 节点,与 :ref:`SpriteFrames <class_SpriteFrames>` 资源结合使用,允许用户通过精灵表创建各种动画序列,在动画之间切换,并控制它们的速度、区域偏移量、和方向.这使得它们非常适合控制基于二维的帧动画.

source: If one needs trigger other effects in relation to animation changes (for example, create particle effects, call functions, or manipulate other peripheral elements besides the frame-based animation), then will need to use an :ref:`AnimationPlayer <class_AnimationPlayer>` node in conjunction with the AnimatedSprite.
es: Si uno necesita desencadenar otros efectos en relación a distintos cambios de animación (por ejemplo, crear efectos de particulas, llamar funciones, o manipular otros elementos periféricos ademas de las animaciones basadas en cuadros), entonces se necesita usar un nodo de :ref:`AnimationPlayer <class_AnimationPlayer>` en conjunto con el AnimatedSprite.
zh_cn: 如果需要触发与动画更改相关的其他效果(例如,创建粒子效果,调用函数,或操作除基于帧的动画外的其他外围元素),那么就需要使用一个 :ref:`AnimationPlayer <class_AnimationPlayer>` 节点与 ``AnimatedSprite`` 关联.

source: AnimationPlayers are also the tool one will need to use if they wish to design more complex 2D animation systems, such as...
es: AnimationPlayers también es la herramienta que uno necesita utilizar si se desea diseñar sistemas de animación 2D mas complejos, como…
zh_cn: 如果你想设计更复杂的二维动画系统,``AnimationPlayer`` 也是你的必备工具,例如…

source: **Cut-Out animations:** editing sprites' transforms at runtime.
es: **Animaciones recortadas:** editando las transformaciones de los sprites en el momento de la ejecución.
zh_cn: **剪纸动画**:在运行时编辑精灵的变换.

source: **2D Mesh animations:** defining a region for the sprite's texture and rigging a skeleton to it. Then one animates the bones which stretch and bend the texture in proportion to the bones' relationships to each other.
es: **Animaciones 2D en Mallas:** definiendo una región para la textura del sprite y riggeando un esqueleto a el. Luego se animan los huesos que estiran y curvan la textura en proporción a las relaciones entre los huesos.
zh_cn: **二维网格动画**:为精灵的纹理划分一个区域,并将骨骼绑定在上面.然后动画化该骨骼,使骨骼按照彼此之间的关系,成比例地拉伸和弯曲纹理.

source: A mix of the above.
es: Una mezcla de lo de arriba.
zh_cn: 综上所述.

source: While one needs an AnimationPlayer to design each of the individual animation sequences for a game, it can also be useful to combine animations for blending, i.e. enabling smooth transitions between these animations. There may also be a hierarchical structure between animations that one plans out for their object. These are the cases where the :ref:`AnimationTree <class_AnimationTree>` shines. One can find an in-depth guide on using the AnimationTree :ref:`here <doc_animation_tree>`.
es: Mientras uno necesita un AnimationPlayer para diseñar cada una de las secuencias de animaciones para un juego, también puede ser util combinar animaciones para mezclar, por ejemplo, habilitando transiciones suaves entre estas animaciones. Tambien puede haber una estructura jerárquica entre las animaciones que uno planea para su objeto, Estos son los casos donde el :ref:`AnimationTree <class_AnimationTree>` brilla. Uno puede encontrar una guía en profundidad en usar el AnimationTree en AnimationTree :ref:`aquí<doc_animation_tree>`.
zh_cn: 虽然我们需要一个 AnimationPlayer,来为游戏设计每个独立的动画序列,它也可以用来混合复合动画,也就是说,在这些动画之间实现平滑的转换.在为对象规划的动画之间,也可能存在一个层次结构.在这些情况下使用 :ref:`AnimationTree <class_AnimationTree>` 效果很出色.可以在 :ref:`这里 <doc_animation_tree>` 找到关于使用 AnimationTree 的深入指南.

source: Godot implements Dictionary as an ``OrderedHashMap<Variant, Variant>``. The engine stores a giant array (initialized to 1000 records) of key-value pairs. When one attempts to access a value, they provide it a key. It then *hashes* the key, i.e. converts it into a number. The "hash" becomes the index into the array, giving the OHM a quick lookup for the value within the conceptual "table" of keys mapped to values.
es: Godot implementa el Dictionary como un ``OrderedHashMap<Variant, Variant>``. El motor almacena un array gigante (inicializado a 1000 registros) de pares clave-valor. Cuando uno intenta acceder a un valor, se entrega una clave. Por lo tanto, la clave es "hash", es decir, se convierte en un número. El "hash" se convierte en el índice del array, lo que permite al OHM una rápida consulta del valor dentro de la "tabla" conceptual de claves asignadas a valores.

source: Maintaining a huge size for the table.
es: Manteniendo un gran tamaño para la tabla.

source: The reason it starts with 1000 records, and the reason it forces large gaps of unused memory interspersed in the table is to minimize hash collisions and maintain the speed of the accesses.
es: La razón por la que comienza con 1000 registros, y la razón por la que fuerza grandes espacios de memoria sin usar intercalados en la tabla es para minimizar las colisiones de hash y mantener la velocidad de los accesos.
