Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/data_preferences.po
Languages: es, zh_cn

source: Data preferences
es: Selección de tipos de datos
zh_cn: 数据偏好

source: Ever wondered whether one should approach problem X with data structure Y or Z? This article covers a variety of topics related to these dilemmas.
es: ¿Alguna vez te has preguntado si se debería abordar el problema X con la estructura de datos Y o Z? Este artículo cubre una variedad de temas relacionados con estos dilemas.
zh_cn: 有没有想过应该用数据结构Y还是Z,来处理问题X ？本文涵盖了与这些困境有关的各种主题.

source: This article makes references to "[something]-time" operations. This terminology comes from algorithm analysis' `Big O Notation <https://rob-bell.net/2009/06/a-beginners-guide-to-big-o-notation/>`_.
es: Este artículo hace referencia a las operaciones de "tiempo-[algo]". Esta terminología proviene del análisis de algoritmos ' `Big O Notation <https://rob-bell.net/2009/06/a-beginners-guide-to-big-o-notation/>`_.
zh_cn: 本文引用了 ``[something]-time`` 操作.这个术语来自于算法分析的 `大O表示法 <https://rob-bell.net/2009/06/a-beginners-guide-to-big-o-notation/>`_.

source: Long-story short, it describes the worst-case scenario of runtime length. In laymen's terms:
es: En resumen, describe el peor de los casos de duración del tiempo de ejecución. En términos simples:
zh_cn: 长话短说,它描述了运行时长度的最坏的情况.用外行的话来说:

source: "As the size of a problem domain increases, the runtime length of the algorithm..."
es: "A medida que aumenta el tamaño de un dominio problemático, la duración del tiempo de ejecución del algoritmo..."
zh_cn: "随着问题域的大小增加,算法的运行时间长度…"

source: Constant-time, ``O(1)``: "...does not increase."
es: Tiempo-constante, ``O(1)``: "...no aumenta."
zh_cn: 常量时间,``O(1)``:"…不会增加."

source: Logarithmic-time, ``O(log n)``: "...increases at a slow rate."
es: Tiempo-logarítmico, ``O(log n)``: "...aumenta a un ritmo lento."
zh_cn: 对数时间,``O(log n)``:"…以缓慢的速度增长."

source: Linear-time, ``O(n)``: "...increases at the same rate."
es: Tiempo-lineal, ``O(n)``: "...aumenta a la misma frecuencia."
zh_cn: 线性时间,``O(n)``:"…以同样的速度增长."

source: Etc.
zh_cn: 等等.

source: Imagine if one had to process 3 million data points within a single frame. It would be impossible to craft the feature with a linear-time algorithm since the sheer size of the data would increase the runtime far beyond the time allotted. In comparison, using a constant-time algorithm could handle the operation without issue.
es: Imagínate si tuvieras que procesar 3 millones de puntos de datos en un solo fotograma. Sería imposible crear esta característica con un algoritmo de tiempo-lineal, ya que el gran tamaño de los datos aumentaría el tiempo de ejecución mucho más allá del tiempo asignado. En cambio, un algoritmo de tiempo-constante podría realizar la operación sin problemas.
zh_cn: 想象一下,如果必须在一帧内处理300万个数据点.不可能使用线性时间算法来设计这个特性,因为数据的绝对大小,将使运行时间大大超出分配的时间.相比之下,使用常量时间算法可以毫无问题地处理该操作.

source: By and large, developers want to avoid engaging in linear-time operations as much as possible. But, if one keeps the scale of a linear-time operation small, and if one does not need to perform the operation often, then it may be acceptable. Balancing these requirements and choosing the right algorithm / data structure for the job is part of what makes programmers' skills valuable.
es: En general, los desarrolladores quieren evitar participar en operaciones de tiempo lineal tanto como sea posible. Pero, si uno mantiene la escala de una operación de tiempo lineal reducida, y no es necesario realizar la operación con frecuencia, entonces podría ser aceptable. Equilibrar estos requisitos y elegir el algoritmo y la estructura de datos adecuados para el trabajo es parte de lo que hace que las habilidades de los programadores sean valiosas.
zh_cn: 总的来说,开发人员希望尽可能避免进行线性时间操作.但是,如果保持线性时间运算的规模很小,并且如果不需要经常执行操作,则这是能够接受的.平衡这些需求,并为工作选择正确的算法/数据结构,是使程序员的技能有价值的一部分.

source: Array vs. Dictionary vs. Object
es: Array vs. Diccionario vs. Objeto
zh_cn: 数组VS字典VS对象

source: Godot stores all variables in the scripting API in the `Variant <https://docs.godotengine.org/en/latest/development/cpp/variant_class.html>`_ class. Variants can store Variant-compatible data structures such as :ref:`Array <class_Array>` and :ref:`Dictionary <class_Dictionary>` as well as :ref:`Object <class_Object>` s.
es: Godot almacena todas las variables del API de scripting en la clase `Variant <https://docs.godotengine.org/en/latest/development/cpp/variant_class.html>`_ . Las Variants pueden guardar estructuras de datos compatible con Variant como :ref:`Array <class_Array>` y :ref:`Dictionary <class_Dictionary>` y también :ref:`Object <class_Object>`.
zh_cn: Godot将所有变量存储在 `Variant <https://docs.godotengine.org/en/latest/development/cpp/variant_class.html>`_ 类的脚本API中.``Variant`` 可以存储与 ``Variant`` 兼容的数据结构,例如 :ref:`Array <class_Array>` 和 :ref:`Dictionary <class_Dictionary>` 以及 :ref:`Object <class_Object>` .

source: Godot implements Array as a ``Vector<Variant>``. The engine stores the Array contents in a contiguous section of memory, i.e. they are in a row adjacent to each other.
es: Godot implementa Arrays como ``Vector<Variant>``. El motor almacena el contenido del Array en secciones contínuas de memoria, es decir, están adyacentes uno con el otro en fila.
zh_cn: Godot将数组实现为 ``Vector<Variant>``.引擎将数组内容存储在一个连续的内存段中,也就是说,它们是连续相邻的.

source: For those unfamiliar with C++, a Vector is the name of the array object in traditional C++ libraries. It is a "templated" type, meaning that its records can only contain a particular type (denoted by angled brackets). So, for example, a :ref:`PoolStringArray <class_PoolStringArray>` would be something like a ``Vector<String>``.
es: Para los que no están familiarizados con C++, Vector es el nombre del objeto array en las librerías tradicionales de C++. Se trata de un tipo de "plantilla", lo que significa que sus registros sólo pueden contener un tipo particular (indicado mediante corchetes angulares). Así, por ejemplo, un :ref:`PoolStringArray <class_PoolStringArray>` sería algo así como un ``Vector<String>``.
zh_cn: 对于不熟悉C++的人来说,``Vector`` 是传统C++库中数组对象的名称.它是一个"模板化"类型,这意味着它的记录只能包含特定的类型(用尖括号表示).举个例子,一个 :ref:`PoolStringArray <class_PoolStringArray>` 类似于一个 ``Vector<String>``.

source: Contiguous memory stores imply the following operation performance:
es: Los almacenes de memoria contiguos implican el siguiente rendimiento de la operación:
zh_cn: 连续的内存存储意味着以下操作性能:

source: **Iterate:** Fastest. Great for loops.
es: **Iterate:** El más rápido. Ideal para loops.
zh_cn: **迭代**:最快.非常适合循环.

source: Op: All it does is increment a counter to get to the next record.
es: Op: Lo único que hace es incrementar un contador para llegar al siguiente registro.
zh_cn: 运行:它所做的就是增加一个计数器,以得到下一个记录.

source: **Insert, Erase, Move:** Position-dependent. Generally slow.
es: **Insert, Erase, Move:** Depende de la posición. En general, es lento.
zh_cn: **插入、删除、移动**:依赖于位置.一般慢.

source: Op: Adding/removing/moving content involves moving the adjacent records over (to make room / fill space).
es: Op: Añadir/eliminar/mover contenido implica mover los registros adyacentes (para hacer espacio / ocupar espacio).
zh_cn: 运行:添加/删除/移动内容,涉及移动相邻的记录(腾出房间/填补空间).

source: Fast add/remove *from the end*.
es: Añadir/eliminar rápidamente *desde el final*.
zh_cn: 快速的 *从末尾* 添加/删除.

source: Slow add/remove *from an arbitrary position*.
es: Añadir/eliminar lentamente *desde una posición arbitraria*.
zh_cn: 慢速的 *从任意位置* 添加/删除.

source: Slowest add/remove *from the front*.
es: Añadir/eliminar más lentamente *desde el frente*.
zh_cn: 最慢的 *从前面* 添加/删除.

source: If doing many inserts/removals *from the front*, then...
es: Si se hacen muchas inserciones/eliminaciones *desde el frente*, entonces...
zh_cn: 如果执行多次 *从前面* 插入/删除,那么…

source: invert the array.
es: invertir el array.
zh_cn: 反转数组.

source: do a loop which executes the Array changes *at the end*.
es: haz un bucle que ejecute los cambios del Array *al final*.
zh_cn: 执行一个循环,该循环 *在末尾* 执行数组更改.

source: re-invert the array.
es: reinvierte el array.
zh_cn: 重新反转数组.

source: This makes only 2 copies of the array (still constant time, but slow) versus copying roughly 1/2 of the array, on average, N times (linear time).
es: Esto hace solo 2 copias del array (aun en tiempo constante, pero lento) en comparación a copiar alrededor de la mitad del array, en promedio, N veces (tiempo lineal).
zh_cn: 这只是复制了数组的两个副本(仍然是常数时间,但是速度很慢),大约复制了数组的1/2,平均N次(线性时间).

source: **Get, Set:** Fastest *by position*. Ex. can request 0th, 2nd, 10th record, etc. but cannot specify which record you want.
es: **Get, Set:** Más rápido *por posición*. Por ejemplo, puedes solicitar el registro 0º, 2º, 10º, etc., pero no puedes especificar qué registro deseas.
zh_cn: **取值,设值**:*按位置* 最快.例如:可以请求第0、第2、第10条记录,诸如此类,但不能指定想要哪个记录.

source: Op: 1 addition operation from array start position up to desired index.
es: Op: Una operación de adición desde el comienzo del array hasta la posición del índice deseado.
zh_cn: 操作:从数组起始位置到所需索引的1个加法运算.

source: **Find:** Slowest. Identifies the index/position of a value.
es: **Find:** El más lento. Identifica el índice/posición de un valor.
zh_cn: **查找**:最慢.识别一个数值的索引/位置.

source: Op: Must iterate through array and compare values until one finds a match.
es: Op: Iterar a través del array y compara los valores hasta que encuentre una coincidencia.
zh_cn: 操作:必须遍历数组并比较值,直到找到匹配的为止.

source: Performance is also dependent on whether one needs an exhaustive search.
es: El rendimiento también depende de si uno necesita una búsqueda exhaustiva o no.
zh_cn: 性能也取决于是否需要一个详尽的搜索.

source: If kept ordered, custom search operations can bring it to logarithmic time (relatively fast). Laymen users won't be comfortable with this though. Done by re-sorting the Array after every edit and writing an ordered-aware search algorithm.
es: Cuando se mantienen ordenadas, las operaciones de búsqueda personalizada pueden llegar a tiempo logarítmico (relativamente rápido). Sin embargo, los usuarios inexpertos no se sentirán cómodos con esto. Se hace reordenando el Array después de cada edición y escribiendo un algoritmo de búsqueda ordenado.
zh_cn: 如果保持有序,自定义搜索操作,可以使其达到对数时间(相对较快).不过,外行用户对此会感到不舒服.通过在每次编辑之后,重新排序数组,并编写一个感知顺序的搜索算法来完成.

source: Godot implements Dictionary as an ``OrderedHashMap<Variant, Variant>``. The engine stores a small array (initialized to 2^3 or 8 records) of key-value pairs. When one attempts to access a value, they provide it a key. It then *hashes* the key, i.e. converts it into a number. The "hash" is used to calculate the index into the array. As an array, the OHM then has a quick lookup within the "table" of keys mapped to values. When the HashMap becomes too full, it increases to the next power of 2 (so, 16 records, then 32, etc.) and rebuilds the structure.
zh_cn: Godot将Dictionary[字典]实现为一个 ``OrderedHashMap<Variant, Variant>`` .引擎存储一个键值对的小数组(初始化为2^3或8条记录).当试图访问一个值时,它提供一个键.然后,对键进行 *哈希* 处理,即转换成一个数字."哈希" 值用来计算进入数组的索引.作为一个数组,OHM就可以在键映射到值的 "表" 中快速查找.当HashMap变得过满时,它会增加到2的下一个幂值(以 16条记录,然后是32条,等等),并重新构建结构.

source: Hashes are to reduce the chance of a key collision. If one occurs, the table must recalculate another index for the value that takes the previous position into account. In all, this results in constant-time access to all records at the expense of memory and some minor operational efficiency.
es: Los "Hashes" son para reducir la posibilidad de una colisión de llaves. Si se produce uno, la tabla debe recalcular otro índice para el valor que tenga en cuenta la posición anterior. En total, esto resulta en un acceso constante a todos los registros a expensas de la memoria y de una menor eficiencia operativa.
zh_cn: 散列是为了减少键碰撞的机会.如果发生了,列表必须为考虑前一个位置的值,重新计算另一个索引.总之,这导致以牺牲内存和一些较小的操作效率为代价,对所有记录的常量时间访问.

source: Hashing every key an arbitrary number of times.
es: Hashing de cada clave un número arbitrario de veces.
zh_cn: 散列每个键任意次数.

source: Hash operations are constant-time, so even if an algorithm must do more than one, as long as the number of hash calculations doesn't become too dependent on the density of the table, things will stay fast. Which leads to...
es: Las operaciones Hash son constantes, así que incluso si un algoritmo debe hacer más de una, siempre y cuando el número de cálculos hash no dependa demasiado de la densidad de la tabla, las cosas se mantendrán rápidas. Lo que lleva a...
zh_cn: 散列操作是常量时间的,因此即使一个算法必须执行多于一个,只要散列计算的数量不太依赖于列表的密度,一切都会保持快速.这导致了……

source: Maintaining an ever-growing size for the table.
zh_cn: 保持不断增长的表规模.

source: HashMaps maintain gaps of unused memory interspersed in the table on purpose to reduce hash collisions and maintain the speed of accesses. This is why it constantly increases in size quadratically by powers of 2.
zh_cn: HashMaps为了减少哈希冲突,并保持访问速度,在表中保留了未使用的内存的间隙.这也是为什么它的大小不断地以2的幂次增加的原因.

source: As one might be able to tell, Dictionaries specialize in tasks that Arrays do not. An overview of their operational details is as follows:
es: Como se puede ver, los Diccionarios se especializan en tareas que los Arrays no pueden realizar. A continuación se muestra un resumen general de sus detalles operativos:
zh_cn: 如大家所知,Dictionaries [字典]擅长的任务是Arrays[数组]所不擅长的.其操作细节概述如下:

source: **Iterate:** Fast.
es: **Iterate:** Rápido.
zh_cn: **迭代**:快速.

source: Op: Iterate over the map's internal vector of hashes. Return each key. Afterwards, users then use the key to jump to and return the desired value.
es: Op: Iterar sobre el vector interno del mapa de hashes. Devuelve cada clave. Después, los usuarios utilizan la clave para saltar y devolver el valor deseado.
zh_cn: 操作:遍历映射的内部散列向量.返回每个键.之后,用户使用该键跳转到并返回所需的值.

source: **Insert, Erase, Move:** Fastest.
es: **Insert, Erase, Move:** Más rápido.
zh_cn: **插入,删除,移动**:最快.

source: Op: Hash the given key. Do 1 addition operation to look up the appropriate value (array start + offset). Move is two of these (one insert, one erase). The map must do some maintenance to preserve its capabilities:
es: Op: Hash de la clave devuelta. Realiza una operación de adición para buscar el valor apropiado (inicio del array + offset). El desplazamiento consta de dos de estos dos pasos (uno para insertar y otro para borrar). El mapa debe hacer algún tipo de mantenimiento para conservar sus capacidades:
zh_cn: 操作:散列给定的键.执行1个加法操作来查找适当的值(数组开始+偏移量).移动其中的两个(一个插入,一个擦除).映射必须进行一些维护,以保留其功能:

source: update ordered List of records.
es: actualización ordenada de la Lista de registros.
zh_cn: 更新记录的有序列表.

source: determine if table density mandates a need to expand table capacity.
es: determinará si la densidad de las tablas requiere ampliar la capacidad de las mismas.
zh_cn: 确定列表密度,是否需要扩展列表容量.

source: The Dictionary remembers in what order users inserted its keys. This enables it to execute reliable iterations.
es: El Diccionario recuerda en qué orden los usuarios insertaron sus claves. Esto le permite ejecutar iteraciones de forma segura.
zh_cn: 字典会记住用户插入键的顺序.这使它能够执行可靠的迭代.

source: **Get, Set:** Fastest. Same as a lookup *by key*.
es: **Get, Set:** El más rápido. Igual que una búsqueda *por clave*.
zh_cn: **取值,设值**:最快.和*根据键*查找相同.

source: Op: Same as insert/erase/move.
es: Op: Igual que insertar/borrar/mover.
zh_cn: 操作:和插入/删除/移动类似.

source: **Find:** Slowest. Identifies the key of a value.
es: **Find:** El más lento. Identifica la clave de un valor.
zh_cn: **查找**:最慢.标识值的键.

source: Op: Must iterate through records and compare the value until a match is found.
es: Op: Debe iterar a través de los registros y comparar el valor hasta que se encuentre una coincidencia.
zh_cn: 操作:必须遍历记录并比较该值,直到找到匹配的为止.

source: Note that Godot does not provide this feature out-of-the-box (because they aren't meant for this task).
es: Hay que tener en cuenta que Godot no proporciona esta característica out-of-the-box (porque no están pensados para esta tarea).
zh_cn: 请注意,Godot并未开箱即用地提供此功能(因为它们并非用于此任务).

source: Godot implements Objects as stupid, but dynamic containers of data content. Objects query data sources when posed questions. For example, to answer the question, "do you have a property called, 'position'?", it might ask its :ref:`script <class_Script>` or the :ref:`ClassDB <class_ClassDB>`. One can find more information about what objects are and how they work in the :ref:`doc_what_are_godot_classes` article.
es: Godot implementa Objects como tontos, pero también como contenedores dinámicos de contenido de datos. Los objetos consultan las fuentes de datos cuando se plantean preguntas. Por ejemplo, para responder a la pregunta "¿tienes una propiedad llamada 'position'?", podría preguntar su :ref:`script <class_Script>` o el :ref:`ClassDB <class_ClassDB>`. Se puede encontrar más información sobre qué son los objetos y cómo funcionan en el artículo :ref:`doc_what_are_godot_classes`.
zh_cn: Godot用愚蠢、但动态的方式容纳数据容器实现对象.提出问题时,对象将查询数据源.例如,要回答"您是否有一个名为 ``position`` 的属性？"的问题,它可能会询问其 :ref:`script <class_Script>` 或 :ref:`ClassDB <class_ClassDB>`.您可以在 :ref:`doc_what_are_godot_classes` 文章中,找到有关什么是对象以及它们如何工作的更多信息.

source: The important detail here is the complexity of the Object's task. Every time it performs one of these multi-source queries, it runs through *several* iteration loops and HashMap lookups. What's more, the queries are linear-time operations dependent on the Object's inheritance hierarchy size. If the class the Object queries (its current class) doesn't find anything, the request defers to the next base class, all the way up until the original Object class. While these are each fast operations in isolation, the fact that it must make so many checks is what makes them slower than both of the alternatives for looking up data.
es: El detalle importante aquí es la complejidad de la tarea del Object. Cada tiempo que performa una de esas consultas multi-source, este va a través de *muchos* bucles iteración y búsquedas en HashMaps. Lo que es más, las consultas son operaciones lineales en el tiempo y dependen del tamaño de herencia del Object. Si la clase que consulta Object (clase actual) no encuentra nada, el pedido se difiere a la siguiente clase base hacia arriba hasta la clase Object original. Aunque esas operaciones sean realizadas rápidamente de manera aislada, la realidad es que se deben hacer muchas comprobaciones lo que las hace más lentas que las dos alternativas para buscar datos.
zh_cn: 这里重要的细节是对象任务的复杂性.每次执行这些多源查询时,它运行 *几个* 迭代循环和哈希表查找.此外,查询是线性时间操作,依赖于对象的继承层次结构大小.如果 ``Object`` 查询的类(当前类)什么都没有找到,则该请求将一直推迟到下一个基类,一直到原始 ``Object`` 类为止.虽然这些都是单独的快速操作,但它必须进行如此多的检查,于是这一事实使得它们比查找数据的两种方法都要慢.

source: When developers mention how slow the scripting API is, it is this chain of queries they refer to. Compared to compiled C++ code where the application knows exactly where to go to find anything, it is inevitable that scripting API operations will take much longer. They must locate the source of any relevant data before they can attempt to access it.
es: Cuando los desarrolladores mencionan lo lenta que es la API de scripting, se refieren a esta cadena de consultas. En comparación con el código C++ compilado, en el que la aplicación sabe exactamente dónde encontrar cualquier cosa, es inevitable que las operaciones de la API de secuencias de comandos tarden mucho más tiempo. Deben localizar la fuente de cualquier dato relevante antes de intentar acceder a ella.
zh_cn: 当开发人员提到脚本API有多慢时,所引用的正是这一系列查询.与编译后的,应用程序知道在哪里可以找到任何东西的,C++代码相比,不可避免的是,脚本API操作将花费更长的时间.他们必须定位任何相关数据的来源,然后才能尝试访问它.

source: The reason GDScript is slow is because every operation it performs passes through this system.
es: La razón por la cual GDScript es lento es porque cada operación que realiza pasa a través de este sistema.
zh_cn: GDScript很慢的原因是,它执行的每个操作都要经过这个系统.

source: C# can process some content at higher speeds via more optimized bytecode. But, if the C# script calls into an engine class' content or if the script tries to access something external to it, it will go through this pipeline.
es: C# puede procesar parte de los contenidos a mayor velocidad mediante un bytecode más optimizado. Pero, si el script C# llama al contenido de una clase de motor o si el script intenta acceder a algo externo a él, pasará por este proceso.
zh_cn: C#可以通过更优化的字节码,以更快的速度处理一些内容.但是,如果C#脚本调用引擎类的内容,或者脚本试图访问它的外部内容,它会通过这个管道.

source: NativeScript C++ goes even further and keeps everything internal by default. Calls into external structures will go through the scripting API. In NativeScript C++, registering methods to expose them to the scripting API is a manual task. It is at this point that external, non-C++ classes will use the API to locate them.
es: NativeScript C++ va aún más lejos y mantiene todo interno por defecto. Las llamadas a estructuras externas pasarán por la API de scripting. En NativeScript C++, el registro de métodos para exponerlos a la API de scripting es una tarea manual. Es en este punto donde las clases externas, que no son de tipo C++, utilizarán la API para localizarlas.
zh_cn: NativeScript C++甚至更进一步,默认将所有内容都保持在内部.对外部结构的调用将通过脚本API进行.在NativeScript C++中,注册方法以将其公开给脚本API是一项手动任务.至此,外部非C++类将使用API来查找它们.

source: So, assuming one extends from Reference to create a data structure, like an Array or Dictionary, why choose an Object over the other two options?
es: Por lo tanto, asumiendo que uno se extiende desde Reference para crear una estructura de datos, como un Array o un Dictionary, ¿por qué elegir un Object en lugar de las otras dos opciones?
zh_cn: 因此,假设从引用扩展到创建数据结构,比如一个 ``Array`` 或 ``Dictionary``,为什么选择一个 ``Object`` 而不是其他两个选项？

source: **Control:** With objects comes the ability to create more sophisticated structures. One can layer abstractions over the data to ensure the external API doesn't change in response to internal data structure changes. What's more, Objects can have signals, allowing for reactive behavior.
es: **Control:** Con objetos se tiene la capacidad de crear estructuras más sofisticadas. Se pueden realizar abstracciones en capas sobre los datos para asegurar que la API externa no cambie en respuesta a los cambios en la estructura de los datos internos. Además, los objetos pueden tener señales, lo que permite un comportamiento reactivo.
zh_cn: **控件**:对象能够创建更复杂的结构.可以在数据上分层抽象,以确保外部API不会响应内部数据结构的更改.更重要的是,对象可以有信号,允许响应式行为.对象带来了创建更复杂结构的能力.

source: **Clarity:** Objects are a reliable data source when it comes to the data that scripts and engine classes define for them. Properties may not hold the values one expects, but one doesn't need to worry about whether the property exists in the first place.
es: **Claridad:** Los objetos son una fuente de datos confiable cuando se trata de los datos que los scripts y las clases de motor definen para sí mismos. Las propiedades pueden no tener los valores que uno espera, pero uno no necesita preocuparse de si la propiedad existe en primer lugar.
zh_cn: **清晰**:当涉及到脚本和引擎类为对象定义的数据时,对象是一个可靠的数据源.属性可能不包含期望的值,但是无需担心这个属性是否首先存在.

source: **Convenience:** If one already has a similar data structure in mind, then extending from an existing class makes the task of building the data structure much easier. In comparison, Arrays and Dictionaries don't fulfill all use cases one might have.
es: **Conveniencia:** Si ya se tiene una estructura de datos similar en mente, entonces extenderse desde una clase existente hace que la tarea de construir la estructura de datos sea mucho más fácil. En comparación, los Arrays y Diccionarios no satisfacen todos los casos de uso que uno pueda tener.
zh_cn: **便利**:如果已经有了类似的数据结构,之后从现有类扩展,可以使构建数据结构的任务变得容易得多.相比之下,数组和字典不能满足所有的用例.
