Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/godot_interfaces.po
Languages: fr, uk, zh_cn

source: Godot interfaces
fr: Interfaces de Godot
uk: Інтерфейси Godot

source: Often one needs scripts that rely on other objects for features. There are 2 parts to this process:
fr: Souvent, on a besoin de scripts qui s'appuient sur d'autres objets pour des fonctionnalités. Il y a 2 parties à ce processus :
uk: Часто потрібні скрипти, які покладаються на інші об'єкти для функцій. Цей процес має 2 частини:
zh_cn: 通常需要依赖于其他对象的脚本来提供特性。这个过程分为两部分：

source: Acquiring a reference to the object that presumably has the features.
fr: Acquisition d'une référence à l'objet qui possède vraisemblablement les fonctionnalités.
uk: Отримання посилання на об’єкт, який, імовірно, має особливості.
zh_cn: 获取对可能具有这些特性的对象的引用。

source: Accessing the data or logic from the object.
fr: Accès aux données ou à la logique à partir de l'objet.
uk: Доступ до даних або логіки від об’єкта.
zh_cn: 处理来自对象的数据或逻辑。

source: The rest of this tutorial outlines the various ways of doing all this.
fr: La suite de ce tutoriel décrit les différentes façons de faire tout cela.
uk: Решта цього посібника описує різні способи зробити все це.
zh_cn: 本教程的其余部分，概述了实现这一切的各种方法。

source: Acquiring object references
fr: Acquisition de références d'objets
uk: Отримання посилань на об’єкти

source: For all :ref:`Object <class_Object>`\s, the most basic way of referencing them is to get a reference to an existing object from another acquired instance.
fr: Pour tous les :ref:`Object <class_Object>`\s, la façon la plus simple de les référencer est d'obtenir une référence à un objet existant depuis une autre instance acquise.
uk: Для всіх :ref:`Об'єктів <class_Object>` основним способом посилання на них, є отримання посилання на існуючий об’єкт з іншого придбаного екземпляра.
zh_cn: 对所有:参考:`对象<类_对象>`来说，引用它们最基本的方法，是从另一个获取的实例中获取对现有对象的引用。

source: The same principle applies for :ref:`Reference <class_Reference>` objects. While users often access :ref:`Node <class_Node>` and :ref:`Resource <class_Resource>` this way, alternative measures are available.
fr: Le même principe s'applique aux objets :ref:`Référence <class_Reference>`. Bien que les utilisateurs accèdent souvent à :ref:`Node <class_Node>` et :ref:`Resource <class_Resource>` de cette façon, des mesures alternatives sont disponibles.
uk: Той самий принцип застосовується до :ref:`Посилань <class_Reference>`. Таким же чином користувачі часто отримують доступ до :ref:`Вузлів <class_Node>` та :ref:`Ресурсів <class_Resource>`, але доступні альтернативні способи.
zh_cn: 同样的原则也适用于:参考:`引用<类_引用>`对象。虽然用户经常以这种方式访问:参考:`节点<类_节点>`和:参考:`资源<类_资源>`，还可以采取其他措施。

source: Instead of property or method access, one can get Resources by load access.
fr: Au lieu de l'accès à la propriété ou à la méthode, on peut obtenir des ressources par accès par chargement.
uk: Замість доступу до властивостей або методів можна отримати Ресурси за допомогою доступу до завантаження.
zh_cn: 而不是属性或方法访问，可以通过加载访问获得资源。

source: Note the following:
fr: Notez ce qui suit :
uk: Пам'ятайте наступне:

source: There are many ways in which a language can load such resources.
fr: Il existe de nombreuses façons pour un langage de charger de telles ressources.
uk: Існує багато способів, якими мова може завантажити такі ресурси.
zh_cn: 一种语言可以通过多种方式加载这些资源。

source: When designing how objects will access data, don't forget that one can pass resources around as references as well.
fr: Lors de la conception de la manière dont les objets accéderont aux données, n'oubliez pas qu'il est également possible de faire circuler des ressources comme références.
uk: Розробляючи спосіб доступу об'єктів до даних, не забувайте, що можна передавати ресурси як посилання.
zh_cn: 在设计对象如何访问数据时，不要忘记，还可以将资源作为引用传递。

source: Keep in mind that loading a resource fetches the cached resource instance maintained by the engine. To get a new object, one must :ref:`duplicate <class_Resource_method_duplicate>` an existing reference or instantiate one from scratch with ``new()``.
fr: Gardez à l'esprit que le chargement d'une ressource récupère l'instance de ressource mise en cache maintenue par le moteur. Pour obtenir un nouvel objet, il faut :ref:`duplicate <class_Resource_method_duplicate>` une référence existante ou en instancier une à partir de zéro avec ``new()``.
uk: Майте на увазі, що завантаження ресурсу отримує кешований екземпляр ресурсу, який підтримує движок. Щоб отримати новий об'єкт, потрібно :ref:`продублювати<class_Resource_method_duplicate>` існуюче посилання або створити його з нуля з допомогою ``new()``.
zh_cn: 请记住，加载资源将获取引擎维护的缓存资源实例。要获取一个新对象，必须:参考:`复制<类_资源_方法_复制>`一个现有引用，或者使用``new()``从头实例化一个引用。

source: Nodes likewise have an alternative access point: the SceneTree.
fr: Les nœuds ont également un autre point d'accès : le SceneTree.
uk: Вузли також мають альтернативну точку доступу: Дерево Сцен.
zh_cn: 节点也有一个可选的访问点：场景树。

source: Accessing data or logic from an object
fr: Accès aux données ou à la logique à partir d'un objet
uk: Доступ до даних або логіки від об’єкта
zh_cn: 处理来自对象的数据或逻辑

source: Godot's scripting API is duck-typed. This means that if a script executes an operation, Godot doesn't validate that it supports the operation by **type**. It instead checks that the object **implements** the individual method.
fr: L'API de script de Godot est duck-typed. Cela signifie que si un script exécute une opération, Godot ne valide pas qu'il supporte l'opération par **type**. Au lieu de cela, il vérifie que l'objet **implémente** la méthode individuelle.
uk: API скриптів Godot є качиною типізацією. Це означає, що якщо скрипт виконує операцію, Godot не перевіряє, чи підтримується операція за **типом**. Натомість він перевіряє, чи **реалізує об'єкт** індивідуальний метод.
zh_cn: Godot的脚本API是隐藏类型。这意味着如果脚本执行某个操作，Godot不验证它是否支持**类型**操作。相反，它检查对象**实现**的单独方法。

source: For example, the :ref:`CanvasItem <class_CanvasItem>` class has a ``visible`` property. All properties exposed to the scripting API are in fact a setter and getter pair bound to a name. If one tried to access :ref:`CanvasItem.visible <class_CanvasItem_property_visible>`, then Godot would do the following checks, in order:
fr: Par exemple, la classe :ref:`CanvasItem <class_CanvasItem>` a une propriété ``visible``. Toutes les propriétés exposées à l'API de script sont en fait une paire setter et getter liée à un nom. Si on essayait d'accéder à :ref:`CanvasItem.visible <class_CanvasItem_property_property_visible>`, alors Godot ferait les vérifications suivantes, dans l'ordre :
uk: Наприклад, клас :ref:`CanvasItem <class_CanvasItem>` має властивість ``visible``. Усі властивості, які піддаються API скриптів, насправді є парами сеттер та геттер, прив'язаними до імені. Якби хтось спробував отримати доступ до :ref:`CanvasItem.visible <class_CanvasItem_property_visible>`, то Godot зробив би наступні перевірки по порядку:
zh_cn: 例如，:参考:`画布组件 <类_画布组件>`类有一个“可见性”的属性。暴露给脚本API的所有属性，实际上都是绑定到名称的设值函数和取值函数对。如果有人试图访问:参考:`画布组件.可见性 <类_画布组件_属性_可见性>`，那么Godot会按照以下顺序进行检查：

source: If the object has a script attached, it will attempt to set the property through the script. This leaves open the opportunity for scripts to override a property defined on a base object by overriding the setter method for the property.
fr: Si l'objet a un script attaché, il tentera de définir la propriété à travers le script. Ceci laisse la possibilité pour les scripts de substituer une propriété définie sur un objet de base en substituant la méthode setter de la propriété.
uk: Якщо до об'єкта прикріплений скрипт, він спробує встановити властивість за допомогою скрипта. Це залишає відкритою можливість для скриптів замінити властивість, визначену на базовому об’єкті, замінивши метод сеттера для властивості.
zh_cn: 如果对象附加了脚本，它将尝试通过脚本设置属性。这就为脚本提供了重写基础对象上定义的属性的机会，方法是重写属性的设值函数方法。

source: If the script does not have the property, it performs a HashMap lookup in the ClassDB for the "visible" property against the CanvasItem class and all of its inherited types. If found, it will call the bound setter or getter. For more information about HashMaps, see the :ref:`data preferences <doc_data_preferences>` docs.
fr: Si le script n'a pas la propriété, il effectue une recherche HashMap dans la ClassDB pour la propriété "visible" envers la classe CanvasItem et tous ses types hérités. S'il est trouvé, il appellera le setter ou le getter lié. Pour plus d'informations sur HashMaps, consultez :ref:`data preferences <doc_data_preferences>`.
uk: Якщо скрипт не має властивості, він виконує пошук HashMap у ClassDB для властивості "visible" класу CanvasItem та всіх його успадкованих типів. При знаходженні, він викличе пов’язаного сетера або геттера. Для отримання додаткової інформації про HashMaps дивіться документи по :ref:`налаштуванні даних<doc_data_preferences>`.
zh_cn: 如果脚本没有该属性，它在类数据库中对画布组件类及其所有继承类型执行“可见性”属性的哈希表查找。如果找到，它将调用绑定的设值函数或取值函数。有关哈希表的更多信息，参见:参考:`数据偏好<文档_数据_偏好>`文档。

source: If not found, it does an explicit check to see if the user wants to access the "script" or "meta" properties.
fr: S'il n'est pas trouvé, il vérifie explicitement si l'utilisateur veut accéder aux propriétés "script" ou "meta".
uk: Якщо пошук буде не вдалий, він явно перевіряє, чи хоче користувач отримати доступ до властивостей "script" або "meta".
zh_cn: 如果没有找到，它会显式地检查用户是否想要访问“脚本”或“元”属性。

source: If not, it checks for a ``_set``/``_get`` implementation (depending on type of access) in the CanvasItem and its inherited types. These methods can execute logic that gives the impression that the Object has a property. This is also the case with the ``_get_property_list`` method.
fr: Si ce n'est pas le cas, il vérifie la présence d'une implémentation ``_set``/``_get`` (selon le type d'accès) dans l'élément CanvasItem et ses types hérités. Ces méthodes peuvent exécuter une logique qui donne l'impression que l'Objet possède une propriété. C'est également le cas avec la méthode ``_get_property_list``.
uk: Якщо ні, то він перевіряє наявність реалізації ``_set``/``_get`` (залежно від типу доступу) у CanvasItem та його успадкованих типах. Ці методи можуть виконувати логіку, яка створює враження, що Об'єкт має властивість. Це також стосується метода ``_get_property_list``.
zh_cn: 如果没有，它将检查画布组件中的``_设值``/``_取值``实现(取决于访问的类型)及其继承类型。这些方法可以执行逻辑，从而给人一种对象具有属性的印象。``_获取_属性_列表``方法也是如此。

source: Note that this happens even for non-legal symbol names such as in the case of :ref:`TileSet <class_TileSet>`'s "1/tile_name" property. This refers to the name of the tile with ID 1, i.e. :ref:`TileSet.tile_get_name(1) <class_TileSet_method_tile_get_name>`.
fr: Notez que cela se produit même pour les noms de symboles non légaux comme dans le cas de :ref:`TileSet <class_TileSet>`la propriété "1/tile_name". Il s'agit du nom de la tuile avec ID 1, i.e. :ref:`TileSet.tile_get_name(1) <class_TileSet_method_tile_get_name>`.
uk: Зауважте, що це відбувається навіть для неприйнятних іменами символів, наприклад, у випадку властивості :ref:`TileSet <class_TileSet>` "1/tile_name". Це стосується назви плитки з ідентифікатором 1, тобто :ref:`TileSet.tile_get_name(1) <class_TileSet_method_tile_get_name>`.

source: As a result, this duck-typed system can locate a property either in the script, the object's class, or any class that object inherits, but only for things which extend Object.
fr: En conséquence, ce système duck-typed peut localiser une propriété soit dans le script, soit dans la classe de l'objet, soit dans n'importe quelle classe dont l'objet hérite, mais seulement pour les choses qui étendent de Object.
uk: Як результат, система качиної типізації, може знаходити властивість або у скрипт, і в класі об’єкта, і в будь-якому класі, який об’єкт успадковує, але лише для речей, які розширюють Об’єкт.
zh_cn: 因此，这个隐藏类型系统可以在脚本中找到一个属性，对象的类，或对象继承的任何类，但仅适用于扩展对象的对象。

source: Godot provides a variety of options for performing runtime checks on these accesses:
fr: Godot fournit une variété d'options pour effectuer des contrôles d'exécution sur ces accès :
uk: Godot пропонує безліч варіантів для виконання таких перевірок:
zh_cn: Godot提供了多种选项，来执行这些访问的运行时检查：

source: A duck-typed property access. These will property check (as described above). If the operation isn't supported by the object, execution will halt.
fr: Un accès à des propriétés de façon duck-typed. Celles-ci feront l'objet d'un contrôle de propriété (tel que décrit ci-dessus). Si l'opération n'est pas supportée par l'objet, l'exécution s'arrête.
uk: Доступ до властивості качиної типізації. Це буде перевірка властивостей (як описано вище). Якщо об'єкт не підтримує операцію, виконання зупиняється.
zh_cn: 隐藏类型的属性访问。这些将检查属性(如上所述)。如果对象不支持该操作，将停止执行。

source: A method check. In the case of :ref:`CanvasItem.visible <class_CanvasItem_property_visible>`, one can access the methods, ``set_visible`` and ``is_visible`` like any other method.
fr: Un contrôle de méthode. Dans le cas de :ref:`CanvasItem.visible <class_CanvasItem_property_property_visible>`, on peut accéder aux méthodes, ``set_visible`` et ``is_visible`` comme toute autre méthode.
uk: Перевірка метода. У випадку з :ref:`CanvasItem.visible <class_CanvasItem_property_visible>`, можна отримати доступ до методів ``set_visible`` і ``is_visible`` як до будь-якого іншого методу.
zh_cn: 一种检查方法。在:参考:`画布组件.可见性 <类_画布组件_属性_可见性>`的情况下，我们可以访问这些方法，``设置_可见性``和``为_可见性``与任何其他方法一样。

source: Outsource the access to a :ref:`FuncRef <class_FuncRef>`. These may be useful in cases where one needs the max level of freedom from dependencies. In this case, one relies on an external context to setup the method.
fr: Externaliser l'accès à un :ref:`FuncRef <class_FuncRef>`. Celles-ci peuvent être utiles dans les cas où l'on a besoin d'un niveau maximum de liberté des dépendances. Dans ce cas, on s'appuie sur un contexte externe pour configurer la méthode.
uk: Передача доступу до :ref:`FuncRef <class_FuncRef>`. Це може бути корисними у випадках, коли потрібен максимальний рівень позбавлення від залежностей. У цьому випадку для налаштування методу використовується зовнішній контекст.

source: These strategies contribute to Godot's flexible design. Between them, users have a breadth of tools to meet their specific needs.
fr: Ces stratégies contribuent à la souplesse de conception de Godot. Entre elles, les utilisateurs disposent d'un large éventail d'outils pour répondre à leurs besoins spécifiques.
uk: Цим стратегіям сприяє гнучка архітектура Godot. Окрім них користувачі мають широкий спектр інструментів для задоволення своїх конкретних потреб.
zh_cn: 这些策略有助于Godot的灵活设计。通过它们，用户可以使用多种工具来满足他们的特定需求。
