Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/scenes_versus_scripts.po
Languages: es, fr, ja, ru

source: When to use scenes versus scripts
es: Cuándo usar escenas y cuándo scripts
fr: Quand utiliser des scènes ou des scripts ?
ja: シーンとスクリプトを使用する場合
ru: Когда использовать сцены по сравнению со скриптами

source: We've already covered how scenes and scripts are different. Scripts define an engine class extension with imperative code, scenes with declarative code.
es: Ya hemos cubierto la diferencia entre escenas y scripts. Los scripts definen una extensión de clases del motor con código imperativo, las escenas lo hacen con código declarativo.
fr: Nous avons déjà expliqué en quoi les scènes et les scénarios sont différents. Les scripts définissent une extension de classe du moteur avec code impératif, les scènes avec code déclaratif.
ja: シーンとスクリプトの違いについてはすでに説明しました。スクリプトは、命令型コードでエンジンクラスの拡張を定義し、宣言型コードでシーンを定義します。
ru: Мы уже рассмотрели, чем отличаются сцены и скрипты. Скрипты определяют расширение класса движка с императивным кодом, сцены - с декларативным кодом.

source: Each system's capabilities are different as a result. Scenes can define how an extended class initializes, but not what its behavior actually is. Scenes are often used in conjunction with a script so that the scene acts as an extension of the scripts declarative code.
es: Como resultado, las capacidades de cada sistema son diferentes. Las escenas pueden definir cómo se inicializa una clase extendida, pero no cuál es su comportamiento. Las escenas también suelen ser usadas en conjunto con scripts, así que las escenas actúan como extensión del código declarativo del script.
fr: Les capacités de chaque système sont donc différentes. Les scènes peuvent définir comment une classe étendue s'initialise, mais pas quel est son comportement réel. Les scènes sont souvent utilisées en conjonction avec un script de sorte que la scène agit comme une extension du code déclaratif du script.
ja: 結果として、それぞれのシステムの機能は異なります。シーンは、拡張クラスの初期化方法を定義できますが、実際の動作は定義できません。シーンは多くの場合、スクリプトと組み合わせて使用されるため、シーンはスクリプトの宣言型コードの拡張機能として機能します。
ru: В результате возможности каждой системы различны. Сцены могут определять, как инициализируется расширенный класс, но не его поведение на самом деле. Сцены часто используются вместе со скриптами, поэтому сцена действует как расширение декларативного кода скрипта.

source: Anonymous types
es: Tipos anónimos
fr: Types anonymes
ja: 匿名型
ru: Анонимные типы

source: It *is* possible to completely define a scenes' contents using a script alone. This is, in essence, what the Godot Editor does, only in the C++ constructor of its objects.
es: Es posible definir escenas completamente usando sólo scripts. Esto es en escencia lo que hace el editor de Godot, sólo que lo hace en el constructor C++ de sus objetos.
fr: Il * est * possible de définir complètement le contenu des scènes à l’aide d’un seul script. Il s’agit, en substance, ce que fait l’éditeur Godot, uniquement dans le constructeur de C++ de ses objets.
ja: スクリプト\ *のみ*\ を使用してシーンのコンテンツを完全に定義することもできます。これは本質的にはGodotエディタで行うべきことですが、スクリプトで行う場合はそのオブジェクトのC++コンストラクタで行います。
ru: *Возможно* полностью определить содержимое сцены, используя только скрипт. Это, по сути, то, что делает редактор Godot, только в конструкторе C++ своих объектов.

source: But, choosing which one to use can be a dilemma. Creating script instances is identical to creating in-engine classes whereas handling scenes requires a change in API:
es: El dilema puede surgir al tener que elegir cuál usar. Crear instancias de un script es idéntico a crear clases en el motor, por lo que manipular escenas requiere un cambio en el API:
fr: Mais, choisir lequel utiliser peut être un dilemme. La création d'instances de script est identique à la création de classes dans le moteur alors que la gestion des scènes nécessite un changement dans l'API :
ja: しかし、どちらを使用するかを選択することはジレンマになる可能性があります。スクリプトインスタンスの作成はエンジン内クラスの作成と同じですが、シーンの処理にはAPIを変更する必要があります:
ru: Но выбор того, какой из них использовать, может оказаться дилеммой. Создание экземпляров скрипта идентично созданию классов в движке, тогда как обработка сцен требует изменения в API:

source: Also, scripts will operate a little slower than scenes due to the speed differences between engine and script code. The larger and more complex the node, the more reason there is to build it as a scene.
es: Además, los scripts funcionan un poco más lentos que las escenas debido a la diferencia de velocidad entre el motor y el código del script. Mientras más grande sea, más complejo es el nodo, lo que nos da una mayor razón para construirlo como escena.
fr: Aussi, les scripts fonctionnent un peu plus lentement que les scènes en raison de la différence de vitesse entre le moteur et le code de script. Plus grand et complexe est le nœud, plus il y a de raison de le construire comme une scène.
ja: また、エンジンとスクリプトコードの処理速度が異なるため、スクリプトの動作はシーンよりも少し遅くなります。ノードが大きく複雑になるほど、ノードをシーンとして構築する理由が増えます。
ru: Кроме того, скрипты будут работать немного медленнее, чем сцены, из-за разницы в скорости между движком и кодом скрипта. Чем больше и сложнее узел, тем больше причин строить его как сцену.

source: Named types
es: Tipos con nombre
fr: Types nommés
ja: 名前付き型

source: In some cases, a user can register a script as a new type within the editor itself. This displays it as a new type in the node or resource creation dialog with an optional icon. In these cases, the user's ability to use the script is much more streamlined. Rather than having to...
es: En algunos casos, un usuario puede registrar un script como un nuevo tipo de nodo en sí mismo. Esto muestra el tipo nuevo de nodo o recurso en el diálogo de creación con un icono opcional. En esos casos, la habilidad del usuario para usar scripts es mucho más simplificada. En lugar de tener que...
fr: Dans certains cas, un utilisateur peut enregistrer un script comme un nouveau type dans l'éditeur lui-même. Il s'affiche sous la forme d'un nouveau type dans la boîte de dialogue de création de nœud ou de ressource avec une icône facultative. Dans ces cas, la capacité de l'utilisateur à utiliser le script est beaucoup plus simple. Plutôt que d'avoir à....
ja: 場合によっては、ユーザーはエディタ自体の中でスクリプトを新しい型として登録できます。これにより、ノードまたはリソース作成ダイアログに新しい型として表示され、オプションのアイコンが表示されます。このような場合、ユーザーがスクリプトを使用する機能は大幅に合理化されます。むしろ...
ru: В некоторых случаях пользователь может зарегистрировать скрипт как новый тип в самом редакторе. Это отобразит его как новый тип в диалоговом окне создания узла или ресурса с дополнительным значком. В этих случаях возможности пользователя по использованию сценария значительно упрощаются. Вместо того, чтобы...

source: Know the base type of the script they would like to use.
es: Conocer el tipo base del script que quieran usar.
fr: Connaître le type de base du script qu'ils aimeraient utiliser.
ja: 使用するスクリプトの基本型を知っている。
ru: Знать базовый тип скрипта, который они хотели бы использовать.

source: Create an instance of that base type.
es: Crear una instancia de un tipo base.
fr: Créez une instance de ce type de base.
ja: その基本型のインスタンスを作成します。
ru: Создайте экземпляр этого базового типа.

source: Add the script to the node.
es: Agrega el script al nodo.
fr: Ajoutez le script au nœud.
ja: ノードにスクリプトを追加します。
ru: Добавьте скрипт в узел.

source: (Drag-n-drop method)
es: (Método de arrastrar y soltar)
fr: (Méthode glisser-déposer)
ja: (ドラッグアンドドロップ方式)
ru: (Метод Drag-n-drop)

source: Find the script in the FileSystem dock.
es: Encuentra el script en el panel de Sistema de Archivos.
fr: Recherchez le script dans le dock de système de fichiers.
ja: ファイル システムドックでスクリプトを見つけます。

source: Drag and drop the script onto the node in the Scene dock.
es: Arrastre el script hasta el nodo en el panel de escenas.
fr: Glissez et déposez le script sur le nœud dans le dock de la scène.
ja: スクリプトをシーンドックのノードにドラッグ アンド ドロップします。

source: (Property method)
es: (Método de propiedad)
fr: (Méthode de la propriété)
ja: (プロパティメソッド)
ru: (Метод свойства)

source: Scroll down to the bottom of the Inspector to find the ``script`` property and select it.
es: Baja al final del inspector para encontrar la propiedad ``script`` y selecciónala.
fr: Faites défiler vers le bas de l'inspecteur pour trouver la propriété ``script``et sélectionnez-la.
ja: インスペクタの一番下までスクロールして ``Script`` プロパティを見つけて選択します。
ru: Прокрутите вниз до нижней части инспектора, найдите свойство ``script`` и выберите его.

source: Select "Load" from the dropdown.
es: Selecciona ``Cargar`` de la lista desplegable.
fr: Sélectionnez "Charger" dans la liste déroulante.
ja: ドロップダウンから「読込み」を選択します。
ru: В раскрывающемся списке выберите "Load" (Загрузить).

source: Select the script from the file dialog.
es: Selecciona el script en el diálogo de selección de archivo.
fr: Sélectionnez le script dans la boîte de dialogue fichier.
ja: ファイル ダイアログからスクリプトを選択します。

source: With a registered script, the scripted type instead becomes a creation option like the other nodes and resources in the system. One need not do any of the above work. The creation dialog even has a search bar to look up the type by name.
es: Con un script registrado, el tipo del script se convierte en una opción de creación como los demás Node y Resource en el sistema. No es necesario hacer nada de lo mostrado anteriormente, el diálogo de creación además tiene una barra de búsqueda donde se puede buscar el tipo por nombre.
fr: Avec un script enregistré, le type de script devient une option de création comme les autres nœuds et ressources du système. Il n'est pas nécessaire d'effectuer les travaux ci-dessus. La boite de dialogue de création a même une barre de recherche pour rechercher le type par nom.
ja: この手順の代わりに登録済みスクリプトを使用すると、スクリプト化された型をシステム内の他のノードやリソースと同様な、作成オプションの一つにすることが出来ます。なので上記の作業を行う必要はありません。作成ダイアログには、(登録済みの)型を名前で検索するための検索バーがあります。
ru: При наличии зарегистрированного скрипта, тип сценария вместо этого становится вариантом создания, как и другие узлы и ресурсы в системе. Ничего из вышеперечисленного делать не нужно. В диалоговом окне создания даже есть строка поиска для поиска типа по имени.

source: There are two systems for registering types...
es: Existen dos modos de registrar tipos...
fr: Il y a deux systèmes d’enregistrement des types...
ja: 型を登録するための 2つのシステムがあります...
ru: Существует две системы регистрации типов...

source: :ref:`Custom Types <doc_making_plugins>`
es: :ref:`Tipos Personalizados <doc_making_plugins>`
fr: :ref:`Types personnalisés <doc_making_plugins>`
ja: :ref:`カスタム型<doc_making_plugins>`

source: Editor-only. Typenames are not accessible at runtime.
es: Solo para el editor. Los tipos con nombre no son accesibles en tiempo de ejecución.
fr: Éditeur seulement. Les noms de types ne sont pas accessibles au moment de l'exécution.
ja: エディタのみ。型名は実行時にはアクセスできません。
ru: Editor-only (Только редактор). Имена типов недоступны во время выполнения.

source: Does not support inherited custom types.
es: No soporta tipos personalizados heredados.
fr: Ne prend pas en charge les types personnalisés hérités.
ja: 継承されたカスタム型はサポートされていません。
ru: Не поддерживает унаследованные пользовательские типы.

source: An initializer tool. Creates the node with the script. Nothing more.
es: Una herramienta inicializadora. Crea el nodo con el script, nada más.
fr: Un outil d'initialisation. Crée le nœud avec le script. Rien de plus.
ja: 初期化ツール。スクリプトを使用してノードを作成します。これ以外の方法はありません。
ru: Инструмент инициализации. Создает узел со скриптом. Ничего более.

source: Editor has no type-awareness of the script or its relationship to other engine types or scripts.
es: El editor no está pendiente del tipo del script o su relación con otros tipos del engine o scripts.
fr: L'éditeur n'est pas conscient du type du script ou de sa relation avec d'autres types du moteurs ou scripts.
ja: エディタは、スクリプトの型や、他のエンジン内の型やスクリプトとの関係を認識しません。
ru: Редактор не имеет никакого представления о типе скрипта или его связи с другими типами движков или скриптов.

source: Allows users to define an icon.
es: Permite al usuario definir un icono.
fr: Permet aux utilisateurs de définir une icône.
ja: ユーザーがアイコンを定義できます。
ru: Позволяет пользователям определять значок.

source: Works for all scripting languages because it deals with Script resources in abstract.
es: Funciona para todos los lenguajes de scripting porque funciona con los recursos Script de manera abstracta.
fr: Fonctionne pour tous les langages de script parce qu'il traite des ressources de script dans l'abstrait.
ja: スクリプトリソースを抽象化して扱うので、すべてのスクリプト言語で動作します。
ru: Работает для всех скриптовых языков, потому что работает со скриптовыми ресурсами абстрактно.

source: Set up using :ref:`EditorPlugin.add_custom_type <class_EditorPlugin_method_add_custom_type>`.
es: Se configura usando :ref:`EditorPlugin.add_custom_type <class_EditorPlugin_method_add_custom_type>`.
fr: Configurer avec :ref:`EditorPlugin.add_custom_type <class_EditorPlugin_method_add_custom_type>`.
ja: :ref:`EditorPlugin.add_custom_type <class_EditorPlugin_method_add_custom_type>` を使用してセットアップします。
ru: Настройка с помощью :ref:`EditorPlugin.add_custom_type <class_EditorPlugin_method_add_custom_type>`.

source: :ref:`Script Classes <doc_scripting_continued_class_name>`
fr: :ref:`Classes de Script <doc_scripting_continued_class_name>`
ja: :ref:`スクリプトクラス<doc_scripting_continued_class_name>`
ru: :ref:`Классы скриптов <doc_scripting_continued_class_name>`

source: Editor and runtime accessible.
es: Accesible en el editor y en tiempo de ejecución.
fr: Editeur et runtime accessibles.
ja: エディタとランタイムにアクセスできます。
ru: Доступны редактор и среда выполнения.

source: Displays inheritance relationships in full.
es: Muestra las relaciones de herencia de manera completa.
fr: Affiche l'intégralité des relations d'héritage.
ja: 継承関係を完全に表示します。

source: Creates the node with the script, but can also change types or extend the type from the editor.
es: Crea el nodo con el script, pero también cambia el tipo o extiende el tipo desde el editor.
fr: Crée le nœud avec le script, mais peut aussi changer de type ou étendre le type depuis l'éditeur.
ja: スクリプトを使用してノードを作成しますが、エディタから型を変更したり、型を拡張したりすることもできます。
ru: Создаёт узел со скриптом, но также может изменять типы или расширять тип из редактора.

source: Editor is aware of inheritance relationships between scripts, script classes, and engine C++ classes.
es: El editor está pendiente de la relación de herencia entre scripts, clases de script y clases C++ del motor.
fr: L'éditeur est conscient des relations d'héritage entre les scripts, les classes de script et les classes C++ du moteur.
ja: エディタは、スクリプト、スクリプトクラス、およびエンジンのC++クラス間の継承関係を認識します。
ru: Редактор знает об отношениях наследования между скриптами, классами скриптов и классами C++ движка.

source: Engine developers must add support for languages manually (both name exposure and runtime accessibility).
es: Los desarrolladores que trabajan sobre el motor deben agregar soporta para lenguajes manualmente (tanto la exposición del nombre como la accesibilidad en tiempo de ejecución).
fr: Les développeurs du moteur doivent ajouter le support pour les langues manuellement (à la fois le nom de l'exposition et l'exécution de l'accessibilité).
ja: エンジン開発者は、言語のサポートを手動で追加する必要があります(名前の公開とランタイムのアクセシビリティの両方)。
ru: Разработчики движка должны добавлять поддержку языков вручную (как для отображения имени, так и для доступности во время выполнения).

source: Godot 3.1+ only.
es: Sólo en Godot 3.1+.
fr: Godot 3.1+ uniquement.
ja: Godot3.1以降のみです。
ru: Только Godot версии 3.1 и выше.

source: The Editor scans project folders and registers any exposed names for all scripting languages. Each scripting language must implement its own support for exposing this information.
es: El editor escanea las carpetas del proyecto y registra cualquier nombre expuesto para todos los lenguajes de scripting. Cada lenguaje de scripting debe incorporar su propio soporte para exponer esta información.
fr: L'éditeur analyse les dossiers de projet et enregistre tous les noms exposés pour tous les langages de script. Chaque langage de script doit implémenter son propre support pour exposer ces informations.
ja: エディタは、プロジェクトフォルダをスキャンし、すべてのスクリプト言語の公開名を登録します。各スクリプト言語は、この情報を公開するための独自のサポートを実装する必要があります。
ru: Редактор сканирует папки проекта и регистрирует любые открытые имена для всех языков скриптов. Каждый язык скриптов должен реализовывать свою собственную поддержку для раскрытия этой информации.

source: Both methodologies add names to the creation dialog, but script classes, in particular, also allow for users to access the typename without loading the script resource. Creating instances and accessing constants or static methods is viable from anywhere.
es: Ambas metodologías agregan nombres al diálogo de creación, pero para clases de script en particular, también permite a los usuarios acceder por el nombre del tipo sin necesidad de cargar el recurso de script. La creación de instancias y acceso a constantes o métodos estáticos es viable desde cualquier parte.
fr: Les deux méthodologies ajoutent des noms au dialogue de création, mais les classes de script, en particulier, permettent également aux utilisateurs d'accéder au nom de type sans charger la ressource script. Créer des instances et accéder à des constantes ou à des méthodes statiques est viable de n'importe où.
ja: どちらの方法でも作成ダイアログに名前が追加されますが、特にスクリプト クラスを使用すると、ユーザーはスクリプト リソースを読み込まずに型名にアクセスできます。インスタンスの作成と定数または静的メソッドへのアクセスは、どこからでも実行可能です。
ru: Обе методологии добавляют имена в диалог создания, но классы скриптов, в частности, также позволяют пользователям получить доступ к названию типа без загрузки ресурса скрипта. Создание экземпляров и доступ к константам или статическим методам является жизнеспособным из любого места.

source: With features like these, one may wish their type to be a script without a scene due to the ease of use it grants users. Those developing plugins or creating in-house tools for designers to use will find an easier time of things this way.
es: Con características como esta, puede preferirse que un tipo sea un script sin una escena debido a la facilidad de uso que le da a los usuarios. Quienes estén desarrollando plugins o creando herramientas propias para diseñadores, encontrarán mucho más sencillo hacer las cosas de este modo.
fr: Avec de telles fonctionnalités, on peut souhaiter que leur type soit un script sans scène en raison de la facilité d'utilisation qu'il offre aux utilisateurs. Ceux qui développent des plugins ou qui créent des outils internes pour les concepteurs trouveront les choses plus faciles de cette façon.
ja: このような機能を使用すると、それによってユーザーに付与される使いやすさから、その型をシーンのないスクリプトにしたい場合があります。このようにプラグインを開発したり、デザイナーが使用する社内ツールを作成したりすることで、物事をより簡単な手順で進められるようになります。
ru: С такими функциями можно пожелать, чтобы их тип был скриптом без сцены из-за простоты использования, которую он предоставляет пользователям. Тем, кто разрабатывает плагины или создает собственные инструменты для дизайнеров, таким образом будет легче.

source: On the downside, it also means having to use largely imperative programming.
es: Un aspecto negativo de esto es que implica tener que usar mucha programación imperativa.
fr: Le revers de la médaille, est que cela signifie aussi avoir à utiliser largement la programmation impérative.
ja: 欠点として、大部分が命令型プログラミングを使用する必要があることも意味します。
ru: С другой стороны, это также означает необходимость использования в значительной степени императивного программирования.

source: Conclusion
es: Conclusión
ja: 結論
ru: Вывод

source: In the end, the best approach is to consider the following:
es: El mejor enfoque consiste en considerar lo siguiente:
fr: En fin de compte, la meilleure approche consiste à tenir compte de ce qui suit :
ja: 最後に、最善のアプローチは次のことを考慮することです。
ru: В конце концов, лучший подход заключается в том, чтобы рассмотреть следующее:

source: If one wishes to create a basic tool that is going to be re-used in several different projects and which people of all skill levels will likely use (including those who don't label themselves as "programmers"), then chances are that it should probably be a script, likely one with a custom name/icon.
es: Si se desea crear una herramienta básica que será reutilizada en distintos proyectos y donde gente de todo tipo de nivel la usará (incluyendo aquellos que no se llaman a si mismos "programadores"), entonces hay chances de que deba ser un script, probablemente uno con un nombre/icono personalizado.
fr: Si l'on souhaite créer un outil de base qui sera réutilisé dans plusieurs projets différents et que les gens de tous les niveaux de compétence utiliseront probablement (y compris ceux qui ne se qualifient pas de "programmeurs"), alors il y a de fortes chances pour que ce soit un script, probablement avec un nom/un icône personnalisé.
ja: いくつかの異なるプロジェクトで再利用され、すべてのスキルレベルの人々(自分自身を「プログラマー」とラベル付けしない人を含む)が使用する可能性のある基本的なツールを作成したい場合、それは良い機会であり、おそらくスクリプトで作成する必要があります。また、カスタム名/アイコンが付いたものでなければなりません。
ru: Если кто-то хочет создать базовый инструмент, который будет повторно использоваться в нескольких различных проектах, и который, скорее всего, будут использовать люди всех уровней квалификации (включая тех, кто не называет себя "программистами"), то, скорее всего, это должен быть скрипт, скорее всего, с пользовательским именем/значком.

source: If one wishes to create a concept that is particular to their game, then it should always be a scene. Scenes are easier to track/edit and provide more security than scripts.
es: Si se desea crear un concepto que es particular para el juego, entonces debe ser una escena. Las escenas son más fáciles de revisar/editar y proveen más seguridad que los scripts.
fr: Si l'on souhaite créer un concept propre à son jeu, il doit toujours s'agir d'une scène. Les scènes sont plus faciles à suivre/modifier et offrent plus de sécurité que les scripts.
ja: ゲームに特化したコンセプト(モデル)を作りたい場合は、常にシーンである必要があります。シーンは追跡/編集が容易で、スクリプトよりもセキュリティが強化されます。
ru: Если кто-то хочет создать концепцию, характерную для его игры, то это всегда должна быть сцена. Сцены легче отслеживать/редактировать и обеспечивают большую безопасность, чем скрипты.

source: If one would like to give a name to a scene, then they can still sort of do this in 3.1 by declaring a script class and giving it a scene as a constant. The script becomes, in effect, a namespace:
es: Si uno desea darle un nombre a una escena, también se puede hacer en 3.1 declarando una clase script y dándole la escena como constante, de este modo el script se vuelve un espacio de nombres:
fr: Si l'on veut donner un nom à une scène, alors ils peuvent toujours le faire dans 3.1 en déclarant une classe de script et en lui donnant une scène comme une constante. Le script devient, en effet, un espace de noms :
ja: シーンに名前を付けたい場合は、スクリプトクラスを宣言し、シーンに定数として与えることで、3.1でもこれを行うことができます。スクリプトは、実際には名前空間になります:
ru: Если кто-то хочет дать сцене имя, то он все равно может сделать это в 3.1, объявив класс скрипта и дав ему сцену в качестве константы. Скрипт становится, по сути, пространством имён:

source: Performance of Script vs PackedScene
ru: Производительность сценариев и PackedScene

source: One last aspect to consider when choosing scenes and scripts is execution speed.
ru: Последний аспект, который следует учитывать при выборе сцен и скриптов, - это скорость выполнения.

source: As the size of objects increases, the scripts' necessary size to create and initialize them grows much larger. Creating node hierarchies demonstrates this. Each Node's logic could be several hundred lines of code in length.
ru: По мере увеличения размера объектов необходимый размер скриптов для их создания становится намного больше. Создание иерархии узлов демонстрирует это. Логика каждого отдельного узла может состоять из нескольких сотен строк кода.
