Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/scenes_versus_scripts.po
Languages: es, fr, ja, ru

source: The code example below creates a new ``Node``, changes its name, assigns a script to it, sets its future parent as its owner so it gets saved to disk along with it, and finally adds it as a child of the ``Main`` node:
ru: Приведенный ниже код создаёт новый узел ``Node``, меняет его имя, назначает ему сценарий, устанавливает его будущего родителя в качестве его владельца, чтобы он сохранялся на диске вместе с ним, и, наконец, добавляет его в качестве дочернего элемента главного узла ``Main``:

source: Script code like this is much slower than engine-side C++ code. Each instruction makes a call to the scripting API which leads to many "lookups" on the back-end to find the logic to execute.
ru: Такой код сценария намного медленнее, чем код C++ на стороне движка. Каждое изменение вызывает отдельный вызов API сценариев, что приводит к множеству "поисков" в серверной части, чтобы найти логику для выполнения.

source: Scenes help to avoid this performance issue. :ref:`PackedScene <class_PackedScene>`, the base type that scenes inherit from, defines resources that use serialized data to create objects. The engine can process scenes in batches on the back-end and provide much better performance than scripts.
ru: Сцены помогают избежать этой проблемы с производительностью. :ref:`PackedScene <class_PackedScene>`, базовый тип, от которого наследуются сцены, - это ресурсы, использующие сериализованные данные для создания объектов. Движок может обрабатывать сцены в пакетном режиме на сервере и обеспечивать гораздо лучшую производительность, чем скрипты.
