Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/scene_organization.po
Languages: fr, zh_cn

source: Scene organization
fr: Organisation de la scène

source: This article covers topics related to the effective organization of scene content. Which nodes should one use? Where should one place them? How should they interact?
fr: Cet article traite de sujets liés à l'organisation efficace du contenu des scènes. Quels nœuds utiliser ? Où doit-on les placer ? Comment devraient-ils interagir ?
zh_cn: 本文讨论与场景内容的有效组织相关的主题。应该使用哪些节点？应该把它们放在哪里？它们应该如何互动？

source: How to build relationships effectively
fr: Comment établir des relations efficacement
zh_cn: 如何有效地建立配置关系

source: When Godot users begin crafting their own scenes, they often run into the following problem:
fr: Lorsque les utilisateurs de Godot commencent à créer leurs propres scènes, ils se heurtent souvent au problème suivant :
zh_cn: 当Godot用户开始制作自己的场景时，他们经常遇到以下问题：

source: They create their first scene and fill it with content before the creeping sense that they need to split it up into re-usable pieces haunts them. They save branches of their scene into their own scene. However, they then notice that the hard references they were able to rely on before are no longer possible. Re-using the scene in multiple places creates issues because the node paths do not find their targets. Signal connections established in the editor break.
fr: Ils créent leur première scène et la remplissent de contenu avant que le sentiment rampant qu'ils ont besoin de la diviser en morceaux réutilisables ne les hante. Ils sauvegardent des branches de leur scène dans leur propre scène. Cependant, ils constatent alors que les références dures sur lesquelles ils pouvaient compter auparavant ne sont plus possibles. La réutilisation de la scène à plusieurs endroits crée des problèmes car les chemins de nœuds ne trouvent pas leurs cibles. Les connexions de signal établies dans l'éditeur sont rompues.
zh_cn: 他们创造了自己的第一个场景，并在需要将其分割成可复用的部分之前，将其填满内容。将场景的分支保存到自己的场景中。随后他们注意到，以前可以依赖的硬引用，现在已经不可用了。在多个位置复用场景会产生问题，因为节点路径找不到它们的目标。在编辑器内，中断已建立的信号连接。

source: To fix these problems, one must instantiate the sub-scenes without them requiring details about their environment. One needs to be able to trust that the sub-scene will create itself without being picky about how one uses it.
fr: Pour résoudre ces problèmes, il faut instancier les sous-scènes sans qu'elles ne nécessitent de détails sur leur environnement. Il faut pouvoir être sûr que la sous-scène se créera d'elle-même sans être pointilleuse sur la façon dont on l'utilise.
zh_cn: 为了解决这些问题，必须实例化子场景，而不需要详细说明其环境。我们需要相信子场景能够创建自己，而无需挑剔如何使用它。

source: One of the biggest things to consider in OOP is maintaining focused, singular-purpose classes with `loose coupling <https://en.wikipedia.org/wiki/Loose_coupling>`_ to other parts of the codebase. This keeps the size of objects small (for maintainability) and improves their reusability so that re-writing completed logic is unnecessary.
fr: L'une des choses les plus importantes à prendre en compte dans la POO est le maintien de classes ciblées et à but unique avec un couplage lâche <https://en.wikipedia.org/wiki/Loose_coupling>`_ à d'autres parties du code de base. La taille des objets reste ainsi réduite (pour des raisons de maintenabilité) et leur ré-utilisabilité est améliorée, de sorte qu'il n'est pas nécessaire de réécrire la logique compléte.
zh_cn: 在面向对象的程序设计中，需要考虑的最重要的事情之一是保持专注，使用“松散耦合<https://en.wikipedia.org/wiki/Loose_coupling>”到代码库的其他部分的单用途类。这使对象的尺寸尽可能小(为了可维护性)并提高了它们的可复用性，因此无需重写已完成的逻辑。

source: These OOP best practices have *several* ramifications for the best practices in scene structure and script usage.
fr: Ces meilleures pratiques OOP ont *plusieurs* ramifications pour les meilleures pratiques en matière de structure de scène et d'utilisation de script.
zh_cn: 这些面向对象的最佳实践，对场景结构和脚本使用中的最佳实践有*几个*分支。

source: **If at all possible, one should design scenes to have no dependencies.** That is, one should create scenes that keep everything they need within themselves.
fr: **Si c'est possible, il faut concevoir des scènes sans dépendance.** C'est-à-dire qu'il faut créer des scènes qui gardent tout ce dont elles ont besoin à l'intérieur d'elles-mêmes.
zh_cn: **如果可能的话，应该设计没有依赖关系的场景。**也就是说，用户在创造场景时，要对他们所需的一切谙熟于心。

source: If a scene must interact with an external context, experienced developers recommend the use of `Dependency Injection <https://en.wikipedia.org/wiki/Dependency_injection>`_. This technique involves having a high-level API provide the dependencies of the low-level API. Why do this? Because classes which rely on their external environment can inadvertently trigger bugs and unexpected behavior.
fr: Si une scène doit interagir avec un contexte externe, les développeurs expérimentés recommandent l'utilisation de `Dependency Injection <https://en.wikipedia.org/wiki/Dependency_injection>`_. Cette technique implique qu'une API de haut niveau fournisse les dépendances de l'API de bas niveau. Pourquoi faire cela ? Parce que les classes qui dépendent de leur environnement externe peuvent déclencher par inadvertance des bogues et des comportements inattendus.
zh_cn: 如果场景必须与外部环境交互，经验丰富的开发人员建议使用“依赖注入<https://en.wikipedia.org/wiki/Dependency_injection>_.”这种技术是让一个高级API提供低级API的依赖关系。为什么这样做呢?因为依赖于外部环境的类，可能在无意中触发bug和意外行为。

source: To do this, one must expose data and then rely on a parent context to initialize it:
fr: Pour ce faire, il faut exposer les données, puis s'appuyer sur un contexte parent pour les initialiser :
zh_cn: 要做到这一点，必须公开数据，然后依赖父级上下文来初始化它:

source: Connect to a signal. Extremely safe, but should use only to "respond" to behavior, not start it. Note that signal names are usually past-tense verbs like "entered", "skill_activated", or "item_collected".
fr: Connecter à un signal. Extrêmement sûr, mais ne doit être utilisé que pour "répondre" au comportement, pas pour le démarrer. Notez que les noms de signaux sont généralement des verbes au passé comme "entered", "skill_activated", ou "item_collected".
zh_cn: 连接到一个信号。非常安全,但是应该只用于“回应”行为，而不是启动它。注意，信号名通常是过去时态动词，如“进入后”，“技能_激活后”或“物品_收集后”。

source: Call a method. Used to start behavior.
fr: Appeler une méthode. Utilisé pour démarrer le comportement.
zh_cn: 调用一个方法。用于启动行为。

source: Initialize a :ref:`FuncRef <class_FuncRef>` property. Safer than a method as ownership of the method is unnecessary. Used to start behavior.
fr: Initialiser une propriété :ref:`FuncRef <class_FuncRef>`. Plus sûr qu'une méthode car la propriété de la méthode n'est pas nécessaire. Utilisé pour démarrer le comportement.

source: Initialize a Node or other Object reference.
fr: Initialiser un nœud ou une autre référence d'objet.
zh_cn: 初始化节点或其他对象引用。

source: Initialize a NodePath.
fr: Initialiser un NodePath.
zh_cn: 初始化节点路径。

source: These options hide the source of accesses from the child node. This in turn keeps the child **loosely coupled** to its environment. One can re-use it in another context without any extra changes to its API.
fr: Ces options cachent la source des accès au nœud enfant. Cela permet à l'enfant **d'être couplé de façon lâche** à son environnement. On peut le réutiliser dans un autre contexte sans aucune modification supplémentaire de son API.
zh_cn: 这些选项对子节点隐藏访问源。反过来，又保持子节点与环境的**松散耦合**。可以在另外的上下文中重用它，而无需对它的API做任何额外更改。

source: Although the examples above illustrate parent-child relationships, the same principles apply towards all object relations. Nodes which are siblings should only be aware of their hierarchies while an ancestor mediates their communications and references.
fr: Bien que les exemples ci-dessus illustrent les relations parent-enfant, les mêmes principes s'appliquent à toutes les relations objet. Les nœuds qui sont des frères et sœurs ne devraient connaître que leur hiérarchie pendant qu'un ancêtre assure la médiation de leurs communications et de leurs références.
zh_cn: 虽然上面的例子说明了父子关系，同样的原则也适用于所有对象之间的关系。兄弟节点应该只知道它们的层次结构，而先祖节点则负责协调它们的通信和引用。

source: The same principles also apply to non-Node objects that maintain dependencies on other objects. Whichever object actually owns the objects should manage the relationships between them.
fr: Les mêmes principes s'appliquent également aux objets non nœuds qui dépendent d'autres objets. Quel que soit l'objet qui possède réellement les objets, il doit gérer les relations entre eux.
zh_cn: 同样的原则也适用于维护对其他对象依赖关系的非节点对象。无论哪个对象实际拥有这些对象，都应该管理它们之间的关系。

source: One should favor keeping data in-house (internal to a scene) though as placing a dependency on an external context, even a loosely coupled one, still means that the node will expect something in its environment to be true. The project's design philosophies should prevent this from happening. If not, the code's inherent liabilities will force developers to use documentation to keep track of object relations on a microscopic scale; this is otherwise known as development hell. Writing code that relies on external documentation for one to use it safely is error-prone by default.
fr: Il faut privilégier la conservation des données en interne (interne à une scène), placer une dépendance sur un contexte externe, même faiblement couplé, signifie que le nœud s'attendra à ce que quelque chose soit vrai dans son environnement. Les philosophies de conception du projet devraient empêcher que cela ne se produise. Sinon, les responsabilités inhérentes au code obligeront les développeurs à utiliser de la documentation pour suivre les relations entre objets à une échelle microscopique ; c'est ce qu'on appelle l'enfer du développement. L'écriture d'un code qui s'appuie sur une documentation externe pour l'utiliser en toute sécurité est sujette à des erreurs par défaut.
zh_cn: 应该倾向于将数据保存在内部(场景内部)，尽管它依赖于外部环境，即使是松散耦合的，仍然意味着节点将期望其环境中的某些内容为真。项目的设计理念应该防止这种情况发生。如果不是这样，代码固有的责任将迫使开发人员使用文档，以在微观尺度上跟踪对象关系；这就是所谓的开发地狱。默认情况下，编写依赖于外部文档的代码来安全地使用它，是很容易出错的。

source: To avoid creating and maintaining such documentation, one converts the dependent node ("child" above) into a tool script that implements :ref:`_get_configuration_warning() <class_Node_method__get_configuration_warning>`. Returning a non-empty string from it will make the Scene dock generate a warning icon with the string as a tooltip by the node. This is the same icon that appears for nodes such as the :ref:`Area2D <class_Area2D>` node when it has no child :ref:`CollisionShape2D <class_CollisionShape2D>` nodes defined. The editor then self-documents the scene through the script code. No content duplication via documentation is necessary.
fr: Pour éviter de créer et de maintenir une telle documentation, on convertit le noeud dépendant (" enfant " ci-dessus) en un script outil qui implémente :ref:`_get_configuration_warning() <class_Node_method__get_configuration_warning >`. Retourner une chaîne non vide à partir de celle-ci fera en sorte que le dock Scène génère une icône d'avertissement avec la chaîne sous forme d'info-bulle par le nœud. C'est la même icône qui apparaît pour les nœuds tels que le nœud :ref:`Area2D <class_Area2D>` quand il n'a pas d'enfant :ref:`CollisionShape2D <class_CollisionShape2D <Nœuds définis. L'éditeur documente ensuite lui-même la scène à l'aide du code du script. Aucune duplication de contenu via la documentation n'est nécessaire.
zh_cn: 为避免创建和维护此类文档，将依赖节点(上面的“子节点”)转换为实现的工具脚本:参考:`_获取_配置_警告() <类_节点_方法__获取_配置_警告>`。返回一个非空字符串，将使场景面板生成一个警告图标，该字符串作为节点的工具提示。这是节点出现的相同图标，例如:参考:`二维区域<类_二维区域>`节点，当它没有定义:参考:`二维碰撞形状<类_二维碰撞形状>`子节点时。然后编辑器通过脚本代码自动记录场景。不需要通过文档复制内容。

source: A GUI like this can better inform project users of critical information about a Node. Does it have external dependencies? Have those dependencies been satisfied? Other programmers, and especially designers and writers, will need clear instructions in the messages telling them what to do to configure it.
fr: Une interface graphique comme celle-ci peut mieux informer les utilisateurs d'informations critiques sur un nœud. A-t-il des dépendances externes ? Ces dépendances ont-elles été satisfaites ? D'autres programmeurs, et en particulier les designers et les écrivains, auront besoin d'instructions claires dans les messages leur indiquant ce qu'ils doivent faire pour le configurer.
zh_cn: 这样的图形用户界面可以更好地向项目用户提供关于节点的关键信息。它有外部依赖吗？这些依赖关系是否得到了满足？其他程序员，尤其是设计师和编剧们，需要明确指示的消息，告诉他们如何配置它。

source: So, why do all this complex switcharoo work? Well, because scenes operate best when they operate alone. If unable to work alone, then working with others anonymously (with minimal hard dependencies, i.e. loose coupling). If the inevitable changes made to a class cause it to interact with other scenes in unforeseen ways, then things break down. A change to one class could result in damaging effects to other classes.
fr: Alors, pourquoi tout ce switcharoo complexe fonctionne-t-il ? Parce que les scènes fonctionnent mieux quand elles fonctionnent seules. Si elle est incapable de travailler seule, travailler avec d'autres de façon anonyme (avec un minimum de dépendances dures, c.-à-d. un couplage lâche). Si les changements inévitables apportés à une classe l'amènent à interagir avec d'autres scènes d'une manière imprévue, alors des choses s'effondrent. Le changement d'une classe peut avoir des effets néfastes sur les autres classes.
zh_cn: 那么，为什么所有这些复杂的切换都能工作呢？因为当场景单独运行时，效果最好。如果不能独自工作，那么就匿名与其他对象合作(具有最小的硬依赖关系，即松散耦合)。如果一个类不可避免的变化导致它以不可预见的方式与其他场景交互，然后事情就发生了变化。对一个类的更改可能会对其他类造成破坏性的影响。

source: Scripts and scenes, as extensions of engine classes should abide by *all* OOP principles. Examples include...
fr: Les scripts et les scènes, en tant qu'extensions des classes du moteur, doivent respecter *tous* les principes OOP. En voici quelques exemples...
zh_cn: 脚本和场景，作为引擎类的扩展，应该*全部*遵循面向对象的程序设计原则。例子包括……

source: Choosing a node tree structure
fr: Choix d’une structure d’arborescence de nœud

source: So, a developer starts work on a game only to stop at the vast possibilities before them. They might know what they want to do, what systems they want to have, but *where* to put them all? Well, how one goes about making their game is always up to them. One can construct node trees in a myriad of ways. But, for those who are unsure, this helpful guide can give them a sample of a decent structure to start with.
fr: Ainsi, un développeur commence à travailler sur un jeu seulement pour s'arrêter aux vastes possibilités qui s'offrent à lui. Ils savent peut-être ce qu'ils veulent faire, quels systèmes ils veulent avoir, mais *où* les mettre ? Eh bien, c'est toujours à eux de décider comment faire leur jeu. On peut construire des arbres de nœuds de multiples façons. Mais, pour ceux qui ne sont pas sûrs, ce guide peut leur donner un exemple d'une structure décente pour commencer.
zh_cn: 一个开发者开始开发一款游戏，却在眼前的巨大可能性面前止步不前。他们可能知道自己想做什么，他们想要什么样的系统，但是把它们都放在*哪里*呢？好吧，如何创造他们的游戏总是取决于他们自己。可以用多种方法构造节点树。但是，对于那些不确定的人来说，这篇有用的指南可以为他们提供一个良好结构的示例。

source: A game should always have a sort of "entry point"; somewhere the developer can definitively track where things begin so that they can follow the logic as it continues elsewhere. This place also serves as a bird's eye view to all of the other data and logic in the program. For traditional applications, this would be the "main" function. In this case, it would be a Main node.
fr: Un jeu devrait toujours avoir une sorte de "point d'entrée" ; quelque part, le développeur peut suivre où les choses commencent afin de pouvoir suivre la logique comme elle continue ailleurs. Cet endroit sert également de vue d'ensemble de toutes les autres données et logiques du programme. Pour les applications traditionnelles, ce serait la fonction "main". Dans ce cas, il s'agirait d'un nœud principal.
zh_cn: 游戏应该始终有一个“切入点”；在任何地点，开发人员都能明确跟踪事件的开始位置，以便在其他地方继续执行逻辑。这个地点也作为鸟瞰程序中所有其他数据和逻辑的地方。对于传统的应用程序，这就是“主”函数。在本例中，它将是一个主节点。

source: Node "Main" (main.gd)
fr: Nœud "Main" (main.gd)
zh_cn: 节点“主”(main.gd)

source: The ``main.gd`` script would then serve as the primary controller of one's game.
fr: Le script ``main.gd`` servirait alors de contrôleur principal de son jeu.
zh_cn: ``main.gd``脚本将作为游戏的主控制器。

source: Then one has their actual in-game "World" (a 2D or 3D one). This can be a child of Main. In addition, one will need a primary GUI for their game that manages the various menus and widgets the project needs.
fr: Puis certains ont leur "Monde" (en 2D ou 3D). Ce peut être un enfant de Main. En outre, certains auront besoin d'une interface graphique primaire pour leur jeu qui gère les différents menus et widgets dont le projet a besoin.
zh_cn: 然后你便拥有了真正的游戏“世界”(二维或三维)。这可以是主场景的子节点。此外，玩家需要为他们的游戏提供一个主要图形用户界面来管理项目所需的各种菜单和小部件。

source: Control "GUI" (gui.gd)
fr: Contrôle "GUI" (gui.gd)
zh_cn: 控制“图形用户界面”(gui.gd)

source: When changing levels, one can then swap out the children of the "World" node. :ref:`Changing scenes manually <doc_change_scenes_manually>` gives users full control over how their game world transitions.
fr: Lors d'un changement de niveau, on peut alors échanger les enfants du nœud "Monde". :ref:`Changing scenes manually <doc_change_scenes_manually>` donnant aux utilisateurs un contrôle total sur la façon dont les transitions de leur monde de jeu s'effectuent.
zh_cn: 当变更关卡时，可以替换“世界”节点的子节点。:参考:`手动更换场景<文档_手动_更换_场景>`让用户完全控制他们的游戏世界如何过渡。

source: The next step is to consider what gameplay systems one's project requires. If one has a system that...
fr: L'étape suivante consiste à déterminer quels sont les systèmes de gameplay nécessaires à la réalisation de son projet. Si on a un système qui...
zh_cn: 下一步是考虑项目需要什么样的游戏系统。如果有这么一个系统……

source: tracks all of its data internally
fr: fait le suivi de toutes ses données à l'interne
zh_cn: 跟踪所有的内部数据

source: should be globally accessible
fr: devrait être accessible à l'échelle mondiale
zh_cn: 应该是全局可访问的

source: should exist in isolation
fr: devrait exister de manière isolée
zh_cn: 应该独立存在的

source: ... then one should create an :ref:`autoload 'singleton' node <doc_singletons_autoload>`.
fr: ... alors on devrait créer un :ref:`autoload 'singleton" nœud <doc_singletons_autoload>`.
zh_cn: ……那么应该创建一个:参考:`自动加载'单例'节点<文档_单例_自动加载>`节点。

source: For smaller games, a simpler alternative with less control would be to have a "Game" singleton that simply calls the :ref:`SceneTree.change_scene() <class_SceneTree_method_change_scene>` method to swap out the main scene's content. This structure more or less keeps the "World" as the main game node.
fr: Pour les petits jeux, une alternative plus simple avec moins de contrôle serait d'avoir un singleton "Game" qui appelle simplement le :ref:`SceneTree.change_scene() <class_SceneTree_method_method_change_scene>` méthode pour remplacer le contenu du scénario principal. Cette structure maintient plus ou moins le "Monde" comme nœud principal du jeu.
zh_cn: 对于较小的游戏，一个更简单、更少控制的选择，是简单地调用一个“游戏”单例:参考:`场景树.更换_场景() <类_场景树_方法_更换_场景>`方法替换主场景的内容。这种结构或多或少保留了作为主要游戏节点的“世界”。

source: Any GUI would need to also be a singleton, be transitory parts of the "World", or be manually added as a direct child of the root. Otherwise, the GUI nodes would also delete themselves during scene transitions.
fr: Toute interface graphique devrait aussi être un singleton, être une partie transitoire du "Monde", ou être ajoutée manuellement comme un enfant direct de la racine. Sinon, les nœuds de l'interface graphique se supprimeraient également d'eux-mêmes pendant les transitions de scène.
zh_cn: 任何图形用户界面也需要是一个单例，成为“世界”过渡的一部分，或者作为根的直接子元素手动添加。否则，图形界面用户节点也会在场景转换期间删除它们自己。

source: If one has systems that modify other systems' data, one should define those as their own scripts or scenes rather than autoloads. For more information on the reasons, please see the :ref:`'Autoloads vs. Internal Nodes' <doc_autoloads_versus_internal_nodes>` documentation.
fr: Si l'on possède des systèmes qui modifient les données d'autres systèmes, il faut les définir comme leurs propres scripts ou scènes plutôt que comme des autochargements. Pour plus d'informations sur les raisons, veuillez consulter la documentation :ref:`'Autoloads vs. Internal Nodes' <doc_autoloads_versus_internal_nodes>`.
zh_cn: 如果一个系统修改了其他系统的数据，应该将它们定义为自己的脚本或场景，而不是自动加载。更多关于该原因的信息，请参阅:参考:`'自动加载和内部节点'<文档_自动加载_和_内部_节点>`文档。

source: Each subsystem within one's game should have its own section within the SceneTree. One should use parent-child relationships only in cases where nodes are effectively elements of their parents. Does removing the parent reasonably mean that one should also remove the children? If not, then it should have its own place in the hierarchy as a sibling or some other relation.
fr: Chaque sous-système d'un jeu doit avoir sa propre section dans l'arbre des scènes. On ne devrait utiliser les relations parent-enfant que dans les cas où les nœuds sont effectivement des éléments de leurs parents. Le fait de retirer le parent signifie-t-il raisonnablement que l'on devrait également retirer les enfants ? Si ce n'est pas le cas, il devrait avoir sa propre place dans hiérarchie en tant que frère, sœur ou autre parent.
zh_cn: 游戏中的每个子系统都应该在场景树中有自己的区域。只有在节点实际上是其父节点的元素的情况下，才能使用父子关系。删除父节点是否意味着也应该删除子节点？如果不是这样，那么它应该在层次结构中有自己的位置，作为兄弟或其他关系。

source: In some cases, one needs these separated nodes to *also* position themselves relative to each other. One can use the :ref:`RemoteTransform <class_RemoteTransform>` / :ref:`RemoteTransform2D <class_RemoteTransform2D>` nodes for this purpose. They will allow a target node to conditionally inherit selected transform elements from the Remote\* node. To assign the ``target`` :ref:`NodePath <class_NodePath>`, use one of the following:
fr: Dans certains cas, on a besoin de ces nœuds séparés pour *également* se positionner les uns par rapport aux autres. On peut utiliser les nœuds :ref:`RemoteTransform <class_RemoteTransform>` / :ref:`RemoteTransform2D <class_RemoteTransform2D>` à cette fin. Ils permettront à un nœud cible d'hériter conditionnellement des éléments de transformation sélectionnés du nœud Remote\*. Pour assigner le ``target``` :ref:`NodePath <class_NodePath>`, utilisez l'une des options suivantes :
zh_cn: 在某些情况下，我们需要这些分离的节点*仍然*定位它们彼此之间的相对位置。为此，可以使用:参考:`移除转换<类_移除转换>`/:参考:`移除二维转换<类_移除二维转换>`节点。它们将允许目标节点有条件地从远程\*节点继承选定的转换元素。要分配“目标”:参考:`节点路径<类_节点路径>`，使用以下方法之一：

source: A reliable third party, likely a parent node, to mediate the assignment.
fr: Une tierce partie fiable, probablement un nœud parent, pour assurer la médiation de l'assignation.
zh_cn: 一个可靠的第三方，可能是一个父节点，来协调分配任务。

source: A group, to easily pull a reference to the desired node (assuming there will only ever be one of the targets).
fr: Un groupe, pour facilement obtenir une référence au nœud désiré (en supposant qu'il n'y aura jamais qu'une seule des cibles).
zh_cn: 一个组，以便拉到所需节点的引用(假设目标只有一个)。

source: When should one do this? Well, it's up to them to decide. The dilemma arises when one must micro-manage when a node must move around the SceneTree to preserve itself. For example...
fr: Quand faut-il le faire ? C'est à eux de décider. Le dilemme se pose lorsqu'il faut micro-gérer quand un nœud doit se déplacer dans l'arbre des scènes pour se préserver. Par exemple....
zh_cn: 什么时候应该这样做呢？好吧，这取决于它们自身。当一个节点必须围绕场景树移动以保持自身时，必须对其进行微观管理时，就会出现这种困境。例如……

source: Add a "player" node to a "room".
fr: Ajouter un nœud "player" à une "room".
zh_cn: 添加一个“玩家”节点到一个“房间”。

source: Need to change rooms, so one must delete the current room.
fr: Besoin de changer de pièce, il faut donc supprimer la pièce courante.
zh_cn: 需要更换房间，所以必须删除当前的房间。

source: Before the room can be deleted, one must preserve and/or move the player.
fr: Avant de pouvoir supprimer la salle, il faut conserver et/ou déplacer le joueur.
zh_cn: 在可以删除房间之前，必须保存和/或移动玩家。

source: Is memory a concern?
fr: La mémoire est-elle une préoccupation ?
zh_cn: 需要关心内存吗？

source: If not, one can just create the two rooms, move the player and delete the old one. No problem.
fr: Si ce n'est pas le cas, il suffit de créer les deux salles, de déplacer le lecteur et d'effacer l'ancienne. Pas de problème.
zh_cn: 如果不是这样，一次可以创建两个房间，移动玩家并删除旧的那个。没有问题。
