Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/scene_organization.po
Languages: fr, zh_cn

source: If so, one will need to...
fr: Si c'est le cas, il faudra....
zh_cn: 如果是这样，那么需要……

source: Move the player somewhere else in the tree.
fr: Déplacez le joueur ailleurs dans l'arbre.
zh_cn: 将玩家移动到树的其他位置。

source: Delete the room.
fr: Supprimer la salle.

source: Instantiate and add the new room.
fr: Instanciez et ajoutez la nouvelle pièce.
zh_cn: 实例化并添加新房间。

source: Re-add the player.
fr: Ré-ajouter le joueur.

source: The issue is that the player here is a "special case", one where the developers must *know* that they need to handle the player this way for the project. As such, the only way to reliably share this information as a team is to *document* it. Keeping implementation details in documentation however is dangerous. It's a maintenance burden, strains code readability, and bloats the intellectual content of a project unnecessarily.
fr: Le problème est que le joueur est ici un "cas spécial", un cas où les développeurs doivent *savoir* qu'ils doivent gérer le joueur de cette façon pour le projet. En tant que telle, la seule façon de partager cette information de façon fiable en équipe est de la *documenter*. Il est cependant dangereux de conserver les détails de la mise en œuvre dans la documentation. C'est une charge de maintenance, qui pèse sur la lisibilité du code et gonfle inutilement le contenu intellectuel d'un projet.
zh_cn: 问题在于，这里的玩家是一个“特例”，其中开发者必须“懂得”他们需要以这种方式处理项目中的玩家。因此，作为一个团队可靠地共享此信息的唯一方法就是“记录”它。然而，在文档中保存实现细节是危险的。这是一种维护负担，增加了代码的可读性压力，以及增加了项目内不必要的知识内容。

source: In a more complex game with larger assets, it can be a better idea to simply keep the player somewhere else in the SceneTree entirely. This involves...
fr: Dans un jeu plus complexe avec des ressources plus importantes, il peut être préférable de simplement garder le joueur ailleurs dans l'Arbre de scène. Cela implique...
zh_cn: 更复杂的游戏，拥有更大的资源量，简单地将玩家完全保留在场景中的其他地方，可能是一个更好的主意。这涉及到……

source: More consistency.
fr: Plus de cohérence.
zh_cn: 更多的一致性。

source: No "special cases" that must be documented and maintained somewhere.
fr: Pas de "cas spéciaux" qui doivent être documentés et conservés quelque part.
zh_cn: 没有必须被记录和维护在某地的“特殊情况”。

source: No opportunity for errors to occur because these details are not accounted for.
fr: Il n'y a aucun risque d'erreur parce que ces détails ne sont pas pris en compte.
zh_cn: 没有发生错误的机会，因为忽略不计这些细节。

source: In contrast, if one ever needs to have a child node that does *not* inherit the transform of their parent, one has the following options:
fr: En revanche, si l'on a besoin d'avoir un nœud enfant qui n'hérite pas de la transformation de son parent, on a les options suivantes :
zh_cn: 相比之下，如果需要一个子节点不继承父节点的转换，那么具有以下选项：

source: The **declarative** solution: place a :ref:`Node <class_Node>` in between them. As nodes with no transform, Nodes will not pass along such information to their children.
fr: La solution **déclarative** : placez un :ref:`Node <class_Node>` entre eux. En tant que nœuds sans transformation, les nœuds ne transmettront pas ces informations à leurs enfants.
zh_cn: **声明性**解决方案是：在它们之间放置一个:参考:`节点<类_节点>`。作为没有转换的节点，节点不会将这些信息传递给其子节点。

source: The **imperative** solution: Use the ``set_as_toplevel`` setter for the :ref:`CanvasItem <class_CanvasItem_method_set_as_toplevel>` or :ref:`Spatial <class_Spatial_method_set_as_toplevel>` node. This will make the node ignore its inherited transform.
fr: La solution **impérative** : Utilisez le setter ``set_as_toplevel`` pour le nœud :ref:`CanvasItem <class_CanvasItem_CanvasItem_method_method_as_toplevel>` ou :ref:`Spatial <class_Spatial_method_set_as_toplevel>`. Cela fera que le nœud ignorera sa transformation héritée.
zh_cn: **必要**解决方案:对:参考:`画布组件<类_画布组件_方法_设置_为_顶级>` 或者:参考:`空间<类_空间_方法_设置_为_顶级>`节点，使用``设置_为_顶级``设值函数。这将使节点忽略其继承的转换。

source: If building a networked game, keep in mind which nodes and gameplay systems are relevant to all players versus those just pertinent to the authoritative server. For example, users do not all need to have a copy of every players' "PlayerController" logic. Instead, they need only their own. As such, keeping these in a separate branch from the "world" can help simplify the management of game connections and the like.
fr: Si vous construisez un jeu en réseau, gardez à l'esprit quels nœuds et systèmes de jeu sont pertinents pour tous les joueurs par rapport à ceux qui ne le sont que pour le serveur faisant autorité. Par exemple, les utilisateurs n'ont pas tous besoin d'avoir une copie de la logique "PlayerController" de chaque joueur. Au lieu de cela, ils n'ont besoin que des leurs. En tant que tel, le fait de les garder dans une branche séparée du "monde" peut aider à simplifier la gestion des connexions de jeu et d'autres choses du même genre.
zh_cn: 如果创建一个网络游戏，请记住哪些节点和游戏系统与所有玩家相关，而哪些只与权威服务器相关。例如，用户并不需要拥有所有玩家“玩家角色控制器”逻辑的副本。相反，他们只需属于自己的角色控制器。因此,将它们与“世界”保持在一个单独的分支中，可以帮助简化游戏连接等的管理。

source: The key to scene organization is to consider the SceneTree in relational terms rather than spatial terms. Do the nodes need to be dependent on their parent's existence? If not, then they can thrive all by themselves somewhere else. If so, then it stands to reason they should be children of that parent (and likely part of that parent's scene if they aren't already).
fr: La clé de l'organisation d'une scène est de considérer le SceneTree en termes relationnels plutôt qu'en termes spatiaux. Les nœuds doivent-ils être dépendants de l'existence de leurs parents ? Si ce n'est pas le cas, ils peuvent prospérer tous seuls ailleurs. Si c'est le cas, il va de soi qu'ils devraient être les enfants de ce parent (et probablement faire partie de la scène de ce parent s'ils ne le sont pas déjà).
zh_cn: 场景组织的关键是用关系术语，而不是空间术语来考虑场景。节点是否需要依赖于其父节点的存在？如果不是，那么它们可以在其他地方独自成长。如果是这样，那么很显然，它们应该是父节点的子节点(如果它们不是这样做的话，那很可能是其父场景的一部分)。

source: Does this mean nodes themselves are components? Not at all. Godot's node trees form an aggregation relationship, not one of composition. But while one still has the flexibility to move nodes around, it is still best when such moves are unnecessary by default.
fr: Cela signifie-t-il que les nœuds eux-mêmes sont des composants ? Pas du tout. Les arbres de nœuds de Godot forment une relation d'agrégation, pas une relation de composition. Mais bien que l'on ait toujours la flexibilité de déplacer les nœuds, il est préférable que de tels déplacements ne soient pas nécessaires par défaut.
zh_cn: 这是否意味着节点本身就是组件？并不是这样。Godot的节点树形成的是聚合关系，而不是组合关系。虽然我们依旧可以灵活地移动节点，但在默认情况下，无需移动，仍然是最好的选择。

source: Node2D/Spatial "World" (game_world.gd)
zh_cn: 二维节点/空间“世界”(game_world.gd)
