Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/what_are_godot_classes.po
Languages: de, es, fr, ja, ko, ru, zh_cn, zh_tw

source: This guide briefly explains how scripts and scenes work in the engine's core to help you understand how they work under the hood.
de: In diesem Handbuch wird kurz erläutert wie Skripte und Szenen im Kern der Engine funktionieren, damit Sie ein besseres Verständnis für deren funktionsweise erhalten.
ru: В этом руководстве кратко объясняется, как скрипты и сцены работают в ядре движка, чтобы помочь вам понять, как они работают изнутри.

source: How scripts work in the engine
de: Wie Skripte in der Engine funktionieren
ru: Работа скриптов в движке

source: The engine provides built-in classes like :ref:`Node <class_Node>`. You can extend those to create derived types using a script.
de: Die Engine bietet integrierte Klassen wie :ref:`Node <class_Node>`. Sie können diese erweitern um mithilfe eines Skripts abgeleitete Typen zu erstellen.
ru: Движок предоставляет встроенные классы, такие как :ref:`Node <class_Node>`. Их можно расширить для создания производных типов с помощью сценария.

source: These scripts are not technically classes. Instead, they are resources that tell the engine a sequence of initializations to perform on one of the engine's built-in classes.
de: Diese Skripte sind technisch gesehen keine Klassen. Stattdessen handelt es sich um Ressourcen, die der Engine eine Folge von Initialisierungen mitteilen, die für eine der integrierten Klassen der Engine ausgeführt werden sollen.
ru: Эти скрипты технически не являются классами. Вместо этого они представляют собой ресурсы, которые сообщают движку последовательность инициализаций для выполнения в одном из встроенных классов.

source: Properties.
de: Eigenschaften
ru: Свойства.

source: Methods.
de: Methoden
ru: Методы.

source: Constants.
de: Konstanten
ru: Константы.

source: Signals.
de: Signale
ru: Сигналы.

source: This ``ClassDB`` is what objects check against when performing an operation like accessing a property or calling a method. It checks the database's records and the object's base types' records to see if the object supports the operation.
de: Diese ``ClassDB`` ist das, was Objekte überprüfen, wenn sie eine Operation wie den Zugriff auf eine Eigenschaft oder den Aufruf einer Methode durchführen. Es prüft die Datensätze der Datenbank und die Datensätze der Basistypen des Objekts, um zu sehen, ob das Objekt die Operation unterstützt.
ru: ``ClassDB`` - это то, что объекты проверяют при выполнении такой операции, как доступ к свойству или вызов метода. ``ClassDB`` проверяет записи базы данных и записи базовых типов объекта, чтобы узнать, поддерживает ли объект операцию.

source: Attaching a :ref:`Script <class_Script>` to your object extends the methods, properties, and signals available from the ``ClassDB``.
de: Das Anhängen eines :ref:`Script <class_Script>` an Ihr Objekt erweitert die Methoden, Eigenschaften und Signale, die von der ``ClassDB`` zur Verfügung stehen.
ru: Присоединение скрипта к вашему объекту расширяет методы, свойства и сигналы, доступные из ``ClassDB``.

source: Even scripts that don't use the ``extends`` keyword implicitly inherit from the engine's base :ref:`Reference <class_Reference>` class. As a result, you can instantiate scripts without the ``extends`` keyword from code. Since they extend ``Reference`` though, you cannot attach them to a :ref:`Node <class_Node>`.
de: Auch Skripte, die das Schlüsselwort ``extends`` nicht verwenden, erben implizit von der Basisklasse der Engine :ref:`Reference <class_Reference>`. Folglich können Sie Skripte ohne das Schlüsselwort ``extends`` aus dem Code instanziieren. Da sie jedoch ``Referenz`` erweitern, können Sie sie nicht an einen :ref:`Node <class_Node>` anhängen.
ru: Даже скрипты, которые не наследуются от встроенного типа, то есть скрипты, которые не начинаются с ключевого слова ``extends``, неявно наследуются от базового класса движка :ref:`Reference <class_Reference>`. В результате вы можете писать сценарии без ключевого слова ``extends``. Поскольку они расширяют ``Reference``, вы не можете прикрепить их к :ref:`Node <class_Node>`.

source: Scenes
de: Szenen
ru: Сцены

source: The behavior of scenes has many similarities to classes, so it can make sense to think of a scene as a class. Scenes are reusable, instantiable, and inheritable groups of nodes. Creating a scene is similar to having a script that creates nodes and adds them as children using ``add_child()``.
de: ElementeDas Verhalten von Szenen hat viele Ähnlichkeiten mit Klassen, so dass es sinnvoll sein kann, sich eine Szene als Klasse vorzustellen. Szenen sind wiederverwendbare, instanzierbare und vererbbare Gruppen von Nodes. Das Erzeugen einer Szene ist vergleichbar mit einem Skript, das Nodes erzeugt und sie mit ``add_child()`` als Unterobjekt hinzufügt.
ru: Поведение сцен во многом похоже на классы, поэтому имеет смысл рассматривать сцену как класс. Сцены - это многократно используемые, инстанцируемые и наследуемые группы узлов. Создание сцены аналогично созданию сценария, который создает узлы и добавляет их как дочерние элементы с помощью ``add_child()``.

source: We often pair a scene with a scripted root node that makes use of the scene's nodes. As such, the scene is often an extension of the script's declarative code.
de: Wir koppeln häufig eine Szene mit einem geskripteten Wurzel-Node, der die Nodes der Szene verwendet. Daher ist die Szene häufig eine Erweiterung des deklarativen Codes des Skripts.
ru: Почему все это важно для организации сцены? Потому что сцены *являются* объектами. Вы обычно объединяете в пару сцену и корневой сценарный (скриптовый) узел, что позволяет использовать вложенные узлы. Таким образом, сцена часто является расширением сценария.

source: Why is any of this important to scene organization? Because instances of scenes *are* objects. As a result, many object-oriented principles that apply to written code also apply to scenes: single responsibility, encapsulation, and others.
de: Warum ist irgendetwas davon für die Organisation der Szene wichtig? Weil Instanzen von Szenen *Objekte* sind. Infolgedessen gelten viele objektorientierte Prinzipien, die für geschriebenen Code gelten, auch für Szenen: Einzelverantwortung, Kapselung und andere.
ru: Почему все это важно для организации сцены? Потому что экземпляры сцен *являются* объектами. В результате, многие объектно-ориентированные принципы, применимые к написанному коду, также применимы и к сценам: принцип единственной ответственности (SRP), инкапсуляция и другие.

source: The scene is *always an extension of the script attached to its root node*, so you can interpret it as part of a class.
de: Die Szene ist *immer eine Erweiterung des Skripts, das dem Wurzel-Node angehängt ist*, sodass Sie sie als Teil einer Klasse interpretieren können.
ru: Сцена *всегда является расширением сценария, прикрепленного к его корневому узлу*, поэтому вы можете представлять ее как часть класса.

source: Most of the techniques explained in this best practices series build on this point.
de: Die meisten der in dieser Best Practices-Reihe erläuterten Techniken bauen auf diesem Punkt auf.
ru: Большинство методов, описанных в этой серии best practices, основаны на этом.

source: What are Godot classes really?
ko: Godot 클래스는 정말 무엇입니까?

source: Godot offers two main means of creating types: scripts and scenes. Both of these represent a "class" since Godot revolves around Object-Oriented design. *How* they do this may not be clear to beginner or intermediate users though.
ko: Godot는 생성 타입에 있어 두가지 중심 의미가 있습니다: 스크립트와 씬입니다. Godot를 객체 지향 디자인 중심으로 전개할 때, 둘은 모두 "클래스"를 나타냅니다. 초보자나 중급자에게 이것이 *어떻게* 가능한 지를 분명하게 알기는 어렵습니다.

source: Godot Engine provides classes out-of-the-box (like :ref:`Node <class_Node>`), but user-created types are not actually classes. Instead they are resources that tell the engine a sequence of initializations to perform on an engine class.
ko: Godot 엔진은 별도의 설치없이 클래스를 제공합니다 (:ref:`Node <class_Node>`\ 처럼 말이죠), 하지만 사용자가 만든 타입은 사실 클래스가 아닙니다. 대신 엔진 클래스에서 작동하기 위해 엔진에게 초기화 시퀀스를 알려주는 리소스입나다.

source: Godot's internal classes have methods that register a class's data with a :ref:`ClassDB <class_ClassDB>`. This database provides runtime access to class information (also called "reflection"). Things stored in the ClassDB include, among other things...
ko: Godot의 내장 클래스는 메서드를 가지며 클래스의 데이터를 :ref:`ClassDB <class_ClassDB>`\ 로 등록합니다. 이 데이터베이스는 ("reflection"이라 하는) 클래스 정보에 액세스하여 런타임을 제공합니다. ClassDB에 저장된 것은 다음 것도 포함됩니다...

source: Furthermore, this ClassDB is what Objects actually check against when performing any operation. Access a property? Call a method? Emit a signal? It will check the database's records (and the records of the Object's base types) to see if the Object supports the operation. Every C++ Object defines a static `_bind_methods()` function that describes what C++ content it registers to the database and how.
ko: 게다가 ClassDB는 어떤 객체가 언제 연산을 수행하는 지를 확인합니다. 속성에 액세스하는가? 메서드를 호출하는가? 시그널을 방출하는가? 이 모두를 데이터베이스의 기록 (그리고 객체의 기본 타입의 기록)에서 확인함으로써 객체가 연산을 지원하는 지 여부를 볼 수 있습니다. 모든 C++ 객체는 정적 `_bind_methods()` 함수를 정의하는데 이걸로 데이터베이스에 등록한 C++ 내용물이 무엇이고 어떻게 등록했는지를 설명합니다.

source: So, if the engine provides all of this data at startup, then how does a user define their own data? It'd be nice if users could define a custom set of data to be appended to an object's data. That way, users could inject their own properties and methods into the engine's Object query requests.
ko: 따라서 엔진이 시작할 때 이 모든 데이터를 제공한다면, 사용자는 어떻게 고유의 데이터를 정의할까요? 사용자가 객체의 데이터에 추가하는 커스텀 데이터 세트를 정의하는 것이 좋습니다. 이 방법으로 사용자는 고유의 속성과 메서드를 엔진의 객체 쿼리 요청에 넣을 수 있습니다.

source: *This* is what a :ref:`Script <class_Script>` is. Objects check their attached script before the database, so scripts can even override methods. If a script defines a `_get_property_list()` method, that data is appended to the list of properties the Object fetches from the ClassDB. The same holds true for other declarative code.
ko: *이것*\ 이 바로 :ref:`Script <class_Script>`\ 입니다. 객체는 데이터베이스 이전에 붙어있는 스크립트를 확인합니다, 즉 스크립트는 메서드를 재정의할 수도 있습니다. 스크립트가 `_get_property_list()` 메서드를 정의한다면, ClassDB에서 객체가 가져오는 속성 목록이 데이터로 추가됩니다. 이는 다른 선언적 코드에서도 마찬가지입니다.

source: This can lead to some users' confusion when they see a script as being a class unto itself. In reality, the engine just auto-instantiates the base engine class and then adds the script to that object. This then allows the Object to defer to the Script's content where the engine logic deems appropriate.
ko: 스크립트가 그 자체로 하나의 클래스가 되는 것을 보면 일부 사용자는 혼란에 빠질 수 있습니다. 사실 엔진은 기본 엔진 클래스를 자동으로 인스턴스화한 뒤 그 객체에 스크립트를 추가합니다. 이것으로 객체는 엔진 논리에 적절하다고 판단하는 스크립트의 내용을 이행합니다.

source: A problem does present itself though. As the size of Objects increases, the scripts' necessary size to create them grows much, much larger. Creating node hierarchies demonstrates this. Each individual Node's logic could be several hundred lines of code in length.
ko: 자체적인 문제가 있습니다. 객체의 규모가 커질수록, 그것을 만드는 데 필요한 스크립트의 규모도 더욱 더 커집니다. 이것은 노드 계층 구조를 만드는 것으로 드러납니다. 각 노드의 논리는 수 백줄의 코드가 될 수 있습니다.

source: let's see a simple example of creating a single Node as a child.
ko: 한 노드를 자식으로 만드는 예제를 알아봅시다.

source: Notice that only two pieces of declarative code are involved in the creation of this child node: the variable declaration and the constructor declaration. Everything else about the child must be setup using imperative code. However, script code is much slower than engine C++ code. Each change must make a separate call to the scripting API which means a lot of C++ "lookups" within data structures to find the corresponding logic to execute.
ko: 선언 노드의 두 부분만 자식 노드를 생성하는데 관여합니다: 변수 선언과 생성자 선언입니다. 자식에 관한 다른 나머지는 명령형 코드를 사용해 설정해야 합니다. 하지만 스크립트 코드는 엔진 C++ 코드보더 훨씬 더 느립니다. 각 변경사항은 스크립팅 API로의 호출을 만들게 되고, 이는 즉 데이터 구조 내 실행하기 위한 해당 논리를 찾는 많은 C++ "lookup들"을 의미합니다.

source: To help offload the work, it would be convenient if one could batch up all operations involved in creating and setting up node hierarchies. The engine could then handle the construction using its fast C++ code, and the script code would be free from the perils of imperative code.
ko: 작업량을 줄이기 위해 무언가가 노드 계층 구조를 만들고 설정하는 데 관련된 모든 작업을 처리할 수 있다면 편리할 것입니다. 그러면 엔진은 빠른 C++ 코드를 사용해 그 구조를 다룰 수 있을 것이고, 스크립트 코드는 명령형 코드의 위험으로부터 벗어날 수 있을 것입니다.

source: *This* is what a scene (:ref:`PackedScene <class_PackedScene>`) is: a resource that provides an advanced "constructor" serialization which is offloaded to the engine for batch processing.
ko: *이것*\ 이 바로 씬입니다 (:ref:`PackedScene <class_PackedScene>`): 고급 "생성자" 직렬화를 제공하는 리소스로 일괄 처리를 위해 엔진이 오프로드하도록 합니다.

source: Now, why is any of this important to scene organization? Because one must understand that scenes *are* objects. One often pairs a scene with a scripted root node that makes use of the sub-nodes. This means that the scene is often an extension of the script's declarative code.
ko: 자, 왜 이렇게 씬 조직이 중요할까요? 씬이 *바로* 객체라는 것을 이해해야합니다. 때로는 하나의 씬과 스크립트과 붙은 루트 노드로 된 씬을 하위 노드로 사용하는 경우도 있습니다. 즉, 씬은 때로 스크립트의 선언적 코드의 확장이 됩니다.

source: It helps to define...
ko: 씬이 정의하는 것은...

source: what objects are available to the script?
ko: 어떤 객체를 스크립트에서 사용할 수 있는지?

source: how are they organized?
ko: 어떻게 그들이 조직되어있는지?

source: how are they initialized?
ko: 어떻게 그들이 초기화되는지?

source: what connections to each other do they have, if any?
ko: 그렇다면 서로에게 어떤 연결이 있는지?

source: As such, many Object-Oriented principles which apply to "programming", i.e. scripts, *also* apply to scenes. Some scripts are designed to only work in one scene (which are often bundled into the scene itself). Other scripts are meant to be re-used between scenes.
ko: 이처럼 많은 객체 지향 원칙들이 "프로그래밍"에 적용됩니다, 즉 스크립트 *또한* 씬에 적용됩니다. 어떤 스크립트는 오직 하나의 씬에서만 작동하도록 설계됩니다 (보통은 씬 자체에서 번들로 제공됩니다). 그렇지 않은 스크립트는 씬 사이에서 재사용될 수 있습니다.

source: **Regardless, the scene is always an extension of the root script, and can therefore be interpreted as a part of the class.** Most of the points covered in this series will build on this point, so keep it in mind.
ko: **그럼에도 불구하고 씬은 항상 루트 스크립트의 확장이고, 그렇기에 클래스의 일부로 해석될 수 있습니다.** 이 시리즈의 대부분은 이러한 시점에서 다루게 될 것입니다, 그러니 명심하세요.
