Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/what_are_godot_classes.po
Languages: de, es, fr, ja, ko, ru, zh_cn, zh_tw

source: Godot scenes and scripts are classes
es: Las escenas y scripts de Godot son clases
fr: Les scènes de Godot et les scripts sont des classes
ja: Godotのシーンとスクリプトはクラスです
zh_cn: Godot场景和脚本都是类
zh_tw: Godot 中的場景與物件都是類別

source: In Godot, scripts and scenes can both be the equivalent of classes in an Object-Oriented programming language. The main difference is that scenes are `declarative code <https://en.wikipedia.org/wiki/Declarative_programming>`_, while scripts can contain `imperative code <https://en.wikipedia.org/wiki/Imperative_programming>`_.
es: En Godot, tanto las escenas como los scripts pueden ser el equivalente a las clases en un lenguaje de programación orientado a objetos. La principal diferencia es que las escenas son `código declarativo <https://en.wikipedia.org/wiki/Declarative_programming>`_, mientras que los scripts pueden contener `código imperativo <https://en.wikipedia.org/wiki/Imperative_programming>`_.
fr: Dans Godot, les scripts et les scènes sont l'équivalent des classes dans les langages de programmation Orientés Objet. La principale différence étant que les scènes contiennent du `code déclaratif <https://fr.wikipedia.org/wiki/Programmation_d%C3%A9clarative>`_, alors que les scripts peuvent contenir du `code impératif <https://fr.wikipedia.org/wiki/Programmation_imp%C3%A9rative>`_.
ja: Godotでは、スクリプトとシーンの両方をオブジェクト指向プログラミング言語のクラスに相当させることができます。主な違いは、シーンは `宣言型コード<https://en.wikipedia.org/wiki/Declarative_programming>` であるのに対して、スクリプトには `命令型コード<https://en.wikipedia.org/wiki/Imperative_programming>` を含めることができることです。
zh_cn: 在Godot中，脚本和场景，两者都可以等同于面向对象编程语言中的类。主要区别在于：场景是 `声明性代码 <https://en.wikipedia.org/wiki/Declarative_programming>`_，而脚本可以包含 `命令性代码 <https://en.wikipedia.org/wiki/Imperative_programming>`_。
zh_tw: 在 Godot 中，腳本與場景都可以等同於物件導向程式設計語言中的類別。主要的不同是，場景是 `宣告型程式碼 <https://zh.wikipedia.org/wiki/%E5%AE%A3%E5%91%8A%E5%BC%8F%E7%B7%A8%E7%A8%8B>`_ ，而腳本可以包含 `指令式程式碼 <https://zh.wikipedia.org/zh-tw/%E6%8C%87%E4%BB%A4%E5%BC%8F%E7%B7%A8%E7%A8%8B>`_ 。

source: As a result, many best practices in Godot boil down to applying Object-Oriented design principles to the scenes, nodes, or script that make up your game.
es: Como resultado, muchas buenas prácticas en Godot se reducen a aplicar principios de diseño orientado a objetos a las escenas, nodos o scripts que forman tu juego.
fr: De ce fait, beaucoup de bonnes pratiques de Godot se résument à appliquer des principes de design Orienté Objet dans les scènes, nœuds ou scripts qui composent votre jeu.
ja: その結果、Godotの多くのベストプラクティスは、ゲームを構成するシーン、ノード、またはスクリプトにオブジェクト指向の設計原則を適用することに要約されます。

source: This guide explains how scripts and scenes work in the engine's core, to help you get a sense of how Godot works under the hood, and to help you better understand where some of this series' best practices come from.
es: Esta guía explica cómo funcionan los scripts y las escenas en el núcleo del motor, para ayudarte a tener una idea de cómo funciona Godot por dentro, y ayudarte a que entiendas mejor de dónde vienen algunas buenas prácticas de esta serie.
fr: Ce guide explique comment les scripts et les scènes fonctionnent dans le cœur du moteur, pour vous aider à avoir une idée de la façon dont Godot fonctionne sous le capot, et pour vous aider à mieux comprendre d'où viennent certaines des meilleures pratiques de cette série.
ja: このガイドでは、スクリプトとシーンがエンジンのコアでどのように機能するかを説明し、Godotが内部でどのように機能するかを理解し、このシリーズのベストプラクティスの一部を理解するのに役立ちます。
zh_cn: 本指南介绍了，脚本和场景在引擎核心中的工作方式，以帮助您了解Godot在引擎盖下的工作方式，并帮助您更好地理解本系列中某些最佳实践的来历。
zh_tw: 本指南解釋了腳本與場景在引擎核心中是如何運作的，來協助你瞭解 Godot 實際是怎麼運作的，並幫助你更好地理解本系列中的一些最佳實踐是怎麼來的。

source: Making sense of classes in Godot
es: Dando sentido a las clases en Godot
fr: Donner un sens aux classes dans Godot
ja: Godotのクラスを理解する
zh_cn: Godot中类的意义
zh_tw: 瞭解 Godot 中的類別

source: Godot Engine provides built-in classes like :ref:`Node <class_Node>`. User-created types are not technically classes. Instead, they are resources that tell the engine a sequence of initializations to perform on one of the engine's built-in classes.
es: El motor de Godot proporciona clases incorporadas como :ref:`Nodo <class_Node>`. Los tipos creados por el usuario no son técnicamente clases. En cambio, son recursos que dan al motor una serie de inicializaciones a realizar en una de las clases incorporadas del motor.
fr: Le moteur Godot fournit des classes intégrées comme :ref:`Node <class_Node>`. Les types créés par l'utilisateur ne sont pas techniquement des classes. Au lieu de cela, ce sont des ressources qui indiquent au moteur une séquence d'initialisation à exécuter sur l'une des classes intégrées du moteur.
ja: Godotエンジンには :ref:`node <class_Node>` のような組み込みクラスが用意されています。ユーザーが作成した型は、技術的にはクラスではありません。そうではなく、エンジンの組み込みクラスの 1つで実行する初期化のシーケンスをエンジンに指示するリソースです。
zh_cn: Godot引擎提供了内置类，如 :ref:`Node <class_Node>`。用户创建的类型从技术上讲不是类。相反，它们是资源，告诉在引擎的某一内置类上，执行初始化的序列。
zh_tw: Godot Engine 提供了一些如 :ref:`Node <class_Node>` 之類的內建類別。使用者建立的型別理論上不是類別，而是用來告訴引擎要在內建類別上進行一系列初始化操作的資源。

source: Godot's internal classes have methods that register a class's data with a :ref:`ClassDB <class_ClassDB>`. This database provides runtime access to class information. ``ClassDB`` contains information about classes like:
de: Die internen Klassen von Godot verfügen über Methoden, die die Daten einer Klasse mit einem :ref:`ClassDB <class_ClassDB>` registrieren. Diese Datenbank bietet Laufzeitzugriff auf Klasseninformationen. ``ClassDB`` enthält Informationen zu Klassen wie:
es: Las clases internas de Godot tienen métodos que registran los datos de una clase mediante una :ref:`ClassDB <class_ClassDB>`. Esta base de datos proporciona acceso en tiempo de ejecución a información de la clase. ClassDB contiene información sobre las clases como:
fr: Les classes internes de Godot ont des méthodes qui enregistrent les données d'une classe avec un :ref:`ClassDB <class_ClassDB>`. Cette base de données fournit un accès runtime aux informations de classe. ``ClassDB`` contient des informations sur les classes comme :
ja: Godotの内部クラスには、クラスのデータを :ref:`ClassDB <class_ClassDB>` に登録するメソッドがあります。このデータベースは、クラス情報へのランタイムアクセスを提供します。\ ``ClassDB`` には、次のようなクラスに関する情報が含まれています。
ru: Во внутренних классах Godot есть методы, которые регистрируют данные класса с помощью :ref:`ClassDB <class_ClassDB>`. Эта база данных обеспечивает доступ к информации о классе во время выполнения. ``ClassDB`` содержит информацию о классах типа:
zh_cn: Godot的内部类具有使用一个 :ref:`ClassDB <class_ClassDB>` 注册一个类数据的方法。该数据库提供对类信息的运行时访问。``ClassDB`` 包含有关类的信息，例如：
zh_tw: Godot 的內部類別有一些向 :ref:`ClassDB <class_ClassDB>` 註冊類別資料的方法。通過 ClassDB 這個資料庫便能在執行時存取類別資訊。``ClassDB`` 包含了如下類別資訊：

source: properties
es: Propiedades
fr: propriétés
ja: プロパティ
ko: 속성
zh_cn: 属性
zh_tw: 屬性

source: methods
es: métodos
fr: les méthodes
ja: メソッド
ko: 메서드
zh_cn: 方法
zh_tw: 方法

source: constants
es: Constantes
fr: les constantes
ja: 定数
ko: 상수
zh_cn: 常量
zh_tw: 常數

source: signals
es: señales
fr: les signaux
ja: シグナル
ko: 시그널
zh_cn: 信号
zh_tw: 訊號

source: This ``ClassDB`` is what Objects check against when performing an operation like accessing a property or calling a method. ``ClassDB`` checks the database's records and the records of the Object's base types to see if the Object supports the operation.
es: Esta ``ClassDB`` es lo que los objetos verifican cuando realizan una operación como acceder a una propiedad o llamar un método. ``ClassDB`` comprueba los registros de la base de datos y los registros de los tipos base del objeto para ver si el objeto soporta la operación.
fr: Cette ``ClassDB``` est ce que les Objets vérifient quand ils exécutent une opération comme accéder à une propriété ou appeler une méthode. ``ClassDB`` vérifie les enregistrements de la base de données et les enregistrements des types de base de l'objet pour voir si l'objet supporte l'opération.
ja: この ``ClassDB`` は、プロパティへのアクセスやメソッドの呼び出しなどの操作を実行するときにオブジェクトがチェックするものです。\ ``ClassDB`` は、データベースのレコードとオブジェクトの基本型のレコードをチェックして、オブジェクトが操作をサポートしているかどうかを確認します。
zh_cn: 当执行诸如访问属性或调用方法之类的操作时，对象会对此 ``ClassClass`` 进行检查。``ClassDB`` 检查数据库的记录和对象的基本类型的记录，以查看对象是否支持该操作。
zh_tw: ``ClassDB`` 即為物件在執行如存取屬性或呼叫方法等特定操作時用來檢查的地方。``ClassDB`` 會檢查資料庫記錄與物件的基礎型別，來確認該物件是否支援要執行的操作。

source: On the engine's side, every class defines a static ``_bind_methods()`` function that describes what C++ content it registers to the database and how. When you use the engine, you can extend the methods, properties, and signals available from the ``ClassDB`` by attaching a :ref:`Script <class_Script>` to your node.
es: En el lado del motor, cada clase define una función ``_bind_methods()`` estática que describe qué contenido de C++ registra en la base de datos y cómo. Cuando usas el motor, puedes ampliar los métodos, propiedades y señales disponibles de la ``ClassDB`` vinculando un :ref:`Script <class_Script>` al nodo.
fr: Côté moteur, chaque classe définit une fonction statique ``_bind_methods()`` qui décrit le contenu C++ qu'elle enregistre dans la base et comment. Lorsque vous utilisez le moteur, vous pouvez étendre les méthodes, propriétés et signaux disponibles depuis la ``ClassDB`` en attachant un :ref:`Script <class_Script>` à votre noeud.
ja: エンジン側では、すべてのクラスが静的な ``_bind_methods()`` 関数を定義し、データベースに登録するC++コンテンツとその方法を記述します。エンジンを使用する場合、ノードに :ref:`Script <class_Script>` をアタッチすることにより\ ``ClassDB`` から利用可能なメソッド、プロパティ、シグナルを拡張できます。
zh_cn: 在引擎方面，每个类都定义一个静态的 ``_bind_methods()`` 函数，该函数描述其向数据库注册的 C++ 内容以及如何注册。使用引擎时，可以通过将 :ref:`Script <class_Script>` 附加到节点，来扩展 ``ClassDB`` 中可用的方法、属性、和信号。
zh_tw: 在引擎方面，所有類別都定義了一個靜態 ``_bind_methods()`` 函式，用來描述該類別要將什麼 C++ 內容註冊到資料庫裡，以及該如何向資料庫註冊。當在使用引擎時，可以通過附加 :ref:`Script <class_Script>` 到節點上來擴充 ``ClassDB`` 內可用的方法、屬性與訊號。

source: Objects check their attached script before the database. This is why scripts can override built-in methods. If a script defines a ``_get_property_list()`` method, Godot appends that data to the list of properties the Object fetches from the ClassDB. The same is true for other declarative code.
es: Los objetos comprueban sus scripts vinculados antes que la base de datos. Esta es la razón por la cual los scripts pueden redefinir métodos incorporados. Si un script define un método ``_get_property_list()``, Godot adjunta esta información a la lista de propiedades que el objeto extrae de la ``ClassDB``. Lo mismo sucede con otro código declarativo.
fr: Les objets vérifient leur script attaché avant la base de données. C'est pourquoi les scripts peuvent remplacer les méthodes intégrées. Si un script définit une méthode ``_get_property_list()``, Godot ajoute ces données à la liste des propriétés que l'objet récupère depuis la ClassDB. Il en va de même pour les autres codes déclaratifs.
ja: オブジェクトは、データベースより以前にアタッチされたスクリプトをチェックします。このため、スクリプトは組み込みメソッドをオーバーライドできます。スクリプトで ``_get_property_list()`` メソッドが定義されている場合、GodotはオブジェクトがClassDBから取得するプロパティのリストにそのデータを追加します。同じことが他の宣言型コードにも当てはまります。
zh_cn: 对象在数据库之前检查其附加脚本。这就是脚本可以覆盖内置方法的原因。如果脚本定义了一个 ``_get_property_list()`` 方法，则Godot会将数据追加到，Object从 ``ClassDB`` 获取的属性列表中。其他声明性代码也是如此。
zh_tw: 物件會先檢查附加在自己身上的腳本然後再檢查資料庫。因此腳本可以覆寫內建函式。若腳本有定義 ``_get_property_list()`` 方法，則 Godot 會將該方法回傳的列表附加到該物件從 ClassDB 取得的列表後面。其他宣告型程式碼也一樣。

source: Even scripts that don't inherit from a built-in type, i.e. scripts that don't start with the ``extends`` keyword, implicitly inherit from the engine's base :ref:`Reference <class_Reference>` class. This allows the Object to defer to the script's content where the engine logic deems appropriate.
es: Incluso los scripts que no heredan de un tipo incorporado, como por ejemplo scripts que no empiezan con la palabra clave ``extends``, implícitamente heredan de la clase base :ref:`Reference <class_Reference>` del motor. Esto permite al objeto diferir al contenido del script donde la lógica del motor considere apropiado.
fr: même les scripts qui n’héritent pas d'un type basique (built-in), c'est à dire qui ne commencent pas avec le mot clé ``extends``, héritent implicitement de la classe `Reference <class_Reference>` du moteur. Cela permet l'objet de s'en remettre au contenu du script si la logique du moteur le juge approprié.
ja: 組み込み型から継承しないスクリプト、つまり ``extends`` キーワードで始まらないスクリプトでさえ、エンジンのベース :ref:`Reference <class_Reference>` クラスから暗黙的に継承します。これにより、オブジェクトは、エンジンロジックが適切と考えるスクリプトのコンテンツに従うことができます。
zh_cn: 即使不是从内置类型继承的脚本（即不以 ``extends`` 关键字开头的脚本），也隐式地继承自引擎的基本 :ref:`Reference <class_Reference>` 类。这允许对象，在引擎逻辑认为适当的地方，遵从脚本的内容。
zh_tw: 即時腳本不是從內建型別繼承來的，即不以 ``extends 關鍵字開始的腳本，也會隱含性地自動繼承引擎的基礎 :ref:`Reference <class_Reference>` 類別。這樣一來便能讓該類別在引擎覺得合邏輯的地方來遵守腳本內容。

source: As a result, you can instance scripts without the ``extends`` keyword from code, but you cannot attach them to a :ref:`Node <class_Node>`
es: Como resultado, puedes instanciar scripts sin la palabra clave ``extends`` mediante código, pero no puedes vincularlos a un :ref:`Node <class_Node>`
fr: Par conséquent, vous pouvez instancier un script sans le mot clé ``extends`` dans le code, cependant vous ne pouvez pas l'attacher a une :ref:`Node <class_Node>`
ja: その結果、コードから ``extends`` キーワードを指定せずにスクリプトをインスタンス化することはできますが、\ :ref:`Node <class_Node>` にアタッチすることはできません
zh_cn: 结果，您可以实例化，代码中没有 ``extends`` 关键字的脚本，但是您不能将它们附加到一个 :ref:`Node <class_Node>`
zh_tw: 因此，可以在程式碼中實體化沒有 ``extends`` 關鍵字的腳本，但無法將這個腳本附加到 :ref:`節點 <class_Node>` 上

source: Scripting performances and PackedScene
es: Rendimiento del scripting y PackedScene
fr: Performances des scripts et PackedScene
ja: スクリプトのパフォーマンスとPackedScene
zh_cn: 脚本性能和 ``PackedScene``
zh_tw: 腳本效能與 PackedScene

source: As the size of Objects increases, the scripts' necessary size to create them grows much, much larger. Creating node hierarchies demonstrates this. Each individual Node's logic could be several hundred lines of code in length.
es: A medida que crece el tamaño de los objetos, el tamaño necesario de los scripts para crearlos crece mucho, mucho más. Crear jerarquías de nodos demuestra esto. La lógica de cada nodo individual podría ser de varios cientos de líneas de código.
fr: Au fur et à mesure que la taille des objets augmente, la taille nécessaire aux scripts pour les créer devient beaucoup, beaucoup plus grande. La création de hiérarchies de nœuds en est la preuve. La logique de chaque Nœud individuel pourrait être de plusieurs centaines de lignes de code.
ja: オブジェクトのサイズが大きくなるにつれて、作成に必要なスクリプトのサイズがどんどん大きくなります。ノード階層を作成すると、これが実証されます。個々のノードのロジックは、長さが数百行のコードになる可能性があります。
zh_cn: 随着对象大小的增加，创建它们所需的脚本大小也变得越来越大。创建节点层次结构演示了这一点。每个节点的逻辑长度可能是几百行代码。
zh_tw: 隨著物件的大小增長，要建立物件所需的腳本也變得越來越大。建立節點階層即可重現此狀況。個別節點的邏輯可為數百行程式碼。

source: Let's see a simple example of creating a single ``Node`` as a child. The code below creates a new ``Node``, changes its name, assigns a script to it, sets its future parent as its owner so it gets saved to disk along with it, and finally adds it as a child of the ``Main`` node:
es: Veamos un sencillo ejemplo de crear un solo ``Node`` como hijo. El código a continuación crea un nuevo ``Node``, cambia su nombre, asigna un script al mismo, establece su futuro padre como su propietario para que se guarde en disco junto a él, y finalmente lo añade como un hijo del nodo ``Main``:
fr: Voyons un exemple simple, créer un ``Nœud`` enfant seul. Le code ci dessous crée un nouveau ``Nœud``, change son nom, lui assigne un script et change son futur parent en son propriétaire, afin qu'il soit sauvegardé sur le disque en même temps que lui, et finalement l'ajoute en tant qu'enfant du nœud ``Principal`` (Main) :
ja: 単一の ``Node`` を子として作成する簡単な例を見てみましょう。以下のコードは、新しい ``Node`` を作成し、その名前を変更し、スクリプトをそれに割り当て、将来の親(``Main``)を所有者として設定し、それとともにディスクに保存され、最後に ``Main``ノードの子として追加します:
zh_cn: 让我们看一个简单的示例，将单个 ``Node`` 创建为子级。下面的代码创建一个新的 ``Node``；更改其名称；为其分配脚本；将其未来的父级设置为其所有者，以便将其与之，一起保存到磁盘；最后将其作为一个子级添加到 ``Main`` 节点：
zh_tw: 來看看一個建立 ``Node`` 子節點的簡單範例。下列程式碼會建立一個新的 ``Node`` 節點、更改名稱、為該節點指派腳本、然後將新節點的母節點設為目前節點，這樣一來該節點才會跟著一起保存到硬碟上，然後最後才將 ``Main`` 節點作為目前節點的腳本保存：

source: Script code like this is much slower than engine-side C++ code. Each change makes a separate call to the scripting API which leads to many "look-ups" on the back-end to find the logic to execute.
es: Código de script como éste es mucho más lento que código C++ del lado del motor. Cada cambio hace una llamada separada a la API de scripting que conlleva muchas búsquedas en el back-end para encontrar la lógica a ejecutar.
fr: Le code d'un script comme celui ci est beaucoup plus lent que le C++ du moteur. Chaque modification fait un appel distincts à l'API de script ce qui mène à de nombreuses recherche en arrière plan pour trouver la logique à exécuter.
ja: このようなスクリプト コードは、エンジン側の C++コードよりもはるかに低速です。各変更は、実行するロジックを見つけるためにバックエンドで多くの「ルックアップ」につながるスクリプトAPIを個別に呼び出します。
zh_cn: 这样的脚本代码比引擎端的 C++ 代码要慢得多。每次更改都会对脚本API进行单独的调用，从而导致后端进行许多“查找”，以查找要执行的逻辑。
zh_tw: 像這樣的程式碼會比引擎端 C++ 程式碼還要慢很多。每個改動都會需要額外的腳本 API 呼叫來向後端「查詢」要執行什麼邏輯。

source: Scenes help to avoid this performance issue. :ref:`PackedScene <class_PackedScene>`, the base type that scenes inherit from, are resources that use serialized data to create objects. The engine can process scenes in batches on the back-end and provide much better performance than scripts.
es: Las escenas ayudan a evitar este problema de rendimiento. :ref:`PackedScene <class_PackedScene>`, el tipo base del que heredan las escenas, son recursos que usan datos serializados para crear objetos. El motor puede procesar escenas por lotes en el back-end y proporcionar mucho mejor rendimiento que los scripts.
fr: Les scènes aident à éviter ce genre de problème lié aux performances. :ref:`PackedScene <class_PackedScene>`, le type basique duquel les scènes héritent sont des ressources qui utilisent de données en série pour créer des objets. Le moteur peut ensuite calculer les scènes en lots en arrière plan ce qui permet de bien meilleures performances qu'avec des scripts.
ja: シーンは、このパフォーマンスの問題を回避するのに役立ちます。\ :ref:`PackedScene <class_PackedScene>` は、シーンが継承する基本型であり、シリアル化されたデータを使用してオブジェクトを作成するリソースです。エンジンは、バックエンドでシーンをバッチ処理し、スクリプトよりもはるかに優れたパフォーマンスを提供できます。
zh_cn: 场景有助于避免此性能问题。场景继承的基本类型，:ref:`PackedScene <class_PackedScene>`，是使用序列化数据创建对象的资源。引擎可以在后端批量处理场景，并提供比脚本更好的性能。
zh_tw: 場景系統可以避免這種效能問題。 :ref:`PackedScene <class_PackedScene>` ，即，場景繼承的基礎型別，是一種資源，可以用來序列化資料並建立物件。引擎可以在後端批次處理場景，並可提供比腳本好很多的效能。

source: Scenes and scripts are objects
es: Escenas y scripts son objetos
fr: Scenes et scripts sont des objets
ja: シーンとスクリプトはオブジェクト
zh_cn: 场景和脚本是对象
zh_tw: 場景與腳本是物件

source: Why is any of this important to scene organization? Because scenes *are* objects. One often pairs a scene with a scripted root node that makes use of the sub-nodes. This means that the scene is often an extension of the script's declarative code.
es: ¿Por qué esto es importante para la organización de las escenas? Porque las escenas *son* objetos. A menudo se empareja una escena con un nodo raíz con script que hace uso de los sub-nodos. Esto significa que la escena es a menudo una extensión del código declarativo del script.
fr: Pourquoi tout cela est-il important pour l'organisation de la scène ? Parce que les scènes *sont* des objets. On associe souvent une scène à un nœud racine scripté qui utilise les nœuds inférieurs. Cela signifie que la scène est souvent une extension du code déclaratif du script.
ja: シーン編成にとって、これが重要なのはなぜですか？ なぜなら、シーン\ *は*\ オブジェクトだからです。サブノードを利用するスクリプト化されたルートノードとシーンをペアにすることがよくあります。これは、シーンがスクリプトの宣言コードの拡張であることが多いことを意味します。
zh_cn: 为什么这些对场景组织很重要？因为场景 *是* 对象。人们通常使用子节点，将场景与脚本化的根节点配对。这意味着场景通常是，脚本声明性代码的扩展。
zh_tw: 為什麼這些東西對場景組織來說有這麼重要？因為場景 **是** 物件。大家通常會將場景與有腳本的根節點一起使用，然後用根節點上的腳本來使用子節點。這表示，場景通常算是腳本中宣告型程式碼的延伸。

source: The content of a scene helps to define:
de: Der Inhalt einer Szene hilft bei der Definition von:
es: El contenido de una escena ayuda a definir:
fr: Le contenu d'une scène aide à définir :
ja: シーンのコンテンツは、以下を定義するのに役立ちます:
ru: Содержание сцены позволяет определить:
zh_cn: 场景的内容有助于定义：
zh_tw: 場景的內容可以協助定義：

source: What nodes are available to the script
de: Welche Nodes in dem Skript verfügbar sind
es: Qué nodos están disponibles al script
fr: Quels nœuds sont disponibles pour le script
ja: スクリプトで使用可能なノード
ru: Какие узлы доступны сценарию (скрипту)
zh_cn: 脚本可使用哪些节点
zh_tw: 腳本中可以使用哪些節點

source: How they are organized
de: Wie sie organisiert sind
es: Cómo están organizados
fr: Comment ils sont organisés
ja: どのように構成されているか
ru: Как они организованы
zh_cn: 它们是如何组织的
zh_tw: 節點如何組織

source: How are they initialized
es: Cómo se inicializan
fr: Comment sont-ils initialisés
ja: どのように初期化されるか

source: What signal connections they have with each other
de: Welche Signalverbindungen sie miteinander haben
es: Qué conexiones de señales tienen entre ellos
fr: Quelles connections signal elles ont, les une avec les autres
ja: それら相互のシグナル接続
ru: Какие сигнальные связи они имеют друг с другом
zh_cn: 它们彼此之间有什么信号连接
zh_tw: 節點之間有用什麼訊號連接

source: Many Object-Oriented principles which apply to written code *also* apply to scenes.
es: Varios principios orientados a objetos que se aplican a código escrito *también* se aplican a las escenas.
fr: Beaucoup de principe du paradigme de code Orienté-Objet qui s'appliquent au code écrit s'appliquent aussi aux scènes.
ja: 記述されたコードに適用される多くのオブジェクト指向の原則は、シーン\ **にも**\ 適用されます。
zh_cn: 适用于编写代码的许多面向对象的原则，也适用于场景。
zh_tw: 許多用於撰寫程式碼的物件導向原則 **也** 適用於場景中。

source: The scene is *always an extension of the script attached to its root node*. You can see all the nodes it contains as part of a single class.
es: La escena es *siempre una extensión del script vinculado a su nodo raíz*. Puedes ver todos los nodos que contiene como parte de una sola clase.
fr: La scène est toujours une extension du script attaché à son nœud racine. Considérez chaque nœud qu'il contient comme une partie d'une unique classe.
ja: シーンは *常にルートノードにアタッチされたスクリプトの拡張* です 。1つのクラスの一部として、そのノードに含まれるすべてのノードを確認できます。
zh_cn: 场景 *始终是附加到其根节点的脚本的扩展*。您可以将其包含的所有节点，视为单个类的一部分。
zh_tw: 場景 **永遠是附加到場景根節點的腳本的延伸** 。可以將場景中包含的所有節點視為單一類別的一部分。

source: Most of the tips and techniques explained in this series will build on this.
es: La mayoría de los consejos y técnicas explicados en esta serie se basarán en esto.
fr: La plupart des conseils et techniques expliqués dans cette série s'appuieront sur ça.
ja: このシリーズで説明するヒントとテクニックのほとんどは、これに基づいています。
zh_cn: 本系列中介绍的大多数技巧和技术，都将以此为基础。
zh_tw: 本系列中的許多提示與技術解釋都以此為基礎。

source: As a result, many best practices in Godot boil down to applying Object-Oriented design principles to the scenes, nodes, or scripts that make up your game.
zh_tw: 因此，在 Godot 中的許多最佳實踐都就只是將物件導向設計原則套用在構成遊戲的場景、節點與腳本上而已。

source: How they are initialized
de: Wie sie initialisiert werden
ru: Как они инициализированы
zh_tw: 節點如何初始化

source: Applying object-oriented principles in Godot
de: Anwendung objektorientierter Prinzipien in Godot
ru: Применение объектно-ориентированного подхода в Godot

source: The engine offers two main ways to create reusable objects: scripts and scenes. Neither of these technically define classes under the hood.
de: Die Engine bietet zwei Hauptmöglichkeiten zum Erstellen wiederverwendbarer Objekte: Skripte und Szenen. Beide definieren technisch gesehen keine Klassen unter der Haube.
ru: Движок предлагает два основных способа создания объектов многократного использования: сценарии и сцены. Ни один из них технически не определяет внутренние классы.

source: Still, many best practices using Godot involve applying object-oriented programming principles to the scripts and scenes that compose your game. That is why it's useful to understand how we can think of them as classes.
de: Bei vielen empfohlenen Vorgehensweisen mit Godot werden jedoch objektorientierte Programmierprinzipien auf die Skripte und Szenen angewendet, aus denen Ihr Spiel besteht. Deshalb ist es nützlich zu verstehen, wie wir sie als Klassen betrachten können.
ru: Тем не менее, многие передовые практики использования Godot включают применение принципов объектно-ориентированного программирования к сценариям и сценам, из которых состоит ваша игра. Вот почему полезно понять, как мы можем думать о них как о классах.
