Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/beziers_and_curves.po
Languages: de

source: Beziers, curves and paths
de: Beziers, Kurven und Pfade

source: Bezier curves are a mathematical approximation of natural geometric shapes. We use them to represent a curve with as little information as possible and with a high level of flexibility.
de: Bezierkurven sind eine mathematische Annäherung an natürliche geometrische Formen. Wir verwenden sie um eine Kurve mit möglichst wenig Informationen und einem hohen Maß an Flexibilität darzustellen.

source: Unlike more abstract mathematical concepts, Bezier curves were created for industrial design. They are a popular tool in the graphics software industry.
de: Im Gegensatz zu abstrakteren mathematischen Konzepten wurden Bezier-Kurven für das Industriedesign erstellt. Sie sind ein beliebtes Werkzeug in der Grafiksoftwareindustrie.

source: They rely on :ref:`interpolation<doc_interpolation>`, which we saw in the previous article, combining multiple steps to create smooth curves. To better understand how Bezier curves work, let's start from its simplest form: Quadratic Bezier.
de: Sie basieren auf :ref:`interpolation <doc_interpolation>` die wir im vorherigen Artikel gesehen haben und kombinieren mehrere Schritte um glatte Kurven zu erstellen. Um besser zu verstehen wie Bezier-Kurven funktionieren, beginnen wir mit der einfachsten Form: Quadratisches Bezier.

source: Quadratic Bezier
de: Quadratisches Bezier

source: Take three points, the minimum required for Quadratic Bezier to work:
de: Nehmen Sie drei Punkte, das Minimum, das erforderlich ist, damit quadratisches Bezier funktioniert:

source: To draw a curve between them, we first interpolate gradually over the two vertices of each of the two segments formed by the three points, using values ranging from 0 to 1. This gives us two points that move along the segments as we change the value of ``t`` from 0 to 1.
de: Um eine Kurve zwischen ihnen zu zeichnen, interpolieren wir zunächst schrittweise über die beiden Eckpunkte jedes der beiden durch die drei Punkte gebildeten Segmente, wobei Werte zwischen 0 und 1 verwendet werden. Dies gibt uns zwei Punkte, die sich entlang der Segmente bewegen, wenn wir den Wert von ``t`` von 0 bis 1 ändern.

source: We then interpolate ``q0`` and ``q1`` to obtain a single point ``r`` that moves along a curve.
de: Wir interpolieren dann ``q0`` und ``q1`` um einen einzelnen Punkt ``r`` zu erhalten, der sich entlang einer Kurve bewegt.

source: This type of is called a *Quadratic Bezier* curve.
de: Diese Art wird als *Quadratische Bezier*-Kurve bezeichnet.

source: Cubic Bezier
de: Kubischer Bezier

source: Building upon the previous example, we can get more control by interpolating between four points.
de: Aufbauend auf dem vorherigen Beispiel können wir mehr Kontrolle erhalten, indem wir zwischen vier Punkten interpolieren.

source: We first use a function with four parameters to take four points as an input, ``p0``, ``p1``, ``p2`` and ``p3``:
de: Wir verwenden zuerst eine Funktion mit vier Parametern, um vier Punkte als Eingabe zu verwenden: ``p0``, ``p1``, ``p2`` und ``p3``:

source: We apply a linear interpolation to each couple of points to reduce them to three:
de: Wir wenden eine lineare Interpolation auf jedes Paar von Punkten an, um sie auf drei zu reduzieren:

source: We then take our three points and reduce them to two:
de: Wir nehmen dann unsere drei Punkte und reduzieren sie auf zwei:

source: And to one:
de: und auf einen:

source: Here is the full function:
de: Hier ist die komplette Funktion:

source: The result will be a smooth curve interpolating between all four points:
de: Das Ergebnis ist eine glatte Kurve, die zwischen allen vier Punkten interpoliert:

source: Cubic Bezier interpolation works the same in 3D, just use ``Vector3`` instead of ``Vector2``.
de: Die kubische Bezier-Interpolation funktioniert in 3D genauso. Verwenden Sie einfach ``Vector3`` anstelle von ``Vector2``.

source: Adding control points
de: Füge Kontrollpunkte hinzu

source: Building upon Cubic Bezier, we can change the way two of the points work to control the shape of our curve freely. Instead of having ``p0``, ``p1``, ``p2`` and ``p3``, we will store them as:
de: Aufbauend auf Cubische Bezier können wir die Funktionsweise von zwei Punkten ändern, um die Form unserer Kurve frei zu kontrollieren. Anstatt ``p0``, ``p1``, ``p2`` und ``p3`` zu haben, speichern wir sie wie folgt:

source: ``point0 = p0``: Is the first point, the source
de: ``point0 = p0``: Ist der erste Punkt, die Quelle

source: ``control0 = p1 - p0``: Is a vector relative to the first control point
de: ``control0 = p1 - p0``: Ist ein Vektor relativ zum ersten Kontrollpunkt

source: ``control1 = p3 - p2``: Is a vector relative to the second control point
de: ``control1 = p3 - p2``: Ist ein Vektor relativ zum zweiten Kontrollpunkt

source: ``point1 = p3``: Is the second point, the destination
de: ``point1 = p3``: Ist der zweite Punkt, das Ziel

source: This way, we have two points and two control points which are relative vectors to the respective points. If you've used graphics or animation software before, this might look familiar:
de: Auf diese Weise haben wir zwei Punkte und zwei Kontrollpunkte, die relative Vektoren zu den jeweiligen Punkten sind. Wenn Sie zuvor Grafik- oder Animationssoftware verwendet haben, kommt Ihnen dies möglicherweise bekannt vor:

source: This is how graphics software presents Bezier curves to the users, and how they work and look in Godot.
de: Auf diese Weise präsentiert Grafiksoftware den Benutzern Bezier-Kurven und wie diese in Godot arbeiten und aussehen.

source: Curve2D, Curve3D, Path and Path2D
de: Curve2D, Curve3D, Path und Path2D

source: There are two objects that contain curves: :ref:`Curve3D <class_Curve3D>` and :ref:`Curve2D <class_Curve2D>` (for 3D and 2D respectively).
de: Es gibt zwei Objekte, die Kurven enthalten:: ref: `Curve3D <class_Curve3D>` und: ref: `Curve2D <class_Curve2D>` (für 3D bzw. 2D).

source: They can contain several points, allowing for longer paths. It is also possible to set them to nodes: :ref:`Path <class_Path>` and :ref:`Path2D <class_Path2D>` (also for 3D and 2D respectively):
de: Sie können mehrere Punkte enthalten, wodurch längere Pfade möglich sind. Es ist auch möglich, sie auf Nodes zu setzen: :ref:`Pfad <Klassenpfad>` und :ref:`Pfad2D <Klassenpfad2D>` (auch für 3D bzw. 2D):

source: Using them, however, may not be completely obvious, so following is a description of the most common use cases for Bezier curves.
de: Ihre Verwendung ist jedoch möglicherweise nicht ganz offensichtlich. Im Folgenden werden die häufigsten Anwendungsfälle für Bezier-Kurven beschrieben.

source: Evaluating
de: Auswerten

source: Just evaluating them may be an option, but in most cases it's not very useful. The big drawback with Bezier curves is that if you traverse them at constant speed, from ``t = 0`` to ``t = 1``, the actual interpolation will *not* move at constant speed. The speed is also an interpolation between the distances between points ``p0``, ``p1``, ``p2`` and ``p3`` and there is not a mathematically simple way to traverse the curve at constant speed.
de: Nur eine Beurteilung kann eine Option sein, ist aber in den meisten Fällen nicht sehr nützlich. Der große Nachteil bei Bezier-Kurven besteht darin, dass sich die tatsächliche Interpolation *nicht* mit konstanter Geschwindigkeit bewegt, wenn Sie sie mit konstanter Geschwindigkeit von ``t = 0`` bis ``t = 1`` durchlaufen. Die Geschwindigkeit ist auch eine Interpolation zwischen den Abständen zwischen den Punkten ``p0``, ``p1``, ``p2`` und ``p3`` und es gibt keine mathematisch einfache Möglichkeit die Kurve mit konstanter Geschwindigkeit zu durchlaufen.

source: Let's do a simple example with the following pseudocode:
de: Schauen wir uns ein einfaches Beispiel mit dem folgenden Pseudocode an:

source: As you can see, the speed (in pixels per second) of the circle varies, even though ``t`` is increased at constant speed. This makes beziers difficult to use for anything practical out of the box.
de: Wie Sie sehen können variiert die Geschwindigkeit (in Pixel pro Sekunde) des Kreises, obwohl ``t`` mit konstanter Geschwindigkeit erhöht wird. Dies macht es schwierig, Bezier standardmäßig für Praktisches zu verwenden.

source: Drawing
de: Zeichnen

source: Drawing beziers (or objects based on the curve) is a very common use case, but it's also not easy. For pretty much any case, Bezier curves need to be converted to some sort of segments. This is normally difficult, however, without creating a very high amount of them.
de: Das Zeichnen von Bezier (oder Objekten basierend auf der Kurve) ist ein sehr häufiger Anwendungsfall, aber auch nicht einfach. In fast jedem Fall müssen Bezier-Kurven in eine Art Segment konvertiert werden. Dies ist jedoch normalerweise schwierig, ohne eine sehr große Menge davon zu erzeugen.

source: The reason is that some sections of a curve (specifically, corners) may require considerable amounts of points, while other sections may not:
de: Der Grund dafür ist, dass einige Abschnitte einer Kurve (insbesondere Ecken) möglicherweise eine beträchtliche Anzahl von Punkten erfordern, andere Abschnitte möglicherweise nicht:

source: Additionally, if both control points were ``0, 0`` (remember they are relative vectors), the Bezier curve would just be a straight line (so drawing a high amount of points would be wasteful).
de: Wenn beide Kontrollpunkte ``0, 0`` wären (denken Sie daran, dass es sich um relative Vektoren handelt), wäre die Bezier-Kurve nur eine gerade Linie (daher wäre das Zeichnen einer großen Anzahl von Punkten verschwenderisch).

source: Before drawing Bezier curves, *tessellation* is required. This is often done with a recursive or divide and conquer function that splits the curve until the curvature amount becomes less than a certain threshold.
de: Vor dem Zeichnen von Bezier-Kurven ist *Tessellation* erforderlich. Dies geschieht häufig mit einer rekursiven oder "Teile und Herrsche"-Funktion, die die Kurve teilt, bis der Krümmungsbetrag einen bestimmten Schwellenwert unterschreitet.

source: The *Curve* classes provide this via the :ref:`Curve2D.tessellate() <class_Curve2D_method_tessellate>` function (which receives optional ``stages`` of recursion and angle ``tolerance`` arguments). This way, drawing something based on a curve is easier.
de: Die *Curve*-Klassen bieten dies über die Funktion :ref:`Curve2D.tessellate () <class_Curve2D_method_tessellate>` (die optionale ``Stufen`` der Rekursion und Winkel ``Toleranz``-Argumente empfängt). Auf diese Weise ist es einfacher etwas basierend auf einer Kurve zu zeichnen.

source: Traversal
de: Durchlaufen

source: The last common use case for the curves is to traverse them. Because of what was mentioned before regarding constant speed, this is also difficult.
de: Der letzte häufige Anwendungsfall für die Kurven besteht darin, sie zu durchlaufen. Aufgrund der zuvor erwähnten konstanten Geschwindigkeit ist dies ebenfalls schwierig.

source: To make this easier, the curves need to be *baked* into equidistant points. This way, they can be approximated with regular interpolation (which can be improved further with a cubic option). To do this, just use the :ref:`Curve.interpolate_baked()<class_Curve_method_interpolate_baked>` method together with :ref:`Curve2D.get_baked_length()<class_Curve2D_method_get_baked_length>`. The first call to either of them will bake the curve internally.
de: Um dies zu vereinfachen, müssen die Kurven in Punkte gleichmäßiger Abstände *eingebrannt* werden. Auf diese Weise können sie durch regelmäßige Interpolation angenähert werden (was mit einer kubischen Option weiter verbessert werden kann). Verwenden Sie dazu einfach die Methode :ref:`Curve.interpolate_baked () <class_Curve_method_interpolate_baked>` zusammen mit :ref:`Curve2D.get_baked_length () <class_Curve2D_method_get_baked_length>`. Der erste Aufruf an einen von ihnen brennt die Kurve intern.

source: Traversal at constant speed, then, can be done with the following pseudo-code:
de: Das Durchlaufen mit konstanter Geschwindigkeit kann dann mit dem folgenden Pseudocode erfolgen:

source: And the output will, then, move at constant speed:
de: Und das Ergebnis ist dann, eine Bewegung mit konstanter Geschwindigkeit:
