Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/interpolation.po
Languages: fr, zh_cn

source: Interpolation is a very basic operation in graphics programming. It's good to become familiar with it in order to expand your horizons as a graphics developer.
fr: L'interpolation est une opération très basique en programmation graphique. Il est bon de s'y familiariser afin d'élargir ses horizons en tant que développeur graphique.
zh_cn: 插值是图形编程中一个非常基本的操作。作为一名图形开发人员，熟悉它有助于扩展您的视野。

source: The basic idea is that you want to transition from A to B. A value ``t``, represents the states in-between.
fr: L'idée de base est que vous voulez passer de A à B. Une valeur ``t``, représente les états intermédiaires.
zh_cn: 基本思想是从A转换到B。“t”值是介于两者之间的状态。

source: As an example if ``t`` is 0, then the state is A. If ``t`` is 1, then the state is B. Anything in-between is an *interpolation*.
fr: Par exemple, si ``t`` est 0, alors l'état est A. Si ``t`` est 1, alors l'état est B. Tout ce qui se trouve entre les deux est une *interpolation*.
zh_cn: 举个例子，如果 ``t`` 值为0，那么状态是A。如果 ``t`` 值是1，状态是B。任何介于两者之间的都是*插值*。

source: Between two real (floating-point) numbers, a simple interpolation is usually described as:
fr: Entre deux nombres réels (en virgule flottante), une simple interpolation est généralement décrite comme :

source: And often simplified to:
fr: Et souvent simplifié à :
zh_cn: 通常简化为:

source: The name of this type of interpolation, which transforms a value into another at *constant speed* is *"linear"*. So, when you hear about *Linear Interpolation*, you know they are referring to this simple formula.
fr: Le nom de ce type d'interpolation, qui transforme une valeur en une autre à *vitesse constante* est *"linéaire "*. Ainsi, lorsque vous entendez parler d'interpolation linéaire, vous savez qu'il s'agit de cette formule simple.
zh_cn: 这类型的插值名字,将一个值以*恒定速度*转换成另一个值*“线性”*。当你听说线性插值时，就知道他们是指这个简单的公式。

source: There are other types of interpolations, which will not be covered here. A recommended read afterwards is the :ref:`Bezier <doc_beziers_and_curves>` page.
fr: Il existe d'autres types d'interpolations, qui ne seront pas traités ici. Il est recommandé de lire ensuite la page :ref:`Bezier <doc_beziers_and_curves>`.
zh_cn: 还有其他类型的插值，这里将不做讨论。建议之后阅读:参考:`贝塞尔<文档_贝塞尔_及_曲线>`页面。

source: Vector interpolation
fr: Interpolation vectorielle

source: Vector types (:ref:`Vector2 <class_Vector2>` and :ref:`Vector3 <class_Vector3>`) can also be interpolated, they come with handy functions to do it :ref:`Vector2.linear_interpolate() <class_Vector2_method_linear_interpolate>` and :ref:`Vector3.linear_interpolate() <class_Vector3_method_linear_interpolate>`.
fr: Les types de vecteurs (:ref:`Vector2 <class_Vector2>` et :ref:`Vector3 <class_Vector3>`) peuvent aussi être interpolés, ils ont des fonctions pratiques pour le faire :ref:`Vector2.linear_interpolate() <class_Vector2_method_linear_interpolate>` et :ref:`Vector3.linear_interpolate() <class_Vector3_method_linear_interpolate>`.
zh_cn: 向量类型(:参考:`二维向量<类_二维向量>` 和 :参考:`三维向量<类_三维向量>`)也可以插值，它们提供了方便的函数来实现这一点:参考:`二维向量.线性_插值() <类_二维向量_方法_线性_插值>` 和:参考:`三维向量.线性_插值() <类_三维向量_方法_线性_插值>`。

source: Here is simple pseudo-code for going from point A to B using interpolation:
fr: Voici un simple pseudo-code pour passer du point A au point B par interpolation :
zh_cn: 下面是使用插值从A点到B点的简单伪代码:

source: It will produce the following motion:
fr: Il produira le mouvement suivant :

source: Transform interpolation
fr: Interpolation par transformation

source: It is also possible to interpolate whole transforms (make sure they have either uniform scale or, at least, the same non-uniform scale). For this, the function :ref:`Transform.interpolate_with() <class_Transform_method_interpolate_with>` can be used.
fr: Il est également possible d'interpoler des transformations entières (s'assurer qu'elles ont soit une échelle uniforme, soit, au moins, la même échelle non uniforme). Pour cela, la fonction :ref:`Transform.interpolate_with() <class_Transform_method_interpolate_with>` peut être utilisée.
zh_cn: 也可以插值整个变换(确保它们要么具有统一的刻度，要么至少具有相同的非均匀刻度)。为此，可以使用这个函数:参考:`变换.插值_与() <类_变换_方法_插值_与>`。

source: Here is an example of transforming a monkey from Position1 to Position2:
fr: Voici un exemple de transformation d'un singe de Position1 à Position2 :
zh_cn: 下面是将猴子从位置1转换为位置2的例子：

source: Using the following pseudocode:
fr: En utilisant le pseudo-code suivant :

source: And again, it will produce the following motion:
fr: Et encore une fois, il produira le mouvement suivant :

source: Smoothing motion
fr: Mouvement lisser

source: Interpolation can be used to smooth movement, rotation, etc. Here is an example of a circle following the mouse using smoothed motion:
fr: L'interpolation peut être utilisée pour faciliter les mouvements, la rotation, etc. Voici un exemple d'un cercle suivant la souris avec un mouvement lissé :
zh_cn: 插值可用于平滑运动、旋转等。下面是使用平滑运动跟随鼠标的圆圈的例子：

source: Here is how it looks:
fr: Voici à quoi cela ressemble :

source: This useful for smoothing camera movement, allies following you (ensuring they stay within a certain range), and many other common game patterns.
fr: Ceci est utile pour adoucir les mouvements de la caméra, les alliés qui vous suivent (en s'assurant qu'ils restent à une certaine distance), et bien d'autres modèles de jeu courants.
zh_cn: 这对平滑相机运动很有用，队友在跟随你(确保他们保持在一定范围内)，以及许多其他常见的游戏模式。

source: Interpolation
zh_cn: 插值

source: For cubic interpolation, there are also :ref:`Vector2.cubic_interpolate() <class_Vector2_method_linear_interpolate>` and :ref:`Vector3.cubic_interpolate() <class_Vector3_method_linear_interpolate>`, which do a :ref:`Bezier <doc_beziers_and_curves>` style interpolation.
zh_cn: 以及立方插值，请参见:参考:`二维向量.立方_插值() <类_二维向量_方法_线性_插值>`和:参考:`三维向量.立方_插值() <类_三维向量_方法_线性_插值>`，使用:参考:`贝塞尔<文档_贝塞尔_及_曲线>`制作风格插值。
