Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/matrices_and_transforms.po
Languages: es, fr, ja, ko

source: Matrices and transforms
es: Matrices y transformaciones
fr: Matrices et transformations
ja: 行列と変換
ko: 행렬과 변환

source: Introduction
es: Introducción
ja: はじめに
ko: 소개

source: Before reading this tutorial, it is advised to read the previous one about :ref:`doc_vector_math` as this one is a direct continuation.
es: Antes de leer este tutorial, se recomienda leer el anterior sobre :ref:`doc_vector_math` ya que éste es una continuación directa.
fr: Avant de lire ce tutoriel, il est conseillé de lire le précédent sur :ref:`doc_vector_math` car celui-ci est une suite directe.
ja: このチュートリアルの前に、この前回にあたる\ :ref:`doc_vector_math`\ をまず読まれたほうが良いでしょう。
ko: 본 튜토리얼을 읽기 전에 :ref:`doc_vector_math` 에 대한 이전 튜토리얼을 읽어 보는 것이 좋습니다.

source: This tutorial will be about *transformations* and will cover a little about matrices (but not in-depth).
es: Este tutorial será sobre *transformaciones* y cubrirá un poco sobre matrices (pero no en profundidad).
fr: Ce tutoriel portera sur les *transformations* et couvrira un peu les matrices (mais pas en profondeur).
ja: このチュートリアルでは\ *変換*\ についてと、加えて行列についても少し扱います(深くは掘り下げません)。
ko: 본 튜토리얼에서는 *변환* 에 대해 다루며 행렬에 대해 설명합니다(심층적이지는 않음).

source: Transformations are most of the time applied as translation, rotation and scale so they will be considered as priority here.
es: Las transformaciones se aplican la mayor parte del tiempo como traslación, rotación y escala, por lo que se considerarán prioritarias aquí.
fr: Les transformations sont la plupart du temps appliquées comme translation, rotation et mise à l'échelle, donc elles seront considérées comme prioritaires ici.
ja: 変換はほとんどの場合、移動、回転、拡大に応用されるので、ここでは優先的に扱います。
ko: 변환은 변환, 회전 및 척도로 사용되는 대부분의 시간이기 때문에 여기서는 변환이 우선으로 간주됩니다.

source: Oriented coordinate system (OCS)
es: Orientación de un sistema de coordenadas (OCS)
fr: Système de coordonnées orienté (OCS)
ja: 直交座標系(OCS)
ko: OCS(주요 좌표계)

source: Imagine we have a spaceship somewhere in space. In Godot this is easy, just move the ship somewhere and rotate it:
es: Imagina que tenemos una nave espacial en el espacio. En Godot esto es fácil, basta con mover la nave hacia algún sitio y rotarla:
fr: Imaginez que nous avons un vaisseau spatial quelque part dans l'espace. Dans Godot c'est facile, il suffit de déplacer le vaisseau quelque part et de le faire tourner :
ja: 宇宙のどこかに宇宙船があると想像してみてください。Godotではこれは簡単です、ちょうどどこかに船を移動し、それを回転させます:
ko: 우주 어딘가에 우주선이 있다고 상상해 보세요. Godot에서 이것은 쉽습니다. 배를 어딘가로 옮겨서 돌리십시오:

source: Ok, so in 2D this looks simple, a position and an angle for a rotation. But remember, we are grown ups here and don't use angles (plus, angles are not even that useful when working in 3D).
es: Ok, entonces en 2D esto parece simple, una posición y un ángulo para una rotación. Pero recuerda, somos adultos aquí y no usamos ángulos (además, los ángulos ni siquiera son tan útiles cuando se trabaja en 3D).
fr: Ok, donc en 2D cela semble simple, une position et un angle pour une rotation. Mais n'oubliez pas que nous sommes des adultes ici et que nous n'utilisons pas d'angles (en plus, les angles ne sont même pas très utiles lorsque nous travaillons en 3D).
ja: さて、2Dでは、これは単純に見えます。位置と回転の角度です。しかし、私たちはここから成長し、角度を使用しないことを覚えておいてください(プラス、角度は3Dで作業する場合にはあまり役に立ちません)。
ko: 2D에서는 단순한 위치 및 회전각으로 보입니다. 하지만 기억하세요, 우리는 여기서 더 나아갔고, 각도는 사용하지 않습니다.

source: We should realize that at some point, someone *designed* this spaceship. Be it for 2D in a drawing such as Paint.net, Gimp, Photoshop, etc. or in 3D through a 3D DCC tool such as Blender, Max, Maya, etc.
es: Deberíamos darnos cuenta de que en algún momento, alguien *diseñó* esta nave espacial. Ya sea para 2D en un dibujo como Paint.net, Gimp, Photoshop, etc. o en 3D a través de una herramienta DCC 3D como Blender, Max, Maya, etc.
fr: Nous devrions nous rendre compte qu'à un moment donné, quelqu'un a *conçu* ce vaisseau spatial. Que ce soit en 2D dans un dessin comme Paint.net, Gimp, Photoshop, etc. ou en 3D avec un outil DCC 3D comme Blender, Max, Maya, etc.
ja: ある時点で、誰かがこの宇宙船を\ *設計*\ したことを理解する必要があります。Paint.net、Gimp、Photoshopなどの図面で2Dを作成するか、Blender、Max、Mayaなどの3D DCCツールを使用して3Dを作成します。
ko: 우리는 언젠가 누군가가 이 우주선을 *설계* 했다는 것을 깨달아야 합니다. Paint.net, Gimp, Photoshop 등과 같은 도면에서 2D로 제작하거나 Blender, Max, Maya 등과 같은 3D DCC 도구를 통해 3D로 제작해야 합니다.

source: When it was designed, it was not rotated. It was designed in its own *coordinate system*.
es: Cuando se diseñó, no estaba rotado. Fue diseñado en su propio *sistema de coordenadas*.
fr: Quand il a été conçu, il n’a pas été tourné. Il a été conçu dans son propre * système de coordonnées *.
ja: 設計時には、回転していませんでした。独自の\ *座標系*\ で設計されました。
ko: 이것은 설계 시 회전하지 않았습니다. 그것은 자체적인 *좌표계 시스템* 으로 설계되었습니다.

source: This means that the tip of the ship has a coordinate, the fin has another, etc. Be it in pixels (2D) or vertices (3D).
es: Esto significa que la punta de la nave tiene una coordenada, la aleta tiene otra, etc. Ya sea en píxeles (2D) o vértices (3D).
fr: Cela signifie que l'avant du vaisseau a une coordonnée, la dérive en a une autre, etc. Que ce soit en pixels (2D) ou en sommets (3D).
ja: これは、船の先端に座標があり、フィンに別の座標があることを意味します。ピクセル(2D)または頂点(3D)のいずれかです。
ko: 이것은 우주선의 끝이 좌표를 가지고 있고 판부분은 다른 것을 가지고 있다는 것을 의미합니다. 픽셀(2D) 또는 정점(3D)으로 지정합니다.

source: So, let's recall again that the ship was somewhere in space:
es: Así, recordemos de nuevo que la nave estaba en algún lugar en el espacio:
fr: Donc, rappelons-nous encore une fois que le vaisseau était quelque part dans l'espace :
ja: それでは、船が宇宙のどこかにあったことをもう一度思い出しましょう:
ko: 그러면, 우주 어딘가에 우주선이 있었다는 것을 회상해봅시다:

source: How did it get there? What moved it and rotated it from the place it was designed to its current position? The answer is... a **transform**, the ship was *transformed* from their original position to the new one. This allows the ship to be displayed where it is.
es: ¿Cómo llegó a estar allí? ¿Qué la trasladó y la giró desde el lugar en que fue diseñado a su posición actual? La respuesta es... un **transform**; la nave fue *transformada* desde su posición original a la nueva. Esto permite que la nave se muestre donde está.
fr: Comment est-ce arrivé là ? Qu'est-ce qui l'a déplacé et tourné de l'endroit désigné vers sa position actuelle ? La réponse est... une **transformation**, le vaisseau a été *transformé* depuis sa position originelle vers la nouvelle. Cela permet au vaisseau d'être affiché là où il est.
ja: どうやってそこに行きましたか？何が移動して、設計された場所から現在の位置に回転したのでしょうか？答えは...\ **変換**\ です。船は元の位置から新しい位置に\ *変換*\ されました。これにより、船舶を現在の場所に表示できます。
ko: 그건 어떻게 그곳에 도착했나요? 무엇을 움직여서 디자인된 위치에서 현재 위치로 회전시킨건가요? 답은... **변환** 입니다. 우주선은 원래 위치에서 새 위치로 *변환* 되었습니다. 이렇게 하면 우주선이 있는 곳에 표시될 수 있습니다.

source: But transform is too generic of a term to describe this process. To solve this puzzle, we will superimpose the ship's original design position at their current position:
es: Pero “transformar” es un término muy genérico para describir este proceso. Para solucionar este puzle, superpondremos la posición original de diseño de la nave en su posición actual:
fr: Mais la transformation est un terme trop générique pour décrire ce processus. Pour résoudre ce casse-tête, nous allons superposer la position de conception originale du navire à sa position actuelle :
ja: しかし、変換はこのプロセスを説明するには一般的な用語です。このパズルを解決するために、船の元の設計位置を現在の位置に重ね合わせます:
ko: 그러나 변환은 이 과정을 설명하기에는 너무 일반적인 용어입니다. 이 퍼즐을 해결하기 위해 우주선의 원래 설계 위치를 현재 위치에 겹치게 됩니다:

source: So, we can see that the "design space" has been transformed too. How can we best represent this transformation? Let's use 3 vectors for this (in 2D), a unit vector pointing towards X positive, a unit vector pointing towards Y positive and a translation.
es: Entonces, podemos ver que el "espacio diseño" también ha sido transformado. ¿Cuál es la manera mejor de representar esta transformación? Usemos 3 vectores para esto (en 2D): un vector unitario que señala hacia el eje X positivo, un vector unitario que señala hacia el Y positivo y un desplazamiento.
fr: Ainsi, nous pouvons constater que "l'espace de conception" a été lui aussi transformé. Comment représenter au mieux cette transformation ? Utilisons pour cela (en 2D) 3 vecteurs, un vecteur unitaire pointant vers X positif, un vecteur unitaire pointant vers Y positif et une translation.
ja: そのため、\ ``デザインスペース`` も変化していることがわかります。この変換をどのように最もよく表現できますか？これに3つのベクトル(2D)を使用してみましょう。Xの正の方向を指す単位ベクトル、Yの正の方向を指す単位ベクトル、および平行移動です。
ko: "설계된 우주"도 바뀌었습니다. 이러한 변화를 가장 잘 표현할 수 있는 방법은 무엇일까요? 이를 위해 (2D 단위) 3개의 벡터를 사용하겠습니다. X 양수를 가리키는 단위 벡터, Y 양수를 가리키는 단위 벡터 및 변환을 사용합니다.

source: Let's call the 3 vectors "X", "Y" and "Origin", and let's also superimpose them over the ship so it makes more sense:
es: Llamemos los vectores "X", "Y" y "Origin", y los superpongamos en la nave para que tenga más sentido:
fr: Appelons les 3 vecteurs "X", "Y" et "Origine", et superposons les aussi au vaisseau, pour que cela ait plus de sens :
ja: 3つのベクトルを"X"、"Y"、"Origin(原点)"と呼び、さらにそれらを船の上に重ねて、より意味のあるものにしましょう:
ko: 이 세 벡터를 "X", "Y" 및 "Origin"이라고 부르고, 이 세 벡터를 우주선 위에 겹쳐보자:

source: Ok, this is nicer, but it still does not make sense. What do X,Y and Origin have to do with how the ship got there?
es: Vale, esto es mejor, pero todavía no tiene sentido. ¿Qué tienen que ver los vectores X, Y y Origin con cómo la nave llegó allí?
fr: Ok, c'est mieux, mais ça n'a toujours pas de sens. Qu'est-ce que X,Y et Origine ont à faire avec comment le vaisseau est arrivé là ?
ja: さて、これは良い感じですが、まだ意味をなしていません。X、Y、Originは船がそこに着いた方法と何の関係があるのでしょうか？
ko: 좋아요, 이게 더 좋긴 한데, 그래도 말이 안 돼요. X,Y,Origin이 우주선이 어떻게 그곳에 도착했는지와 무슨 관계가 있는걸까요?

source: Well, let's take the point from top tip of the ship as reference:
es: Bueno, tomemos como referencia el extremo superior de la nave:
fr: Bien, prenons le point du dessus du vaisseau comme référence :
ja: では、船の先端のポイントを参考にしてみましょう:
ko: 자, 우주선으로부터 참고할 수 있는 요점부터 말씀드리겠습니다:

source: And let's apply the following operation to it (and to all the points in the ship too, but we'll track the top tip as our reference point):
es: Y vamos a aplicarle la siguiente operación (y también a todos los puntos de la nave, pero rastrearemos la parte superior como nuestro punto de referencia):
fr: Et appliquons lui l'opération suivante (et à tous les points du vaisseau aussi, mais nous suivrons le point du dessus comme notre point de référence) :
ja: そして、次の操作をそれに適用してみましょう(そして船内のすべてのポイントにも適用しますが、基準点として先端を追跡します):
ko: 다음 작업을 여기에 적용해 보겠습니다(그리고 우주선의 모든 지점에도 적용하되, 맨위의 꼭지 부분을 기준점으로 추적해 보겠습니다):

source: Doing this to the selected point will move it back to the center:
es: Haciendo esto al punto seleccionado lo moverá de nuevo al centro:
fr: Faire cela au point sélectionné le ramènera au centre :
ja: 選択したポイントにこれを行うと、中心に戻ります:
ko: 이렇게 하면 선택한 지점으로 다시 이동합니다:

source: This was expected, but then let's do something more interesting. Use the dot product of X and the point, and add it to the dot product of Y and the point:
es: Esto era de esperar, pero entonces hagamos algo más interesante. Utiliza el producto de X y el punto, y añádelo al producto de Y y el punto:
fr: C'était attendu, mais faisons quelque chose de plus intéressant. Utilisions le produit scalaire de X et du point, et ajoutons le au produit scalaire de Y et du point :
ja: これは予想されていましたが、それからもっと面白いことをしましょう。Xと点の内積を使用し、Yと点の内積に追加します。
ko: 이것은 예상된 것이지만, 좀 더 흥미로운 것을 해봅시다. X와 점의 내적에 Y와 점의 내적을 더해보는 것을 사용합시다:

source: Then what we have is.. wait a minute, it's the ship in its design position!
es: Entonces lo que tenemos es... espera un minuto, ¡es la nave en su posición de diseño!
fr: Alors ce que nous avons est... attendez une minute, c'est le vaisseau dans sa position initiale de conception !
ja: そして、私たちが持っているのは...ちょっと待ってください、それは元の設計位置にある船です！
ko: 그럼 우리가 얻는 건.. 잠깐만, 우주선이 설계된 위치에 있습니다!

source: How did this black magic happen? The ship was lost in space, and now it's back home!
es: ¿Cómo sucedió esta magia negra? ¡La nave se perdió en el espacio y ahora ha vuelto a casa!
fr: Comment cette magie noir est arrivée ? Le vaisseau était perdu dans l'espace, et maintenant il est de retour au bercail !
ja: この黒魔術はどのようして起きたのですか？船は宇宙から消え、今では家に戻っています！
ko: 어떻게 이런 일이 일어난거죠? 우주선을 우주에서 잃어버렸는데 지금은 돌아왔어요!

source: It might seem strange, but it does have plenty of logic. Remember, as we have seen in the :ref:`doc_vector_math`, what happened is that the distance to X axis, and the distance to Y axis were computed. Calculating distance in a direction or plane was one of the uses for the dot product. This was enough to obtain back the design coordinates for every point in the ship.
es: Puede parecer extraño, pero tiene mucha lógica. Recuerda, como hemos visto en el :ref:`doc_vector_math`, lo que pasó es que la distancia al eje X, y la distancia al eje Y fueron calculadas. El cálculo de la distancia en una dirección o plano fue uno de los usos del producto de puntos. Esto fue suficiente para recuperar las coordenadas de diseño de cada punto de la nave.
fr: Cela peut paraître étrange, mais cela a beaucoup de logique. Rappelez-vous, comme nous l'avons vu dans le :ref:`doc_vector_math`, ce qui s'est passé est que la distance à l'axe X, et la distance à l'axe Y ont été calculées. Le calcul de la distance dans une direction ou un plan était l'une des utilisations du produit scalaire. C'était suffisant pour obtenir les coordonnées de conception de chaque point du navire.
ja: 奇妙に見えるかもしれませんが、多くのロジックがあります。\ :ref:`doc_vector_math` で見たように、X軸までの距離とY軸までの距離が計算されたことを思い出してください。方向または平面での距離の計算は、内積の用途の1つです。これは、船内のすべてのポイントの設計座標を取り戻すのに十分でした。
ko: 이상하게 보일지 모르지만, 그것은 많은 논리를 가지고 있습니다. :ref:`doc_vector_math` 에서 보았던 바와 같이 X축까지의 거리와 Y축까지의 거리가 계산되었다는 것을 기억하세요. 방향 또는 평면에서 거리를 계산하는 것은 내적을 사용하는 방법 중 하나입니다. 이것은 우주선 안의 모든 지점에 대한 설계 좌표를 다시 얻기에 충분했습니다.

source: So, what we have been working with so far (with X, Y and Origin) is an *Oriented Coordinate System*. X an Y are the **Basis**, and *Origin* is the offset.
es: Por lo tanto, lo que hemos estado trabajando hasta ahora (con X, Y y Origin) es un *Sistema de Coordenadas Orientado*. X e Y es la **Base**, y *Origin* es el desplazamiento.
fr: Ainsi, ce avec quoi nous avons travaillé jusqu'à présent (avec X, Y et Origin) est un système de coordonnées orienté *Oriented Coordinate System*. X et Y sont la **Base**, et *Origine* est le décalage.
ja: そのため、これまで(X、Y、およびOriginを使用して)取り組んできたのは \*指向座標系(OCS)*\です。 XとYは\**基準軸(基底)**\で、\* Origin*\はオフセットです。
ko: 지금까지 X, Y, 원점과 함께 작업한 것은 *지향적 좌표계* 입니다. X, Y는 **Basis** 이고 *원점* 은 오프셋입니다.

source: We know what the Origin is. It's where the 0,0 (origin) of the design coordinate system ended up after being transformed to a new position. This is why it's called *Origin*, But in practice, it's just an offset to the new position.
es: Sabemos lo que es Origin. Es donde termina el 0,0 (origin) del sistema de coordenadas de diseño después de ser transformado a una nueva posición. Esta es la razón por la que se llama *Origin* ("Origen"), pero en la práctica, es sólo una compensación a la nueva posición.
fr: Nous savons ce qu'est l'Origine. C'est là que le 0,0 (origine) du système de coordonnées de conception se retrouve après avoir été transformé à une nouvelle position. C'est pourquoi on l'appelle *Origine*, mais dans la pratique, c'est juste un décalage vers la nouvelle position.
ja: Originが何であるかを知っています。これは、新しい位置に変換された後、設計座標系の0,0(原点)が終わった場所です。これが\*Origin*\と呼ばれる理由ですが、実際には、新しい位置へのオフセットにすぎません。
ko: 우리는 원점이 무엇인지 압니다. 그것은 설계 좌표계의 0,0(원래)이 새로운 위치로 변환된 후에 종료되는 곳입니다. 이것이 바로 *원점*이라고 불리는 이유지만 실제로는 새로운 위치로의 상쇄에 불과합니다.

source: The Basis is more interesting. The basis is the direction of X and Y in the OCS from the new, transformed location. It tells what has changed, in either 2D or 3D. The Origin (offset) and Basis (direction) communicate "Hey, the original X and Y axes of your design are *right here*, pointing towards *these directions*."
es: La Base es más interesante. La base es la dirección de X e Y en el OCS desde la nueva ubicación transformada. Indica lo que ha cambiado, tanto en 2D como en 3D. Origin (desplazamiento) y Base (dirección) comunicarán "Hey, los ejes X e Y originales de tu diseño están *aquí*, apuntando hacia *estas direcciones*".
fr: La Base est plus intéressante. La base est la direction de X et Y dans l'OCS à partir du nouvel emplacement transformé. Il indique ce qui a changé, en 2D ou en 3D. L'origine (offset) et la base (direction) expriment "Hey, les axes X et Y originaux de votre dessin sont *juste ici*, pointant vers *ces directions*."
ja: 基準軸はもっと面白いです。基準軸は、新しい変換された場所からのOCSのXおよびYの方向です。変更内容を2Dまたは3Dで通知します。 Origin(オフセット)とBasis(方向)は、次のように伝えます「デザインの元のX軸とY軸は\ *ここ*\ にあり、\ *これらの方向*\ を指しています」
ko: 기저는 더 흥미롭습니다. 기저는 새로운 변환된 위치에서 OCS의 X와 Y의 방향입니다. 그것은 2D나 3D로 무엇이 바뀌었는지 말해줍니다. 원점(오프셋)과 베이스(방향)는 "너의 설계된 원래 X와 Y 축은 바로 *여기에 있어* *이러한 방향* 을 가리킵니다."

source: So, let's change the representation of the basis. Instead of 2 vectors, let's use a *matrix*.
es: Entonces, cambiemos la representación de la base. En lugar de 2 vectores, usemos una *matriz*.
fr: Donc, changeons la représentation de la base. Au lieu de 2 vecteurs, utilisons une *matrice*.
ja: それでは、基準軸の表現を変更しましょう。 2つのベクトルの代わりに、\ *matrix*\ を使用しましょう。
ko: 그러면, 기저의 표현을 바꿔보겠습니다. 2개의 벡터 대신에 *matrix* 를 사용합니다.

source: The vectors are up there in the matrix, horizontally. The next problem now is that.. what is this matrix thing? Well, we'll assume you've never heard of a matrix.
es: Los vectores están arriba en la matriz, horizontalmente. El siguiente problema ahora es que... ¿qué es eso de la matriz? Bueno, asumiremos que nunca has oído hablar de una matriz.
fr: Les vecteurs sont en haut dans la matrice, horizontalement. Le prochain problème maintenant est que... qu'est-ce que c'est que cette matrice ? Eh bien, nous supposerons que vous n'avez jamais entendu parler d'une matrice.
ja: ベクトルは、行列(matrix/マトリックス)内の水平方向にあります。次の問題は、それです..この行列って何ですか？さて、行列について聞いたことがないと仮定します。
ko: 벡터는 위쪽에 수평으로 있습니다. 다음 문제는.. 이 매트릭스란 무엇일까요?? 음, 우리는 당신이 매트릭스에 대해 들어본 적이 없다고 가정하겠습니다.

source: Transforms in Godot
es: Transformaciones en Godot
fr: Transformations dans Godot
ja: Godotで変換(幾何学変換)
ko: Godot 에서의 변환

source: This tutorial will not explain matrix math (and their operations) in depth, only its practical use. There is plenty of material for that, which should be a lot simpler to understand after completing this tutorial. We'll just explain how to use transforms.
es: Este tutorial no explicará las matemáticas de la matriz (y sus operaciones) en profundidad, sólo su uso práctico. Hay mucho material para eso, que debería ser mucho más fácil de entender después de completar este tutorial. Sólo explicaremos cómo usar las transformaciones.
fr: Ce tutoriel n'expliquera pas en profondeur les maths matricielles (et leurs opérations), mais seulement leur utilisation pratique. Il y a beaucoup de matériel pour cela, qui devrait être beaucoup plus simple à comprendre après avoir terminé ce tutoriel. Nous allons juste expliquer comment utiliser les transformations.
ja: このチュートリアルでは、行列の数学(およびその演算)については詳しく説明せず、実用的な使い方のみを説明します。そのための資料はたくさんありますが、このチュートリアルを完了すると、理解しやすくなります。変換(Transform)の使用方法を説明します。
ko: 본 튜토리얼에서는 행렬 수학(및 그 연산)을 실제로 사용하기만 하고 자세히 설명하지는 않습니다. 이 튜토리얼을 완수한 후 이해하기 훨씬 더 간단할 수 있습니다. 변환 사용법에 대해 설명하겠습니다.

source: :ref:`class_Transform2D` is a 3x2 matrix. It has 3 Vector2 elements and it's used for 2D. The "X" axis is the element 0, "Y" axis is the element 1 and "Origin" is element 2. It's not divided in basis/origin for convenience, due to its simplicity.
es: :ref:`class_Transform2D` es una matriz de 3x2. Tiene 3 elementos Vector2 y se usa para 2D. El eje "X" es el elemento 0, el eje "Y" es el elemento 1 y el "Origin" es el elemento 2. No está dividido en base/origen por conveniencia, debido a su simplicidad.
fr: ref:`class_Transform2D` est une matrice 3x2. Il a 3 éléments Vector2 et il est utilisé pour la 2D. L'axe "X" est l'élément 0, l'axe "Y" est l'élément 1 et "Origine" est l'élément 2. Il n'est pas divisé en base/origine pour des raisons de commodité, en raison de sa simplicité.
ja: :ref:`class_Transform2D` は3x2行列です。 3つのVector2要素があり、2Dに使用されます。"X"軸は要素0、"Y"軸は要素1、"Origin"は要素2です。その単純さのため、便宜上、基準軸/原点で分割されていません。

source: Most operations will be explained with this datatype (Transform2D), but the same logic applies to 3D.
es: La mayoría de las operaciones se explicarán con este tipo de datos (Transform2D), pero la misma lógica se aplica al 3D.
fr: La plupart des opérations seront expliquées avec ce type de données (Transform2D), mais la même logique s'applique à la 3D.
ja: ほとんどの操作はこのデータ型(Transform2D)で説明されますが、同じロジックが3Dにも適用されます。
ko: 대부분의 연산들은 이 데이터 타입(Transform2D)으로 설명되지만 3D에도 동일한 논리가 적용됩니다.

source: Identity
es: Identidad
fr: Identité
ja: 単位
ko: 항등성

source: An important transform is the "identity" matrix. This means:
es: Una transformación importante es la matriz de "identidad". Esto significa:
fr: Une transformation importante est la matrice d'"identité". Cela signifie :
ja: 重要なTransformは「単位」行列です。これの意味は:
ko: 중요한 변환은 항등행렬이다. 이것의 의미는:

source: 'X' Points right: Vector2(1,0)
es: 'X' Apunta a la derecha: Vector2(1,0)
fr: 'X' Pointe à droite : Vecteur2(1,0)
ja: 'X'ポイント 右: Vector2(1,0)
ko: X점 오른쪽: 벡터2(1.0)

source: 'Y' Points up (or down in pixels): Vector2(0,1)
es: 'Y' Apunta hacia arriba (o hacia abajo en píxeles): Vector2(0,1)
fr: 'Y' Pointe vers le haut (ou vers le bas en pixels) : Vecteur2(0,1)
ja: 'Y'ポイント 上(またはピクセルの下): Vector2(0,1)
ko: 'Y' 점 위(또는 픽셀 단위 아래): Vector2(0,1)

source: 'Origin' is the origin Vector2(0,0)
es: 'Origin' es el origen Vector2(0,0)
fr: 'Origin' est l'origine Vector2(0,0)
ja: 'Origin'は原点 Vector2(0,0)
ko: '원점'은 원점 벡터2(0,0)입니다

source: It's easy to guess that an *identity* matrix is just a matrix that aligns the transform to its parent coordinate system. It's an *OCS* that hasn't been translated, rotated or scaled.
es: Es fácil adivinar que una matriz de *identidad* es sólo una matriz que alinea la transformación con su sistema de coordenadas padre. Es un *OCS* que no ha sido traducido, rotado o escalado.
fr: Il est facile de deviner qu'une matrice d'*identité* est juste une matrice qui aligne la transformation sur son système de coordonnées parent. C'est un *OCS* qui n'a pas été traduit, tourné ou mis à l'échelle.
ja: * 単位*\ 行列は、変換を親座標系に合わせた行列にすぎないと推測するのは簡単です。これは、変換、回転、またはスケーリングされていない *OCS* です。
ko: *항등* 행렬은 상위 좌표계에 대한 변환을 조정하는 행렬일 뿐입니다. *OCS*는 변환, 회전 또는 스케일링되지 않았습니다.

source: Operations
es: Operaciones
fr: Opérations
ja: 操作
ko: 연산

source: Rotation
es: Rotación
ja: 回転

source: Rotating Transform2D is done by using the "rotated" function:
es: La rotación de Transform2D se realiza mediante la función "rotated":
fr: La rotation de Transform2D se fait à l'aide de la fonction "rotation" :
ja: Transform2Dの回転は、"rotated"関数を使用して行われます:
ko: Rotated(회전) 기능을 사용하여 Transform2D를 회전합니다:

source: Translation
es: Traslación
ja: 翻訳
ko: 변환

source: There are two ways to translate a Transform2D, the first one is moving the origin:
es: Hay dos maneras de trasladar un Transform2D, la primera es moviendo el origen:
fr: Il y a deux façons de translater un Transform2D, la première est de déplacer l'origine :
ja: Transform2Dの処理を翻訳するには2つの方法があります。最初の方法は原点を移動することです:
ko: Transform2D를 변환하는 두 가지 방법이 있습니다. 첫 번째 방법은 원점을 이동하는 것입니다:

source: This will always work in global coordinates.
es: Esto siempre funcionará en coordenadas globales.
fr: Cela fonctionnera toujours en coordonnées globales.
ja: これは常にグローバル座標で機能します。
ko: 이 기능은 항상 전반적인 좌표에 적용됩니다.
