Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/matrices_and_transforms.po
Languages: es, fr, ja, ko

source: If instead, translation is desired in *local* coordinates of the matrix (towards where the *basis* is oriented), there is the :ref:`Transform2D.translated() <class_Transform2D_method_translated>` method:
fr: Si à la place, la translation est désirée en coordonnées *locales* de la matrice (vers où la *base* est orientée), il y a la méthode :ref:`Transform2D.translated() <class_Transform2D_method_translated>` :
ja: 代わりに、行列の\ *local*\ 座標(\ *基準軸*\ が向いている方向)での変換が必要な場合、\ :ref:`Transform2D.translated() <class_Transform2D_method_translated>` メソッドがあります:
ko: 대신 행렬의 *지역* 좌표에 변환을 원하는 경우(*기저* 가 있는 위치), :ref:`Transform2D.translated() <class_Transform2D_method_translated>`방법이 있다:

source: You could also transform the global coordinates to local coordinates manually:
es: También se pueden transformar manualmente las coordenadas globales en coordenadas locales:
fr: Vous pouvez également transformer manuellement les coordonnées globales en coordonnées locales :
ja: グローバル座標をローカル座標に手動で変換することもできます:
ko: 전역 좌표를 수동으로 지역 좌표로 변환할 수도 있습니다:

source: But even better, there are helper functions for this as you can read in the next sections.
es: Pero aún mejor, hay funciones helper para esto como se puede leer en las siguientes secciones.
fr: Mais encore mieux, il y a des fonctions d'aide pour cela comme vous pouvez le lire dans les sections suivantes.
ja: しかし、さらに良いことに、次のセクションに書かれているように、このためのヘルパー関数があります。
ko: 더군다나, 다음 섹션에서 읽을 수 있는 것처럼 이것에 대한 도우미 기능도 있다.

source: Local to global coordinates and vice versa
es: Coordenadas locales a globales y viceversa
fr: Coordonnées locales à globales et vice versa
ja: ローカル座標からグローバル座標、およびその逆
ko: 지역에서 전역 좌표로 또는 그 반대로

source: There are helper methods for converting between local and global coordinates.
es: Hay métodos helper para convertir entre coordenadas locales y globales.
fr: Il existe des méthodes d'assistance pour la conversion entre les coordonnées locales et globales.
ja: ローカル座標とグローバル座標を変換するためのヘルパーメソッドがあります。
ko: 지역 좌표와 전역 좌표 사이를 변환하는 도우미 방법이 있습니다.

source: There are :ref:`Node2D.to_local() <class_Node2D_method_to_local>` and :ref:`Node2D.to_global() <class_Node2D_method_to_global>` for 2D as well as :ref:`Spatial.to_local() <class_Spatial_method_to_local>` and :ref:`Spatial.to_global() <class_Spatial_method_to_global>` for 3D.
fr: Il y a :ref:`Node2D.to_local() <class_Node2D_method_to_local>` et :ref:`Node2D.to_global() <class_Node2D_method_to_global>` pour la 2D et :ref:`Spatial.to_local() <class_Spatial_method_to_local>` et :ref:`Spatial.to_global() <class_Spatial_method_to_global>` pour la 3D.
ja: 2Dの場合は :ref:`Node2D.to_local() <class_Node2D_method_to_local>` と :ref:`Node2D.to_global() <class_Node2D_method_to_global>`\ 、3Dには :ref:`Spatial.to_local() <class_Spatial_method_to_local>`\ 、および :ref:` Spatial.to_global() <class_Spatial_method_to_global>` があります。
ko: 2D를 위한 것에는 :ref:`Node2D.to_local() <class_Node2D_to_local>` 와 :ref:`Node2D.to_global() <class_Node2D_method_to_global>` , 뿐만 아니라 3D를 위한 :ref:`Spatial.to_local() <class_Spatial_to_local>` 와 :ref:`Spatial.to_global() <class_Spatial_method_to_global>` 방법들이 있습니다.

source: A matrix can be scaled too. Scaling will multiply the basis vectors by a vector (X vector by x component of the scale, Y vector by y component of the scale). It will leave the origin alone:
es: Una matriz también se puede escalar. La escala multiplicará los vectores base por un vector (vector X por componente x de la escala, vector Y por componente y de la escala). Dejará el origen en paz:
fr: Une matrice peut également être mise à l'échelle. La mise à l'échelle multiplie les vecteurs de base par un vecteur (X du vecteur par la composante x de l'échelle, Y du vecteur par la composante y de l'échelle). Il laissera l'origine tranquille :
ja: 行列も拡大縮小できます。スケーリングは、基底ベクトル(基準軸)にベクトルを乗算します(Xベクトルとスケールのx要素、Yベクトルをスケールのy要素で乗算します)。このばあい原点はそのまま残します:
ko: 행렬도 스케일링할 수 있습니다. 스케일링은 기저에 벡터를 곱할 것입니다(스케일링의 X 성분별 X 벡터, 스케일의 y 성분별 Y 벡터). 원점은 그대로 둡니다:

source: These kind of operations in matrices are accumulative. It means every one starts relative to the previous one. For those who have been living on this planet long enough, a good reference of how transform works is this:
es: Este tipo de operaciones en matrices son acumulativas. Significa que cada uno comienza en relación con el anterior. Para aquellos que han estado viviendo en este planeta el tiempo suficiente, una buena referencia de cómo funciona la transformación es ésta:
fr: Ce type d'opérations dans les matrices sont cumulatives. Cela signifie que chacun commence par rapport au précédent. Pour ceux qui vivent sur cette planète depuis assez longtemps, une bonne référence de la façon dont la transformation fonctionne est ceci :
ja: 行列内のこの種の演算は累積的です。これは、すべてが前のものに関連して開始することを意味します。この惑星に十分長く住んでいる人にとって、変換がどのように機能するかについての良いリファレンスはこれです:
ko: 이런 종류의 행렬에서의 연산들은 축적되어 있습니다. 이것은 모든 사람들이 이전 것과 비교하여 시작한다는 것을 의미합니다. 이 지구에서 충분히 오래 살아온 사람들에게, 변환이 어떻게 작용하는지에 대한 좋은 참조는 다음과 같습니다:

source: A matrix is used similarly to a turtle. The turtle most likely had a matrix inside (and you are likely learning this many years *after* discovering Santa is not real).
es: Una matriz se usa de manera similar a una tortuga. Lo más probable es que la tortuga tuviera una matriz dentro (y es probable que estés aprendiendo esto muchos años *después* de descubrir a Santa Claus no es real).
fr: Une matrice est utilisée de la même manière qu'une tortue. La tortue avait très probablement une matrice à l'intérieur (et vous apprenez probablement ceci de nombreuses années *après* la découverte que le Père Noël n'est pas réel).
ja: 行列はタートルと同様に使用されます。カメはおそらく内部に行列を持っていました(そして、おそらくサンタが本物ではないことを発見した\ *後*\ 、あなたはこの何年も学んでいるでしょう)。訳注: 海外のプログラミング教育でLOGOなどのタートルグラフィックスが使用されている事に関連した文だと思われます。
ko: 행렬은 거북이와 비슷하게 사용됩니다. 거북이는 안에 행렬을 가지고 있을 가능성이 높습니다. (그리고 여러분은 산타는 진짜가 아니라는 것을 알게 된 후 수년 동안 이 사실을 배우게 될 것입니다).

source: Transform
es: Transformar
fr: Transformation
ja: 幾何学変換(変形)
ko: 변형

source: Transform is the act of switching between coordinate systems. To convert a position (either 2D or 3D) from "designer" coordinate system to the OCS, the "xform" method is used.
es: La transformación es el acto de cambiar entre sistemas de coordenadas. Para convertir una posición (2D o 3D) del "diseñador" del sistema de coordenadas al OCS, se utiliza el método "xform".
fr: Transformer est l'acte de passer d'un système de coordonnées à un autre. Pour convertir une position (2D ou 3D) du système de coordonnées "designer" vers l'OCS, la méthode "xform" est utilisée.
ja: 変換とは、座標系を切り替えることです。位置(2Dまたは3D)を「デザイナー」座標系からOCSに変換するには、"xform"メソッドが使用されます。
ko: 변환은 좌표계 사이를 전환하는 행위입니다. 위치(2D 또는 3D)를 "설계자" 좌표계에서 OCS로 변환하려면 "xform" 방법을 사용합니다.

source: And only for basis (no translation):
es: Y sólo para la base (sin traducción):
fr: Et seulement pour la base (pas de translation) :
ja: そして、基準軸のみ(変換なし):
ko: 그리고 오직 기저를 위한(변환 없음):

source: Inverse transform
es: Transformación inversa
fr: Transformation inverse
ja: 逆変換
ko: 역변환

source: To do the opposite operation (what we did up there with the rocket), the "xform_inv" method is used:
es: Para hacer la operación opuesta (lo que hicimos con el cohete), se utiliza el método "xform_inv":
fr: Pour effectuer l'opération contraire (ce que nous avons fait avec la fusée), la méthode "xform_inv" est utilisée :
ja: 逆の操作(ロケットで行ったこと)を行うには、"xform_inv"メソッドが使用されます:
ko: 반대되는 연산을 하기 위해 (우리가 위에서 로켓 가지고 했던 것) "xform_inv" 방법이 사용됩니다:

source: Only for Basis:
es: Sólo para la Base:
fr: Uniquement pour les bases :
ja: 基準軸のみ:
ko: 기저에만 해당:

source: Orthonormal matrices
es: Matrices ortonormales
fr: Matrices orthonormées
ja: 直交行列
ko: 직교 행렬

source: However, if the matrix has been scaled (vectors are not unit length), or the basis vectors are not orthogonal (90°), the inverse transform will not work.
es: Sin embargo, si la matriz ha sido escalada (los vectores no son de longitud unitaria), o los vectores de base no son ortogonales (90°), la transformación inversa no funcionará.
fr: Cependant, si la matrice a été mise à l'échelle (vecteurs qui ne sont pas à l'échelle unitaire), ou si les vecteurs de bases ne sont pas orthogonaux (90°), le transform inverse ne fonctionnera pas.
ja: ただし、行列がスケーリングされている場合(ベクトルが単位長ではありません)、または基底ベクトルが直交(90°で交差)していない場合、逆変換は機能しません。
ko: 그러나 만약 행렬의 벡터가 단위 길이가 아니거나 기본 벡터가 직교(90°)가 아닌 경우 역변환이 작동하지 않습니다.

source: In other words, inverse transform is only valid in *orthonormal* matrices. For this, these cases an affine inverse must be computed.
es: En otras palabras, la transformación inversa sólo es válida en matrices *ortonormales*. Para esto, estos casos se debe computar un inverso afín.
fr: En d'autres termes, le transform inverse est valide uniquement en matrices "orthonormées". Pour ce cas là, une inverse affine doit être calculée.
ja: 言い換えれば、逆変換は\ *直交*\ 行列でのみ有効です。このため、これらの場合、アフィン変換の逆行列を計算する必要があります。
ko: 즉, 역변환은 *직교* 행렬에서만 유효합니다. 이러한 경우, 아핀 역을 계산해야만 한다.

source: The transform, or inverse transform of an identity matrix will return the position unchanged:
es: La transformación, o transformación inversa, de una matriz de identidad devolverá la posición sin cambios:
fr: Le transform, ou transform inverse de l'identité d'une matrice renverra la position inchangée :
ja: 変換、または単位行列の逆変換は、変更されていない位置を返します:
ko: 항등 행렬의 변환 또는 역 변환은 위치를 변경하지 않고 반환합니다:

source: Affine inverse
es: Afín inverso
ja: アフィン逆行列
ko: 아핀 역

source: The affine inverse is a matrix that does the inverse operation of another matrix, no matter if the matrix has scale or the axis vectors are not orthogonal. The affine inverse is calculated with the affine_inverse() method:
es: El inverso afín es una matriz que hace la operación inversa de otra matriz, no importa si la matriz tiene escala o los vectores del eje no son ortogonales. El inverso afín se calcula con el método affine_inverse():
fr: L'affine inverse est une matrice qui fait l'opération inverse d'une autre matrice, peu importe si la matrice a une échelle ou si les vecteurs des axes ne sont pas orthogonaux. L'affine inverse est calculée avec la méthode affine_inverse() :
ja: アフィン逆行列は、行列にスケールがあるか、軸ベクトルが直交していないかに関係なく、別の行列の逆演算を行う行列です。アフィン逆行列は、affine_inverse()メソッドを使用して計算されます:
ko: 아핀 역은 행렬에 축척이 있거나 축 벡터가 직교하지 않더라도 다른 행렬의 역 연산을 수행하는 행렬입니다. 아핀 역은 the affine_inverse() 방법으로 계산됩니다:

source: If the matrix is orthonormal, then:
es: Si la matriz es ortonormal, entonces:
fr: Si la matrice est orthonormée, alors :
ja: 行列が正規直交の場合には:
ko: 만약 행렬이 직교한다면:

source: Matrix multiplication
es: Multiplicación de matrices
fr: Multiplication de matrice
ja: 行列乗算
ko: 행렬 곱

source: Matrices can be multiplied. Multiplication of two matrices "chains" (concatenates) their transforms.
es: Las matrices se pueden multiplicar. Multiplicación de dos matrices "encadenan" (concatenan) sus transformaciones.
fr: Les matrices peuvent être multipliées. Multiplication de deux matrices "chaînes" (concatène) leurs transformations.
ja: 行列は乗算できます。 2つの行列の乗算は、変換を「結合」(連結)します。
ko: 행렬은 곱해질 수 있습니다. 두 행렬의 곱은 그들의 변환을 연결합니다.

source: However, as per convention, multiplication takes place in reverse order.
es: Sin embargo, según la convención, la multiplicación tiene lugar en orden inverso.
fr: Cependant, t par convention, les multiplication ont lieu en sens inverse.
ja: ただし、慣例に従って、乗算は逆の順序で行われます。
ko: 그러나 관례에 따라 곱은 역순으로 진행됩니다.

source: Example:
es: Ejemplo:
fr: Exemple :
ja: 例:
ko: 예시:

source: To make it a little clearer, this:
es: Para que quede un poco más claro, esto:
fr: Pour rendre ceci un peu plus clair, cela :
ja: もう少し明確にするために、次の手順を実行します:
ko: 조금 더 깔끔하게 만들면, 이것이다:

source: Is the same as:
es: Es lo mismo que:
fr: Et pareil que :
ja: 次の場合と同じです:
ko: 이것은 다음과 같다:

source: However, this is not the same:
es: Sin embargo, esto no es lo mismo:
fr: Cependant, ce n'est pas identique :
ja: ただし、これは同じではありません:
ko: 그러나 이것은 같지 않다:

source: Because in matrix math, A * B is not the same as B * A.
es: Porque en matemáticas matriciales, A * B no es lo mismo que B * A.
fr: Parce que dans les maths matricielles, A * B n'est pas la même chose que B * A.
ja: 行列演算では、A * B は B * A と同じではないからです。
ko: 왜냐하면 행렬 연산에서, A*B는 B*A와 같지 않다.

source: Multiplication by inverse
es: Multiplicación por el inverso
fr: Multiplication par l'inverse
ja: 逆行列による乗算
ko: 역 곱하기

source: Multiplying a matrix by its inverse, results in identity:
es: Multiplicar una matriz por su inverso, resulta en una identidad:
fr: En multipliant une matrice par son inverse, on obtient l'identité :
ja: 行列に逆行列を掛けると、次の結果が得られます:
ko: 행렬에 그것의 역을 곱하는 것의 결과는 그것의 항등행렬이다:

source: Multiplication by identity
es: Multiplicación por la identidad
fr: Multiplication par l'identité
ja: 単位行列による乗算
ko: 항등행렬 곱하기

source: Multiplying a matrix by identity, will result in the unchanged matrix:
es: Multiplicando una matriz por la identidad, resultará en la matriz sin cambios:
fr: En multipliant une matrice par l'identité, on obtient la matrice inchangée :
ja: 行列を単位行列で乗算すると、変更されない行列が生まれます:
ko: 항등행렬을 행렬에 곱하면 결과는 원래 행렬에서 변화가 없을 것이다:

source: Matrix tips
es: Consejos sobre matrices
fr: Les astuces de matrice
ja: 行列のヒント
ko: 행렬 팁

source: When using a transform hierarchy, remember that matrix multiplication is reversed! To obtain the global transform for a hierarchy, do:
es: Al utilizar una jerarquía de transformación, recuerda que la multiplicación de matrices se invierte. Para obtener la transformación global para una jerarquía, haz:
fr: Lors de l'utilisation d'une hiérarchie de transformation, n'oubliez pas que la multiplication matricielle est inversée ! Pour obtenir la transformation globale d'une hiérarchie, faites :
ja: 階層変換を使用する場合、行列の乗算が逆になることに注意してください！階層のグローバル変換を取得するには、次を実行します:
ko: 변환 층을 사용할 때 행렬 곱셈이 반전된다는 점을 기억하세요! 층에 대한 전역 변환을 얻으려면 다음을 수행합니다:

source: For 3 levels:
es: Para 3 niveles:
fr: Pour 3 niveaux :
ja: 3つのレベルの場合:
ko: 3단계:

source: To make a matrix relative to the parent, use the affine inverse (or regular inverse for orthonormal matrices).
es: Para hacer una matriz relativa al padre, hay que utilizar el inverso afín (o el inverso regular para matrices ortonormales).
fr: Pour faire une matrice relative au parent, utilisez l'affine inverse (ou l'inverse régulière pour les matrices orthonormales).
ja: 親を基準にして行列を作成するには、アフィン逆行列(または正規直交行列の場合は通常の逆行列)を使用します。
ko: 상위에 상대적인 행렬을 만들려면 항렬 역(또는 직교 행렬의 경우 정규 역)을 사용합니다.

source: Revert it just like the example above:
es: Revertirlo como en el ejemplo anterior:
fr: Revenir en arrière comme dans l'exemple ci-dessus :
ja: 上記の例と同じように元に戻します:
ko: 위의 예와 같이 되돌리시오:

source: OK, hopefully this should be enough! Let's complete the tutorial by moving to 3D matrices.
es: ¡Bien, espero que esto sea suficiente! Vamos a completar el tutorial moviéndonos a matrices 3D.
fr: OK, j'espère que ça suffira ! Terminons le tutoriel en passant aux matrices 3D.
ja: さて、うまくいけばこれで十分でしょう！ 3Dマトリックスに移動してチュートリアルを完了しましょう。
ko: 좋아요, 이 정도면 됐어요! 튜토리얼을 완료하고 3D 행렬로 이동하겠습니다.

source: Matrices & transforms in 3D
es: Matrices y transformaciones en 3D
fr: Matrices et transformations en 3D
ja: 3Dの行列と変換
ko: 3D에서의 행렬과 변환

source: As mentioned before, for 3D, we deal with 3 :ref:`Vector3 <class_Vector3>` vectors for the rotation matrix, and an extra one for the origin.
es: Como se ha mencionado anteriormente, para 3D, tratamos con 3 :ref:`Vector3 <class_Vector3>` vectores para la matriz de rotación, y uno extra para el origen.
fr: Comme mentionné précédemment, pour la 3D, nous travaillons avec 3 vecteurs :ref:`Vector3 <class_Vector3>` pour la matrice de rotation, et un vecteur supplémentaire pour l'origine.
ja: 前に述べたように、3Dの場合、回転行列用に3つの :ref:`Vector3 <class_Vector3>` ベクトルを処理し、原点用に追加のベクトルを処理します。
ko: 앞서 언급한 바와 같이 3D의 경우 :ref:`Vector3 <class_Vector3>` 회전 행렬용 벡터 3개와 원점용 벡터 1개를 추가로 취급합니다.

source: Godot has a special type for a 3x3 matrix, named :ref:`Basis <class_Basis>`. It can be used to represent a 3D rotation and scale. Sub vectors can be accessed as:
fr: Godot a un type spécial pour une matrice 3x3, nommé :ref:`Basis <class_Basis>`. Il peut être utilisé pour représenter une rotation et une échelle 3D. On peut accéder aux sous-vecteurs comme cela :
ja: Godotには、\ :ref:`Basis <class_Basis>` という名前の3x3行列用の特別な型があります。 3Dの回転とスケールを表すために使用できます。サブベクトルには次のようにアクセスできます:

source: Or, alternatively as:
es: O, de forma alternativa, como:
fr: Ou, alternativement comme ceci :
ja: または、次のようにします:
ko: 또는 대신에:

source: The Identity Basis has the following values:
es: La Identidad de Basis tiene los siguientes valores:
fr: La base d'identité a les valeurs suivantes :
ja: 単位基底(基準軸/Basis)には次の値があります:
ko: 항등 기저는 다음과 같은 값을 가집니다:

source: And can be accessed like this:
es: Y se puede acceder así:
fr: Et peut être accédé comme ceci :
ja: そして、次のようにアクセスできます:
ko: 다음과 같이 접근할 수 있습니다:

source: Rotation in 3D
es: Rotación en 3D
fr: Rotation en 3D
ja: 3Dでの回転
ko: 3D에서의 회전

source: Rotation in 3D is more complex than in 2D (translation and scale are the same), because rotation is an implicit 2D operation. To rotate in 3D, an *axis*, must be picked. Rotation, then, happens around this axis.
es: La rotación en 3D es más compleja que en 2D (traslation y scale son iguales), porque la rotación es una operación 2D implícita. Para rotar en 3D, se debe seleccionar un *eje*. La rotación, entonces, ocurre alrededor de este eje.
fr: La rotation en 3D est plus complexe qu'en 2D (translation et échelle sont identiques), car la rotation est une opération 2D implicite. Pour tourner en 3D, un *axe* doit être choisi. La rotation s'effectue donc autour de cet axe.
ja: 3Dの回転は、2Dよりも複雑です(平行移動とスケールは同じです)。3Dで回転するには、\ *軸*\ を選択する必要があります。回転はこの軸の周りに発生します。
ko: 3D에서의 회전은 암시적인 2D 연산이므로 3D 회전은 2D보다 더 복잡합니다(변환 및 배율은 동일). 3D로 회전하려면 *축* 을 선택해야 합니다. 그런 다음 이 축을 중심으로 회전합니다.

source: The axis for the rotation must be a *normal vector*. As in, a vector that can point to any direction, but length must be one (1.0).
es: El eje para la rotación debe ser un *vector normal*. Es decir, un vector que puede apuntar a cualquier dirección, pero la longitud debe ser uno (1.0).
fr: L'axe de rotation doit être un *vecteur normal*. Comme dans, un vecteur qui peut pointer vers n'importe quelle direction, mais la longueur doit être un (1.0).
ja: 回転の軸は\ *正規化ベクトル*\ でなければなりません。なので、任意の方向を指すことができるベクトルですが、長さは1(1.0)でなければなりません。
ko: 회전 축은 *법선 벡터* 이어야 합니다. 임의의 방향을 가리킬 수 있지만 길이는 하나(1.0)여야 합니다.

source: To add the final component to the mix, Godot provides the :ref:`Transform <class_Transform>` type. Transform has two members:
es: Para añadir el componente final a la mezcla, Godot proporciona el tipo :ref:`Transform <class_Transform>`. Transform tiene dos miembros:
fr: Pour ajouter le dernier composant au mix, Godot fournit le type :ref:`Transform <class_Transform>`. Transform comprend deux membres :
ja: ミックスに最後の要素を追加するために、Godotは :ref:`Transform <class_Transform>` タイプを提供します。 Transformには2つのメンバーがあります:
ko: 믹스에 최종 구성요소를 추가하기 위해 고도는 :ref:"Transform <class_Transform> 유형을 제공합니다. Transform에는 두 개의 멤버가 있습니다:

source: *basis* (of type :ref:`Basis <class_Basis>`)
es: *basis* (de tipo :ref:`Basis <class_Basis>`)
fr: *basis* (de type :ref:`Basis <class_Basis>`)
ja: *basis* (タイプ :ref:`Basis <class_Basis>`\ の)
ko: *기저* (of type :ref:`Basis <class_Basis>`)

source: *origin* (of type :ref:`Vector3 <class_Vector3>`)
es: *origin* (de tipo :ref:`Vector3 <class_Vector3>`)
fr: *origin* (de type :ref:`Vector3 <class_Vector3>`)
ja: *origin* (タイプ :ref:`Vector3 <class_Vector3>`\ の)
ko: *원점* (of type :ref:`Vector3 <class_Vector3>`)

source: Any 3D transform can be represented with Transform, and the separation of basis and origin makes it easier to work translation and rotation separately.
es: Cualquier transformación 3D puede ser representada con Transform, y la separación de la base y el origen hace más fácil trabajar el traslado y la rotación por separado.
fr: Toute transformation 3D peut être représentée avec Transform, et la séparation de la base et de l'origine facilite l'utilisation de la translation et de la rotation de façon séparée.
ja: どの3D変換もTransformで表すことができ、基底と原点を分離することで、移動/変形と回転を別々に簡単に行うことができます。
ko: 모든 3D 변환은 Transform(변환)으로 나타낼 수 있으며, 기준 및 원점을 분리하면 변환 및 회전을 개별적으로 더 쉽게 수행할 수 있습니다.

source: An example:
es: Un ejemplo:
fr: Un exemple :
ja: 例:
ko: 예:

source: Scale
es: Escala
