Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/rotations.po
Languages: es

source: This may sound trivial at this point, because we're equipped with all the machinery of Lie groups and Lie algebras: apparently, quaternion units :math:`\{i,j,k\}` are just another representation of the SO(3) generators, which satisfy the Lie bracket. Well, no so fast. While the Lie *algebra* :math:`\mathfrak{so}(3)`, whose elements are the linear combination of :math:`J_i` s are isomorphic to unit quaternions, but quaternions are :math:`1 w + x i + y j + z k` in general, so there's also an identity part, which isn't a vector that is a part of any Lie algebra. Quaternions look more like the *group* SO(3) (when they're normalized, because SO(3) preserves vector norms). But it actually isn't isomorphic to SO(3). It turns out that unit quaternions are isomorphic to the group SU(2) (which is isomorphic to Spin(3)), which in turn is a double cover of SO(3).
es: Esto puede sonar trivial en este punto, porque estamos equipados con toda la maquinaria de los grupos y algebras de Lie: aparentemente, las unidades de cuaterniones :math:`\{i,j,k\}` son sólo otra representación de los generadores de SO(3), que satisfacen el soporte de Lie. Bueno, no tan rápido. Mientras que el *álgebra* de la Lie :math:`\mathfrak{so}(3)`, cuyos elementos son la combinación lineal de :math:`J_i` s son isomórficos a los cuaterniones unitarios, pero los cuaterniones son :math:`1 w + x i + y j + z k` en general, así que también hay una parte de identidad, que no es un vector que es parte de cualquier álgebra de Lie. Las cuartniones se parecen más al *grupo* SO(3) (cuando están normalizados, porque el SO(3) preserva las normas vectoriales). Pero en realidad no es isomorfo al SO(3). Resulta que los cuaterniones unitarios son isomórficos al grupo SU(2) (que es isomórfico a Spin(3)), que a su vez es una doble cobertura de SO(3).

source: SU(2) is essentially the group of unitary rotations with determinant +1 (called Special Unitary groups) which preserve the norm of complex vectors it acts on, generated by `Pauli spin matrices <https://en.wikipedia.org/wiki/Pauli_matrices>`_ :math:`\sigma_i`, and :math:`i,j,k` correspond to :math:`\sigma_x/\imath\ \sigma_y/\imath, \sigma_z/\imath`. To exemplify, :math:`R = e^{\varphi \boldsymbol n \cdot \boldsymbol J} \in \text{SO}(3)` rotates a real vector by :math:`R \boldsymbol v` and the corresponding rotation :math:`U = e^{-\imath\varphi \boldsymbol n \cdot \boldsymbol \sigma/2} \in \text{SU}(2)` rotates the same vector through :math:`U (\boldsymbol v \cdot \boldsymbol \sigma) U^\dagger`. Note that :math:`U \to -U` achieves the same SO(3) rotation, SU(2) it's said to be a double cover of SO(3) (this is mapping gives the adjoint representation of SU(2) by the way). Here :math:`-\imath\boldsymbol \sigma = -\imath (\sigma_x, \sigma_y, \sigma_z) \cong (i,j,k)`.
es: SU(2) es esencialmente el grupo de rotaciones unitarias con determinante +1 (llamados grupos unitarios especiales) que preservan la norma de los vectores complejos sobre los que actúa, generados por `Matrices de Pauli <https://es.wikipedia.org/wiki/Matrices_de_Pauli>`_ :math:`\sigma_i` y :math:`i,j,k`corresponde a :math:`\sigma_x/\imath\ \sigma_y/\imath, \sigma_z/\imath`. Para ejemplificar, :math:`R = e^{\varphi \boldsymbol n \cdot \boldsymbol J} \in \text{SO}(3)` rota un vector real por :math:`R \boldsymbol v` y la rotación correspondiente :math:`U = e^{-\imath\varphi \boldsymbol n \cdot \boldsymbol \sigma/2} \in \text{SU}(2)` rota el mismo vector a través de :math:`U (\boldsymbol v \cdot \boldsymbol \sigma) U^\dagger`. Hay que tener en cuenta que :math:`U \to -U` logra la misma rotación de SO(3), SU(2) se dice que es una cubierta doble de SO(3) (este mapeo da la representación adjunta de SU(2)). Aquí :math:`-\imath\boldsymbol \sigma = -\imath (\sigma_x, \sigma_y, \sigma_z) \cong (i,j,k)`.

source: SU(2) and SO(3) look the same locally (their tangent spaces dictated by their Lie algebras are isomorphic), but they're different globally. While this sounds like just a technicality, this has topological implications, but we won't get into that much. The take away from this discussion is that unit quaternions *can* be used emulate SO(3) rotations.
es: SU(2) y SO(3) se ven iguales localmente (sus espacios tangenciales dictados por sus algebras de Lie son isomórficos), pero son diferentes globalmente. Aunque esto suena como un tecnicismo, tiene implicaciones topológicas, pero no vamos a entrar en detalles. La ventaja de esta discusión es que los cuaterniones de la unidad *pueden* utilizarse para emular las rotaciones SO(3).

source: But taking a step back, why do we bother *emulating* SO(3) at all? For computational purposes, we already have something that works: the matrix representation. Why do we need to both with a weird group that isn't even exactly the same as SO(3)?
es: Pero dando un paso atrás, ¿por qué nos molestamos en *emular* SO(3)? Para fines computacionales, ya tenemos algo que funciona: la representación matricial. ¿Por qué necesitamos ambos con un grupo raro que ni siquiera es exactamente lo mismo que SO(3)?

source: The answer is the cost of computation, and this is two fold. First, you see, a rotation operator has only 3 degrees of freedom: two for the unit vector which is the rotation axis, and one for the rotation angle around that axis. A :math:`3\times 3` matrix, on the other hand has 9 elements. It's an overkill. For example, whenever you multiply two rotations, you need to multiply two :math:`3\times 3` matrices, summing and multiplying every single element. In terms of CPU cycles, this is wasted effort and we can be more optimal. Second part is precision errors. The errors are worse in matrix representation, because originally, we have only 3 degrees of freedom, which means we can have precision errors in axis and angle (only 3 errors) but it's still an element of SO(3), whereas with matrices, we can have errors in any one of the 9 elements in the matrix and so we can even have a matrix that isn't even an element of SO(3). These errors can quickly build up quickly especially if you're for example modifying the orientation of an object every frame by doing a smooth interpolation between an initial and a target orientation (discussed further in SLERP section).
es: La respuesta es el costo de la computación, y esto es doble. Primero, un operador de rotación tiene sólo 3 grados de libertad: dos para el vector unitario que es el eje de rotación, y uno para el ángulo de rotación alrededor de ese eje. Una :math:`3\times 3`, por otro lado tiene 9 elementos. Es una exageración. Por ejemplo, siempre que multipliques dos rotaciones, necesitas multiplicar dos matrices :math:`3\times 3`, sumando y multiplicando cada elemento. En términos de ciclos de CPU, esto es un esfuerzo desperdiciado y podemos ser más óptimos. La segunda parte son los errores de precisión. Los errores son peores en la representación matricial, porque originalmente, sólo tenemos 3 grados de libertad, lo que significa que podemos tener errores de precisión en el eje y el ángulo (sólo 3 errores), pero sigue siendo un elemento de SO(3), mientras que con las matrices, podemos tener errores en cualquiera de los 9 elementos de la matriz y así incluso podemos tener una matriz que ni siquiera es un elemento de SO(3). Estos errores pueden acumularse rápidamente, especialmente si, por ejemplo, está modificando la orientación de un objeto en cada fotograma haciendo una interpolación suave entre una orientación inicial y una orientación objetivo (discutida más adelante en la sección SLERP).

source: Sure, we know that elements of SO(3) can be represented by using orthogonal matrices with determinant +1 (hence the name Special Orthogonal) such that :math:`R R^T = I`; in plain language, this means the columns of :math:`R` form an orthonormal set of vectors, so we can eliminate the errors if we perform `Gram-Schmidt <https://en.wikipedia.org/wiki/Gram%E2%80%93Schmidt_process>`_ orthonormalization once in a while, and force it back into SO(3), such that it's an actual rotation matrix (albeit still noisy in axis and angle). But this is expensive and still quite bad in terms of errors.
es: Claro, sabemos que los elementos de SO(3) pueden ser representados usando matrices ortogonales con determinante +1 (de ahí el nombre Ortogonal Especial) de tal manera que :math:`R R^T = I`; en lenguaje sencillo, esto significa que las columnas de :math:`R` forman un conjunto ortonormal de vectores, por lo que podemos eliminar los errores si realizamos `Gram-Schmidt <https://es.wikipedia.org/wiki/Proceso_de_ortogonalizaci%C3%B3n_de_Gram-Schmidt>`_ orthonormalization de vez en cuando, y forzarlo a volver a SO(3), de tal forma que sea una matriz de rotación real (aunque todavía muy ruidosa en el eje y el ángulo). Pero esto es costoso y bastante malo en términos de posibles errores.

source: So, what is the alternative then? Shall we go back to the Rodrigues' formula and hardcode the behavior of :math:`J_i` into our program? A nicer alternative is, we use SU(2) (which we know covers SO(3), twice in fact!), because the equivalent of the Rodrigues' formula is much simpler:
es: Entonces, ¿cuál es la alternativa? ¿Volvemos a la fórmula de Rodrigues y codificamos el comportamiento de :math:`J_i` en nuestro programa? Una alternativa más agradable es, utilizar SU(2) (que sabemos cubre SO(3), ¡dos veces de hecho!), porque el equivalente de la fórmula de Rodrigues es mucho más simple:

source: owing to the nice relation :math:`(\boldsymbol n \cdot \boldsymbol \sigma)^2 = I` (something like this happens only at the third power with SO(3) generators, remember? and it doesn't give identity), or if you prefer quaternion version which is more commonly used to represent the isomorphic group Spin(3), this is
es: gracias a la buena relación :math:`(\boldsymbol n \cdot \boldsymbol \sigma)^2 = I` (algo así ocurre sólo en la tercera potencia con generadores SO(3), ¿recuerdas? y no nos da la identidad), o si prefieres la versión de cuaternión que se usa más comúnmente para representar al grupo isomórfico Spin(3), ésta es

source: In game engines, rather than storing the axis-angle :math:`(\boldsymbol n(\phi,\theta), \varphi )` pair where :math:`\phi,\theta` are the azimuthal and polar angles parametrizing the unit vector :math:`\boldsymbol n`, people typically store :math:`\boldsymbol q= (q_0, q_x, q_y, q_z) \equiv (\cos\frac{\varphi}{2}, \sin\frac{\varphi}{2} n_x, \sin\frac{\varphi}{2} n_y, \sin\frac{\varphi}{2} n_z)` such that :math:`U = \boldsymbol q \cdot (1, i, j, k)`, and enforce the condition :math:`|\boldsymbol q|=1` once in a while by renormalization (note that while you can see many people referring to :math:`\boldsymbol q` as a quaternion, it's not; :math:`U` is the actual quaternion here and :math:`\boldsymbol q` is just an artificial vector containing the coefficients in the expansion of the exponential map). Of course, if they store :math:`(\varphi, \phi, \theta)`, there is no need for a renormalization because such parametrization guarantees the normalization, but this choice would come at the cost of calculating a bunch of sines and cosines whenever you use them, so this is a middle ground in terms of errors and speed.
es: En los motores de juego, en lugar de almacenar el ángulo del eje :math:`(\boldsymbol n(\phi,\theta), \varphi )`par donde :math:`\phi,\theta`son los ángulos acimut y polar que parametrizan el vector unitario :math:`\boldsymbol n`, la gente normalmente almacena :math:`\boldsymbol q= (q_0, q_x, q_y, q_z) \equiv (\cos\frac{\varphi}{2}, \sin\frac{\varphi}{2} n_x, \sin\frac{\varphi}{2} n_y, \sin\frac{\varphi}{2} n_z)` such that :math:`U = \boldsymbol q \cdot (1, i, j, k), para hacer cumplir la condición :math:`|\boldsymbol q|=1` de vez en cuando por renormalización (nota que si bien puedes ver a muchas personas refiriéndose a :math:`\boldsymbol q` como un cuaternión, no lo es; :math:`U` es el cuaternión real aquí y :math:`\boldsymbol q` es sólo un vector artificial que contiene los coeficientes en la expansión del mapa exponencial). Por supuesto, si almacenan :math:`(\varphi, \phi, \theta)`, no hay necesidad de una renormalización porque tal parametrización garantiza la normalización, pero esta elección vendría a costa de calcular un montón de senos y cosenos cada vez que se utilizan, por lo que este es un término medio en términos de errores y velocidad.

source: So, the take aways of this section are:
es: Así que, las ventajas de esta sección son:

source: Matrices can represent SO(3) just fine, but are a little too general and extravagant in terms of CPU cycles and behave bad in the presence of floating point errors, and errors can even lead to a matrix that doesn't correspond to a rotation matrix at all!
es: Las matrices pueden representar SO(3) muy bien, pero son demasiado generales y extravagantes en términos de ciclos de CPU y se comportan mal en presencia de errores de coma flotante ¡y los errores pueden incluso llevar a una matriz que no corresponde en absoluto a una matriz de rotación!

source: For all practical purposes, we can use an element of SU(2) to represent an SO(3) rotation. It's a double cover of SO(3), so we wouldn't be losing anything in doing so. The main reason for choosing one over another is the SO(3) Rodrigues' formula is a little nasty to work with whereas SU(2) expansion is neat, clean and simple to work with.
es: A todos los efectos prácticos, podemos utilizar un elemento de SU(2) para representar una rotación SO(3). Es una doble cobertura de SO(3), así que no estaríamos perdiendo nada al hacerlo. La razón principal para elegir uno sobre el otro es que la fórmula de Rodrigues SO(3) es un poco incómoda para trabajar, mientras que la expansión de SU(2) es clara, limpia y fácil de utilizar.

source: Using matrices, you can practically do everything you do with quaternions, vice versa. The real differences, as highlighted, are in computation trade-offs, not mathematics.
es: Usando matrices, prácticamente se puede hacer todo lo que se hace con los cuaterniones, y viceversa. Las diferencias reales, como se ha destacado, están en las compensaciones de cálculo, no en las matemáticas.

source: The relationship between quaternions and 3D rotation matrices is the roughly the same as the relation between the complex number :math:`e^{\imath\theta}` and a 2D rotation matrix. Just as the complex number :math:`\imath \cong J_z` rotates by :math:`\pi/2` (which is, as we saw, what a *generator* does), :math:`i,j,k` (which are :math:`\cong J_x, J_y, J_z`) rotate by :math:`\pi/2` around :math:`x, y, z` axes; they don't commute with each other because in 3D, the order of rotations is important. Owing to this isomorphism between their generators, an SO(3) rotation :math:`e^{\varphi \boldsymbol n \cdot \boldsymbol J}` corresponds to the SU(2) rotation :math:`e^{\varphi \boldsymbol n \cdot (i,j,k)/2}`. This is a helpful picture to gain an intuition on quaternions. While the SO(3) is familiar to many people, the "Rodrigues' formula" for the SU(2) one is much preferable graphics programming due to it's simplicity, and hence you see quaternions in game engines.
es: La relación entre los cuaterniones y las matrices de rotación 3D es aproximadamente la misma que la relación entre el número complejo :math:`e^{\imath\theta}` y una matriz de rotación 2D. Así como el complejo número :math:`\imath \cong J_z` rota por :math:`\pi/2` (que es, como vimos, lo que hace un *generador*), :math:`i,j,k` (que son :math:`\cong J_x, J_y, J_z`) rotar por :math:`\pi/2` alrededor de los ejes :math:`x, y, z`; no se conmutan entre sí porque en 3D, el orden de las rotaciones es importante. Debido a este isomorfismo entre sus generadores, una rotación SO(3) :math:`e^{\varphi \boldsymbol n \cdot \boldsymbol J}` corresponde a la rotación SU(2) :math:`e^{\varphi \boldsymbol n \cdot (i,j,k)/2}`. Esta es una imagen útil para tener una idea sobre los cuaterniones. Mientras que el SO(3) es familiar para mucha gente, la "fórmula de Rodrigues" para el SU(2) es mucho más recomendable para la programación de gráficos debido a su simplicidad, y por lo tanto se ven cuaterniones en los motores de juego.

source: This doesn't mean quaternions are a generalization of complex numbers in our construction when considering rotations in a strict sense; they're rather the 3D generalization of the 2D rotation generator in some loose sense (loose, because SO(3) and SU(2) are different groups). There *is* a construction which generalizes real numbers to complex numbers to quaternions, called `Cayley-Dickson construction <https://en.wikipedia.org/wiki/Cayley%E2%80%93Dickson_construction>`_, but it's next steps give off topic objects octonions and sedenions (setting exceptional Lie groups aside for octonions).
es: Esto no significa que los cuaterniones son una generalización de números complejos en nuestra construcción cuando consideramos las rotaciones en un sentido estricto; son más bien la generalización 3D del generador de rotación 2D en un sentido suelto (suelto, porque SO(3) y SU(2) son grupos diferentes). Hay una construcción que generaliza números reales a números complejos a cuaterniones, llamada `Construcción de Cayley-Dickson <https://es.wikipedia.org/wiki/Construcci%C3%B3n_de_Cayley-Dickson>`_, pero son los siguientes pasos los que producen los objetos tópicos octiones y sedeniones (reservando grupos de Lie excepcionales para octoniones).

source: Note that we haven't said a word about Euler angles. In both matrix and quaternion *representations*, we sticked to the axis-angle *parametrization*. We will discuss different parametrizations in what follows.
es: Nota que no hemos dicho una sola palabra sobre los ángulos de Euler. Tanto en las *representaciones* de la matriz como en las de los cuaterniones, nos ceñimos a la *parametrización* del ángulo del eje. Analizaremos diferentes parametrizaciones más adelante.

source: Matrix representation of SO(3)
es: Representación de la matriz de SO(3)

source: Quaternion representation of SU(2)
es: Representación por cuaterniones de SU(2)

source: Matrices for :math:`J_x, J_y, J_z \cong \boldsymbol e_x \times, \boldsymbol e_y \times, \boldsymbol e_z \times`
es: Matrices para :math:`J_x, J_y, J_z \cong \boldsymbol e_x \times, \boldsymbol e_y \times, \boldsymbol e_z \times`

source: :math:`e^{\varphi \boldsymbol n \cdot \boldsymbol J}`, can expand with Rodrigues' formula
es: :math:`e^{\varphi \boldsymbol n \cdot \boldsymbol J}`, puede expandirse con la fórmula de Rodrigues

source: :math:`e^{\varphi \boldsymbol n \cdot (i,j,k)/2}` can expand with SU(2) "Rodrigues' formula"
es: :math:`e^{\varphi \boldsymbol n \cdot (i,j,k)/2}` puede expandirse con la fórmula de Rodrigues SU(2)

source: Above, :math:`r,\theta,\phi` are spherical coordinates corresponding to :math:`x,y,z`.
es: En el ejemplo anterior, :math:`r,\theta,\phi` son coordenadas esféricas correspondientes a :math:`x,y,z`.

source: A note about the SU(2) vector
es: Una nota sobre el vector SU(2)

source: We earlier mentioned that rotation of a real vector in SU(2) is done via :math:`(R \boldsymbol v) \cdot \boldsymbol \sigma = U (\boldsymbol v \cdot \boldsymbol \sigma) U^\dagger`, and you may be wondering what the complex vector listed above :math:`|\psi\rangle = (\cos\frac{\theta}{2}, e^{\imath \phi} \sin\frac{\theta}{2})` has to do with that. The answer is, there vector :math:`|\psi\rangle` is the one a single :math:`U` acts on, and in terms of it, we can rewrite :math:`U (\boldsymbol v \cdot \boldsymbol \sigma) U^\dagger` as :math:`r U (|\psi\rangle \otimes \langle \psi|) U^\dagger` up to some trivial identity term, where :math:`\langle \psi| = |\psi\rangle^\dagger` (this is the way complex vectors are typically denoted in quantum mechanics and is called `bra-ket notation <https://en.wikipedia.org/wiki/Bra%E2%80%93ket_notation>`_: bra is like the vector and ket is the `conjugate transpose <https://en.wikipedia.org/wiki/Hermitian_adjoint>`_, and people typically omit the :math:`\otimes` in between because that's already implied when you multiply a ket with a bra, and likewise there is no :math:`\cdot` when you multiply a bra with ket since that's also implied).
es: Anteriormente mencionamos que la rotación de un vector real en SU(2) se realiza a través de :math:`(R \boldsymbol v) \cdot \boldsymbol \sigma = U (\boldsymbol v \cdot \boldsymbol \sigma) U^\dagger`, y puede que te estés preguntando qué tiene que ver el vector complejo :math:`|\psi\rangle = (\cos\frac{\theta}{2}, e^{\imath \phi} \sin\frac{\theta}{2})` mencionado anteriormente con esto. La respuesta es, que hay un vector :math:`|\psi\rangle` is the one a single :math:`U` que actúa, y en términos de esto, podemos reescribir :math:`U (\boldsymbol v \cdot \boldsymbol \sigma) U^\dagger` como :math:`r U (|\psi\rangle \otimes \langle \psi|) U^\dagger` hasta algún término de identidad trivial, donde :math:`\langle \psi| = |\psi\rangle^\dagger` (esta es la forma en que los vectores complejos son típicamente denotados en la mecánica cuántica y se llama `Notación bra-ket <https://es.wikipedia.org/wiki/Notaci%C3%B3n_bra-ket>`_: el bra es como el vector y el ket es el `operador adjunto <https://es.wikipedia.org/wiki/Operador_adjunto>`_, y la gente típicamente omite el :math:`\otimes` entremedio porque eso ya está implícito cuando multiplicas un ket por un bra, y de la misma manera no hay :math:`\cdot` cuando multiplicas un bra por un ket ya que eso también está implícito).

source: So, notational concerns aside, long story short, the vector listed above is in a generalized sense "half" of what we are rotating:
es: Por lo tanto, dejando a un lado las preocupaciones notacionales, resumiendo, el vector mencionado anteriormente es, en un sentido generalizado, "la mitad" de lo que estamos rotando:

source: and each "half" goes to one of the :math:`U` s on each side of the modified/generalized relation
es: y cada "mitad" va a una de las :math:`U` s a cada lado de la relación modificada/generalizada

source: so everything is compatible, and :math:`|\psi'\rangle = U |\psi(\boldsymbol v)\rangle = |\psi(R \boldsymbol v)\rangle` is satisfied. This parametrization of an SU(2) vector is typically done in spherical coordinates :math:`\theta,\phi` (for :math:`r=1`, because state vectors are normalized in quantum mechanics), and the sphere is called `Bloch sphere <https://en.wikipedia.org/wiki/Bloch_sphere>`_).
es: así que todo es compatible, y :math:`|\psi'\rangle = U |\psi(\boldsymbol v)\rangle = |\psi(R \boldsymbol v)\rangle` es satisfactorio. Esta parametrización de un vector SU(2) se hace típicamente en coordenadas esféricas :math:`\theta,\phi` (para :math:`r=1`, porque los vectores de estado están normalizados en la mecánica cuántica), y la esfera se llama `Esfera de Bloch <https://es.wikipedia.org/wiki/Esfera_de_Bloch>`_).

source: Parametrization of rotations
es: Parametrización de rotaciones

source: From general arguments of linear independence, it is clear that a general rotation in 3D requires 3 independent parameters, which is known as `Euler's rotation theorem <https://en.wikipedia.org/wiki/Euler's_rotation_theorem>`_. It is tempting to think rotations as three-dimensional vectors, but they are rather `linear operators <https://en.wikipedia.org/wiki/Linear_map>`_ that transform vectors.
es: A partir de argumentos generales de independencia lineal, está claro que una rotación general en 3D requiere 3 parámetros independientes, lo que se conoce como `Teorema de rotación de Euler <https://es.wikipedia.org/wiki/Teorema_de_rotaci%C3%B3n_de_Euler`_. Es tentador pensar que las rotaciones son vectores tridimensionales, pero son más bien `aplicaciones lineales <https://es.wikipedia.org/wiki/Aplicaci%C3%B3n_lineal>`_ que transforman los vectores.
