Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/rotations.po
Languages: es

source: There are `different ways of parametrizing rotations <https://en.wikipedia.org/wiki/Charts_on_SO(3)#Parametrizations>`_ in the `3D Euclidean space <https://en.wikipedia.org/wiki/Euclidean_space>`_ using 3 parameters, and we will go through the two commonly used in game programming.
es: Hay `diferentes formas de parametrizar rotaciones <https://en.wikipedia.org/wiki/Charts_on_SO(3)#Parametrizations>`_ en el `espacio euclídeo 3D <https://es.wikipedia.org/wiki/Espacio_eucl%C3%ADdeo>`_ usando 3 parámetros, y pasaremos por los dos más comunes en la programación de juegos.

source: Axis-angle parametrization: :math:`(\phi, \theta, \varphi)`
es: Parametrización del eje-ángulo: :math:`(\phi, \theta, \varphi)`

source: As we found out, this is the *de facto* parametrization of rotations in 3D (or in fact, in any dimensions), which is also the direct generalization of rotations in 2D, is this: choose an axis in 3D space (a unit vector to specify a direction, which has two independent parameters, because its length is conventionally fixed to 1) and is typically parametrized using `polar and azimuthal angles <https://en.wikipedia.org/wiki/Spherical_coordinate_system>`_ as :math:`\boldsymbol n(\phi,\theta) = (\sin\theta \cos\phi, \sin\theta \sin\phi,\cos\theta)` and specify the angle of rotation around that axis :math:`\varphi` (which is the third parameter) whose sense of rotation is fixed by the `right-hand rule <https://en.wikipedia.org/wiki/Right-hand_rule>`_ (for a right-hand coordinate system). For (embedded) 2D rotations in the :math:`xy`-plane, the rotation axis is taken to be the z-axis, and we only need to specify the rotation angle. In 3D, the rotation axis can be pointing toward any direction (since the axis is a unit vector, you can think of it as a point on the unit sphere, if you like). This way of parametrizing rotations is called axis-angle parametrization, and is the easiest to picture intuitively.
es: Como hemos descubierto, se trata *de la* parametrización de las rotaciones en 3D (o de hecho, en cualquier dimensión), que es también la generalización directa de las rotaciones en 2D, es esto: elegir un eje en el espacio 3D (un vector unitario para especificar una dirección, que tiene dos parámetros independientes, ya que su longitud se fija convencionalmente a 1) y es típicamente parametrizada utilizando `polar and azimuthal angles <https://en.wikipedia.org/wiki/Spherical_coordinate_system>`_ como :math:`\boldsymbol n(\phi,\theta) = (\sin\theta \cos\phi, \sin\theta \sin\phi,\cos\theta)` y especificar el ángulo de rotación alrededor de ese eje :math:`\varphi` (que es el tercer parámetro) cuyo sentido de rotación está fijado por la `regla de la mano derecha <https://es.wikipedia.org/wiki/Regla_de_la_mano_derecha>`_ (para un sistema de coordenadas a la derecha). Para rotaciones 2D (incrustadas) en el plano :math:`xy`, el eje de rotación se toma como el eje z, y sólo necesitamos especificar el ángulo de rotación. En 3D, el eje de rotación puede estar apuntando hacia cualquier dirección (ya que el eje es un vector unitario, puedes pensar en él como un punto en la esfera unitaria, si quieres). Esta forma de parametrizar las rotaciones se llama parametrización eje-ángulo, y es la más fácil de visualizar de forma intuitiva.

source: Another advantage of the axis angle parametrization is, it is easy to interpolate between two different rotations (let's call their parameters :math:`\boldsymbol n_1, \varphi_1` and :math:`\boldsymbol n_2, \varphi_2`), which is useful when you're changing the orientation of an object, starting from a given initial orientation and going toward a final one. A nice way of doing this is described in a later section where we describe SLERP. It results in a smooth motion, rather than a "jerky" motion which may start fast, go slow in the middle and go fast again etc. It turns out that if a mass is transported this way, it experiences the least amount of torque (compared to other possible trajectories). This way of linearly interpolating rotations in the axis-angle parametrization is called Spherical Linear Interpolation or SLERP, and is almost ubiquitously used in games.
es: Otra ventaja de la parametrización del ángulo del eje es que es fácil interpolar entre dos rotaciones diferentes (llamemos a sus parámetros :math:`\boldsymbol n_1, \varphi_1` y :math:`\boldsymbol n_2, \varphi_2`), lo cual es útil cuando se está cambiando la orientación de un objeto, comenzando desde una orientación inicial dada y yendo hacia una final. Una buena manera de hacer esto se describe en una sección posterior donde describimos SLERP. El resultado es un movimiento suave, en lugar de un movimiento "brusco" que puede empezar rápido, ir lento en el medio y volver a ir rápido, etc. Resulta que si una masa se transporta de esta manera, experimenta la menor cantidad de torsión (en comparación con otras trayectorias posibles). Esta forma de interpolar linealmente las rotaciones en la parametrización eje-ángulo se llama Interpolación Lineal Esférica o SLERP, y es casi omnipresente en los juegos.

source: Euler angles (and Tait-Bryan angles): :math:`(\varphi_1, \varphi_2, \varphi_3 )`
es: Ángulos de Euler (y ángulos Tait-Bryan): :math:`(\varphi_1, \varphi_2, \varphi_3 )`

source: Another way of parametrizing 3D rotations is by considering a sequence of at least 3 rotations around certain, fixed axes. This could be, for example "rotate around the :math:`Z`-axis by :math:`\varphi_1`, then rotate around the :math:`Y`-axis by :math:`\varphi_2`, and finally rotate around the :math:`x`-axis by :math:`\varphi_3`". Of course, these axes don't have to be Z, then Y, then X. As long as two sequential rotations are not around the same axis (in which case they would combine into a single rotation, hence reducing the number of actually independent parameters by 1), they can be anything. They don't even need to be aligned with any "named" axis. Another thing important think to watch out is, if you imagine that there is a local coordinate system "painted" on the object, as you go through the 3-step rotation sequence, that local frame rotates with the object itself, while the global frame of course remains as-is. The rotation angles specified with respect to a global, fixed reference frame are sometimes called Tait-Bryan angles. So when we're specifying a general rotation in terms of 3 rotations around certain "fixed" axes, you need to specify whether those axes refer to the global (called extrinsic, usually written with an additional prime, :math:`X'` rather than :math:`X`, after each rotation ) or the local (called intrinsic) frame as well. Typically, extrinsic is used as it is relatively easier to picture, and axes are chosen to coincide with X,Y or Z. The 3 rotation angles used in such representation of rotations is called Euler angles.
es: Otra forma de parametrizar rotaciones 3D es considerando una secuencia de al menos 3 rotaciones alrededor de ciertos ejes fijos. Esto podría ser, por ejemplo, "rotar alrededor del eje :math:`Z por `math:``varphi_1`, luego rotar alrededor del eje ``Y`` por `math:``varphi_2``, y finalmente rotar alrededor del eje :math:`x` por ``math:`\varphi_3``". Por supuesto, estos ejes no tienen que ser Z, luego Y, luego X. Mientras dos rotaciones secuenciales no estén alrededor del mismo eje (en cuyo caso se combinarían en una sola rotación, reduciendo así el número de parámetros realmente independientes en 1), pueden ser cualquier cosa. Ni siquiera necesitan estar alineados con ningún eje "nominal". Otra cosa importante que hay que tener en cuenta es, si se imagina que hay un sistema de coordenadas local "pintado" en el objeto, a medida que pasa por la secuencia de rotación de 3 pasos, que el marco local gira con el objeto en sí, mientras que el marco global, por supuesto, permanece como está. Los ángulos de rotación especificados con respecto a un marco de referencia global y fijo se denominan a veces ángulos de Tait-Bryan. Así que cuando estamos especificando una rotación general en términos de 3 rotaciones alrededor de ciertos ejes "fijos", necesitamos especificar si esos ejes se refieren al global (llamado extrínseco, usualmente escrito con un primo adicional, :math:`X'` en lugar de :math:`X`, después de cada rotación) o también al marco local (llamado intrínseco). Típicamente, se utiliza extrínseco, ya que es más fácil de visualizar, y los ejes se eligen para que coincidan con X, Y o Z. Los 3 ángulos de rotación utilizados en esta representación de las rotaciones se llaman ángulos de Euler.

source: Ancient mechanical devices called gimbal (which are long obsolete in this age) used to calculate realize 3D rotations in engineering applications in vehicles increased the popularity of Euler angles. Furthermore, since the :math:`3 \times 3` rotation matrix around X,Y or Z axis is easier to write down, it is commonly said that Euler angles are easier to understand when compared to axis-angle representation (which is commonly, although not necessarily, implemented through quaternions). While this may be true if you're creating a linear algebra library from scratch, or filling in the elements of the transformation matrix on your own, this is not the case when writing games with game engines, such as Godot. The popularity of Euler angles endured despite the fact that they, in fact, can not represent a smooth transition between two different rotations by a smooth variation of the three angles. The reason behind this lies in the fact that Euler angles describe a chart on 3-torus, which is not a `covering map <https://en.wikipedia.org/wiki/Covering_space>`_ of SO(3), three dimensional rotations (if this sounds too abstract, see the subsection about 3-torus and sphere below). As the mapping from Euler angles to SO(3) is ill-defined at certain points, during the smooth interpolation between two rotations, we may bump into such points, and as a result the rank may drop to 2 or even 1 (which mechanically corresponds to a situation in which two or three gimbals become aligned as they go around), which is known as the `gimbal-lock <https://en.wikipedia.org/wiki/Gimbal_lock>`_ problem. Thus, while it's OK to use Euler angles to represent a fixed rotation, they're not suitable for slowly changing the orientation of objects. You can still do that if you put some additional effort to avoid gimbal-lock, of course, but even if by some luck you don't bump into such bad points, a linear interpolation between two sets of Euler angles is going to result in a "jerky" motion.
es: Antiguos dispositivos mecánicos llamados cardanes (que son obsoletos desde hace mucho tiempo en esta era) utilizados para calcular las rotaciones 3D en aplicaciones de ingeniería en vehículos aumentaron la popularidad de los ángulos de Euler. Además, dado que la matriz de rotación de :math:`3 \times 3` alrededor del eje X,Y o Z es más fácil de escribir, comúnmente se dice que los ángulos de Euler son más fáciles de entender cuando se comparan con la representación eje-ángulo (la cual es normalmente, aunque no necesariamente, implementada a través de cuaterniones). Si bien esto puede ser cierto si está creando una biblioteca de álgebra lineal desde cero, o si está rellenando los elementos de la matriz de transformación por su cuenta, este no es el caso cuando escribe juegos con motores de juego, como Godot. La popularidad de los ángulos de Euler perduró a pesar de que, de hecho, no pueden representar una transición suave entre dos rotaciones diferentes por una variación suave de los tres ángulos. La razón de esto radica en el hecho de que los ángulos de Euler describen una gráfica en 3-toroides, que no es un `espacio recubridor <https://es.wikipedia.org/wiki/Espacio_recubridor>`_ de las rotaciones tridimensionales de SO(3), (si esto suena demasiado abstracto, ver la subsección sobre 3-toroides y esfera abajo). Como el mapeo de los ángulos de Euler a SO(3) está mal definido en ciertos puntos, durante la interpolación suave entre dos rotaciones, podemos toparnos con tales puntos, y como resultado el rango puede caer a 2 o incluso 1 (lo que mecánicamente corresponde a una situación en la que dos o tres balancines se alinean a medida que giran), lo que se conoce como el problema `bloqueo del cardán <https://es.wikipedia.org/wiki/Bloqueo_del_card%C3%A1n`_. Por lo tanto, aunque está bien utilizar los ángulos de Euler para representar una rotación fija, no son adecuados para cambiar lentamente la orientación de los objetos. Todavía se puede hacer eso si se hace un esfuerzo adicional para evitar el bloqueo del cardán, por supuesto, pero incluso si con un poco de suerte no se tropieza con tales puntos malos, una interpolación lineal entre dos conjuntos de ángulos de Euler va a resultar en un movimiento "brusco".

source: All in all, despite being an ill-defined parametrization for rotations, Euler angles enjoyed a popularity due to gimbals.
es: En definitiva, a pesar de ser una parametrización mal definida para las rotaciones, los ángulos de Euler gozaron de una popularidad debido a la suspensión cardán.

source: While Euler angles may not be too useful when calculating the rotation operator (be it a matrix or a quaternion) in body dynamics, people still find them useful to think about and describe the *orientation* of 3D objects starting from the initial default *"unrotated"* state (it's difficult to calculate the 3 Euler angles for driving an object from a non-trivial initial orientation to a non-trivial final orientation ---it can't be calculated intuitively in general, it is a task for computers). For this reason, Godot's property editor uses Euler angles (in extrinsic YXZ convention; if the node has a parent node, the YXZ axes refer to the local axes of the parent) for the rotation property of a Transform --this is pretty much the only place Euler angles are used in Godot.
es: Mientras que los ángulos de Euler pueden no ser demasiado útiles cuando se calcula el operador de rotación (ya sea una matriz o un cuaternio) en la dinámica corporal, la gente todavía los encuentra útiles para pensar y describir la *orientación* de los objetos 3D a partir del estado por defecto inicial *"no girado "* (es difícil calcular los 3 ángulos de Euler para conducir un objeto desde una orientación inicial no trivial a una orientación final no trivial; no se puede calcular intuitivamente en general, es una tarea para las computadoras). Por esta razón, el editor de propiedades de Godot utiliza los ángulos de Euler (en la convención extrínseca YXZ; si el nodo tiene un nodo padre, los ejes YXZ se refieren a los ejes locales del padre) para la propiedad de rotación de un Transform; éste es prácticamente el único lugar donde los ángulos de Euler se usan en Godot.

source: So the answer to the question "should I use Euler angles or axis-angle parametrization in my game" is: unless you're trying to *statically* orient an object in a particular way starting from an *unrotated, default orientation* (for which you can still use axis-angle parametrization in your script, if you prefer), you shouldn't be using Euler angles. Major reasons are:
es: Así que la respuesta a la pregunta "¿debería usar los ángulos de Euler o la parametrización de ángulo de eje en mi juego?" es: a menos que estés intentando *estáticamente* orientar un objeto de una manera particular empezando desde una *orientación no girada, por defecto* (para lo cual puedes usar la parametrización de ángulo de eje en tu script, si lo prefieres), no deberías usar los ángulos de Euler. Las razones principales son:

source: Jerky interpolations. You can't interpolate two orientations smoothly (torque-free) in a way that is reference independent (which doesn't depend on how you choose the 3 fixed rotation axes).
es: Interpolaciones bruscas. No es posible interpolar dos orientaciones suavemente (sin torsión) de forma independiente de la referencia (lo que no depende de cómo se seleccionen los 3 ejes de rotación fijos).

source: Gimbal lock. Rotation dynamics (which includes interpolations) can get worse than jerky, you can get stuck in a weird coordinate singularity (the kind which doesn't exist in axis-angle parametrization) and never reach your target.
es: Bloqueo del cardán. La dinámica de rotación (que incluye interpolaciones) puede ser peor que un movimiento brusco; puedes quedarte atrapado en una singularidad de coordenadas extraña (del tipo que no existe en la parametrización eje-ángulo) y nunca alcanzar tu objetivo.

source: A note about surface of 3-torus and sphere, and Gimbal lock
es: Una nota sobre la superficie de 3-toroides y esfera, y el bloqueo del Cardán

source: What is a 3-torus, to begin with? The surface of a donut is a 2-torus, referring to the fact that the surface itself is two-dimensional (although curved), which is easy to visualize. However, it's difficult to visualize a torus in higher dimensions. But as it turns out, there is another way of thinking about torus, which generalizes to higher dimensions.
es: Para empezar, ¿qué significa 3-toroides? La superficie de una rosquilla es de 2-toroides, refiriéndose al hecho de que la superficie en sí es bidimensional (aunque curvada), lo cual es fácil de visualizar. Sin embargo, es difícil visualizar un toroide en dimensiones más altas. Pero resulta que hay otra forma de pensar sobre el toroides, que se generaliza a dimensiones superiores.

source: Imagine an ant walking on the surface of a donut illustrated below (image borrowed from `here <https://en.wikipedia.org/wiki/Torus#/media/File:Toroidal_coord.png>`_).
es: Imagina una hormiga caminando sobre la superficie de la rosquilla que se muestra a continuación (imagen tomada de `aquí <https://en.wikipedia.org/wiki/Torus#/media/File:Toroidal_coord.png>`_).

source: If it keeps walking along either the red or the blue lines, it will eventually come back to where it started. At any time, we can use two angles to describe where the ant is: one angle (:math:`\theta` which goes between :math:`0` and :math:`2\pi`) describing it's position along the red line, and another one (:math:`\phi`, again between :math:`0` and :math:`2\pi`) for the blue line. And note that we have periodicity: :math:`(\theta,\phi)` and :math:`(\theta + 2\pi N,\phi + 2\pi N)` describe exactly the same point on the donut for an integer :math:`N`. We have two angles, of course, because we're talking about a two-dimensional surface. Now we're ready to talk about :math:`n`-dimensional surfaces.
es: Si continúa caminando a lo largo de las líneas rojas o azules, eventualmente regresará a donde comenzó. En cualquier momento, podemos usar dos ángulos para describir dónde está la hormiga: uno (:math:`\theta` que va entre :math:`0` y :math:`2\pi`) describiendo su posición a lo largo de la línea roja, y otro (:math:`\phi`, otra vez entre :math:`0` y :math:`2\pi`) para la línea azul. Y ten en cuenta que tenemos periodicidad: :math:`(\theta,\phi)` y :math:`(\theta + 2\pi N,\phi + 2\pi N)` describen exactamente el mismo punto en la rosquilla para un entero `mateh:`N`. Tenemos dos ángulos, por supuesto, porque estamos hablando de una superficie bidimensional. Ahora estamos listos para hablar de :math:`n`-superficies dimensionales.

source: If you have a set of :math:`n` "coordinates" (or angles) which are periodic, just like :math:`\theta` and :math:`\phi` were (which is the case for the three Euler angles), then people say those coordinates describe a point on the surface of an :math:`n`-torus. (In the case that the period of a "coordinate" is different than :math:`2\pi`, that coordinate can be scaled to make it so, such that it corresponds to an :math:`n`-torus).
es: Si tenemos un conjunto de :math:`n` "coordenadas" (o ángulos) que son periódicas, igual que lo fueron :math:`\theta` y :math:`\phi` (que es el caso de los tres ángulos de Euler), entonces la gente dice que esas coordenadas describen un punto en la superficie de un toroide-:math:`n`. (En el caso de que el período de una "coordenada" sea diferente a :math:`2\pi`, esa coordenada puede ser escalada para hacerla así, de tal forma que corresponda a un toroide-:math:`n`).

source: Now, back to our original issue. The axis of the axis-angle parametrization (which is *the* natural way of parametrizing rotations, and is a one-to-one covering map of SO(3); in fact, this is true for all Lie groups, not just rotations in 3D) spans a sphere (every point in a ball of radius :math:`\pi` corresponds to a rotation in SO(3) where the rotation amount is mapped to radius and rotation axis points is the direction from the origin; with the additional caveat that if you flip the sign of the axis and angle simultaneously, it maps to the same rotation), which is described using spherical coordinates, whereas Euler angles span the surface of a 3-torus (such that every point on the 3-torus corresponds to a rotation), which is described by the three Euler angles. The problem here is, a sphere is topologically different from a torus. In simple terms, this means that it's impossible to deform a sphere to a torus "smoothly": at some point, you have to punch a hole in it to make a donut from a ball (and you can never "punch a hole" or change the topology when you stick with a parametrization: if you use Euler angles, you're forever stuck walking the surface of a 3-donut, and if you use axis-angle, you're forever stuck flying inside the sphere).
es: Ahora, volvamos a nuestro número original. El eje de la parametrización eje-ángulo (que es *la* forma natural de parametrizar las rotaciones, y es un mapa de cobertura uno a uno de SO(3); de hecho, esto es válido para todos los grupos de Lie, no sólo para las rotaciones en 3D) abarca una esfera (cada punto en una bola de radio :math:`\pi` corresponde a una rotación en SO(3) en la que la cantidad de rotación se mapea al radio y los puntos del eje de rotación son la dirección desde el origen; con la advertencia adicional de que si volteas el signo del eje y el ángulo simultáneamente, se mapea a la misma rotación), que se describe usando coordenadas esféricas, mientras que los ángulos de Euler abarcan la superficie de 3-toroides (de tal forma que cada punto en los 3-toroides corresponde a una rotación), que se describe con los tres ángulos de Euler. El problema aquí es que una esfera es topológicamente diferente a un toroide. En términos simples, esto significa que es imposible deformar una esfera a un toroide "suavemente": en algún momento, tienes que hacer un agujero en ella para hacer una rosquilla de una bola (y nunca puedes "perforar un agujero" o cambiar la topología cuando te quedas con una parametrización: si usas los ángulos de Euler, estás siempre atascado caminando por la superficie de 3-rosquillas, y si usas un eje-ángulo, estás siempre atascado volando dentro de la esfera).
