Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/rotations.po
Languages: es

source: In game engines, rotation operators are represented using either matrices, or quaternions. *As will be clear in what follows, you can use a matrix or a quaternion to represent a rotation parameterized using Euler angles, and same goes for axis-angle parametrization.* Unfortunately, even graphics programming books and documentations of expensive game engines often make a mistake here, and this causes programmers to start comparing Euler angles (a parametrization) to quaternions (a representation) and even discussing their trade-offs, which is "not even wrong".
es: En los motores de juego, los operadores de rotación se representan utilizando matrices o cuaterniones. Desafortunadamente, incluso los libros de programación de gráficos y las documentaciones de motores de juego caros a menudo cometen un error aquí, y esto hace que los programadores comiencen a comparar los ángulos de Euler (una parametrización) con los cuaterniones (una representación) e incluso a discutir sus equilibrios, lo que "ni siquiera es incorrecto".

source: `Representation <https://en.wikipedia.org/wiki/Group_representation>`_ here refers to a technical term in group theory. So will many other things that will be mentioned in what follows. To gain a basic understand of these concepts, let's first go through simpler and better understood example of rotations in 2D first.
es: `Representación de grupo <https://es.wikipedia.org/wiki/Representaci%C3%B3n_de_grupo>`_ aquí se refiere a un término técnico de la teoría de grupos. Así como muchas otras cosas que se mencionarán en lo que sigue. Para obtener una comprensión básica de estos conceptos, primero pasemos a través de ejemplos más simples y mejor entendidos de rotaciones en 2D.

source: Representation of rotations in 2D
es: Representación de rotaciones en 2D

source: Since there is only one possible axis of rotation in a two dimensional plane, there is no Euler angle parametrization for them (or if you like, there is only one Euler-angle). Rather, axis-angle parametrization is used, with the axis being fixed to z-axis, which leaves only the angle of rotation :math:`\varphi` as a free parameter.
es: Dado que sólo hay un eje de rotación posible en un plano bidimensional, no hay parametrización del ángulo de Euler para ellos (o si lo prefieres, sólo hay un ángulo de Euler). En su lugar, se utiliza la parametrización eje-ángulo, fijando el eje al eje z, lo que deja sólo el ángulo de rotación :math:`\varphi` como parámetro libre.

source: A point in the 2D Euclidean space can be represented by a pair of 2D real numbers as :math:`\boldsymbol v = (x,y)` (called vector representation), or they can alternatively be represented by a complex number as :math:`v = x + \imath y` where :math:`\imath \equiv \sqrt{-1}` is the unit imaginary number. In the vector representation, we can rotate the point through a rotation matrix (an element of the Lie group SO(2), which can be represented by :math:`2 \times 2` orthogonal matrices with determinant +1) as follows:
es: Un punto en el espacio 2D euclidiano puede ser representado por un par de números reales 2D como :math:`\boldsymbol v = (x,y)` (llamado representación vectorial), o alternativamente pueden ser representados por un número complejo como :math:`v = x + \imath y` donde :math:`\imath \equiv \sqrt{-1}` es un número imaginario de la unidad. En la representación vectorial, podemos rotar el punto a través de una matriz de rotación (un elemento del grupo Lie SO(2), el cual puede ser representado por matrices ortogonales :math:`2 \times 2` con determinante +1) como sigue:

source: So for example, when :math:`\theta=\pi/2`, we get :math:`R(\pi/2) \boldsymbol v = (-y,x)`.
es: Así, por ejemplo, cuando :math:`\theta=\pi/2`, obtenemos :math:`R(\pi/2) \boldsymbol v = (-y,x)`.

source: In the complex representation, a rotation is represented by a unit complex number :math:`e^{\imath\theta} = \cos\theta + \imath \sin\theta`, where we used `Euler's formula <https://en.wikipedia.org/wiki/Euler%27s_formula>`_, is an element of the Lie group U(1), which can be represented by complex numbers of unit norm. Again, for :math:`\theta=\pi/2`, you recover :math:`e^{\imath\pi/2}(x+\imath y) = \imath(x+\imath y) = (-y) + \imath x`.
es: En la representación compleja, una rotación está representada por un número complejo de unidades :math:`e^{\imath\theta} = \cos\theta + \imath \sin\theta`, donde usamos la `fórmula de Euler <https://es.wikipedia.org/wiki/F%C3%B3rmula_de_Euler>`_, es un elemento del grupo de Lie U(1), que puede ser representado por números complejos de la norma unitaria. Una vez más, para :math:`\theta=\pi/2`, recuperas :math:`e^{\imath\pi/2}(x+\imath y) = \imath(x+\imath y) = (-y) + \imath x`.

source: Rotations in the complex number representation look simpler, but it's only an illusion: the complications of performing a matrix multiplication is absorbed by the introduction of something that lives outside of the realm of real numbers, which follows a rather "odd" algebra: :math:`\imath^2 = -1`. The way complex numbers mimic 2D rotations can be made clearer if we rewrite the rotation matrix in terms of
es: Las rotaciones en la representación de números complejos parecen más simples, pero es sólo una ilusión: las complicaciones de realizar una multiplicación matricial son absorbidas por la introducción de algo que vive fuera del reino de los números reales, que sigue a un álgebra bastante "extraña": :math:`\imath^2 = -1`. La manera en que los números complejos imitan las rotaciones 2D puede ser más clara si reescribimos la matriz de rotación en términos de

source: as :math:`R(\theta) = I_2 \cos\theta + J_z \sin\theta`, which can then be compared to :math:`1 x + \imath y` directly. Now we can see the equivalence (the technical term is `isomorphism <https://en.wikipedia.org/wiki/Group_isomorphism>`_ in this context) of the representations clearer through their multiplication table: :math:`I_2 I_2 = I_2, I_2 J_z = J_z, J_z I_2 = J_z, J_z J_z = -I_2` which behaves the same way as :math:`1 \times 1 = 1, 1 \times \imath = \imath, \imath \times 1 = \imath, \imath \times \imath = -1`. Also note that both :math:`\imath` and :math:`J_z` represent a :math:`\pi/2` rotation. And as it should be, :math:`\imath` and :math:`J_z` behave the same under multiplication.
es: que puede ser comparada con :math:`R(\theta) = I_2 \cos\theta + J_z \sin\theta`directamente. Ahora podemos ver la equivalencia (el término técnico es `isomorfismo <https://en.wikipedia.org/wiki/Group_isomorphism>`_ en este contexto) de las representaciones más claras a través de su tabla de multiplicación: :math:`I_2 I_2 = I_2, I_2 J_z = J_z, J_z I_2 = J_z, J_z J_z = -I_2` lo cual se comporta de la misma manera que :math:`1 \times 1 = 1, 1 \times \imath = \imath, \imath \times 1 = \imath, \imath \times \imath = -1`. También ten en cuenta que tanto :math:`\imath` como :math:`J_z` representan una rotación de :math:`\pi/2`. Y como debe ser, :math:`\imath` and :math:`J_z` se comportan igual en la multiplicación.

source: Furthermore, by Taylor series expansion, it is straightforward to show that :math:`R(\theta) = e^{J_z \theta}`.
es: Además, mediante la expansión de la serie de Taylor, es sencillo mostrar que :math:`R(\theta) = e^{J_z \theta}`.

source: We have then the following table:
es: Tenemos entonces la siguiente tabla:

source: What
es: Lo que

source: Matrix representation of SO(2)
es: Representación de la matriz de SO(2)

source: Complex representation of U(1)
es: Representación compleja de U(1)

source: Generator
es: Generador

source: Rotation operator
es: Operador de rotación

source: Clearly, introduction of the unit imaginary number is enough to capture the behavior of 2D rotation matrices. As a footnote remark, while the number :math:`e^{\imath\theta}` can only represent a rotation matrix, it can't of course represent an arbitrary :math:`2 \times 2` matrix (meaning no scaling, no shearing, etc): after all, U(1) isn't isomorphic to :math:`\text{GL}(2, \mathbb R)`, the group of all (invertible) real :math:`2\times 2` matrices.
es: Claramente, la introducción del número imaginario unitario es suficiente para capturar el comportamiento de las matrices de rotación 2D. Como nota al pie de página, mientras que el número :math:`e^{{imath{theta}` sólo puede representar una matriz de rotación, por supuesto no puede representar una matriz arbitraria :math:`2 \times 2` (lo que significa que no hay escalado, roturas, etc): después de todo, U(1) no es isomorfo para `:math:`\text{GL}(2, \mathbb R)`, el grupo de todas las matrices reales (invertibles) de :math:`2\times 2`.

source: The equivalence of these two seemingly different way of representing vectors and rotations in 2D lies in the `isomorphism between the Lie groups SO(2) and U(1) <https://en.wikipedia.org/wiki/Circle_group#Isomorphisms>`_.
es: La equivalencia de estas dos formas aparentemente diferentes de representar vectores y rotaciones en 2D radica en el `isomorfismo entre los grupos de Lie SO(2) y U(1) <https://en.wikipedia.org/wiki/Circle_group#Isomorphisms>`_.

source: Furthermore, in this representation, it is clear that you can do a "smooth" rotation by slowly changing :math:`\theta`, which is the 2D analogue of SLERP (could as well be called Circular Linear Interpolation!). Note that if you linearly interpolate the *elements* of two rotation matrices (that is, linearly interpolating between :math:`R_{ij}` and :math:`R'_{ij}` ), you'll get a weird trajectory with jerky motion; to do SLERP with a matrix, you need to extract the angles from each matrix (which can only happen for matrices whose entries have to form given by :math:`R(\theta)` above; that is, elements of SO(2)), interpolate between the angles linearly, and construct the intermediate matrix using that angle.
es: Además, en esta representación, está claro que se puede hacer una rotación "suave" cambiando lentamente :math:`\theta`, que es el análogo 2D de SLERP (¡también podría llamarse Interpolación Lineal Circular!). Si se interpolan linealmente los *elementos* de dos matrices de rotación (es decir, interpolando linealmente entre :math:`R_{ij}` y :math:`R'_{ij}` ), se obtendrá una trayectoria extraña con un movimiento espasmódico; para hacer SLERP con una matriz, es necesario extraer los ángulos de cada matriz (lo que sólo puede ocurrir para matrices cuyas entradas tienen que formarse por :math:`R(\theta)` arriba; es decir, elementos de SO(2)), interpolar entre los ángulos linealmente, y construir la matriz intermedia usando ese ángulo.

source: The take-aways of this short visit to the more understandable 2D land are:
es: Las ventajas más comprensibles de esta breve visita a la tierra 2D son:

source: There can be different (but "equivalent", of course) *representations* of rotations: like matrices and complex numbers.
es: Puede haber diferentes (pero "equivalentes", por supuesto) *representaciones* de rotaciones: como matrices y números complejos.

source: Despite the fact that you can use complex numbers to represent vectors and rotations in 2D, the *concept* of rotations in 2D doesn't require an understanding/knowledge of complex numbers or Euler's formula.
es: A pesar de que se pueden usar números complejos para representar vectores y rotaciones en 2D, el *concepto* de rotaciones en 2D no requiere un entendimiento/conocimiento de números complejos o de la fórmula de Euler.

source: The introduction of the imaginary :math:`\imath` is not black magic: it's just something that mimics :math:`2 \times 2` matrix :math:`J_z`: :math:`1` and :math:`\imath` behave the same way as :math:`I_2` and :math:`J_z` under multiplication (see the group multiplication table given above).
es: La introducción del imaginario :math:`\imath` no es magia negra: es algo que se imita a la matriz de :math:`2 \times 2` :math:`J_z`: `math:`1` y :math:`\imath` se comportan de la misma manera que :math:`I_2` and :math:`J_z` en la multiplicación (ver la tabla de multiplicación de grupos mostrada más arriba).

source: These are often sources of confusion in 3D: introducing a third dimension means we have new rotation axes (rotations around X and Y axes) giving rise to alternative parametrizations (such as Euler angles), and new generators :math:`J_x` and :math:`J_y`, which will be the generalization of :math:`J_z` above.
es: Éstas son a menudo fuentes de confusión en 3D: introducir una tercera dimensión significa que tenemos nuevos ejes de rotación (rotaciones alrededor de los ejes X e Y) dando lugar a parametrizaciones alternativas (como los ángulos de Euler), y nuevos generadores :math:`J_x` y `mateh:`J_y`, que será la generalización de :math:`J_z` arriba.

source: Some mathematical remarks (again, feel free to skip)
es: Algunos comentarios matemáticos (de nuevo, siéntete libre de omitirlos)

source: The fact that SO(3) has 3 generators is an accident: SO(:math:`n`) has :math:`n(n-1)/2` generators. Furthermore, the next step (after quaternions, which is `another accident <https://en.wikipedia.org/wiki/Spin_group#Accidental_isomorphisms>`_) of `Cayley-Dickson construction <https://en.wikipedia.org/wiki/Cayley%E2%80%93Dickson_construction>`_ does *not* correspond to a Lie algebra, but rather a non-associative algebra called `octonions <https://en.wikipedia.org/wiki/Octonion>`_. Rather, in arbitrary dimensions, the "complex" representation can be written using the generators of Spin(:math:`n`), which is a double cover of SO(:math:`n`). Also, throughout this page, when we say representation of SO(2), U(1) or any other group, we are talking about the `*fundamental* <https://en.wikipedia.org/wiki/Fundamental_representation>`_ `irreducible representation <https://en.wikipedia.org/wiki/Irreducible_representation>`_, corresponding to a `Young diagram <https://en.wikipedia.org/wiki/Young_tableau>`_ with a single box.
es: El hecho de que SO(3) tenga 3 generadores es un accidente: SO(:math:`n`) tiene :math:`n(n-1)/2` generadores. Además, el siguiente paso (después de los cuaternios, que es `otro accidente <https://en.wikipedia.org/wiki/Spin_group#Accidental_isomorphisms>`_) de `construcción de Cayley-Dickson <https://en.wikipedia.org/wiki/Cayley%E2%80%93Dickson_construction>`_ no corresponde a un álgebra Lie, sino a un álgebra no asociativa llamada `octonions <https://en.wikipedia.org/wiki/Octonion>`_. Más bien, en dimensiones arbitrarias, la representación "compleja" puede ser escrita usando los generadores de Spin(:math:`n`), que es una doble portada de SO(:math:`n`). Además, a lo largo de esta página, cuando decimos representación de SO(2), U(1) o cualquier otro grupo, estamos hablando de la `*fundamental* <https://en.wikipedia.org/wiki/Fundamental_representation>`_ `representación irreductible <https://en.wikipedia.org/wiki/Irreducible_representation>`_, correspondiente a un `Diagrama joven <https://en.wikipedia.org/wiki/Young_tableau>`_ con una sola casilla.

source: Representation of rotations in 3D
es: Representación de rotaciones en 3D

source: Let's first review how 3D rotations work using familiar vectors and matrices.
es: Primero repasemos cómo funcionan las rotaciones 3D usando vectores y matrices ya conocidos.

source: In 2D, we considered vectors lying in the :math:`xy` plane, and the only axis we could can rotate them was the :math:`z`-axis. In 3D, we can perform a rotation around any axis. And this doesn't just mean around :math:`x, y, z` axes, the rotation can also be around an axis which is a linear combination of those, where :math:`\boldsymbol n` is the unit vector (meaning :math:`\boldsymbol n \cdot \boldsymbol n = 1` ) aligned with the axis we want to perform the rotation.
es: En 2D, consideramos vectores que yacen en el plano :math:`xy`, y el único eje que podíamos rotarlos era el eje :math:`z`. En 3D, podemos realizar una rotación alrededor de cualquier eje. Y esto no sólo significa alrededor de los ejes `x, y, z`, la rotación también puede ser alrededor de un eje que es una combinación lineal de ellos, donde :math:`\boldsymbol n` es el vector unitario (es decir, :math:`\boldsymbol n \cdot \boldsymbol n = 1` ) alineado con el eje que queremos realizar la rotación.

source: Just like the 2D rotation matrix, the 3D rotation matrix can also be derived with some effort by drawing lots of arrows and angles and some linear algebra, but this would be opaque and won't give us much insight to what's going on. A less straightforward, but more rewarding way of deriving this matrix is to understand the rotation group SO(3).
es: Al igual que la matriz de rotación 2D, la matriz de rotación 3D también puede ser derivada con un poco de esfuerzo dibujando muchas flechas y ángulos y algo de álgebra lineal, pero esto sería opaco y no nos dará mucha información de lo que está pasando. Una forma menos directa, pero más gratificante de derivar esta matriz es entender el grupo de rotación SO(3).

source: SO(3) is the group of rotations in Euclidean 3D space (for which the `signature <https://en.wikipedia.org/wiki/Metric_signature>`_ is :math:`(+1,+1,+1)`), which preserve the magnitude and handedness of the vectors it acts on. The most typical way to represent its elements is to use :math:`3 \times 3` real orthogonal matrices with determinant :math:`+1`. This :math:`\text{Mat}(3, \mathbb R)` representation is called the fundamental representation of SO(3).
es: SO(3) es el grupo de rotaciones en el espacio 3D euclidiano (cuya `firma <https://en.wikipedia.org/wiki/Metric_signature>`_ es :math:`(+1,+1,+1)`), que conservan la magnitud y procedencia de los vectores sobre los que actúa. La forma más típica de representar sus elementos es usar matrices ortogonales reales de :math:`3 \times 3` con determinante :math:`+1`. Esta representación se llama la representación fundamental de SO(3).

source: To recap what we discussed earlier, SO(3) has 3 generators, :math:`J_x, J_y, J_z` and we found that they can be represented using these :math:`3\times 3` real matrices:
es: Para recapitular lo que hablamos antes, SO(3) tiene 3 generadores, :math:`J_x, J_y, J_z` y encontramos que pueden ser representados usando las siguientes :math:`3\times 3` matrices reales:

source: These matrices have the same "multiplication table" as :math:`J_i` (they're isomorphic), so for all practical purposes, you can replace the operators with their matrix representations.
es: Estos matrices tienen la misma "tabla de multiplicación" que :math:`J_i` (son isomórficos), así que para todos los efectos prácticos, puede reemplazar los operadores con sus representaciones matriciales.

source: We also found that an element of SO(3), that is, a rotation operator is
es: También encontramos que un elemento de SO(3), es decir, un operador de rotación es

source: If you want, you can plug-in the matrix representations for :math:`J_i` and derive the complicated :math:`3\times 3` rotation matrix which is
es: Si quieres, puedes conectar las representaciones de la matriz para :math:`J_i` y derivar la complicada matriz de rotación :math:`3\times 3 que es

source: (Hint: you can use the relation :math:`(\boldsymbol n \cdot \boldsymbol J)^2 = \boldsymbol n \otimes \boldsymbol n-I` to quickly evaluate the last term in the Rodrigues' formula, where :math:`\otimes` is the `Kronecker product <https://en.wikipedia.org/wiki/Kronecker_product>`_ which is also called `outer product <https://en.wikipedia.org/wiki/Outer_product>`_ for vectors. Using the `half-angle formulae <https://en.wikipedia.org/wiki/List_of_trigonometric_identities#Half-angle_formulae>`_ to rewrite :math:`\sin\varphi = 2 \cos\frac{\varphi}{2} \sin\frac{\varphi}{2}` and :math:`1-\cos\varphi = 2 \sin^2\frac{\varphi}{2}` in Rodrigues' formula, you can use cosine and sine terms as a visual aid when comparing to the matrix form.)
es: (Pista: puedes usar la relación :math:`(\boldsymbol n \cdot \boldsymbol J)^2 = \boldsymbol n \otimes \boldsymbol n-I` para evaluar rápidamente el último término de la fórmula de Rodrigues, donde :math:`\otimes` es el `producto de Kronecker <https://es.wikipedia.org/wiki/Producto_de_Kronecker>`_ que también se llama `producto exterior <https://en.wikipedia.org/wiki/List_of_trigonometric_identities#Half-angle_formulae>`_ para reescribir :math:`\sin\varphi = 2 \cos\frac{\varphi}{2} \sin\frac{\varphi}{2}` y :math:`1-\cos\varphi = 2 \sin^2\frac{\varphi}{2}` en la fórmula de Rodrigues, se pueden usar términos de coseno y seno como una ayuda visual cuando se compara con la forma de la matriz.)

source: However, we don't *have to* use matrices to represent SO(3) generators :math:`J_i`. Remember how we used :math:`\imath`, the imaginary unit to emulate :math:`J_z` rather than using a :math:`2 \times 2` matrix? As it turns out we can do something similar here.
es: Sin embargo, no *tenemos que* usar matrices para representar generadores SO(3) :math:`J_i`. ¿Recuerdas cómo usamos :math:`\imath`, la unidad imaginaria para emular :math:`J_z` en lugar de usar una matriz :math:`2 \times 2`? Resulta que podemos hacer algo similar aquí.

source: `Hamilton <https://en.wikipedia.org/wiki/William_Rowan_Hamilton>`_ is mostly commonly known for the omnipresent `Hamiltonian <https://en.wikipedia.org/wiki/Hamiltonian_mechanics>`_ in physics. One of his less known contributions is essentially an alternative way of representing 3D cross product, which eventually gave in to popularity of usual vector `cross products <https://en.wikipedia.org/wiki/Cross_product#History>`_. He essentially realized that there are three different non-commuting rotations in 3D, and gave a name to the generator for each. He identified the operators :math:`\{\boldsymbol e_x \times, \boldsymbol e_y \times, \boldsymbol e_z \times\}` as the elements of an algebra, naming them as :math:`\{i,j,k\}`.
es: `Hamilton <https://es.wikipedia.org/wiki/William_Rowan_Hamilton>`_ es comúnmente conocido por la omnipresente `mecánica Hamiltoniana <https://es.wikipedia.org/wiki/Mec%C3%A1nica_hamiltoniana>`_ en física. Una de sus contribuciones menos conocidas es esencialmente una forma alternativa de representar el producto vectorial 3D, que finalmente cedió a la popularidad del vector habitual `productovectorial <https://en.wikipedia.org/wiki/Cross_product#History>`_. Esencialmente se dio cuenta de que hay tres rotaciones diferentes no conmutadas en 3D, y le dio un nombre al generador para cada una. Identificó a los operadores :math:`\{\boldsymbol e_x \times, \boldsymbol e_y \times, \boldsymbol e_z \times\}` como los elementos de un álgebra, nombrándolos :math:`\{i,j,k\}`.
