Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/rotations.po
Languages: es

source: Why is this a problem at all? Because it means that a smooth walk (flight?) inside the sphere doesn't always correspond to a smooth walk on the surface of the 3-torus, vice versa: a 3-torus and sphere are globally different, which is a fact you're bound to discover if you walk the parameter space by a smoothly rotating a body using these parametrizations. Axis-angle parametrization has singularities at the poles (where the azimuthal angle is ill-defined) but that's fine because that's exactly how SO(3) is, after all, axis-angle is how Lie groups are parametrized. Euler angle parametrization also has singularities corresponding to points where two gimbals are aligned, but those singularities are different from SO(3)'s poles.
es: ¿Por qué es esto un problema? Porque significa que una caminata suave (¿vuelo?) dentro de la esfera no siempre corresponde a una caminata suave en la superficie de 3-toroides, viceversa: 3-toroides y una esfera son completamente diferentes, lo cual es un hecho que estás obligado a descubrir si caminas por el espacio de parámetros girando suavemente un cuerpo usando estas parametrizaciones. La parametrización eje-ángulo tiene singularidades en los polos (donde el ángulo acimutal está mal definido) pero eso está bien porque así es exactamente como está SO(3), después de todo, el eje-ángulo es como se parametrizan los grupos de Lie. La parametrización del ángulo de Euler también tiene singularidades correspondientes a puntos en los que se alinean dos cardanes, pero esas singularidades son diferentes de los polos de SO(3).

source: Suppose that you're at a nice spot, a rotation that can be parametrized by both axis-angle and Euler angles uniquely. Sometimes, it can just happen that if you take a wrong step, you'll fall into a "hole" (meaning a singularity at which infinitely many parameters correspond to the same rotation, like at the poles, all choices for the azimuthal angle give the same rotation, or the similar situation with gimbal lock) in one parametrization, while you can continue a smooth journey in the other parametrization. When you fall a "hole" using Euler angles, it's called gimbal lock, and since there may not be a corresponding "hole" when you take the similar step in the sphere, this tells us that Euler angles is a defective parametrization of SO(3).
es: Supón que estás en un buen punto, una rotación que puede ser parametrizada por ambos ángulos de eje y Euler únicamente. A veces, puede ocurrir que si das un paso equivocado, caigas en un "agujero" (es decir, una singularidad en la que infinitamente muchos parámetros corresponden a la misma rotación, como en los polos, todas las opciones para el ángulo acimutal dan la misma rotación, o la situación similar con el bloqueo del cardán) en una parametrización, mientras que puedes continuar un viaje suave en la otra parametrización. Cuando se cae un "agujero" usando los ángulos de Euler, se llama bloqueo de cardán, y como puede no haber un "agujero" correspondiente cuando se da un paso similar en la esfera, esto nos dice que los ángulos de Euler son una parametrización defectuosa de SO(3).

source: The root of the problem isn't just the fact that Euler angle parametrization has singularties, just as axis-angle does which is fine on its own, but that those singularities don't match with SO(3)'s singularities.
es: La raíz del problema no es sólo el hecho de que la parametrización del ángulo de Euler tiene singularidades, como lo hace el eje-ángulo, que está bien por sí solo, sino que esas singularidades no coinciden con las singularidades de SO(3).

source: This is the mathematical description of the gimbal-lock problem.
es: Esta es la descripción matemática del problema del bloqueo del cardán.

source: Here's an example of gimbal lock in Euler angle parametrization. Suppose that one of the rotations is :math:`\pi/2`, let's say the middle one. By inserting an identity operator :math:`X(-\pi/2) X(\pi/2)` to the right side and rearranging terms, we can show that
es: He aquí un ejemplo de bloqueo del cardán en la parametrización del ángulo de Euler. Supongamos que una de las rotaciones es :math:`\pi/2`, digamos la del medio. Insertando un operador de identidad :math:`X(-\pi/2) X(\pi/2)` en el lado derecho y reorganizando los términos, podemos probar que

source: (see the section about active transformation below about how a rotation matrix itself transforms, which also explains why and how a Z rotation turns into a Y rotation when surrounded by :math:`\pi/2` and :math:`-\pi/2` X rotations) which means we lost a degree of freedom: :math:`\varphi_y-\varphi_z` effectively became a single parameter determining the Y rotation and we completely lost the first Z rotation. You can follow similar steps to show that when *any* of the YXZ Euler angles become :math:`\pm \pi/2`, you get a gimbal lock.
es: (ver la sección sobre transformación activa más adelante sobre cómo se transforma una matriz de rotación, que también explica por qué y cómo una rotación Z se convierte en una rotación Y cuando está rodeada de :math:`\pi/2` y :math:`-\pi/2` X rotaciones) lo que significa que perdimos un grado de libertad: :math:`\varphi_y-\varphi_z` efectivamente se convirtió en un único parámetro determinante de la rotación Y y perdimos completamente la primera rotación Z. Puedes seguir pasos similares para mostrar que cuando *cualquiera* de los ángulos YXZ Euler se convierten en :math:`\pm \pi/2`, se obtiene un bloqueo de cardán.

source: This happens for :math:`\pm \pi/2` simply because in the YXZ convention, neighboring axes are related to each other by a :math:`\pm \pi/2` rotation around the axis given by the other neighbor. For XZX convention, the gimbal lock would happen at :math:`\varphi_z = \pm \pi` for example.
es: Esto sucede para :math:`\pm \pi/2` simplemente porque en la convención YXZ, los ejes vecinos están relacionados entre sí por una rotación de :math:`\pm \pi/2` alrededor del eje dado por el otro vecino. Para la convención XZX, el bloqueo del cardán ocurriría por ejemplo en :math:`\varphi_z = \pm \pi`.

source: Summary: representation versus parametrization
es: Resumen: representación vs parametrización

source: We can sum it up in a table:
es: Podemos resumirlo en una tabla:

source: Parametrization/Representation
es: Parametrización/Representación

source: Axis-angle
es: Ejes-ángulo

source: Euler-angles
es: Ángulos de Euler

source: where :math:`\boldsymbol J` denotes the matrix representation of the :math:`\boldsymbol J` operators (too lazy to introduce a new symbol for that). YXZ Euler angles is chosen for concreteness (as it is the default convention in Godot), and can be replaced by any three axes (as long as two neighboring axes aren't the same).
es: donde :math:`\boldsymbol J` denota la representación matricial de los operadores :math:`\boldsymbol J` (demasiado perezosos para introducir un nuevo símbolo para eso). Los ángulos de Euler XYZ se eligen para concretar (ya que es la convención por defecto en Godot), y pueden ser reemplazados por tres ejes cualquiera (siempre y cuando dos ejes vecinos no sean iguales).

source: In all cases listed in the above table, Rodrigues' formula (or it's analogue for quaternions) given above can be used for practical purposes.
es: En todos los casos enumerados en la tabla anterior, la fórmula de Rodrigues (o es análoga para los cuaterniones) indicada anteriormente puede utilizarse con fines prácticos.

source: In the context of 3D rotations, one representation isn't superior or inferior to another. Whatever representation you're using, you are representing exactly the same thing. A difference appears only when you implement it on a computer: different representations have trade offs when it comes to precision errors, CPU cycles and memory usage (for example, accessing to rotation axis-angle with quaternions is trivial but requires some algebra in matrix representation whereas the converse is true when accessing the basis vectors, SLERP, composition of rotations and orthonormalization is faster with quaternions but a conversion to matrix representation, which isn't free, is always required because that's the representation OpenGL uses and rotating a 3D vector is faster in matrix representation since they are written in the same basis), and they may have different characteristics when doing finite precision arithmetic with floating point numbers. In principle, you can do everything you do with quaternions using matrices, vice versa. The performance could be bad in one representation, but the point is, there is nothing in their mathematics that prevent you from doing that.
es: En el contexto de las rotaciones 3D, una representación no es superior o inferior a otra. Cualquiera que sea la representación que estés usando, estás representando exactamente lo mismo. Las diferencias sólo aparecen cuando se implementan en una computadora: diferentes representaciones tienen compensaciones cuando se trata de errores de precisión, ciclos de CPU y uso de memoria (por ejemplo, acceder al ángulo del eje de rotación con cuaterniones es trivial pero requiere algo de álgebra en la representación de la matriz mientras que lo contrario es aplicable cuando se accede a los vectores base, SLERP, la composición de rotaciones y ortonormalización es más rápida con cuaterniones, pero siempre se requiere una conversión a representación matricial, que no es libre, porque esa es la representación que utiliza OpenGL y girar un vector 3D es más rápido en la representación matricial ya que están escritos en la misma base), y pueden tener características diferentes cuando se hace aritmética de precisión finita con números de coma flotante. En principio, se puede hacer todo lo que se hace con los cuaterniones utilizando matrices, y viceversa. El desempeño podría ser malo en una representación, pero el punto es que no hay nada en sus matemáticas que le impida hacer eso.

source: Parametrizations, on the other hand, are vastly different. Axis-angle is the "one true" parametrization of rotations. Euler angles, despite being a defective parametrization of rotations, could be more intuitive for simple (involving only 1 or 2 angles) and *static* situations like orienting a body/vehicle in the editor, but should be avoided for rotational *dynamics* which would eventually lead to a gimbal lock.
es: Las parametrizaciones, por otro lado, son muy diferentes. El ángulo del eje es la "única" parametrización verdadera de las rotaciones. Los ángulos de Euler, a pesar de ser una parametrización defectuosa de las rotaciones, podrían ser más intuitivos para situaciones simples (involucrando sólo 1 o 2 ángulos) y *estáticas* como orientar una carrocería/vehículo en el editor, pero deberían ser evitados por la *dinámica* rotacional que eventualmente llevaría a un bloqueo del cardán.

source: Interpolating rotations
es: Interpolación de rotaciones

source: In games, it's common problem to interpolate between two different orientation in a "nice way" which doesn't depend on arbitrary things like how the reference frame, and which doesn't result in a "jerky" motion (that is, a torque-free motion) such that the angular speed remains constant during the interpolation. These are the properties that we seek when we say "nice".
es: En los juegos, es un problema común interpolar entre dos orientaciones diferentes de una manera "agradable" que no depende de cosas arbitrarias como el cuadro de referencia, y que no resulta en un movimiento "brusco" (es decir, un movimiento sin torsión) tal que la velocidad angular permanece constante durante la interpolación. Estas son las propiedades que buscamos cuando decimos "agradable".

source: Formally, we'd like to interpolate between an initial rotation :math:`R_1 = e^{\lambda \varphi_1 \boldsymbol n_1 \cdot \boldsymbol J }` and a final one :math:`R_2 = e^{\varphi_2 \boldsymbol n \cdot \boldsymbol J }` a function of time, and what we're seeking is something that transforms one into another smoothly, :math:`R(\lambda)`, where :math:`\lambda` is the normalized time which is 0 at the beginning and 1 at the end. Clearly, we must have :math:`R(\lambda=0)=R_1` and :math:`R(\lambda=1) = R_2`. Since we also know that rotations form a group, we can relate :math:`R(\lambda)` to :math:`R_1` and :math:`R_2` using another rotation, such that we can for example write
es: Nos gustaría interpolar formalmente entre una rotación inicial :math:`R_1 = e^{\lambda \varphi_1 \boldsymbol n_1 \cdot \boldsymbol J }` y una final :math:`R_2 = e^{\varphi_2 \boldsymbol n \cdot \boldsymbol J }` una función de tiempo, y lo que estamos buscando es algo que se transforme el uno en el otro suavemente, :math:`R(\lambda)`, donde :math:`\lambda` es el tiempo normalizado, siendo 0 al principio y 1 al final. Claramente, debemos tener :math:`R(\lambda=0)=R_1` y :math:`R(\lambda=1) = R_2`. Como ya sabemos que las rotaciones forman un grupo, podemos relacionar :math:`R(\lambda)` con :math:`R_1` and :math:`R_2` usando otra rotación, de manera que, por ejemplo, podamos escribir

source: This form makes sense because for :math:`\lambda=0`, the interpolation hasn't started and :math:`R(\lambda)` automatically becomes :math:`R_1`. But why not pick a different form for the exponent as a function of :math:`\lambda` which evaluates to 0 when :math:`\lambda=0`? That's simply because we don't want to have a jerky motion, meaning :math:`\boldsymbol \omega \cdot \boldsymbol J = R^T(\lambda) \dot R(\lambda)`, where :math:`\boldsymbol \omega` is the angular velocity vector, has to be a constant, which can only happen if the time derivative of the exponent is linear in time (in which case we obtain :math:`\boldsymbol \omega = \varphi \boldsymbol n`). Or equivalently, you can simply observe that a rotation around a fixed axis (fixed because otherwise if you tilt the rotation axis in time, you'll again get a "jerky motion" due to `Euler force <https://en.wikipedia.org/wiki/Euler_force>`_) with constant angular speed is :math:`e^{\boldsymbol \omega t \cdot \boldsymbol J }` where the exponent is linear in time.
es: Esta forma tiene sentido porque para :math:`\lambda=0`, la interpolación no ha comenzado y :math:`R(\lambda)` se convierte automáticamente en :math:`R_1`. Pero, ¿por qué no elegir una forma diferente para el exponente en función de :math:`\lambda` que se evalúa a 0 cuando :math:`\lambda=0`? Eso es simplemente porque no queremos tener un movimiento brusco, lo que significa :math:`\boldsymbol \omega \cdot \boldsymbol J = R^T(\lambda) \dot R(\lambda)`, dónde :math:`\boldsymbol \omega` es el vector de velocidad angular, tiene que ser una constante, lo que sólo puede ocurrir si la derivada temporal del exponente es lineal en el tiempo (en cuyo caso obtenemos :math:`\boldsymbol \omega = \varphi \boldsymbol n`). O su equivalente, simplemente se puede observar que una rotación alrededor de un eje fijo (fijo porque de lo contrario, si inclinas el eje de rotación en el tiempo, obtendrás de nuevo un "movimiento brusco" debido a la `Fuerza de Euler <https://es.wikipedia.org/wiki/Fuerza_de_Euler`_) con velocidad angular constante es :math:`e^{\boldsymbol \omega t \cdot \boldsymbol J }` donde el exponente es lineal en el tiempo.

source: But how do we choose :math:`\boldsymbol n` and :math:`\varphi`? Well, we simply enforce that :math:`R(\lambda)` has to becomes :math:`R_2` at the end, when :math:`\lambda=1`. Although this looks like a difficult problem, it's actually not. We first make a rearrangement:
es: Pero, ¿cómo elegimos :math:`\boldsymbol n` y :math:`\varphi`? Bueno, simplemente hacemos cumplir que :math:`R(\lambda)` se convierta en :math:`R_2` al final, cuando :math:`\lambda=1`. Aunque esto parece un problema difícil, en realidad no lo es. Primero lo reorganizaremos:

source: From this expression, it becomes evident that the solution is :math:`e^{\varphi \boldsymbol n \cdot \boldsymbol J } = R_2 R_1^T`.
es: A partir de esta expresión, se hace evidente que la solución es :math:`e^{\varphi \boldsymbol n \cdot \boldsymbol J } = R_2 R_1^T`.

source: We can also do the same thing in SU(2) and obtain:
es: También podemos hacer lo mismo en SU(2) y obtener:

source: or isomorphically, in terms of quaternions:
es: o isomórficamente, en términos de cuaterniones:

source: For any Lie group, including SO(3) and SU(2), this "nice" interpolation is called SLERP.
es: Para cualquier grupo de Lie, incluyendo SO(3) y SU(2), esta "agradable" interpolación se llama SLERP.

source: Note that at no step we made any reference to axes of some fixed reference frame (as it is in the case of Euler angle parametrization, which are defined with respect to certain "special" 3 axes), everything we did is independent of the reference frame. Also note that this scheme can work for any Lie group, and is independent of the representation used (matrix, quaternion, ...).
es: Nótese que en ningún paso hicimos referencia alguna a ejes de algún sistema de referencia fijo (como es el caso de la parametrización del ángulo de Euler, que se define respecto a ciertos ejes "especiales" de 3 ejes), todo lo que hicimos es independiente del sistema de referencia. También hay que tener en cuenta que este esquema puede funcionar para cualquier grupo Lie, y es independiente de la representación utilizada (matriz, cuaternio, etc.).

source: After some tedious algebra (which involves using :math:`\text{tr}(\sigma_i \sigma_j) = 2 \delta_{ij}`), this result can be simplified to
es: Después de un poco de tediosa álgebra (que implica usar :math:`\text{tr}(\sigma_i \sigma_j) = 2 \delta_{ij}`), este resultado puede simplificarse a

source: when :math:`q_1 \neq \pm q_2`, where we introduced :math:`\cos\Omega \equiv \cos\frac{\varphi_1}{2}\cos\frac{\varphi_2}{2} + \sin\frac{\varphi_1}{2}\sin\frac{\varphi_2}{2} \boldsymbol n_1 \cdot \boldsymbol n_2` (or equivalently, in terms of an artificial vector which contains the coefficients of the quaternions, as we discussed above, :math:`\boldsymbol q_1 \cdot \boldsymbol q_2`). This result has a simple geometric interpretation when a (unit) quaternion is taken to be a point on the 3-sphere and when one introduces an inner product of the 4D Euclidean space, but we'll skip that because it's a bit off topic in our treatment. We'll however note that this is where the name *Spherical* Linear intERpolation comes from, which refers to the 4D sphere.
es: cuando :math:`q_1 \neq \pm q_2`, donde introdujimos :math:`\cos\Omega \equiv \cos\frac{\varphi_1}{2}\cos\frac{\varphi_2}{2} + \sin\frac{\varphi_1}{2}\sin\frac{\varphi_2}{2} \boldsymbol n_1 \cdot \boldsymbol n_2` (o equivalente, en términos de un vector artificial que contiene los coeficientes de los cuaterniones, como hemos discutido anteriormente, :math:`\boldsymbol q_1 \cdot \boldsymbol q_2`). Este resultado tiene una interpretación geométrica simple cuando se toma un cuaternio (unidad) como un punto en la 3-esfera y cuando se introduce un producto interno del espacio euclídeo 4D, pero nos saltaremos eso porque está un poco fuera de tema en este tema. Sin embargo, observaremos que de aquí proviene el nombre de interpolación lineal *Esférica*, que se refiere a la esfera 4D.

source: Reference frames: global, parent-local, object-local
es: Marco de referencia: global, padre-local, objeto-local

source: A reference frame essentially how and where how place the origin and axes of your coordinate system. In Godot, there are three different reference frames. The first is the global reference frame. It exist as the "anchor" frame, where all other frames can be defined with respect to. The other types of reference frames appear when you have objects which have children objects. Here's an example which illustrates these frames.
es: Un marco de referencia básicamente indica cómo y dónde colocar el origen y los ejes de su sistema de coordenadas. En Godot, hay tres marcos de referencia diferentes. El primero es el marco de referencia global. Existe como el marco "ancla", donde se pueden definir todos los demás marcos con respecto al mismo. Los otros tipos de marcos de referencia aparecen cuando tiene objetos que tienen objetos hijos. He aquí un ejemplo que ilustra estos marcos.

source: Consider a ship in the ocean. You can imagine, however that there's a coordinate system painted on the ground somewhere in the ship. This coordinate system moves and rotates with the ship, so it's called ship's local frame. Furthermore, we can attach a reference frame to passengers on the ship (for example, let's say, for each passenger, their left is their :math:`x`-axis and their forward is their :math:`z` axis, and their origin is where they stand).
es: Imagina un barco en el océano. Sin embargo, es posible imaginar que hay un sistema de coordenadas pintado en el suelo en algún lugar del barco. Este sistema de coordenadas se mueve y gira con el barco, por lo que se denomina marco local del barco. Además, podemos adjuntar un marco de referencia a los pasajeros del barco (por ejemplo, digamos que por cada pasajero, su izquierda es su eje :math:`x` y al frente su eje :math:`z`, y su origen es donde se encuentran).

source: The global coordinate system corresponds to a coordinate system world painted somewhere on the ground in the world (let's say we live in a flat world for simplicity). Then every object, including the ship and the passengers have their own reference frames, they're called object-local frames. But notice that for passengers, the most natural frame would be where they are located (and how they're oriented) relative to the ship. After all, when someone asks "Where's Joe?", you'd reply with something like "I saw him in the front deck" rather than trying to look up GPS coordinates (global frame) or saying something like "7 meters to my five o'clock" (passenger/object-local). The ship is referred to as the parent-local frame.
es: El sistema de coordenadas global corresponde a un mundo de sistemas de coordenadas pintado en algún lugar del mundo (digamos que vivimos en un mundo plano por simplicidad). Entonces cada objeto, incluyendo el barco y los pasajeros tienen sus propios marcos de referencia, se llaman marcos objeto-local. Pero hay que tener en cuenta que para los pasajeros, el marco más natural sería el lugar donde se encuentran (y cómo están orientados) en relación con el barco. Después de todo, cuando alguien pregunta "¿Dónde está Joe?", respondes con algo como "Lo vi en la cubierta de proa" en lugar de intentar buscar coordenadas GPS (marco global) o decir algo como "7 metros a mis cinco en punto" (pasajero/objeto-local). El buque se conoce como la estructura padre-local.

source: In Godot, Basis matrices refer to the parent-local frame. If the object is top level, then it's Basis is written in the global frame.
es: En Godot, las matrices de Basis (Base) se refieren al marco padre-local. Si el objeto es de nivel superior, entonces su base se escribe en el marco global.

source: Active and passive transformations
es: Transformaciones activas y pasivas
