Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/rotations.po
Languages: es

source: While operators (such as :math:`e^{\varphi \boldsymbol n \cdot \boldsymbol J}` ) and vectors :math:`\boldsymbol v` are "out there" and are independent of the reference frame, their coordinates aren't. For example, a vector can be aligned with the :math:`x`-axis in some frame whereas in can be aligned with :math:`y`-axis in another, if you choose to draw your coordinate system differently. But the vector doesn't know about your arbitrary choice of how and where you draw your coordinate system. When we have multiple reference frames, it's important how the coordinates would transform between them.
es: Mientras que los operadores (tales como :math:`e^{\varphi \boldsymbol n \cdot \boldsymbol J}` ) y los vectores :math:`\boldsymbol v` están "ahí fuera" y son independientes del marco de referencia, sus coordenadas no lo son. Por ejemplo, un vector puede alinearse con el eje :math:`x` en algún cuadro mientras que en otro puede alinearse con el eje :math:`y` en otro si decides dibujar tu sistema de coordenadas de forma diferente. Pero el vector no sabe acerca de tu elección arbitraria de cómo y dónde dibujar tu sistema de coordenadas. Cuando tenemos múltiples marcos de referencia, es importante cómo se transforman las coordenadas entre ellos.

source: For example, if you know that the coordinates of a vector :math:`\boldsymbol v` are given as :math:`v_x, v_y, v_z` in some reference frame, you can obtain the coordinates in a different frame which is rotated which respect to the first one around some :math:`\boldsymbol n` axis by :math:`-\varphi` as
es: Por ejemplo, si sabes que las coordenadas de un vector :math:`\boldsymbol v` se dan como :math:`v_x, v_y, v_z`en algún marco de referencia, puedes obtener las coordenadas en un marco diferente que es girado con respecto al primero alrededor de algún :math:`\boldsymbol n` eje por :math:`-\varphi` como

source: where primed coordinates correspond to coordinates in the rotated *frame*. You can also transform the matrix representations of operators. For example, :math:`M_{ij} = \boldsymbol e_i \cdot M \boldsymbol e_j` but what is the rotation matrix if we used the basis vectors of a different frame :math:`\{\boldsymbol e_i'\}`? To obtain the matrix representation of :math:`M` in the new frame, you can do
es: donde las coordenadas primarias corresponden a las coordenadas en el *cuadro* girado. También se pueden transformar las representaciones matriciales de los operadores. Por ejemplo, :math:`M_{ij} = \boldsymbol e_i \cdot M \boldsymbol e_j` pero cual es la matriz de rotación si usamos los vectores base de un marco diferente :math:`\{\boldsymbol e_i'\}`? Para obtener la representación matricial de :math:`M` en el nuevo marco se puede hacer lo siguiente

source: These are called passive transformations.
es: Estas se llaman transformaciones pasivas.

source: Now let's consider actually moving those objects (we consider only one reference frame and it's fixed). We rotate a vector around some :math:`\boldsymbol n` axis by :math:`\varphi`
es: Ahora consideremos mover estos objetos (tenemos en cuenta sólo un marco de referencia y está fijo). Giramos un vector alrededor de un eje del :math:`\boldsymbol n` por el eje :math:`\varphi`

source: where primed coordinates are the coordinates of the rotated *vector*, in the same reference frame. Similarly, for matrices
es: donde las coordenadas de cebado son las coordenadas del *vector* rotado, en el mismo sistema de referencia. Del mismo modo, para las matrices

source: These are called active transformations.
es: Estas se llaman transformaciones activas.

source: Note how things fit nicely, for example, when you consider how a rotated vector :math:`R_0 \boldsymbol v_0` transforms:
es: Nota cómo las cosas encajan perfectamente, por ejemplo, cuando consideras cómo se transforma un vector rotado :math:`R_0 \boldsymbol v_0`:

source: The left hand side is rotation of the vector :math:`(R_0 \boldsymbol v_0)` and the right hand side is the rotation of the vector :math:`v_0` and the matrix :math:`R_0` that acts on it, which of course agree.
es: El lado izquierdo es la rotación del vector :math:`(R_0 \boldsymbol v_0)` y el lado derecho es la rotación del vector :math:`v_0` y la matriz :math:`R_0` que actúa sobre él, lo que por supuesto está en consonancia.

source: The rotation operator itself rotates in a expected way (you can use Rodrigues' formula along with the equation above, if you prefer):
es: El propio operador de rotación rota de una manera esperada (si lo prefieres, puedes usar la fórmula de Rodrigues junto con la ecuación anterior):

source: For example, if we have a rotation around the :math:`z`-axis by :math:`\varphi_0 = \varphi_z` and we would like to rotate it around the :math:`x`-axis by :math:`\varphi = \pi/2`, we'd have
es: Por ejemplo, si tenemos una rotación alrededor del eje :math:`z` por :math:`\varphi_0 = \varphi_z` y nos gustaría rotarlo alrededor del eje :math:`x` por :math:`\varphi = \pi/2`, tendríamos que

source: that is, the original rotation axis :math:`\boldsymbol n_0 = \boldsymbol e_z` gets rotated around the :math:`x`-axis by :math:`\varphi = \pi/2` and becomes a rotation around the :math:`y`-axis by :math:`-\varphi_z`.
es: es decir, el eje de rotación original :math:`\boldsymbol n_0 = \boldsymbol e_z` se rota alrededor del eje :math:`x` por :math:`\varphi = \pi/2` y se convierte en una rotación alrededor del :math:`y`-axis by :math:`-\varphi_z`.
