Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/rotations.po
Languages: es

source: Rotations
es: Rotaciones

source: In the context of 3D transforms, rotations are the nontrivial and complicated part. While it is possible to describe 3D rotations using geometrical drawings and derive the rotation matrices, which is what most people would be more familiar with, it offers a limited picture, and fails to give any insight on related practical things such quaternions and SLERP. For this reason, this document takes a different approach, a general (although a little abstract at first) approach which was popularized by its extensive use in local gauge theories in physics. That being said, the aim of this text is to provide a minimal background to understand 2D and 3D rotations in a general way and shed light on practical things such as gimbal lock, quaternions and SLERP using an accessible language for programmers, and not completeness or mathematical rigor.
es: En el contexto de las transformaciones 3D, las rotaciones son la parte no trivial y complicada. Mientras que es posible describir rotaciones 3D usando dibujos geométricos y derivar las matrices de rotación, que es con lo que la mayoría de la gente estaría más familiarizada, ofrece una imagen limitada, y no da ninguna idea de las cosas prácticas relacionadas tales como cuaterniones y SLERP. Por esta razón, este documento adopta un enfoque diferente, un enfoque general (aunque un poco abstracto al principio) que fue popularizado por su uso extensivo en las teorías de los indicadores locales en física. Dicho esto, el objetivo de este texto es proporcionar una base mínima para entender las rotaciones 2D y 3D de una manera general y arrojar luz sobre cosas prácticas como el bloqueo del cardán, los cuaterniones y SLERP utilizando un lenguaje accesible para los programadores, y no la integridad o el rigor matemático.

source: A crash course in Lie groups and algebras for programmers
es: Un curso intensivo en grupos de Lie y álgebra para programadores

source: Lie groups is a branch of mathematics which deals with rotations in a systematic way. While it is a extensive subject and most programmers haven't even heard of it, it is relevant in game development, because it provides a coherent and unified view of 3D rotations.
es: Los grupos de Lie son una rama de las matemáticas que se ocupa de las rotaciones de manera sistemática. Aunque es un tema extenso y la mayoría de los programadores ni siquiera han oído hablar de él, es relevante en el desarrollo de juegos, porque proporciona una visión coherente y unificada de las rotaciones 3D.

source: So let's start with small steps. Suppose that you want to make a tiny rotation around some axis. For, concreteness let's say around :math:`z`-axis by an infinitesimal angle :math:`\delta\theta`. For small angles, as illustrated in the figure, the rotation operator can be written as :math:`R_z(\delta\theta) = I + \delta \theta \boldsymbol e_z \times` (neglecting higher order terms :math:`\mathcal O(\delta\theta^2)` ) where :math:`I` is identity operator and :math:`\boldsymbol e_z` is a unit vector along the :math:`z`-axis, such that a vector :math:`\boldsymbol v` becomes
es: Así que empecemos con pequeños pasos. Imaginemos que queremos hacer una pequeña rotación alrededor de algún eje. Para concretar, digamos alrededor del eje :math:`z` por un ángulo infinitesimal `:math:`\delta\theta`. Para ángulos pequeños, como se ilustra en la figura, el operador de rotación puede escribirse como :math:`R_z(\delta\theta) = I + \delta \theta \boldsymbol e_z \times`donde :math:`I` es operador de identidad y :math:`\boldsymbol e_z` es un vector unitario a lo largo del eje :math:`z`, de manera que un vector :math:`\boldsymbol v` se convierte en

source: (If this isn't clear, you can verify this by looking at the figure: :math:`\boldsymbol v` is rotated into :math:`\boldsymbol v'` in the plane (so the rotation axis :math:`\boldsymbol e_z` is pointing out of screen). The overlap of two vectors is :math:`\boldsymbol v \cdot \boldsymbol v' = v^2\cos\delta\theta \approx v^2 + \mathcal O(\delta\theta^2)` since the rotation is just a tiny amount, so the part of :math:`\boldsymbol v'` parallel to :math:`\boldsymbol v` is indeed :math:`\boldsymbol v`. Here, :math:`v = |\boldsymbol v|`. What about the perpendicular part, which must be :math:`\boldsymbol v' - \boldsymbol v`? Using the right-hand rule, the direction is :math:`\boldsymbol e_z \times \boldsymbol v/v`, and to the first order in :math:`\delta\theta`, we can approximate the length of the difference vector by the arc length (blue arc in the figure) which is :math:`\delta \theta v`, so the perpendicular component :math:`\delta \theta \boldsymbol e_z \times \boldsymbol v` also checks out.)
es: (Si esto no está claro, puedes verificar esto mirando la figura: :math:`\boldsymbol v` es rotado dentro de :math:`\boldsymbol v'` en el plano (así que el eje de rotación :math:`\boldsymbol e_z` está apuntando fuera de la pantalla). La superposición de dos vectores es :math:`\boldsymbol v \cdot \boldsymbol v' = v^2\cos\delta\theta \approx v^2 + \mathcal O(\delta\theta^2)` ya que la rotación es muy reducida, así que la parte de :math:`\boldsymbol v'`paralela a :math:`\boldsymbol v` es en realidad :math:`\boldsymbol v`. Aquí,:math:`v = |\boldsymbol v|`. ¿Qué hay de la parte perpendicular, que debe ser :math:`\boldsymbol v' - \boldsymbol v`? Usando la regla de la mano derecha, la dirección es :math:`\boldsymbol e_z \times \boldsymbol v/v`, y de primer orden en :math:`\delta\theta`, podemos aproximar la longitud del vector de diferencia por la longitud del arco (arco azul en la figura) que es :math:`\delta \theta v` así que el componente perpendicular :math:`\delta \theta \boldsymbol e_z \times \boldsymbol v` también es comprobado.)

source: Now, a practical way of representing operators is by using matrices (note that an `operator <https://en.wikipedia.org/wiki/Operator_(mathematics)>`_ is not a matrix, and there are different mathematical objects other than matrices which be used to represent operators, such as quaternions, a point which we will come back to later when we're discussing `representations <https://en.wikipedia.org/wiki/Group_representation>`_ . In terms of real :math:`3 \times 3` matrices, the identity operator :math:`I` simply corresponds to a :math:`3 \times 3` identity matrix, and the cross product :math:`\boldsymbol e_z \times` can be represented as
es: Ahora, una forma práctica de representar operadores es usando matrices (note que un `operador <https://en.wikipedia.org/wiki/Operator_(mathematics)>`_ no es una matriz, y hay diferentes objetos matemáticos aparte de las matrices que se usan para representar operadores, tales como cuaterniones, un punto al cual volveremos más tarde cuando estemos discutiendo `representaciones <https://en.wikipedia.org/wiki/Group_representation>``_. En términos de matrices reales de :matemáticas:`3 \por 3`, el operador de identidad :math:`I` simplemente corresponde a un :math:`3 \times 3` matriz de identidad, y el producto cruzado :math:`\boldsymbol e_z \times` puede representarse como

source: (If you're curious how you can find the matrix representation of an operator :math:`A` in some set of real basis :math:`\{ \boldsymbol e_i\}`: the matrix element on :math:`i` th row :math:`j` th column is given by :math:`\boldsymbol e_i \cdot (A \boldsymbol e_j)`; the basis we use here is :math:`\{ \boldsymbol e_x, \boldsymbol e_y, \boldsymbol e_z \}`) It is no accident that :math:`J_z` rotates a vector in the :math:`xy` plane around the :math:`z`-axis by :math:`\pi/2`; for an arbitrary axis :math:`\boldsymbol n`, the operator :math:`J_n \cong \boldsymbol n \times` is a rotation by :math:`\pi/2` around that axis for vectors in the plane perpendicular to :math:`\boldsymbol n`.
es: (Si tienes curiosidad por saber cómo encontrar la representación matricial de un operador :math:`A` en algún tipo de base real :math:`\{ \boldsymbol e_i\}`: el elemento matriz en :math:`i` fila anterior :math:`j` esta columna viene dada por :math:`\boldsymbol e_i \cdot (A \boldsymbol e_j)`; la base que usamos aquí es :math:`\{ \boldsymbol e_x, \boldsymbol e_y, \boldsymbol e_z \}`) No es casualidad que :math:`J_z` rotará un vector en el plano :math:`xy` alrededor del eje :math:`z` por :math:`\pi/2`; para un eje arbitrario :math:`\boldsymbol n` el operador :math:`J_n \cong \boldsymbol n \times` es rotado por :math:`\pi/2` alrededor de ese eje para vectores en el plano perpendicular a :math:`\boldsymbol n`.

source: In terms of :math:`J_z`, we can express the infinitesimal rotation operator around the :math:`z`-axis as
es: En términos de :math:`J_z`, podemos expresar el operador de rotación infinitesimal alrededor del eje :math:`z` como

source: So, how about finite rotations? We simply can apply this infinitesimal rotation operator :math:`N` times to obtain a finite rotation :math:`\theta \equiv N \delta \theta`:
es: Entonces, ¿qué tal rotaciones finitas? Simplemente podemos aplicar este operador de rotación infinitesimal :math:`N` veces para obtener una rotación finita :math:`\theta \equiv N \delta \theta`:

source: (If you're confused about seeing a matrix as an exponent: the meaning of an operator :math:`A` in `exponential map <https://en.wikipedia.org/wiki/Exponential_map_(Lie_theory)>`_ is given by its series expansion as :math:`e^A = 1 + A + A^2/2! + \ldots` ). This is arguably the most important relation in this write up, and lies at the heart of Lie groups, whose significance will be clarified in a moment. But first, let's take step back and observe the significance of this result: using a simple picture of an infinitesimal rotation, we derived a general expression for arbitrary rotations around the :math:`z`-axis. In fact, this gets even better. If we repeated the same analysis for rotations around :math:`x`- and :math:`y`-axes, we would have obtained similar results :math:`e^{\theta J_x}` and :math:`e^{\theta J_y}` respectively, where
es: (Si estás confundido acerca de ver una matriz como un exponente: el significado de un operador :math:`A` en un `mapa exponencial <https://en.wikipedia.org/wiki/Exponential_map_(Lie_theory)>`_ está dado por la expansión de su serie como :math:`e^A = 1 + A + A^2/2! + \ldots` ). Esta es posiblemente la relación más importante en este artículo, y se sitúa en el corazón de los grupos de Mentiras, cuyo significado será aclarado próximamente. Pero primero, demos un paso atrás y observemos el significado de este resultado: usando una simple imagen de una rotación infinitesimal, derivamos una expresión general para rotaciones arbitrarias alrededor del eje :math:`z`. De hecho, esto se pone aún mejor. Si hubiéramos repetido el mismo análisis para rotaciones alrededor de los ejes :math:`x` y :math:`y`, habríamos obtenido resultados similares a :math:`e^{\theta J_y}` y :math:`e^{\theta J_y}` respectivamente, donde

source: Or, if we did a rotation around an arbitrary axis :math:`\boldsymbol n`, the result would have been
es: O, si hubiéramos hecho una rotación alrededor de un eje arbitrario :math:`\boldsymbol n`, el resultado habría sido

source: where :math:`\boldsymbol J = (J_x, J_y, J_z)`. Note how the rotation axis :math:`\boldsymbol n` and rotation angle :math:`\theta` plays a central role in the final expression. Axis-angle is *the* parametrization for *all* Lie groups, not just 3D rotations. (We will come back to this point later when we're discussing Euler angle parametrization, which is an unnatural and defective parametrization of rotations in 3D.)
es: donde :math:`\boldsymbol J = (J_x, J_y, J_z)`. Observa cómo el eje de rotación :math:`\boldsymbol n` y el ángulo de rotación :math:`\theta` juegan un papel central en la expresión final. Eje-ángulo es *la* parametrización para *todos* los grupos de Lie, no sólo las rotaciones 3D. (Volveremos a este punto más adelante cuando discutamos la parametrización del ángulo de Euler, que es una parametrización antinatural y defectuosa de las rotaciones en 3D.)

source: If you ever tried to derive the rotation matrix corresponding to a :math:`\theta` rotation around :math:`\boldsymbol n`, you can appreciate the simplicity and elegance of how we obtained this result. To be fair, we still need to figure out how to actually use an operator sitting on top of an exponent (by summing up the Taylor series), of course, but that's merely a "programmatic" labor and you just need to follow the finite multiplication table of :math:`J_i` operators. But this is much straightforward than trying to draw geometric diagrams and angles and figure out the rotation matrix. For the particular case of the algebra corresponding to rotations in 3D Euclidean space that we've been talking about so far, the exponent can simply be written as
es: Si alguna vez has intentado derivar la matriz de rotación correspondiente a una rotación :math:`\theta` alrededor de :math:`\boldsymbol n`, puedes apreciar la simplicidad y elegancia de cómo obtuvimos este resultado. Para ser justos, todavía necesitamos averiguar cómo usar un operador situado encima de un exponente (resumiendo la serie de Taylor), por supuesto, pero eso es meramente una labor "programática" y sólo necesitamos seguir la tabla de multiplicación finita de operadores :math:`J_i`. Pero esto es mucho más sencillo que tratar de dibujar diagramas geométricos y ángulos y calcular la matriz de rotación. Para el caso particular del álgebra correspondiente a las rotaciones en el espacio Euclídeo 3D del que hemos estado hablando hasta ahora, el exponente puede escribirse simplemente como

source: which is known as Rodrigues' rotation formula. Note that we only ended up with terms up to second order in :math:`\boldsymbol n \cdot \boldsymbol J` when we summed the series expansion; the reason is higher powers can be reduced to 0th, 1st or 2nd order terms due to the relation :math:`(\boldsymbol n \cdot \boldsymbol J)^3 = -\boldsymbol n \cdot \boldsymbol J`, which makes summing up the series straightforward.
es: que se conoce como la fórmula de rotación de Rodrigues. Nótese que sólo terminamos con términos de segundo orden en :math:`\boldsymbol n \cdot \boldsymbol J` cuando sumamos la expansión de la serie; la razón es que las potencias superiores pueden ser reducidas a términos de 0º, 1er o 2º orden debido a la relación :math:`(\boldsymbol n \cdot \boldsymbol J)^3 = -\boldsymbol n \cdot \boldsymbol J`, lo que hace que resumir la serie sea sencillo.

source: The thing that sits on top of :math:`e`, which is a linear combination :math:`J_i` operators (where :math:`i = x,y,z`), forms an algebra; in fact, it forms a vector space whose basis "vectors" are :math:`J_i`. Furthermore, the algebra is closed under the Lie bracket (which is essentially a commutator: :math:`[a,b] = a b - ba`, and is something like a cross-product in this vector space). In the particular case of 3D rotations, this "multiplication table" is :math:`[J_x, J_y] = J_z` and its cyclic permutations :math:`x\to y, y\to z, z\to x`.
es: Lo que se encuentra encima de los operadores :math:`e`, que es una combinación lineal :math:`J_i` (donde :math:`i = x,y,z`), forma un álgebra; de hecho, forma un espacio vectorial cuyos "vectores" base son :math:`J_i`. Además, el álgebra se cierra bajo el corchete de Lie (que es esencialmente un conmutador: :math:`[a,b] = a b - ba`, y es algo así como un producto cruzado en este espacio vectorial). En el caso particular de las rotaciones 3D, esta "tabla de multiplicación" es :math:`[J_x, J_y] = J_z` and its cyclic permutations :math:`x\to y, y\to z, z\to x`.

source: Rotations form what is called a `group <https://en.wikipedia.org/wiki/Group_(mathematics>`_: simply put, it means that if you combine two rotations, you get another rotation. And you can observe it here too: when you put an element of the Lie algebra (which are simply linear combinations of :math:`J_i` ) on top of :math:`e`, you get what is called a Lie group, and the Lie algebra is said to *generate* the Lie group. For example, the operator :math:`J_z \equiv \boldsymbol e_z \times` is said to *generate* the rotations around the :math:`z`-axis. The group of rotations in the 3D Euclidean space is called SO(3).
es: Las rotaciones forman lo que se llama un `grupo <https://es.wikipedia.org/wiki/Grupo_(matem%C3%A1tica)>`_: en pocas palabras, significa que si combinas dos rotaciones, obtienes otra rotación. Y puedes observarlo aquí también: cuando pones un elemento del álgebra de Lie (que son simplemente combinaciones lineales de :math:`J_i`) encima de :math:`e`, obtienes lo que se llama un grupo de Lie, y se dice que el álgebra de Lie *genera* el grupo de Lie. Por ejemplo, se dice que el operador :math:`J_z \equiv \boldsymbol e_z \times` *genera* las rotaciones alrededor del eje `z`. El grupo de rotaciones en el espacio euclídeo 3D se llama SO(3).

source: The order of rotations in 2D don't matter: you can first rotate by :math:`\pi` and rotate by :math:`\pi/2`, or do it in reverse order, and either way, the result is a rotation by :math:`3 \pi/2` in the plane. But the order of rotations in 3D do matter, in general, when different rotation axes are involved (see `this picture <https://i.stack.imgur.com/6vvFi.png>`_ for an example) (rotations around the same axes do commute, of course). When the ordering of group elements don't matter, that group is said to be Abelian, and non-Abelian otherwise. SO(2) is an Abelian group, and SO(3) is a non-Abelian group.
es: El orden de rotaciones en 2D no importa: primero puedes rotar por :math:`\pi` y rotar por :math:`\pi/2`, o hacerlo en orden inverso, y de cualquier manera, el resultado es una rotación por :math:`3 \pi/2` en el plano. Pero el orden de las rotaciones en 3D importa, en general, cuando se trata de diferentes ejes de rotación (ver `esta imagen <https://i.stack.imgur.com/6vvFi.png>`_ para un ejemplo) (las rotaciones alrededor de los mismos ejes viajan, por supuesto). Cuando el orden de los elementos del grupo no importa, se dice que ese grupo es abeliano, y de otra manera no abeliano. SO(2) es un grupo abeliano, y SO(3) es un grupo no-abeliano.

source: Lie groups and algebras are *not* matrices. You can *represent* both by using object which emulate their "multiplication" rules: this can be real or complex matrices of varying dimensions, or something like quaternions. A single Lie group/algebra have infinitely many different representations in vector spaces in different dimensions (see `these <https://en.wikipedia.org/wiki/Rotation_group_SO(3)#A_note_on_Lie_algebra>`_ for example for SO(3)). Above, we use the 3D real representation of SO(3), which happens to be the fundamental representation, and accidentally coincides with the adjoint representation.
es: Los grupos de Lie y las algebras *no* son matrices. Se pueden *representar* ambos usando objetos que emulen sus reglas de "multiplicación": pueden ser matrices reales o complejas de dimensiones variables, o algo así como cuaterniones. Un solo grupo de Lie/álgebra tiene infinitamente muchas representaciones diferentes en espacios vectoriales de diferentes dimensiones (ver `esto <https://en.wikipedia.org/wiki/Rotation_group_SO(3)#A_note_on_Lie_algebra>`_ por ejemplo para SO(3)). Arriba, utilizamos la representación real 3D de SO(3), que resulta ser la representación fundamental, y coincide accidentalmente con la representación adjunta.

source: Some mathematical remarks (feel free to skip)
es: Algunos comentarios matemáticos (siéntete libre de omitirlos)

source: There are many different Lie groups, corresponding to different symmetries, and they all have different names. For example, the group which contains all rotations in :math:`n`-dimensional Euclidean space is called SO(:math:`n`), and has :math:`n (n-1)/2` linearly independent generators (yes, Lie groups can handle rotations is higher dimensions as-is, and even in non-Euclidean ones). This is called the *rank* of the Lie algebra. You can think of the generators as independent axes of rotations. For 2D, we can only rotate in the :math:`xy` plane meaning we have only 1 generator. For 3D, you can rotate around 3 different planes/axes.
es: Hay muchos grupos de Lie diferentes, que corresponden a diferentes simetrías, y todos tienen diferentes nombres. Por ejemplo, el grupo que contiene todas las rotaciones en el espacio euclidiano :math:`n`-dimensional se llama SO(:math:`n`), y tiene :math:`n (n-1)/2` generadores linealmente independientes (sí, los grupos de Lie pueden manejar rotaciones de dimensiones más altas tal cual, e incluso en los no euclidianos). Esto se llama el *rango* del álgebra de Lie. Se puede pensar en los generadores como ejes de rotación independientes. Para 2D, sólo podemos rotar en el plano :math:`xy` lo que significa que sólo tenemos 1 generador. Para 3D, se puede rotar alrededor de 3 planos/ejes diferentes.

source: Lie groups have deep connections with symmetries, and have played central role in theoretical physics since around mid 20th century.
es: Los grupos de Lie tienen profundas conexiones con las simetrías y han jugado un papel central en la física teórica desde mediados del siglo XX.

source: For example, if something is symmetric under 3D rotation, that something (in physics, it is typically Lagrangian, which leads to conservation laws through Noether's theorem) remains invariant under SO(3) transformations (we will cover transformations below).
es: Por ejemplo, si algo es simétrico bajo rotación 3D, ese algo (en física, es típicamente lagrangiano, lo que lleva a las leyes de conservación a través del teorema de Noether) permanece invariable bajo las transformaciones SO(3) (cubriremos las transformaciones a continuación).

source: In the context of Lie groups and group theory in general, some common words have specific meanings and a part of the math jargon: representation, generator, group, algebra, parametrization, operator are such words. You don't need to know their precise definitions to understand this write up; just be aware that they are special terms and may not mean what you think they mean. All of these terms a described in this write up in a colloquial language.
es: En el contexto de los grupos de Lie y la teoría de grupos en general, algunas palabras comunes tienen significados específicos y una parte de la jerga matemática: representación, generador, grupo, álgebra, parametrización, operador son tales palabras. No es necesario que conozcas sus definiciones precisas para entender esta redacción; sólo ten en cuenta que son términos especiales y pueden no significar lo que crees que significan. Todos estos términos se describen en este artículo en un lenguaje coloquial.

source: Representation of rotations
es: Representación de rotaciones

source: Representation of rotations is an independent concept from parametrization of rotations. These two concepts are commonly conflated, which leads to the current state of confusion among many programmers. People tend to associate Euler angles parametrization with matrices (or sometimes even vectors!), and axis-angle parametrization with quaternions.
es: La representación de rotaciones es un concepto independiente de la parametrización de rotaciones. Estos dos conceptos son comúnmente mezclados, lo que lleva al estado actual de confusión entre muchos programadores. La gente tiende a asociar la parametrización de los ángulos de Euler con matrices (¡o a veces incluso con vectores!), y la parametrización del eje-ángulo con cuaterniones.
