Repository: 2dogtwo/godot-docs-zhcn
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/vector_math.po
Languages: ru, zh_cn

source: Vector math
ru: Векторная алгебра
zh_cn: 向量数学

source: Introduction
ru: Введение
zh_cn: 简介

source: This tutorial is a short and practical introduction to linear algebra as it applies to game development. Linear algebra is the study of vectors and their uses. Vectors have many applications in both 2D and 3D development and Godot uses them extensively. Developing a good understanding of vector math is essential to becoming a strong game developer.
ru: Этот урок - короткое и практичное введение в линейную алгебру, применяемую в разработке игр. Линейная алгебра изучает векторы и их использование. Векторы могут применяться в 2D и 3D разработке и Godot использует их интенсивно. Разработчику игр требуется хорошее понимание векторной алгебры чтобы стать сильным в этой области.
zh_cn: 本教程是一个简短而实用的线性代数介绍，因为它适用于游戏开发。线性代数是研究向量及其用途的学科。向量在二维和三维开发中都有许多应用，Godot对它们的应用非常广泛。要成为一名优秀的游戏开发者，对向量数学的理解是必不可少的。

source: This tutorial is **not** a formal textbook on linear algebra. We will only be looking at how it is applied to game development. For a broader look at the mathematics, see https://www.khanacademy.org/math/linear-algebra
ru: Этот урок **не** обычная книга по линейной алгебре. Мы рассмотрим только то что применяется в разработке игр. Для более широкого взгляда на математику, смотрите https://www.khanacademy.org/math/linear-algebra
zh_cn: 本教程 **不是** 线性代数的正式教科书。我们将只关注它如何应用于游戏开发。要更全面地了解数学，请参见 https://www.khanacademy.org/math/linear-algebra

source: Coordinate systems (2D)
ru: Системы координат (2D)
zh_cn: 坐标系统(2D)

source: In 2D space, coordinates are defined using a horizontal axis (``x``) and a vertical axis (``y``). A particular position in 2D space is written as a pair of values such as ``(4, 3)``.
ru: В 2D пространстве, координаты определены использованием горизонтальной оси (``x``) и вертикальной оси (``y``). Определённая позиция в 2D пространстве записывается как пара значений, таких как ``(4, 3)``.
zh_cn: 在2D空间中，使用水平轴(``x``)和垂直轴(``y``)定义坐标。2D空间中的特定位置被写成一对值，如``(4, 3)``。

source: If you're new to computer graphics, it might seem odd that the positive ``y`` axis points **downwards** instead of upwards, as you probably learned in math class. However, this is common in most computer graphics applications.
ru: Если вы новичок в компьютерной графике, вам может показаться странным, что положительная ось ``y`` указывает **вниз**, а не вверх, как вас учили в школе. Тем не менее, в приложениях компьютерной графики это встречается повсеместно.
zh_cn: 如果您是计算机图形学的新手，您可能会觉得很奇怪， ``y`` 轴的正方向是 **向下**，而不是向上(您在数学课上学到的就像那样)。然而，这在大多数计算机图形应用程序中是常见的。

source: Any position in the 2D plane can be identified by a pair of numbers in this way. However, we can also think of the position ``(4, 3)`` as an **offset** from the ``(0, 0)`` point, or **origin**. Draw an arrow pointing from the origin to the point:
ru: Любая точка на 2D плоскости может быть таким образом определена парой чисел. Вы также можете рассматривать ``(4, 3)`` как **смещение** от точки ``(0, 0)``, или точки **начала** координат. Нарисуем стрелку от начала координат до заданной точки:
zh_cn: 二维平面上的任何位置都可以用一对数字来表示。然而，我们也可以将位置 ``(4, 3)`` 看作是从 ``(0, 0)`` 点或 **原点** 出发的 **偏移** 。画一个箭头从原点指向点:

source: This is a **vector**. A vector represents a lot of useful information. As well as telling us that the point is at ``(4, 3)``, we can also think of it as an angle ``θ`` and a length (or magnitude) ``m``. In this case, the arrow is a **position vector** - it denotes a position in space, relative to the origin.
ru: Это **вектор**. Вектор предоставляет множество полезной информации. Помимо сообщения нам, что точка расположена в ``(4, 3)``, мы можем также представить это в виде угла ``θ`` и длины (величины, модуля) ``m``. В данном примере стрелка — это **вектор позиции** — он обозначает позицию в пространстве относительно начала координат.
zh_cn: 这是一个 **向量** 。向量表示许多有用的信息。除了告诉我们点在 ``(4, 3)`` 之外，我们还可以把它看成角度 ``θ`` 和长度(或幅度) ``m``。在这种情况下，箭头是一个 **位置向量** -它表示空间中相对于原点的位置。

source: A very important point to consider about vectors is that they only represent **relative** direction and magnitude. There is no concept of a vector's position. The following two vectors are identical:
ru: При рассмотрении векторов крайне важно иметь в виду, что они представляют только **относительные** направление и величину (модуль). Вектору нельзя приписать определённой позиции. Два следующих вектора идентичны:
zh_cn: 关于向量，需要考虑的一个重要点是它们仅表示 **相对** 方向和大小。没有一个向量的位置的概念。以下两个向量相同:

source: Both vectors represent a point 4 units to the right and 3 units below some starting point. It does not matter where on the plane you draw the vector, it always represents a relative direction and magnitude.
ru: Оба вектора представляют точку 4 единицами правее и 3 единицами ниже стартовой точки. Неважно, где на плоскости вы нарисуете вектор, он всегда представляет относительное направление и величину.
zh_cn: 这两个向量都表示向右4个单位，在某个起始点以下3个单位。不管您在平面上画哪个向量，它总是代表一个相对的方向和大小。

source: Vector operations
ru: Операции над векторами
zh_cn: 向量运算

source: You can use either method (x and y coordinates or angle and magnitude) to refer to a vector, but for convenience, programmers typically use the coordinate notation. For example, in Godot, the origin is the top-left corner of the screen, so to place a 2D node named ``Node2D`` 400 pixels to the right and 300 pixels down, use the following code:
ru: Вы можете применять любой из методов (задание координат x и y или угла с длиной) для определения вектора, но обычно программисты используют координаты. Для примера, в Godot начало координат — это верхний-левый угол экрана, так что для перемещения 2D ноды с именем ``Node2D`` на 400 пикселей вправо и 300 вниз используйте следующий код:

source: Godot supports both :ref:`Vector2 <class_Vector2>` and :ref:`Vector3 <class_Vector3>` for 2D and 3D usage, respectively. The same mathematical rules discussed in this article apply to both types.
ru: Godot поддерживает типы :ref:`Vector2 <class_Vector2>` и :ref:`Vector3 <class_Vector3>` для 2D и 3D соответственно. Математические правила, рассказанные в этой статье, применяются к обоим типам.

source: Member access
ru: Доступ к полям
zh_cn: 成员访问

source: The individual components of the vector can be accessed directly by name.
ru: К отдельным компонентам вектора можно обращаться непосредственно по имени.
zh_cn: 向量的各个组成部分可以直接通过名称访问。

source: Adding vectors
ru: Сложение векторов
zh_cn: 添加向量

source: When adding or subtracting two vectors, the corresponding components are added:
ru: Когда два вектора складываются или вычитаются, складываются соответствующие компоненты :
zh_cn: 当两个向量相加或相减时，相应的分量相加:

source: We can also see this visually by adding the second vector at the end of the first:
ru: Мы также можем посмотреть визуально на добавление второго вектора к концу первого:
zh_cn: 我们也可以通过在第一个向量的末尾加上第二个向量来直观地看到这一点:

source: Note that adding ``a + b`` gives the same result as ``b + a``.
ru: Отметьте что сложение ``a + b`` даёт такой же результат что и ``b + a``.
zh_cn: 注意，加法 ``a + b`` 和 ``b + a``得到的结果是一样的。

source: Scalar multiplication
ru: Скалярное перемножение
zh_cn: 标量乘法

source: Vectors represent both direction and magnitude. A value representing only magnitude is called a **scalar**.
ru: Векторы представляют направление и длину(магнитуду). Значение представленное только длиной называется **скаляром**.
zh_cn: 向量表示方向和幅度。仅表示幅值的值称为 **标量**。

source: A vector can be multiplied by a **scalar**:
ru: Вектор может быть умножен на **скаляр**:
zh_cn: 一个向量可以乘以一个标量:

source: Multiplying a vector by a scalar does not change its direction, only its magnitude. This is how you **scale** a vector.
ru: Умножение вектора на скаляр не меняет направление, только длину. Это как бы **увеличение** вектора.
zh_cn: 向量乘以标量不会改变它的方向，只会改变它的幅值。这就是缩放向量的方法。

source: Practical applications
ru: Практические применения
zh_cn: 实际应用

source: Let's look at two common uses for vector addition and subtraction.
ru: Давайте посмотрим на два обычных приёма использования для векторного сложения и вычитания.
zh_cn: 让我们看看向量加法和减法的两种常见用法。

source: Movement
ru: Движение
zh_cn: 移动

source: A vector can represent **any** quantity with a magnitude and direction. Typical examples are: position, velocity, acceleration, and force. In this image, the spaceship at step 1 has a position vector of ``(1,3)`` and a velocity vector of ``(2,1)``. The velocity vector represents how far the ship moves each step. We can find the position for step 2 by adding the velocity to the current position.
ru: Вектор может представлять **любую** длину и направление. Обычные примеры это: позиция, скорость, ускорение, и сила. На этом изображении, космический корабль на шаге 1 имеет вектор позиции ``(1,3)`` а вектор скорости ``(2,1)``. Вектор скорости представляет как далеко пойдёт корабль на каждом шаге. Вы можете найти его позицию на шаге 2 добавляя скорость к текущей позиции.
zh_cn: 向量可以表示具有大小和方向的任何量。典型的示例有:位置、速度、加速度和力。在这幅图像中，在第一步的飞船有一个位置向量为``(1,3)``和一个速度向量为``(2,1)``。速度向量表示船舶每一步移动的距离。通过将速度加到当前位置，我们可以求出步骤2的位置。

source: Velocity measures the **change** in position per unit of time. The new position is found by adding velocity to the previous position.
ru: Скорость вычисляет **изменение** позиции за единицу времени. Новая позиция находится добавление скорости к предыдущей позиции.
zh_cn: 速度测量单位时间内位置的变化。新的位置是通过在前一个位置上增加速度来找到的。

source: Pointing toward a target
ru: Направление в сторону цели
zh_cn: 指向一个目标

source: In this scenario, you have a tank that wishes to point its turret at a robot. Subtracting the tank's position from the robot's position gives the vector pointing from the tank to the robot.
ru: В этом примере, вы, управляя танком, хотите направить дуло на робота. Вычитание позиции танка из позиции робота, даёт вектор направленный от танка на робота.
zh_cn: 在这个场景中，您有一个坦克，希望它的炮塔指向机器人。从机器人的位置减去坦克的位置就得到了从坦克指向机器人的向量。

source: To find a vector pointing from ``A`` to ``B`` use ``B - A``.
ru: Для нахождения вектора направления от ``A`` до ``B`` используйте ``B - A``.
zh_cn: 要找到从 ``A`` 指向 ``B`` 的向量，请使用 ``B - A``。

source: Unit vectors
ru: Единичные векторы
zh_cn: 单位向量

source: A vector with **magnitude** of ``1`` is called a **unit vector**. They are also sometimes referred to as **direction vectors** or **normals**. Unit vectors are helpful when you need to keep track of a direction.
ru: Вектор с **длиной** равной 1, называется **единичным вектором**. Они также иногда называются **векторами направления** или **нормалями**. Единичные векторы полезны когда вам нужно сохранить трэк направления.
zh_cn: 一个 **大小** 为 ``1`` 的向量称为 **单位向量** 。它们有时也被称为 **方向向量** 或 **法线** 。当您需要跟踪一个方向时，单位向量是有用的。

source: Normalization
ru: Нормализация
zh_cn: 归一化

source: **Normalizing** a vector means reducing its length to ``1`` while preserving its direction. This is done by dividing each of its components by its magnitude. Because this is such a common operation, ``Vector2`` and ``Vector3`` provide a method for normalizing:
ru: **Нормализация** вектора означает приведение его длины к ``1`` с сохранением его направления. Это делается путем деления каждого из его компонентов на длину. Поскольку это такая распространенная операция, ``Vector2`` и ``Vector3`` предоставляют метод нормализации:

source: Because normalization involves dividing by the vector's length, you cannot normalize a vector of length ``0``. Attempting to do so will result in an error.
ru: Поскольку нормализация подразумевает деление на длину вектора, вы не можете нормализовать вектор с длиной равной ``0``. Попытка сделать это закончится ошибкой.
zh_cn: 因为归一化需要除以向量的长度，所以不能对长度为``0``的向量进行归一化。试图这样做会导致错误。

source: Reflection
ru: Отражение
zh_cn: 反射

source: A common use of unit vectors is to indicate **normals**. Normal vectors are unit vectors aligned perpendicularly to a surface, defining its direction. They are commonly used for lighting, collisions, and other operations involving surfaces.
ru: Обычный пример использования единичных векторов это определение **нормалей**. Векторы нормалей - это единичные векторы направленные перпендикулярно поверхности, определяющей их направление. Они обычно используются в обработке света, коллизий, и других операциях с поверхностями.
zh_cn: 单位向量的一种常见用法是表示 **法线** 。法向量是垂直于曲面的单位向量，定义了曲面的方向。它们通常用于照明、碰撞和涉及表面的其他操作。

source: For example, imagine we have a moving ball that we want to bounce off a wall or other object:
ru: Например, представьте что вы движете шар, который вы хотите отражать от стен или других объектов:
zh_cn: 例如，假设我们有一个移动的球，我们想从墙上或其他物体上弹回来:

source: The surface normal has a value of ``(0, -1)`` because this is a horizontal surface. When the ball collides, we take its remaining motion (the amount left over when it hits the surface) and reflect it using the normal. In Godot, the :ref:`Vector2 <class_Vector2>` class has a ``bounce()`` method to handle this. Here is a GDScript example of the diagram above using a :ref:`KinematicBody2D <class_KinematicBody2D>`:
ru: Нормаль поверхности имеет значение ``(0, -1)``, потому что это горизонтальная поверхность. Когда шар сталкивается, мы берём его оставшееся движение (количество, оставшееся, когда он касается поверхности) и отражаем его, используя нормаль. В Godot класс :ref:`Vector2 <class_Vector2>` имеет метод ``bounce()`` для обработки этого. Вот пример GDScript приведённой выше диаграммы с использованием :ref:`KinematicBody2D <class_KinematicBody2D>`:
zh_cn: 因为这是一个水平曲面，所以曲面法线的值为 ``(0, -1)`` 。当球碰撞时，我们取它的剩余运动(当它撞到表面时剩余的量)，用法线反射它。在Godot中， :ref:`Vector2 <class_Vector2>` 类有一个 ``bounce()`` 方法来处理这个问题。上图有一个使用 :ref:`KinematicBody2D <class_KinematicBody2D>` 的GDScript示例:

source: Dot product
ru: Скалярное произведение
zh_cn: 点乘

source: The **dot product** is one of the most important concepts in vector math, but is often misunderstood. Dot product is an operation on two vectors that returns a **scalar**. Unlike a vector, which contains both magnitude and direction, a scalar value has only magnitude.
ru: Результат **скалярного произведения** очень важный аспект в векторной алгебре, но его также часто плохо понимают. Скалярное произведение это операция над двумя векторами которая возвращает **скаляр**. В отличии от вектора, который содержит длину и направление, скаляр содержит только длину.
zh_cn: **点乘** 是向量数学中最重要的概念之一，但经常被误解。点乘是对两个向量的操作，它返回一个 **标量**。与同时包含大小和方向的向量不同，标量值只有大小。

source: The formula for dot product takes two common forms:
ru: Формула скалярного произведения имеет две распространённых формы:
zh_cn: 点乘公式有两种常见形式:

source: and
ru: и
zh_cn: 以及

source: However, in most cases it is easiest to use the built-in method. Note that the order of the two vectors does not matter:
ru: Также, в большинстве случаев лучше использовать встроенный метод. Обратите внимание, что порядок двух векторов не имеет значения:
zh_cn: 然而，在大多数情况下，使用内置方法是最容易的。注意，两个向量的顺序并不重要:

source: The dot product is most useful when used with unit vectors, making the first formula reduce to just ``cosθ``. This means we can use the dot product to tell us something about the angle between two vectors:
ru: Скалярное произведение очень полезно в использовании с единичными векторами, сокращая первую формулу до ``cosθ``. Это означает что мы можем использовать скалярное произведение чтобы получить угол между двумя векторами:
zh_cn: 当与单位向量一起使用时，点积是最有用的，使得第一个公式减少到仅有 ``cosθ``。这意味着我们可以使用点积来告诉我们关于两个向量之间的角度的一些信息:

source: When using unit vectors, the result will always be between ``-1`` (180°) and ``1`` (0°).
ru: Когда используются единичные вектора, результат будет всегда между ``-1`` (180°) и``1`` (0°).
zh_cn: 当使用单位向量,结果总是会在 ``-1`` (180°) 和 ``1`` (0°) 之间。

source: Facing
ru: Направление взгляда
zh_cn: 面向问题

source: We can use this fact to detect whether an object is facing toward another object. In the diagram below, the player ``P`` is trying to avoid the zombies ``A`` and ``B``. Assuming a zombie's field of view is **180°**, can they see the player?
ru: Мы можем использовать этот факт для обнаружения, что объект смотрит в направлении другого объекта. На диаграмме ниже, игрок ``P`` пытается избежать взгляда зомби ``A`` и ``B``. Могут ли зомби его увидеть если их угол обзора равен **180°** ?
zh_cn: 我们可以利用这个事实来检测一个物体是否面向另一个物体。在下图中，游戏角色 ``P`` 试图避开丧尸 ``A`` 和 ``B`` 。假设一个丧尸的视野是 **180°** , 他们能看到游戏角色吗?

source: The green arrows ``fA`` and ``fB`` are **unit vectors** representing the zombies' facing directions and the blue semicircle represents its field of view. For zombie ``A``, we find the direction vector ``AP`` pointing to the player using ``P - A`` and normalize it, however, Godot has a helper method to do this called ``direction_to``. If the angle between this vector and the facing vector is less than 90°, then the zombie can see the player.
ru: Зелёные стрелки ``fA`` и ``fB`` это **единичные векторы** представляющие направление взгляда зомби, а синий полукруг представляет их поле обзора. Для зомби ``A``, мы находим направление вектора ``AP`` указывающего на игрока с помошью ``P - A`` и нормализуем его, однако, Godot имеет вспомогательный метод для этого, называемый ``direction_to``. Если угол между этим вектором и вектором взгляда меньше 90°, то зомби может увидеть игрока.

source: In code it would look like this:
ru: В коде это бы выглядело как:
zh_cn: 在代码中是这样的:

source: Cross product
ru: Векторное произведение
zh_cn: 叉乘

source: Like the dot product, the **cross product** is an operation on two vectors. However, the result of the cross product is a vector with a direction that is perpendicular to both. Its magnitude depends on their relative angle. If two vectors are parallel, the result of their cross product will be a null vector.
ru: Также как и скалярное произведение, **векторное произведение** это операция над двумя векторами. Но в результате векторного произведения вы получаете вектор с направлением перпендикулярным обоим исходным векторам. Его длина зависит от их относительного угла. Если два вектора параллельны, в результате вы получите нулевой вектор.

source: The cross product is calculated like this:
ru: Векторное произведение вычисляется так:
zh_cn: 叉乘是这样计算的:

source: With Godot, you can use the built-in method:
ru: В Godot, вы можете использовать встроенный метод:
zh_cn: 使用Godot，您可以使用内置的方法:

source: In the cross product, order matters. ``a.cross(b)`` does not give the same result as ``b.cross(a)``. The resulting vectors point in **opposite** directions.
ru: В векторном произведении, порядок аргументов важен. ``a.cross(b)`` не даёт такого же результата что и ``b.cross(a)``. Получаемые векторы имеют **противоположные** направления.
zh_cn: 在叉乘中，顺序很重要。``a.cross(b)`` 和 ``b.cross(a)`` 的结果不一样。得到的向量指向相反的方向。

source: Calculating normals
ru: Расчитывание нормалей
zh_cn: 法线计算

source: One common use of cross products is to find the surface normal of a plane or surface in 3D space. If we have the triangle ``ABC`` we can use vector subtraction to find two edges ``AB`` and ``AC``. Using the cross product, ``AB x AC`` produces a vector perpendicular to both: the surface normal.
ru: Одно из применений для векторного произведения - это нахождение нормалей плоскости или поверхности в 3D пространстве. Если мы имеем треугольник ``ABC`` мы можем использовать векторное вычитание для нахождения граней ``AB`` и ``AC``. Используя векторное произведение, ``AB x AC`` возвращает вектор перпендикулярный обоим векторам: нормаль поверхности.
zh_cn: 叉乘的一种常用方法是在三维空间中求平面或曲面的表面法向量。如果我们有三角形 ``ABC`` 我们可以用向量减法找到两条边 ``AB`` 和 ``AC``。通过叉乘， ``AB x AC`` 得到一个垂直于这两个向量的向量:表面法向量。

source: Here is a function to calculate a triangle's normal:
ru: Здесь показана функция для вычисления нормали треугольника:
zh_cn: 下面是一个计算三角形法线的函数:

source: Pointing to a target
ru: Направление на цель
zh_cn: 指向目标

source: In the dot product section above, we saw how it could be used to find the angle between two vectors. However, in 3D, this is not enough information. We also need to know what axis to rotate around. We can find that by calculating the cross product of the current facing direction and the target direction. The resulting perpendicular vector is the axis of rotation.
ru: В скалярном произведении выше, мы видели как оно может использоваться для нахождения угла между двумя векторами. Однако для 3D этого недостаточно. Мы также должны знать вокруг какой оси нужно осуществлять вращение. Мы можем найти её выполняя векторное произведение текущего направления взгляда и направлением цели. В результате мы получим перпендикулярный вектор оси вращения.

source: More information
ru: Дополнительная информация
zh_cn: 更多信息

source: For more information on using vector math in Godot, see the following articles:
ru: Для большей информации об использовании векторной алгебры в Godot, смотрите следующие статьи:
zh_cn: 有关在Godot中使用向量数学的更多信息，请参阅以下文章:
